[
  {
    "id": "arXiv:2310.03032",
    "title": "Graph-enhanced Optimizers for Structure-aware Recommendation Embedding  Evolution",
    "abstract": "Embedding plays a critical role in modern recommender systems because they are virtual representations of real-world entities and the foundation for subsequent decision models. In this paper, we propose a novel embedding update mechanism, Structure-aware Embedding Evolution (SEvo for short), to encourage related nodes to evolve similarly at each step. Unlike GNN (Graph Neural Network) that typically serves as an intermediate part, SEvo is able to directly inject the graph structure information into embedding with negligible computational overhead in training. The convergence properties of SEvo as well as its possible variants are theoretically analyzed to justify the validity of the designs. Moreover, SEvo can be seamlessly integrated into existing optimizers for state-of-the-art performance. In particular, SEvo-enhanced AdamW with moment estimate correction demonstrates consistent improvements across a spectrum of models and datasets, suggesting a novel technical route to effectively utilize graph structure information beyond explicit GNN modules. ",
    "url": "https://arxiv.org/abs/2310.03032",
    "authors": [
      "Cong Xu",
      "Jun Wang",
      "Jianyong Wang",
      "Wei Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03033",
    "title": "Benchmarking Local Robustness of High-Accuracy Binary Neural Networks  for Enhanced Traffic Sign Recognition",
    "abstract": "Traffic signs play a critical role in road safety and traffic management for autonomous driving systems. Accurate traffic sign classification is essential but challenging due to real-world complexities like adversarial examples and occlusions. To address these issues, binary neural networks offer promise in constructing classifiers suitable for resource-constrained devices. In our previous work, we proposed high-accuracy BNN models for traffic sign recognition, focusing on compact size for limited computation and energy resources. To evaluate their local robustness, this paper introduces a set of benchmark problems featuring layers that challenge state-of-the-art verification tools. These layers include binarized convolutions, max pooling, batch normalization, fully connected. The difficulty of the verification problem is given by the high number of network parameters (905k - 1.7 M), of the input dimension (2.7k-12k), and of the number of regions (43) as well by the fact that the neural networks are not sparse. The proposed BNN models and local robustness properties can be checked at https://github.com/ChristopherBrix/vnncomp2023_benchmarks/tree/main/benchmarks/traffic_signs_recognition. The results of the 4th International Verification of Neural Networks Competition (VNN-COMP'23) revealed the fact that 4, out of 7, solvers can handle many of our benchmarks randomly selected (minimum is 6, maximum is 36, out of 45). Surprisingly, tools output also wrong results or missing counterexample (ranging from 1 to 4). Currently, our focus lies in exploring the possibility of achieving a greater count of solved instances by extending the allotted time (previously set at 8 minutes). Furthermore, we are intrigued by the reasons behind the erroneous outcomes provided by the tools for certain benchmarks. ",
    "url": "https://arxiv.org/abs/2310.03033",
    "authors": [
      "Andreea Postovan",
      "Mădălina Eraşcu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2310.03037",
    "title": "Quantum image edge detection based on eight-direction Sobel operator for  NEQR",
    "abstract": "Quantum Sobel edge detection (QSED) is a kind of algorithm for image edge detection using quantum mechanism, which can solve the real-time problem encountered by classical algorithms. However, the existing QSED algorithms only consider two- or four-direction Sobel operator, which leads to a certain loss of edge detail information in some high-definition images. In this paper, a novel QSED algorithm based on eight-direction Sobel operator is proposed, which not only reduces the loss of edge information, but also simultaneously calculates eight directions' gradient values of all pixel in a quantum image. In addition, the concrete quantum circuits, which consist of gradient calculation, non-maximum suppression, double threshold detection and edge tracking units, are designed in details. For a 2^n x 2^n image with q gray scale, the complexity of our algorithm can be reduced to O(n^2 + q^2), which is lower than other existing classical or quantum algorithms. And the simulation experiment demonstrates that our algorithm can detect more edge information, especially diagonal edges, than the two- and four-direction QSED algorithms. ",
    "url": "https://arxiv.org/abs/2310.03037",
    "authors": [
      "Wenjie Liu",
      "Lu Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Emerging Technologies (cs.ET)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2310.03044",
    "title": "scg-cli -- a Tool Supporting Software Comprehension via Extraction and  Analysis of Semantic Code Graph",
    "abstract": "We present scg-cli, a~command line tool facilitating software comprehension. The tool extracts semantic information about code structure and dependencies from the Java and Scala projects, and structures it as a~Semantic Code Graph (SCG), an information model underlying scg-cli. The SCG data, once written into a~portable, open protobuf-based format, can be used by the scg-cli command line tool to obtain project metrics, find the most critical code entities, and compute project partitionings. The results of this analysis and the SCG data can be exported for further investigation by external tools such as Gephi software (visualization) and, notably, as a Jupyter Notebook environment with helper APIs to enable advanced analysis of the project using data analytics methods. We explain functionalities of the scg-cli tool and demonstrate its capabilities by showing an example analysis of an open-source Java project commons-io. ",
    "url": "https://arxiv.org/abs/2310.03044",
    "authors": [
      "Krzysztof Borowski",
      "Bartosz Baliś"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2310.03088",
    "title": "Physics-Informed Neural Networks for Accelerating Power System State  Estimation",
    "abstract": "State estimation is the cornerstone of the power system control center since it provides the operating condition of the system in consecutive time intervals. This work investigates the application of physics-informed neural networks (PINNs) for accelerating power systems state estimation in monitoring the operation of power systems. Traditional state estimation techniques often rely on iterative algorithms that can be computationally intensive, particularly for large-scale power systems. In this paper, a novel approach that leverages the inherent physical knowledge of power systems through the integration of PINNs is proposed. By incorporating physical laws as prior knowledge, the proposed method significantly reduces the computational complexity associated with state estimation while maintaining high accuracy. The proposed method achieves up to 11% increase in accuracy, 75% reduction in standard deviation of results, and 30% faster convergence, as demonstrated by comprehensive experiments on the IEEE 14-bus system. ",
    "url": "https://arxiv.org/abs/2310.03088",
    "authors": [
      "Solon Falas",
      "Markos Asprou",
      "Charalambos Konstantinou",
      "Maria K. Michael"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.03111",
    "title": "Multi-modal Gaussian Process Variational Autoencoders for Neural and  Behavioral Data",
    "abstract": "Characterizing the relationship between neural population activity and behavioral data is a central goal of neuroscience. While latent variable models (LVMs) are successful in describing high-dimensional time-series data, they are typically only designed for a single type of data, making it difficult to identify structure shared across different experimental data modalities. Here, we address this shortcoming by proposing an unsupervised LVM which extracts temporally evolving shared and independent latents for distinct, simultaneously recorded experimental modalities. We do this by combining Gaussian Process Factor Analysis (GPFA), an interpretable LVM for neural spiking data with temporally smooth latent space, with Gaussian Process Variational Autoencoders (GP-VAEs), which similarly use a GP prior to characterize correlations in a latent space, but admit rich expressivity due to a deep neural network mapping to observations. We achieve interpretability in our model by partitioning latent variability into components that are either shared between or independent to each modality. We parameterize the latents of our model in the Fourier domain, and show improved latent identification using this approach over standard GP-VAE methods. We validate our model on simulated multi-modal data consisting of Poisson spike counts and MNIST images that scale and rotate smoothly over time. We show that the multi-modal GP-VAE (MM-GPVAE) is able to not only identify the shared and independent latent structure across modalities accurately, but provides good reconstructions of both images and neural rates on held-out trials. Finally, we demonstrate our framework on two real world multi-modal experimental settings: Drosophila whole-brain calcium imaging alongside tracked limb positions, and Manduca sexta spike train measurements from ten wing muscles as the animal tracks a visual stimulus. ",
    "url": "https://arxiv.org/abs/2310.03111",
    "authors": [
      "Rabia Gondur",
      "Usama Bin Sikandar",
      "Evan Schaffer",
      "Mikio Christian Aoi",
      "Stephen L Keeley"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2310.03125",
    "title": "Shielding the Unseen: Privacy Protection through Poisoning NeRF with  Spatial Deformation",
    "abstract": "In this paper, we introduce an innovative method of safeguarding user privacy against the generative capabilities of Neural Radiance Fields (NeRF) models. Our novel poisoning attack method induces changes to observed views that are imperceptible to the human eye, yet potent enough to disrupt NeRF's ability to accurately reconstruct a 3D scene. To achieve this, we devise a bi-level optimization algorithm incorporating a Projected Gradient Descent (PGD)-based spatial deformation. We extensively test our approach on two common NeRF benchmark datasets consisting of 29 real-world scenes with high-quality images. Our results compellingly demonstrate that our privacy-preserving method significantly impairs NeRF's performance across these benchmark datasets. Additionally, we show that our method is adaptable and versatile, functioning across various perturbation strengths and NeRF architectures. This work offers valuable insights into NeRF's vulnerabilities and emphasizes the need to account for such potential privacy risks when developing robust 3D scene reconstruction algorithms. Our study contributes to the larger conversation surrounding responsible AI and generative machine learning, aiming to protect user privacy and respect creative ownership in the digital age. ",
    "url": "https://arxiv.org/abs/2310.03125",
    "authors": [
      "Yihan Wu",
      "Brandon Y. Feng",
      "Heng Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.03142",
    "title": "Design and Optimization of Heterogeneous Coded Distributed Computing  with Nonuniform File Popularity",
    "abstract": "This paper studies MapReduce-based heterogeneous coded distributed computing (CDC) where, besides different computing capabilities at workers, input files to be accessed by computing jobs have nonuniform popularity. We propose a file placement strategy that can handle an arbitrary number of input files. Furthermore, we design a nested coded shuffling strategy that can efficiently manage the nonuniformity of file popularity to maximize the coded multicasting opportunity. We then formulate the joint optimization of the proposed file placement and nested shuffling design variables to optimize the proposed CDC scheme. To reduce the high computational complexity in solving the resulting mixed-integer linear programming (MILP) problem, we propose a simple two-file-group-based file placement approach to obtain an approximate solution. Numerical results show that the optimized CDC scheme outperforms other alternatives. Also, the proposed two-file-group-based approach achieves nearly the same performance as the conventional branch-and-cut method in solving the MILP problem but with substantially lower computational complexity that is scalable over the number of files and workers. For computing jobs with aggregate target functions that commonly appear in machine learning applications, we propose a heterogeneous compressed CDC (C-CDC) scheme to further improve the shuffling efficiency. The C-CDC scheme uses a local data aggregation technique to compress the data to be shuffled for the shuffling load reduction. We again optimize the proposed C-CDC scheme and explore the two-file-group-based low-complexity approach for an approximate solution. Numerical results show the proposed C-CDC scheme provides a considerable shuffling load reduction over the CDC scheme, and also, the two-file-group-based file placement approach maintains good performance. ",
    "url": "https://arxiv.org/abs/2310.03142",
    "authors": [
      "Yong Deng",
      "Min Dong"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2310.03147",
    "title": "Context-Based Tweet Engagement Prediction",
    "abstract": "Twitter is currently one of the biggest social media platforms. Its users may share, read, and engage with short posts called tweets. For the ACM Recommender Systems Conference 2020, Twitter published a dataset around 70 GB in size for the annual RecSys Challenge. In 2020, the RecSys Challenge invited participating teams to create models that would predict engagement likelihoods for given user-tweet combinations. The submitted models predicting like, reply, retweet, and quote engagements were evaluated based on two metrics: area under the precision-recall curve (PRAUC) and relative cross-entropy (RCE). In this diploma thesis, we used the RecSys 2020 Challenge dataset and evaluation procedure to investigate how well context alone may be used to predict tweet engagement likelihood. In doing so, we employed the Spark engine on TU Wien's Little Big Data Cluster to create scalable data preprocessing, feature engineering, feature selection, and machine learning pipelines. We manually created just under 200 additional features to describe tweet context. The results indicate that features describing users' prior engagement history and the popularity of hashtags and links in the tweet were the most informative. We also found that factors such as the prediction algorithm, training dataset size, training dataset sampling method, and feature selection significantly affect the results. After comparing the best results of our context-only prediction models with content-only models and with models developed by the Challenge winners, we identified that the context-based models underperformed in terms of the RCE score. This work thus concludes by situating this discrepancy and proposing potential improvements to our implementation, which is shared in a public git repository. ",
    "url": "https://arxiv.org/abs/2310.03147",
    "authors": [
      "Jovan Jeromela"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2310.03149",
    "title": "Attributing Learned Concepts in Neural Networks to Training Data",
    "abstract": "By now there is substantial evidence that deep learning models learn certain human-interpretable features as part of their internal representations of data. As having the right (or wrong) concepts is critical to trustworthy machine learning systems, it is natural to ask which inputs from the model's original training set were most important for learning a concept at a given layer. To answer this, we combine data attribution methods with methods for probing the concepts learned by a model. Training network and probe ensembles for two concept datasets on a range of network layers, we use the recently developed TRAK method for large-scale data attribution. We find some evidence for convergence, where removing the 10,000 top attributing images for a concept and retraining the model does not change the location of the concept in the network nor the probing sparsity of the concept. This suggests that rather than being highly dependent on a few specific examples, the features that inform the development of a concept are spread in a more diffuse manner across its exemplars, implying robustness in concept formation. ",
    "url": "https://arxiv.org/abs/2310.03149",
    "authors": [
      "Nicholas Konz",
      "Charles Godfrey",
      "Madelyn Shapiro",
      "Jonathan Tu",
      "Henry Kvinge",
      "Davis Brown"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.03156",
    "title": "FedHyper: A Universal and Robust Learning Rate Scheduler for Federated  Learning with Hypergradient Descent",
    "abstract": "The theoretical landscape of federated learning (FL) undergoes rapid evolution, but its practical application encounters a series of intricate challenges, and hyperparameter optimization is one of these critical challenges. Amongst the diverse adjustments in hyperparameters, the adaptation of the learning rate emerges as a crucial component, holding the promise of significantly enhancing the efficacy of FL systems. In response to this critical need, this paper presents FedHyper, a novel hypergradient-based learning rate adaptation algorithm specifically designed for FL. FedHyper serves as a universal learning rate scheduler that can adapt both global and local rates as the training progresses. In addition, FedHyper not only showcases unparalleled robustness to a spectrum of initial learning rate configurations but also significantly alleviates the necessity for laborious empirical learning rate adjustments. We provide a comprehensive theoretical analysis of FedHyper's convergence rate and conduct extensive experiments on vision and language benchmark datasets. The results demonstrate that FEDHYPER consistently converges 1.1-3x faster than FedAvg and the competing baselines while achieving superior final accuracy. Moreover, FedHyper catalyzes a remarkable surge in accuracy, augmenting it by up to 15% compared to FedAvg under suboptimal initial learning rate settings. ",
    "url": "https://arxiv.org/abs/2310.03156",
    "authors": [
      "Ziyao Wang",
      "Jianyu Wang",
      "Ang Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2310.03158",
    "title": "Assessment of Prediction Intervals Using Uncertainty Characteristics  Curves",
    "abstract": "Accurate quantification of model uncertainty has long been recognized as a fundamental requirement for trusted AI. In regression tasks, uncertainty is typically quantified using prediction intervals calibrated to an ad-hoc operating point, making evaluation and comparison across different studies relatively difficult. Our work leverages: (1) the concept of operating characteristics curves and (2) the notion of a gain over a null reference, to derive a novel operating point agnostic assessment methodology for prediction intervals. The paper defines the Uncertainty Characteristics Curve and demonstrates its utility in selected scenarios. We argue that the proposed method addresses the current need for comprehensive assessment of prediction intervals and thus represents a valuable addition to the uncertainty quantification toolbox. ",
    "url": "https://arxiv.org/abs/2310.03158",
    "authors": [
      "Jiri Navratil",
      "Benjamin Elder",
      "Matthew Arnold",
      "Soumya Ghosh",
      "Prasanna Sattigeri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.03161",
    "title": "Neural architecture impact on identifying temporally extended  Reinforcement Learning tasks",
    "abstract": "Inspired by recent developments in attention models for image classification and natural language processing, we present various Attention based architectures in reinforcement learning (RL) domain, capable of performing well on OpenAI Gym Atari-2600 game suite. In spite of the recent success of Deep Reinforcement learning techniques in various fields like robotics, gaming and healthcare, they suffer from a major drawback that neural networks are difficult to interpret. We try to get around this problem with the help of Attention based models. In Attention based models, extracting and overlaying of attention map onto images allows for direct observation of information used by agent to select actions and easier interpretation of logic behind the chosen actions. Our models in addition to playing well on gym-Atari environments, also provide insights on how agent perceives its environment. In addition, motivated by recent developments in attention based video-classification models using Vision Transformer, we come up with an architecture based on Vision Transformer, for image-based RL domain too. Compared to previous works in Vision Transformer, our model is faster to train and requires fewer computational resources. 3 ",
    "url": "https://arxiv.org/abs/2310.03161",
    "authors": [
      "Victor Vadakechirayath George"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.03166",
    "title": "Raze to the Ground: Query-Efficient Adversarial HTML Attacks on  Machine-Learning Phishing Webpage Detectors",
    "abstract": "Machine-learning phishing webpage detectors (ML-PWD) have been shown to suffer from adversarial manipulations of the HTML code of the input webpage. Nevertheless, the attacks recently proposed have demonstrated limited effectiveness due to their lack of optimizing the usage of the adopted manipulations, and they focus solely on specific elements of the HTML code. In this work, we overcome these limitations by first designing a novel set of fine-grained manipulations which allow to modify the HTML code of the input phishing webpage without compromising its maliciousness and visual appearance, i.e., the manipulations are functionality- and rendering-preserving by design. We then select which manipulations should be applied to bypass the target detector by a query-efficient black-box optimization algorithm. Our experiments show that our attacks are able to raze to the ground the performance of current state-of-the-art ML-PWD using just 30 queries, thus overcoming the weaker attacks developed in previous work, and enabling a much fairer robustness evaluation of ML-PWD. ",
    "url": "https://arxiv.org/abs/2310.03166",
    "authors": [
      "Biagio Montaruli",
      "Luca Demetrio",
      "Maura Pintor",
      "Luca Compagna",
      "Davide Balzarotti",
      "Battista Biggio"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03174",
    "title": "Test Case Recommendations with Distributed Representation of Code  Syntactic Features",
    "abstract": "Frequent modifications of unit test cases are inevitable due to software's continuous underlying changes in source code, design, and requirements. Since manually maintaining software test suites is tedious, timely, and costly, automating the process of generation and maintenance of test units will significantly impact the effectiveness and efficiency of software testing processes. To this end, we propose an automated approach which exploits both structural and semantic properties of source code methods and test cases to recommend the most relevant and useful unit tests to the developers. The proposed approach initially trains a neural network to transform method-level source code, as well as unit tests, into distributed representations (embedded vectors) while preserving the importance of the structure in the code. Retrieving the semantic and structural properties of a given method, the approach computes cosine similarity between the method's embedding and the previously-embedded training instances. Further, according to the similarity scores between the embedding vectors, the model identifies the closest methods of embedding and the associated unit tests as the most similar recommendations. The results on the Methods2Test dataset showed that, while there is no guarantee to have similar relevant test cases for the group of similar methods, the proposed approach extracts the most similar existing test cases for a given method in the dataset, and evaluations show that recommended test cases decrease the developers' effort to generating expected test cases. ",
    "url": "https://arxiv.org/abs/2310.03174",
    "authors": [
      "Mosab Rezaei",
      "Hamed Alhoori",
      "Mona Rahimi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2310.03175",
    "title": "Impedance Leakage Vulnerability and its Utilization in  Reverse-engineering Embedded Software",
    "abstract": "Discovering new vulnerabilities and implementing security and privacy measures are important to protect systems and data against physical attacks. One such vulnerability is impedance, an inherent property of a device that can be exploited to leak information through an unintended side channel, thereby posing significant security and privacy risks. Unlike traditional vulnerabilities, impedance is often overlooked or narrowly explored, as it is typically treated as a fixed value at a specific frequency in research and design endeavors. Moreover, impedance has never been explored as a source of information leakage. This paper demonstrates that the impedance of an embedded device is not constant and directly relates to the programs executed on the device. We define this phenomenon as impedance leakage and use this as a side channel to extract software instructions from protected memory. Our experiment on the ATmega328P microcontroller and the Artix 7 FPGA indicates that the impedance side channel can detect software instructions with 96.1% and 92.6% accuracy, respectively. Furthermore, we explore the dual nature of the impedance side channel, highlighting the potential for beneficial purposes and the associated risk of intellectual property theft. Finally, potential countermeasures that specifically address impedance leakage are discussed. ",
    "url": "https://arxiv.org/abs/2310.03175",
    "authors": [
      "Md Sadik Awal",
      "Md Tauhidur Rahman"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Information Retrieval (cs.IR)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2310.03182",
    "title": "Robust and Interpretable Medical Image Classifiers via Concept  Bottleneck Models",
    "abstract": "Medical image classification is a critical problem for healthcare, with the potential to alleviate the workload of doctors and facilitate diagnoses of patients. However, two challenges arise when deploying deep learning models to real-world healthcare applications. First, neural models tend to learn spurious correlations instead of desired features, which could fall short when generalizing to new domains (e.g., patients with different ages). Second, these black-box models lack interpretability. When making diagnostic predictions, it is important to understand why a model makes a decision for trustworthy and safety considerations. In this paper, to address these two limitations, we propose a new paradigm to build robust and interpretable medical image classifiers with natural language concepts. Specifically, we first query clinical concepts from GPT-4, then transform latent image features into explicit concepts with a vision-language model. We systematically evaluate our method on eight medical image classification datasets to verify its effectiveness. On challenging datasets with strong confounding factors, our method can mitigate spurious correlations thus substantially outperform standard visual encoders and other baselines. Finally, we show how classification with a small number of concepts brings a level of interpretability for understanding model decisions through case studies in real medical data. ",
    "url": "https://arxiv.org/abs/2310.03182",
    "authors": [
      "An Yan",
      "Yu Wang",
      "Yiwu Zhong",
      "Zexue He",
      "Petros Karypis",
      "Zihan Wang",
      "Chengyu Dong",
      "Amilcare Gentili",
      "Chun-Nan Hsu",
      "Jingbo Shang",
      "Julian McAuley"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03185",
    "title": "Misusing Tools in Large Language Models With Visual Adversarial Examples",
    "abstract": "Large Language Models (LLMs) are being enhanced with the ability to use tools and to process multiple modalities. These new capabilities bring new benefits and also new security risks. In this work, we show that an attacker can use visual adversarial examples to cause attacker-desired tool usage. For example, the attacker could cause a victim LLM to delete calendar events, leak private conversations and book hotels. Different from prior work, our attacks can affect the confidentiality and integrity of user resources connected to the LLM while being stealthy and generalizable to multiple input prompts. We construct these attacks using gradient-based adversarial training and characterize performance along multiple dimensions. We find that our adversarial images can manipulate the LLM to invoke tools following real-world syntax almost always (~98%) while maintaining high similarity to clean images (~0.9 SSIM). Furthermore, using human scoring and automated metrics, we find that the attacks do not noticeably affect the conversation (and its semantics) between the user and the LLM. ",
    "url": "https://arxiv.org/abs/2310.03185",
    "authors": [
      "Xiaohan Fu",
      "Zihan Wang",
      "Shuheng Li",
      "Rajesh K. Gupta",
      "Niloofar Mireshghallah",
      "Taylor Berg-Kirkpatrick",
      "Earlence Fernandes"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.03187",
    "title": "Synthesis of Data-Driven Nonlinear State Observers using  Lipschitz-Bounded Neural Networks",
    "abstract": "This paper focuses on the model-free synthesis of state observers for nonlinear autonomous systems without knowing the governing equations. Specifically, the Kazantzis-Kravaris/Luenberger (KKL) observer structure is leveraged, where the outputs are fed into a linear time-invariant (LTI) system to obtain the observer states, which can be viewed as the states nonlinearly transformed by an immersion mapping, and a neural network is used to approximate the inverse of the nonlinear immersion and estimate the states. In view of the possible existence of noises in output measurements, this work proposes to impose an upper bound on the Lipschitz constant of the neural network for robust and safe observation. A relation that bounds the generalization loss of state observation according to the Lipschitz constant, as well as the $H_2$-norm of the LTI part in the KKL observer, is established, thus reducing the model-free observer synthesis problem to that of Lipschitz-bounded neural network training, for which a direct parameterization technique is used. The proposed approach is demonstrated on a chaotic Lorenz system. ",
    "url": "https://arxiv.org/abs/2310.03187",
    "authors": [
      "Wentao Tang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2310.03200",
    "title": "Amazon Books Rating prediction & Recommendation Model",
    "abstract": "This paper uses the dataset of Amazon to predict the books ratings listed on Amazon website. As part of this project, we predicted the ratings of the books, and also built a recommendation cluster. This recommendation cluster provides the recommended books based on the column's values from dataset, for instance, category, description, author, price, reviews etc. This paper provides a flow of handling big data files, data engineering, building models and providing predictions. The models predict book ratings column using various PySpark Machine Learning APIs. Additionally, we used hyper-parameters and parameters tuning. Also, Cross Validation and TrainValidationSplit were used for generalization. Finally, we performed a comparison between Binary Classification and Multiclass Classification in their accuracies. We converted our label from multiclass to binary to see if we could find any difference between the two classifications. As a result, we found out that we get higher accuracy in binary classification than in multiclass classification. ",
    "url": "https://arxiv.org/abs/2310.03200",
    "authors": [
      "Hsiu-Ping Lin",
      "Suman Chauhan",
      "Yougender Chauhan",
      "Nagender Chauhan",
      "Jongwook Woo"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2310.03205",
    "title": "A Large-Scale 3D Face Mesh Video Dataset via Neural Re-parameterized  Optimization",
    "abstract": "We propose NeuFace, a 3D face mesh pseudo annotation method on videos via neural re-parameterized optimization. Despite the huge progress in 3D face reconstruction methods, generating reliable 3D face labels for in-the-wild dynamic videos remains challenging. Using NeuFace optimization, we annotate the per-view/-frame accurate and consistent face meshes on large-scale face videos, called the NeuFace-dataset. We investigate how neural re-parameterization helps to reconstruct image-aligned facial details on 3D meshes via gradient analysis. By exploiting the naturalness and diversity of 3D faces in our dataset, we demonstrate the usefulness of our dataset for 3D face-related tasks: improving the reconstruction accuracy of an existing 3D face reconstruction model and learning 3D facial motion prior. Code and datasets will be available at https://neuface-dataset.github. ",
    "url": "https://arxiv.org/abs/2310.03205",
    "authors": [
      "Kim Youwang",
      "Lee Hyun",
      "Kim Sung-Bin",
      "Suekyeong Nam",
      "Janghoon Ju",
      "Tae-Hyun Oh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.03210",
    "title": "Can Language Models Employ the Socratic Method? Experiments with Code  Debugging",
    "abstract": "When employing the Socratic method of teaching, instructors guide students toward solving a problem on their own rather than providing the solution directly. While this strategy can substantially improve learning outcomes, it is usually time-consuming and cognitively demanding. Automated Socratic conversational agents can augment human instruction and provide the necessary scale, however their development is hampered by the lack of suitable data for training and evaluation. In this paper, we introduce a manually created dataset of multi-turn Socratic advice that is aimed at helping a novice programmer fix buggy solutions to simple computational problems. The dataset is then used for benchmarking the Socratic debugging abilities of a number of language models, ranging from fine-tuning the instruction-based text-to-text transformer Flan-T5 to zero-shot and chain of thought prompting of the much larger GPT-4. The code and datasets are made freely available for research at the link below. https://github.com/taisazero/socratic-debugging-benchmark ",
    "url": "https://arxiv.org/abs/2310.03210",
    "authors": [
      "Erfan Al-Hossami",
      "Razvan Bunescu",
      "Justin Smith",
      "Ryan Teehan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2310.03212",
    "title": "PDR-CapsNet: an Energy-Efficient Parallel Approach to Dynamic Routing in  Capsule Networks",
    "abstract": "Convolutional Neural Networks (CNNs) have produced state-of-the-art results for image classification tasks. However, they are limited in their ability to handle rotational and viewpoint variations due to information loss in max-pooling layers. Capsule Networks (CapsNets) employ a computationally-expensive iterative process referred to as dynamic routing to address these issues. CapsNets, however, often fall short on complex datasets and require more computational resources than CNNs. To overcome these challenges, we introduce the Parallel Dynamic Routing CapsNet (PDR-CapsNet), a deeper and more energy-efficient alternative to CapsNet that offers superior performance, less energy consumption, and lower overfitting rates. By leveraging a parallelization strategy, PDR-CapsNet mitigates the computational complexity of CapsNet and increases throughput, efficiently using hardware resources. As a result, we achieve 83.55\\% accuracy while requiring 87.26\\% fewer parameters, 32.27\\% and 47.40\\% fewer MACs, and Flops, achieving 3x faster inference and 7.29J less energy consumption on a 2080Ti GPU with 11GB VRAM compared to CapsNet and for the CIFAR-10 dataset. ",
    "url": "https://arxiv.org/abs/2310.03212",
    "authors": [
      "Samaneh Javadinia",
      "Amirali Baniasadi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03214",
    "title": "FreshLLMs: Refreshing Large Language Models with Search Engine  Augmentation",
    "abstract": "Most large language models (LLMs) are trained once and never updated; thus, they lack the ability to dynamically adapt to our ever-changing world. In this work, we perform a detailed study of the factuality of LLM-generated text in the context of answering questions that test current world knowledge. Specifically, we introduce FreshQA, a novel dynamic QA benchmark encompassing a diverse range of question and answer types, including questions that require fast-changing world knowledge as well as questions with false premises that need to be debunked. We benchmark a diverse array of both closed and open-source LLMs under a two-mode evaluation procedure that allows us to measure both correctness and hallucination. Through human evaluations involving more than 50K judgments, we shed light on limitations of these models and demonstrate significant room for improvement: for instance, all models (regardless of model size) struggle on questions that involve fast-changing knowledge and false premises. Motivated by these results, we present FreshPrompt, a simple few-shot prompting method that substantially boosts the performance of an LLM on FreshQA by incorporating relevant and up-to-date information retrieved from a search engine into the prompt. Our experiments show that FreshPrompt outperforms both competing search engine-augmented prompting methods such as Self-Ask (Press et al., 2022) as well as commercial systems such as Perplexity.AI. Further analysis of FreshPrompt reveals that both the number of retrieved evidences and their order play a key role in influencing the correctness of LLM-generated answers. Additionally, instructing the LLM to generate concise and direct answers helps reduce hallucination compared to encouraging more verbose answers. To facilitate future work, we release FreshQA at github.com/freshllms/freshqa and commit to updating it at regular intervals. ",
    "url": "https://arxiv.org/abs/2310.03214",
    "authors": [
      "Tu Vu",
      "Mohit Iyyer",
      "Xuezhi Wang",
      "Noah Constant",
      "Jerry Wei",
      "Jason Wei",
      "Chris Tar",
      "Yun-Hsuan Sung",
      "Denny Zhou",
      "Quoc Le",
      "Thang Luong"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.03221",
    "title": "Know2BIO: A Comprehensive Dual-View Benchmark for Evolving Biomedical  Knowledge Graphs",
    "abstract": "Knowledge graphs (KGs) have emerged as a powerful framework for representing and integrating complex biomedical information. However, assembling KGs from diverse sources remains a significant challenge in several aspects, including entity alignment, scalability, and the need for continuous updates to keep pace with scientific advancements. Moreover, the representative power of KGs is often limited by the scarcity of multi-modal data integration. To overcome these challenges, we propose Know2BIO, a general-purpose heterogeneous KG benchmark for the biomedical domain. Know2BIO integrates data from 30 diverse sources, capturing intricate relationships across 11 biomedical categories. It currently consists of ~219,000 nodes and ~6,200,000 edges. Know2BIO is capable of user-directed automated updating to reflect the latest knowledge in biomedical science. Furthermore, Know2BIO is accompanied by multi-modal data: node features including text descriptions, protein and compound sequences and structures, enabling the utilization of emerging natural language processing methods and multi-modal data integration strategies. We evaluate KG representation models on Know2BIO, demonstrating its effectiveness as a benchmark for KG representation learning in the biomedical field. Data and source code of Know2BIO are available at https://github.com/Yijia-Xiao/Know2BIO/. ",
    "url": "https://arxiv.org/abs/2310.03221",
    "authors": [
      "Yijia Xiao",
      "Dylan Steinecke",
      "Alexander Russell Pelletier",
      "Yushi Bai",
      "Peipei Ping",
      "Wei Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03232",
    "title": "Deep Representations of First-person Pronouns for Prediction of  Depression Symptom Severity",
    "abstract": "Prior work has shown that analyzing the use of first-person singular pronouns can provide insight into individuals' mental status, especially depression symptom severity. These findings were generated by counting frequencies of first-person singular pronouns in text data. However, counting doesn't capture how these pronouns are used. Recent advances in neural language modeling have leveraged methods generating contextual embeddings. In this study, we sought to utilize the embeddings of first-person pronouns obtained from contextualized language representation models to capture ways these pronouns are used, to analyze mental status. De-identified text messages sent during online psychotherapy with weekly assessment of depression severity were used for evaluation. Results indicate the advantage of contextualized first-person pronoun embeddings over standard classification token embeddings and frequency-based pronoun analysis results in predicting depression symptom severity. This suggests contextual representations of first-person pronouns can enhance the predictive utility of language used by people with depression symptoms. ",
    "url": "https://arxiv.org/abs/2310.03232",
    "authors": [
      "Xinyang Ren",
      "Hannah A Burkhardt",
      "Patricia A Areán",
      "Thomas D Hull",
      "Trevor Cohen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.03240",
    "title": "Relational Convolutional Networks: A framework for learning  representations of hierarchical relations",
    "abstract": "A maturing area of research in deep learning is the development of architectures that can learn explicit representations of relational features. In this paper, we focus on the problem of learning representations of hierarchical relations, proposing an architectural framework we call \"relational convolutional networks\". Given a sequence of objects, a \"multi-dimensional inner product relation\" module produces a relation tensor describing all pairwise relations. A \"relational convolution\" layer then transforms the relation tensor into a sequence of new objects, each describing the relations within some group of objects at the previous layer. Graphlet filters, analogous to filters in convolutional neural networks, represent a template of relations against which the relation tensor is compared at each grouping. Repeating this yields representations of higher-order, hierarchical relations. We present the motivation and details of the architecture, together with a set of experiments to demonstrate how relational convolutional networks can provide an effective framework for modeling relational tasks that have hierarchical structure. ",
    "url": "https://arxiv.org/abs/2310.03240",
    "authors": [
      "Awni Altabaa",
      "John Lafferty"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03247",
    "title": "Robust globally divergence-free Weak Galerkin finite element method for  incompressible Magnetohydrodynamics flow",
    "abstract": "This paper develops a weak Galerkin (WG) finite element method of arbitrary order for the steady incompressible Magnetohydrodynamics equations. The WG scheme uses piecewise polynomials of degrees $k(k\\geq 1),k,k-1$, and $k-1$ respectively for the approximations of the velocity, the magnetic field, the pressure, and the magnetic pseudo-pressure in the interior of elements, and uses piecewise polynomials of degree $k$ for their numerical traces on the interfaces of elements. The method is shown to yield globally divergence-free approximations of the velocity and magnetic fields. We give existence and uniqueness results for the discrete scheme and derive optimal a priori error estimates. We also present a convergent linearized iterative algorithm. Numerical experiments are provided to verify the obtained theoretical results. ",
    "url": "https://arxiv.org/abs/2310.03247",
    "authors": [
      "Min Zhang",
      "Tong Zhang",
      "Xiaoping Xie"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Analysis of PDEs (math.AP)"
    ]
  },
  {
    "id": "arXiv:2310.03265",
    "title": "Integrated Communication, Sensing, and Computation Framework for 6G  Networks",
    "abstract": "In the sixth generation (6G) era, intelligent machine network (IMN) applications, such as intelligent transportation, require collaborative machines with communication, sensing, and computation (CSC) capabilities. This article proposes an integrated communication, sensing, and computation (ICSAC) framework for 6G to achieve the reciprocity among CSC functions to enhance the reliability and latency of communication, accuracy and timeliness of sensing information acquisition, and privacy and security of computing to realize the IMN applications. Specifically, the sensing and communication functions can merge into unified platforms using the same transmit signals, and the acquired real-time sensing information can be exploited as prior information for intelligent algorithms to enhance the performance of communication networks. This is called the computing-empowered integrated sensing and communications (ISAC) reciprocity. Such reciprocity can further improve the performance of distributed computation with the assistance of networked sensing capability, which is named the sensing-empowered integrated communications and computation (ICAC) reciprocity. The above ISAC and ICAC reciprocities can enhance each other iteratively and finally lead to the ICSAC reciprocity. To achieve these reciprocities, we explore the potential enabling technologies for the ICSAC framework. Finally, we present the evaluation results of crucial enabling technologies to show the feasibility of the ICSAC framework. ",
    "url": "https://arxiv.org/abs/2310.03265",
    "authors": [
      "Xu Chen",
      "Zhiyong Feng",
      "J. Andrew Zhang",
      "Zhaohui Yang",
      "Xin Yuan",
      "Xinxin He",
      "Ping Zhang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2310.03272",
    "title": "Network Alignment with Transferable Graph Autoencoders",
    "abstract": "Network alignment is the task of establishing one-to-one correspondences between the nodes of different graphs and finds a plethora of applications in high-impact domains. However, this task is known to be NP-hard in its general form, and existing algorithms do not scale up as the size of the graphs increases. To tackle both challenges we propose a novel generalized graph autoencoder architecture, designed to extract powerful and robust node embeddings, that are tailored to the alignment task. We prove that the generated embeddings are associated with the eigenvalues and eigenvectors of the graphs and can achieve more accurate alignment compared to classical spectral methods. Our proposed framework also leverages transfer learning and data augmentation to achieve efficient network alignment at a very large scale without retraining. Extensive experiments on both network and sub-network alignment with real-world graphs provide corroborating evidence supporting the effectiveness and scalability of the proposed approach. ",
    "url": "https://arxiv.org/abs/2310.03272",
    "authors": [
      "Jiashu He",
      "Charilaos I. Kanatsoulis",
      "Alejandro Ribeiro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.03273",
    "title": "Ablation Study to Clarify the Mechanism of Object Segmentation in  Multi-Object Representation Learning",
    "abstract": "Multi-object representation learning aims to represent complex real-world visual input using the composition of multiple objects. Representation learning methods have often used unsupervised learning to segment an input image into individual objects and encode these objects into each latent vector. However, it is not clear how previous methods have achieved the appropriate segmentation of individual objects. Additionally, most of the previous methods regularize the latent vectors using a Variational Autoencoder (VAE). Therefore, it is not clear whether VAE regularization contributes to appropriate object segmentation. To elucidate the mechanism of object segmentation in multi-object representation learning, we conducted an ablation study on MONet, which is a typical method. MONet represents multiple objects using pairs that consist of an attention mask and the latent vector corresponding to the attention mask. Each latent vector is encoded from the input image and attention mask. Then, the component image and attention mask are decoded from each latent vector. The loss function of MONet consists of 1) the sum of reconstruction losses between the input image and decoded component image, 2) the VAE regularization loss of the latent vector, and 3) the reconstruction loss of the attention mask to explicitly encode shape information. We conducted an ablation study on these three loss functions to investigate the effect on segmentation performance. Our results showed that the VAE regularization loss did not affect segmentation performance and the others losses did affect it. Based on this result, we hypothesize that it is important to maximize the attention mask of the image region best represented by a single latent vector corresponding to the attention mask. We confirmed this hypothesis by evaluating a new loss function with the same mechanism as the hypothesis. ",
    "url": "https://arxiv.org/abs/2310.03273",
    "authors": [
      "Takayuki Komatsu",
      "Yoshiyuki Ohmura",
      "Yasuo Kuniyoshi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2310.03274",
    "title": "Fragment-based Pretraining and Finetuning on Molecular Graphs",
    "abstract": "Property prediction on molecular graphs is an important application of Graph Neural Networks (GNNs). Recently, unlabeled molecular data has become abundant, which facilitates the rapid development of self-supervised learning for GNNs in the chemical domain. In this work, we propose pretraining GNNs at the fragment level, which serves as a promising middle ground to overcome the limitations of node-level and graph-level pretraining. Borrowing techniques from recent work on principle subgraph mining, we obtain a compact vocabulary of prevalent fragments that span a large pretraining dataset. From the extracted vocabulary, we introduce several fragment-based contrastive and predictive pretraining tasks. The contrastive learning task jointly pretrains two different GNNs: one based on molecular graphs and one based on fragment graphs, which represents high-order connectivity within molecules. By enforcing the consistency between the fragment embedding and the aggregated embedding of the corresponding atoms from the molecular graphs, we ensure that both embeddings capture structural information at multiple resolutions. The structural information of the fragment graphs is further exploited to extract auxiliary labels for the graph-level predictive pretraining. We employ both the pretrained molecular-based and fragment-based GNNs for downstream prediction, thus utilizing the fragment information during finetuning. Our models advance the performances on 5 out of 8 common molecular benchmarks and improve the performances on long-range biological benchmarks by at least 11.5%. ",
    "url": "https://arxiv.org/abs/2310.03274",
    "authors": [
      "Kha-Dinh Luong",
      "Ambuj Singh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03283",
    "title": "A Formalism and Approach for Improving Robustness of Large Language  Models Using Risk-Adjusted Confidence Scores",
    "abstract": "Large Language Models (LLMs), such as ChatGPT, have achieved impressive milestones in natural language processing (NLP). Despite their impressive performance, the models are known to pose important risks. As these models are deployed in real-world applications, a systematic understanding of different risks posed by these models on tasks such as natural language inference (NLI), is much needed. In this paper, we define and formalize two distinct types of risk: decision risk and composite risk. We also propose a risk-centric evaluation framework, and four novel metrics, for assessing LLMs on these risks in both in-domain and out-of-domain settings. Finally, we propose a risk-adjusted calibration method called DwD for helping LLMs minimize these risks in an overall NLI architecture. Detailed experiments, using four NLI benchmarks, three baselines and two LLMs, including ChatGPT, show both the practical utility of the evaluation framework, and the efficacy of DwD in reducing decision and composite risk. For instance, when using DwD, an underlying LLM is able to address an extra 20.1% of low-risk inference tasks (but which the LLM erroneously deems high-risk without risk adjustment) and skip a further 19.8% of high-risk tasks, which would have been answered incorrectly. ",
    "url": "https://arxiv.org/abs/2310.03283",
    "authors": [
      "Ke Shen",
      "Mayank Kejriwal"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.03285",
    "title": "Burning the Adversarial Bridges: Robust Windows Malware Detection  Against Binary-level Mutations",
    "abstract": "Toward robust malware detection, we explore the attack surface of existing malware detection systems. We conduct root-cause analyses of the practical binary-level black-box adversarial malware examples. Additionally, we uncover the sensitivity of volatile features within the detection engines and exhibit their exploitability. Highlighting volatile information channels within the software, we introduce three software pre-processing steps to eliminate the attack surface, namely, padding removal, software stripping, and inter-section information resetting. Further, to counter the emerging section injection attacks, we propose a graph-based section-dependent information extraction scheme for software representation. The proposed scheme leverages aggregated information within various sections in the software to enable robust malware detection and mitigate adversarial settings. Our experimental results show that traditional malware detection models are ineffective against adversarial threats. However, the attack surface can be largely reduced by eliminating the volatile information. Therefore, we propose simple-yet-effective methods to mitigate the impacts of binary manipulation attacks. Overall, our graph-based malware detection scheme can accurately detect malware with an area under the curve score of 88.32\\% and a score of 88.19% under a combination of binary manipulation attacks, exhibiting the efficiency of our proposed scheme. ",
    "url": "https://arxiv.org/abs/2310.03285",
    "authors": [
      "Ahmed Abusnaina",
      "Yizhen Wang",
      "Sunpreet Arora",
      "Ke Wang",
      "Mihai Christodorescu",
      "David Mohaisen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.03303",
    "title": "A Two-stage Based Social Preference Recognition in Multi-Agent  Autonomous Driving System",
    "abstract": "Multi-Agent Reinforcement Learning (MARL) has become a promising solution for constructing a multi-agent autonomous driving system (MADS) in complex and dense scenarios. But most methods consider agents acting selfishly, which leads to conflict behaviors. Some existing works incorporate the concept of social value orientation (SVO) to promote coordination, but they lack the knowledge of other agents' SVOs, resulting in conservative maneuvers. In this paper, we aim to tackle the mentioned problem by enabling the agents to understand other agents' SVOs. To accomplish this, we propose a two-stage system framework. Firstly, we train a policy by allowing the agents to share their ground truth SVOs to establish a coordinated traffic flow. Secondly, we develop a recognition network that estimates agents' SVOs and integrates it with the policy trained in the first stage. Experiments demonstrate that our developed method significantly improves the performance of the driving policy in MADS compared to two state-of-the-art MARL algorithms. ",
    "url": "https://arxiv.org/abs/2310.03303",
    "authors": [
      "Jintao Xue",
      "Dongkun Zhang",
      "Rong Xiong",
      "Yue Wang",
      "Eryun Liu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.03312",
    "title": "Certifiably Robust Graph Contrastive Learning",
    "abstract": "Graph Contrastive Learning (GCL) has emerged as a popular unsupervised graph representation learning method. However, it has been shown that GCL is vulnerable to adversarial attacks on both the graph structure and node attributes. Although empirical approaches have been proposed to enhance the robustness of GCL, the certifiable robustness of GCL is still remain unexplored. In this paper, we develop the first certifiably robust framework in GCL. Specifically, we first propose a unified criteria to evaluate and certify the robustness of GCL. We then introduce a novel technique, RES (Randomized Edgedrop Smoothing), to ensure certifiable robustness for any GCL model, and this certified robustness can be provably preserved in downstream tasks. Furthermore, an effective training method is proposed for robust GCL. Extensive experiments on real-world datasets demonstrate the effectiveness of our proposed method in providing effective certifiable robustness and enhancing the robustness of any GCL model. The source code of RES is available at https://github.com/ventr1c/RES-GCL. ",
    "url": "https://arxiv.org/abs/2310.03312",
    "authors": [
      "Minhua Lin",
      "Teng Xiao",
      "Enyan Dai",
      "Xiang Zhang",
      "Suhang Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03314",
    "title": "Enhanced Human-Robot Collaboration using Constrained Probabilistic  Human-Motion Prediction",
    "abstract": "Human motion prediction is an essential step for efficient and safe human-robot collaboration. Current methods either purely rely on representing the human joints in some form of neural network-based architecture or use regression models offline to fit hyper-parameters in the hope of capturing a model encompassing human motion. While these methods provide good initial results, they are missing out on leveraging well-studied human body kinematic models as well as body and scene constraints which can help boost the efficacy of these prediction frameworks while also explicitly avoiding implausible human joint configurations. We propose a novel human motion prediction framework that incorporates human joint constraints and scene constraints in a Gaussian Process Regression (GPR) model to predict human motion over a set time horizon. This formulation is combined with an online context-aware constraints model to leverage task-dependent motions. It is tested on a human arm kinematic model and implemented on a human-robot collaborative setup with a UR5 robot arm to demonstrate the real-time capability of our approach. Simulations were also performed on datasets like HA4M and ANDY. The simulation and experimental results demonstrate considerable improvements in a Gaussian Process framework when these constraints are explicitly considered. ",
    "url": "https://arxiv.org/abs/2310.03314",
    "authors": [
      "Aadi Kothari",
      "Tony Tohme",
      "Xiaotong Zhang",
      "Kamal Youcef-Toumi"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03320",
    "title": "BioBridge: Bridging Biomedical Foundation Models via Knowledge Graph",
    "abstract": "Foundation models (FMs) are able to leverage large volumes of unlabeled data to demonstrate superior performance across a wide range of tasks. However, FMs developed for biomedical domains have largely remained unimodal, i.e., independently trained and used for tasks on protein sequences alone, small molecule structures alone, or clinical data alone. To overcome this limitation of biomedical FMs, we present BioBridge, a novel parameter-efficient learning framework, to bridge independently trained unimodal FMs to establish multimodal behavior. BioBridge achieves it by utilizing Knowledge Graphs (KG) to learn transformations between one unimodal FM and another without fine-tuning any underlying unimodal FMs. Our empirical results demonstrate that BioBridge can beat the best baseline KG embedding methods (on average by around 76.3%) in cross-modal retrieval tasks. We also identify BioBridge demonstrates out-of-domain generalization ability by extrapolating to unseen modalities or relations. Additionally, we also show that BioBridge presents itself as a general purpose retriever that can aid biomedical multimodal question answering as well as enhance the guided generation of novel drugs. ",
    "url": "https://arxiv.org/abs/2310.03320",
    "authors": [
      "Zifeng Wang",
      "Zichen Wang",
      "Balasubramaniam Srinivasan",
      "Vassilis N. Ioannidis",
      "Huzefa Rangwala",
      "Rishita Anubhai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03325",
    "title": "Learning Concept-Based Visual Causal Transition and Symbolic Reasoning  for Visual Planning",
    "abstract": "Visual planning simulates how humans make decisions to achieve desired goals in the form of searching for visual causal transitions between an initial visual state and a final visual goal state. It has become increasingly important in egocentric vision with its advantages in guiding agents to perform daily tasks in complex environments. In this paper, we propose an interpretable and generalizable visual planning framework consisting of i) a novel Substitution-based Concept Learner (SCL) that abstracts visual inputs into disentangled concept representations, ii) symbol abstraction and reasoning that performs task planning via the self-learned symbols, and iii) a Visual Causal Transition model (ViCT) that grounds visual causal transitions to semantically similar real-world actions. Given an initial state, we perform goal-conditioned visual planning with a symbolic reasoning method fueled by the learned representations and causal transitions to reach the goal state. To verify the effectiveness of the proposed model, we collect a large-scale visual planning dataset based on AI2-THOR, dubbed as CCTP. Extensive experiments on this challenging dataset demonstrate the superior performance of our method in visual task planning. Empirically, we show that our framework can generalize to unseen task trajectories and unseen object categories. ",
    "url": "https://arxiv.org/abs/2310.03325",
    "authors": [
      "Yilue Qian",
      "Peiyu Yu",
      "Ying Nian Wu",
      "Wei Wang",
      "Lifeng Fan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03333",
    "title": "Real-time Multi-modal Object Detection and Tracking on Edge for  Regulatory Compliance Monitoring",
    "abstract": "Regulatory compliance auditing across diverse industrial domains requires heightened quality assurance and traceability. Present manual and intermittent approaches to such auditing yield significant challenges, potentially leading to oversights in the monitoring process. To address these issues, we introduce a real-time, multi-modal sensing system employing 3D time-of-flight and RGB cameras, coupled with unsupervised learning techniques on edge AI devices. This enables continuous object tracking thereby enhancing efficiency in record-keeping and minimizing manual interventions. While we validate the system in a knife sanitization context within agrifood facilities, emphasizing its prowess against occlusion and low-light issues with RGB cameras, its potential spans various industrial monitoring settings. ",
    "url": "https://arxiv.org/abs/2310.03333",
    "authors": [
      "Jia Syuen Lim",
      "Ziwei Wang",
      "Jiajun Liu",
      "Abdelwahed Khamis",
      "Reza Arablouei",
      "Robert Barlow",
      "Ryan McAllister"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.03334",
    "title": "Untargeted White-box Adversarial Attack with Heuristic Defence Methods  in Real-time Deep Learning based Network Intrusion Detection System",
    "abstract": "Network Intrusion Detection System (NIDS) is a key component in securing the computer network from various cyber security threats and network attacks. However, consider an unfortunate situation where the NIDS is itself attacked and vulnerable more specifically, we can say, How to defend the defender?. In Adversarial Machine Learning (AML), the malicious actors aim to fool the Machine Learning (ML) and Deep Learning (DL) models to produce incorrect predictions with intentionally crafted adversarial examples. These adversarial perturbed examples have become the biggest vulnerability of ML and DL based systems and are major obstacles to their adoption in real-time and mission-critical applications such as NIDS. AML is an emerging research domain, and it has become a necessity for the in-depth study of adversarial attacks and their defence strategies to safeguard the computer network from various cyber security threads. In this research work, we aim to cover important aspects related to NIDS, adversarial attacks and its defence mechanism to increase the robustness of the ML and DL based NIDS. We implemented four powerful adversarial attack techniques, namely, Fast Gradient Sign Method (FGSM), Jacobian Saliency Map Attack (JSMA), Projected Gradient Descent (PGD) and Carlini & Wagner (C&W) in NIDS. We analyzed its performance in terms of various performance metrics in detail. Furthermore, the three heuristics defence strategies, i.e., Adversarial Training (AT), Gaussian Data Augmentation (GDA) and High Confidence (HC), are implemented to improve the NIDS robustness under adversarial attack situations. The complete workflow is demonstrated in real-time network with data packet flow. This research work provides the overall background for the researchers interested in AML and its implementation from a computer network security point of view. ",
    "url": "https://arxiv.org/abs/2310.03334",
    "authors": [
      "Khushnaseeb Roshan",
      "Aasim Zafar",
      "Sheikh Burhan Ul Haque"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03349",
    "title": "An Integrated Algorithm for Robust and Imperceptible Audio Adversarial  Examples",
    "abstract": "Audio adversarial examples are audio files that have been manipulated to fool an automatic speech recognition (ASR) system, while still sounding benign to a human listener. Most methods to generate such samples are based on a two-step algorithm: first, a viable adversarial audio file is produced, then, this is fine-tuned with respect to perceptibility and robustness. In this work, we present an integrated algorithm that uses psychoacoustic models and room impulse responses (RIR) in the generation step. The RIRs are dynamically created by a neural network during the generation process to simulate a physical environment to harden our examples against transformations experienced in over-the-air attacks. We compare the different approaches in three experiments: in a simulated environment and in a realistic over-the-air scenario to evaluate the robustness, and in a human study to evaluate the perceptibility. Our algorithms considering psychoacoustics only or in addition to the robustness show an improvement in the signal-to-noise ratio (SNR) as well as in the human perception study, at the cost of an increased word error rate (WER). ",
    "url": "https://arxiv.org/abs/2310.03349",
    "authors": [
      "Armin Ettenhofer",
      "Jan-Philipp Schulze",
      "Karla Pizzi"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.03358",
    "title": "Robust Representation Learning via Asymmetric Negative Contrast and  Reverse Attention",
    "abstract": "Deep neural networks are vulnerable to adversarial noise. Adversarial training (AT) has been demonstrated to be the most effective defense strategy to protect neural networks from being fooled. However, we find AT omits to learning robust features, resulting in poor performance of adversarial robustness. To address this issue, we highlight two characteristics of robust representation: (1) $\\bf{exclusion}$: the feature of natural examples keeps away from that of other classes; (2) $\\bf{alignment}$: the feature of natural and corresponding adversarial examples is close to each other. These motivate us to propose a generic framework of AT to gain robust representation, by the asymmetric negative contrast and reverse attention. Specifically, we design an asymmetric negative contrast based on predicted probabilities, to push away examples of different classes in the feature space. Moreover, we propose to weight feature by parameters of the linear classifier as the reverse attention, to obtain class-aware feature and pull close the feature of the same class. Empirical evaluations on three benchmark datasets show our methods greatly advance the robustness of AT and achieve state-of-the-art performance. Code is available at <https://github.com/changzhang777/ANCRA>. ",
    "url": "https://arxiv.org/abs/2310.03358",
    "authors": [
      "Nuoyan Zhou",
      "Decheng Liu",
      "Dawei Zhou",
      "Xinbo Gao",
      "Nannan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03360",
    "title": "CSI: Enhancing the Robustness of 3D Point Cloud Recognition against  Corruption",
    "abstract": "Despite recent advancements in deep neural networks for point cloud recognition, real-world safety-critical applications present challenges due to unavoidable data corruption. Current models often fall short in generalizing to unforeseen distribution shifts. In this study, we harness the inherent set property of point cloud data to introduce a novel critical subset identification (CSI) method, aiming to bolster recognition robustness in the face of data corruption. Our CSI framework integrates two pivotal components: density-aware sampling (DAS) and self-entropy minimization (SEM), which cater to static and dynamic CSI, respectively. DAS ensures efficient robust anchor point sampling by factoring in local density, while SEM is employed during training to accentuate the most salient point-to-point attention. Evaluations reveal that our CSI approach yields error rates of 18.4\\% and 16.3\\% on ModelNet40-C and PointCloud-C, respectively, marking a notable improvement over state-of-the-art methods by margins of 5.2\\% and 4.2\\% on the respective benchmarks. Code is available at \\href{https://github.com/masterwu2115/CSI/tree/main}{https://github.com/masterwu2115/CSI/tree/main} ",
    "url": "https://arxiv.org/abs/2310.03360",
    "authors": [
      "Zhuoyuan Wu",
      "Jiachen Sun",
      "Chaowei Xiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.03376",
    "title": "Procedural Text Mining with Large Language Models",
    "abstract": "Recent advancements in the field of Natural Language Processing, particularly the development of large-scale language models that are pretrained on vast amounts of knowledge, are creating novel opportunities within the realm of Knowledge Engineering. In this paper, we investigate the usage of large language models (LLMs) in both zero-shot and in-context learning settings to tackle the problem of extracting procedures from unstructured PDF text in an incremental question-answering fashion. In particular, we leverage the current state-of-the-art GPT-4 (Generative Pre-trained Transformer 4) model, accompanied by two variations of in-context learning that involve an ontology with definitions of procedures and steps and a limited number of samples of few-shot learning. The findings highlight both the promise of this approach and the value of the in-context learning customisations. These modifications have the potential to significantly address the challenge of obtaining sufficient training data, a hurdle often encountered in deep learning-based Natural Language Processing techniques for procedure extraction. ",
    "url": "https://arxiv.org/abs/2310.03376",
    "authors": [
      "Anisa Rula",
      "Jennifer D'Souza"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2310.03377",
    "title": "ACT-Net: Anchor-context Action Detection in Surgery Videos",
    "abstract": "Recognition and localization of surgical detailed actions is an essential component of developing a context-aware decision support system. However, most existing detection algorithms fail to provide high-accuracy action classes even having their locations, as they do not consider the surgery procedure's regularity in the whole video. This limitation hinders their application. Moreover, implementing the predictions in clinical applications seriously needs to convey model confidence to earn entrustment, which is unexplored in surgical action prediction. In this paper, to accurately detect fine-grained actions that happen at every moment, we propose an anchor-context action detection network (ACTNet), including an anchor-context detection (ACD) module and a class conditional diffusion (CCD) module, to answer the following questions: 1) where the actions happen; 2) what actions are; 3) how confidence predictions are. Specifically, the proposed ACD module spatially and temporally highlights the regions interacting with the extracted anchor in surgery video, which outputs action location and its class distribution based on anchor-context interactions. Considering the full distribution of action classes in videos, the CCD module adopts a denoising diffusion-based generative model conditioned on our ACD estimator to further reconstruct accurately the action predictions. Moreover, we utilize the stochastic nature of the diffusion model outputs to access model confidence for each prediction. Our method reports the state-of-the-art performance, with improvements of 4.0% mAP against baseline on the surgical video dataset. ",
    "url": "https://arxiv.org/abs/2310.03377",
    "authors": [
      "Luoying Hao",
      "Yan Hu",
      "Wenjun Lin",
      "Qun Wang",
      "Heng Li",
      "Huazhu Fu",
      "Jinming Duan",
      "Jiang Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.03380",
    "title": "StegGuard: Fingerprinting Self-supervised Pre-trained Encoders via  Secrets Embeder and Extractor",
    "abstract": "In this work, we propose StegGuard, a novel fingerprinting mechanism to verify the ownership of the suspect pre-trained encoder using steganography. A critical perspective in StegGuard is that the unique characteristic of the transformation from an image to an embedding, conducted by the pre-trained encoder, can be equivalently exposed how an embeder embeds secrets into images and how an extractor extracts the secrets from encoder's embeddings with a tolerable error after the secrets are subjected to the encoder's transformation. While each independent encoder has a distinct transformation, the piracy encoder has a similar transformation to the victim. Based on these, we learn a pair of secrets embeder and extractor as the fingerprint for the victim encoder. We introduce a frequency-domain channel attention embedding block into the embeder to adaptively embed secrets into suitable frequency bands. During verification, if the secrets embedded into the query images can be extracted with an acceptable error from the suspect encoder's embeddings, the suspect encoder is determined as piracy, otherwise independent. Extensive experiments demonstrate that depending on a very limited number of query images, StegGuard can reliably identify across varied independent encoders, and is robust against model stealing related attacks including model extraction, fine-tuning, pruning, embedding noising and shuffle. ",
    "url": "https://arxiv.org/abs/2310.03380",
    "authors": [
      "Xingdong Ren",
      "Tianxing Zhang",
      "Hanzhou Wu",
      "Xinpeng Zhang",
      "Yinggui Wang",
      "Guangling Sun"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.03396",
    "title": "Learning to Simplify Spatial-Temporal Graphs in Gait Analysis",
    "abstract": "Gait analysis leverages unique walking patterns for person identification and assessment across multiple domains. Among the methods used for gait analysis, skeleton-based approaches have shown promise due to their robust and interpretable features. However, these methods often rely on hand-crafted spatial-temporal graphs that are based on human anatomy disregarding the particularities of the dataset and task. This paper proposes a novel method to simplify the spatial-temporal graph representation for gait-based gender estimation, improving interpretability without losing performance. Our approach employs two models, an upstream and a downstream model, that can adjust the adjacency matrix for each walking instance, thereby removing the fixed nature of the graph. By employing the Straight-Through Gumbel-Softmax trick, our model is trainable end-to-end. We demonstrate the effectiveness of our approach on the CASIA-B dataset for gait-based gender estimation. The resulting graphs are interpretable and differ qualitatively from fixed graphs used in existing models. Our research contributes to enhancing the explainability and task-specific adaptability of gait recognition, promoting more efficient and reliable gait-based biometrics. ",
    "url": "https://arxiv.org/abs/2310.03396",
    "authors": [
      "Adrian Cosma",
      "Emilian Radoi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03399",
    "title": "GRAPES: Learning to Sample Graphs for Scalable Graph Neural Networks",
    "abstract": "Graph neural networks (GNNs) learn the representation of nodes in a graph by aggregating the neighborhood information in various ways. As these networks grow in depth, their receptive field grows exponentially due to the increase in neighborhood sizes, resulting in high memory costs. Graph sampling solves memory issues in GNNs by sampling a small ratio of the nodes in the graph. This way, GNNs can scale to much larger graphs. Most sampling methods focus on fixed sampling heuristics, which may not generalize to different structures or tasks. We introduce GRAPES, an adaptive graph sampling method that learns to identify sets of influential nodes for training a GNN classifier. GRAPES uses a GFlowNet to learn node sampling probabilities given the classification objectives. We evaluate GRAPES across several small- and large-scale graph benchmarks and demonstrate its effectiveness in accuracy and scalability. In contrast to existing sampling methods, GRAPES maintains high accuracy even with small sample sizes and, therefore, can scale to very large graphs. Our code is publicly available at https://github.com/dfdazac/grapes. ",
    "url": "https://arxiv.org/abs/2310.03399",
    "authors": [
      "Taraneh Younesian",
      "Thiviyan Thanapalasingam",
      "Emile van Krieken",
      "Daniel Daza",
      "Peter Bloem"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.03402",
    "title": "A Complementary Global and Local Knowledge Network for Ultrasound  denoising with Fine-grained Refinement",
    "abstract": "Ultrasound imaging serves as an effective and non-invasive diagnostic tool commonly employed in clinical examinations. However, the presence of speckle noise in ultrasound images invariably degrades image quality, impeding the performance of subsequent tasks, such as segmentation and classification. Existing methods for speckle noise reduction frequently induce excessive image smoothing or fail to preserve detailed information adequately. In this paper, we propose a complementary global and local knowledge network for ultrasound denoising with fine-grained refinement. Initially, the proposed architecture employs the L-CSwinTransformer as encoder to capture global information, incorporating CNN as decoder to fuse local features. We expand the resolution of the feature at different stages to extract more global information compared to the original CSwinTransformer. Subsequently, we integrate Fine-grained Refinement Block (FRB) within the skip-connection stage to further augment features. We validate our model on two public datasets, HC18 and BUSI. Experimental results demonstrate that our model can achieve competitive performance in both quantitative metrics and visual performance. Our code will be available at https://github.com/AAlkaid/USDenoising. ",
    "url": "https://arxiv.org/abs/2310.03402",
    "authors": [
      "Zhenyu Bu",
      "Kai-Ni Wang",
      "Fuxing Zhao",
      "Shengxiao Li",
      "Guang-Quan Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2310.03419",
    "title": "Pre-Training and Fine-Tuning Generative Flow Networks",
    "abstract": "Generative Flow Networks (GFlowNets) are amortized samplers that learn stochastic policies to sequentially generate compositional objects from a given unnormalized reward distribution. They can generate diverse sets of high-reward objects, which is an important consideration in scientific discovery tasks. However, as they are typically trained from a given extrinsic reward function, it remains an important open challenge about how to leverage the power of pre-training and train GFlowNets in an unsupervised fashion for efficient adaptation to downstream tasks. Inspired by recent successes of unsupervised pre-training in various domains, we introduce a novel approach for reward-free pre-training of GFlowNets. By framing the training as a self-supervised problem, we propose an outcome-conditioned GFlowNet (OC-GFN) that learns to explore the candidate space. Specifically, OC-GFN learns to reach any targeted outcomes, akin to goal-conditioned policies in reinforcement learning. We show that the pre-trained OC-GFN model can allow for a direct extraction of a policy capable of sampling from any new reward functions in downstream tasks. Nonetheless, adapting OC-GFN on a downstream task-specific reward involves an intractable marginalization over possible outcomes. We propose a novel way to approximate this marginalization by learning an amortized predictor enabling efficient fine-tuning. Extensive experimental results validate the efficacy of our approach, demonstrating the effectiveness of pre-training the OC-GFN, and its ability to swiftly adapt to downstream tasks and discover modes more efficiently. This work may serve as a foundation for further exploration of pre-training strategies in the context of GFlowNets. ",
    "url": "https://arxiv.org/abs/2310.03419",
    "authors": [
      "Ling Pan",
      "Moksh Jain",
      "Kanika Madan",
      "Yoshua Bengio"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.03424",
    "title": "Neural Language Model Pruning for Automatic Speech Recognition",
    "abstract": "We study model pruning methods applied to Transformer-based neural network language models for automatic speech recognition. We explore three aspects of the pruning frame work, namely criterion, method and scheduler, analyzing their contribution in terms of accuracy and inference speed. To the best of our knowledge, such in-depth analyses on large-scale recognition systems has not been reported in the literature. In addition, we propose a variant of low-rank approximation suitable for incrementally compressing models, and delivering multiple models with varied target sizes. Among other results, we show that a) data-driven pruning outperforms magnitude-driven in several scenarios; b) incremental pruning achieves higher accuracy compared to one-shot pruning, especially when targeting smaller sizes; and c) low-rank approximation presents the best trade-off between size reduction and inference speed-up for moderate compression. ",
    "url": "https://arxiv.org/abs/2310.03424",
    "authors": [
      "Leonardo Emili",
      "Thiago Fraga-Silva",
      "Ernest Pusateri",
      "Markus Nußbaum-Thom",
      "Youssef Oualil"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.03431",
    "title": "Robust Zero Level-Set Extraction from Unsigned Distance Fields Based on  Double Covering",
    "abstract": "In this paper, we propose a new method, called DoubleCoverUDF, for extracting the zero level-set from unsigned distance fields (UDFs). DoubleCoverUDF takes a learned UDF and a user-specified parameter $r$ (a small positive real number) as input and extracts an iso-surface with an iso-value $r$ using the conventional marching cubes algorithm. We show that the computed iso-surface is the boundary of the $r$-offset volume of the target zero level-set $S$, which is an orientable manifold, regardless of the topology of $S$. Next, the algorithm computes a covering map to project the boundary mesh onto $S$, preserving the mesh's topology and avoiding folding. If $S$ is an orientable manifold surface, our algorithm separates the double-layered mesh into a single layer using a robust minimum-cut post-processing step. Otherwise, it keeps the double-layered mesh as the output. We validate our algorithm by reconstructing 3D surfaces of open models and demonstrate its efficacy and effectiveness on synthetic models and benchmark datasets. Our experimental results confirm that our method is robust and produces meshes with better quality in terms of both visual evaluation and quantitative measures than existing UDF-based methods. The source code is available at https://github.com/jjjkkyz/DCUDF. ",
    "url": "https://arxiv.org/abs/2310.03431",
    "authors": [
      "Fei Hou",
      "Xuhui Chen",
      "Wencheng Wang",
      "Hong Qin",
      "Ying He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.03457",
    "title": "A Quantitatively Interpretable Model for Alzheimer's Disease Prediction  Using Deep Counterfactuals",
    "abstract": "Deep learning (DL) for predicting Alzheimer's disease (AD) has provided timely intervention in disease progression yet still demands attentive interpretability to explain how their DL models make definitive decisions. Recently, counterfactual reasoning has gained increasing attention in medical research because of its ability to provide a refined visual explanatory map. However, such visual explanatory maps based on visual inspection alone are insufficient unless we intuitively demonstrate their medical or neuroscientific validity via quantitative features. In this study, we synthesize the counterfactual-labeled structural MRIs using our proposed framework and transform it into a gray matter density map to measure its volumetric changes over the parcellated region of interest (ROI). We also devised a lightweight linear classifier to boost the effectiveness of constructed ROIs, promoted quantitative interpretation, and achieved comparable predictive performance to DL methods. Throughout this, our framework produces an ``AD-relatedness index'' for each ROI and offers an intuitive understanding of brain status for an individual patient and across patient groups with respect to AD progression. ",
    "url": "https://arxiv.org/abs/2310.03457",
    "authors": [
      "Kwanseok Oh",
      "Da-Woon Heo",
      "Ahmad Wisnu Mulyadi",
      "Wonsik Jung",
      "Eunsong Kang",
      "Kun Ho Lee",
      "Heung-Il Suk"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2310.03470",
    "title": "Cyber Physical System Information Collection: Robot Location and  Navigation Method Based on QR Code",
    "abstract": "In this paper, we propose a method to estimate the exact location of a camera in a cyber-physical system using the exact geographic coordinates of four feature points stored in QR codes(Quick response codes) and the pixel coordinates of four feature points analyzed from the QR code images taken by the camera. Firstly, the P4P(Perspective 4 Points) algorithm is designed to uniquely determine the initial pose estimation value of the QR coordinate system relative to the camera coordinate system by using the four feature points of the selected QR code. In the second step, the manifold gradient optimization algorithm is designed. The rotation matrix and displacement vector are taken as the initial values of iteration, and the iterative optimization is carried out to improve the positioning accuracy and obtain the rotation matrix and displacement vector with higher accuracy. The third step is to convert the pose of the QR coordinate system with respect to the camera coordinate system to the pose of the AGV(Automated Guided Vehicle) with respect to the world coordinate system. Finally, the performance of manifold gradient optimization algorithm and P4P analytical algorithm are simulated and compared under the same conditions.One can see that the performance of the manifold gradient optimization algorithm proposed in this paper is much better than that of the P4P analytic algorithm when the signal-to-noise ratio is small.With the increase of the signal-to-noise ratio,the performance of the P4P analytic algorithm approaches that of the manifold gradient optimization algorithm.when the noise is same,the performance of manifold gradient optimization algorithm is better when there are more feature points. ",
    "url": "https://arxiv.org/abs/2310.03470",
    "authors": [
      "Hongwei Li",
      "Tao Xiong"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.03477",
    "title": "Tik-to-Tok: Translating Language Models One Token at a Time: An  Embedding Initialization Strategy for Efficient Language Adaptation",
    "abstract": "Training monolingual language models for low and mid-resource languages is made challenging by limited and often inadequate pretraining data. In this study, we propose a novel model conversion strategy to address this issue, adapting high-resources monolingual language models to a new target language. By generalizing over a word translation dictionary encompassing both the source and target languages, we map tokens from the target tokenizer to semantically similar tokens from the source language tokenizer. This one-to-many token mapping improves tremendously the initialization of the embedding table for the target language. We conduct experiments to convert high-resource models to mid- and low-resource languages, namely Dutch and Frisian. These converted models achieve a new state-of-the-art performance on these languages across all sorts of downstream tasks. By reducing significantly the amount of data and time required for training state-of-the-art models, our novel model conversion strategy has the potential to benefit many languages worldwide. ",
    "url": "https://arxiv.org/abs/2310.03477",
    "authors": [
      "François Remy",
      "Pieter Delobelle",
      "Bettina Berendt",
      "Kris Demuynck",
      "Thomas Demeester"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.03507",
    "title": "RL-based Stateful Neural Adaptive Sampling and Denoising for Real-Time  Path Tracing",
    "abstract": "Monte-Carlo path tracing is a powerful technique for realistic image synthesis but suffers from high levels of noise at low sample counts, limiting its use in real-time applications. To address this, we propose a framework with end-to-end training of a sampling importance network, a latent space encoder network, and a denoiser network. Our approach uses reinforcement learning to optimize the sampling importance network, thus avoiding explicit numerically approximated gradients. Our method does not aggregate the sampled values per pixel by averaging but keeps all sampled values which are then fed into the latent space encoder. The encoder replaces handcrafted spatiotemporal heuristics by learned representations in a latent space. Finally, a neural denoiser is trained to refine the output image. Our approach increases visual quality on several challenging datasets and reduces rendering times for equal quality by a factor of 1.6x compared to the previous state-of-the-art, making it a promising solution for real-time applications. ",
    "url": "https://arxiv.org/abs/2310.03507",
    "authors": [
      "Antoine Scardigli",
      "Lukas Cavigelli",
      "Lorenz K. Müller"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2310.03518",
    "title": "Towards Robust and Generalizable Training: An Empirical Study of Noisy  Slot Filling for Input Perturbations",
    "abstract": "In real dialogue scenarios, as there are unknown input noises in the utterances, existing supervised slot filling models often perform poorly in practical applications. Even though there are some studies on noise-robust models, these works are only evaluated on rule-based synthetic datasets, which is limiting, making it difficult to promote the research of noise-robust methods. In this paper, we introduce a noise robustness evaluation dataset named Noise-SF for slot filling task. The proposed dataset contains five types of human-annotated noise, and all those noises are exactly existed in real extensive robust-training methods of slot filling into the proposed framework. By conducting exhaustive empirical evaluation experiments on Noise-SF, we find that baseline models have poor performance in robustness evaluation, and the proposed framework can effectively improve the robustness of models. Based on the empirical experimental results, we make some forward-looking suggestions to fuel the research in this direction. Our dataset Noise-SF will be released at https://github.com/dongguanting/Noise-SF. ",
    "url": "https://arxiv.org/abs/2310.03518",
    "authors": [
      "Jiachi Liu",
      "Liwen Wang",
      "Guanting Dong",
      "Xiaoshuai Song",
      "Zechen Wang",
      "Zhengyang Wang",
      "Shanglin Lei",
      "Jinzheng Zhao",
      "Keqing He",
      "Bo Xiao",
      "Weiran Xu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2310.03529",
    "title": "Deep Ridgelet Transform: Voice with Koopman Operator Proves Universality  of Formal Deep Networks",
    "abstract": "We identify hidden layers inside a DNN with group actions on the data space, and formulate the DNN as a dual voice transform with respect to Koopman operator, a linear representation of the group action. Based on the group theoretic arguments, particularly by using Schur's lemma, we show a simple proof of the universality of those DNNs. ",
    "url": "https://arxiv.org/abs/2310.03529",
    "authors": [
      "Sho Sonoda",
      "Yuka Hashimoto",
      "Isao Ishikawa",
      "Masahiro Ikeda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.03530",
    "title": "Joint Group Invariant Functions on Data-Parameter Domain Induce  Universal Neural Networks",
    "abstract": "The symmetry and geometry of input data are considered to be encoded in the internal data representation inside the neural network, but the specific encoding rule has been less investigated. By focusing on a joint group invariant function on the data-parameter domain, we present a systematic rule to find a dual group action on the parameter domain from a group action on the data domain. Further, we introduce generalized neural networks induced from the joint invariant functions, and present a new group theoretic proof of their universality theorems by using Schur's lemma. Since traditional universality theorems were demonstrated based on functional analytical methods, this study sheds light on the group theoretic aspect of the approximation theory, connecting geometric deep learning to abstract harmonic analysis. ",
    "url": "https://arxiv.org/abs/2310.03530",
    "authors": [
      "Sho Sonoda",
      "Hideyuki Ishi",
      "Isao Ishikawa",
      "Masahiro Ikeda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.03554",
    "title": "Digital Twin-Empowered Smart Attack Detection System for 6G Edge of  Things Networks",
    "abstract": "As global Internet of Things (IoT) devices connectivity surges, a significant portion gravitates towards the Edge of Things (EoT) network. This shift prompts businesses to deploy infrastructure closer to end-users, enhancing accessibility. However, the growing EoT network expands the attack surface, necessitating robust and proactive security measures. Traditional solutions fall short against dynamic EoT threats, highlighting the need for proactive and intelligent systems. We introduce a digital twin-empowered smart attack detection system for 6G EoT networks. Leveraging digital twin and edge computing, it monitors and simulates physical assets in real time, enhancing security. An online learning module in the proposed system optimizes the network performance. Our system excels in proactive threat detection, ensuring 6G EoT network security. The performance evaluations demonstrate its effectiveness, robustness, and adaptability using real datasets. ",
    "url": "https://arxiv.org/abs/2310.03554",
    "authors": [
      "Yagmur Yigit",
      "Christos Chrysoulas",
      "Gokhan Yurdakul",
      "Leandros Maglaras",
      "Berk Canberk"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2310.03563",
    "title": "BID-NeRF: RGB-D image pose estimation with inverted Neural Radiance  Fields",
    "abstract": "We aim to improve the Inverted Neural Radiance Fields (iNeRF) algorithm which defines the image pose estimation problem as a NeRF based iterative linear optimization. NeRFs are novel neural space representation models that can synthesize photorealistic novel views of real-world scenes or objects. Our contributions are as follows: we extend the localization optimization objective with a depth-based loss function, we introduce a multi-image based loss function where a sequence of images with known relative poses are used without increasing the computational complexity, we omit hierarchical sampling during volumetric rendering, meaning only the coarse model is used for pose estimation, and we how that by extending the sampling interval convergence can be achieved even or higher initial pose estimate errors. With the proposed modifications the convergence speed is significantly improved, and the basin of convergence is substantially extended. ",
    "url": "https://arxiv.org/abs/2310.03563",
    "authors": [
      "Ágoston István Csehi",
      "Csaba Máté Józsa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.03572",
    "title": "Residual Multi-Fidelity Neural Network Computing",
    "abstract": "In this work, we consider the general problem of constructing a neural network surrogate model using multi-fidelity information. Given an inexpensive low-fidelity and an expensive high-fidelity computational model, we present a residual multi-fidelity computational framework that formulates the correlation between models as a residual function, a possibly non-linear mapping between 1) the shared input space of the models together with the low-fidelity model output and 2) the discrepancy between the two model outputs. To accomplish this, we train two neural networks to work in concert. The first network learns the residual function on a small set of high-fidelity and low-fidelity data. Once trained, this network is used to generate additional synthetic high-fidelity data, which is used in the training of a second network. This second network, once trained, acts as our surrogate for the high-fidelity quantity of interest. We present three numerical examples to demonstrate the power of the proposed framework. In particular, we show that dramatic savings in computational cost may be achieved when the output predictions are desired to be accurate within small tolerances. ",
    "url": "https://arxiv.org/abs/2310.03572",
    "authors": [
      "Owen Davis",
      "Mohammad Motamed",
      "Raul Tempone"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2310.03578",
    "title": "Targeted Adversarial Attacks on Generalizable Neural Radiance Fields",
    "abstract": "Neural Radiance Fields (NeRFs) have recently emerged as a powerful tool for 3D scene representation and rendering. These data-driven models can learn to synthesize high-quality images from sparse 2D observations, enabling realistic and interactive scene reconstructions. However, the growing usage of NeRFs in critical applications such as augmented reality, robotics, and virtual environments could be threatened by adversarial attacks. In this paper we present how generalizable NeRFs can be attacked by both low-intensity adversarial attacks and adversarial patches, where the later could be robust enough to be used in real world applications. We also demonstrate targeted attacks, where a specific, predefined output scene is generated by these attack with success. ",
    "url": "https://arxiv.org/abs/2310.03578",
    "authors": [
      "Andras Horvath",
      "Csaba M. Jozsa"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03579",
    "title": "Causal Inference in Gene Regulatory Networks with GFlowNet: Towards  Scalability in Large Systems",
    "abstract": "Understanding causal relationships within Gene Regulatory Networks (GRNs) is essential for unraveling the gene interactions in cellular processes. However, causal discovery in GRNs is a challenging problem for multiple reasons including the existence of cyclic feedback loops and uncertainty that yields diverse possible causal structures. Previous works in this area either ignore cyclic dynamics (assume acyclic structure) or struggle with scalability. We introduce Swift-DynGFN as a novel framework that enhances causal structure learning in GRNs while addressing scalability concerns. Specifically, Swift-DynGFN exploits gene-wise independence to boost parallelization and to lower computational cost. Experiments on real single-cell RNA velocity and synthetic GRN datasets showcase the advancement in learning causal structure in GRNs and scalability in larger systems. ",
    "url": "https://arxiv.org/abs/2310.03579",
    "authors": [
      "Trang Nguyen",
      "Alexander Tong",
      "Kanika Madan",
      "Yoshua Bengio",
      "Dianbo Liu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Molecular Networks (q-bio.MN)"
    ]
  },
  {
    "id": "arXiv:2310.03605",
    "title": "FASER: Binary Code Similarity Search through the use of Intermediate  Representations",
    "abstract": "Being able to identify functions of interest in cross-architecture software is useful whether you are analysing for malware, securing the software supply chain or conducting vulnerability research. Cross-Architecture Binary Code Similarity Search has been explored in numerous studies and has used a wide range of different data sources to achieve its goals. The data sources typically used draw on common structures derived from binaries such as function control flow graphs or binary level call graphs, the output of the disassembly process or the outputs of a dynamic analysis approach. One data source which has received less attention is binary intermediate representations. Binary Intermediate representations possess two interesting properties: they are cross architecture by their very nature and encode the semantics of a function explicitly to support downstream usage. Within this paper we propose Function as a String Encoded Representation (FASER) which combines long document transformers with the use of intermediate representations to create a model capable of cross architecture function search without the need for manual feature engineering, pre-training or a dynamic analysis step. We compare our approach against a series of baseline approaches for two tasks; A general function search task and a targeted vulnerability search task. Our approach demonstrates strong performance across both tasks, performing better than all baseline approaches. ",
    "url": "https://arxiv.org/abs/2310.03605",
    "authors": [
      "Josh Collyer",
      "Tim Watson",
      "Iain Phillips"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03611",
    "title": "GENER: A Parallel Layer Deep Learning Network To Detect Gene-Gene  Interactions From Gene Expression Data",
    "abstract": "Detecting and discovering new gene interactions based on known gene expressions and gene interaction data presents a significant challenge. Various statistical and deep learning methods have attempted to tackle this challenge by leveraging the topological structure of gene interactions and gene expression patterns to predict novel gene interactions. In contrast, some approaches have focused exclusively on utilizing gene expression profiles. In this context, we introduce GENER, a parallel-layer deep learning network designed exclusively for the identification of gene-gene relationships using gene expression data. We conducted two training experiments and compared the performance of our network with that of existing statistical and deep learning approaches. Notably, our model achieved an average AUROC score of 0.834 on the combined BioGRID&DREAM5 dataset, outperforming competing methods in predicting gene-gene interactions. ",
    "url": "https://arxiv.org/abs/2310.03611",
    "authors": [
      "Ahmed Fakhry Elnaggar",
      "Raneem Ali Khafagy",
      "Adriaan-Alexander Ludl"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03614",
    "title": "Adversarial Machine Learning for Social Good: Reframing the Adversary as  an Ally",
    "abstract": "Deep Neural Networks (DNNs) have been the driving force behind many of the recent advances in machine learning. However, research has shown that DNNs are vulnerable to adversarial examples -- input samples that have been perturbed to force DNN-based models to make errors. As a result, Adversarial Machine Learning (AdvML) has gained a lot of attention, and researchers have investigated these vulnerabilities in various settings and modalities. In addition, DNNs have also been found to incorporate embedded bias and often produce unexplainable predictions, which can result in anti-social AI applications. The emergence of new AI technologies that leverage Large Language Models (LLMs), such as ChatGPT and GPT-4, increases the risk of producing anti-social applications at scale. AdvML for Social Good (AdvML4G) is an emerging field that repurposes the AdvML bug to invent pro-social applications. Regulators, practitioners, and researchers should collaborate to encourage the development of pro-social applications and hinder the development of anti-social ones. In this work, we provide the first comprehensive review of the emerging field of AdvML4G. This paper encompasses a taxonomy that highlights the emergence of AdvML4G, a discussion of the differences and similarities between AdvML4G and AdvML, a taxonomy covering social good-related concepts and aspects, an exploration of the motivations behind the emergence of AdvML4G at the intersection of ML4G and AdvML, and an extensive summary of the works that utilize AdvML4G as an auxiliary tool for innovating pro-social applications. Finally, we elaborate upon various challenges and open research issues that require significant attention from the research community. ",
    "url": "https://arxiv.org/abs/2310.03614",
    "authors": [
      "Shawqi Al-Maliki",
      "Adnan Qayyum",
      "Hassan Ali",
      "Mohamed Abdallah",
      "Junaid Qadir",
      "Dinh Thai Hoang",
      "Dusit Niyato",
      "Ala Al-Fuqaha"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2310.03617",
    "title": "RouteKG: A knowledge graph-based framework for route prediction on road  networks",
    "abstract": "Short-term route prediction on road networks allows us to anticipate the future trajectories of road users, enabling a plethora of intelligent transportation applications such as dynamic traffic control or personalized route recommendation. Despite the recent advances in this area, existing methods focus primarily on learning sequential patterns, neglecting the inherent spatial structure in road networks that can affect human routing decisions. To fill the gap, this paper introduces RouteKG, a novel Knowledge Graph-based framework for route prediction. Specifically, we construct a Knowledge Graph on the road network, thereby learning and leveraging spatial relations, especially moving directions, which are crucial for human navigation. Moreover, an n-ary tree-based algorithm is introduced to efficiently generate top-K routes in a batch mode, enhancing scalability and computational efficiency. To further optimize the prediction performance, a rank refinement module is incorporated to fine-tune the candidate route rankings. The model performance is evaluated using two real-world vehicle trajectory datasets from two Chinese cities, Chengdu and Shanghai, under various practical scenarios. The results demonstrate a significant improvement in accuracy over baseline methods, with an average increase of 6.2%, 7.8%, and 6.1% in top-1, 5, and 10 routes predictions, respectively. We further validate our model through a case study that utilizes the pretrained model as a simulator for real-time traffic flow estimation at the link level. The proposed RouteKG promises wide-ranging applications in vehicle navigation, traffic management, and other intelligent transportation tasks. ",
    "url": "https://arxiv.org/abs/2310.03617",
    "authors": [
      "Yihong Tang",
      "Weipeng Deng",
      "Shuyu Lei",
      "Yuebing Liang",
      "Zhenliang Ma",
      "Zhan Zhao"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2310.03620",
    "title": "PeaTMOSS: Mining Pre-Trained Models in Open-Source Software",
    "abstract": "Developing and training deep learning models is expensive, so software engineers have begun to reuse pre-trained deep learning models (PTMs) and fine-tune them for downstream tasks. Despite the wide-spread use of PTMs, we know little about the corresponding software engineering behaviors and challenges. To enable the study of software engineering with PTMs, we present the PeaTMOSS dataset: Pre-Trained Models in Open-Source Software. PeaTMOSS has three parts: a snapshot of (1) 281,638 PTMs, (2) 27,270 open-source software repositories that use PTMs, and (3) a mapping between PTMs and the projects that use them. We challenge PeaTMOSS miners to discover software engineering practices around PTMs. A demo and link to the full dataset are available at: https://github.com/PurdueDualityLab/PeaTMOSS-Demos. ",
    "url": "https://arxiv.org/abs/2310.03620",
    "authors": [
      "Wenxin Jiang",
      "Jason Jones",
      "Jerin Yasmin",
      "Nicholas Synovic",
      "Rajeev Sashti",
      "Sophie Chen",
      "George K. Thiruvathukal",
      "Yuan Tian",
      "James C. Davis"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.03624",
    "title": "High-Degrees-of-Freedom Dynamic Neural Fields for Robot Self-Modeling  and Motion Planning",
    "abstract": "A robot self-model is a task-agnostic representation of the robot's physical morphology that can be used for motion planning tasks in absence of classical geometric kinematic models. In particular, when the latter are hard to engineer or the robot's kinematics change unexpectedly, human-free self-modeling is a necessary feature of truly autonomous agents. In this work, we leverage neural fields to allow a robot to self-model its kinematics as a neural-implicit query model learned only from 2D images annotated with camera poses and configurations. This enables significantly greater applicability than existing approaches which have been dependent on depth images or geometry knowledge. To this end, alongside a curricular data sampling strategy, we propose a new encoder-based neural density field architecture for dynamic object-centric scenes conditioned on high numbers of degrees of freedom (DOFs). In a 7-DOF robot test setup, the learned self-model achieves a Chamfer-L2 distance of 2% of the robot's workspace dimension. We demonstrate the capabilities of this model on a motion planning task as an exemplary downstream application. ",
    "url": "https://arxiv.org/abs/2310.03624",
    "authors": [
      "Lennart Schulze",
      "Hod Lipson"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.03634",
    "title": "When a random tape is not enough: lower bounds for a problem in  adversarially robust streaming",
    "abstract": "Adversarially robust streaming algorithms are required to process a stream of elements and produce correct outputs, even when each stream element can be chosen depending on earlier algorithm outputs. As with classic streaming algorithms, which must only be correct for the worst-case fixed stream, adversarially robust algorithms with access to randomness can use significantly less space than deterministic algorithms. We prove that for the Missing Item Finding problem in streaming, the space complexity also significantly depends on how adversarially robust algorithms are permitted to use randomness. (In contrast, the space complexity of classic streaming algorithms does not depend as strongly on the way randomness is used.) For Missing Item Finding on streams of length $r$ with elements in $\\{1,...n\\}$, and $\\le 1/\\text{poly}(n)$ error, we show that when $r = O(2^{\\sqrt{\\log n}})$, \"random seed\" adversarially robust algorithms, which only use randomness at initialization, require $r^{\\Omega(1)}$ bits of space, while \"random tape\" adversarially robust algorithms, which may make random decisions at any time, may use $O(\\text{polylog}(r))$ random bits. When $r = \\Theta(\\sqrt{n})$, \"random tape\" adversarially robust algorithms need $r^{\\Omega(1)}$ space, while \"random oracle\" adversarially robust algorithms, which can read from a long random string for free, may use $O(\\text{polylog}(r))$ space. The space lower bound for the \"random seed\" case follows, by a reduction given in prior work, from a lower bound for pseudo-deterministic streaming algorithms given in this paper. ",
    "url": "https://arxiv.org/abs/2310.03634",
    "authors": [
      "Amit Chakrabarti",
      "Manuel Stoeckl"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2310.03635",
    "title": "CLEVRER-Humans: Describing Physical and Causal Events the Human Way",
    "abstract": "Building machines that can reason about physical events and their causal relationships is crucial for flexible interaction with the physical world. However, most existing physical and causal reasoning benchmarks are exclusively based on synthetically generated events and synthetic natural language descriptions of causal relationships. This design brings up two issues. First, there is a lack of diversity in both event types and natural language descriptions; second, causal relationships based on manually-defined heuristics are different from human judgments. To address both shortcomings, we present the CLEVRER-Humans benchmark, a video reasoning dataset for causal judgment of physical events with human labels. We employ two techniques to improve data collection efficiency: first, a novel iterative event cloze task to elicit a new representation of events in videos, which we term Causal Event Graphs (CEGs); second, a data augmentation technique based on neural language generative models. We convert the collected CEGs into questions and answers to be consistent with prior work. Finally, we study a collection of baseline approaches for CLEVRER-Humans question-answering, highlighting the great challenges set forth by our benchmark. ",
    "url": "https://arxiv.org/abs/2310.03635",
    "authors": [
      "Jiayuan Mao",
      "Xuelin Yang",
      "Xikun Zhang",
      "Noah D. Goodman",
      "Jiajun Wu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.03639",
    "title": "Evaluating Self-Supervised Speech Representations for Indigenous  American Languages",
    "abstract": "The application of self-supervision to speech representation learning has garnered significant interest in recent years, due to its scalability to large amounts of unlabeled data. However, much progress, both in terms of pre-training and downstream evaluation, has remained concentrated in monolingual models that only consider English. Few models consider other languages, and even fewer consider indigenous ones. In our submission to the New Language Track of the ASRU 2023 ML-SUPERB Challenge, we present an ASR corpus for Quechua, an indigenous South American Language. We benchmark the efficacy of large SSL models on Quechua, along with 6 other indigenous languages such as Guarani and Bribri, on low-resource ASR. Our results show surprisingly strong performance by state-of-the-art SSL models, showing the potential generalizability of large-scale models to real-world data. ",
    "url": "https://arxiv.org/abs/2310.03639",
    "authors": [
      "Chih-Chen Chen",
      "William Chen",
      "Rodolfo Zevallos",
      "John Ortega"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.03652",
    "title": "Extreme sparsification of physics-augmented neural networks for  interpretable model discovery in mechanics",
    "abstract": "Data-driven constitutive modeling with neural networks has received increased interest in recent years due to its ability to easily incorporate physical and mechanistic constraints and to overcome the challenging and time-consuming task of formulating phenomenological constitutive laws that can accurately capture the observed material response. However, even though neural network-based constitutive laws have been shown to generalize proficiently, the generated representations are not easily interpretable due to their high number of trainable parameters. Sparse regression approaches exist that allow to obtaining interpretable expressions, but the user is tasked with creating a library of model forms which by construction limits their expressiveness to the functional forms provided in the libraries. In this work, we propose to train regularized physics-augmented neural network-based constitutive models utilizing a smoothed version of $L^{0}$-regularization. This aims to maintain the trustworthiness inherited by the physical constraints, but also enables interpretability which has not been possible thus far on any type of machine learning-based constitutive model where model forms were not assumed a-priory but were actually discovered. During the training process, the network simultaneously fits the training data and penalizes the number of active parameters, while also ensuring constitutive constraints such as thermodynamic consistency. We show that the method can reliably obtain interpretable and trustworthy constitutive models for compressible and incompressible hyperelasticity, yield functions, and hardening models for elastoplasticity, for synthetic and experimental data. ",
    "url": "https://arxiv.org/abs/2310.03652",
    "authors": [
      "Jan N. Fuhg",
      "Reese E. Jones",
      "Nikolaos Bouklas"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03670",
    "title": "Regress Before Construct: Regress Autoencoder for Point Cloud  Self-supervised Learning",
    "abstract": "Masked Autoencoders (MAE) have demonstrated promising performance in self-supervised learning for both 2D and 3D computer vision. Nevertheless, existing MAE-based methods still have certain drawbacks. Firstly, the functional decoupling between the encoder and decoder is incomplete, which limits the encoder's representation learning ability. Secondly, downstream tasks solely utilize the encoder, failing to fully leverage the knowledge acquired through the encoder-decoder architecture in the pre-text task. In this paper, we propose Point Regress AutoEncoder (Point-RAE), a new scheme for regressive autoencoders for point cloud self-supervised learning. The proposed method decouples functions between the decoder and the encoder by introducing a mask regressor, which predicts the masked patch representation from the visible patch representation encoded by the encoder and the decoder reconstructs the target from the predicted masked patch representation. By doing so, we minimize the impact of decoder updates on the representation space of the encoder. Moreover, we introduce an alignment constraint to ensure that the representations for masked patches, predicted from the encoded representations of visible patches, are aligned with the masked patch presentations computed from the encoder. To make full use of the knowledge learned in the pre-training stage, we design a new finetune mode for the proposed Point-RAE. Extensive experiments demonstrate that our approach is efficient during pre-training and generalizes well on various downstream tasks. Specifically, our pre-trained models achieve a high accuracy of \\textbf{90.28\\%} on the ScanObjectNN hardest split and \\textbf{94.1\\%} accuracy on ModelNet40, surpassing all the other self-supervised learning methods. Our code and pretrained model are public available at: \\url{https://github.com/liuyyy111/Point-RAE}. ",
    "url": "https://arxiv.org/abs/2310.03670",
    "authors": [
      "Yang Liu",
      "Chen Chen",
      "Can Wang",
      "Xulin King",
      "Mengyuan Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.03684",
    "title": "SmoothLLM: Defending Large Language Models Against Jailbreaking Attacks",
    "abstract": "Despite efforts to align large language models (LLMs) with human values, widely-used LLMs such as GPT, Llama, Claude, and PaLM are susceptible to jailbreaking attacks, wherein an adversary fools a targeted LLM into generating objectionable content. To address this vulnerability, we propose SmoothLLM, the first algorithm designed to mitigate jailbreaking attacks on LLMs. Based on our finding that adversarially-generated prompts are brittle to character-level changes, our defense first randomly perturbs multiple copies of a given input prompt, and then aggregates the corresponding predictions to detect adversarial inputs. SmoothLLM reduces the attack success rate on numerous popular LLMs to below one percentage point, avoids unnecessary conservatism, and admits provable guarantees on attack mitigation. Moreover, our defense uses exponentially fewer queries than existing attacks and is compatible with any LLM. ",
    "url": "https://arxiv.org/abs/2310.03684",
    "authors": [
      "Alexander Robey",
      "Eric Wong",
      "Hamed Hassani",
      "George J. Pappas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.03702",
    "title": "Robust Analysis of Auction Equilibria",
    "abstract": "Equilibria in auctions can be very difficult to analyze, beyond the symmetric environments where revenue equivalence renders the analysis straightforward. This paper takes a robust approach to evaluating the equilibria of auctions. Rather than identify the equilibria of an auction under specific environmental conditions, it considers worst-case analysis, where an auction is evaluated according to the worst environment and worst equilibrium in that environment. It identifies a non-equilibrium property of auctions that governs whether or not their worst-case equilibria are good for welfare and revenue. This property is easy to analyze, can be refined from data, and composes across markets where multiple auctions are run simultaneously. ",
    "url": "https://arxiv.org/abs/2310.03702",
    "authors": [
      "Jason Hartline",
      "Darrell Hoy",
      "Samuel Taggart"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2310.03707",
    "title": "OMG-ATTACK: Self-Supervised On-Manifold Generation of Transferable  Evasion Attacks",
    "abstract": "Evasion Attacks (EA) are used to test the robustness of trained neural networks by distorting input data to misguide the model into incorrect classifications. Creating these attacks is a challenging task, especially with the ever-increasing complexity of models and datasets. In this work, we introduce a self-supervised, computationally economical method for generating adversarial examples, designed for the unseen black-box setting. Adapting techniques from representation learning, our method generates on-manifold EAs that are encouraged to resemble the data distribution. These attacks are comparable in effectiveness compared to the state-of-the-art when attacking the model trained on, but are significantly more effective when attacking unseen models, as the attacks are more related to the data rather than the model itself. Our experiments consistently demonstrate the method is effective across various models, unseen data categories, and even defended models, suggesting a significant role for on-manifold EAs when targeting unseen models. ",
    "url": "https://arxiv.org/abs/2310.03707",
    "authors": [
      "Ofir Bar Tal",
      "Adi Haviv",
      "Amit H. Bermano"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.03731",
    "title": "MathCoder: Seamless Code Integration in LLMs for Enhanced Mathematical  Reasoning",
    "abstract": "The recently released GPT-4 Code Interpreter has demonstrated remarkable proficiency in solving challenging math problems, primarily attributed to its ability to seamlessly reason with natural language, generate code, execute code, and continue reasoning based on the execution output. In this paper, we present a method to fine-tune open-source language models, enabling them to use code for modeling and deriving math equations and, consequently, enhancing their mathematical reasoning abilities. We propose a method of generating novel and high-quality datasets with math problems and their code-based solutions, referred to as MathCodeInstruct. Each solution interleaves natural language, code, and execution results. We also introduce a customized supervised fine-tuning and inference approach. This approach yields the MathCoder models, a family of models capable of generating code-based solutions for solving challenging math problems. Impressively, the MathCoder models achieve state-of-the-art scores among open-source LLMs on the MATH (45.2%) and GSM8K (83.9%) datasets, substantially outperforming other open-source alternatives. Notably, the MathCoder model not only surpasses ChatGPT-3.5 and PaLM-2 on GSM8K and MATH but also outperforms GPT-4 on the competition-level MATH dataset. The dataset and models will be released at https://github.com/mathllm/MathCoder. ",
    "url": "https://arxiv.org/abs/2310.03731",
    "authors": [
      "Ke Wang",
      "Houxing Ren",
      "Aojun Zhou",
      "Zimu Lu",
      "Sichun Luo",
      "Weikang Shi",
      "Renrui Zhang",
      "Linqi Song",
      "Mingjie Zhan",
      "Hongsheng Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03738",
    "title": "Stylist: Style-Driven Feature Ranking for Robust Novelty Detection",
    "abstract": "Novelty detection aims at finding samples that differ in some form from the distribution of seen samples. But not all changes are created equal. Data can suffer a multitude of distribution shifts, and we might want to detect only some types of relevant changes. Similar to works in out-of-distribution generalization, we propose to use the formalization of separating into semantic or content changes, that are relevant to our task, and style changes, that are irrelevant. Within this formalization, we define the robust novelty detection as the task of finding semantic changes while being robust to style distributional shifts. Leveraging pretrained, large-scale model representations, we introduce Stylist, a novel method that focuses on dropping environment-biased features. First, we compute a per-feature score based on the feature distribution distances between environments. Next, we show that our selection manages to remove features responsible for spurious correlations and improve novelty detection performance. For evaluation, we adapt domain generalization datasets to our task and analyze the methods behaviors. We additionally built a large synthetic dataset where we have control over the spurious correlations degree. We prove that our selection mechanism improves novelty detection algorithms across multiple datasets, containing both stylistic and content shifts. ",
    "url": "https://arxiv.org/abs/2310.03738",
    "authors": [
      "Stefan Smeu",
      "Elena Burceanu",
      "Emanuela Haller",
      "Andrei Liviu Nicolicioiu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03742",
    "title": "A High-Performance Design, Implementation, Deployment, and Evaluation of  The Slim Fly Network",
    "abstract": "Novel low-diameter network topologies such as Slim Fly (SF) offer significant cost and power advantages over the established Fat Tree, Clos, or Dragonfly. To spearhead the adoption of low-diameter networks, we design, implement, deploy, and evaluate the first real-world SF installation. We focus on deployment, management, and operational aspects of our test cluster with 200 servers and carefully analyze performance. We demonstrate techniques for simple cabling and cabling validation as well as a novel high-performance routing architecture for InfiniBand-based low-diameter topologies. Our real-world benchmarks show SF's strong performance for many modern workloads such as deep neural network training, graph analytics, or linear algebra kernels. SF outperforms non-blocking Fat Trees in scalability while offering comparable or better performance and lower cost for large network sizes. Our work can facilitate deploying SF while the associated (open-source) routing architecture is fully portable and applicable to accelerate any low-diameter interconnect. ",
    "url": "https://arxiv.org/abs/2310.03742",
    "authors": [
      "Nils Blach",
      "Maciej Besta",
      "Daniele De Sensi",
      "Jens Domke",
      "Hussein Harake",
      "Shigang Li",
      "Patrick Iff",
      "Marek Konieczny",
      "Kartik Lakhotia",
      "Ales Kubicek",
      "Marcel Ferrari",
      "Fabrizio Petrini",
      "Torsten Hoefler"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2310.03027",
    "title": "Synergistic Fusion of Graph and Transformer Features for Enhanced  Molecular Property Prediction",
    "abstract": "Molecular property prediction is a critical task in computational drug discovery. While recent advances in Graph Neural Networks (GNNs) and Transformers have shown to be effective and promising, they face the following limitations: Transformer self-attention does not explicitly consider the underlying molecule structure while GNN feature representation alone is not sufficient to capture granular and hidden interactions and characteristics that distinguish similar molecules. To address these limitations, we propose SYN- FUSION, a novel approach that synergistically combines pre-trained features from GNNs and Transformers. This approach provides a comprehensive molecular representation, capturing both the global molecule structure and the individual atom characteristics. Experimental results on MoleculeNet benchmarks demonstrate superior performance, surpassing previous models in 5 out of 7 classification datasets and 4 out of 6 regression datasets. The performance of SYN-FUSION has been compared with other Graph-Transformer models that have been jointly trained using a combination of transformer and graph features, and it is found that our approach is on par with those models in terms of performance. Extensive analysis of the learned fusion model across aspects such as loss, latent space, and weight distribution further validates the effectiveness of SYN-FUSION. Finally, an ablation study unequivocally demonstrates that the synergy achieved by SYN-FUSION surpasses the performance of its individual model components and their ensemble, offering a substantial improvement in predicting molecular properties. ",
    "url": "https://arxiv.org/abs/2310.03027",
    "authors": [
      "M V Sai Prakash",
      "Siddartha Reddy N",
      "Ganesh Parab",
      "Varun V",
      "Vishal Vaddina",
      "Saisubramaniam Gopalakrishnan"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03028",
    "title": "SAF: Smart Aggregation Framework for Revealing Atoms Importance Rank and  Improving Prediction Rates in Drug Discovery",
    "abstract": "Machine learning, and representation learning in particular, has the potential to facilitate drug discovery by screening a large chemical space in silico. A successful approach for representing molecules is to treat them as a graph and utilize graph neural networks. One of the key limitations of such methods is the necessity to represent compounds with different numbers of atoms, which requires aggregating the atom's information. Common aggregation operators, such as averaging, result in loss of information at the atom level. In this work, we propose a novel aggregating approach where each atom is weighted non-linearly using the Boltzmann distribution with a hyperparameter analogous to temperature. We show that using this weighted aggregation improves the ability of the gold standard message-passing neural network to predict antibiotic activity. Moreover, by changing the temperature hyperparameter, our approach can reveal the atoms that are important for activity prediction in a smooth and consistent way, thus providing a novel, regulated attention mechanism for graph neural networks. We further validate our method by showing that it recapitulates the functional group in beta-Lactam antibiotics. The ability of our approach to rank the atoms' importance for a desired function can be used within any graph neural network to provide interpretability of the results and predictions at the node level. ",
    "url": "https://arxiv.org/abs/2310.03028",
    "authors": [
      "Ronen Taub",
      "Yonatan Savir"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03030",
    "title": "GPT-MolBERTa: GPT Molecular Features Language Model for molecular  property prediction",
    "abstract": "With the emergence of Transformer architectures and their powerful understanding of textual data, a new horizon has opened up to predict the molecular properties based on text description. While SMILES are the most common form of representation, they are lacking robustness, rich information and canonicity, which limit their effectiveness in becoming generalizable representations. Here, we present GPT-MolBERTa, a self-supervised large language model (LLM) which uses detailed textual descriptions of molecules to predict their properties. A text based description of 326000 molecules were collected using ChatGPT and used to train LLM to learn the representation of molecules. To predict the properties for the downstream tasks, both BERT and RoBERTa models were used in the finetuning stage. Experiments show that GPT-MolBERTa performs well on various molecule property benchmarks, and approaching state of the art performance in regression tasks. Additionally, further analysis of the attention mechanisms show that GPT-MolBERTa is able to pick up important information from the input textual data, displaying the interpretability of the model. ",
    "url": "https://arxiv.org/abs/2310.03030",
    "authors": [
      "Suryanarayanan Balaji",
      "Rishikesh Magar",
      "Yayati Jadhav",
      "and Amir BaratiFarimani"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03106",
    "title": "Creating an Atlas of Normal Tissue for Pruning WSI Patching Through  Anomaly Detection",
    "abstract": "Patching gigapixel whole slide images (WSIs) is an important task in computational pathology. Some methods have been proposed to select a subset of patches as WSI representation for downstream tasks. While most of the computational pathology tasks are designed to classify or detect the presence of pathological lesions in each WSI, the confounding role and redundant nature of normal histology in tissue samples are generally overlooked in WSI representations. In this paper, we propose and validate the concept of an \"atlas of normal tissue\" solely using samples of WSIs obtained from normal tissue biopsies. Such atlases can be employed to eliminate normal fragments of tissue samples and hence increase the representativeness collection of patches. We tested our proposed method by establishing a normal atlas using 107 normal skin WSIs and demonstrated how established indexes and search engines like Yottixel can be improved. We used 553 WSIs of cutaneous squamous cell carcinoma (cSCC) to show the advantage. We also validated our method applied to an external dataset of 451 breast WSIs. The number of selected WSI patches was reduced by 30% to 50% after utilizing the proposed normal atlas while maintaining the same indexing and search performance in leave-one-patinet-out validation for both datasets. We show that the proposed normal atlas shows promise for unsupervised selection of the most representative patches of the abnormal/malignant WSI lesions. ",
    "url": "https://arxiv.org/abs/2310.03106",
    "authors": [
      "Peyman Nejat",
      "Areej Alsaafin",
      "Ghazal Alabtah",
      "Nneka Comfere",
      "Aaron Mangold",
      "Dennis Murphree",
      "Patricija Zot",
      "Saba Yasir",
      "Joaquin J. Garcia",
      "H.R. Tizhoosh"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03206",
    "title": "Regret Analysis of Distributed Online Control for LTI Systems with  Adversarial Disturbances",
    "abstract": "This paper addresses the distributed online control problem over a network of linear time-invariant (LTI) systems (with possibly unknown dynamics) in the presence of adversarial perturbations. There exists a global network cost that is characterized by a time-varying convex function, which evolves in an adversarial manner and is sequentially and partially observed by local agents. The goal of each agent is to generate a control sequence that can compete with the best centralized control policy in hindsight, which has access to the global cost. This problem is formulated as a regret minimization. For the case of known dynamics, we propose a fully distributed disturbance feedback controller that guarantees a regret bound of $O(\\sqrt{T}\\log T)$, where $T$ is the time horizon. For the unknown dynamics case, we design a distributed explore-then-commit approach, where in the exploration phase all agents jointly learn the system dynamics, and in the learning phase our proposed control algorithm is applied using each agent system estimate. We establish a regret bound of $O(T^{2/3} \\text{poly}(\\log T))$ for this setting. ",
    "url": "https://arxiv.org/abs/2310.03206",
    "authors": [
      "Ting-Jui Chang",
      "Shahin Shahrampour"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.03365",
    "title": "Swin-Tempo: Temporal-Aware Lung Nodule Detection in CT Scans as Video  Sequences Using Swin Transformer-Enhanced UNet",
    "abstract": "Lung cancer is highly lethal, emphasizing the critical need for early detection. However, identifying lung nodules poses significant challenges for radiologists, who rely heavily on their expertise and experience for accurate diagnosis. To address this issue, computer-aided diagnosis systems based on machine learning techniques have emerged to assist doctors in identifying lung nodules from computed tomography (CT) scans. Unfortunately, existing networks in this domain often suffer from computational complexity, leading to high rates of false negatives and false positives, limiting their effectiveness. To address these challenges, we present an innovative model that harnesses the strengths of both convolutional neural networks and vision transformers. Inspired by object detection in videos, we treat each 3D CT image as a video, individual slices as frames, and lung nodules as objects, enabling a time-series application. The primary objective of our work is to overcome hardware limitations during model training, allowing for efficient processing of 2D data while utilizing inter-slice information for accurate identification based on 3D image context. We validated the proposed network by applying a 10-fold cross-validation technique to the publicly available Lung Nodule Analysis 2016 dataset. Our proposed architecture achieves an average sensitivity criterion of 97.84% and a competition performance metrics (CPM) of 96.0% with few parameters. Comparative analysis with state-of-the-art advancements in lung nodule identification demonstrates the significant accuracy achieved by our proposed model. ",
    "url": "https://arxiv.org/abs/2310.03365",
    "authors": [
      "Hossein Jafari",
      "Karim Faez",
      "Hamidreza Amindavar"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03378",
    "title": "Machine learning the interaction network in coupled dynamical systems",
    "abstract": "The study of interacting dynamical systems continues to attract research interest in various fields of science and engineering. In a collection of interacting particles, the interaction network contains information about how various components interact with one another. Inferring the information about the interaction network from the dynamics of agents is a problem of long-standing interest. In this work, we employ a self-supervised neural network model to achieve two outcomes: to recover the interaction network and to predict the dynamics of individual agents. Both these information are inferred solely from the observed trajectory data. This work presents an application of the Neural Relational Inference model to two dynamical systems: coupled particles mediated by Hooke's law interaction and coupled phase (Kuramoto) oscillators. ",
    "url": "https://arxiv.org/abs/2310.03378",
    "authors": [
      "Pawan R. Bhure",
      "M. S. Santhanam"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2310.03384",
    "title": "Complex-valued universal linear transformations and image encryption  using spatially incoherent diffractive networks",
    "abstract": "As an optical processor, a Diffractive Deep Neural Network (D2NN) utilizes engineered diffractive surfaces designed through machine learning to perform all-optical information processing, completing its tasks at the speed of light propagation through thin optical layers. With sufficient degrees-of-freedom, D2NNs can perform arbitrary complex-valued linear transformations using spatially coherent light. Similarly, D2NNs can also perform arbitrary linear intensity transformations with spatially incoherent illumination; however, under spatially incoherent light, these transformations are non-negative, acting on diffraction-limited optical intensity patterns at the input field-of-view (FOV). Here, we expand the use of spatially incoherent D2NNs to complex-valued information processing for executing arbitrary complex-valued linear transformations using spatially incoherent light. Through simulations, we show that as the number of optimized diffractive features increases beyond a threshold dictated by the multiplication of the input and output space-bandwidth products, a spatially incoherent diffractive visual processor can approximate any complex-valued linear transformation and be used for all-optical image encryption using incoherent illumination. The findings are important for the all-optical processing of information under natural light using various forms of diffractive surface-based optical processors. ",
    "url": "https://arxiv.org/abs/2310.03384",
    "authors": [
      "Xilin Yang",
      "Md Sadman Sakib Rahman",
      "Bijie Bai",
      "Jingxi Li",
      "Aydogan Ozcan"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2310.03455",
    "title": "Performance and energy balance: a comprehensive study of  state-of-the-art sound event detection systems",
    "abstract": "In recent years, deep learning systems have shown a concerning trend toward increased complexity and higher energy consumption. As researchers in this domain and organizers of one of the Detection and Classification of Acoustic Scenes and Events challenges tasks, we recognize the importance of addressing the environmental impact of data-driven SED systems. In this paper, we propose an analysis focused on SED systems based on the challenge submissions. This includes a comparison across the past two years and a detailed analysis of this year's SED systems. Through this research, we aim to explore how the SED systems are evolving every year in relation to their energy efficiency implications. ",
    "url": "https://arxiv.org/abs/2310.03455",
    "authors": [
      "Francesca Ronchini",
      "Romain Serizel"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2310.03499",
    "title": "IceCloudNet: Cirrus and mixed-phase cloud prediction from SEVIRI input  learned from sparse supervision",
    "abstract": "Clouds containing ice particles play a crucial role in the climate system. Yet they remain a source of great uncertainty in climate models and future climate projections. In this work, we create a new observational constraint of regime-dependent ice microphysical properties at the spatio-temporal coverage of geostationary satellite instruments and the quality of active satellite retrievals. We achieve this by training a convolutional neural network on three years of SEVIRI and DARDAR data sets. This work will enable novel research to improve ice cloud process understanding and hence, reduce uncertainties in a changing climate and help assess geoengineering methods for cirrus clouds. ",
    "url": "https://arxiv.org/abs/2310.03499",
    "authors": [
      "Kai Jeggle",
      "Mikolaj Czerkawski",
      "Federico Serva",
      "Bertrand Le Saux",
      "David Neubauer",
      "Ulrike Lohmann"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.03696",
    "title": "Banach Space Optimality of Neural Architectures With Multivariate  Nonlinearities",
    "abstract": "We investigate the variational optimality (specifically, the Banach space optimality) of a large class of neural architectures with multivariate nonlinearities/activation functions. To that end, we construct a new family of Banach spaces defined via a regularization operator and the $k$-plane transform. We prove a representer theorem that states that the solution sets to learning problems posed over these Banach spaces are completely characterized by neural architectures with multivariate nonlinearities. These optimal architectures have skip connections and are tightly connected to orthogonal weight normalization and multi-index models, both of which have received considerable interest in the neural network community. Our framework is compatible with a number of classical nonlinearities including the rectified linear unit (ReLU) activation function, the norm activation function, and the radial basis functions found in the theory of thin-plate/polyharmonic splines. We also show that the underlying spaces are special instances of reproducing kernel Banach spaces and variation spaces. Our results shed light on the regularity of functions learned by neural networks trained on data, particularly with multivariate nonlinearities, and provide new theoretical motivation for several architectural choices found in practice. ",
    "url": "https://arxiv.org/abs/2310.03696",
    "authors": [
      "Rahul Parhi",
      "Michael Unser"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1812.01911",
    "title": "New reducible configurations for graph multicoloring with application to  the experimental resolution of McDiarmid-Reed's Conjecture (extended version)",
    "abstract": " Comments: 24 pages, new version with more reducible configurations ",
    "url": "https://arxiv.org/abs/1812.01911",
    "authors": [
      "Jean-Christophe Godin",
      "Olivier Togni"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2010.11559",
    "title": "Learning Graph Laplacian with MCP",
    "abstract": " Comments: 32 pages ",
    "url": "https://arxiv.org/abs/2010.11559",
    "authors": [
      "Yangjing Zhang",
      "Kim-Chuan Toh",
      "Defeng Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2104.07454",
    "title": "Memory Capacity of Recurrent Neural Networks with Matrix Representation",
    "abstract": " Title: Memory Capacity of Recurrent Neural Networks with Matrix Representation ",
    "url": "https://arxiv.org/abs/2104.07454",
    "authors": [
      "Animesh Renanse",
      "Alok Sharma",
      "Rohitash Chandra"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2108.05641",
    "title": "SR-HetGNN:Session-based Recommendation with Heterogeneous Graph Neural  Network",
    "abstract": " Title: SR-HetGNN:Session-based Recommendation with Heterogeneous Graph Neural  Network ",
    "url": "https://arxiv.org/abs/2108.05641",
    "authors": [
      "Jinpeng Chen",
      "Haiyang Li",
      "Xudong Zhang",
      "Fan Zhang",
      "Senzhang Wang",
      "Kaimin Wei",
      "Jiaqi Ji"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.04939",
    "title": "Modeling Human Sentence Processing with Left-Corner Recurrent Neural  Network Grammars",
    "abstract": " Comments: Accepted by EMNLP 2021 ",
    "url": "https://arxiv.org/abs/2109.04939",
    "authors": [
      "Ryo Yoshida",
      "Hiroshi Noji",
      "Yohei Oseki"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2110.03991",
    "title": "Combining Differential Privacy and Byzantine Resilience in Distributed  SGD",
    "abstract": " Title: Combining Differential Privacy and Byzantine Resilience in Distributed  SGD ",
    "url": "https://arxiv.org/abs/2110.03991",
    "authors": [
      "Rachid Guerraoui",
      "Nirupam Gupta",
      "Rafael Pinot",
      "Sebastien Rouault",
      "John Stephan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2112.08417",
    "title": "Characterization of causal ancestral graphs for time series with latent  confounders",
    "abstract": " Comments: 67 pages (including supplement), 16 figures, accepted at The Annals of Statistics ",
    "url": "https://arxiv.org/abs/2112.08417",
    "authors": [
      "Andreas Gerhardus"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.06184",
    "title": "GSDA: Generative Adversarial Network-based Semi-Supervised Data  Augmentation for Ultrasound Image Classification",
    "abstract": " Comments: Heliyon Accepted ",
    "url": "https://arxiv.org/abs/2203.06184",
    "authors": [
      "Zhaoshan Liu",
      "Qiujie Lv",
      "Chau Hung Lee",
      "Lei Shen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.03519",
    "title": "Self-supervised Deep Unrolled Reconstruction Using Regularization by  Denoising",
    "abstract": " Title: Self-supervised Deep Unrolled Reconstruction Using Regularization by  Denoising ",
    "url": "https://arxiv.org/abs/2205.03519",
    "authors": [
      "Peizhou Huang",
      "Chaoyi Zhang",
      "Xiaoliang Zhang",
      "Xiaojuan Li",
      "Liang Dong",
      "Leslie Ying"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.05250",
    "title": "Spatial-temporal associations representation and application for process  monitoring using graph convolution neural network",
    "abstract": " Title: Spatial-temporal associations representation and application for process  monitoring using graph convolution neural network ",
    "url": "https://arxiv.org/abs/2205.05250",
    "authors": [
      "Hao Ren",
      "Xiaojun Liang",
      "Chunhua Yang",
      "Zhiwen Chen",
      "Weihua Gui"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.05241",
    "title": "CANet: Channel Extending and Axial Attention Catching Network for  Multi-structure Kidney Segmentation",
    "abstract": " Comments: KiPA2022 Challenge ",
    "url": "https://arxiv.org/abs/2208.05241",
    "authors": [
      "Zhenyu Bu",
      "Kai-Ni Wang",
      "Guang-Quan Zhou"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.12148",
    "title": "Self-Supervised Masked Convolutional Transformer Block for Anomaly  Detection",
    "abstract": " Comments: Accepted in IEEE Transactions on Pattern Analysis and Machine Intelligence ",
    "url": "https://arxiv.org/abs/2209.12148",
    "authors": [
      "Neelu Madan",
      "Nicolae-Catalin Ristea",
      "Radu Tudor Ionescu",
      "Kamal Nasrollahi",
      "Fahad Shahbaz Khan",
      "Thomas B. Moeslund",
      "Mubarak Shah"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.14951",
    "title": "Distributed decentralized receding horizon control for very large-scale  networks with application to satellite mega-constellations",
    "abstract": " Title: Distributed decentralized receding horizon control for very large-scale  networks with application to satellite mega-constellations ",
    "url": "https://arxiv.org/abs/2209.14951",
    "authors": [
      "Leonardo Pedroso",
      "Pedro Batista"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2210.01944",
    "title": "A Framework for Large Scale Synthetic Graph Dataset Generation",
    "abstract": " Title: A Framework for Large Scale Synthetic Graph Dataset Generation ",
    "url": "https://arxiv.org/abs/2210.01944",
    "authors": [
      "Sajad Darabi",
      "Piotr Bigaj",
      "Dawid Majchrowski",
      "Artur Kasymov",
      "Pawel Morkisz",
      "Alex Fit-Florea"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2211.03660",
    "title": "SC-DepthV3: Robust Self-supervised Monocular Depth Estimation for  Dynamic Scenes",
    "abstract": " Comments: Accepted for publication in TPAMI; The code will be available at this https URL ",
    "url": "https://arxiv.org/abs/2211.03660",
    "authors": [
      "Libo Sun",
      "Jia-Wang Bian",
      "Huangying Zhan",
      "Wei Yin",
      "Ian Reid",
      "Chunhua Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.13118",
    "title": "Decision Diagram-Based Branch-and-Bound with Caching for Dominance and  Suboptimality Detection",
    "abstract": " Comments: Submitted to INFORMS Journal on Computing ",
    "url": "https://arxiv.org/abs/2211.13118",
    "authors": [
      "Vianney Coppé",
      "Xavier Gillard",
      "Pierre Schaus"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Artificial Intelligence (cs.AI)",
      "Discrete Mathematics (cs.DM)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2212.06074",
    "title": "Regression with Label Differential Privacy",
    "abstract": " Comments: Appeared at ICLR '23, 28 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2212.06074",
    "authors": [
      "Badih Ghazi",
      "Pritish Kamath",
      "Ravi Kumar",
      "Ethan Leeman",
      "Pasin Manurangsi",
      "Avinash V Varadarajan",
      "Chiyuan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.04494",
    "title": "Multi-label Image Classification using Adaptive Graph Convolutional  Networks: from a Single Domain to Multiple Domains",
    "abstract": " Title: Multi-label Image Classification using Adaptive Graph Convolutional  Networks: from a Single Domain to Multiple Domains ",
    "url": "https://arxiv.org/abs/2301.04494",
    "authors": [
      "Indel Pal Singh",
      "Enjie Ghorbel",
      "Oyebade Oyedotun",
      "Djamila Aouada"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04554",
    "title": "Universal Detection of Backdoor Attacks via Density-based Clustering and  Centroids Analysis",
    "abstract": " Title: Universal Detection of Backdoor Attacks via Density-based Clustering and  Centroids Analysis ",
    "url": "https://arxiv.org/abs/2301.04554",
    "authors": [
      "Wei Guo",
      "Benedetta Tondi",
      "Mauro Barni"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.02575",
    "title": "Optimizing Energy-Harvesting Hybrid VLC/RF Networks with Random Receiver  Orientation",
    "abstract": " Title: Optimizing Energy-Harvesting Hybrid VLC/RF Networks with Random Receiver  Orientation ",
    "url": "https://arxiv.org/abs/2302.02575",
    "authors": [
      "Amir Hossein Fahim Raouf",
      "Chethan Kumar Anjinappa",
      "Ismail Guvenc"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2302.02787",
    "title": "Generative models for two-ground-truth partitions in networks",
    "abstract": " Title: Generative models for two-ground-truth partitions in networks ",
    "url": "https://arxiv.org/abs/2302.02787",
    "authors": [
      "Lena Mangold",
      "Camille Roth"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2303.01338",
    "title": "AdvRain: Adversarial Raindrops to Attack Camera-based Smart Vision  Systems",
    "abstract": " Title: AdvRain: Adversarial Raindrops to Attack Camera-based Smart Vision  Systems ",
    "url": "https://arxiv.org/abs/2303.01338",
    "authors": [
      "Amira Guesmi",
      "Muhammad Abdullah Hanif",
      "Muhammad Shafique"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2303.06088",
    "title": "Towards domain-invariant Self-Supervised Learning with Batch Styles  Standardization",
    "abstract": " Comments: Under review as conference paper ",
    "url": "https://arxiv.org/abs/2303.06088",
    "authors": [
      "Marin Scalbert",
      "Maria Vakalopoulou",
      "Florent Couzinié-Devy"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.09234",
    "title": "NAISR: A 3D Neural Additive Model for Interpretable Shape Representation",
    "abstract": " Comments: 28 pages ",
    "url": "https://arxiv.org/abs/2303.09234",
    "authors": [
      "Yining Jiao",
      "Carlton Zdanski",
      "Julia Kimbell",
      "Andrew Prince",
      "Cameron Worden",
      "Samuel Kirse",
      "Christopher Rutter",
      "Benjamin Shields",
      "William Dunn",
      "Jisan Mahmud",
      "Marc Niethammer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.09874",
    "title": "Disentangling the Link Between Image Statistics and Human Perception",
    "abstract": " Title: Disentangling the Link Between Image Statistics and Human Perception ",
    "url": "https://arxiv.org/abs/2303.09874",
    "authors": [
      "Alexander Hepburn",
      "Valero Laparra",
      "Raúl Santos-Rodriguez",
      "Jesús Malo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2304.03752",
    "title": "V3Det: Vast Vocabulary Visual Detection Dataset",
    "abstract": " Comments: ICCV 2023 Oral Camera Ready ",
    "url": "https://arxiv.org/abs/2304.03752",
    "authors": [
      "Jiaqi Wang",
      "Pan Zhang",
      "Tao Chu",
      "Yuhang Cao",
      "Yujie Zhou",
      "Tong Wu",
      "Bin Wang",
      "Conghui He",
      "Dahua Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.04327",
    "title": "Online Networks of Support in Distressed Environments: Solidarity and  Mobilization during the Russian Invasion of Ukraine",
    "abstract": " Comments: Presented at ICWSM2023 Workshop \"Data for the Wellbeing of Most Vulnerable\" ",
    "url": "https://arxiv.org/abs/2304.04327",
    "authors": [
      "Jinyi Ye",
      "Nikhil Jindal",
      "Francesco Pierri",
      "Luca Luceri"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.06715",
    "title": "Evaluating the Robustness of Interpretability Methods through  Explanation Invariance and Equivariance",
    "abstract": " Comments: Presented at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2304.06715",
    "authors": [
      "Jonathan Crabbé",
      "Mihaela van der Schaar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2304.14420",
    "title": "Network Cascade Vulnerability using Constrained Bayesian Optimization",
    "abstract": " Comments: 13 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2304.14420",
    "authors": [
      "Albert Lam",
      "Mihai Anitescu",
      "Anirudh Subramanyam"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.15086",
    "title": "Unpaired Image-to-Image Translation via Neural Schrödinger Bridge",
    "abstract": " Title: Unpaired Image-to-Image Translation via Neural Schrödinger Bridge ",
    "url": "https://arxiv.org/abs/2305.15086",
    "authors": [
      "Beomsu Kim",
      "Gihyun Kwon",
      "Kwanyoung Kim",
      "Jong Chul Ye"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.15871",
    "title": "Learning Robust Statistics for Simulation-based Inference under Model  Misspecification",
    "abstract": " Comments: 22 pages, 13 figures, Published at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2305.15871",
    "authors": [
      "Daolang Huang",
      "Ayush Bharti",
      "Amauri Souza",
      "Luigi Acerbi",
      "Samuel Kaski"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2305.16102",
    "title": "Demystifying Oversmoothing in Attention-Based Graph Neural Networks",
    "abstract": " Comments: NeurIPS 2023 spotlight. New remarks added ",
    "url": "https://arxiv.org/abs/2305.16102",
    "authors": [
      "Xinyi Wu",
      "Amir Ajorlou",
      "Zihui Wu",
      "Ali Jadbabaie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2306.00709",
    "title": "Understanding the Social Context of Eating with Multimodal Smartphone  Sensing: The Role of Country Diversity",
    "abstract": " Comments: 25th ACM International Conference on Multimodal Interaction (ICMI) ",
    "url": "https://arxiv.org/abs/2306.00709",
    "authors": [
      "Nathan Kammoun",
      "Lakmal Meegahapola",
      "Daniel Gatica-Perez"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2306.08827",
    "title": "PINNacle: A Comprehensive Benchmark of Physics-Informed Neural Networks  for Solving PDEs",
    "abstract": " Title: PINNacle: A Comprehensive Benchmark of Physics-Informed Neural Networks  for Solving PDEs ",
    "url": "https://arxiv.org/abs/2306.08827",
    "authors": [
      "Zhongkai Hao",
      "Jiachen Yao",
      "Chang Su",
      "Hang Su",
      "Ziao Wang",
      "Fanzhi Lu",
      "Zeyu Xia",
      "Yichi Zhang",
      "Songming Liu",
      "Lu Lu",
      "Jun Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2306.10840",
    "title": "RedMotion: Motion Prediction via Redundancy Reduction",
    "abstract": " Comments: Technical report, 13 pages, 8 figures; v2: focus on transformer model ",
    "url": "https://arxiv.org/abs/2306.10840",
    "authors": [
      "Royden Wagner",
      "Omer Sahin Tas",
      "Marvin Klemp",
      "Carlos Fernandez Lopez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2306.10913",
    "title": "Semilinear fractional elliptic PDEs with gradient nonlinearities on open  balls: existence of solutions and probabilistic representation",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2110.09941, arXiv:2106.12127 ",
    "url": "https://arxiv.org/abs/2306.10913",
    "authors": [
      "Guillaume Penent",
      "Nicolas Privault"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Analysis of PDEs (math.AP)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2306.14840",
    "title": "Building Flyweight FLIM-based CNNs with Adaptive Decoding for Object  Detection",
    "abstract": " Title: Building Flyweight FLIM-based CNNs with Adaptive Decoding for Object  Detection ",
    "url": "https://arxiv.org/abs/2306.14840",
    "authors": [
      "Leonardo de Melo Joao",
      "Azael de Melo e Sousa",
      "Bianca Martins dos Santos",
      "Silvio Jamil Ferzoli Guimaraes",
      "Jancarlo Ferreira Gomes",
      "Ewa Kijak",
      "Alexandre Xavier Falcao"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.04333",
    "title": "Enhancing Adversarial Robustness via Score-Based Optimization",
    "abstract": " Comments: NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2307.04333",
    "authors": [
      "Boya Zhang",
      "Weijian Luo",
      "Zhihua Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.06092",
    "title": "Quantitative CLTs in Deep Neural Networks",
    "abstract": " Title: Quantitative CLTs in Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2307.06092",
    "authors": [
      "Stefano Favaro",
      "Boris Hanin",
      "Domenico Marinucci",
      "Ivan Nourdin",
      "Giovanni Peccati"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Probability (math.PR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.07726",
    "title": "Towards Optimal Neural Networks: the Role of Sample Splitting in  Hyperparameter Selection",
    "abstract": " Comments: 32 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2307.07726",
    "authors": [
      "Shijin Gong",
      "Xinyu Zhang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.10784",
    "title": "SMURF: Spatial Multi-Representation Fusion for 3D Object Detection with  4D Imaging Radar",
    "abstract": " Comments: Accepted by IEEE Transactions on Intelligent Vehicles ",
    "url": "https://arxiv.org/abs/2307.10784",
    "authors": [
      "Jianan Liu",
      "Qiuchi Zhao",
      "Weiyi Xiong",
      "Tao Huang",
      "Qing-Long Han",
      "Bing Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.14322",
    "title": "Modeling Inverse Demand Function with Explainable Dual Neural Networks",
    "abstract": " Comments: Accepted and selected for oral presentation at ICAIF 2023, NY, US ",
    "url": "https://arxiv.org/abs/2307.14322",
    "authors": [
      "Zhiyu Cao",
      "Zihan Chen",
      "Prerna Mishra",
      "Hamed Amini",
      "Zachary Feinstein"
    ],
    "subjectives": [
      "Computational Finance (q-fin.CP)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2308.00143",
    "title": "Formally Explaining Neural Networks within Reactive Systems",
    "abstract": " Comments: To appear in Proc. 23rd Int. Conf. on Formal Methods in Computer-Aided Design (FMCAD) ",
    "url": "https://arxiv.org/abs/2308.00143",
    "authors": [
      "Shahaf Bassan",
      "Guy Amir",
      "Davide Corsi",
      "Idan Refaeli",
      "Guy Katz"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2308.12439",
    "title": "BaDExpert: Extracting Backdoor Functionality for Accurate Backdoor Input  Detection",
    "abstract": " Title: BaDExpert: Extracting Backdoor Functionality for Accurate Backdoor Input  Detection ",
    "url": "https://arxiv.org/abs/2308.12439",
    "authors": [
      "Tinghao Xie",
      "Xiangyu Qi",
      "Ping He",
      "Yiming Li",
      "Jiachen T. Wang",
      "Prateek Mittal"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.16738",
    "title": "SFUSNet: A Spatial-Frequency domain-based Multi-branch Network for  diagnosis of Cervical Lymph Node Lesions in Ultrasound Images",
    "abstract": " Title: SFUSNet: A Spatial-Frequency domain-based Multi-branch Network for  diagnosis of Cervical Lymph Node Lesions in Ultrasound Images ",
    "url": "https://arxiv.org/abs/2308.16738",
    "authors": [
      "Yubiao Yue",
      "Jun Xue",
      "Haihua Liang",
      "Bingchun Luo",
      "Zhenzhang Li"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.06262",
    "title": "Modality Unifying Network for Visible-Infrared Person Re-Identification",
    "abstract": " Comments: 11 pages, 5 figures. Accepted as the poster paper in ICCV2023 ",
    "url": "https://arxiv.org/abs/2309.06262",
    "authors": [
      "Hao Yu",
      "Xu Cheng",
      "Wei Peng",
      "Weihao Liu",
      "Guoying Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.07056",
    "title": "Deep Quantum Graph Dreaming: Deciphering Neural Network Insights into  Quantum Experiments",
    "abstract": " Comments: Modified Figure 2. Fixed minor typos ",
    "url": "https://arxiv.org/abs/2309.07056",
    "authors": [
      "Tareq Jaouni",
      "Sören Arlt",
      "Carlos Ruiz-Gonzalez",
      "Ebrahim Karimi",
      "Xuemei Gu",
      "Mario Krenn"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.08621",
    "title": "Exploring Social Choice Mechanisms for Recommendation Fairness in SCRUF",
    "abstract": " Title: Exploring Social Choice Mechanisms for Recommendation Fairness in SCRUF ",
    "url": "https://arxiv.org/abs/2309.08621",
    "authors": [
      "Amanda Aird",
      "Cassidy All",
      "Paresha Farastu",
      "Elena Stefancova",
      "Joshua Sun",
      "Nicholas Mattei",
      "Robin Burke"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.10514",
    "title": "Partially Specified Causal Simulations",
    "abstract": " Title: Partially Specified Causal Simulations ",
    "url": "https://arxiv.org/abs/2309.10514",
    "authors": [
      "A. Zamanian",
      "L. Mareis",
      "N. Ahmidi"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.11880",
    "title": "Four universal growth regimes in degree-dependent first passage  percolation on spatial random graphs II",
    "abstract": " Comments: 50 pages ",
    "url": "https://arxiv.org/abs/2309.11880",
    "authors": [
      "Júlia Komjáthy",
      "John Lapinskas",
      "Johannes Lengler",
      "Ulysse Schaller"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Social and Information Networks (cs.SI)",
      "Combinatorics (math.CO)",
      "Populations and Evolution (q-bio.PE)"
    ]
  },
  {
    "id": "arXiv:2309.12766",
    "title": "A Study on Incorporating Whisper for Robust Speech Assessment",
    "abstract": " Title: A Study on Incorporating Whisper for Robust Speech Assessment ",
    "url": "https://arxiv.org/abs/2309.12766",
    "authors": [
      "Ryandhimas E. Zezario",
      "Yu-Wen Chen",
      "Szu-Wei Fu",
      "Yu Tsao",
      "Hsin-Min Wang",
      "Chiou-Shann Fuh"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2309.14073",
    "title": "Maximum Likelihood Estimation of Latent Variable Structural Equation  Models: A Neural Network Approach",
    "abstract": " Title: Maximum Likelihood Estimation of Latent Variable Structural Equation  Models: A Neural Network Approach ",
    "url": "https://arxiv.org/abs/2309.14073",
    "authors": [
      "Mehrzad Saremi"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2309.14331",
    "title": "LinGCN: Structural Linearized Graph Convolutional Network for  Homomorphically Encrypted Inference",
    "abstract": " Comments: NeurIPS 2023 accepted publication ",
    "url": "https://arxiv.org/abs/2309.14331",
    "authors": [
      "Hongwu Peng",
      "Ran Ran",
      "Yukui Luo",
      "Jiahui Zhao",
      "Shaoyi Huang",
      "Kiran Thorat",
      "Tong Geng",
      "Chenghong Wang",
      "Xiaolin Xu",
      "Wujie Wen",
      "Caiwen Ding"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2309.15294",
    "title": "Multiple Case Physics-Informed Neural Network for Biomedical Tube Flows",
    "abstract": " Comments: 24 pages, 8 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2309.15294",
    "authors": [
      "Hong Shen Wong",
      "Wei Xuan Chan",
      "Bing Huan Li",
      "Choon Hwai Yap"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.15325",
    "title": "Neural Operators for Accelerating Scientific Simulations and Design",
    "abstract": " Title: Neural Operators for Accelerating Scientific Simulations and Design ",
    "url": "https://arxiv.org/abs/2309.15325",
    "authors": [
      "Kamyar Azzizadenesheli",
      "Nikola Kovachki",
      "Zongyi Li",
      "Miguel Liu-Schiaffini",
      "Jean Kossaifi",
      "Anima Anandkumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2309.16206",
    "title": "Alzheimer's Disease Prediction via Brain Structural-Functional Deep  Fusing Network",
    "abstract": " Comments: 10 pages ",
    "url": "https://arxiv.org/abs/2309.16206",
    "authors": [
      "Qiankun Zuo",
      "Junren Pan",
      "Shuqiang Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.17329",
    "title": "Efficient Anatomical Labeling of Pulmonary Tree Structures via Implicit  Point-Graph Networks",
    "abstract": " Title: Efficient Anatomical Labeling of Pulmonary Tree Structures via Implicit  Point-Graph Networks ",
    "url": "https://arxiv.org/abs/2309.17329",
    "authors": [
      "Kangxian Xie",
      "Jiancheng Yang",
      "Donglai Wei",
      "Ziqiao Weng",
      "Pascal Fua"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2309.17348",
    "title": "Efficient Biologically Plausible Adversarial Training",
    "abstract": " Title: Efficient Biologically Plausible Adversarial Training ",
    "url": "https://arxiv.org/abs/2309.17348",
    "authors": [
      "Matilde Tristany Farinha",
      "Thomas Ortner",
      "Giorgia Dellaferrera",
      "Benjamin Grewe",
      "Angeliki Pantazi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.17357",
    "title": "Module-wise Training of Neural Networks via the Minimizing Movement  Scheme",
    "abstract": " Comments: NeurIPS 2023. arXiv admin note: text overlap with arXiv:2210.00949 ",
    "url": "https://arxiv.org/abs/2309.17357",
    "authors": [
      "Skander Karkar",
      "Ibrahim Ayed",
      "Emmanuel de Bézenac",
      "Patrick Gallinari"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.00247",
    "title": "Bridging the Gap Between Foundation Models and Heterogeneous Federated  Learning",
    "abstract": " Title: Bridging the Gap Between Foundation Models and Heterogeneous Federated  Learning ",
    "url": "https://arxiv.org/abs/2310.00247",
    "authors": [
      "Sixing Yu",
      "J. Pablo Muñoz",
      "Ali Jannesari"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2310.00944",
    "title": "Towards Robust 3D Object Detection In Rainy Conditions",
    "abstract": " Comments: Published at IEEE International Conference on Intelligent Transportation Systems ITSC 2023 ",
    "url": "https://arxiv.org/abs/2310.00944",
    "authors": [
      "Aldi Piroli",
      "Vinzenz Dallabetta",
      "Johannes Kopp",
      "Marc Walessa",
      "Daniel Meissner",
      "Klaus Dietmayer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.02027",
    "title": "DeepHGCN: Toward Deeper Hyperbolic Graph Convolutional Networks",
    "abstract": " Comments: 12 pages including appendix and reference ",
    "url": "https://arxiv.org/abs/2310.02027",
    "authors": [
      "Jiaxu Liu",
      "Xinping Yi",
      "Xiaowei Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.02156",
    "title": "Probabilistically Rewired Message-Passing Neural Networks",
    "abstract": " Title: Probabilistically Rewired Message-Passing Neural Networks ",
    "url": "https://arxiv.org/abs/2310.02156",
    "authors": [
      "Chendi Qian",
      "Andrei Manolache",
      "Kareem Ahmed",
      "Zhe Zeng",
      "Guy Van den Broeck",
      "Mathias Niepert",
      "Christopher Morris"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2310.02244",
    "title": "Tensor Programs VI: Feature Learning in Infinite-Depth Neural Networks",
    "abstract": " Title: Tensor Programs VI: Feature Learning in Infinite-Depth Neural Networks ",
    "url": "https://arxiv.org/abs/2310.02244",
    "authors": [
      "Greg Yang",
      "Dingli Yu",
      "Chen Zhu",
      "Soufiane Hayou"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2310.02298",
    "title": "Prompting Audios Using Acoustic Properties For Emotion Representation",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2211.07737 ",
    "url": "https://arxiv.org/abs/2310.02298",
    "authors": [
      "Hira Dhamyal",
      "Benjamin Elizalde",
      "Soham Deshmukh",
      "Huaming Wang",
      "Bhiksha Raj",
      "Rita Singh"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.02800",
    "title": "Everest: GPU-Accelerated System For Mining Temporal Motifs",
    "abstract": " Title: Everest: GPU-Accelerated System For Mining Temporal Motifs ",
    "url": "https://arxiv.org/abs/2310.02800",
    "authors": [
      "Yichao Yuan",
      "Haojie Ye",
      "Sanketh Vedula",
      "Wynn Kaza",
      "Nishil Talati"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2310.02859",
    "title": "Tight Sampling in Unbounded Networks",
    "abstract": " Comments: The first two authors contributed equally ",
    "url": "https://arxiv.org/abs/2310.02859",
    "authors": [
      "Kshitijaa Jaglan",
      "Meher Chaitanya",
      "Triansh Sharma",
      "Abhijeeth Singam",
      "Nidhi Goyal",
      "Ponnurangam Kumaraguru",
      "Ulrik Brandes"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2310.02861",
    "title": "Rayleigh Quotient Graph Neural Networks for Graph-level Anomaly  Detection",
    "abstract": " Title: Rayleigh Quotient Graph Neural Networks for Graph-level Anomaly  Detection ",
    "url": "https://arxiv.org/abs/2310.02861",
    "authors": [
      "Xiangyu Dong",
      "Xingyi Zhang",
      "Sibo Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.02964",
    "title": "Co-modeling the Sequential and Graphical Routes for Peptide  Representation Learning",
    "abstract": " Title: Co-modeling the Sequential and Graphical Routes for Peptide  Representation Learning ",
    "url": "https://arxiv.org/abs/2310.02964",
    "authors": [
      "Zihan Liu",
      "Ge Wang",
      "Jiaqi Wang",
      "Jiangbin Zheng",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  }
]