[
  {
    "id": "arXiv:2203.01993",
    "title": "Polarity Sampling: Quality and Diversity Control of Pre-Trained  Generative Networks via Singular Values",
    "abstract": "We present Polarity Sampling, a theoretically justified plug-and-play method for controlling the generation quality and diversity of pre-trained deep generative networks DGNs). Leveraging the fact that DGNs are, or can be approximated by, continuous piecewise affine splines, we derive the analytical DGN output space distribution as a function of the product of the DGN's Jacobian singular values raised to a power $\\rho$. We dub $\\rho$ the $\\textbf{polarity}$ parameter and prove that $\\rho$ focuses the DGN sampling on the modes ($\\rho < 0$) or anti-modes ($\\rho > 0$) of the DGN output-space distribution. We demonstrate that nonzero polarity values achieve a better precision-recall (quality-diversity) Pareto frontier than standard methods, such as truncation, for a number of state-of-the-art DGNs. We also present quantitative and qualitative results on the improvement of overall generation quality (e.g., in terms of the Frechet Inception Distance) for a number of state-of-the-art DGNs, including StyleGAN3, BigGAN-deep, NVAE, for different conditional and unconditional image generation tasks. In particular, Polarity Sampling redefines the state-of-the-art for StyleGAN2 on the FFHQ Dataset to FID 2.57, StyleGAN2 on the LSUN Car Dataset to FID 2.27 and StyleGAN3 on the AFHQv2 Dataset to FID 3.95. Demo: bit.ly/polarity-demo-colab ",
    "url": "https://arxiv.org/abs/2203.01993",
    "authors": [
      "Ahmed Imtiaz Humayun",
      "Randall Balestriero",
      "Richard Baraniuk"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.01994",
    "title": "Fast Neural Architecture Search for Lightweight Dense Prediction  Networks",
    "abstract": "Dense prediction is a class of computer vision problems aiming at mapping every pixel of the input image with some predicted values. Depending on the problem, the output values can be either continous or discrete. For instance, monocular depth estimation and image super-resolution are often formulated as regression, while semantic segmentation is a dense classification, i.e. discrete, problem. More specifically, the monocular depth estimation problem produces a dense depth map from a single image to be used in various applications including robotics, scene understanding, and augmented reality. Single image super-resolution (SISR) is a low-level vision task that generates a high-resolution image from its low-resolution counterpart. SISR is widely utilized in medical and surveillance imaging, where images with more precise details can provide invaluable information. On the other hand, semantic segmentation predicts a dense annotated map of different semantic categories from a given image that is crucial for image understanding tasks. ",
    "url": "https://arxiv.org/abs/2203.01994",
    "authors": [
      "Lam Huynh",
      "Esa Rahtu",
      "Jiri Matas",
      "Janne Heikkila"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.01999",
    "title": "High Order Robust Adaptive Control Barrier Functions and Exponentially  Stabilizing Adaptive Control Lyapunov Functions",
    "abstract": "This paper studies the problem of utilizing data-driven adaptive control techniques to guarantee stability and safety of uncertain nonlinear systems with high relative degree. We first introduce the notion of a High Order Robust Adaptive Control Barrier Function (HO-RaCBF) as a means to compute control policies guaranteeing satisfaction of high relative degree safety constraints in the face of parametric model uncertainty. The developed approach guarantees safety by initially accounting for all possible parameter realizations but adaptively reduces uncertainty in the parameter estimates leveraging data recorded online. We then introduce the notion of an Exponentially Stabilizing Adaptive Control Lyapunov Function (ES-aCLF) that leverages the same data as the HO-RaCBF controller to guarantee exponential convergence of the system trajectory. The developed HO-RaCBF and ES-aCLF are unified in a quadratic programming framework, whose efficacy is showcased via two numerical examples that, to our knowledge, cannot be addressed by existing adaptive control barrier function techniques. ",
    "url": "https://arxiv.org/abs/2203.01999",
    "authors": [
      "Max H. Cohen",
      "Calin Belta"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Robotics (cs.RO)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.02002",
    "title": "Depolarising Social Networks: Optimisation of Exposure to Adverse  Opinions in the Presence of a Backfire Effect",
    "abstract": "As social networks are ubiquitous in everyday life, problems such as misinformation, bots and polarisation of opinion gain more and more importance. This paper focuses on the last one as we propose novel methods to reduce the amount of polarisation in a social group. We leverage the voter model in which users hold binary opinions and repeatedly update their beliefs based on others they connect with. Stubborn agents who never change their minds (\"zealots\") are also disseminated through the network. We are interested in two equilibrium metrics, the diversity of opinions $\\sigma$ and the density of active links $\\rho$. The latter is a measure of the exposure to adverse opinions. We derive formulas to compute them that are valid in any directed, weighted network. Then we study the problem of finding optimal numbers of zealots in order to maximise these quantities. We account for the presence of a backfire effect, which may lead the group to react negatively and reinforce its level of polarisation in response. We provide exact solutions in the specific context of a complete unweighted graph, and propose a method for $\\sigma$ in the general case. Finally we apply these problems to the network of the US House of Representatives. The network exhibits high levels of opinion diversity but lower levels of active links density. We find optimal numbers of zealots that maximise these quantities and show that both can be efficiently increased in some cases. ",
    "url": "https://arxiv.org/abs/2203.02002",
    "authors": [
      "Antoine Vendeville",
      "Benjamin Guedj",
      "Shi Zhou"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2203.02006",
    "title": "Why adversarial training can hurt robust accuracy",
    "abstract": "Machine learning classifiers with high test accuracy often perform poorly under adversarial attacks. It is commonly believed that adversarial training alleviates this issue. In this paper, we demonstrate that, surprisingly, the opposite may be true -- Even though adversarial training helps when enough data is available, it may hurt robust generalization in the small sample size regime. We first prove this phenomenon for a high-dimensional linear classification setting with noiseless observations. Our proof provides explanatory insights that may also transfer to feature learning models. Further, we observe in experiments on standard image datasets that the same behavior occurs for perceptible attacks that effectively reduce class information such as mask attacks and object corruptions. ",
    "url": "https://arxiv.org/abs/2203.02006",
    "authors": [
      "Jacob Clarysse",
      "Julia Hörmann",
      "Fanny Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.02016",
    "title": "Interventions, Where and How? Experimental Design for Causal Models at  Scale",
    "abstract": "Causal discovery from observational and interventional data is challenging due to limited data and non-identifiability which introduces uncertainties in estimating the underlying structural causal model (SCM). Incorporating these uncertainties and selecting optimal experiments (interventions) to perform can help to identify the true SCM faster. Existing methods in experimental design for causal discovery from limited data either rely on linear assumptions for the SCM or select only the intervention target. In this paper, we incorporate recent advances in Bayesian causal discovery into the Bayesian optimal experimental design framework, which allows for active causal discovery of nonlinear, large SCMs, while selecting both the target and the value to intervene with. We demonstrate the performance of the proposed method on synthetic graphs (Erdos-R\\`enyi, Scale Free) for both linear and nonlinear SCMs as well as on the in-silico single-cell gene regulatory network dataset, DREAM. ",
    "url": "https://arxiv.org/abs/2203.02016",
    "authors": [
      "Panagiotis Tigas",
      "Yashas Annadani",
      "Andrew Jesson",
      "Bernhard Schölkopf",
      "Yarin Gal",
      "Stefan Bauer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.02018",
    "title": "Zero-shot Domain Adaptation of Heterogeneous Graphs via Knowledge  Transfer Networks",
    "abstract": "How can we make predictions for nodes in a heterogeneous graph when an entire type of node (e.g. user) has no labels (perhaps due to privacy issues) at all? Although heterogeneous graph neural networks (HGNNs) have shown superior performance as powerful representation learning techniques, there is no direct way to learn using labels rooted at different node types. Domain adaptation (DA) targets this setting, however, existing DA can not be applied directly to HGNNs. In heterogeneous graphs, the source and target domains have different modalities, thus HGNNs provide different feature extractors to them, while most of DA assumes source and target domains share a common feature extractor. In this work, we address the issue of zero-shot domain adaptation in HGNNs. We first theoretically induce a relationship between source and target domain features extracted from HGNNs, then propose a novel domain adaptation method, Knowledge Transfer Networks for HGNNs (HGNN-KTN). HGNN-KTN learns the relationship between source and target features, then maps the target distributions into the source domain. HGNN-KTN outperforms state-of-the-art baselines, showing up to 73.3% higher in MRR on 18 different domain adaptation tasks running on real-world benchmark graphs. ",
    "url": "https://arxiv.org/abs/2203.02018",
    "authors": [
      "Minji Yoon",
      "John Palowitch",
      "Dustin Zelle",
      "Ziniu Hu",
      "Ruslan Salakhutdinov",
      "Bryan Perozzi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02026",
    "title": "Provable and Efficient Continual Representation Learning",
    "abstract": "In continual learning (CL), the goal is to design models that can learn a sequence of tasks without catastrophic forgetting. While there is a rich set of techniques for CL, relatively little understanding exists on how representations built by previous tasks benefit new tasks that are added to the network. To address this, we study the problem of continual representation learning (CRL) where we learn an evolving representation as new tasks arrive. Focusing on zero-forgetting methods where tasks are embedded in subnetworks (e.g., PackNet), we first provide experiments demonstrating CRL can significantly boost sample efficiency when learning new tasks. To explain this, we establish theoretical guarantees for CRL by providing sample complexity and generalization error bounds for new tasks by formalizing the statistical benefits of previously-learned representations. Our analysis and experiments also highlight the importance of the order in which we learn the tasks. Specifically, we show that CL benefits if the initial tasks have large sample size and high \"representation diversity\". Diversity ensures that adding new tasks incurs small representation mismatch and can be learned with few samples while training only few additional nonzero weights. Finally, we ask whether one can ensure each task subnetwork to be efficient during inference time while retaining the benefits of representation learning. To this end, we propose an inference-efficient variation of PackNet called Efficient Sparse PackNet (ESPN) which employs joint channel & weight pruning. ESPN embeds tasks in channel-sparse subnets requiring up to 80% less FLOPs to compute while approximately retaining accuracy and is very competitive with a variety of baselines. In summary, this work takes a step towards data and compute-efficient CL with a representation learning perspective. GitHub page: https://github.com/ucr-optml/CtRL ",
    "url": "https://arxiv.org/abs/2203.02026",
    "authors": [
      "Yingcong Li",
      "Mingchen Li",
      "M. Salman Asif",
      "Samet Oymak"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02027",
    "title": "Towards Mining OSS Skills from GitHub Activity",
    "abstract": "Open source software (OSS) development relies on diverse skill sets. However, to our knowledge, there are no tools which detect OSS-related skills. In this paper, we present a novel method to detect OSS skills and prototype it in a tool called Disko. Our approach relies on identifying relevant signals, which are measurable activities or cues associated with a skill. Our tool detects how contributors 1) teach others to be involved in OSS projects, 2) show commitment towards an OSS project, 3) have knowledge in specific programming languages, and 4) are familiar with OSS practices. We then evaluate the tool by administering a survey to 455 OSS contributors. We demonstrate that Disko yields promising results: it detects the presence of these skills with precision scores between 77% to 97%. We also find that over 54% of participants would display their high-proficiency skills. Our approach can be used to transform existing OSS experiences, such as identifying collaborators, matching mentors to mentees, and assigning project roles. Given the positive results and potential impact of our approach, we outline future research opportunities in interpreting and sharing OSS skills. ",
    "url": "https://arxiv.org/abs/2203.02027",
    "authors": [
      "Jenny T. Liang",
      "Thomas Zimmermann",
      "Denae Ford"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2203.02034",
    "title": "Data-Efficient and Interpretable Tabular Anomaly Detection",
    "abstract": "Anomaly detection (AD) plays an important role in numerous applications. We focus on two understudied aspects of AD that are critical for integration into real-world applications. First, most AD methods cannot incorporate labeled data that are often available in practice in small quantities and can be crucial to achieve high AD accuracy. Second, most AD methods are not interpretable, a bottleneck that prevents stakeholders from understanding the reason behind the anomalies. In this paper, we propose a novel AD framework that adapts a white-box model class, Generalized Additive Models, to detect anomalies using a partial identification objective which naturally handles noisy or heterogeneous features. In addition, the proposed framework, DIAD, can incorporate a small amount of labeled data to further boost anomaly detection performances in semi-supervised settings. We demonstrate the superiority of our framework compared to previous work in both unsupervised and semi-supervised settings using diverse tabular datasets. For example, under 5 labeled anomalies DIAD improves from 86.2\\% to 89.4\\% AUC by learning AD from unlabeled data. We also present insightful interpretations that explain why DIAD deems certain samples as anomalies. ",
    "url": "https://arxiv.org/abs/2203.02034",
    "authors": [
      "Chun-Hao Chang",
      "Jinsung Yoon",
      "Sercan Arik",
      "Madeleine Udell",
      "Tomas Pfister"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02038",
    "title": "Robust Counterexample-guided Optimization for Planning from  Differentiable Temporal Logic",
    "abstract": "Signal temporal logic (STL) provides a powerful, flexible framework for specifying complex autonomy tasks; however, existing methods for planning based on STL specifications have difficulty scaling to long-horizon tasks and are not robust to external disturbances. In this paper, we present an algorithm for finding robust plans that satisfy STL specifications. Our method alternates between local optimization and local falsification, using automatically differentiable temporal logic to iteratively optimize its plan in response to counterexamples found during the falsification process. We benchmark our counterexample-guided planning method against state-of-the-art planning methods on two long-horizon satellite rendezvous missions, showing that our method finds high-quality plans that satisfy STL specifications despite adversarial disturbances. We find that our method consistently finds plans that are robust to adversarial disturbances and requires less than half the time of competing methods. We provide an implementation of our planner at https://github.com/MIT-REALM/architect. ",
    "url": "https://arxiv.org/abs/2203.02038",
    "authors": [
      "Charles Dawson",
      "Chuchu Fan"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.02052",
    "title": "A Unified Spatially Coupled Code Design: Threshold, Cycles, and Locality",
    "abstract": "Spatially-Coupled (SC)-LDPC codes are known to have outstanding error-correction performance and low decoding latency. Whereas previous works on LDPC and SC-LDPC codes mostly take either an asymptotic or a finite-length design approach, in this paper we present a unified framework for jointly optimizing the codes' thresholds and cycle counts to address both regimes. The framework is based on efficient traversal and pruning of the code search space, building on the fact that the performance of a protograph-based SC-LDPC code depends on some characteristics of the code's partitioning matrix, which by itself is much smaller than the code's full parity-check matrix. We then propose an algorithm that traverses all nonequivalent partitioning matrices, and outputs a list of codes, each offering an attractive point on the trade-off between asymptotic and finite-length performance. We further extend the framework to designing SC-LDPC codes with sub-block locality, which is a recently introduced feature offering fast access to sub-blocks within the code block. Our simulations show that our framework results in SC-LDPC codes that outperform the state-of-the-art constructions, and that it offers the flexibility to choose low-SNR, high-SNR, or in-between SNR region as the primary design target. ",
    "url": "https://arxiv.org/abs/2203.02052",
    "authors": [
      "Homa Esfahanizadeh",
      "Eshed Ram",
      "Yuval Cassuto",
      "Lara Dolecek"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2203.02053",
    "title": "Mind the Gap: Understanding the Modality Gap in Multi-modal Contrastive  Representation Learning",
    "abstract": "We present modality gap, an intriguing geometric phenomenon of the representation space of multi-modal models. Specifically, we show that different data modalities (e.g. images and text) are embedded at arm's length in their shared representation in multi-modal models such as CLIP. Our systematic analysis demonstrates that this gap is caused by a combination of model initialization and contrastive learning optimization. In model initialization, we show empirically and theoretically that the representation of a common deep neural network is restricted to a narrow cone. As a consequence, in a multi-modal model with two encoders, the representations of the two modalities are clearly apart when the model is initialized. During optimization, contrastive learning keeps the different modalities separate by a certain distance, which is influenced by the temperature parameter in the loss function. Our experiments further demonstrate that varying the modality gap distance has a significant impact in improving the model's downstream zero-shot classification performance and fairness. Our code and data are available at https://modalitygap.readthedocs.io/ ",
    "url": "https://arxiv.org/abs/2203.02053",
    "authors": [
      "Weixin Liang",
      "Yuhui Zhang",
      "Yongchan Kwon",
      "Serena Yeung",
      "James Zou"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2203.02077",
    "title": "User-Level Membership Inference Attack against Metric Embedding Learning",
    "abstract": "Membership inference (MI) determines if a sample was part of a victim model training set. Recent development of MI attacks focus on record-level membership inference which limits their application in many real-world scenarios. For example, in the person re-identification task, the attacker (or investigator) is interested in determining if a user's images have been used during training or not. However, the exact training images might not be accessible to the attacker. In this paper, we develop a user-level MI attack where the goal is to find if any sample from the target user has been used during training even when no exact training sample is available to the attacker. We focus on metric embedding learning due to its dominance in person re-identification, where user-level MI attack is more sensible. We conduct an extensive evaluation on several datasets and show that our approach achieves high accuracy on user-level MI task. ",
    "url": "https://arxiv.org/abs/2203.02077",
    "authors": [
      "Guoyao Li",
      "Shahbaz Rezaei",
      "Xin Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.02078",
    "title": "CGN: A Capacity-Guaranteed Network Architecture for Future Ultra-Dense  Wireless Systems",
    "abstract": "The sixth generation (6G) era is envisioned to be a fully intelligent and autonomous era, with physical and digital lifestyles merged together. Future wireless network architectures should provide a solid support for such new lifestyles. A key problem thus arises that what kind of network architectures are suitable for 6G. In this paper, we propose a capacity-guaranteed network (CGN) architecture, which provides high capacity for wireless devices densely distributed everywhere, and ensures a superior scalability with low signaling overhead and computation complexity simultaneously. Our theorem proves that the essence of a CGN architecture is to decompose the whole network into non-overlapping clusters with equal cluster sum capacity. Simulation results reveal that in terms of the minimum cluster sum capacity, the proposed CGN can achieve at least 30% performance gain compared with existing base station clustering (BS-clustering) architectures. In addition, our theorem is sufficiently general and can be applied for networks with different distributions of BSs and users. ",
    "url": "https://arxiv.org/abs/2203.02078",
    "authors": [
      "Chaowen Deng",
      "Lu Yang",
      "Hao Wu",
      "Dmitry Zaporozhets",
      "Miaomiao Dong",
      "Bo Bai"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2203.02080",
    "title": "An Efficient Subpopulation-based Membership Inference Attack",
    "abstract": "Membership inference attacks allow a malicious entity to predict whether a sample is used during training of a victim model or not. State-of-the-art membership inference attacks have shown to achieve good accuracy which poses a great privacy threat. However, majority of SOTA attacks require training dozens to hundreds of shadow models to accurately infer membership. This huge computation cost raises questions about practicality of these attacks on deep models. In this paper, we introduce a fundamentally different MI attack approach which obviates the need to train hundreds of shadow models. Simply put, we compare the victim model output on the target sample versus the samples from the same subpopulation (i.e., semantically similar samples), instead of comparing it with the output of hundreds of shadow models. The intuition is that the model response should not be significantly different between the target sample and its subpopulation if it was not a training sample. In cases where subpopulation samples are not available to the attacker, we show that training only a single generative model can fulfill the requirement. Hence, we achieve the state-of-the-art membership inference accuracy while significantly reducing the training computation cost. ",
    "url": "https://arxiv.org/abs/2203.02080",
    "authors": [
      "Shahbaz Rezaei",
      "Xin Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02083",
    "title": "TransMUSE: Transferable Traffic Prediction in MUlti-Service EdgeNetworks",
    "abstract": "The Covid-19 pandemic has forced the workforce to switch to working from home, which has put significant burdens on the management of broadband networks and called for intelligent service-by-service resource optimization at the network edge. In this context, network traffic prediction is crucial for operators to provide reliable connectivity across large geographic regions. Although recent advances in neural network design have demonstrated potential to effectively tackle forecasting, in this work we reveal based on real-world measurements that network traffic across different regions differs widely. As a result, models trained on historical traffic data observed in one region can hardly serve in making accurate predictions in other areas. Training bespoke models for different regions is tempting, but that approach bears significant measurement overhead, is computationally expensive, and does not scale. Therefore, in this paper we propose TransMUSE, a novel deep learning framework that clusters similar services, groups edge-nodes into cohorts by traffic feature similarity, and employs a Transformer-based Multi-service Traffic Prediction Network (TMTPN), which can be directly transferred within a cohort without any customization. We demonstrate that TransMUSE exhibits imperceptible performance degradation in terms of mean absolute error (MAE) when forecasting traffic, compared with settings where a model is trained for each individual edge node. Moreover, our proposed TMTPN architecture outperforms the state-of-the-art, achieving up to 43.21% lower MAE in the multi-service traffic prediction task. To the best of our knowledge, this is the first work that jointly employs model transfer and multi-service traffic prediction to reduce measurement overhead, while providing fine-grained accurate demand forecasts for edge services provisioning. ",
    "url": "https://arxiv.org/abs/2203.02083",
    "authors": [
      "Luyang Xu",
      "Haoyu Liu",
      "Junping Song",
      "Rui Li",
      "Yahui Hu",
      "Xu Zhou",
      "Paul Patras"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.02084",
    "title": "Robust Approximate Simulation for Hierarchical Control of Piecewise  Affine Systems under Bounded Disturbances",
    "abstract": "Piecewise affine (PWA) systems are widely applied in many practical cases such as the control of nonlinear systems and hybrid dynamics. However, most of the existing PWA control methods have poor scalability with respect to the number of modes and system dimensions and may not be robust to the disturbances in performance. In this paper, we present a robust approximate simulation based control method for PWA systems under bounded external disturbances. First, a lower-dimensional linear system (abstraction) and an associated interface are designed to enable the output of the PWA system (concrete system) to track the output of the abstraction. Then, a Lyapunov-like simulation function is designed to show the boundedness of the output errors between the two systems. Furthermore, the results obtained for linear abstraction are extended to the case that a simpler PWA system is the abstraction. To illustrate the effectiveness of the proposed approach, simulation results are provided for two design examples. ",
    "url": "https://arxiv.org/abs/2203.02084",
    "authors": [
      "Zihao Song",
      "Vince Kurtz",
      "Shirantha Welikala",
      "Panos J. Antsaklis",
      "Hai Lin"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.02086",
    "title": "WPNAS: Neural Architecture Search by jointly using Weight Sharing and  Predictor",
    "abstract": "Weight sharing based and predictor based methods are two major types of fast neural architecture search methods. In this paper, we propose to jointly use weight sharing and predictor in a unified framework. First, we construct a SuperNet in a weight-sharing way and probabilisticly sample architectures from the SuperNet. To increase the correctness of the evaluation of architectures, besides direct evaluation using the inherited weights, we further apply a few-shot predictor to assess the architecture on the other hand. The final evaluation of the architecture is the combination of direct evaluation, the prediction from the predictor and the cost of the architecture. We regard the evaluation as a reward and apply a self-critical policy gradient approach to update the architecture probabilities. To further reduce the side effects of weight sharing, we propose a weakly weight sharing method by introducing another HyperNet. We conduct experiments on datasets including CIFAR-10, CIFAR-100 and ImageNet under NATS-Bench, DARTS and MobileNet search space. The proposed WPNAS method achieves state-of-the-art performance on these datasets. ",
    "url": "https://arxiv.org/abs/2203.02086",
    "authors": [
      "Ke Lin",
      "Yong A",
      "Zhuoxin Gan",
      "Yingying Jiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2203.02095",
    "title": "Contrastive Graph Convolutional Networks for Hardware Trojan Detection  in Third Party IP Cores",
    "abstract": "The availability of wide-ranging third-party intellectual property (3PIP) cores enables integrated circuit (IC) designers to focus on designing high-level features in ASICs/SoCs. The massive proliferation of ICs brings with it an increased number of bad actors seeking to exploit those circuits for various nefarious reasons. This is not surprising as integrated circuits affect every aspect of society. Thus, malicious logic (Hardware Trojans, HT) being surreptitiously injected by untrusted vendors into 3PIP cores used in IC design is an ever present threat. In this paper, we explore methods for identification of trigger-based HT in designs containing synthesizable IP cores without a golden model. Specifically, we develop methods to detect hardware trojans by detecting triggers embedded in ICs purely based on netlists acquired from the vendor. We propose GATE-Net, a deep learning model based on graph-convolutional networks (GCN) trained using supervised contrastive learning, for flagging designs containing randomly-inserted triggers using only the corresponding netlist. Our proposed architecture achieves significant improvements over state-of-the-art learning models yielding an average 46.99% improvement in detection performance for combinatorial triggers and 21.91% improvement for sequential triggers across a variety of circuit types. Through rigorous experimentation, qualitative and quantitative performance evaluations, we demonstrate effectiveness of GATE-Net and the supervised contrastive training of GATE-Net for HT detection. ",
    "url": "https://arxiv.org/abs/2203.02095",
    "authors": [
      "Nikhil Muralidhar",
      "Abdullah Zubair",
      "Nathanael Weidler",
      "Ryan Gerdes",
      "Naren Ramakrishnan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)",
      "Cryptography and Security (cs.CR)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.02107",
    "title": "Learning Category-Level Generalizable Object Manipulation Policy via  Generative Adversarial Self-Imitation Learning from Demonstrations",
    "abstract": "Generalizable object manipulation skills are critical for intelligent and multi-functional robots to work in real-world complex scenes. Despite the recent progress in reinforcement learning, it is still very challenging to learn a generalizable manipulation policy that can handle a category of geometrically diverse articulated objects. In this work, we tackle this category-level object manipulation policy learning problem via imitation learning in a task-agnostic manner, where we assume no handcrafted dense rewards but only a terminal reward. Given this novel and challenging generalizable policy learning problem, we identify several key issues that can fail the previous imitation learning algorithms and hinder the generalization to unseen instances. We then propose several general but critical techniques, including generative adversarial self-imitation learning from demonstrations, progressive growing of discriminator, and instance-balancing for expert buffer, that accurately pinpoints and tackles these issues and can benefit category-level manipulation policy learning regardless of the tasks. Our experiments on ManiSkill benchmarks demonstrate a remarkable improvement on all tasks and our ablation studies further validate the contribution of each proposed technique. ",
    "url": "https://arxiv.org/abs/2203.02107",
    "authors": [
      "Hao Shen",
      "Weikang Wan",
      "He Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02108",
    "title": "Continual Horizontal Federated Learning for Heterogeneous Data",
    "abstract": "Federated learning is a promising machine learning technique that enables multiple clients to collaboratively build a model without revealing the raw data to each other. Among various types of federated learning methods, horizontal federated learning (HFL) is the best-studied category and handles homogeneous feature spaces. However, in the case of heterogeneous feature spaces, HFL uses only common features and leaves client-specific features unutilized. In this paper, we propose a HFL method using neural networks named continual horizontal federated learning (CHFL), a continual learning approach to improve the performance of HFL by taking advantage of unique features of each client. CHFL splits the network into two columns corresponding to common features and unique features, respectively. It jointly trains the first column by using common features through vanilla HFL and locally trains the second column by using unique features and leveraging the knowledge of the first one via lateral connections without interfering with the federated training of it. We conduct experiments on various real world datasets and show that CHFL greatly outperforms vanilla HFL that only uses common features and local learning that uses all features that each client has. ",
    "url": "https://arxiv.org/abs/2203.02108",
    "authors": [
      "Junki Mori",
      "Isamu Teranishi",
      "Ryo Furukawa"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02112",
    "title": "Pseudo-Stereo for Monocular 3D Object Detection in Autonomous Driving",
    "abstract": "Pseudo-LiDAR 3D detectors have made remarkable progress in monocular 3D detection by enhancing the capability of perceiving depth with depth estimation networks, and using LiDAR-based 3D detection architectures. The advanced stereo 3D detectors can also accurately localize 3D objects. The gap in image-to-image generation for stereo views is much smaller than that in image-to-LiDAR generation. Motivated by this, we propose a Pseudo-Stereo 3D detection framework with three novel virtual view generation methods, including image-level generation, feature-level generation, and feature-clone, for detecting 3D objects from a single image. Our analysis of depth-aware learning shows that the depth loss is effective in only feature-level virtual view generation and the estimated depth map is effective in both image-level and feature-level in our framework. We propose a disparity-wise dynamic convolution with dynamic kernels sampled from the disparity feature map to filter the features adaptively from a single image for generating virtual image features, which eases the feature degradation caused by the depth estimation errors. Till submission (November 18, 2021), our Pseudo-Stereo 3D detection framework ranks 1st on car, pedestrian, and cyclist among the monocular 3D detectors with publications on the KITTI-3D benchmark. The code is released at https://github.com/revisitq/Pseudo-Stereo-3D. ",
    "url": "https://arxiv.org/abs/2203.02112",
    "authors": [
      "Yi-Nan Chen",
      "Hang Dai",
      "Yong Ding"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02115",
    "title": "Towards Benchmarking and Evaluating Deepfake Detection",
    "abstract": "Deepfake detection automatically recognizes the manipulated medias through the analysis of the difference between manipulated and non-altered videos. It is natural to ask which are the top performers among the existing deepfake detection approaches to identify promising research directions and provide practical guidance. Unfortunately, it's difficult to conduct a sound benchmarking comparison of existing detection approaches using the results in the literature because evaluation conditions are inconsistent across studies. Our objective is to establish a comprehensive and consistent benchmark, to develop a repeatable evaluation procedure, and to measure the performance of a range of detection approaches so that the results can be compared soundly. A challenging dataset consisting of the manipulated samples generated by more than 13 different methods has been collected, and 11 popular detection approaches (9 algorithms) from the existing literature have been implemented and evaluated with 6 fair-minded and practical evaluation metrics. Finally, 92 models have been trained and 644 experiments have been performed for the evaluation. The results along with the shared data and evaluation methodology constitute a benchmark for comparing deepfake detection approaches and measuring progress. ",
    "url": "https://arxiv.org/abs/2203.02115",
    "authors": [
      "Chenhao Lin",
      "Jingyi Deng",
      "Pengbin Hu",
      "Chao Shen",
      "Qian Wang",
      "Qi Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.02119",
    "title": "GraspARL: Dynamic Grasping via Adversarial Reinforcement Learning",
    "abstract": "Grasping moving objects, such as goods on a belt or living animals, is an important but challenging task in robotics. Conventional approaches rely on a set of manually defined object motion patterns for training, resulting in poor generalization to unseen object trajectories. In this work, we introduce an adversarial reinforcement learning framework for dynamic grasping, namely GraspARL. To be specific. we formulate the dynamic grasping problem as a 'move-and-grasp' game, where the robot is to pick up the object on the mover and the adversarial mover is to find a path to escape it. Hence, the two agents play a min-max game and are trained by reinforcement learning. In this way, the mover can auto-generate diverse moving trajectories while training. And the robot trained with the adversarial trajectories can generalize to various motion patterns. Empirical results on the simulator and real-world scenario demonstrate the effectiveness of each and good generalization of our method. ",
    "url": "https://arxiv.org/abs/2203.02119",
    "authors": [
      "Tianhao Wu",
      "Fangwei Zhong",
      "Yiran Geng",
      "Hongchen Wang",
      "Yongjian Zhu",
      "Yizhou Wang",
      "Hao Dong"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.02121",
    "title": "Adversarial Patterns: Building Robust Android Malware Classifiers",
    "abstract": "Deep learning-based classifiers have substantially improved recognition of malware samples. However, these classifiers can be vulnerable to adversarial input perturbations. Any vulnerability in malware classifiers poses significant threats to the platforms they defend. Therefore, to create stronger defense models against malware, we must understand the patterns in input perturbations caused by an adversary. This survey paper presents a comprehensive study on adversarial machine learning for android malware classifiers. We first present an extensive background in building a machine learning classifier for android malware, covering both image-based and text-based feature extraction approaches. Then, we examine the pattern and advancements in the state-of-the-art research in evasion attacks and defenses. Finally, we present guidelines for designing robust malware classifiers and enlist research directions for the future. ",
    "url": "https://arxiv.org/abs/2203.02121",
    "authors": [
      "Dipkamal Bhusal",
      "Nidhi Rastogi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02123",
    "title": "Detecting Offensive Language on Social Networks: An End-to-end Detection  Method based on Graph Attention Networks",
    "abstract": "The pervasiveness of offensive language on the social network has caused adverse effects on society, such as abusive behavior online. It is urgent to detect offensive language and curb its spread. Existing research shows that methods with community structure features effectively improve the performance of offensive language detection. However, the existing models deal with community structure independently, which seriously affects the effectiveness of detection models. In this paper, we propose an end-to-end method based on community structure and text features for offensive language detection (CT-OLD). Specifically, the community structure features are directly captured by the graph attention network layer, and the text embeddings are taken from the last hidden layer of BERT. Attention mechanisms and position encoding are used to fuse these features. Meanwhile, we add user opinion to the community structure for representing user features. The user opinion is represented by user historical behavior information, which outperforms that represented by text information. Besides the above point, the distribution of users and tweets is unbalanced in the popular datasets, which limits the generalization ability of the model. To address this issue, we construct and release a dataset with reasonable user distribution. Our method outperforms baselines with the F1 score of 89.94%. The results show that the end-to-end model effectively learns the potential information of community structure and text, and user historical behavior information is more suitable for user opinion representation. ",
    "url": "https://arxiv.org/abs/2203.02123",
    "authors": [
      "Zhenxiong Miao",
      "Xingshu Chen",
      "Haizhou Wang",
      "Rui Tang",
      "Zhou Yang",
      "Wenyi Tang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.02124",
    "title": "Abuse and Fraud Detection in Streaming Services Using Heuristic-Aware  Machine Learning",
    "abstract": "This work presents a fraud and abuse detection framework for streaming services by modeling user streaming behavior. The goal is to discover anomalous and suspicious incidents and scale the investigation efforts by creating models that characterize the user behavior. We study the use of semi-supervised as well as supervised approaches for anomaly detection. In the semi-supervised approach, by leveraging only a set of authenticated anomaly-free data samples, we show the use of one-class classification algorithms as well as autoencoder deep neural networks for anomaly detection. In the supervised anomaly detection task, we present a so-called heuristic-aware data labeling strategy for creating labeled data samples. We carry out binary classification as well as multi-class multi-label classification tasks for not only detecting the anomalous samples but also identifying the underlying anomaly behavior(s) associated with each one. Finally, using a systematic feature importance study we provide insights into the underlying set of features that characterize different streaming fraud categories. To the best of our knowledge, this is the first paper to use machine learning methods for fraud and abuse detection in real-world scale streaming services. ",
    "url": "https://arxiv.org/abs/2203.02124",
    "authors": [
      "Soheil Esmaeilzadeh",
      "Negin Salajegheh",
      "Amir Ziai",
      "Jeff Boote"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.02128",
    "title": "Distributionally Robust Bayesian Optimization with $φ$-divergences",
    "abstract": "The study of robustness has received much attention due to its inevitability in data-driven settings where many systems face uncertainty. One such example of concern is Bayesian Optimization (BO), where uncertainty is multi-faceted, yet there only exists a limited number of works dedicated to this direction. In particular, there is the work of Kirschner et al. (2020), which bridges the existing literature of Distributionally Robust Optimization (DRO) by casting the BO problem from the lens of DRO. While this work is pioneering, it admittedly suffers from various practical shortcomings such as finite contexts assumptions, leaving behind the main question Can one devise a computationally tractable algorithm for solving this DRO-BO problem? In this work, we tackle this question to a large degree of generality by considering robustness against data-shift in $\\phi$-divergences, which subsumes many popular choices, such as the $\\chi^2$-divergence, Total Variation, and the extant Kullback-Leibler (KL) divergence. We show that the DRO-BO problem in this setting is equivalent to a finite-dimensional optimization problem which, even in the continuous context setting, can be easily implemented with provable sublinear regret bounds. We then show experimentally that our method surpasses existing methods, attesting to the theoretical results ",
    "url": "https://arxiv.org/abs/2203.02128",
    "authors": [
      "Hisham Husain",
      "Vu Nguyen",
      "Anton van den Hengel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.02133",
    "title": "A Versatile Multi-View Framework for LiDAR-based 3D Object Detection  with Guidance from Panoptic Segmentation",
    "abstract": "3D object detection using LiDAR data is an indispensable component for autonomous driving systems. Yet, only a few LiDAR-based 3D object detection methods leverage segmentation information to further guide the detection process. In this paper, we propose a novel multi-task framework that jointly performs 3D object detection and panoptic segmentation. In our method, the 3D object detection backbone in Bird's-Eye-View (BEV) plane is augmented by the injection of Range-View (RV) feature maps from the 3D panoptic segmentation backbone. This enables the detection backbone to leverage multi-view information to address the shortcomings of each projection view. Furthermore, foreground semantic information is incorporated to ease the detection task by highlighting the locations of each object class in the feature maps. Finally, a new center density heatmap generated based on the instance-level information further guides the detection backbone by suggesting possible box center locations for objects. Our method works with any BEV-based 3D object detection method, and as shown by extensive experiments on the nuScenes dataset, it provides significant performance gains. Notably, the proposed method based on a single-stage CenterPoint 3D object detection network achieved state-of-the-art performance on nuScenes 3D Detection Benchmark with 67.3 NDS. ",
    "url": "https://arxiv.org/abs/2203.02133",
    "authors": [
      "Hamidreza Fazlali",
      "Yixuan Xu",
      "Yuan Ren",
      "Bingbing Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02135",
    "title": "Continual Few-shot Relation Learning via Embedding Space Regularization  and Data Augmentation",
    "abstract": "Existing continual relation learning (CRL) methods rely on plenty of labeled training data for learning a new task, which can be hard to acquire in real scenario as getting large and representative labeled data is often expensive and time-consuming. It is therefore necessary for the model to learn novel relational patterns with very few labeled data while avoiding catastrophic forgetting of previous task knowledge. In this paper, we formulate this challenging yet practical problem as continual few-shot relation learning (CFRL). Based on the finding that learning for new emerging few-shot tasks often results in feature distributions that are incompatible with previous tasks' learned distributions, we propose a novel method based on embedding space regularization and data augmentation. Our method generalizes to new few-shot tasks and avoids catastrophic forgetting of previous tasks by enforcing extra constraints on the relational embeddings and by adding extra {relevant} data in a self-supervised manner. With extensive experiments we demonstrate that our method can significantly outperform previous state-of-the-art methods in CFRL task settings. ",
    "url": "https://arxiv.org/abs/2203.02135",
    "authors": [
      "Chengwei Qin",
      "Shafiq Joty"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02150",
    "title": "Time-aware Graph Neural Networks for Entity Alignment between Temporal  Knowledge Graphs",
    "abstract": "Entity alignment aims to identify equivalent entity pairs between different knowledge graphs (KGs). Recently, the availability of temporal KGs (TKGs) that contain time information created the need for reasoning over time in such TKGs. Existing embedding-based entity alignment approaches disregard time information that commonly exists in many large-scale KGs, leaving much room for improvement. In this paper, we focus on the task of aligning entity pairs between TKGs and propose a novel Time-aware Entity Alignment approach based on Graph Neural Networks (TEA-GNN). We embed entities, relations and timestamps of different KGs into a vector space and use GNNs to learn entity representations. To incorporate both relation and time information into the GNN structure of our model, we use a time-aware attention mechanism which assigns different weights to different nodes with orthogonal transformation matrices computed from embeddings of the relevant relations and timestamps in a neighborhood. Experimental results on multiple real-world TKG datasets show that our method significantly outperforms the state-of-the-art methods due to the inclusion of time information. ",
    "url": "https://arxiv.org/abs/2203.02150",
    "authors": [
      "Chengjin_Xu",
      "Fenglong Su",
      "Jens Lehmann"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.02157",
    "title": "DetFlowTrack: 3D Multi-object Tracking based on Simultaneous  Optimization of Object Detection and Scene Flow Estimation",
    "abstract": "3D Multi-Object Tracking (MOT) is an important part of the unmanned vehicle perception module. Most methods optimize object detection and data association independently. These methods make the network structure complicated and limit the improvement of MOT accuracy. we proposed a 3D MOT framework based on simultaneous optimization of object detection and scene flow estimation. In the framework, a detection-guidance scene flow module is proposed to relieve the problem of incorrect inter-frame assocation. For more accurate scene flow label especially in the case of motion with rotation, a box-transformation-based scene flow ground truth calculation method is proposed. Experimental results on the KITTI MOT dataset show competitive results over the state-of-the-arts and the robustness under extreme motion with rotation. ",
    "url": "https://arxiv.org/abs/2203.02157",
    "authors": [
      "Yueling Shen",
      "Guangming Wang",
      "Hesheng Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.02163",
    "title": "A general alternating-direction implicit Newton method for solving  complex continuous-time algebraic Riccati matrix equation",
    "abstract": "In this paper, applying the Newton method, we transform the complex continuous-time algebraic Riccati matrix equation into a Lyapunov equation. Then, we introduce an efficient general alternating-direction implicit (GADI) method to solve the Lyapunov equation. The inexact Newton-GADI method is presented to save computational amount effectively. Moreover, we analyze the convergence of the Newton-GADI method. The convergence rate of the Newton-GADI and Newton-ADI methods is compared by analyzing their spectral radii. Furthermore, we give a way to select the quasi-optimal parameter. Corresponding numerical tests are shown to illustrate the effectiveness of the proposed algorithms. ",
    "url": "https://arxiv.org/abs/2203.02163",
    "authors": [
      "Shifeng Li",
      "Kai Jiang Juan Zhang"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2203.02167",
    "title": "SimKGC: Simple Contrastive Knowledge Graph Completion with Pre-trained  Language Models",
    "abstract": "Knowledge graph completion (KGC) aims to reason over known facts and infer the missing links. Text-based methods such as KGBERT (Yao et al., 2019) learn entity representations from natural language descriptions, and have the potential for inductive KGC. However, the performance of text-based methods still largely lag behind graph embedding-based methods like TransE (Bordes et al., 2013) and RotatE (Sun et al., 2019b). In this paper, we identify that the key issue is efficient contrastive learning. To improve the learning efficiency, we introduce three types of negatives: in-batch negatives, pre-batch negatives, and self-negatives which act as a simple form of hard negatives. Combined with InfoNCE loss, our proposed model SimKGC can substantially outperform embedding-based methods on several benchmark datasets. In terms of mean reciprocal rank (MRR), we advance the state-of-the-art by +19% on WN18RR, +6.8% on the Wikidata5M transductive setting, and +22% on the Wikidata5M inductive setting. Thorough analyses are conducted to gain insights into each component. Our code is available at https://github.com/intfloat/SimKGC . ",
    "url": "https://arxiv.org/abs/2203.02167",
    "authors": [
      "Liang Wang",
      "Wei Zhao",
      "Zhuoyu Wei",
      "Jingming Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.02172",
    "title": "Semantic-Aware Representation Blending for Multi-Label Image Recognition  with Partial Labels",
    "abstract": "Training the multi-label image recognition models with partial labels, in which merely some labels are known while others are unknown for each image, is a considerably challenging and practical task. To address this task, current algorithms mainly depend on pre-training classification or similarity models to generate pseudo labels for the unknown labels. However, these algorithms depend on sufficient multi-label annotations to train the models, leading to poor performance especially with low known label proportion. In this work, we propose to blend category-specific representation across different images to transfer information of known labels to complement unknown labels, which can get rid of pre-training models and thus does not depend on sufficient annotations. To this end, we design a unified semantic-aware representation blending (SARB) framework that exploits instance-level and prototype-level semantic representation to complement unknown labels by two complementary modules: 1) an instance-level representation blending (ILRB) module blends the representations of the known labels in an image to the representations of the unknown labels in another image to complement these unknown labels. 2) a prototype-level representation blending (PLRB) module learns more stable representation prototypes for each category and blends the representation of unknown labels with the prototypes of corresponding labels to complement these labels. Extensive experiments on the MS-COCO, Visual Genome, Pascal VOC 2007 datasets show that the proposed SARB framework obtains superior performance over current leading competitors on all known label proportion settings, i.e., with the mAP improvement of 4.6%, 4.%, 2.2% on these three datasets when the known label proportion is 10%. Codes are available at https://github.com/HCPLab-SYSU/HCP-MLR-PL. ",
    "url": "https://arxiv.org/abs/2203.02172",
    "authors": [
      "Tao Pu",
      "Tianshui Chen",
      "Hefeng Wu",
      "Liang Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02177",
    "title": "GCNet: Graph Completion Network for Incomplete Multimodal Learning in  Conversation",
    "abstract": "Conversations have become a critical data format on social media platforms. Understanding conversation from emotion, content, and other aspects also attracts increasing attention from researchers due to its widespread application in human-computer interaction. In real-world environments, we often encounter the problem of incomplete modalities, which has become a core issue of conversation understanding. To address this problem, researchers propose various methods. However, existing approaches are mainly designed for individual utterances or medical images rather than conversational data, which cannot exploit temporal and speaker information in conversations. To this end, we propose a novel framework for incomplete multimodal learning in conversations, called \"Graph Complete Network (GCNet)\", filling the gap of existing works. Our GCNet contains two well-designed graph neural network-based modules, \"Speaker GNN\" and \"Temporal GNN\", to capture temporal and speaker information in conversations. To make full use of complete and incomplete data in feature learning, we jointly optimize classification and reconstruction in an end-to-end manner. To verify the effectiveness of our method, we conduct experiments on three benchmark conversational datasets. Experimental results demonstrate that our GCNet is superior to existing state-of-the-art approaches in incomplete multimodal learning. ",
    "url": "https://arxiv.org/abs/2203.02177",
    "authors": [
      "Zheng Lian",
      "Lan Chen",
      "Licai Sun",
      "Bin Liu",
      "Jianhua Tao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.02180",
    "title": "EAG: Extract and Generate Multi-way Aligned Corpus for Complete  Multi-lingual Neural Machine Translation",
    "abstract": "Complete Multi-lingual Neural Machine Translation (C-MNMT) achieves superior performance against the conventional MNMT by constructing multi-way aligned corpus, i.e., aligning bilingual training examples from different language pairs when either their source or target sides are identical. However, since exactly identical sentences from different language pairs are scarce, the power of the multi-way aligned corpus is limited by its scale. To handle this problem, this paper proposes \"Extract and Generate\" (EAG), a two-step approach to construct large-scale and high-quality multi-way aligned corpus from bilingual data. Specifically, we first extract candidate aligned examples by pairing the bilingual examples from different language pairs with highly similar source or target sentences; and then generate the final aligned examples from the candidates with a well-trained generation model. With this two-step pipeline, EAG can construct a large-scale and multi-way aligned corpus whose diversity is almost identical to the original bilingual corpus. Experiments on two publicly available datasets i.e., WMT-5 and OPUS-100, show that the proposed method achieves significant improvements over strong baselines, with +1.1 and +1.4 BLEU points improvements on the two datasets respectively. ",
    "url": "https://arxiv.org/abs/2203.02180",
    "authors": [
      "Yulin Xu",
      "Zhen Yang",
      "Fandong Meng",
      "JieZhou"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.02187",
    "title": "Fault-Tolerant Backup Clustering Algorithm for Smart Connected  Underwater Sensor Networks",
    "abstract": "This paper addresses poor cluster formation and frequent Cluster Head (CH) failure issues of underwater sensor networks by proposing an energy-efficient hierarchical topology-aware clustering routing (EEHTAC) protocol. In this paper, fault-tolerant backup clustering (FTBC) algorithms and multi-parameter cluster formation (MPCF) model were developed for the EEHTAC operation. The MPCF model tackles the issue of poor cluster formation performance by integrating multiple parameters to achieve effective clustering process. The FTBC algorithms tackle the issue of frequent CH failures to avoid interruption in data transmission. Performance of the MPCF model was evaluated using normal, high-fault, and high routing overhead network scenarios. Performance metrics employed for this analysis are temporal topology variation ratio (TTVR), CH load distribution (CLD), and cluster stability (STB). Obtained results show that operating with a CH retention period of 90s achieves better CH duty cycling per round and improves the MPCF process with values of 25.69%, 55.56%, and 60% for TTVR, CLD, and STB respectively. Performance of the FTBC-based EEHTAC was evaluated relative to Energy-balanced Unequal Layering Clustering (EULC) protocol. Performance indicators adopted for this evaluation are routing overhead ({\\Omega}), end to end delay ({\\Delta}), CH failures recovered (CFR), CH failures detected (CFD), received packets ({\\theta}), and energy consumption ({\\Sigma}). With reference to the best obtained values, EEHTAC demonstrated performance improvement of 58.40%, 29.94%, 81.33%, 28.02%, 86.65%, and 54.35% over EULC variants in terms of {\\Omega}, {\\Delta}, CFR, CFD, {\\theta}, and {\\Sigma} respectively. Obtained results displayed that the MPCF model is efficient for cluster formation performance and the FTBC-based EEHTAC protocol can perform effectively well against an existing CBR protocol. ",
    "url": "https://arxiv.org/abs/2203.02187",
    "authors": [
      "Abdulazeez Femi Salami",
      "Emmanuel Adewale Adedokun",
      "Habeeb Bello-Salau",
      "Bashir Olaniyi Sadiq"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.02193",
    "title": "Time-to-Label: Temporal Consistency for Self-Supervised Monocular 3D  Object Detection",
    "abstract": "Monocular 3D object detection continues to attract attention due to the cost benefits and wider availability of RGB cameras. Despite the recent advances and the ability to acquire data at scale, annotation cost and complexity still limit the size of 3D object detection datasets in the supervised settings. Self-supervised methods, on the other hand, aim at training deep networks relying on pretext tasks or various consistency constraints. Moreover, other 3D perception tasks (such as depth estimation) have shown the benefits of temporal priors as a self-supervision signal. In this work, we argue that the temporal consistency on the level of object poses, provides an important supervision signal given the strong prior on physical motion. Specifically, we propose a self-supervised loss which uses this consistency, in addition to render-and-compare losses, to refine noisy pose predictions and derive high-quality pseudo labels. To assess the effectiveness of the proposed method, we finetune a synthetically trained monocular 3D object detection model using the pseudo-labels that we generated on real data. Evaluation on the standard KITTI3D benchmark demonstrates that our method reaches competitive performance compared to other monocular self-supervised and supervised methods. ",
    "url": "https://arxiv.org/abs/2203.02193",
    "authors": [
      "Issa Mouawad",
      "Nikolas Brasch",
      "Fabian Manhardt",
      "Federico Tombari",
      "Francesca Odone"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.02194",
    "title": "Rethinking Reconstruction Autoencoder-Based Out-of-Distribution  Detection",
    "abstract": "In some scenarios, classifier requires detecting out-of-distribution samples far from its training data. With desirable characteristics, reconstruction autoencoder-based methods deal with this problem by using input reconstruction error as a metric of novelty vs. normality. We formulate the essence of such approach as a quadruplet domain translation with an intrinsic bias to only query for a proxy of conditional data uncertainty. Accordingly, an improvement direction is formalized as maximumly compressing the autoencoder's latent space while ensuring its reconstructive power for acting as a described domain translator. From it, strategies are introduced including semantic reconstruction, data certainty decomposition and normalized L2 distance to substantially improve original methods, which together establish state-of-the-art performance on various benchmarks, e.g., the FPR@95%TPR of CIFAR-100 vs. TinyImagenet-crop on Wide-ResNet is 0.2%. Importantly, our method works without any additional data, hard-to-implement structure, time-consuming pipeline, and even harming the classification accuracy of known classes. ",
    "url": "https://arxiv.org/abs/2203.02194",
    "authors": [
      "Yibo Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02196",
    "title": "Data Augmentation Empowered Neural Precoding for Multiuser MIMO with  MMSE Model",
    "abstract": "Precoding design exploiting deep learning methods has been widely studied for multiuser multiple-input multiple-output (MU-MIMO) systems. However, conventional neural precoding design applies black-box-based neural networks which are less interpretable. In this paper, we propose a deep learning-based precoding method based on an interpretable design of a neural precoding network, namely iPNet. In particular, the iPNet mimics the classic minimum mean-squared error (MMSE) precoding and approximates the matrix inversion in the design of the neural network architecture. Specifically, the proposed iPNet consists of a model-driven component network, responsible for augmenting the input channel state information (CSI), and a data-driven sub-network, responsible for precoding calculation from this augmented CSI. The latter data-driven module is explicitly interpreted as an unsupervised learner of the MMSE precoder. Simulation results show that by exploiting the augmented CSI, the proposed iPNet achieves noticeable performance gain over existing black-box designs and also exhibits enhanced generalizability against CSI mismatches. ",
    "url": "https://arxiv.org/abs/2203.02196",
    "authors": [
      "Shaoqing Zhang",
      "Jindan Xu",
      "Wei Xu",
      "NingWang",
      "Derrick Wing Kwan Ng",
      "Xiaohu You"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.02200",
    "title": "Aggregate effects of advertising decisions: a complex systems look at  search engine advertising via an experimental study",
    "abstract": "Purpose: We model group advertising decisions, which are the collective decisions of every single advertiser within the set of advertisers who are competing in the same auction or vertical industry, and examine resulting market outcomes, via a proposed simulation framework named EXP-SEA (Experimental Platform for Search Engine Advertising) supporting experimental studies of collective behaviors in the context of search engine advertising. Design: We implement the EXP-SEA to validate the proposed simulation framework, also conduct three experimental studies on the aggregate impact of electronic word-of-mouth, the competition level, and strategic bidding behaviors. EXP-SEA supports heterogeneous participants, various auction mechanisms, and also ranking and pricing algorithms. Findings: Findings from our three experiments show that (a) both the market profit and advertising indexes such as number of impressions and number of clicks are larger when the eWOM effect presents, meaning social media certainly has some effect on search engine advertising outcomes, (b) the competition level has a monotonic increasing effect on the market performance, thus search engines have an incentive to encourage both the eWOM among search users and competition among advertisers, and (c) given the market-level effect of the percentage of advertisers employing a dynamic greedy bidding strategy, there is a cut-off point for strategic bidding behaviors. Originality: This is one of the first research works to explore collective group decisions and resulting phenomena in the complex context of search engine advertising via developing and validating a simulation framework that supports assessments of various advertising strategies and estimations of the impact of mechanisms on the search market. ",
    "url": "https://arxiv.org/abs/2203.02200",
    "authors": [
      "Yanwu Yang",
      "Xin Li",
      "Bernard J. Jansen",
      "Daniel Zeng"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2203.02201",
    "title": "Neural Simulated Annealing",
    "abstract": "Simulated annealing (SA) is a stochastic global optimisation technique applicable to a wide range of discrete and continuous variable problems. Despite its simplicity, the development of an effective SA optimiser for a given problem hinges on a handful of carefully handpicked components; namely, neighbour proposal distribution and temperature annealing schedule. In this work, we view SA from a reinforcement learning perspective and frame the proposal distribution as a policy, which can be optimised for higher solution quality given a fixed computational budget. We demonstrate that this Neural SA with such a learnt proposal distribution, parametrised by small equivariant neural networks, outperforms SA baselines on a number of problems: Rosenbrock's function, the Knapsack problem, the Bin Packing problem, and the Travelling Salesperson problem. We also show that Neural SA scales well to large problems - generalising to significantly larger problems than the ones seen during training - while achieving comparable performance to popular off-the-shelf solvers and other machine learning methods in terms of solution quality and wall-clock time. ",
    "url": "https://arxiv.org/abs/2203.02201",
    "authors": [
      "Alvaro H.C. Correia",
      "Daniel E. Worrall",
      "Roberto Bondesan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.02216",
    "title": "Look\\&Listen: Multi-Modal Correlation Learning for Active Speaker  Detection and Speech Enhancement",
    "abstract": "Active speaker detection and speech enhancement have become two increasingly attractive topics in audio-visual scenario understanding. According to their respective characteristics, the scheme of independently designed architecture has been widely used in correspondence to each single task. This may lead to the learned feature representation being task-specific, and inevitably result in the lack of generalization ability of the feature based on multi-modal modeling. More recent studies have shown that establishing cross-modal relationship between auditory and visual stream is a promising solution for the challenge of audio-visual multi-task learning. Therefore, as a motivation to bridge the multi-modal cross-attention, in this work, a unified framework ADENet is proposed to achieve target speaker detection and speech enhancement with joint learning of audio-visual modeling. ",
    "url": "https://arxiv.org/abs/2203.02216",
    "authors": [
      "Junwen Xiong",
      "Yu Zhou",
      "Peng Zhang",
      "Lei Xie",
      "Wei Huang",
      "Yufei Zha"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.02227",
    "title": "Partial Wasserstein Adversarial Network for Non-rigid Point Set  Registration",
    "abstract": "Given two point sets, the problem of registration is to recover a transformation that matches one set to the other. This task is challenging due to the presence of the large number of outliers, the unknown non-rigid deformations and the large sizes of point sets. To obtain strong robustness against outliers, we formulate the registration problem as a partial distribution matching (PDM) problem, where the goal is to partially match the distributions represented by point sets in a metric space. To handle large point sets, we propose a scalable PDM algorithm by utilizing the efficient partial Wasserstein-1 (PW) discrepancy. Specifically, we derive the Kantorovich-Rubinstein duality for the PW discrepancy, and show its gradient can be explicitly computed. Based on these results, we propose a partial Wasserstein adversarial network (PWAN), which is able to approximate the PW discrepancy by a neural network, and minimize it by gradient descent. In addition, it also incorporates an efficient coherence regularizer for non-rigid transformations to avoid unrealistic deformations. We evaluate PWAN on practical point set registration tasks, and show that the proposed PWAN is robust, scalable and performs more favorably than the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2203.02227",
    "authors": [
      "Zi-Ming Wang",
      "Nan Xue",
      "Ling Lei",
      "Gui-Song Xia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02271",
    "title": "Data-driven MPC of descriptor systems: A case study for power networks",
    "abstract": "Recently, data-driven predictive control of linear systems has received wide-spread research attention. It hinges on the fundamental lemma by Willems et al. In a previous paper, we have shown how this framework can be applied to predictive control of linear time-invariant descriptor systems. In the present paper, we present a case study wherein we apply data-driven predictive control to a discrete-time descriptor model obtained by discretization of the power-swing equations for a nine-bus system. Our results shows the efficacy of the proposed control scheme and they underpin the prospect of the data-driven framework for control of descriptor systems. ",
    "url": "https://arxiv.org/abs/2203.02271",
    "authors": [
      "Philipp Schmitz",
      "Alexander Engelmann",
      "Timm Faulwasser",
      "Karl Worthmann"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.02285",
    "title": "A photonic chip-based machine learning approach for the prediction of  molecular properties",
    "abstract": "Machine learning methods have revolutionized the discovery process of new molecules and materials. However, the intensive training process of neural networks for molecules with ever increasing complexity has resulted in exponential growth in computation cost, leading to long simulation time and high energy consumption. Photonic chip technology offers an alternative platform for implementing neural network with faster data processing and lower energy usage compared to digital computers. Here, we demonstrate the capability of photonic neural networks in predicting the quantum mechanical properties of molecules. Additionally, we show that multiple properties can be learned simultaneously in a photonic chip via a multi-task regression learning algorithm, which we believe is the first of its kind, as most previous works focus on implementing a network for the task of classification. Photonics technology are also naturally capable of implementing complex-valued neural networks at no additional hardware cost and we show that such neural networks outperform conventional real-valued networks for molecular property prediction. Our work opens the avenue for harnessing photonic technology for large-scale machine learning applications in molecular sciences such as drug discovery and materials design. ",
    "url": "https://arxiv.org/abs/2203.02285",
    "authors": [
      "Jonathan Wei Zhong Lau",
      "Hui Zhang",
      "Lingxiao Wan",
      "Liang Shi",
      "Hong Cai",
      "Xianshu Luo",
      "Patrick Lo",
      "Chee-Kong Lee",
      "Leong-Chuan Kwek",
      "Ai Qun Liu"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)",
      "Optics (physics.optics)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2203.02331",
    "title": "F2DNet: Fast Focal Detection Network for Pedestrian Detection",
    "abstract": "Two-stage detectors are state-of-the-art in object detection as well as pedestrian detection. However, the current two-stage detectors are inefficient as they do bounding box regression in multiple steps i.e. in region proposal networks and bounding box heads. Also, the anchor-based region proposal networks are computationally expensive to train. We propose F2DNet, a novel two-stage detection architecture which eliminates redundancy of current two-stage detectors by replacing the region proposal network with our focal detection network and bounding box head with our fast suppression head. We benchmark F2DNet on top pedestrian detection datasets, thoroughly compare it against the existing state-of-the-art detectors and conduct cross dataset evaluation to test the generalizability of our model to unseen data. Our F2DNet achieves 8.7%, 2.2%, and 6.1% MR-2 on City Persons, Caltech Pedestrian, and Euro City Person datasets respectively when trained on a single dataset and reaches 20.4% and 26.2% MR-2 in heavy occlusion setting of Caltech Pedestrian and City Persons datasets when using progressive fine-tunning. On top of that F2DNet have significantly lesser inference time compared to the current state-of-the-art. Code and trained models will be available at https://github.com/AbdulHannanKhan/F2DNet. ",
    "url": "https://arxiv.org/abs/2203.02331",
    "authors": [
      "Abdul Hannan Khan",
      "Mohsin Munir",
      "Ludger van Elst",
      "Andreas Dengel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02336",
    "title": "Differentiable Causal Discovery Under Latent Interventions",
    "abstract": "Recent work has shown promising results in causal discovery by leveraging interventional data with gradient-based methods, even when the intervened variables are unknown. However, previous work assumes that the correspondence between samples and interventions is known, which is often unrealistic. We envision a scenario with an extensive dataset sampled from multiple intervention distributions and one observation distribution, but where we do not know which distribution originated each sample and how the intervention affected the system, \\textit{i.e.}, interventions are entirely latent. We propose a method based on neural networks and variational inference that addresses this scenario by framing it as learning a shared causal graph among an infinite mixture (under a Dirichlet process prior) of intervention structural causal models. Experiments with synthetic and real data show that our approach and its semi-supervised variant are able to discover causal relations in this challenging scenario. ",
    "url": "https://arxiv.org/abs/2203.02336",
    "authors": [
      "Gonçalo R. A. Faria",
      "André F. T. Martins",
      "Mário A. T. Figueiredo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2203.02342",
    "title": "Robust Event-Based Control: Bridge Time-Domain Triggering and  Frequency-Domain Uncertainties",
    "abstract": "This paper considers the robustness of event-triggered control of general linear systems against additive or multiplicative frequency-domain uncertainties. It is revealed that in static or dynamic event triggering mechanisms, the sampling errors are images of affine operators acting on the sampled outputs. Though not belonging to $\\mathcal{RH}_\\infty$, these operators are finite-gain $\\mathcal{L}_2$ stable with operator-norm depending on the triggering conditions and the norm bound of the uncertainties. This characterization is further extended to the general integral quadratic constraint (IQC)-based triggering mechanism. As long as the triggering condition characterizes an $\\mathcal{L}_2$-to-$\\mathcal{L}_2$ mapping relationship (in other words, small-gain-type constraints) between the sampled outputs and the sampling errors, the robust event-triggered controller design problem can be transformed into the standard $H_\\infty$ synthesis problem of a linear system having the same order as the controlled plant. Algorithms are provided to construct the robust controllers for the static, dynamic and IQC-based event triggering cases. ",
    "url": "https://arxiv.org/abs/2203.02342",
    "authors": [
      "Shiqi Zhang",
      "Zhongkui Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.02363",
    "title": "An Operator-Theoretic Approach to Robust Event-Triggered Control of  Network Systems with Frequency-Domain Uncertainties",
    "abstract": "In this paper, we study the robustness of the event-triggered consensus algorithms against frequency-domain uncertainties. It is revealed that the sampling errors resulted by event triggering are essentially images of linear finite-gain $\\mathcal{L}_2$-stable operators acting on the consensus errors of the sampled states and the event-triggered mechanism is equivalent to a negative feedback loop introduced additionally to the feedback system. In virtue of this, the robust consensus problem of the event-triggered network systems subject to additive dynamic uncertainties and network multiplicative uncertainties are considered, respectively. In both cases, quantitative relationships among the parameters of the controllers, the Laplacian matrix of the network topology, and the robustness against aperiodic event triggering and frequency-domain uncertainties are unveiled. Furthermore, the event-triggered dynamic average consensus (DAC) problem is also investigated, wherein the sampling errors are shown to be images of nonlinear finite-gain operators. The robust performance of the proposed DAC algorithm is analyzed, which indicates that the robustness and the performance are negatively related to the eigenratio of the Laplacian matrix. Simulation examples are also provided to verify the obtained results. ",
    "url": "https://arxiv.org/abs/2203.02363",
    "authors": [
      "Shiqi Zhang",
      "Zhongkui Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.02378",
    "title": "DiT: Self-supervised Pre-training for Document Image Transformer",
    "abstract": "Image Transformer has recently achieved significant progress for natural image understanding, either using supervised (ViT, DeiT, etc.) or self-supervised (BEiT, MAE, etc.) pre-training techniques. In this paper, we propose DiT, a self-supervised pre-trained Document Image Transformer model using large-scale unlabeled text images for Document AI tasks, which is essential since no supervised counterparts ever exist due to the lack of human labeled document images. We leverage DiT as the backbone network in a variety of vision-based Document AI tasks, including document image classification, document layout analysis, as well as table detection. Experiment results have illustrated that the self-supervised pre-trained DiT model achieves new state-of-the-art results on these downstream tasks, e.g. document image classification (91.11 $\\rightarrow$ 92.69), document layout analysis (91.0 $\\rightarrow$ 94.9) and table detection (94.23 $\\rightarrow$ 96.55). The code and pre-trained models are publicly available at \\url{https://aka.ms/msdit}. ",
    "url": "https://arxiv.org/abs/2203.02378",
    "authors": [
      "Junlong Li",
      "Yiheng Xu",
      "Tengchao Lv",
      "Lei Cui",
      "Cha Zhang",
      "Furu Wei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02380",
    "title": "Exploring Scalable, Distributed Real-Time Anomaly Detection for Bridge  Health Monitoring",
    "abstract": "Modern real-time Structural Health Monitoring systems can generate a considerable amount of information that must be processed and evaluated for detecting early anomalies and generating prompt warnings and alarms about the civil infrastructure conditions. The current cloud-based solutions cannot scale if the raw data has to be collected from thousands of buildings. This paper presents a full-stack deployment of an efficient and scalable anomaly detection pipeline for SHM systems which does not require sending raw data to the cloud but relies on edge computation. First, we benchmark three algorithmic approaches of anomaly detection, i.e., Principal Component Analysis (PCA), Fully-Connected AutoEncoder (FC-AE), and Convolutional AutoEncoder (C-AE). Then, we deploy them on an edge-sensor, the STM32L4, with limited computing capabilities. Our approach decreases network traffic by $\\approx8\\cdot10^5\\times$ , from 780KB/hour to less than 10 Bytes/hour for a single installation and minimize network and cloud resource utilization, enabling the scaling of the monitoring infrastructure. A real-life case study, a highway bridge in Italy, demonstrates that combining near-sensor computation of anomaly detection algorithms, smart pre-processing, and low-power wide-area network protocols (LPWAN) we can greatly reduce data communication and cloud computing costs, while anomaly detection accuracy is not adversely affected. ",
    "url": "https://arxiv.org/abs/2203.02380",
    "authors": [
      "Amirhossein Moallemi",
      "Alessio Burrello",
      "Davide Brunelli",
      "Luca Benini"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.02385",
    "title": "MM-DFN: Multimodal Dynamic Fusion Network for Emotion Recognition in  Conversations",
    "abstract": "Emotion Recognition in Conversations (ERC) has considerable prospects for developing empathetic machines. For multimodal ERC, it is vital to understand context and fuse modality information in conversations. Recent graph-based fusion methods generally aggregate multimodal information by exploring unimodal and cross-modal interactions in a graph. However, they accumulate redundant information at each layer, limiting the context understanding between modalities. In this paper, we propose a novel Multimodal Dynamic Fusion Network (MM-DFN) to recognize emotions by fully understanding multimodal conversational context. Specifically, we design a new graph-based dynamic fusion module to fuse multimodal contextual features in a conversation. The module reduces redundancy and enhances complementarity between modalities by capturing the dynamics of contextual information in different semantic spaces. Extensive experiments on two public benchmark datasets demonstrate the effectiveness and superiority of MM-DFN. ",
    "url": "https://arxiv.org/abs/2203.02385",
    "authors": [
      "Dou Hu",
      "Xiaolong Hou",
      "Lingwei Wei",
      "Lianxin Jiang",
      "Yang Mo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2203.02392",
    "title": "Beyond Plain Toxic: Detection of Inappropriate Statements on Flammable  Topics for the Russian Language",
    "abstract": "Toxicity on the Internet, such as hate speech, offenses towards particular users or groups of people, or the use of obscene words, is an acknowledged problem. However, there also exist other types of inappropriate messages which are usually not viewed as toxic, e.g. as they do not contain explicit offences. Such messages can contain covered toxicity or generalizations, incite harmful actions (crime, suicide, drug use), provoke \"heated\" discussions. Such messages are often related to particular sensitive topics, e.g. on politics, sexual minorities, social injustice which more often than other topics, e.g. cars or computing, yield toxic emotional reactions. At the same time, clearly not all messages within such flammable topics are inappropriate. Towards this end, in this work, we present two text collections labelled according to binary notion of inapropriateness and a multinomial notion of sensitive topic. Assuming that the notion of inappropriateness is common among people of the same culture, we base our approach on human intuitive understanding of what is not acceptable and harmful. To objectivise the notion of inappropriateness, we define it in a data-driven way though crowdsourcing. Namely we run a large-scale annotation study asking workers if a given chatbot textual statement could harm reputation of a company created it. Acceptably high values of inter-annotator agreement suggest that the notion of inappropriateness exists and can be uniformly understood by different people. To define the notion of sensitive topics in an objective way we use on guidelines suggested commonly by specialists of legal and PR department of a large public company as potentially harmful. ",
    "url": "https://arxiv.org/abs/2203.02392",
    "authors": [
      "Nikolay Babakov",
      "Varvara Logacheva",
      "Alexander Panchenko"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.02397",
    "title": "Mobile authentication of copy detection patterns",
    "abstract": "In the recent years, the copy detection patterns (CDP) attracted a lot of attention as a link between the physical and digital worlds, which is of great interest for the internet of things and brand protection applications. However, the security of CDP in terms of their reproducibility by unauthorized parties or clonability remains largely unexplored. In this respect this paper addresses a problem of anti-counterfeiting of physical objects and aims at investigating the authentication aspects and the resistances to illegal copying of the modern CDP from machine learning perspectives. A special attention is paid to a reliable authentication under the real life verification conditions when the codes are printed on an industrial printer and enrolled via modern mobile phones under regular light conditions. The theoretical and empirical investigation of authentication aspects of CDP is performed with respect to four types of copy fakes from the point of view of (i) multi-class supervised classification as a baseline approach and (ii) one-class classification as a real-life application case. The obtained results show that the modern machine-learning approaches and the technical capacities of modern mobile phones allow to reliably authenticate CDP on end-user mobile phones under the considered classes of fakes. ",
    "url": "https://arxiv.org/abs/2203.02397",
    "authors": [
      "Olga Taran",
      "Joakim Tutt",
      "Taras Holotyak",
      "Roman Chaban",
      "Slavi Bonev",
      "Slava Voloshynovskiy"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02431",
    "title": "Rethinking Efficient Lane Detection via Curve Modeling",
    "abstract": "This paper presents a novel parametric curve-based method for lane detection in RGB images. Unlike state-of-the-art segmentation-based and point detection-based methods that typically require heuristics to either decode predictions or formulate a large sum of anchors, the curve-based methods can learn holistic lane representations naturally. To handle the optimization difficulties of existing polynomial curve methods, we propose to exploit the parametric B\\'ezier curve due to its ease of computation, stability, and high freedom degrees of transformations. In addition, we propose the deformable convolution-based feature flip fusion, for exploiting the symmetry properties of lanes in driving scenes. The proposed method achieves a new state-of-the-art performance on the popular LLAMAS benchmark. It also achieves favorable accuracy on the TuSimple and CULane datasets, while retaining both low latency (> 150 FPS) and small model size (< 10M). Our method can serve as a new baseline, to shed the light on the parametric curves modeling for lane detection. Codes of our model and PytorchAutoDrive: a unified framework for self-driving perception, are available at: https://github.com/voldemortX/pytorch-auto-drive . ",
    "url": "https://arxiv.org/abs/2203.02431",
    "authors": [
      "Zhengyang Feng",
      "Shaohua Guo",
      "Xin Tan",
      "Ke Xu",
      "Min Wang",
      "Lizhuang Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02445",
    "title": "SFPN: Synthetic FPN for Object Detection",
    "abstract": "FPN (Feature Pyramid Network) has become a basic component of most SoTA one stage object detectors. Many previous studies have repeatedly proved that FPN can caputre better multi-scale feature maps to more precisely describe objects if they are with different sizes. However, for most backbones such VGG, ResNet, or DenseNet, the feature maps at each layer are downsized to their quarters due to the pooling operation or convolutions with stride 2. The gap of down-scaling-by-2 is large and makes its FPN not fuse the features smoothly. This paper proposes a new SFPN (Synthetic Fusion Pyramid Network) arichtecture which creates various synthetic layers between layers of the original FPN to enhance the accuracy of light-weight CNN backones to extract objects' visual features more accurately. Finally, experiments prove the SFPN architecture outperforms either the large backbone VGG16, ResNet50 or light-weight backbones such as MobilenetV2 based on AP score. ",
    "url": "https://arxiv.org/abs/2203.02445",
    "authors": [
      "Yu-Ming Zhang",
      "Jun-Wei Hsieh",
      "Chun-Chieh Lee",
      "Kuo-Chin Fan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02446",
    "title": "AutoMap: Automatic Medical Code Mapping for Clinical Prediction Model  Deployment",
    "abstract": "Given a deep learning model trained on data from a source site, how to deploy the model to a target hospital automatically? How to accommodate heterogeneous medical coding systems across different hospitals? Standard approaches rely on existing medical code mapping tools, which have significant practical limitations. To tackle this problem, we propose AutoMap to automatically map the medical codes across different EHR systems in a coarse-to-fine manner: (1) Ontology-level Alignment: We leverage the ontology structure to learn a coarse alignment between the source and target medical coding systems; (2) Code-level Refinement: We refine the alignment at a fine-grained code level for the downstream tasks using a teacher-student framework. We evaluate AutoMap using several deep learning models with two real-world EHR datasets: eICU and MIMIC-III. Results show that AutoMap achieves relative improvements up to 3.9% (AUC-ROC) and 8.7% (AUC-PR) for mortality prediction, and up to 4.7% (AUC-ROC) and 3.7% (F1) for length-of-stay estimation. Further, we show that AutoMap can provide accurate mapping across coding systems. Lastly, we demonstrate that AutoMap can adapt to the two challenging scenarios: (1) mapping between completely different coding systems and (2) between completely different hospitals. ",
    "url": "https://arxiv.org/abs/2203.02446",
    "authors": [
      "Zhenbang Wu",
      "Cao Xiao",
      "Lucas M Glass",
      "David M Liebovitz",
      "Jimeng Sun"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.02465",
    "title": "Low-order preconditioning for the high-order finite element de Rham  complex",
    "abstract": "In this paper we present a unified framework for constructing spectrally equivalent low-order-refined discretizations for the high-order finite element de Rham complex. This theory covers diffusion problems in $H^1$, $H({\\rm curl})$, and $H({\\rm div})$, and is based on combining a low-order discretization posed on a refined mesh with a high-order basis for N\\'ed\\'elec and Raviart-Thomas elements that makes use of the concept of polynomial histopolation (polynomial fitting using prescribed mean values over certain regions). This spectral equivalence, coupled with algebraic multigrid methods constructed using the low-order discretization, results in highly scalable matrix-free preconditioners for high-order finite element problems in the full de Rham complex. Additionally, a new lowest-order (piecewise constant) preconditioner is developed for high-order interior penalty discontinuous Galerkin (DG) discretizations, for which spectral equivalence results and convergence proofs for algebraic multigrid methods are provided. In all cases, the spectral equivalence results are independent of polynomial degree and mesh size; for DG methods, they are also independent of the penalty parameter. These new solvers are flexible and easy to use; any \"black-box\" preconditioner for low-order problems can be used to create an effective and efficient preconditioner for the corresponding high-order problem. A number of numerical experiments are presented, based on an implmentation in the finite element library MFEM. The theoretical properties of these preconditioners are corroborated, and the flexibility and scalability of the method are demonstrated on a range of challenging three-dimensional problems. ",
    "url": "https://arxiv.org/abs/2203.02465",
    "authors": [
      "Will Pazner",
      "Tzanio Kolev",
      "Clark Dohrmann"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2203.02471",
    "title": "Graph clustering with Boltzmann machines",
    "abstract": "Graph clustering is the process of grouping vertices into densely connected sets called clusters. We tailor two mathematical programming formulations from the literature, to this problem. In doing so, we obtain a heuristic approximation to the intra-cluster density maximization problem. We use two variations of a Boltzmann machine heuristic to obtain numerical solutions. For benchmarking purposes, we compare solution quality and computational performances to those obtained using a commercial solver, Gurobi. We also compare clustering quality to the clusters obtained using the popular Louvain modularity maximization method. Our initial results clearly demonstrate the superiority of our problem formulations. They also establish the superiority of the Boltzmann machine over the traditional exact solver. In the case of smaller less complex graphs, Boltzmann machines provide the same solutions as Gurobi, but with solution times that are orders of magnitude lower. In the case of larger and more complex graphs, Gurobi fails to return meaningful results within a reasonable time frame. Finally, we also note that both our clustering formulations, the distance minimization and $K$-medoids, yield clusters of superior quality to those obtained with the Louvain algorithm. ",
    "url": "https://arxiv.org/abs/2203.02471",
    "authors": [
      "Pierre Miasnikof",
      "Mohammad Bagherbeik",
      "Ali Sheikholeslami"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Discrete Mathematics (cs.DM)",
      "Optimization and Control (math.OC)",
      "Computation (stat.CO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.02480",
    "title": "Didn't see that coming: a survey on non-verbal social human behavior  forecasting",
    "abstract": "Non-verbal social human behavior forecasting has increasingly attracted the interest of the research community in recent years. Its direct applications to human-robot interaction and socially-aware human motion generation make it a very attractive field. In this survey, we define the behavior forecasting problem for multiple interactive agents in a generic way that aims at unifying the fields of social signals prediction and human motion forecasting, traditionally separated. We hold that both problem formulations refer to the same conceptual problem, and identify many shared fundamental challenges: future stochasticity, context awareness, history exploitation, etc. We also propose a taxonomy that comprises methods published in the last 5 years in a very informative way and describes the current main concerns of the community with regard to this problem. In order to promote further research on this field, we also provide a summarised and friendly overview of audiovisual datasets featuring non-acted social interactions. Finally, we describe the most common metrics used in this task and their particular issues. ",
    "url": "https://arxiv.org/abs/2203.02480",
    "authors": [
      "German Barquero",
      "Johnny Núñez",
      "Sergio Escalera",
      "Zhen Xu",
      "Wei-Wei Tu",
      "Isabelle Guyon",
      "Cristina Palmero"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.02491",
    "title": "Performance of Large Aperture UCCA Arrays in a 5G User Dense Network",
    "abstract": "The transmitted signals in the fifth generation (5G) wireless networks suffer from significant path loss due to the use of higher frequencies in Sub-6 GHz and millimeter-wave (mmWave) bands. Inter-user interference in an ultra-dense network offers additional challenges to provide a high data rate. Therefore, it is desirable to generate narrow beams to extend the coverage of a 5G network by increasing antenna gain and improve its capacity by reducing the inter-user interference. This fact leads us to address the use of large aperture uniform concentric circular antenna (UCCA) arrays for 5G beamforming in massive multiple-input-multiple-output (MIMO) technology. Our analysis demonstrates that a UCCA with a larger antenna element spacing is capable of generating a significantly narrower beam with a moderate side-lobe level than a rectangular planar antenna (RPA) array while operating with the same number of antenna elements. This capability of the UCCA is analyzed to discover the performance gain of a 5G network. ",
    "url": "https://arxiv.org/abs/2203.02491",
    "authors": [
      "Md Imrul Hasan",
      "Mohammad Saquib"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.02497",
    "title": "Computationally efficient worst-case analysis of flow-controlled  networks with Network Calculus",
    "abstract": "Networks with hop-by-hop flow control occur in several contexts, from data centers to systems architectures (e.g., wormhole-routing networks on chip). A worst-case end-to-end delay in such networks can be computed using Network Calculus (NC), an algebraic theory where traffic and service guarantees are represented as curves in a Cartesian plane. NC uses transformation operations, e.g., the min-plus convolution, to model how the traffic profile changes with the traversal of network nodes. NC allows one to model flow-controlled systems, hence one can compute the end-to-end service curve describing the minimum service guaranteed to a flow traversing a tandem of flow-controlled nodes. However, while the algebraic expression of such an end-to-end service curve is quite compact, its computation is often untractable from an algorithmic standpoint: data structures tend to explode, making operations unfeasibly complex, even with as few as three hops. In this paper, we propose computational and algebraic techniques to mitigate the above problem. We show that existing techniques (such as reduction to compact domains) cannot be used in this case, and propose an arsenal of solutions, which include methods to mitigate the data representation space explosion as well as computationally efficient algorithms for the min-plus convolution operation. We show that our solutions allow a significant speedup, enable analysis of previously unfeasible case studies, and - since they do not rely on any approximation - still provide exact results. ",
    "url": "https://arxiv.org/abs/2203.02497",
    "authors": [
      "Raffaele Zippo",
      "Giovanni Stea"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2203.02502",
    "title": "No More Than 6ft Apart: Robust K-Means via Radius Upper Bounds",
    "abstract": "Centroid based clustering methods such as k-means, k-medoids and k-centers are heavily applied as a go-to tool in exploratory data analysis. In many cases, those methods are used to obtain representative centroids of the data manifold for visualization or summarization of a dataset. Real world datasets often contain inherent abnormalities, e.g., repeated samples and sampling bias, that manifest imbalanced clustering. We propose to remedy such a scenario by introducing a maximal radius constraint $r$ on the clusters formed by the centroids, i.e., samples from the same cluster should not be more than $2r$ apart in terms of $\\ell_2$ distance. We achieve this constraint by solving a semi-definite program, followed by a linear assignment problem with quadratic constraints. Through qualitative results, we show that our proposed method is robust towards dataset imbalances and sampling artifacts. To the best of our knowledge, ours is the first constrained k-means clustering method with hard radius constraints. Codes at https://bit.ly/kmeans-constrained ",
    "url": "https://arxiv.org/abs/2203.02502",
    "authors": [
      "Ahmed Imtiaz Humayun",
      "Randall Balestriero",
      "Anastasios Kyrillidis",
      "Richard Baraniuk"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.01933",
    "title": "Temporal Context Matters: Enhancing Single Image Prediction with Disease  Progression Representations",
    "abstract": "Clinical outcome or severity prediction from medical images has largely focused on learning representations from single-timepoint or snapshot scans. It has been shown that disease progression can be better characterized by temporal imaging. We therefore hypothesized that outcome predictions can be improved by utilizing the disease progression information from sequential images. We present a deep learning approach that leverages temporal progression information to improve clinical outcome predictions from single-timepoint images. In our method, a self-attention based Temporal Convolutional Network (TCN) is used to learn a representation that is most reflective of the disease trajectory. Meanwhile, a Vision Transformer is pretrained in a self-supervised fashion to extract features from single-timepoint images. The key contribution is to design a recalibration module that employs maximum mean discrepancy loss (MMD) to align distributions of the above two contextual representations. We train our system to predict clinical outcomes and severity grades from single-timepoint images. Experiments on chest and osteoarthritis radiography datasets demonstrate that our approach outperforms other state-of-the-art techniques. ",
    "url": "https://arxiv.org/abs/2203.01933",
    "authors": [
      "Aishik Konwer",
      "Xuan Xu",
      "Joseph Bae",
      "Chao Chen",
      "Prateek Prasanna"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.01944",
    "title": "A multi-stream convolutional neural network for classification of  progressive MCI in Alzheimer's disease using structural MRI images",
    "abstract": "Early diagnosis of Alzheimer's disease and its prodromal stage, also known as mild cognitive impairment (MCI), is critical since some patients with progressive MCI will develop the disease. We propose a multi-stream deep convolutional neural network fed with patch-based imaging data to classify stable MCI and progressive MCI. First, we compare MRI images of Alzheimer's disease with cognitively normal subjects to identify distinct anatomical landmarks using a multivariate statistical test. These landmarks are then used to extract patches that are fed into the proposed multi-stream convolutional neural network to classify MRI images. Next, we train the architecture in a separate scenario using samples from Alzheimer's disease images, which are anatomically similar to the progressive MCI ones and cognitively normal images to compensate for the lack of progressive MCI training data. Finally, we transfer the trained model weights to the proposed architecture in order to fine-tune the model using progressive MCI and stable MCI data. Experimental results on the ADNI-1 dataset indicate that our method outperforms existing methods for MCI classification, with an F1-score of 85.96%. ",
    "url": "https://arxiv.org/abs/2203.01944",
    "authors": [
      "Mona Ashtari-Majlan",
      "Abbas Seifi",
      "Mohammad Mahdi Dehshibi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.01969",
    "title": "Robust Segmentation of Brain MRI in the Wild with Hierarchical CNNs and  no Retraining",
    "abstract": "Retrospective analysis of brain MRI scans acquired in the clinic has the potential to enable neuroimaging studies with sample sizes much larger than those found in research datasets. However, analysing such clinical images \"in the wild\" is challenging, since subjects are scanned with highly variable protocols (MR contrast, resolution, orientation, etc.). Nevertheless, recent advances in convolutional neural networks (CNNs) and domain randomisation for image segmentation, best represented by the publicly available method SynthSeg, may enable morphometry of clinical MRI at scale. In this work, we first evaluate SynthSeg on an uncurated, heterogeneous dataset of more than 10,000 scans acquired at Massachusetts General Hospital. We show that SynthSeg is generally robust, but frequently falters on scans with low signal-to-noise ratio or poor tissue contrast. Next, we propose SynthSeg+, a novel method that greatly mitigates these problems using a hierarchy of conditional segmentation and denoising CNNs. We show that this method is considerably more robust than SynthSeg, while also outperforming cascaded networks and state-of-the-art segmentation denoising methods. Finally, we apply our approach to a proof-of-concept volumetric study of ageing, where it closely replicates atrophy patterns observed in research studies conducted on high-quality, 1mm, T1-weighted scans. The code and trained model are publicly available at https://github.com/BBillot/SynthSeg. ",
    "url": "https://arxiv.org/abs/2203.01969",
    "authors": [
      "Benjamin Billot",
      "Magdamo Colin",
      "Sean E. Arnold",
      "Sudeshna Das",
      "Juan. E. Iglesias"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.01978",
    "title": "Region-of-Interest Based Neural Video Compression",
    "abstract": "Humans do not perceive all parts of a scene with the same resolution, but rather focus on few regions of interest (ROIs). Traditional Object-Based codecs take advantage of this biological intuition, and are capable of non-uniform allocation of bits in favor of salient regions, at the expense of increased distortion the remaining areas: such a strategy allows a boost in perceptual quality under low rate constraints. Recently, several neural codecs have been introduced for video compression, yet they operate uniformly over all spatial locations, lacking the capability of ROI-based processing. In this paper, we introduce two models for ROI-based neural video coding. First, we propose an implicit model that is fed with a binary ROI mask and it is trained by de-emphasizing the distortion of the background. Secondly, we design an explicit latent scaling method, that allows control over the quantization binwidth for different spatial regions of latent variables, conditioned on the ROI mask. By extensive experiments, we show that our methods outperform all our baselines in terms of Rate-Distortion (R-D) performance in the ROI. Moreover, they can generalize to different datasets and to any arbitrary ROI at inference time. Finally, they do not require expensive pixel-level annotations during training, as synthetic ROI masks can be used with little to no degradation in performance. To the best of our knowledge, our proposals are the first solutions that integrate ROI-based capabilities into neural video compression models. ",
    "url": "https://arxiv.org/abs/2203.01978",
    "authors": [
      "Yura Perugachi-Diaz",
      "Guillaume Sautière",
      "Davide Abati",
      "Yang Yang",
      "Amirhossein Habibian",
      "Taco S Cohen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.01985",
    "title": "Enhanced physics-constrained deep neural networks for modeling vanadium  redox flow battery",
    "abstract": "Numerical modeling and simulation have become indispensable tools for advancing a comprehensive understanding of the underlying mechanisms and cost-effective process optimization and control of flow batteries. In this study, we propose an enhanced version of the physics-constrained deep neural network (PCDNN) approach [1] to provide high-accuracy voltage predictions in the vanadium redox flow batteries (VRFBs). The purpose of the PCDNN approach is to enforce the physics-based zero-dimensional (0D) VRFB model in a neural network to assure model generalization for various battery operation conditions. Limited by the simplifications of the 0D model, the PCDNN cannot capture sharp voltage changes in the extreme SOC regions. To improve the accuracy of voltage prediction at extreme ranges, we introduce a second (enhanced) DNN to mitigate the prediction errors carried from the 0D model itself and call the resulting approach enhanced PCDNN (ePCDNN). By comparing the model prediction with experimental data, we demonstrate that the ePCDNN approach can accurately capture the voltage response throughout the charge--discharge cycle, including the tail region of the voltage discharge curve. Compared to the standard PCDNN, the prediction accuracy of the ePCDNN is significantly improved. The loss function for training the ePCDNN is designed to be flexible by adjusting the weights of the physics-constrained DNN and the enhanced DNN. This allows the ePCDNN framework to be transferable to battery systems with variable physical model fidelity. ",
    "url": "https://arxiv.org/abs/2203.01985",
    "authors": [
      "QiZhi He",
      "Yucheng Fu",
      "Panos Stinis",
      "Alexandre Tartakovsky"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02042",
    "title": "Automatic Detection and Segmentation of Postoperative Cerebellar Damage  Based on Normalization",
    "abstract": "Surgical resection is a common procedure in the treatment of pediatric posterior fossa tumors. However, surgical damage is often unavoidable and its association with postoperative complications is not well understood. A reliable localization and measure of cerebellar damage is fundamental to study the relationship between the damaged cerebellar regions and postoperative neurological outcomes. Existing cerebellum normalization methods are not reliable on postoperative scans, therefore current approaches to measure surgical damage rely on manual labelling. In this work, we develop a robust algorithm to automatically detect and measure cerebellum damage due to surgery using postoperative 3D T1 magnetic resonance imaging. In our proposed approach, normal brain tissues are first segmented using a Bayesian algorithm customized for postoperative scans. Next, the cerebellum is isolated by nonlinear registration of a whole brain template to the native space. The isolated cerebellum is then normalized into the spatially unbiased atlas (SUIT) space using anatomical information derived from the previous step. Finally, the damage is detected in the atlas space by comparing the normalized cerebellum and the SUIT template. We evaluated our damage detection tool on postoperative scans of 153 patients diagnosed with medulloblastoma based on inspection by human expects. We also designed a simulation to test the proposed approach without human intervention. Our results show that the proposed approach has superior performance on various scenarios. ",
    "url": "https://arxiv.org/abs/2203.02042",
    "authors": [
      "Silu Zhang",
      "Stuart McAfee",
      "Zoltan Patay",
      "Matthew Scoggins"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02056",
    "title": "Symmetry Structured Convolutional Neural Networks",
    "abstract": "We consider Convolutional Neural Networks (CNNs) with 2D structured features that are symmetric in the spatial dimensions. Such networks arise in modeling pairwise relationships for a sequential recommendation problem, as well as secondary structure inference problems of RNA and protein sequences. We develop a CNN architecture that generates and preserves the symmetry structure in the network's convolutional layers. We present parameterizations for the convolutional kernels that produce update rules to maintain symmetry throughout the training. We apply this architecture to the sequential recommendation problem, the RNA secondary structure inference problem, and the protein contact map prediction problem, showing that the symmetric structured networks produce improved results using fewer numbers of machine parameters. ",
    "url": "https://arxiv.org/abs/2203.02056",
    "authors": [
      "Kehelwala Dewage Gayan Maduranga",
      "Vasily Zadorozhnyy",
      "Qiang Ye"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02106",
    "title": "Scribble-Supervised Medical Image Segmentation via Dual-Branch Network  and Dynamically Mixed Pseudo Labels Supervision",
    "abstract": "Medical image segmentation plays an irreplaceable role in computer-assisted diagnosis, treatment planning, and following-up. Collecting and annotating a large-scale dataset is crucial to training a powerful segmentation model, but producing high-quality segmentation masks is an expensive and time-consuming procedure. Recently, weakly-supervised learning that uses sparse annotations (points, scribbles, bounding boxes) for network training has achieved encouraging performance and shown the potential for annotation cost reduction. However, due to the limited supervision signal of sparse annotations, it is still challenging to employ them for networks training directly. In this work, we propose a simple yet efficient scribble-supervised image segmentation method and apply it to cardiac MRI segmentation. Specifically, we employ a dual-branch network with one encoder and two slightly different decoders for image segmentation and dynamically mix the two decoders' predictions to generate pseudo labels for auxiliary supervision. By combining the scribble supervision and auxiliary pseudo labels supervision, the dual-branch network can efficiently learn from scribble annotations end-to-end. Experiments on the public ACDC dataset show that our method performs better than current scribble-supervised segmentation methods and also outperforms several semi-supervised segmentation methods. ",
    "url": "https://arxiv.org/abs/2203.02106",
    "authors": [
      "Xiangde Luo",
      "Minhao Hu",
      "Wenjun Liao",
      "Shuwei Zhai",
      "Tao Song",
      "Guotai Wang",
      "Shaoting Zhang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02166",
    "title": "Convolutional Analysis Operator Learning by End-To-End Training of  Iterative Neural Networks",
    "abstract": "The concept of sparsity has been extensively applied for regularization in image reconstruction. Typically, sparsifying transforms are either pre-trained on ground-truth images or adaptively trained during the reconstruction. Thereby, learning algorithms are designed to minimize some target function which encodes the desired properties of the transform. However, this procedure ignores the subsequently employed reconstruction algorithm as well as the physical model which is responsible for the image formation process. Iterative neural networks - which contain the physical model - can overcome these issues. In this work, we demonstrate how convolutional sparsifying filters can be efficiently learned by end-to-end training of iterative neural networks. We evaluated our approach on a non-Cartesian 2D cardiac cine MRI example and show that the obtained filters are better suitable for the corresponding reconstruction algorithm than the ones obtained by decoupled pre-training. ",
    "url": "https://arxiv.org/abs/2203.02166",
    "authors": [
      "Andreas Kofler",
      "Christian Wald",
      "Tobias Schaeffter",
      "Markus Haltmeier",
      "Christoph Kolbitsch"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.02181",
    "title": "MANNER: Multi-view Attention Network for Noise Erasure",
    "abstract": "In the field of speech enhancement, time domain methods have difficulties in achieving both high performance and efficiency. Recently, dual-path models have been adopted to represent long sequential features, but they still have limited representations and poor memory efficiency. In this study, we propose Multi-view Attention Network for Noise ERasure (MANNER) consisting of a convolutional encoder-decoder with a multi-view attention block, applied to the time-domain signals. MANNER efficiently extracts three different representations from noisy speech and estimates high-quality clean speech. We evaluated MANNER on the VoiceBank-DEMAND dataset in terms of five objective speech quality metrics. Experimental results show that MANNER achieves state-of-the-art performance while efficiently processing noisy speech. ",
    "url": "https://arxiv.org/abs/2203.02181",
    "authors": [
      "Hyun Joon Park",
      "Byung Ha Kang",
      "Wooseok Shin",
      "Jin Sob Kim",
      "Sung Won Han"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.02191",
    "title": "Selective Pseudo-labeling and Class-wise Discriminative Fusion for Sound  Event Detection",
    "abstract": "In recent years, exploring effective sound separation (SSep) techniques to improve overlapping sound event detection (SED) attracts more and more attention. Creating accurate separation signals to avoid the catastrophic error accumulation during SED model training is very important and challenging. In this study, we first propose a novel selective pseudo-labeling approach, termed SPL, to produce high confidence separated target events from blind sound separation outputs. These target events are then used to fine-tune the original SED model that pre-trained on the sound mixtures in a multi-objective learning style. Then, to further leverage the SSep outputs, a class-wise discriminative fusion is proposed to improve the final SED performances, by combining multiple frame-level event predictions of both sound mixtures and their separated signals. All experiments are performed on the public DCASE 2021 Task 4 dataset, and results show that our approaches significantly outperforms the official baseline, the collar-based F 1, PSDS1 and PSDS2 performances are improved from 44.3%, 37.3% and 54.9% to 46.5%, 44.5% and 75.4%, respectively. ",
    "url": "https://arxiv.org/abs/2203.02191",
    "authors": [
      "Yunhao Liang",
      "Yanhua Long",
      "Yijie Li",
      "Jiaen Liang"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2203.02283",
    "title": "An attack on Zarankiewicz's problem through SAT solving",
    "abstract": "The Zarankiewicz function gives, for a chosen matrix and minor size, the maximum number of ones in a binary matrix not containing an all-one minor. Tables of this function for small arguments have been compiled, but errors are known in them. We both correct the errors and extend these tables in the case of square minors by expressing the problem of finding the value at a specific point as a series of Boolean satisfiability problems, exploiting permutation symmetries for a significant reduction in the work needed. When the ambient matrix is also square we also give all non-isomorphic examples of matrices attaining the maximum, up to the aforementioned symmetries; it is found that most maximal matrices have some form of symmetry. ",
    "url": "https://arxiv.org/abs/2203.02283",
    "authors": [
      "Jeremy Jierui Tan"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2203.02288",
    "title": "Integrating Statistical Uncertainty into Neural Network-Based Speech  Enhancement",
    "abstract": "Speech enhancement in the time-frequency domain is often performed by estimating a multiplicative mask to extract clean speech. However, most neural network-based methods perform point estimation, i.e., their output consists of a single mask. In this paper, we study the benefits of modeling uncertainty in neural network-based speech enhancement. For this, our neural network is trained to map a noisy spectrogram to the Wiener filter and its associated variance, which quantifies uncertainty, based on the maximum a posteriori (MAP) inference of spectral coefficients. By estimating the distribution instead of the point estimate, one can model the uncertainty associated with each estimate. We further propose to use the estimated Wiener filter and its uncertainty to build an approximate MAP (A-MAP) estimator of spectral magnitudes, which in turn is combined with the MAP inference of spectral coefficients to form a hybrid loss function to jointly reinforce the estimation. Experimental results on different datasets show that the proposed method can not only capture the uncertainty associated with the estimated filters, but also yield a higher enhancement performance over comparable models that do not take uncertainty into account. ",
    "url": "https://arxiv.org/abs/2203.02288",
    "authors": [
      "Huajian Fang",
      "Tal Peer",
      "Stefan Wermter",
      "Timo Gerkmann"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2203.02384",
    "title": "AutoMO-Mixer: An automated multi-objective Mixer model for balanced,  safe and robust prediction in medicine",
    "abstract": "Accurately identifying patient's status through medical images plays an important role in diagnosis and treatment. Artificial intelligence (AI), especially the deep learning, has achieved great success in many fields. However, more reliable AI model is needed in image guided diagnosis and therapy. To achieve this goal, developing a balanced, safe and robust model with a unified framework is desirable. In this study, a new unified model termed as automated multi-objective Mixer (AutoMO-Mixer) model was developed, which utilized a recent developed multiple layer perceptron Mixer (MLP-Mixer) as base. To build a balanced model, sensitivity and specificity were considered as the objective functions simultaneously in training stage. Meanwhile, a new evidential reasoning based on entropy was developed to achieve a safe and robust model in testing stage. The experiment on an optical coherence tomography dataset demonstrated that AutoMO-Mixer can obtain safer, more balanced, and robust results compared with MLP-Mixer and other available models. ",
    "url": "https://arxiv.org/abs/2203.02384",
    "authors": [
      "Xi Chen",
      "Jiahuan Lv",
      "Dehua Feng",
      "Xuanqin Mou",
      "Ling Bai",
      "Shu Zhang",
      "Zhiguo Zhou"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02390",
    "title": "Simultaneous Alignment and Surface Regression Using Hybrid 2D-3D  Networks for 3D Coherent Layer Segmentation of Retina OCT Images",
    "abstract": "Automated surface segmentation of retinal layer is important and challenging in analyzing optical coherence tomography (OCT). Recently, many deep learning based methods have been developed for this task and yield remarkable performance. However, due to large spatial gap and potential mismatch between the B-scans of OCT data, all of them are based on 2D segmentation of individual B-scans, which may loss the continuity information across the B-scans. In addition, 3D surface of the retina layers can provide more diagnostic information, which is crucial in quantitative image analysis. In this study, a novel framework based on hybrid 2D-3D convolutional neural networks (CNNs) is proposed to obtain continuous 3D retinal layer surfaces from OCT. The 2D features of individual B-scans are extracted by an encoder consisting of 2D convolutions. These 2D features are then used to produce the alignment displacement field and layer segmentation by two 3D decoders, which are coupled via a spatial transformer module. The entire framework is trained end-to-end. To the best of our knowledge, this is the first study that attempts 3D retinal layer segmentation in volumetric OCT images based on CNNs. Experiments on a publicly available dataset show that our framework achieves superior results to state-of-the-art 2D methods in terms of both layer segmentation accuracy and cross-B-scan 3D continuity, thus offering more clinical values than previous works. ",
    "url": "https://arxiv.org/abs/2203.02390",
    "authors": [
      "Hong Liu",
      "Dong Wei",
      "Donghuan Lu",
      "Yuexiang Li",
      "Kai Ma",
      "Liansheng Wang",
      "Yefeng Zheng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02400",
    "title": "Quantum Approximate Optimization Algorithm for Bayesian network  structure learning",
    "abstract": "Bayesian network structure learning is an NP-hard problem that has been faced by a number of traditional approaches in recent decades. Currently, quantum technologies offer a wide range of advantages that can be exploited to solve optimization tasks that cannot be addressed in an efficient way when utilizing classic computing approaches. In this work, a specific type of variational quantum algorithm, the quantum approximate optimization algorithm, was used to solve the Bayesian network structure learning problem, by employing $3n(n-1)/2$ qubits, where $n$ is the number of nodes in the Bayesian network to be learned. Our results showed that the quantum approximate optimization algorithm approach offers competitive results with state-of-the-art methods and quantitative resilience to quantum noise. The approach was applied to a cancer benchmark problem, and the results justified the use of variational quantum algorithms for solving the Bayesian network structure learning problem. ",
    "url": "https://arxiv.org/abs/2203.02400",
    "authors": [
      "Vicente P. Soloviev",
      "Concha Bielza",
      "Pedro Larrañaga"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.02466",
    "title": "Random Information Sharing over Social Networks",
    "abstract": "This work studies the learning process over social networks under partial and random information sharing. In traditional social learning, agents exchange full information with each other while trying to infer the true state of nature. We study the case where agents share information about only one hypothesis, i.e., the trending topic, which can be randomly changing at every iteration. We show that agents can learn the true hypothesis even if they do not discuss it, at rates comparable to traditional social learning. We also show that using one's own belief as a prior for estimating the neighbors' non-transmitted components might create opinion clusters that prevent learning with full confidence. This practice however avoids the complete rejection of the truth. ",
    "url": "https://arxiv.org/abs/2203.02466",
    "authors": [
      "Mert Kayaalp",
      "Virginia Bordignon",
      "Ali H. Sayed"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Multiagent Systems (cs.MA)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:1912.04853",
    "title": "Embedding Comparator: Visualizing Differences in Global Structure and  Local Neighborhoods via Small Multiples",
    "abstract": " Comments: Published in IUI 2022; Equal contribution by first two authors ",
    "url": "https://arxiv.org/abs/1912.04853",
    "authors": [
      "Angie Boggust",
      "Brandon Carter",
      "Arvind Satyanarayan"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2003.03675",
    "title": "Dynamic Backdoor Attacks Against Machine Learning Models",
    "abstract": " Title: Dynamic Backdoor Attacks Against Machine Learning Models ",
    "url": "https://arxiv.org/abs/2003.03675",
    "authors": [
      "Ahmed Salem",
      "Rui Wen",
      "Michael Backes",
      "Shiqing Ma",
      "Yang Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2105.11299",
    "title": "Fixed-Dimensional and Permutation Invariant State Representation of  Autonomous Driving",
    "abstract": " Title: Fixed-Dimensional and Permutation Invariant State Representation of  Autonomous Driving ",
    "url": "https://arxiv.org/abs/2105.11299",
    "authors": [
      "Jingliang Duan",
      "Dongjie Yu",
      "Shengbo Eben Li",
      "Wenxuan Wang",
      "Yangang Ren",
      "Ziyu Lin",
      "Bo Cheng"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2106.03837",
    "title": "MemStream: Memory-Based Streaming Anomaly Detection",
    "abstract": " Comments: The Web Conference (WWW), 2022 ",
    "url": "https://arxiv.org/abs/2106.03837",
    "authors": [
      "Siddharth Bhatia",
      "Arjit Jain",
      "Shivin Srivastava",
      "Kenji Kawaguchi",
      "Bryan Hooi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.11451",
    "title": "Physics-constrained deep neural network method for estimating parameters  in a redox flow battery",
    "abstract": " Title: Physics-constrained deep neural network method for estimating parameters  in a redox flow battery ",
    "url": "https://arxiv.org/abs/2106.11451",
    "authors": [
      "QiZhi He",
      "Panos Stinis",
      "Alexandre Tartakovsky"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.00184",
    "title": "Bilinear Scoring Function Search for Knowledge Graph Learning",
    "abstract": " Comments: TPAMI accepted ",
    "url": "https://arxiv.org/abs/2107.00184",
    "authors": [
      "Yongqi Zhang",
      "Quanming Yao",
      "James Tin-Yau Kwok"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.07217",
    "title": "Dynamic Link Network Emulation: a Model-based Design",
    "abstract": " Comments: 8 pages, as submitted to the 17th International Conference on Evaluation of Novel Approaches to Software Engineering ",
    "url": "https://arxiv.org/abs/2107.07217",
    "authors": [
      "Erick Petersen",
      "Jorge López",
      "Natalia Kushik",
      "Claude Poletti",
      "Djamal Zeghlache"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2108.08810",
    "title": "Do Vision Transformers See Like Convolutional Neural Networks?",
    "abstract": " Title: Do Vision Transformers See Like Convolutional Neural Networks? ",
    "url": "https://arxiv.org/abs/2108.08810",
    "authors": [
      "Maithra Raghu",
      "Thomas Unterthiner",
      "Simon Kornblith",
      "Chiyuan Zhang",
      "Alexey Dosovitskiy"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2109.10072",
    "title": "Scenario generation for market risk models using generative neural  networks",
    "abstract": " Title: Scenario generation for market risk models using generative neural  networks ",
    "url": "https://arxiv.org/abs/2109.10072",
    "authors": [
      "Solveig Flaig",
      "Gero Junike"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Mathematical Finance (q-fin.MF)",
      "Risk Management (q-fin.RM)"
    ]
  },
  {
    "id": "arXiv:2110.02709",
    "title": "Subquadratic-time algorithm for the diameter and all eccentricities on  median graphs",
    "abstract": " Comments: 37 pages, extended abstract in STACS 2022 ",
    "url": "https://arxiv.org/abs/2110.02709",
    "authors": [
      "Pierre Bergé",
      "Guillaume Ducoffe",
      "Michel Habib"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2110.09860",
    "title": "Bilateral-ViT for Robust Fovea Localization",
    "abstract": " Comments: This work has been accepted for oral presentation by ISBI2022 ",
    "url": "https://arxiv.org/abs/2110.09860",
    "authors": [
      "Sifan Song",
      "Kang Dang",
      "Qinji Yu",
      "Zilong Wang",
      "Frans Coenen",
      "Jionglong Su",
      "Xiaowei Ding"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.09983",
    "title": "ECG-ATK-GAN: Robustness against Adversarial Attacks on ECGs using  Conditional Generative Adversarial Networks",
    "abstract": " Comments: 10 pages, 3 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2110.09983",
    "authors": [
      "Khondker Fariha Hossain",
      "Sharif Amit Kamran",
      "Alireza Tavakkoli",
      "Xingjun Ma"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.10530",
    "title": "Improved pyrotechnics : Closer to the burning graph conjecture",
    "abstract": " Comments: 10 pages ",
    "url": "https://arxiv.org/abs/2110.10530",
    "authors": [
      "Paul Bastide",
      "Marthe Bonamy",
      "Anthony Bonato",
      "Pierre Charbit",
      "Shahin Kamali",
      "Théo Pierron",
      "Mikaël Rabie"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2111.02174",
    "title": "Unsupervised detection and open-set classification of fast-ramped  flexibility activation events",
    "abstract": " Comments: Published in Applied Energy and open access available at this https URL ",
    "url": "https://arxiv.org/abs/2111.02174",
    "authors": [
      "Nils Müller",
      "Carsten Heinrich",
      "Kai Heussen",
      "Henrik W. Bindner"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2111.02449",
    "title": "Effective Resistance for Pandemics: Mobility Network Sparsification for  High-Fidelity Epidemic Simulation",
    "abstract": " Title: Effective Resistance for Pandemics: Mobility Network Sparsification for  High-Fidelity Epidemic Simulation ",
    "url": "https://arxiv.org/abs/2111.02449",
    "authors": [
      "Alexander M. Mercier",
      "Samuel V. Scarpino",
      "Cristopher Moore"
    ],
    "subjectives": [
      "Populations and Evolution (q-bio.PE)",
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2111.10969",
    "title": "Medical Aegis: Robust adversarial protectors for medical images",
    "abstract": " Title: Medical Aegis: Robust adversarial protectors for medical images ",
    "url": "https://arxiv.org/abs/2111.10969",
    "authors": [
      "Qingsong Yao",
      "Zecheng He",
      "S. Kevin Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.12064",
    "title": "Semantic-Aware Collaborative Deep Reinforcement Learning Over Wireless  Cellular Networks",
    "abstract": " Comments: This paper has been accepted for the 2022 IEEE International Conference on Communications (ICC) ",
    "url": "https://arxiv.org/abs/2111.12064",
    "authors": [
      "Fatemeh Lotfi",
      "Omid Semiari",
      "Walid Saad"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2111.14330",
    "title": "Sparse DETR: Efficient End-to-End Object Detection with Learnable  Sparsity",
    "abstract": " Comments: ICLR 2022. Code is available at this https URL ",
    "url": "https://arxiv.org/abs/2111.14330",
    "authors": [
      "Byungseok Roh",
      "JaeWoong Shin",
      "Wuhyun Shin",
      "Saehoon Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.01694",
    "title": "On the Existence of the Adversarial Bayes Classifier (Extended Version)",
    "abstract": " Comments: 54 pages, 8 figures. Extended version of the paper \"On the Existence of the Adversarial Bayes Classifier\" published in NeurIPS ",
    "url": "https://arxiv.org/abs/2112.01694",
    "authors": [
      "Pranjal Awasthi",
      "Natalie S. Frank",
      "Mehryar Mohri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.06558",
    "title": "MAGIC: Multimodal relAtional Graph adversarIal inferenCe for Diverse and  Unpaired Text-based Image Captioning",
    "abstract": " Title: MAGIC: Multimodal relAtional Graph adversarIal inferenCe for Diverse and  Unpaired Text-based Image Captioning ",
    "url": "https://arxiv.org/abs/2112.06558",
    "authors": [
      "Wenqiao Zhang",
      "Haochen Shi",
      "Jiannan Guo",
      "Shengyu Zhang",
      "Qingpeng Cai",
      "Juncheng Li",
      "Sihui Luo",
      "Yueting Zhuang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.07322",
    "title": "Right-hand side decoding of Gabidulin code and applications",
    "abstract": " Comments: 10 pages, Accepted at the conference WCC 2022 ",
    "url": "https://arxiv.org/abs/2112.07322",
    "authors": [
      "Maxime Bombar",
      "Alain Couvreur"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2112.13341",
    "title": "AlertTrap: A study on object detection in remote insects trap monitoring  system using on-the-edge deep learning platform",
    "abstract": " Title: AlertTrap: A study on object detection in remote insects trap monitoring  system using on-the-edge deep learning platform ",
    "url": "https://arxiv.org/abs/2112.13341",
    "authors": [
      "An D. Le",
      "Duy A. Pham",
      "Dong T. Pham",
      "Hien B. Vo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.15272",
    "title": "ViNMT: Neural Machine Translation Toolkit",
    "abstract": " Title: ViNMT: Neural Machine Translation Toolkit ",
    "url": "https://arxiv.org/abs/2112.15272",
    "authors": [
      "Nguyen Hoang Quan",
      "Nguyen Thanh Dat",
      "Nguyen Hoang Minh Cong",
      "Nguyen Van Vinh",
      "Ngo Thi Vinh",
      "Nguyen Phuong Thai",
      "Tran Hong Viet"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02263",
    "title": "ITSA: An Information-Theoretic Approach to Automatic Shortcut Avoidance  and Domain Generalization in Stereo Matching Networks",
    "abstract": " Comments: 11 pages, 4 figures. Accepted by CVPR2022 ",
    "url": "https://arxiv.org/abs/2201.02263",
    "authors": [
      "WeiQin Chuah",
      "Ruwan Tennakoon",
      "Reza Hoseinnezhad",
      "Alireza Bab-Hadiashar",
      "David Suter"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03664",
    "title": "Structural complementarity and similarity: linking relational principles  to network motifs",
    "abstract": " Comments: 36 pages; 11 figures; 5 tables; pre-review (rewritten with emphasis applications to social and biological networks) ",
    "url": "https://arxiv.org/abs/2201.03664",
    "authors": [
      "Szymon Talaga",
      "Andrzej Nowak"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2201.10943",
    "title": "Event-based Video Reconstruction via Potential-assisted Spiking Neural  Network",
    "abstract": " Comments: Accepted at CVPR2022 ",
    "url": "https://arxiv.org/abs/2201.10943",
    "authors": [
      "Lin Zhu",
      "Xiao Wang",
      "Yi Chang",
      "Jianing Li",
      "Tiejun Huang",
      "Yonghong Tian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.00181",
    "title": "CLA-NeRF: Category-Level Articulated Neural Radiance Field",
    "abstract": " Comments: accepted by ICRA 2022 ",
    "url": "https://arxiv.org/abs/2202.00181",
    "authors": [
      "Wei-Cheng Tseng",
      "Hung-Ju Liao",
      "Lin Yen-Chen",
      "Min Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computational Geometry (cs.CG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.01891",
    "title": "Weighted Random Cut Forest Algorithm for Anomaly Detection",
    "abstract": " Comments: 33 pages ",
    "url": "https://arxiv.org/abs/2202.01891",
    "authors": [
      "Sijin Yeom",
      "Jae-Hun Jung"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03289",
    "title": "Approximation error of single hidden layer neural networks with fixed  weights",
    "abstract": " Comments: 13 pages, an example added, a typo corrected ",
    "url": "https://arxiv.org/abs/2202.03289",
    "authors": [
      "Vugar Ismailov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Classical Analysis and ODEs (math.CA)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2202.07013",
    "title": "Robust Policy Learning over Multiple Uncertainty Sets",
    "abstract": " Comments: Project webpage at this https URL ",
    "url": "https://arxiv.org/abs/2202.07013",
    "authors": [
      "Annie Xie",
      "Shagun Sodhani",
      "Chelsea Finn",
      "Joelle Pineau",
      "Amy Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.09708",
    "title": "Statistical and Topological Summaries Aid Disease Detection for  Segmented Retinal Vascular Images",
    "abstract": " Title: Statistical and Topological Summaries Aid Disease Detection for  Segmented Retinal Vascular Images ",
    "url": "https://arxiv.org/abs/2202.09708",
    "authors": [
      "John T. Nardini",
      "Charles W. J. Pugh",
      "Helen M. Byrne"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.11453",
    "title": "Bitwidth Heterogeneous Federated Learning with Progressive Weight  Dequantization",
    "abstract": " Comments: Preprint, 13 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2202.11453",
    "authors": [
      "Jaehong Yoon",
      "Geon Park",
      "Wonyong Jeong",
      "Sung Ju Hwang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2202.11855",
    "title": "Learning Multi-Object Dynamics with Compositional Neural Radiance Fields",
    "abstract": " Comments: diagrams added ",
    "url": "https://arxiv.org/abs/2202.11855",
    "authors": [
      "Danny Driess",
      "Zhiao Huang",
      "Yunzhu Li",
      "Russ Tedrake",
      "Marc Toussaint"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.12426",
    "title": "Analyzing Human Observer Ability in Morphing Attack Detection -- Where  Do We Stand?",
    "abstract": " Title: Analyzing Human Observer Ability in Morphing Attack Detection -- Where  Do We Stand? ",
    "url": "https://arxiv.org/abs/2202.12426",
    "authors": [
      "Sankini Rancha Godage",
      "Frøy Løvåsdal",
      "Sushma Venkatesh",
      "Kiran Raja",
      "Raghavendra Ramachandra",
      "Christoph Busch"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2203.00191",
    "title": "NeuRecover: Regression-Controlled Repair of Deep Neural Networks with  Training History",
    "abstract": " Title: NeuRecover: Regression-Controlled Repair of Deep Neural Networks with  Training History ",
    "url": "https://arxiv.org/abs/2203.00191",
    "authors": [
      "Shogo Tokui",
      "Susumu Tokumoto",
      "Akihito Yoshii",
      "Fuyuki Ishikawa",
      "Takao Nakagawa",
      "Kazuki Munakata",
      "Shinji Kikuchi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2203.01209",
    "title": "End-to-End Simulation of 5G Networks Assisted by IRS and AF Relays",
    "abstract": " Comments: Submitted to IEEE for possible publication. 8 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2203.01209",
    "authors": [
      "Matteo Pagin",
      "Marco Giordani",
      "Amir Ashtari Gargari",
      "Alberto Rech",
      "Federico Moretto",
      "Stefano Tomasin",
      "Jonathan Gambini",
      "Michele Zorzi"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.01311",
    "title": "HighMMT: Towards Modality and Task Generalization for High-Modality  Representation Learning",
    "abstract": " Comments: Code available at this https URL ",
    "url": "https://arxiv.org/abs/2203.01311",
    "authors": [
      "Paul Pu Liang",
      "Yiwei Lyu",
      "Xiang Fan",
      "Shentong Mo",
      "Dani Yogatama",
      "Louis-Philippe Morency",
      "Ruslan Salakhutdinov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2203.01445",
    "title": "LILE: Look In-Depth before Looking Elsewhere -- A Dual Attention Network  using Transformers for Cross-Modal Information Retrieval in Histopathology  Archives",
    "abstract": " Title: LILE: Look In-Depth before Looking Elsewhere -- A Dual Attention Network  using Transformers for Cross-Modal Information Retrieval in Histopathology  Archives ",
    "url": "https://arxiv.org/abs/2203.01445",
    "authors": [
      "Danial Maleki",
      "H.R Tizhoosh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.01451",
    "title": "Label Leakage and Protection from Forward Embedding in Vertical  Federated Learning",
    "abstract": " Title: Label Leakage and Protection from Forward Embedding in Vertical  Federated Learning ",
    "url": "https://arxiv.org/abs/2203.01451",
    "authors": [
      "Jiankai Sun",
      "Xin Yang",
      "Yuanshun Yao",
      "Chong Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.01687",
    "title": "Relative distance matters for one-shot landmark detection",
    "abstract": " Title: Relative distance matters for one-shot landmark detection ",
    "url": "https://arxiv.org/abs/2203.01687",
    "authors": [
      "Qingsong Yao",
      "Jianji Wang",
      "Yihua Sun",
      "Quan Quan",
      "Heqin Zhu",
      "S. Kevin Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.01852",
    "title": "Identification in Tree-shaped Linear Structural Causal Models",
    "abstract": " Comments: 9 pages (excluding references and appendix), accepted by AISTATS 2022 ",
    "url": "https://arxiv.org/abs/2203.01852",
    "authors": [
      "Benito van der Zander",
      "Marcel Wienöbst",
      "Markus Bläser",
      "Maciej Liśkiewicz"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Symbolic Computation (cs.SC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.01870",
    "title": "KamNet: An Integrated Spatiotemporal Deep Neural Network for Rare Event  Search in KamLAND-Zen",
    "abstract": " Comments: Submitting to Phys. Rev. C, dual submission with upcoming KamLAND-Zen 800 main result ",
    "url": "https://arxiv.org/abs/2203.01870",
    "authors": [
      "A. Li",
      "Z. Fu",
      "L. A. Winslow",
      "C. P. Grant",
      "H. Song",
      "H. Ozaki",
      "I. Shimizu",
      "A. Takeuchi"
    ],
    "subjectives": [
      "Instrumentation and Detectors (physics.ins-det)",
      "Machine Learning (cs.LG)"
    ]
  }
]