[
  {
    "id": "arXiv:2302.09067",
    "title": "Causal Confirmation Measures: From Simpson's Paradox to COVID-19",
    "abstract": "When we compare the influences of two causes on an outcome, if the conclusion from every group is against that from the conflation, we think there is Simpson's Paradox. The Existing Causal Inference Theory (ECIT) can make the overall conclusion consistent with the grouping conclusion by removing the confounder's influence to eliminate the paradox. The ECIT uses relative risk difference Pd = max(0, (R - 1)/R) (R denotes the risk ratio) as the probability of causation. In contrast, Philosopher Fitelson uses confirmation measure D (posterior probability minus prior probability) to measure the strength of causation. Fitelson concludes that from the perspective of Bayesian confirmation, we should directly accept the overall conclusion without considering the paradox. The author proposed a Bayesian confirmation measure b* similar to Pd before. To overcome the contradiction between the ECIT and Bayesian confirmation, the author uses the semantic information method with the minimum cross-entropy criterion to deduce causal confirmation measure Cc = (R -1)/max(R, 1). Cc is like Pd but has normalizing property (between -1 and 1) and cause symmetry. It especially fits cases where a cause restrains an outcome, such as the COVID-19 vaccine controlling the infection. Some examples (about kidney stone treatments and COVID-19) reveal that Pd and Cc are more reasonable than D; Cc is more useful than Pd. ",
    "url": "https://arxiv.org/abs/2302.09067",
    "authors": [
      "Chenguang Lu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09069",
    "title": "The Effect of Information Type on Human Cognitive Augmentation",
    "abstract": "When performing a task alone, humans achieve a certain level of performance. When humans are assisted by a tool or automation to perform the same task, performance is enhanced (augmented). Recently developed cognitive systems are able to perform cognitive processing at or above the level of a human in some domains. When humans work collaboratively with such cogs in a human/cog ensemble, we expect augmentation of cognitive processing to be evident and measurable. This paper shows the degree of cognitive augmentation depends on the nature of the information the cog contributes to the ensemble. Results of an experiment are reported showing conceptual information is the most effective type of information resulting in increases in cognitive accuracy, cognitive precision, and cognitive power. ",
    "url": "https://arxiv.org/abs/2302.09069",
    "authors": [
      "Ron Fulbright",
      "Samuel McGaha"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09114",
    "title": "Smoothly Giving up: Robustness for Simple Models",
    "abstract": "There is a growing need for models that are interpretable and have reduced energy and computational cost (e.g., in health care analytics and federated learning). Examples of algorithms to train such models include logistic regression and boosting. However, one challenge facing these algorithms is that they provably suffer from label noise; this has been attributed to the joint interaction between oft-used convex loss functions and simpler hypothesis classes, resulting in too much emphasis being placed on outliers. In this work, we use the margin-based $\\alpha$-loss, which continuously tunes between canonical convex and quasi-convex losses, to robustly train simple models. We show that the $\\alpha$ hyperparameter smoothly introduces non-convexity and offers the benefit of \"giving up\" on noisy training examples. We also provide results on the Long-Servedio dataset for boosting and a COVID-19 survey dataset for logistic regression, highlighting the efficacy of our approach across multiple relevant domains. ",
    "url": "https://arxiv.org/abs/2302.09114",
    "authors": [
      "Tyler Sypherd",
      "Nathan Stromberg",
      "Richard Nock",
      "Visar Berisha",
      "Lalitha Sankar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2302.09119",
    "title": "A Review on Generative Adversarial Networks for Data Augmentation in  Person Re-Identification Systems",
    "abstract": "Interest in automatic people re-identification systems has significantly grown in recent years, mainly for developing surveillance and smart shops software. Due to the variability in person posture, different lighting conditions, and occluded scenarios, together with the poor quality of the images obtained by different cameras, it is currently an unsolved problem. In machine learning-based computer vision applications with reduced data sets, one possibility to improve the performance of re-identification system is through the augmentation of the set of images or videos available for training the neural models. Currently, one of the most robust ways to generate synthetic information for data augmentation, whether it is video, images or text, are the generative adversarial networks. This article reviews the most relevant recent approaches to improve the performance of person re-identification models through data augmentation, using generative adversarial networks. We focus on three categories of data augmentation approaches: style transfer, pose transfer, and random generation. ",
    "url": "https://arxiv.org/abs/2302.09119",
    "authors": [
      "Victor Uc-Cetina",
      "Laura Alvarez-Gonzlez",
      "Anabel Martin-Gonzalez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09122",
    "title": "Conveying the Predicted Future to Users: A Case Study of Story Plot  Prediction",
    "abstract": "Creative writing is hard: Novelists struggle with writer's block daily. While automatic story generation has advanced recently, it is treated as a \"toy task\" for advancing artificial intelligence rather than helping people. In this paper, we create a system that produces a short description that narrates a predicted plot using existing story generation approaches. Our goal is to assist writers in crafting a consistent and compelling story arc. We conducted experiments on Amazon Mechanical Turk (AMT) to examine the quality of the generated story plots in terms of consistency and storiability. The results show that short descriptions produced by our frame-enhanced GPT-2 (FGPT-2) were rated as the most consistent and storiable among all models; FGPT-2's outputs even beat some random story snippets written by humans. Next, we conducted a preliminary user study using a story continuation task where AMT workers were given access to machine-generated story plots and asked to write a follow-up story. FGPT-2 could positively affect the writing process, though people favor other baselines more. Our study shed some light on the possibilities of future creative writing support systems beyond the scope of completing sentences. Our code is available at: https://github.com/appleternity/Story-Plot-Generation. ",
    "url": "https://arxiv.org/abs/2302.09122",
    "authors": [
      "Chieh-Yang Huang",
      "Saniya Naphade",
      "Kavya Laalasa Karanam",
      "Ting-Hao 'Kenneth' Huang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2302.09125",
    "title": "JANA: Jointly Amortized Neural Approximation of Complex Bayesian Models",
    "abstract": "This work proposes ''jointly amortized neural approximation'' (JANA) of intractable likelihood functions and posterior densities arising in Bayesian surrogate modeling and simulation-based inference. We train three complementary networks in an end-to-end fashion: 1) a summary network to compress individual data points, sets, or time series into informative embedding vectors; 2) a posterior network to learn an amortized approximate posterior; and 3) a likelihood network to learn an amortized approximate likelihood. Their interaction opens a new route to amortized marginal likelihood and posterior predictive estimation -- two important ingredients of Bayesian workflows that are often too expensive for standard methods. We benchmark the fidelity of JANA on a variety of simulation models against state-of-the-art Bayesian methods and propose a powerful and interpretable diagnostic for joint calibration. In addition, we investigate the ability of recurrent likelihood networks to emulate complex time series models without resorting to hand-crafted summary statistics. ",
    "url": "https://arxiv.org/abs/2302.09125",
    "authors": [
      "Stefan T. Radev",
      "Marvin Schmitt",
      "Valentin Pratz",
      "Umberto Picchini",
      "Ullrich Köthe",
      "Paul-Christian Bürkner"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.09127",
    "title": "Robust Pseudo-Markets for Reusable Public Resources",
    "abstract": "We study non-monetary mechanisms for the fair and efficient allocation of reusable public resources. We consider settings where a limited resource is shared among a set of agents, each of whom may request to use the resource over multiple consecutive rounds, receiving some utility only if they get to use the resource for the full duration of their request. Such settings are of particular significance in scientific research where large-scale instruments such as electron microscopes, particle colliders, and telescopes are shared between multiple research groups; this model also subsumes and extends existing models of repeated non-monetary allocation where resources are required for a single round only. We study a simple pseudo-market mechanism where upfront we endow each agent with some budget of artificial credits, with the budget proportion reflecting the fair share of the resource we want the agent to receive. The endowments thus define for each agent her ideal utility as that which she derives from her favorite allocation with no competition, but subject to getting at most her fair share of the items across rounds. Next, on each round, and for each available item, our mechanism runs a first-price auction with a selective reserve, wherein each agent submits a desired duration and per-round-bid (which must be at least the reserve price), and the highest bidder gets to use the item for the desired duration. We consider this problem in a Bayesian setting and show that under a carefully chosen reserve price, irrespective of how others bid, each agent has a strategy that guarantees her a $1/2$ fraction of her ideal utility in expectation. We also show this result is tight, i.e., there is no mechanism that can guarantee that all agents get more than half of their ideal utility. ",
    "url": "https://arxiv.org/abs/2302.09127",
    "authors": [
      "Siddhartha Banerjee",
      "Giannis Fikioris",
      "Éva Tardos"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2302.09173",
    "title": "Unsupervised Task Graph Generation from Instructional Video Transcripts",
    "abstract": "This work explores the problem of generating task graphs of real-world activities. Different from prior formulations, we consider a setting where text transcripts of instructional videos performing a real-world activity (e.g., making coffee) are provided and the goal is to identify the key steps relevant to the task as well as the dependency relationship between these key steps. We propose a novel task graph generation approach that combines the reasoning capabilities of instruction-tuned language models along with clustering and ranking components to generate accurate task graphs in a completely unsupervised manner. We show that the proposed approach generates more accurate task graphs compared to a supervised learning approach on tasks from the ProceL and CrossTask datasets. ",
    "url": "https://arxiv.org/abs/2302.09173",
    "authors": [
      "Lajanugen Logeswaran",
      "Sungryull Sohn",
      "Yunseok Jang",
      "Moontae Lee",
      "Honglak Lee"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09195",
    "title": "Data-Efficient Contrastive Self-supervised Learning: Easy Examples  Contribute the Most",
    "abstract": "Self-supervised learning (SSL) learns high-quality representations from large pools of unlabeled training data. As datasets grow larger, it becomes crucial to identify the examples that contribute the most to learning such representations. This enables efficient SSL by reducing the volume of data required for learning high-quality representations. Nevertheless, quantifying the value of examples for SSL has remained an open question. In this work, we address this for the first time, by proving that examples that contribute the most to contrastive SSL are those that have the most similar augmentations to other examples, in expectation. We provide rigorous guarantees for the generalization performance of SSL on such subsets. Empirically, we discover, perhaps surprisingly, the subsets that contribute the most to SSL are those that contribute the least to supervised learning. Through extensive experiments, we show that our subsets outperform random subsets by more than 3% on CIFAR100, CIFAR10, and STL10. Interestingly, we also find that we can safely exclude 20% of examples from CIFAR100 and 40% from STL10, without affecting downstream task performance. ",
    "url": "https://arxiv.org/abs/2302.09195",
    "authors": [
      "Siddharth Joshi",
      "Baharan Mirzasoleiman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09198",
    "title": "Exposing AI-Synthesized Human Voices Using Neural Vocoder Artifacts",
    "abstract": "The advancements of AI-synthesized human voices have introduced a growing threat of impersonation and disinformation. It is therefore of practical importance to developdetection methods for synthetic human voices. This work proposes a new approach to detect synthetic human voices based on identifying artifacts of neural vocoders in audio signals. A neural vocoder is a specially designed neural network that synthesizes waveforms from temporal-frequency representations, e.g., mel-spectrograms. The neural vocoder is a core component in most DeepFake audio synthesis models. Hence the identification of neural vocoder processing implies that an audio sample may have been synthesized. To take advantage of the vocoder artifacts for synthetic human voice detection, we introduce a multi-task learning framework for a binary-class RawNet2 model that shares the front-end feature extractor with a vocoder identification module. We treat the vocoder identification as a pretext task to constrain the front-end feature extractor to focus on vocoder artifacts and provide discriminative features for the final binary classifier. Our experiments show that the improved RawNet2 model based on vocoder identification achieves an overall high classification performance on the binary task. ",
    "url": "https://arxiv.org/abs/2302.09198",
    "authors": [
      "Chengzhe Sun",
      "Shan Jia",
      "Shuwei Hou",
      "Ehab AlBadawy",
      "Siwei Lyu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2302.09205",
    "title": "Approximate Thompson Sampling via Epistemic Neural Networks",
    "abstract": "Thompson sampling (TS) is a popular heuristic for action selection, but it requires sampling from a posterior distribution. Unfortunately, this can become computationally intractable in complex environments, such as those modeled using neural networks. Approximate posterior samples can produce effective actions, but only if they reasonably approximate joint predictive distributions of outputs across inputs. Notably, accuracy of marginal predictive distributions does not suffice. Epistemic neural networks (ENNs) are designed to produce accurate joint predictive distributions. We compare a range of ENNs through computational experiments that assess their performance in approximating TS across bandit and reinforcement learning environments. The results indicate that ENNs serve this purpose well and illustrate how the quality of joint predictive distributions drives performance. Further, we demonstrate that the \\textit{epinet} -- a small additive network that estimates uncertainty -- matches the performance of large ensembles at orders of magnitude lower computational cost. This enables effective application of TS with computation that scales gracefully to complex environments. ",
    "url": "https://arxiv.org/abs/2302.09205",
    "authors": [
      "Ian Osband",
      "Zheng Wen",
      "Seyed Mohammad Asghari",
      "Vikranth Dwaracherla",
      "Morteza Ibrahimi",
      "Xiuyuan Lu",
      "Benjamin Van Roy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09221",
    "title": "2D-Empowered 3D Object Detection on the Edge",
    "abstract": "3D object detection has a pivotal role in a wide range of applications, most notably autonomous driving and robotics. These applications are commonly deployed on edge devices to promptly interact with the environment, and often require near real-time response. With limited computation power, it is challenging to execute 3D detection on the edge using highly complex neural networks. Common approaches such as offloading to the cloud brings latency overheads due to the large amount of 3D point cloud data during transmission. To resolve the tension between wimpy edge devices and compute-intensive inference workloads, we explore the possibility of transforming fast 2D detection results to extrapolate 3D bounding boxes. To this end, we present Moby, a novel system that demonstrates the feasibility and potential of our approach. Our main contributions are two-fold: First, we design a 2D-to-3D transformation pipeline that takes as input the point cloud data from LiDAR and 2D bounding boxes from camera that are captured at exactly the same time, and generate 3D bounding boxes efficiently and accurately based on detection results of the previous frames without running 3D detectors. Second, we design a frame offloading scheduler that dynamically launches a 3D detection when the error of 2D-to-3D transformation accumulates to a certain level, so the subsequent transformations can draw upon the latest 3D detection results with better accuracy. Extensive evaluation on NVIDIA Jetson TX2 with the autonomous driving dataset KITTI and real-world 4G/LTE traces shows that, Moby reduces the end-to-end latency by up to 91.9% with mild accuracy drop compared to baselines. Further, Moby shows excellent energy efficiency by saving power consumption and memory footprint up to 75.7% and 48.1%, respectively. ",
    "url": "https://arxiv.org/abs/2302.09221",
    "authors": [
      "Jingzong Li",
      "Yik Hong Cai",
      "Libin Liu",
      "Yu Mao",
      "Chun Jason Xue",
      "Hong Xu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09225",
    "title": "OMINACS: Online ML-Based IoT Network Attack Detection and Classification  System",
    "abstract": "Several Machine Learning (ML) methodologies have been proposed to improve security in Internet Of Things (IoT) networks and reduce the damage caused by the action of malicious agents. However, detecting and classifying attacks with high accuracy and precision is still a major challenge. This paper proposes an online attack detection and network traffic classification system, which combines stream Machine Learning, Deep Learning, and Ensemble Learning technique. Using multiple stages of data analysis, the system can detect the presence of malicious traffic flows and classify them according to the type of attack they represent. Furthermore, we show how to implement this system both in an IoT network and from an ML point of view. The system was evaluated in three IoT network security datasets, in which it obtained accuracy and precision above 90% with a reduced false alarm rate. ",
    "url": "https://arxiv.org/abs/2302.09225",
    "authors": [
      "Diego Abreu",
      "Antônio Abelém"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09227",
    "title": "Invertible Neural Skinning",
    "abstract": "Building animatable and editable models of clothed humans from raw 3D scans and poses is a challenging problem. Existing reposing methods suffer from the limited expressiveness of Linear Blend Skinning (LBS), require costly mesh extraction to generate each new pose, and typically do not preserve surface correspondences across different poses. In this work, we introduce Invertible Neural Skinning (INS) to address these shortcomings. To maintain correspondences, we propose a Pose-conditioned Invertible Network (PIN) architecture, which extends the LBS process by learning additional pose-varying deformations. Next, we combine PIN with a differentiable LBS module to build an expressive and end-to-end Invertible Neural Skinning (INS) pipeline. We demonstrate the strong performance of our method by outperforming the state-of-the-art reposing techniques on clothed humans and preserving surface correspondences, while being an order of magnitude faster. We also perform an ablation study, which shows the usefulness of our pose-conditioning formulation, and our qualitative results display that INS can rectify artefacts introduced by LBS well. See our webpage for more details: https://yashkant.github.io/invertible-neural-skinning/ ",
    "url": "https://arxiv.org/abs/2302.09227",
    "authors": [
      "Yash Kant",
      "Aliaksandr Siarohin",
      "Riza Alp Guler",
      "Menglei Chai",
      "Jian Ren",
      "Sergey Tulyakov",
      "Igor Gilitschenski"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2302.09228",
    "title": "Web Photo Source Identification based on Neural Enhanced Camera  Fingerprint",
    "abstract": "With the growing popularity of smartphone photography in recent years, web photos play an increasingly important role in all walks of life. Source camera identification of web photos aims to establish a reliable linkage from the captured images to their source cameras, and has a broad range of applications, such as image copyright protection, user authentication, investigated evidence verification, etc. This paper presents an innovative and practical source identification framework that employs neural-network enhanced sensor pattern noise to trace back web photos efficiently while ensuring security. Our proposed framework consists of three main stages: initial device fingerprint registration, fingerprint extraction and cryptographic connection establishment while taking photos, and connection verification between photos and source devices. By incorporating metric learning and frequency consistency into the deep network design, our proposed fingerprint extraction algorithm achieves state-of-the-art performance on modern smartphone photos for reliable source identification. Meanwhile, we also propose several optimization sub-modules to prevent fingerprint leakage and improve accuracy and efficiency. Finally for practical system design, two cryptographic schemes are introduced to reliably identify the correlation between registered fingerprint and verified photo fingerprint, i.e. fuzzy extractor and zero-knowledge proof (ZKP). The codes for fingerprint extraction network and benchmark dataset with modern smartphone cameras photos are all publicly available at https://github.com/PhotoNecf/PhotoNecf. ",
    "url": "https://arxiv.org/abs/2302.09228",
    "authors": [
      "Feng Qian",
      "Sifeng He",
      "Honghao Huang",
      "Huanyu Ma",
      "Xiaobo Zhang",
      "Lei Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09233",
    "title": "Solving Boltzmann equation with neural sparse representation",
    "abstract": "We consider the neural sparse representation to solve Boltzmann equation with BGK and quadratic collision model, where a network-based ansatz that can approximate the distribution function with extremely high efficiency is proposed. Precisely, fully connected neural networks are employed in the time and spatial space so as to avoid the discretization in space and time. The different low-rank representations are utilized in the microscopic velocity for the BGK and quadratic collision model, resulting in a significant reduction in the degree of freedom. We approximate the discrete velocity distribution in the BGK model using the canonical polyadic decomposition. For the quadratic collision model, a data-driven, SVD-based linear basis is built based on the BGK solution. All these will significantly improve the efficiency of the network when solving Boltzmann equation. Moreover, the specially designed adaptive-weight loss function is proposed with the strategies as multi-scale input and Maxwellian splitting applied to further enhance the approximation efficiency and speed up the learning process. Several numerical experiments, including 1D wave and Sod problems and 2D wave problem, demonstrate the effectiveness of these neural sparse representation methods. ",
    "url": "https://arxiv.org/abs/2302.09233",
    "authors": [
      "Zhengyi Li",
      "Yanli Wang",
      "Hongsheng Liu",
      "Zidong Wang",
      "Bin Dong"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2302.09237",
    "title": "Characterizations of Network Auctions and Generalizations of VCG",
    "abstract": "With the growth of networks, promoting products through social networks has become an important problem. For auctions in social networks, items are needed to be sold to agents in a network, where each agent can bid and also diffuse the sale information to her neighbors. Thus, the agents' social relations are intervened with their bids in the auctions. In network auctions, the classical VCG mechanism fails to retain key properties. In order to better understand network auctions, in this paper, we characterize network auctions for the single-unit setting with respect to IR, WBB, IC, SWM, and other properties. For example, we present sufficient conditions for mechanisms to be social welfare maximizing and (weakly) incentive compatible. With the help of these properties and new concepts such as rewards, participation rewards, and so on, we show how to design SWM mechanisms to satisfy IC as much as possible, and IC mechanisms to maximize the revenue. Our results provide insights into understanding auctions in social networks. ",
    "url": "https://arxiv.org/abs/2302.09237",
    "authors": [
      "Mingyu Xiao",
      "Guixin Lin",
      "Bakh Khoussainov",
      "Yuchao Song"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2302.09240",
    "title": "Beamforming and Phase Shift Design for HR-IRS-aided Directional  Modulation Network with a Malicious Attacker",
    "abstract": "In this paper, we propose to use hybrid relay-intelligent reflecting surface (HR-IRS) to improve the security performance of directional modulation (DM) system. In particular, the eavesdropper in this system works in full-duplex (FD) mode and he will eavesdrop on the confidential message (CM) as well as send malicious jamming. We aim to maximize the secrecy rate (SR) by jointly optimizing the receive beamforming, transmit beamforming and phase shift matrix (PSM) of HR-IRS. Since the optimization problem is un-convex and the variables are coupled to each other, we solve this problem by iteratively optimizing these variables. The receive beamforming and transmit beamforming are obtained based on generalized Rayleigh-Ritz theorem and Dinkelbach's Transform respectively. And for PSM, two methods, called separate optimization of PSM (SO-PSM) and joint optimization of PSM (JO-PSM) are proposed. Thus, two iterative algorithms are proposed accordingly, namely maximizing SR based on SO-PSM (Max-SR-SOP) and maximizing SR based on JO-PSM (Max-SR-JOP). The former has better performance and the latter has lower complexity. The simulation results show that when HR-IRS has sufficient power budget, the proposed Max-SR-SOP and Max-SR-JOP can enable HR-IRS-aided DM network to obtain higher SR than passive IRS-aided DM network. ",
    "url": "https://arxiv.org/abs/2302.09240",
    "authors": [
      "Feng Shu",
      "Hangjia He",
      "Rongen Dong",
      "Yeqing Lin",
      "Qiankun Cheng",
      "Jiangzhou Wang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2302.09243",
    "title": "A Federated Approach for Hate Speech Detection",
    "abstract": "Hate speech detection has been the subject of high research attention, due to the scale of content created on social media. In spite of the attention and the sensitive nature of the task, privacy preservation in hate speech detection has remained under-studied. The majority of research has focused on centralised machine learning infrastructures which risk leaking data. In this paper, we show that using federated machine learning can help address privacy the concerns that are inherent to hate speech detection while obtaining up to 6.81% improvement in terms of F1-score. ",
    "url": "https://arxiv.org/abs/2302.09243",
    "authors": [
      "Jay Gala",
      "Deep Gandhi",
      "Jash Mehta",
      "Zeerak Talat"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.09258",
    "title": "Digital Privacy Under Attack: Challenges and Enablers",
    "abstract": "Users have renewed interest in protecting their private data in the digital space. When they don't believe that their privacy is sufficiently covered by one platform, they will readily switch to another. Such an increasing level of privacy awareness has made privacy preservation an essential research topic. Nevertheless, new privacy attacks are emerging day by day. Therefore, a holistic survey to compare the discovered techniques on attacks over privacy preservation and their mitigation schemes is essential in the literature. We develop a study to fill this gap by assessing the resilience of privacy-preserving methods to various attacks and conducting a comprehensive review of countermeasures from a broader perspective. First, we introduce the fundamental concepts and critical components of privacy attacks. Second, we comprehensively cover major privacy attacks targeted at anonymous data, statistical aggregate data, and privacy-preserving models. We also summarize popular countermeasures to mitigate these attacks. Finally, some promising future research directions and related issues in the privacy community are envisaged. We believe this survey will successfully shed some light on privacy research and encourage researchers to entirely understand the resilience of different existing privacy-preserving approaches. ",
    "url": "https://arxiv.org/abs/2302.09258",
    "authors": [
      "Baobao Song",
      "Mengyue Deng",
      "Shiva Raj Pokhrel",
      "Qiujun Lan",
      "Robin Doss",
      "Gang Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.09267",
    "title": "Stochastic Approximation Approaches to Group Distributionally Robust  Optimization",
    "abstract": "This paper investigates group distributionally robust optimization (GDRO), with the purpose to learn a model that performs well over $m$ different distributions. First, we formulate GDRO as a stochastic convex-concave saddle-point problem, and demonstrate that stochastic mirror descent (SMD), using $m$ samples in each iteration, achieves an $O(m (\\log m)/\\epsilon^2)$ sample complexity for finding an $\\epsilon$-optimal solution, which matches the $\\Omega(m/\\epsilon^2)$ lower bound up to a logarithmic factor. Then, we make use of techniques from online learning to reduce the number of samples required in each round from $m$ to $1$, keeping the same sample complexity. Specifically, we cast GDRO as a two-players game where one player simply performs SMD and the other executes an online algorithm for non-oblivious multi-armed bandits. Next, we consider a more practical scenario where the number of samples that can be drawn from each distribution is different, and propose a novel formulation of weighted DRO, which allows us to derive distribution-dependent convergence rates. Denote by $n_i$ the sample budget for the $i$-th distribution, and assume $n_1 \\geq n_2 \\geq \\cdots \\geq n_m$. In the first approach, we incorporate non-uniform sampling into SMD such that the sample budget is satisfied in expectation, and prove the excess risk of the $i$-th distribution decreases at an $O(\\sqrt{n_1 \\log m}/n_i)$ rate. In the second approach, we use mini-batches to meet the budget exactly and also reduce the variance in stochastic gradients, and then leverage stochastic mirror-prox algorithm, which can exploit small variances, to optimize a carefully designed weighted DRO problem. Under appropriate conditions, it attains an $O((\\log m)/\\sqrt{n_i})$ convergence rate, which almost matches the optimal $O(\\sqrt{1/n_i})$ rate of only learning from the $i$-th distribution with $n_i$ samples. ",
    "url": "https://arxiv.org/abs/2302.09267",
    "authors": [
      "Lijun Zhang",
      "Peng Zhao",
      "Tianbao Yang",
      "Zhi-Hua Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09275",
    "title": "Structural Neural Additive Models: Enhanced Interpretable Machine  Learning",
    "abstract": "Deep neural networks (DNNs) have shown exceptional performances in a wide range of tasks and have become the go-to method for problems requiring high-level predictive power. There has been extensive research on how DNNs arrive at their decisions, however, the inherently uninterpretable networks remain up to this day mostly unobservable \"black boxes\". In recent years, the field has seen a push towards interpretable neural networks, such as the visually interpretable Neural Additive Models (NAMs). We propose a further step into the direction of intelligibility beyond the mere visualization of feature effects and propose Structural Neural Additive Models (SNAMs). A modeling framework that combines classical and clearly interpretable statistical methods with the predictive power of neural applications. Our experiments validate the predictive performances of SNAMs. The proposed framework performs comparable to state-of-the-art fully connected DNNs and we show that SNAMs can even outperform NAMs while remaining inherently more interpretable. ",
    "url": "https://arxiv.org/abs/2302.09275",
    "authors": [
      "Mattias Luber",
      "Anton Thielmann",
      "Benjamin Säfken"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2302.09276",
    "title": "Transformer-Based Neural Marked Spatio Temporal Point Process Model for  Football Match Events Analysis",
    "abstract": "With recently available football match event data that record the details of football matches, analysts and researchers have a great opportunity to develop new performance metrics, gain insight, and evaluate key performance. However, most sports sequential events modeling methods and performance metrics approaches could be incomprehensive in dealing with such large-scale spatiotemporal data (in particular, temporal process), thereby necessitating a more comprehensive spatiotemporal model and a holistic performance metric. To this end, we proposed the Transformer-Based Neural Marked Spatio Temporal Point Process (NMSTPP) model for football event data based on the neural temporal point processes (NTPP) framework. In the experiments, our model outperformed the prediction performance of the baseline models. Furthermore, we proposed the holistic possession utilization score (HPUS) metric for a more comprehensive football possession analysis. For verification, we examined the relationship with football teams' final ranking, average goal score, and average xG over a season. It was observed that the average HPUS showed significant correlations regardless of not using goal and details of shot information. Furthermore, we show HPUS examples in analyzing possessions, matches, and between matches. ",
    "url": "https://arxiv.org/abs/2302.09276",
    "authors": [
      "Calvin C. K. Yeung",
      "Tony Sit",
      "Keisuke Fujii"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09292",
    "title": "FrAug: Frequency Domain Augmentation for Time Series Forecasting",
    "abstract": "Data augmentation (DA) has become a de facto solution to expand training data size for deep learning. With the proliferation of deep models for time series analysis, various time series DA techniques are proposed in the literature, e.g., cropping-, warping-, flipping-, and mixup-based methods. However, these augmentation methods mainly apply to time series classification and anomaly detection tasks. In time series forecasting (TSF), we need to model the fine-grained temporal relationship within time series segments to generate accurate forecasting results given data in a look-back window. Existing DA solutions in the time domain would break such a relationship, leading to poor forecasting accuracy. To tackle this problem, this paper proposes simple yet effective frequency domain augmentation techniques that ensure the semantic consistency of augmented data-label pairs in forecasting, named FrAug. We conduct extensive experiments on eight widely-used benchmarks with several state-of-the-art TSF deep models. Our results show that FrAug can boost the forecasting accuracy of TSF models in most cases. Moreover, we show that FrAug enables models trained with 1\\% of the original training data to achieve similar performance to the ones trained on full training data, which is particularly attractive for cold-start forecasting. Finally, we show that applying test-time training with FrAug greatly improves forecasting accuracy for time series with significant distribution shifts, which often occurs in real-life TSF applications. Our code is available at https://anonymous.4open.science/r/Fraug-more-results-1785. ",
    "url": "https://arxiv.org/abs/2302.09292",
    "authors": [
      "Muxi Chen",
      "Zhijian Xu",
      "Ailing Zeng",
      "Qiang Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09298",
    "title": "Improving Fairness in Adaptive Social Exergames via Shapley Bandits",
    "abstract": "Algorithmic fairness is an essential requirement as AI becomes integrated in society. In the case of social applications where AI distributes resources, algorithms often must make decisions that will benefit a subset of users, sometimes repeatedly or exclusively, while attempting to maximize specific outcomes. How should we design such systems to serve users more fairly? This paper explores this question in the case where a group of users works toward a shared goal in a social exergame called Step Heroes. We identify adverse outcomes in traditional multi-armed bandits (MABs) and formalize the Greedy Bandit Problem. We then propose a solution based on a new type of fairness-aware multi-armed bandit, Shapley Bandits. It uses the Shapley Value for increasing overall player participation and intervention adherence rather than the maximization of total group output, which is traditionally achieved by favoring only high-performing participants. We evaluate our approach via a user study (n=46). Our results indicate that our Shapley Bandits effectively mediates the Greedy Bandit Problem and achieves better user retention and motivation across the participants. ",
    "url": "https://arxiv.org/abs/2302.09298",
    "authors": [
      "Robert C. Gray",
      "Jennifer Villareale",
      "Thomas B. Fox",
      "Diane H. Dallal",
      "Santiago Ontañón",
      "Danielle Arigo",
      "Shahin Jabbari",
      "Jichen Zhu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2302.09301",
    "title": "Exploring the Representation Manifolds of Stable Diffusion Through the  Lens of Intrinsic Dimension",
    "abstract": "Prompting has become an important mechanism by which users can more effectively interact with many flavors of foundation model. Indeed, the last several years have shown that well-honed prompts can sometimes unlock emergent capabilities within such models. While there has been a substantial amount of empirical exploration of prompting within the community, relatively few works have studied prompting at a mathematical level. In this work we aim to take a first step towards understanding basic geometric properties induced by prompts in Stable Diffusion, focusing on the intrinsic dimension of internal representations within the model. We find that choice of prompt has a substantial impact on the intrinsic dimension of representations at both layers of the model which we explored, but that the nature of this impact depends on the layer being considered. For example, in certain bottleneck layers of the model, intrinsic dimension of representations is correlated with prompt perplexity (measured using a surrogate model), while this correlation is not apparent in the latent layers. Our evidence suggests that intrinsic dimension could be a useful tool for future studies of the impact of different prompts on text-to-image models. ",
    "url": "https://arxiv.org/abs/2302.09301",
    "authors": [
      "Henry Kvinge",
      "Davis Brown",
      "Charles Godfrey"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09309",
    "title": "Meta Style Adversarial Training for Cross-Domain Few-Shot Learning",
    "abstract": "Cross-Domain Few-Shot Learning (CD-FSL) is a recently emerging task that tackles few-shot learning across different domains. It aims at transferring prior knowledge learned on the source dataset to novel target datasets. The CD-FSL task is especially challenged by the huge domain gap between different datasets. Critically, such a domain gap actually comes from the changes of visual styles, and wave-SAN empirically shows that spanning the style distribution of the source data helps alleviate this issue. However, wave-SAN simply swaps styles of two images. Such a vanilla operation makes the generated styles ``real'' and ``easy'', which still fall into the original set of the source styles. Thus, inspired by vanilla adversarial learning, a novel model-agnostic meta Style Adversarial training (StyleAdv) method together with a novel style adversarial attack method is proposed for CD-FSL. Particularly, our style attack method synthesizes both ``virtual'' and ``hard'' adversarial styles for model training. This is achieved by perturbing the original style with the signed style gradients. By continually attacking styles and forcing the model to recognize these challenging adversarial styles, our model is gradually robust to the visual styles, thus boosting the generalization ability for novel target datasets. Besides the typical CNN-based backbone, we also employ our StyleAdv method on large-scale pretrained vision transformer. Extensive experiments conducted on eight various target datasets show the effectiveness of our method. Whether built upon ResNet or ViT, we achieve the new state of the art for CD-FSL. Codes and models will be released. ",
    "url": "https://arxiv.org/abs/2302.09309",
    "authors": [
      "Yuqian Fu",
      "Yu Xie",
      "Yanwei Fu",
      "Yu-Gang Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09311",
    "title": "Temporal Interpolation Is All You Need for Dynamic Neural Radiance  Fields",
    "abstract": "Temporal interpolation often plays a crucial role to learn meaningful representations in dynamic scenes. In this paper, we propose a novel method to train four-dimensional spatiotemporal neural radiance fields of dynamic scenes based on temporal interpolation of feature vectors. Two feature interpolation methods are suggested depending on underlying representations, neural or grid representation. In neural representation, we extract features from space-time inputs via multiple neural network modules and interpolate them based on time frames. The proposed multi-level feature interpolation network effectively captures features of both short-term and long-term time ranges. In grid representation, space-time features are learned via four-dimensional hash grids. The grid representation remarkably reduces training time, which is more than 100$\\times$ faster compared to the neural network models, while maintaining the rendering quality of trained models. Concatenation of static and dynamic features and addition of simple smoothness term further improves the performance of the proposed models. Despite the simplicity of its network architecture, we demonstrate that the proposed method shows superior performance to previous works in neural representation and shows the fastest training speed in grid representation. ",
    "url": "https://arxiv.org/abs/2302.09311",
    "authors": [
      "Sungheon Park",
      "Minjung Son",
      "Seokhwan Jang",
      "Young Chun Ahn",
      "Ji-Yeon Kim",
      "Nahyup Kang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09320",
    "title": "Anomaly Detection of UAV State Data Based on Single-class Triangular  Global Alignment Kernel Extreme Learning Machine",
    "abstract": "Unmanned Aerial Vehicles (UAVs) are widely used and meet many demands in military and civilian fields. With the continuous enrichment and extensive expansion of application scenarios, the safety of UAVs is constantly being challenged. To address this challenge, we propose algorithms to detect anomalous data collected from drones to improve drone safety. We deployed a one-class kernel extreme learning machine (OCKELM) to detect anomalies in drone data. By default, OCKELM uses the radial basis (RBF) kernel function as the kernel function of the model. To improve the performance of OCKELM, we choose a Triangular Global Alignment Kernel (TGAK) instead of an RBF Kernel and introduce the Fast Independent Component Analysis (FastICA) algorithm to reconstruct UAV data. Based on the above improvements, we create a novel anomaly detection strategy FastICA-TGAK-OCELM. The method is finally validated on the UCI dataset and detected on the Aeronautical Laboratory Failures and Anomalies (ALFA) dataset. The experimental results show that compared with other methods, the accuracy of this method is improved by more than 30%, and point anomalies are effectively detected. ",
    "url": "https://arxiv.org/abs/2302.09320",
    "authors": [
      "Feisha Hu",
      "Qi Wang",
      "Haijian Shao",
      "Shang Gao",
      "Hualong Yu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09323",
    "title": "Heterogeneous Graph Convolutional Neural Network via Hodge-Laplacian for  Brain Functional Data",
    "abstract": "This study proposes a novel heterogeneous graph convolutional neural network (HGCNN) to handle complex brain fMRI data at regional and across-region levels. We introduce a generic formulation of spectral filters on heterogeneous graphs by introducing the $k-th$ Hodge-Laplacian (HL) operator. In particular, we propose Laguerre polynomial approximations of HL spectral filters and prove that their spatial localization on graphs is related to the polynomial order. Furthermore, based on the bijection property of boundary operators on simplex graphs, we introduce a generic topological graph pooling (TGPool) method that can be used at any dimensional simplices. This study designs HL-node, HL-edge, and HL-HGCNN neural networks to learn signal representation at a graph node, edge levels, and both, respectively. Our experiments employ fMRI from the Adolescent Brain Cognitive Development (ABCD; n=7693) to predict general intelligence. Our results demonstrate the advantage of the HL-edge network over the HL-node network when functional brain connectivity is considered as features. The HL-HGCNN outperforms the state-of-the-art graph neural networks (GNNs) approaches, such as GAT, BrainGNN, dGCN, BrainNetCNN, and Hypergraph NN. The functional connectivity features learned from the HL-HGCNN are meaningful in interpreting neural circuits related to general intelligence. ",
    "url": "https://arxiv.org/abs/2302.09323",
    "authors": [
      "Jinghan Huang",
      "Moo K. Chung",
      "Anqi Qiu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09326",
    "title": "An Adaptive Plug-and-Play Network for Few-Shot Learning",
    "abstract": "Few-shot learning (FSL) requires a model to classify new samples after learning from only a few samples. While remarkable results are achieved in existing methods, the performance of embedding and metrics determines the upper limit of classification accuracy in FSL. The bottleneck is that deep networks and complex metrics tend to induce overfitting in FSL, making it difficult to further improve the performance. Towards this, we propose plug-and-play model-adaptive resizer (MAR) and adaptive similarity metric (ASM) without any other losses. MAR retains high-resolution details to alleviate the overfitting problem caused by data scarcity, and ASM decouples the relationship between different metrics and then fuses them into an advanced one. Extensive experiments show that the proposed method could boost existing methods on two standard dataset and a fine-grained datasets, and achieve state-of-the-art results on mini-ImageNet and tiered-ImageNet. ",
    "url": "https://arxiv.org/abs/2302.09326",
    "authors": [
      "Hao Li",
      "Li Li",
      "Yunmeng Huang",
      "Ning Li",
      "Yongtao Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09330",
    "title": "Practical Flaky Test Prediction using Common Code Evolution and Test  History Data",
    "abstract": "Non-deterministically behaving test cases cause developers to lose trust in their regression test suites and to eventually ignore failures. Detecting flaky tests is therefore a crucial task in maintaining code quality, as it builds the necessary foundation for any form of systematic response to flakiness, such as test quarantining or automated debugging. Previous research has proposed various methods to detect flakiness, but when trying to deploy these in an industrial context, their reliance on instrumentation, test reruns, or language-specific artifacts was inhibitive. In this paper, we therefore investigate the prediction of flaky tests without such requirements on the underlying programming language, CI, build or test execution framework. Instead, we rely only on the most commonly available artifacts, namely the tests' outcomes and durations, as well as basic information about the code evolution to build predictive models capable of detecting flakiness. Furthermore, our approach does not require additional reruns, since it gathers this data from existing test executions. We trained several established classifiers on the suggested features and evaluated their performance on a large-scale industrial software system, from which we collected a data set of 100 flaky and 100 non-flaky test- and code-histories. The best model was able to achieve an F1-score of 95.5% using only 3 features: the tests' flip rates, the number of changes to source files in the last 54 days, as well as the number of changed files in the most recent pull request. ",
    "url": "https://arxiv.org/abs/2302.09330",
    "authors": [
      "Martin Gruber",
      "Michael Heine",
      "Norbert Oster",
      "Michael Philippsen",
      "Gordon Fraser"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2302.09335",
    "title": "Knowledge Graph Completion based on Tensor Decomposition for Disease  Gene Prediction",
    "abstract": "Accurate identification of disease genes has consistently been one of the keys to decoding a disease's molecular mechanism. Most current approaches focus on constructing biological networks and utilizing machine learning, especially, deep learning to identify disease genes, but ignore the complex relations between entities in the biological knowledge graph. In this paper, we construct a biological knowledge graph centered on diseases and genes, and develop an end-to-end Knowledge graph completion model for Disease Gene Prediction using interactional tensor decomposition (called KDGene). KDGene introduces an interaction module between the embeddings of entities and relations to tensor decomposition, which can effectively enhance the information interaction in biological knowledge. Experimental results show that KDGene significantly outperforms state-of-the-art algorithms. Furthermore, the comprehensive biological analysis of the case of diabetes mellitus confirms KDGene's ability for identifying new and accurate candidate genes. This work proposes a scalable knowledge graph completion framework to identify disease candidate genes, from which the results are promising to provide valuable references for further wet experiments. ",
    "url": "https://arxiv.org/abs/2302.09335",
    "authors": [
      "Xinyan Wang",
      "Ting Jia",
      "Chongyu Wang",
      "Kuan Xu",
      "Zixin Shu",
      "Kuo Yang",
      "Xuezhong Zhou"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09347",
    "title": "Closed-Loop Transcription via Convolutional Sparse Coding",
    "abstract": "Autoencoding has achieved great empirical success as a framework for learning generative models for natural images. Autoencoders often use generic deep networks as the encoder or decoder, which are difficult to interpret, and the learned representations lack clear structure. In this work, we make the explicit assumption that the image distribution is generated from a multi-stage sparse deconvolution. The corresponding inverse map, which we use as an encoder, is a multi-stage convolution sparse coding (CSC), with each stage obtained from unrolling an optimization algorithm for solving the corresponding (convexified) sparse coding program. To avoid computational difficulties in minimizing distributional distance between the real and generated images, we utilize the recent closed-loop transcription (CTRL) framework that optimizes the rate reduction of the learned sparse representations. Conceptually, our method has high-level connections to score-matching methods such as diffusion models. Empirically, our framework demonstrates competitive performance on large-scale datasets, such as ImageNet-1K, compared to existing autoencoding and generative methods under fair conditions. Even with simpler networks and fewer computational resources, our method demonstrates high visual quality in regenerated images. More surprisingly, the learned autoencoder performs well on unseen datasets. Our method enjoys several side benefits, including more structured and interpretable representations, more stable convergence, and scalability to large datasets. Our method is arguably the first to demonstrate that a concatenation of multiple convolution sparse coding/decoding layers leads to an interpretable and effective autoencoder for modeling the distribution of large-scale natural image datasets. ",
    "url": "https://arxiv.org/abs/2302.09347",
    "authors": [
      "Xili Dai",
      "Ke Chen",
      "Shengbang Tong",
      "Jingyuan Zhang",
      "Xingjian Gao",
      "Mingyang Li",
      "Druv Pai",
      "Yuexiang Zhai",
      "XIaojun Yuan",
      "Heung-Yeung Shum",
      "Lionel M. Ni",
      "Yi Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09360",
    "title": "Backdoor Attacks to Pre-trained Unified Foundation Models",
    "abstract": "The rise of pre-trained unified foundation models breaks down the barriers between different modalities and tasks, providing comprehensive support to users with unified architectures. However, the backdoor attack on pre-trained models poses a serious threat to their security. Previous research on backdoor attacks has been limited to uni-modal tasks or single tasks across modalities, making it inapplicable to unified foundation models. In this paper, we make proof-of-concept level research on the backdoor attack for pre-trained unified foundation models. Through preliminary experiments on NLP and CV classification tasks, we reveal the vulnerability of these models and suggest future research directions for enhancing the attack approach. ",
    "url": "https://arxiv.org/abs/2302.09360",
    "authors": [
      "Zenghui Yuan",
      "Yixin Liu",
      "Kai Zhang",
      "Pan Zhou",
      "Lichao Sun"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.09365",
    "title": "Hyneter: Hybrid Network Transformer for Object Detection",
    "abstract": "In this paper, we point out that the essential differences between CNN-based and Transformer-based detectors, which cause the worse performance of small objects in Transformer-based methods, are the gap between local information and global dependencies in feature extraction and propagation. To address these differences, we propose a new vision Transformer, called Hybrid Network Transformer (Hyneter), after pre-experiments that indicate the gap causes CNN-based and Transformer-based methods to increase size-different objects result unevenly. Different from the divide and conquer strategy in previous methods, Hyneters consist of Hybrid Network Backbone (HNB) and Dual Switching module (DS), which integrate local information and global dependencies, and transfer them simultaneously. Based on the balance strategy, HNB extends the range of local information by embedding convolution layers into Transformer blocks, and DS adjusts excessive reliance on global dependencies outside the patch. ",
    "url": "https://arxiv.org/abs/2302.09365",
    "authors": [
      "Dong Chen",
      "Duoqian Miao",
      "Xuerong Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09389",
    "title": "Vulnerability analysis of captcha using Deep learning",
    "abstract": "Several websites improve their security and avoid dangerous Internet attacks by implementing CAPTCHAs (Completely Automated Public Turing test to tell Computers and Humans Apart), a type of verification to identify whether the end-user is human or a robot. The most prevalent type of CAPTCHA is text-based, designed to be easily recognized by humans while being unsolvable towards machines or robots. However, as deep learning technology progresses, development of convolutional neural network (CNN) models that predict text-based CAPTCHAs becomes easier. The purpose of this research is to investigate the flaws and vulnerabilities in the CAPTCHA generating systems in order to design more resilient CAPTCHAs. To achieve this, we created CapNet, a Convolutional Neural Network. The proposed platform can evaluate both numerical and alphanumerical CAPTCHAs ",
    "url": "https://arxiv.org/abs/2302.09389",
    "authors": [
      "Jaskaran Singh Walia",
      "Aryan odugoudar"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09394",
    "title": "Deep Neural Networks based Meta-Learning for Network Intrusion Detection",
    "abstract": "Designing an intrusion detection system is difficult as network traffic encompasses various attack types, including new and evolving ones with minor changes. The data used to construct a predictive model has a skewed class distribution and limited representation of attack types, which differ from real network traffic. These limitations result in dataset shift, negatively impacting the machine learning models' predictive abilities and reducing the detection rate against novel attacks. To address the challenge of dataset shift, we introduce the INformation FUsion and Stacking Ensemble (INFUSE) for network intrusion detection. This approach further improves its predictive power by employing a deep neural network-based Meta-Learner on top of INFUSE. First, a hybrid feature space is created by integrating decision and feature spaces. Five different classifiers are utilized to generate a pool of decision spaces. The feature space is then enriched through a deep sparse autoencoder that learns the semantic relationships between attacks. Finally, the deep Meta-Learner acts as an ensemble combiner to analyze the hybrid feature space and make a final decision. Our evaluation on stringent benchmark datasets and comparison to existing techniques showed the effectiveness of INFUSE with an F-Score of 0.91, Accuracy of 91.6%, and Recall of 0.94 on the Test+ dataset, and an F-Score of 0.91, Accuracy of 85.6%, and Recall of 0.87 on the stringent Test-21 dataset. These promising results indicate the proposed technique has strong generalization capability and the potential to detect network attacks. ",
    "url": "https://arxiv.org/abs/2302.09394",
    "authors": [
      "Anabia Sohail",
      "Bibi Ayisha",
      "Irfan Hameed",
      "Muhammad Mohsin Zafar",
      "Asifullah Khan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09420",
    "title": "RobustNLP: A Technique to Defend NLP Models Against Backdoor Attacks",
    "abstract": "As machine learning (ML) systems are being increasingly employed in the real world to handle sensitive tasks and make decisions in various fields, the security and privacy of those models have also become increasingly critical. In particular, Deep Neural Networks (DNN) have been shown to be vulnerable to backdoor attacks whereby adversaries have access to the training data and the opportunity to manipulate such data by inserting carefully developed samples into the training dataset. Although the NLP community has produced several studies on generating backdoor attacks proving the vulnerable state of language modes, to the best of our knowledge, there does not exist any work to combat such attacks. To bridge this gap, we present RobustEncoder: a novel clustering-based technique for detecting and removing backdoor attacks in the text domain. Extensive empirical results demonstrate the effectiveness of our technique in detecting and removing backdoor triggers. Our code is available at https://github.com/marwanomar1/Backdoor-Learning-for-NLP ",
    "url": "https://arxiv.org/abs/2302.09420",
    "authors": [
      "Marwan Omar"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.09422",
    "title": "Neural Attention Memory",
    "abstract": "We propose a novel perspective of the attention mechanism by reinventing it as a memory architecture for neural networks, namely Neural Attention Memory (NAM). NAM is a memory structure that is both readable and writable via differentiable linear algebra operations. We explore three use cases of NAM: memory-augmented neural network (MANN), few-shot learning, and efficient long-range attention. First, we design two NAM-based MANNs of Long Short-term Memory (LSAM) and NAM Turing Machine (NAM-TM) that show better computational powers in algorithmic zero-shot generalization tasks compared to other baselines such as differentiable neural computer (DNC). Next, we apply NAM to the N-way K-shot learning task and show that it is more effective at reducing false positives compared to the baseline cosine classifier. Finally, we implement an efficient Transformer with NAM and evaluate it with long-range arena tasks to show that NAM can be an efficient and effective alternative for scaled dot-product attention. ",
    "url": "https://arxiv.org/abs/2302.09422",
    "authors": [
      "Hyoungwook Nam",
      "Seung Byum Seo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09424",
    "title": "Zero and Few-Shot Localization of Task-Oriented Dialogue Agents with a  Distilled Representation",
    "abstract": "Task-oriented Dialogue (ToD) agents are mostly limited to a few widely-spoken languages, mainly due to the high cost of acquiring training data for each language. Existing low-cost approaches that rely on cross-lingual embeddings or naive machine translation sacrifice a lot of accuracy for data efficiency, and largely fail in creating a usable dialogue agent. We propose automatic methods that use ToD training data in a source language to build a high-quality functioning dialogue agent in another target language that has no training data (i.e. zero-shot) or a small training set (i.e. few-shot). Unlike most prior work in cross-lingual ToD that only focuses on Dialogue State Tracking (DST), we build an end-to-end agent. We show that our approach closes the accuracy gap between few-shot and existing full-shot methods for ToD agents. We achieve this by (1) improving the dialogue data representation, (2) improving entity-aware machine translation, and (3) automatic filtering of noisy translations. We evaluate our approach on the recent bilingual dialogue dataset BiToD. In Chinese to English transfer, in the zero-shot setting, our method achieves 46.7% and 22.0% in Task Success Rate (TSR) and Dialogue Success Rate (DSR) respectively. In the few-shot setting where 10% of the data in the target language is used, we improve the state-of-the-art by 15.2% and 14.0%, coming within 5% of full-shot training. ",
    "url": "https://arxiv.org/abs/2302.09424",
    "authors": [
      "Mehrad Moradshahi",
      "Sina J. Semnani",
      "Monica S. Lam"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.09429",
    "title": "NU-AIR -- A Neuromorphic Urban Aerial Dataset for Detection and  Localization of Pedestrians and Vehicles",
    "abstract": "Annotated imagery capturing pedestrians and vehicles in an urban environment can be used to train Neural Networks (NNs) for machine vision tasks. This paper presents the first open-source aerial neuromorphic dataset that captures pedestrians and vehicles moving in an urban environment. The dataset, titled NU-AIR, features 70.75 minutes of event footage acquired with a 640 x 480 resolution neuromorphic sensor mounted on a quadrotor operating in an urban environment. Crowds of pedestrians, different types of vehicles, and street scenes at a busy urban intersection are captured at different elevations and illumination conditions. Manual bounding box annotations of vehicles and pedestrians contained in the recordings are provided at a frequency of 30 Hz, yielding 93,204 labels in total. Evaluation of the dataset's fidelity is performed by training three Spiking Neural Networks (SNNs) and ten Deep Neural Networks (DNNs). The mean average precision (mAP) accuracy results achieved for the testing set evaluations are on-par with results reported for similar SNNs and DNNs on established neuromorphic benchmark datasets. All data and Python code to voxelize the data and subsequently train SNNs/DNNs has been open-sourced. ",
    "url": "https://arxiv.org/abs/2302.09429",
    "authors": [
      "Craig Iaboni",
      "Thomas Kelly",
      "Pramod Abichandani"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09443",
    "title": "VITAL: Vision Transformer Neural Networks for Accurate Smartphone  Heterogeneity Resilient Indoor Localization",
    "abstract": "Wi-Fi fingerprinting-based indoor localization is an emerging embedded application domain that leverages existing Wi-Fi access points (APs) in buildings to localize users with smartphones. Unfortunately, the heterogeneity of wireless transceivers across diverse smartphones carried by users has been shown to reduce the accuracy and reliability of localization algorithms. In this paper, we propose a novel framework based on vision transformer neural networks called VITAL that addresses this important challenge. Experiments indicate that VITAL can reduce the uncertainty created by smartphone heterogeneity while improving localization accuracy from 41% to 68% over the best-known prior works. We also demonstrate the generalizability of our approach and propose a data augmentation technique that can be integrated into most deep learning-based localization frameworks to improve accuracy. ",
    "url": "https://arxiv.org/abs/2302.09443",
    "authors": [
      "Danish Gufran",
      "Saideep Tiku",
      "Sudeep Pasricha"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09444",
    "title": "mBEST: Realtime Deformable Linear Object Detection Through Minimal  Bending Energy Skeleton Pixel Traversals",
    "abstract": "Robotic manipulation of deformable materials is a challenging task that often requires realtime visual feedback. This is especially true for deformable linear objects (DLOs) or \"rods\", whose slender and flexible structures make proper tracking and detection nontrivial. To address this challenge, we present mBEST, a robust algorithm for the realtime detection of DLOs that is capable of producing an ordered pixel sequence of each DLO's centerline along with segmentation masks. Our algorithm obtains a binary mask of the DLOs and then thins it to produce a skeleton pixel representation. After refining the skeleton to ensure topological correctness, the pixels are traversed to generate paths along each unique DLO. At the core of our algorithm, we postulate that intersections can be robustly handled by choosing the combination of paths that minimizes the cumulative bending energy of the DLO(s). We show that this simple and intuitive formulation outperforms the state-of-the-art methods for detecting DLOs with large numbers of sporadic crossings and curvatures with high variance. Furthermore, our method achieves a significant performance improvement of approximately 40 FPS compared to the 15 FPS of prior algorithms, which enables realtime applications. ",
    "url": "https://arxiv.org/abs/2302.09444",
    "authors": [
      "Andrew Choi",
      "Dezhong Tong",
      "Brian Park",
      "Demetri Terzopoulos",
      "Jungseock Joo",
      "Mohammad Khalid Jawed"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.09450",
    "title": "Robust and Versatile Bipedal Jumping Control through Multi-Task  Reinforcement Learning",
    "abstract": "This work aims to push the limits of agility for bipedal robots by enabling a torque-controlled bipedal robot to perform robust and versatile dynamic jumps in the real world. We present a multi-task reinforcement learning framework to train the robot to accomplish a large variety of jumping tasks, such as jumping to different locations and directions. To improve performance on these challenging tasks, we develop a new policy structure that encodes the robot's long-term input/output (I/O) history while also providing direct access to its short-term I/O history. In order to train a versatile multi-task policy, we utilize a multi-stage training scheme that includes different training stages for different objectives. After multi-stage training, the multi-task policy can be directly transferred to Cassie, a physical bipedal robot. Training on different tasks and exploring more diverse scenarios leads to highly robust policies that can exploit the diverse set of learned skills to recover from perturbations or poor landings during real-world deployment. Such robustness in the proposed multi-task policy enables Cassie to succeed in completing a variety of challenging jump tasks in the real world, such as standing long jumps, jumping onto elevated platforms, and multi-axis jumps. ",
    "url": "https://arxiv.org/abs/2302.09450",
    "authors": [
      "Zhongyu Li",
      "Xue Bin Peng",
      "Pieter Abbeel",
      "Sergey Levine",
      "Glen Berseth",
      "Koushil Sreenath"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.09457",
    "title": "Adversarial Machine Learning: A Systematic Survey of Backdoor Attack,  Weight Attack and Adversarial Example",
    "abstract": "Adversarial machine learning (AML) studies the adversarial phenomenon of machine learning, which may make inconsistent or unexpected predictions with humans. Some paradigms have been recently developed to explore this adversarial phenomenon occurring at different stages of a machine learning system, such as training-time adversarial attack (i.e., backdoor attack), deployment-time adversarial attack (i.e., weight attack), and inference-time adversarial attack (i.e., adversarial example). However, although these paradigms share a common goal, their developments are almost independent, and there is still no big picture of AML. In this work, we aim to provide a unified perspective to the AML community to systematically review the overall progress of this field. We firstly provide a general definition about AML, and then propose a unified mathematical framework to covering existing attack paradigms. According to the proposed unified framework, we can not only clearly figure out the connections and differences among these paradigms, but also systematically categorize and review existing works in each paradigm. ",
    "url": "https://arxiv.org/abs/2302.09457",
    "authors": [
      "Baoyuan Wu",
      "Li Liu",
      "Zihao Zhu",
      "Qingshan Liu",
      "Zhaofeng He",
      "Siwei Lyu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.09461",
    "title": "Liveness score-based regression neural networks for face anti-spoofing",
    "abstract": "Previous anti-spoofing methods have used either pseudo maps or user-defined labels, and the performance of each approach depends on the accuracy of the third party networks generating pseudo maps and the way in which the users define the labels. In this paper, we propose a liveness score-based regression network for overcoming the dependency on third party networks and users. First, we introduce a new labeling technique, called pseudo-discretized label encoding for generating discretized labels indicating the amount of information related to real images. Secondly, we suggest the expected liveness score based on a regression network for training the difference between the proposed supervision and the expected liveness score. Finally, extensive experiments were conducted on four face anti-spoofing benchmarks to verify our proposed method on both intra-and cross-dataset tests. The experimental results show our approach outperforms previous methods. ",
    "url": "https://arxiv.org/abs/2302.09461",
    "authors": [
      "Youngjun Kwak",
      "Minyoung Jung",
      "Hunjae Yoo",
      "JinHo Shin",
      "Changick Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09462",
    "title": "MedViT: A Robust Vision Transformer for Generalized Medical Image  Classification",
    "abstract": "Convolutional Neural Networks (CNNs) have advanced existing medical systems for automatic disease diagnosis. However, there are still concerns about the reliability of deep medical diagnosis systems against the potential threats of adversarial attacks since inaccurate diagnosis could lead to disastrous consequences in the safety realm. In this study, we propose a highly robust yet efficient CNN-Transformer hybrid model which is equipped with the locality of CNNs as well as the global connectivity of vision Transformers. To mitigate the high quadratic complexity of the self-attention mechanism while jointly attending to information in various representation subspaces, we construct our attention mechanism by means of an efficient convolution operation. Moreover, to alleviate the fragility of our Transformer model against adversarial attacks, we attempt to learn smoother decision boundaries. To this end, we augment the shape information of an image in the high-level feature space by permuting the feature mean and variance within mini-batches. With less computational complexity, our proposed hybrid model demonstrates its high robustness and generalization ability compared to the state-of-the-art studies on a large-scale collection of standardized MedMNIST-2D datasets. ",
    "url": "https://arxiv.org/abs/2302.09462",
    "authors": [
      "Omid Nejati Manzari",
      "Hamid Ahmadabadi",
      "Hossein Kashiani",
      "Shahriar B. Shokouhi",
      "Ahmad Ayatollahi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09463",
    "title": "The Emerged Artificial Intelligence Protocol for Hierarchical  Information Network",
    "abstract": "The recent development of artificial intelligence enables a machine to achieve a human level of intelligence. Problem-solving and decision-making are two mental abilities to measure human intelligence. Many scholars have proposed different models. However, there is a gap in establishing an AI-oriented hierarchical model with a multilevel abstraction. This study proposes a novel model known as the emerged AI protocol that consists of seven distinct layers capable of providing an optimal and explainable solution for a given problem. ",
    "url": "https://arxiv.org/abs/2302.09463",
    "authors": [
      "Caesar Wu",
      "Pascal Bouvry"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09465",
    "title": "Stochastic Generative Flow Networks",
    "abstract": "Generative Flow Networks (or GFlowNets for short) are a family of probabilistic agents that learn to sample complex combinatorial structures through the lens of \"inference as control\". They have shown great potential in generating high-quality and diverse candidates from a given energy landscape. However, existing GFlowNets can be applied only to deterministic environments, and fail in more general tasks with stochastic dynamics, which can limit their applicability. To overcome this challenge, this paper introduces Stochastic GFlowNets, a new algorithm that extends GFlowNets to stochastic environments. By decomposing state transitions into two steps, Stochastic GFlowNets isolate environmental stochasticity and learn a dynamics model to capture it. Extensive experimental results demonstrate that Stochastic GFlowNets offer significant advantages over standard GFlowNets as well as MCMC- and RL-based approaches, on a variety of standard benchmarks with stochastic dynamics. ",
    "url": "https://arxiv.org/abs/2302.09465",
    "authors": [
      "Ling Pan",
      "Dinghuai Zhang",
      "Moksh Jain",
      "Longbo Huang",
      "Yoshua Bengio"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09479",
    "title": "Delving into the Adversarial Robustness of Federated Learning",
    "abstract": "In Federated Learning (FL), models are as fragile as centrally trained models against adversarial examples. However, the adversarial robustness of federated learning remains largely unexplored. This paper casts light on the challenge of adversarial robustness of federated learning. To facilitate a better understanding of the adversarial vulnerability of the existing FL methods, we conduct comprehensive robustness evaluations on various attacks and adversarial training methods. Moreover, we reveal the negative impacts induced by directly adopting adversarial training in FL, which seriously hurts the test accuracy, especially in non-IID settings. In this work, we propose a novel algorithm called Decision Boundary based Federated Adversarial Training (DBFAT), which consists of two components (local re-weighting and global regularization) to improve both accuracy and robustness of FL systems. Extensive experiments on multiple datasets demonstrate that DBFAT consistently outperforms other baselines under both IID and non-IID settings. ",
    "url": "https://arxiv.org/abs/2302.09479",
    "authors": [
      "Jie Zhang",
      "Bo Li",
      "Chen Chen",
      "Lingjuan Lyu",
      "Shuang Wu",
      "Shouhong Ding",
      "Chao Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.09484",
    "title": "Gradient-based Wang--Landau Algorithm: A Novel Sampler for \\\\Output  Distribution of Neural Networks over the Input Space",
    "abstract": "The output distribution of a neural network (NN) over the entire input space captures the complete input-output mapping relationship, offering insights toward a more comprehensive NN understanding. Exhaustive enumeration or traditional Monte Carlo methods for the entire input space can exhibit impractical sampling time, especially for high-dimensional inputs. To make such difficult sampling computationally feasible, in this paper, we propose a novel Gradient-based Wang-Landau (GWL) sampler. We first draw the connection between the output distribution of a NN and the density of states (DOS) of a physical system. Then, we renovate the classic sampler for the DOS problem, the Wang-Landau algorithm, by replacing its random proposals with gradient-based Monte Carlo proposals. This way, our GWL sampler investigates the under-explored subsets of the input space much more efficiently. Extensive experiments have verified the accuracy of the output distribution generated by GWL and also showcased several interesting findings - for example, in a binary image classification task, both CNN and ResNet mapped the majority of human unrecognizable images to very negative logit values. ",
    "url": "https://arxiv.org/abs/2302.09484",
    "authors": [
      "Weitang Liu",
      "Ying-Wai Li",
      "Yi-Zhuang You",
      "Jingbo Shang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09486",
    "title": "LC-NeRF: Local Controllable Face Generation in Neural Randiance Field",
    "abstract": "3D face generation has achieved high visual quality and 3D consistency thanks to the development of neural radiance fields (NeRF). Recently, to generate and edit 3D faces with NeRF representation, some methods are proposed and achieve good results in decoupling geometry and texture. The latent codes of these generative models affect the whole face, and hence modifications to these codes cause the entire face to change. However, users usually edit a local region when editing faces and do not want other regions to be affected. Since changes to the latent code affect global generation results, these methods do not allow for fine-grained control of local facial regions. To improve local controllability in NeRF-based face editing, we propose LC-NeRF, which is composed of a Local Region Generators Module and a Spatial-Aware Fusion Module, allowing for local geometry and texture control of local facial regions. Qualitative and quantitative evaluations show that our method provides better local editing than state-of-the-art face editing methods. Our method also performs well in downstream tasks, such as text-driven facial image editing. ",
    "url": "https://arxiv.org/abs/2302.09486",
    "authors": [
      "Wenyang Zhou",
      "Lu Yuan",
      "Shuyu Chen",
      "Lin Gao",
      "Shimin Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09488",
    "title": "A Picture May Be Worth a Thousand Lives: An Interpretable Artificial  Intelligence Strategy for Predictions of Suicide Risk from Social Media  Images",
    "abstract": "The promising research on Artificial Intelligence usages in suicide prevention has principal gaps, including black box methodologies, inadequate outcome measures, and scarce research on non-verbal inputs, such as social media images (despite their popularity today, in our digital era). This study addresses these gaps and combines theory-driven and bottom-up strategies to construct a hybrid and interpretable prediction model of valid suicide risk from images. The lead hypothesis was that images contain valuable information about emotions and interpersonal relationships, two central concepts in suicide-related treatments and theories. The dataset included 177,220 images by 841 Facebook users who completed a gold-standard suicide scale. The images were represented with CLIP, a state-of-the-art algorithm, which was utilized, unconventionally, to extract predefined features that served as inputs to a simple logistic-regression prediction model (in contrast to complex neural networks). The features addressed basic and theory-driven visual elements using everyday language (e.g., bright photo, photo of sad people). The results of the hybrid model (that integrated theory-driven and bottom-up methods) indicated high prediction performance that surpassed common bottom-up algorithms, thus providing a first proof that images (alone) can be leveraged to predict validated suicide risk. Corresponding with the lead hypothesis, at-risk users had images with increased negative emotions and decreased belonginess. The results are discussed in the context of non-verbal warning signs of suicide. Notably, the study illustrates the advantages of hybrid models in such complicated tasks and provides simple and flexible prediction strategies that could be utilized to develop real-life monitoring tools of suicide. ",
    "url": "https://arxiv.org/abs/2302.09488",
    "authors": [
      "Yael Badian",
      "Yaakov Ophir",
      "Refael Tikochinski",
      "Nitay Calderon",
      "Anat Brunstein Klomek",
      "Roi Reichart"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2302.09491",
    "title": "X-Adv: Physical Adversarial Object Attacks against X-ray Prohibited Item  Detection",
    "abstract": "Adversarial attacks are valuable for evaluating the robustness of deep learning models. Existing attacks are primarily conducted on the visible light spectrum (e.g., pixel-wise texture perturbation). However, attacks targeting texture-free X-ray images remain underexplored, despite the widespread application of X-ray imaging in safety-critical scenarios such as the X-ray detection of prohibited items. In this paper, we take the first step toward the study of adversarial attacks targeted at X-ray prohibited item detection, and reveal the serious threats posed by such attacks in this safety-critical scenario. Specifically, we posit that successful physical adversarial attacks in this scenario should be specially designed to circumvent the challenges posed by color/texture fading and complex overlapping. To this end, we propose X-adv to generate physically printable metals that act as an adversarial agent capable of deceiving X-ray detectors when placed in luggage. To resolve the issues associated with color/texture fading, we develop a differentiable converter that facilitates the generation of 3D-printable objects with adversarial shapes, using the gradients of a surrogate model rather than directly generating adversarial textures. To place the printed 3D adversarial objects in luggage with complex overlapped instances, we design a policy-based reinforcement learning strategy to find locations eliciting strong attack performance in worst-case scenarios whereby the prohibited items are heavily occluded by other items. To verify the effectiveness of the proposed X-Adv, we conduct extensive experiments in both the digital and the physical world (employing a commercial X-ray security inspection system for the latter case). Furthermore, we present the physical-world X-ray adversarial attack dataset XAD. ",
    "url": "https://arxiv.org/abs/2302.09491",
    "authors": [
      "Aishan Liu",
      "Jun Guo",
      "Jiakai Wang",
      "Siyuan Liang",
      "Renshuai Tao",
      "Wenbo Zhou",
      "Cong Liu",
      "Xianglong Liu",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09502",
    "title": "Self-supervised Cloth Reconstruction via Action-conditioned Cloth  Tracking",
    "abstract": "State estimation is one of the greatest challenges for cloth manipulation due to cloth's high dimensionality and self-occlusion. Prior works propose to identify the full state of crumpled clothes by training a mesh reconstruction model in simulation. However, such models are prone to suffer from a sim-to-real gap due to differences between cloth simulation and the real world. In this work, we propose a self-supervised method to finetune a mesh reconstruction model in the real world. Since the full mesh of crumpled cloth is difficult to obtain in the real world, we design a special data collection scheme and an action-conditioned model-based cloth tracking method to generate pseudo-labels for self-supervised learning. By finetuning the pretrained mesh reconstruction model on this pseudo-labeled dataset, we show that we can improve the quality of the reconstructed mesh without requiring human annotations, and improve the performance of downstream manipulation task. ",
    "url": "https://arxiv.org/abs/2302.09502",
    "authors": [
      "Zixuan Huang",
      "Xingyu Lin",
      "David Held"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09511",
    "title": "Dynamic Private Task Assignment under Differential Privacy",
    "abstract": "Data collection is indispensable for spatial crowdsourcing services, such as resource allocation, policymaking, and scientific explorations. However, privacy issues make it challenging for users to share their information unless receiving sufficient compensation. Differential Privacy (DP) is a promising mechanism to release helpful information while protecting individuals' privacy. However, most DP mechanisms only consider a fixed compensation for each user's privacy loss. In this paper, we design a task assignment scheme that allows workers to dynamically improve their utility with dynamic distance privacy leakage. Specifically, we propose two solutions to improve the total utility of task assignment results, namely Private Utility Conflict-Elimination (PUCE) approach and Private Game Theory (PGT) approach, respectively. We prove that PUCE achieves higher utility than the state-of-the-art works. We demonstrate the efficiency and effectiveness of our PUCE and PGT approaches on both real and synthetic data sets compared with the recent distance-based approach, Private Distance Conflict-Elimination (PDCE). PUCE is always better than PDCE slightly. PGT is 50% to 63% faster than PDCE and can improve 16% utility on average when worker range is large enough. ",
    "url": "https://arxiv.org/abs/2302.09511",
    "authors": [
      "Leilei Du",
      "Peng Cheng",
      "Libin Zheng",
      "Wei Xi",
      "Xuemin Lin",
      "Wenjie Zhang",
      "Jing Fang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2302.09527",
    "title": "SanskritShala: A Neural Sanskrit NLP Toolkit with Web-Based Interface  for Pedagogical and Annotation Purposes",
    "abstract": "We present a neural Sanskrit Natural Language Processing (NLP) toolkit named SanskritShala (a school of Sanskrit) to facilitate computational linguistic analyses for several tasks such as word segmentation, morphological tagging, dependency parsing, and compound type identification. Our systems currently report state-of-the-art performance on available benchmark datasets for all tasks. SanskritShala is deployed as a web-based application, which allows a user to get real-time analysis for the given input. It is built with easy-to-use interactive data annotation features that allow annotators to correct the system predictions when it makes mistakes. We publicly release the source codes of the 4 modules included in the toolkit, 7 word embedding models that have been trained on publicly available Sanskrit corpora and multiple annotated datasets such as word similarity, relatedness, categorization, analogy prediction to assess intrinsic properties of word embeddings. So far as we know, this is the first neural-based Sanskrit NLP toolkit that has a web-based interface and a number of NLP modules. We are sure that the people who are willing to work with Sanskrit will find it useful for pedagogical and annotative purposes. SanskritShala is available at: https://cnerg.iitkgp.ac.in/sanskritshala. The demo video of our platform can be accessed at: https://youtu.be/x0X31Y9k0mw4. ",
    "url": "https://arxiv.org/abs/2302.09527",
    "authors": [
      "Jivnesh Sandhan",
      "Anshul Agarwal",
      "Laxmidhar Behera",
      "Tushar Sandhan",
      "Pawan Goyal"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.09531",
    "title": "AIIR-MIX: Multi-Agent Reinforcement Learning Meets Attention Individual  Intrinsic Reward Mixing Network",
    "abstract": "Deducing the contribution of each agent and assigning the corresponding reward to them is a crucial problem in cooperative Multi-Agent Reinforcement Learning (MARL). Previous studies try to resolve the issue through designing an intrinsic reward function, but the intrinsic reward is simply combined with the environment reward by summation in these studies, which makes the performance of their MARL framework unsatisfactory. We propose a novel method named Attention Individual Intrinsic Reward Mixing Network (AIIR-MIX) in MARL, and the contributions of AIIR-MIX are listed as follows:(a) we construct a novel intrinsic reward network based on the attention mechanism to make teamwork more effective. (b) we propose a Mixing network that is able to combine intrinsic and extrinsic rewards non-linearly and dynamically in response to changing conditions of the environment. We compare AIIR-MIX with many State-Of-The-Art (SOTA) MARL methods on battle games in StarCraft II. And the results demonstrate that AIIR-MIX performs admirably and can defeat the current advanced methods on average test win rate. To validate the effectiveness of AIIR-MIX, we conduct additional ablation studies. The results show that AIIR-MIX can dynamically assign each agent a real-time intrinsic reward in accordance with their actual contribution. ",
    "url": "https://arxiv.org/abs/2302.09531",
    "authors": [
      "Wei Li",
      "Weiyan Liu",
      "Shitong Shao",
      "Shiyi Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2302.09544",
    "title": "Comprehensive Evaluation of RSB and Spectre Vulnerability on Modern  Processors",
    "abstract": "Performance-enhancing mechanisms such as branch prediction, out-of-order execution, and return stack buffer (RSB) have been widely employed in today's modern processing units. Although successful in increasing the CPU performance, exploiting the design flaws and security bugs in these components have set the background for various types of microarchitectural attacks such as Spectre and Meltdown. While many attacks such as Meltdown and Spectre have been numerously implemented and analyzed on Intel processors, few researches have been carried out to evaluate their impact on ARM processors. Moreover, SpectreRSB vulnerability, the newer variant of spectre attack based on RSB, has been neglected in recent studies. In this work, we first evaluate the SpectreRSB vulnerability by implementing this attack on ARM processors, which, to the best of our knowledge, has not been implemented and analyzed on ARM processors. We further present a security evaluation of ARM processors by implementing different variants of Spectre-family attacks. By analyzing the results obtained from various experiments, we evaluate ARM processors security regarding their diverse microarchitectural designs. We also introduce a high throughput and noise-free covert channel, based on the RSB structure. Based on our experiments, the throughput of the covert channel is 94.19KB/s with negligible error. ",
    "url": "https://arxiv.org/abs/2302.09544",
    "authors": [
      "Farhad Taheri",
      "Siavash Bayat-Sarmadi",
      "Alireza Sadeghpour",
      "Seyed Parsa Tayefeh Morsal"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2302.09547",
    "title": "Energy Consumption Minimization in Secure Multi-antenna UAV-assisted MEC  Networks with Channel Uncertainty",
    "abstract": "This paper investigates the robust and secure task transmission and computation scheme in multi-antenna unmanned aerial vehicle (UAV)-assisted mobile edge computing (MEC) networks, where the UAV is dual-function, i.e., aerial MEC and aerial relay. The channel uncertainty is considered during information offloading and downloading. An energy consumption minimization problem is formulated under some constraints including users' quality of service and information security requirements and the UAV's trajectory's causality, by jointly optimizing the CPU frequency, the offloading time, the beamforming vectors, the artificial noise and the trajectory of the UAV, as well as the CPU frequency, the offloading time and the transmission power of each user. To solve the non-convex problem, a reformulated problem is first derived by a series of convex reformation methods, i.e., semi-definite relaxation, S-Procedure and first-order approximation, and then, solved by a proposed successive convex approximation (SCA)-based algorithm. The convergence performance and computational complexity of the proposed algorithm are analyzed. Numerical results demonstrate that the proposed scheme outperform existing benchmark schemes. Besides, the proposed SCA-based algorithm is superior to traditional alternative optimization-based algorithm. ",
    "url": "https://arxiv.org/abs/2302.09547",
    "authors": [
      "Weihao Mao",
      "Ke Xiong",
      "Yang Lu",
      "Pingyi Fan",
      "Zhiguo Ding"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2302.09554",
    "title": "Mixed Hierarchy Network for Image Restoration",
    "abstract": "Image restoration is a long-standing low-level vision problem, e.g., deblurring and deraining. In the process of image restoration, it is necessary to consider not only the spatial details and contextual information of restoration to ensure the quality, but also the system complexity. Although many methods have been able to guarantee the quality of image restoration, the system complexity of the state-of-the-art (SOTA) methods is increasing as well. Motivated by this, we present a mixed hierarchy network that can balance these competing goals. Our main proposal is a mixed hierarchy architecture, that progressively recovers contextual information and spatial details from degraded images while we design intra-blocks to reduce system complexity. Specifically, our model first learns the contextual information using encoder-decoder architectures, and then combines them with high-resolution branches that preserve spatial detail. In order to reduce the system complexity of this architecture for convenient analysis and comparison, we replace or remove the nonlinear activation function with multiplication and use a simple network structure. In addition, we replace spatial convolution with global self-attention for the middle block of encoder-decoder. The resulting tightly interlinked hierarchy architecture, named as MHNet, delivers strong performance gains on several image restoration tasks, including image deraining, and deblurring. ",
    "url": "https://arxiv.org/abs/2302.09554",
    "authors": [
      "Hu Gao",
      "Depeng Dang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09555",
    "title": "Estimation and Early Prediction of Grip Force Based on sEMG Signals and  Deep Recurrent Neural Networks",
    "abstract": "Hands are used for communicating with the surrounding environment and have a complex structure that enables them to perform various tasks with their multiple degrees of freedom. Hand amputation can prevent a person from performing their daily activities. In that event, finding a suitable, fast, and reliable alternative for the missing limb can affect the lives of people who suffer from such conditions. As the most important use of the hands is to grasp objects, the purpose of this study is to accurately predict gripping force from surface electromyography (sEMG) signals during a pinch-type grip. In that regard, gripping force and sEMG signals are derived from 10 healthy subjects. Results show that for this task, recurrent networks outperform nonrecurrent ones, such as a fully connected multilayer perceptron (MLP) network. Gated recurrent unit (GRU) and long short-term memory (LSTM) networks can predict the gripping force with R-squared values of 0.994 and 0.992, respectively, and a prediction rate of over 1300 predictions per second. The predominant advantage of using such frameworks is that the gripping force can be predicted straight from preprocessed sEMG signals without any form of feature extraction, not to mention the ability to predict future force values using larger prediction horizons adequately. The methods presented in this study can be used in the myoelectric control of prosthetic hands or robotic grippers. ",
    "url": "https://arxiv.org/abs/2302.09555",
    "authors": [
      "Atusa Ghorbani",
      "Aghil Yousefi-Koma",
      "Amirhosein Vedadi"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.09565",
    "title": "Optimizing YOLOv7 for Semiconductor Defect Detection",
    "abstract": "The field of object detection using Deep Learning (DL) is constantly evolving with many new techniques and models being proposed. YOLOv7 is a state-of-the-art object detector based on the YOLO family of models which have become popular for industrial applications. One such possible application domain can be semiconductor defect inspection. The performance of any machine learning model depends on its hyperparameters. Furthermore, combining predictions of one or more models in different ways can also affect performance. In this research, we experiment with YOLOv7, a recently proposed, state-of-the-art object detector, by training and evaluating models with different hyperparameters to investigate which ones improve performance in terms of detection precision for semiconductor line space pattern defects. The base YOLOv7 model with default hyperparameters and Non Maximum Suppression (NMS) prediction combining outperforms all RetinaNet models from previous work in terms of mean Average Precision (mAP). We find that vertically flipping images randomly during training yields a 3% improvement in the mean AP of all defect classes. Other hyperparameter values improved AP only for certain classes compared to the default model. Combining models that achieve the best AP for different defect classes was found to be an effective ensembling strategy. Combining predictions from ensembles using Weighted Box Fusion (WBF) prediction gave the best performance. The best ensemble with WBF improved on the mAP of the default model by 10%. ",
    "url": "https://arxiv.org/abs/2302.09565",
    "authors": [
      "Enrique Dehaerne",
      "Bappaditya Dey",
      "Sandip Halder",
      "Stefan De Gendt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09575",
    "title": "Stationary Point Losses for Robust Model",
    "abstract": "The inability to guarantee robustness is one of the major obstacles to the application of deep learning models in security-demanding domains. We identify that the most commonly used cross-entropy (CE) loss does not guarantee robust boundary for neural networks. CE loss sharpens the neural network at the decision boundary to achieve a lower loss, rather than pushing the boundary to a more robust position. A robust boundary should be kept in the middle of samples from different classes, thus maximizing the margins from the boundary to the samples. We think this is due to the fact that CE loss has no stationary point. In this paper, we propose a family of new losses, called stationary point (SP) loss, which has at least one stationary point on the correct classification side. We proved that robust boundary can be guaranteed by SP loss without losing much accuracy. With SP loss, larger perturbations are required to generate adversarial examples. We demonstrate that robustness is improved under a variety of adversarial attacks by applying SP loss. Moreover, robust boundary learned by SP loss also performs well on imbalanced datasets. ",
    "url": "https://arxiv.org/abs/2302.09575",
    "authors": [
      "Weiwei Gao",
      "Dazhi Zhang",
      "Yao Li",
      "Zhichang Guo",
      "Ovanes Petrosian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09578",
    "title": "On Feasibility of Server-side Backdoor Attacks on Split Learning",
    "abstract": "Split learning is a collaborative learning design that allows several participants (clients) to train a shared model while keeping their datasets private. Recent studies demonstrate that collaborative learning models, specifically federated learning, are vulnerable to security and privacy attacks such as model inference and backdoor attacks. Backdoor attacks are a group of poisoning attacks in which the attacker tries to control the model output by manipulating the model's training process. While there have been studies regarding inference attacks on split learning, it has not yet been tested for backdoor attacks. This paper performs a novel backdoor attack on split learning and studies its effectiveness. Despite traditional backdoor attacks done on the client side, we inject the backdoor trigger from the server side. For this purpose, we provide two attack methods: one using a surrogate client and another using an autoencoder to poison the model via incoming smashed data and its outgoing gradient toward the innocent participants. We did our experiments using three model architectures and three publicly available datasets in the image domain and ran a total of 761 experiments to evaluate our attack methods. The results show that despite using strong patterns and injection methods, split learning is highly robust and resistant to such poisoning attacks. While we get the attack success rate of 100% as our best result for the MNIST dataset, in most of the other cases, our attack shows little success when increasing the cut layer. ",
    "url": "https://arxiv.org/abs/2302.09578",
    "authors": [
      "Behrad Tajalli",
      "Oguzhan Ersoy",
      "Stjepan Picek"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09582",
    "title": "Human Emotion Knowledge Representation Emerges in Large Language Models  and Supports Discrete Emotion Inference",
    "abstract": "How humans infer discrete emotions is a fundamental research question in the field of psychology. While conceptual knowledge about emotions (emotion knowledge) has been suggested to be essential for emotion inference, evidence to date is mostly indirect and inconclusive. As the large language models (LLMs) have been shown to support effective representations of various human conceptual knowledge, the present study further employed artificial neurons in LLMs to investigate the mechanism of human emotion inference. With artificial neurons activated by prompts, the LLM (RoBERTa) demonstrated a similar conceptual structure of 27 discrete emotions as that of human behaviors. Furthermore, the LLM-based conceptual structure revealed a human-like reliance on 14 underlying conceptual attributes of emotions for emotion inference. Most importantly, by manipulating attribute-specific neurons, we found that the corresponding LLM's emotion inference performance deteriorated, and the performance deterioration was correlated to the effectiveness of representations of the conceptual attributes on the human side. Our findings provide direct evidence for the emergence of emotion knowledge representation in large language models and suggest its casual support for discrete emotion inference. ",
    "url": "https://arxiv.org/abs/2302.09582",
    "authors": [
      "Ming Li",
      "Yusheng Su",
      "Hsiu-Yuan Huang",
      "Jiali Cheng",
      "Xin Hu",
      "Xinmiao Zhang",
      "Huadong Wang",
      "Yujia Qin",
      "Xiaozhi Wang",
      "Zhiyuan Liu",
      "Dan Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.09584",
    "title": "DGP-Net: Dense Graph Prototype Network for Few-Shot SAR Target  Recognition",
    "abstract": "The inevitable feature deviation of synthetic aperture radar (SAR) image due to the special imaging principle (depression angle variation) leads to poor recognition accuracy, especially in few-shot learning (FSL). To deal with this problem, we propose a dense graph prototype network (DGP-Net) to eliminate the feature deviation by learning potential features, and classify by learning feature distribution. The role of the prototype in this model is to solve the problem of large distance between congeneric samples taken due to the contingency of single sampling in FSL, and enhance the robustness of the model. Experimental results on the MSTAR dataset show that the DGP-Net has good classification results for SAR images with different depression angles and the recognition accuracy of it is higher than typical FSL methods. ",
    "url": "https://arxiv.org/abs/2302.09584",
    "authors": [
      "Xiangyu Zhou",
      "Qianru Wei",
      "Yuhui Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09585",
    "title": "FusionMotion: Multi-Sensor Asynchronous Fusion for Continuous Occupancy  Prediction via Neural-ODE",
    "abstract": "Occupancy maps are widely recognized as an efficient method for facilitating robot motion planning in static environments. However, for intelligent vehicles, occupancy of both the present and future moments is required to ensure safe driving. In the automotive industry, the accurate and continuous prediction of future occupancy maps in traffic scenarios remains a formidable challenge. This paper investigates multi-sensor spatio-temporal fusion strategies for continuous occupancy prediction in a systematic manner. This paper presents FusionMotion, a novel bird's eye view (BEV) occupancy predictor which is capable of achieving the fusion of asynchronous multi-sensor data and predicting the future occupancy map with variable time intervals and temporal horizons. Remarkably, FusionMotion features the adoption of neural ordinary differential equations on recurrent neural networks for occupancy prediction. FusionMotion learns derivatives of BEV features over temporal horizons, updates the implicit sensor's BEV feature measurements and propagates future states for each ODE step. Extensive experiments on large-scale nuScenes and Lyft L5 datasets demonstrate that FusionMotion significantly outperforms previous methods. In addition, it outperforms the BEVFusion-style fusion strategy on the Lyft L5 dataset while reducing synchronization requirements. Codes and models will be made available. ",
    "url": "https://arxiv.org/abs/2302.09585",
    "authors": [
      "Yining Shi",
      "Kun Jiang",
      "Ke Wang",
      "Jiusi Li",
      "Yunlong Wang",
      "Diange Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09587",
    "title": "On the Reliability and Explainability of Automated Code Generation  Approaches",
    "abstract": "Automatic code generation, the task of generating new code snippets from existing code or comments, has long been of interest. Numerous code generation models have been proposed and proven on different benchmark datasets. However, little is known about whether this objective has been achieved and why code generation models effectively transform code sequences automatically. In other words, can we totally trust these automated code generation models? Consequently, there is a pressing need to understand the inner logic of code generation models and to investigate their replicability, reliability, and explainability. To bridge these research gaps, we conduct a thorough empirical study of five code generation models on four representative code generation datasets to assess the limits and capabilities of automatic code generation approaches. We further employ advanced explainable AI approaches to highlight the tokens that significantly contribute to the code generation. Experiments demonstrate that we successfully replicate state-of-the-art code generation approaches. We discover that state-of-the-art approaches suffer from severe data duplication and input insensitivity, which are subtle issues with significant implications. Our explainability analysis reveals that, in various experimental scenarios, code generation models can recognize code grammar and structural information, but can not capture key tokens that need to be updated. Our results draw several lessons and guidelines for future work in this area. ",
    "url": "https://arxiv.org/abs/2302.09587",
    "authors": [
      "Yue Liu",
      "Chakkrit Tantithamthavorn",
      "Yonghui Liu",
      "Li Li"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2302.09605",
    "title": "Efficient Communication via Self-supervised Information Aggregation for  Online and Offline Multi-agent Reinforcement Learning",
    "abstract": "Utilizing messages from teammates can improve coordination in cooperative Multi-agent Reinforcement Learning (MARL). Previous works typically combine raw messages of teammates with local information as inputs for policy. However, neglecting message aggregation poses significant inefficiency for policy learning. Motivated by recent advances in representation learning, we argue that efficient message aggregation is essential for good coordination in cooperative MARL. In this paper, we propose Multi-Agent communication via Self-supervised Information Aggregation (MASIA), where agents can aggregate the received messages into compact representations with high relevance to augment the local policy. Specifically, we design a permutation invariant message encoder to generate common information-aggregated representation from messages and optimize it via reconstructing and shooting future information in a self-supervised manner. Hence, each agent would utilize the most relevant parts of the aggregated representation for decision-making by a novel message extraction mechanism. Furthermore, considering the potential of offline learning for real-world applications, we build offline benchmarks for multi-agent communication, which is the first as we know. Empirical results demonstrate the superiority of our method in both online and offline settings. We also release the built offline benchmarks in this paper as a testbed for communication ability validation to facilitate further future research. ",
    "url": "https://arxiv.org/abs/2302.09605",
    "authors": [
      "Cong Guan",
      "Feng Chen",
      "Lei Yuan",
      "Zongzhang Zhang",
      "Yang Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2302.09624",
    "title": "On the $f$-Differential Privacy Guarantees of Discrete-Valued Mechanisms",
    "abstract": "We consider a federated data analytics problem in which a server coordinates the collaborative data analysis of multiple users with privacy concerns and limited communication capability. The commonly adopted compression schemes introduce information loss into local data while improving communication efficiency, and it remains an open question whether such discrete-valued mechanisms provide any privacy protection. Considering that differential privacy has become the gold standard for privacy measures due to its simple implementation and rigorous theoretical foundation, in this paper, we study the privacy guarantees of discrete-valued mechanisms with finite output space in the lens of $f$-differential privacy (DP). By interpreting the privacy leakage as a hypothesis testing problem, we derive the closed-form expression of the tradeoff between type I and type II error rates, based on which the $f$-DP guarantees of a variety of discrete-valued mechanisms, including binomial mechanisms, sign-based methods, and ternary-based compressors, are characterized. We further investigate the Byzantine resilience of binomial mechanisms and ternary compressors and characterize the tradeoff among differential privacy, Byzantine resilience, and communication efficiency. Finally, we discuss the application of the proposed method to differentially private stochastic gradient descent in federated learning. ",
    "url": "https://arxiv.org/abs/2302.09624",
    "authors": [
      "Richeng Jin",
      "Zhonggen Su",
      "Caijun Zhong",
      "Zhaoyang Zhang",
      "Tony Quek",
      "Huaiyu Dai"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09628",
    "title": "Energy Efficient Homes: The Social and Spatial Patterns of Residential  Energy Efficiency in England",
    "abstract": "Poor energy efficiency of homes is a major problem with urgent environmental and social implications. Housing in the UK relies heavily on fossil fuels for energy supply and has some of the lowest energy efficiency in Europe. We explore spatial variations in energy efficiency across England using data from Energy Performance Certificates (EPCs), which cover approximately half of the residential stock (14M homes between 2008-22). We examine variations between authorities after accounting for the composition of the housing stock in terms of its fixed characteristics of property type, building age and size. We explore variations in terms of geographical and social context (region, urban-rural and deprivation), which gives a picture of the scale of the challenge each faces. We also examine variations in relation to the more readily upgraded factors, such as glazing types, and in relation to local participation in improvement programmes which gives some insight into local actions or progress achieved. ",
    "url": "https://arxiv.org/abs/2302.09628",
    "authors": [
      "Boyana Buyuklieva",
      "Adam Dennett",
      "Nick Bailey",
      "Jeremy Morley"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2302.09636",
    "title": "Interpretable Medical Image Visual Question Answering via Multi-Modal  Relationship Graph Learning",
    "abstract": "Medical visual question answering (VQA) aims to answer clinically relevant questions regarding input medical images. This technique has the potential to improve the efficiency of medical professionals while relieving the burden on the public health system, particularly in resource-poor countries. Existing medical VQA methods tend to encode medical images and learn the correspondence between visual features and questions without exploiting the spatial, semantic, or medical knowledge behind them. This is partially because of the small size of the current medical VQA dataset, which often includes simple questions. Therefore, we first collected a comprehensive and large-scale medical VQA dataset, focusing on chest X-ray images. The questions involved detailed relationships, such as disease names, locations, levels, and types in our dataset. Based on this dataset, we also propose a novel baseline method by constructing three different relationship graphs: spatial relationship, semantic relationship, and implicit relationship graphs on the image regions, questions, and semantic labels. The answer and graph reasoning paths are learned for different questions. ",
    "url": "https://arxiv.org/abs/2302.09636",
    "authors": [
      "Xinyue Hu",
      "Lin Gu",
      "Kazuma Kobayashi",
      "Qiyuan An",
      "Qingyu Chen",
      "Zhiyong Lu",
      "Chang Su",
      "Tatsuya Harada",
      "Yingying Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09650",
    "title": "Scaling Laws for Multilingual Neural Machine Translation",
    "abstract": "In this work, we provide a large-scale empirical study of the scaling properties of multilingual neural machine translation models. We examine how increases in the model size affect the model performance and investigate the role of the training mixture composition on the scaling behavior. We find that changing the weightings of the individual language pairs in the training mixture only affect the multiplicative factor of the scaling law. In particular, we observe that multilingual models trained using different mixing rates all exhibit the same scaling exponent. Through a novel joint scaling law formulation, we compute the effective number of parameters allocated to each language pair and examine the role of language similarity in the scaling behavior of our models. We find little evidence that language similarity has any impact. In contrast, the direction of the multilinguality plays a significant role, with models translating from multiple languages into English having a larger number of effective parameters per task than their reversed counterparts. Finally, we leverage our observations to predict the performance of multilingual models trained with any language weighting at any scale, significantly reducing efforts required for language balancing in large multilingual models. Our findings apply to both in-domain and out-of-domain test sets and to multiple evaluation metrics, such as ChrF and BLEURT. ",
    "url": "https://arxiv.org/abs/2302.09650",
    "authors": [
      "Patrick Fernandes",
      "Behrooz Ghorbani",
      "Xavier Garcia",
      "Markus Freitag",
      "Orhan Firat"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09652",
    "title": "Communication-Efficient Distributed Graph Clustering and Sparsification  under Duplication Models",
    "abstract": "In this paper, we consider the problem of clustering graph nodes and sparsifying graph edges over distributed graphs, when graph edges with possibly edge duplicates are observed at physically remote sites. Although edge duplicates across different sites appear to be beneficial at the first glance, in fact they could make the clustering and sparsification more complicated since potentially their processing would need extra computations and communications. We propose the first communication-optimal algorithms for two well-established communication models namely the message passing and the blackboard models. Specifically, given a graph on $n$ nodes with edges observed at $s$ sites, our algorithms achieve communication costs $\\tilde{O}(ns)$ and $\\tilde{O}(n+s)$ ($\\tilde{O}$ hides a polylogarithmic factor), which almost match their lower bounds, $\\Omega(ns)$ and $\\Omega(n+s)$, in the message passing and the blackboard models respectively. The communication costs are asymptotically the same as those under non-duplication models, under an assumption on edge distribution. Our algorithms can also guarantee clustering quality nearly as good as that of centralizing all edges and then applying any standard clustering algorithm. Moreover, we perform the first investigation of distributed constructions of graph spanners in the blackboard model. We provide almost matching communication lower and upper bounds for both multiplicative and additive spanners. For example, the communication lower bounds of constructing a $(2k-1)$-spanner in the blackboard with and without duplication models are $\\Omega(s+n^{1+1/k}\\log s)$ and $\\Omega(s+n^{1+1/k}\\max\\{1,s^{-1/2-1/(2k)}\\log s\\})$ respectively, which almost match the upper bound $\\tilde{O}(s+n^{1+1/k})$ for both models. ",
    "url": "https://arxiv.org/abs/2302.09652",
    "authors": [
      "Chun Jiang Zhu"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2302.09656",
    "title": "Imprecise Bayesian Neural Networks",
    "abstract": "Uncertainty quantification and robustness to distribution shifts are important goals in machine learning and artificial intelligence. Although Bayesian neural networks (BNNs) allow for uncertainty in the predictions to be assessed, different sources of uncertainty are indistinguishable. We present imprecise Bayesian neural networks (IBNNs); they generalize and overcome some of the drawbacks of standard BNNs. These latter are trained using a single prior and likelihood distributions, whereas IBNNs are trained using credal prior and likelihood sets. They allow to distinguish between aleatoric and epistemic uncertainties, and to quantify them. In addition, IBNNs are robust in the sense of Bayesian sensitivity analysis, and are more robust than BNNs to distribution shift. They can also be used to compute sets of outcomes that enjoy PAC-like properties. We apply IBNNs to two case studies. One, to model blood glucose and insulin dynamics for artificial pancreas control, and two, for motion prediction in autonomous driving scenarios. We show that IBNNs performs better when compared to an ensemble of BNNs benchmark. ",
    "url": "https://arxiv.org/abs/2302.09656",
    "authors": [
      "Michele Caprio",
      "Souradeep Dutta",
      "Kuk Jin Jang",
      "Vivian Lin",
      "Radoslav Ivanov",
      "Oleg Sokolsky",
      "Insup Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.09657",
    "title": "Table Tennis Stroke Detection and Recognition Using Ball Trajectory Data",
    "abstract": "In this work, the novel task of detecting and classifying table tennis strokes solely using the ball trajectory has been explored. A single camera setup positioned in the umpire's view has been employed to procure a dataset consisting of six stroke classes executed by four professional table tennis players. Ball tracking using YOLOv4, a traditional object detection model, and TrackNetv2, a temporal heatmap based model, have been implemented on our dataset and their performances have been benchmarked. A mathematical approach developed to extract temporal boundaries of strokes using the ball trajectory data yielded a total of 2023 valid strokes in our dataset, while also detecting services and missed strokes successfully. The temporal convolutional network developed performed stroke recognition on completely unseen data with an accuracy of 87.155%. Several machine learning and deep learning based model architectures have been trained for stroke recognition using ball trajectory input and benchmarked based on their performances. While stroke recognition in the field of table tennis has been extensively explored based on human action recognition using video data focused on the player's actions, the use of ball trajectory data for the same is an unexplored characteristic of the sport. Hence, the motivation behind the work is to demonstrate that meaningful inferences such as stroke detection and recognition can be drawn using minimal input information. ",
    "url": "https://arxiv.org/abs/2302.09657",
    "authors": [
      "Kaustubh Milind Kulkarni",
      "Rohan S Jamadagni",
      "Jeffrey Aaron Paul",
      "Sucheth Shenoy"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09694",
    "title": "Disentangled Representation for Causal Mediation Analysis",
    "abstract": "Estimating direct and indirect causal effects from observational data is crucial to understanding the causal mechanisms and predicting the behaviour under different interventions. Causal mediation analysis is a method that is often used to reveal direct and indirect effects. Deep learning shows promise in mediation analysis, but the current methods only assume latent confounders that affect treatment, mediator and outcome simultaneously, and fail to identify different types of latent confounders (e.g., confounders that only affect the mediator or outcome). Furthermore, current methods are based on the sequential ignorability assumption, which is not feasible for dealing with multiple types of latent confounders. This work aims to circumvent the sequential ignorability assumption and applies the piecemeal deconfounding assumption as an alternative. We propose the Disentangled Mediation Analysis Variational AutoEncoder (DMAVAE), which disentangles the representations of latent confounders into three types to accurately estimate the natural direct effect, natural indirect effect and total effect. Experimental results show that the proposed method outperforms existing methods and has strong generalisation ability. We further apply the method to a real-world dataset to show its potential application. ",
    "url": "https://arxiv.org/abs/2302.09694",
    "authors": [
      "Ziqi Xu",
      "Debo Cheng",
      "Jiuyong Li",
      "Jixue Liu",
      "Lin Liu",
      "Ke Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2302.09704",
    "title": "A Differentiable Signed Distance Representation for Continuous Collision  Avoidance in Optimization-Based Motion Planning",
    "abstract": "This paper proposes a new set of conditions for exactly representing collision avoidance constraints within optimization-based motion planning algorithms. The conditions are continuously differentiable and therefore suitable for use with standard nonlinear optimization solvers. The method represents convex shapes using a support function representation and is therefore quite general. For collision avoidance involving polyhedral or ellipsoidal shapes, the proposed method introduces fewer variables and constraints than existing approaches. Additionally the proposed method can be used to rigorously ensure continuous collision avoidance as the vehicle transitions between the discrete poses determined by the motion planning algorithm. Numerical examples demonstrate how this can be used to prevent problems of corner cutting and passing through obstacles which can occur when collision avoidance is only enforced at discrete time steps. ",
    "url": "https://arxiv.org/abs/2302.09704",
    "authors": [
      "James Guthrie"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2302.09706",
    "title": "Efficient Algorithms for Boundary Defense with Heterogeneous Defenders",
    "abstract": "This paper studies the problem of defending (1D and 2D) boundaries against a large number of continuous attacks with a heterogeneous group of defenders. The defender team has perfect information of the attack events within some time (finite or infinite) horizon, with the goal of intercepting as many attacks as possible. An attack is considered successfully intercepted if a defender is present at the boundary location when and where the attack happens. Through proposing a network-flow and integer programming-based method for computing optimal solutions, and an exhaustive defender pairing heuristic method for computing near-optimal solutions, we are able to significantly reduce the computation burden in solving the problem in comparison to the previous state of the art. Extensive simulation experiments confirm the effectiveness of the algorithms. Leveraging our efficient methods, we also characterize the solution structures, revealing the relationships between the attack interception rate and the various problem parameters, e.g., the heterogeneity of the defenders, attack rate, boundary topology, and the look-ahead horizon. ",
    "url": "https://arxiv.org/abs/2302.09706",
    "authors": [
      "Si Wei Feng",
      "Jingjin Yu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.09731",
    "title": "CMVAE: Causal Meta VAE for Unsupervised Meta-Learning",
    "abstract": "Unsupervised meta-learning aims to learn the meta knowledge from unlabeled data and rapidly adapt to novel tasks. However, existing approaches may be misled by the context-bias (e.g. background) from the training data. In this paper, we abstract the unsupervised meta-learning problem into a Structural Causal Model (SCM) and point out that such bias arises due to hidden confounders. To eliminate the confounders, we define the priors are \\textit{conditionally} independent, learn the relationships between priors and intervene on them with casual factorization. Furthermore, we propose Causal Meta VAE (CMVAE) that encodes the priors into latent codes in the causal space and learns their relationships simultaneously to achieve the downstream few-shot image classification task. Results on toy datasets and three benchmark datasets demonstrate that our method can remove the context-bias and it outperforms other state-of-the-art unsupervised meta-learning algorithms because of bias-removal. Code is available at \\url{https://github.com/GuodongQi/CMVAE} ",
    "url": "https://arxiv.org/abs/2302.09731",
    "authors": [
      "Guodong Qi",
      "Huimin Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09743",
    "title": "Dynamic Optimal Control: A Real-Time Control Optimization Algorithm for  Dynamic Networks",
    "abstract": "Real-world complex network systems often experience changes over time, and controlling their state has important applications in various fields. While external control signals can drive static networks to a desired state, dynamic networks have varying topologies that require changes to the driver nodes for maintaining control. Most existing approaches require knowledge of topological changes in advance to compute optimal control schemes. However, obtaining such knowledge can be difficult for many real-world dynamic networks. To address this issue, we propose a novel real-time control optimization algorithm called Dynamic Optimal Control (DOC) that predicts node control importance using historical information to minimize control scheme changes and reduce overall control cost. We design an efficient algorithm that fine-tunes the current control scheme by repairing past maximum matching to respond to changes in the network topology. Our experiments on real and synthetic dynamic networks show that DOC significantly reduces control cost and achieves more stable and focused real-time control schemes compared to traditional algorithms. The proposed algorithm has the potential to provide solutions for real-time control of complex dynamic systems in various fields. ",
    "url": "https://arxiv.org/abs/2302.09743",
    "authors": [
      "Chunyu Pan",
      "Zhao Su",
      "Changsheng Zhang",
      "Xizhe Zhang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2302.09748",
    "title": "Quantifying uncertainty for deep learning based forecasting and  flow-reconstruction using neural architecture search ensembles",
    "abstract": "Classical problems in computational physics such as data-driven forecasting and signal reconstruction from sparse sensors have recently seen an explosion in deep neural network (DNN) based algorithmic approaches. However, most DNN models do not provide uncertainty estimates, which are crucial for establishing the trustworthiness of these techniques in downstream decision making tasks and scenarios. In recent years, ensemble-based methods have achieved significant success for the uncertainty quantification in DNNs on a number of benchmark problems. However, their performance on real-world applications remains under-explored. In this work, we present an automated approach to DNN discovery and demonstrate how this may also be utilized for ensemble-based uncertainty quantification. Specifically, we propose the use of a scalable neural and hyperparameter architecture search for discovering an ensemble of DNN models for complex dynamical systems. We highlight how the proposed method not only discovers high-performing neural network ensembles for our tasks, but also quantifies uncertainty seamlessly. This is achieved by using genetic algorithms and Bayesian optimization for sampling the search space of neural network architectures and hyperparameters. Subsequently, a model selection approach is used to identify candidate models for an ensemble set construction. Afterwards, a variance decomposition approach is used to estimate the uncertainty of the predictions from the ensemble. We demonstrate the feasibility of this framework for two tasks - forecasting from historical data and flow reconstruction from sparse sensors for the sea-surface temperature. We demonstrate superior performance from the ensemble in contrast with individual high-performing models and other benchmarks. ",
    "url": "https://arxiv.org/abs/2302.09748",
    "authors": [
      "Romit Maulik",
      "Romain Egele",
      "Krishnan Raghavan",
      "Prasanna Balaprakash"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2302.09757",
    "title": "Continuous Time Analysis of Dynamic Matching in Heterogeneous Networks",
    "abstract": "This paper addresses the problem of dynamic matching in heterogeneous networks, where agents are subject to compatibility restrictions and stochastic arrival and departure times. In particular, we consider networks with one type of easy-to-match agents and multiple types of hard-to-match agents, each subject to its own set of compatibility constraints. Such a setting arises in many real-world applications, including kidney exchange programs and carpooling platforms, where some participants may have more stringent compatibility requirements than others. We introduce a novel approach to modeling dynamic matching by establishing ordinary differential equation (ODE) models, offering a new perspective for evaluating various matching algorithms. We study two algorithms, the Greedy Algorithm and the Patient Algorithm, which prioritize the matching of compatible hard-to-match agents over easy-to-match agents in heterogeneous networks. Our results show the trade-off between the conflicting goals of matching agents quickly and optimally, offering insights into the design of real-world dynamic matching systems. We present simulations and a real-world case study using data from the Organ Procurement and Transplantation Network to validate theoretical predictions. ",
    "url": "https://arxiv.org/abs/2302.09757",
    "authors": [
      "Xiaowu Dai",
      "Hengzhi He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.09775",
    "title": "Persian topic detection based on Human Word association and graph  embedding",
    "abstract": "In this paper, we propose a framework to detect topics in social media based on Human Word Association. Identifying topics discussed in these media has become a critical and significant challenge. Most of the work done in this area is in English, but much has been done in the Persian language, especially microblogs written in Persian. Also, the existing works focused more on exploring frequent patterns or semantic relationships and ignored the structural methods of language. In this paper, a topic detection framework using HWA, a method for Human Word Association, is proposed. This method uses the concept of imitation of mental ability for word association. This method also calculates the Associative Gravity Force that shows how words are related. Using this parameter, a graph can be generated. The topics can be extracted by embedding this graph and using clustering methods. This approach has been applied to a Persian language dataset collected from Telegram. Several experimental studies have been performed to evaluate the proposed framework's performance. Experimental results show that this approach works better than other topic detection methods. ",
    "url": "https://arxiv.org/abs/2302.09775",
    "authors": [
      "Mehrdad Ranjbar-Khadivi",
      "Shahin Akbarpour",
      "Mohammad-Reza Feizi-Derakhshi",
      "Babak Anari"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.09779",
    "title": "Incremental Few-Shot Object Detection via Simple Fine-Tuning Approach",
    "abstract": "In this paper, we explore incremental few-shot object detection (iFSD), which incrementally learns novel classes using only a few examples without revisiting base classes. Previous iFSD works achieved the desired results by applying meta-learning. However, meta-learning approaches show insufficient performance that is difficult to apply to practical problems. In this light, we propose a simple fine-tuning-based approach, the Incremental Two-stage Fine-tuning Approach (iTFA) for iFSD, which contains three steps: 1) base training using abundant base classes with the class-agnostic box regressor, 2) separation of the RoI feature extractor and classifier into the base and novel class branches for preserving base knowledge, and 3) fine-tuning the novel branch using only a few novel class examples. We evaluate our iTFA on the real-world datasets PASCAL VOC, COCO, and LVIS. iTFA achieves competitive performance in COCO and shows a 30% higher AP accuracy than meta-learning methods in the LVIS dataset. Experimental results show the effectiveness and applicability of our proposed method. ",
    "url": "https://arxiv.org/abs/2302.09779",
    "authors": [
      "Tae-Min Choi",
      "Jong-Hwan Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.09789",
    "title": "Self-Supervised Monocular Depth Estimation with Self-Reference  Distillation and Disparity Offset Refinement",
    "abstract": "Monocular depth estimation plays a fundamental role in computer vision. Due to the costly acquisition of depth ground truth, self-supervised methods that leverage adjacent frames to establish a supervisory signal have emerged as the most promising paradigms. In this work, we propose two novel ideas to improve self-supervised monocular depth estimation: 1) self-reference distillation and 2) disparity offset refinement. Specifically, we use a parameter-optimized model as the teacher updated as the training epochs to provide additional supervision during the training process. The teacher model has the same structure as the student model, with weights inherited from the historical student model. In addition, a multiview check is introduced to filter out the outliers produced by the teacher model. Furthermore, we leverage the contextual consistency between high-scale and low-scale features to obtain multiscale disparity offsets, which are used to refine the disparity output incrementally by aligning disparity information at different scales. The experimental results on the KITTI and Make3D datasets show that our method outperforms previous state-of-the-art competitors. ",
    "url": "https://arxiv.org/abs/2302.09789",
    "authors": [
      "Zhong Liu",
      "Ran Li",
      "Shuwei Shao",
      "Xingming Wu",
      "Weihai Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09790",
    "title": "HTNet: Human Topology Aware Network for 3D Human Pose Estimation",
    "abstract": "3D human pose estimation errors would propagate along the human body topology and accumulate at the end joints of limbs. Inspired by the backtracking mechanism in automatic control systems, we design an Intra-Part Constraint module that utilizes the parent nodes as the reference to build topological constraints for end joints at the part level. Further considering the hierarchy of the human topology, joint-level and body-level dependencies are captured via graph convolutional networks and self-attentions, respectively. Based on these designs, we propose a novel Human Topology aware Network (HTNet), which adopts a channel-split progressive strategy to sequentially learn the structural priors of the human topology from multiple semantic levels: joint, part, and body. Extensive experiments show that the proposed method improves the estimation accuracy by 18.7% on the end joints of limbs and achieves state-of-the-art results on Human3.6M and MPI-INF-3DHP datasets. Code is available at https://github.com/vefalun/HTNet. ",
    "url": "https://arxiv.org/abs/2302.09790",
    "authors": [
      "Jialun Cai",
      "Hong Liu",
      "Runwei Ding",
      "Wenhao Li",
      "Jianbing Wu",
      "Miaoju Ban"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09794",
    "title": "Two-stream Decoder Feature Normality Estimating Network for Industrial  Anomaly Detection",
    "abstract": "Image reconstruction-based anomaly detection has recently been in the spotlight because of the difficulty of constructing anomaly datasets. These approaches work by learning to model normal features without seeing abnormal samples during training and then discriminating anomalies at test time based on the reconstructive errors. However, these models have limitations in reconstructing the abnormal samples due to their indiscriminate conveyance of features. Moreover, these approaches are not explicitly optimized for distinguishable anomalies. To address these problems, we propose a two-stream decoder network (TSDN), designed to learn both normal and abnormal features. Additionally, we propose a feature normality estimator (FNE) to eliminate abnormal features and prevent high-quality reconstruction of abnormal regions. Evaluation on a standard benchmark demonstrated performance better than state-of-the-art models. ",
    "url": "https://arxiv.org/abs/2302.09794",
    "authors": [
      "Chaewon Park",
      "Minhyeok Lee",
      "Suhwan Cho",
      "Donghyeong Kim",
      "Sangyoun Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09800",
    "title": "CNTS: Cooperative Network for Time Series",
    "abstract": "The use of deep learning techniques in detecting anomalies in time series data has been an active area of research with a long history of development and a variety of approaches. In particular, reconstruction-based unsupervised anomaly detection methods have gained popularity due to their intuitive assumptions and low computational requirements. However, these methods are often susceptible to outliers and do not effectively model anomalies, leading to suboptimal results. This paper presents a novel approach for unsupervised anomaly detection, called the Cooperative Network Time Series (CNTS) approach. The CNTS system consists of two components: a detector and a reconstructor. The detector is responsible for directly detecting anomalies, while the reconstructor provides reconstruction information to the detector and updates its learning based on anomalous information received from the detector. The central aspect of CNTS is a multi-objective optimization problem, which is solved through a cooperative solution strategy. Experiments on three real-world datasets demonstrate the state-of-the-art performance of CNTS and confirm the cooperative effectiveness of the detector and reconstructor. The source code for this study is publicly available on GitHub. ",
    "url": "https://arxiv.org/abs/2302.09800",
    "authors": [
      "Jinsheng Yang",
      "Yuanhai Shao",
      "ChunNa Li"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09808",
    "title": "RecFNO: a resolution-invariant flow and heat field reconstruction method  from sparse observations via Fourier neural operator",
    "abstract": "Perception of the full state is an essential technology to support the monitoring, analysis, and design of physical systems, one of whose challenges is to recover global field from sparse observations. Well-known for brilliant approximation ability, deep neural networks have been attractive to data-driven flow and heat field reconstruction studies. However, limited by network structure, existing researches mostly learn the reconstruction mapping in finite-dimensional space and has poor transferability to variable resolution of outputs. In this paper, we extend the new paradigm of neural operator and propose an end-to-end physical field reconstruction method with both excellent performance and mesh transferability named RecFNO. The proposed method aims to learn the mapping from sparse observations to flow and heat field in infinite-dimensional space, contributing to a more powerful nonlinear fitting capacity and resolution-invariant characteristic. Firstly, according to different usage scenarios, we develop three types of embeddings to model the sparse observation inputs: MLP, mask, and Voronoi embedding. The MLP embedding is propitious to more sparse input, while the others benefit from spatial information preservation and perform better with the increase of observation data. Then, we adopt stacked Fourier layers to reconstruct physical field in Fourier space that regularizes the overall recovered field by Fourier modes superposition. Benefiting from the operator in infinite-dimensional space, the proposed method obtains remarkable accuracy and better resolution transferability among meshes. The experiments conducted on fluid mechanics and thermology problems show that the proposed method outperforms existing POD-based and CNN-based methods in most cases and has the capacity to achieve zero-shot super-resolution. ",
    "url": "https://arxiv.org/abs/2302.09808",
    "authors": [
      "Xiaoyu Zhao",
      "Xiaoqian Chen",
      "Zhiqiang Gong",
      "Weien Zhou",
      "Wen Yao",
      "Yunyang Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2302.09814",
    "title": "Pseudo Label-Guided Model Inversion Attack via Conditional Generative  Adversarial Network",
    "abstract": "Model inversion (MI) attacks have raised increasing concerns about privacy, which can reconstruct training data from public models. Indeed, MI attacks can be formalized as an optimization problem that seeks private data in a certain space. Recent MI attacks leverage a generative adversarial network (GAN) as an image prior to narrow the search space, and can successfully reconstruct even the high-dimensional data (e.g., face images). However, these generative MI attacks do not fully exploit the potential capabilities of the target model, still leading to a vague and coupled search space, i.e., different classes of images are coupled in the search space. Besides, the widely used cross-entropy loss in these attacks suffers from gradient vanishing. To address these problems, we propose Pseudo Label-Guided MI (PLG-MI) attack via conditional GAN (cGAN). At first, a top-n selection strategy is proposed to provide pseudo-labels for public data, and use pseudo-labels to guide the training of the cGAN. In this way, the search space is decoupled for different classes of images. Then a max-margin loss is introduced to improve the search process on the subspace of a target class. Extensive experiments demonstrate that our PLG-MI attack significantly improves the attack success rate and visual quality for various datasets and models, notably, 2~3 $\\times$ better than state-of-the-art attacks under large distributional shifts. Our code is available at: https://github.com/LetheSec/PLG-MI-Attack. ",
    "url": "https://arxiv.org/abs/2302.09814",
    "authors": [
      "Xiaojian Yuan",
      "Kejiang Chen",
      "Jie Zhang",
      "Weiming Zhang",
      "Nenghai Yu",
      "Yang Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09820",
    "title": "Improving User Controlled Table-To-Text Generation Robustness",
    "abstract": "In this work we study user controlled table-to-text generation where users explore the content in a table by selecting cells and reading a natural language description thereof automatically produce by a natural language generator. Such generation models usually learn from carefully selected cell combinations (clean cell selections); however, in practice users may select unexpected, redundant, or incoherent cell combinations (noisy cell selections). In experiments, we find that models perform well on test sets coming from the same distribution as the train data but their performance drops when evaluated on realistic noisy user inputs. We propose a fine-tuning regime with additional user-simulated noisy cell selections. Models fine-tuned with the proposed regime gain 4.85 BLEU points on user noisy test cases and 1.4 on clean test cases; and achieve comparable state-of-the-art performance on the ToTTo dataset. ",
    "url": "https://arxiv.org/abs/2302.09820",
    "authors": [
      "Hanxu Hu",
      "Yunqing Liu",
      "Zhongyi Yu",
      "Laura Perez-Beltrachini"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.09826",
    "title": "On the Expressivity of Persistent Homology in Graph Learning",
    "abstract": "Persistent homology, a technique from computational topology, has recently shown strong empirical performance in the context of graph classification. Being able to capture long range graph properties via higher-order topological features, such as cycles of arbitrary length, in combination with multi-scale topological descriptors, has improved predictive performance for data sets with prominent topological structures, such as molecules. At the same time, the theoretical properties of persistent homology have not been formally assessed in this context. This paper intends to bridge the gap between computational topology and graph machine learning by providing a brief introduction to persistent homology in the context of graphs, as well as a theoretical discussion and empirical analysis of its expressivity for graph learning tasks. ",
    "url": "https://arxiv.org/abs/2302.09826",
    "authors": [
      "Bastian Rieck"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Algebraic Topology (math.AT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.09830",
    "title": "Weighted First Order Model Counting with Directed Acyclic Graph Axioms",
    "abstract": "Weighted First Order Model Counting (WFOMC) is the task of computing the weighted sum of the models of a first-order logic sentence. Probabilistic inference problems in many statistical relational learning frameworks can be cast as a WFOMC problem. However, in general, WFOMC is known to be intractable (#P_1- complete). Hence, logical fragments that admit polynomial time WFOMC are of significant interest. Such fragments are called domain liftable. Recent works have identified the two-variable fragment of first-order logic, extended with counting quantifiers, to be domain liftable. In this paper, we extend this fragment with a Directed Acyclic Graph axiom, i.e., a relation is interpreted as a Directed Acyclic Graph. ",
    "url": "https://arxiv.org/abs/2302.09830",
    "authors": [
      "Sagar Malhotra",
      "Luciano Serafini"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computational Complexity (cs.CC)",
      "Logic in Computer Science (cs.LO)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2302.09838",
    "title": "JNDMix: JND-Based Data Augmentation for No-reference Image Quality  Assessment",
    "abstract": "Despite substantial progress in no-reference image quality assessment (NR-IQA), previous training models often suffer from over-fitting due to the limited scale of used datasets, resulting in model performance bottlenecks. To tackle this challenge, we explore the potential of leveraging data augmentation to improve data efficiency and enhance model robustness. However, most existing data augmentation methods incur a serious issue, namely that it alters the image quality and leads to training images mismatching with their original labels. Additionally, although only a few data augmentation methods are available for NR-IQA task, their ability to enrich dataset diversity is still insufficient. To address these issues, we propose a effective and general data augmentation based on just noticeable difference (JND) noise mixing for NR-IQA task, named JNDMix. In detail, we randomly inject the JND noise, imperceptible to the human visual system (HVS), into the training image without any adjustment to its label. Extensive experiments demonstrate that JNDMix significantly improves the performance and data efficiency of various state-of-the-art NR-IQA models and the commonly used baseline models, as well as the generalization ability. More importantly, JNDMix facilitates MANIQA to achieve the state-of-the-art performance on LIVEC and KonIQ-10k. ",
    "url": "https://arxiv.org/abs/2302.09838",
    "authors": [
      "Jiamu Sheng",
      "Jiayuan Fan",
      "Peng Ye",
      "Jianjian Cao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09846",
    "title": "Neural Optimal Control using Learned System Dynamics",
    "abstract": "We study the problem of generating control laws for systems with unknown dynamics. Our approach is to represent the controller and the value function with neural networks, and to train them using loss functions adapted from the Hamilton-Jacobi-Bellman (HJB) equations. In the absence of a known dynamics model, our method first learns the state transitions from data collected by interacting with the system in an offline process. The learned transition function is then integrated to the HJB equations and used to forward simulate the control signals produced by our controller in a feedback loop. In contrast to trajectory optimization methods that optimize the controller for a single initial state, our controller can generate near-optimal control signals for initial states from a large portion of the state space. Compared to recent model-based reinforcement learning algorithms, we show that our method is more sample efficient and trains faster by an order of magnitude. We demonstrate our method in a number of tasks, including the control of a quadrotor with 12 state variables. ",
    "url": "https://arxiv.org/abs/2302.09846",
    "authors": [
      "Selim Engin",
      "Volkan Isler"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.09852",
    "title": "Unsupervised Layer-wise Score Aggregation for Textual OOD Detection",
    "abstract": "Out-of-distribution (OOD) detection is a rapidly growing field due to new robustness and security requirements driven by an increased number of AI-based systems. Existing OOD textual detectors often rely on an anomaly score (e.g., Mahalanobis distance) computed on the embedding output of the last layer of the encoder. In this work, we observe that OOD detection performance varies greatly depending on the task and layer output. More importantly, we show that the usual choice (the last layer) is rarely the best one for OOD detection and that far better results could be achieved if the best layer were picked. To leverage this observation, we propose a data-driven, unsupervised method to combine layer-wise anomaly scores. In addition, we extend classical textual OOD benchmarks by including classification tasks with a greater number of classes (up to 77), which reflects more realistic settings. On this augmented benchmark, we show that the proposed post-aggregation methods achieve robust and consistent results while removing manual feature selection altogether. Their performance achieves near oracle's best layer performance. ",
    "url": "https://arxiv.org/abs/2302.09852",
    "authors": [
      "Maxime Darrin",
      "Guillaume Staerman",
      "Eduardo Dadalto Câmara Gomes",
      "Jackie CK Cheung",
      "Pablo Piantanida",
      "Pierre Colombo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09859",
    "title": "Co-evolution of Social and Non-Social Guilt",
    "abstract": "Building ethical machines may involve bestowing upon them the emotional capacity to self-evaluate and repent on their actions. While reparative measures, such as apologies, are often considered as possible strategic interactions, the explicit evolution of the emotion of guilt as a behavioural phenotype is not yet well understood. Here, we study the co-evolution of social and non-social guilt of homogeneous or heterogeneous populations, including well-mixed, lattice and scale-free networks. Socially aware guilt comes at a cost, as it requires agents to make demanding efforts to observe and understand the internal state and behaviour of others, while non-social guilt only requires the awareness of the agents' own state and hence incurs no social cost. Those choosing to be non-social are however more sensitive to exploitation by other agents due to their social unawareness. Resorting to methods from evolutionary game theory, we study analytically, and through extensive numerical and agent-based simulations, whether and how such social and non-social guilt can evolve and deploy, depending on the underlying structure of the populations, or systems, of agents. The results show that, in both lattice and scale-free networks, emotional guilt prone strategies are dominant for a larger range of the guilt and social costs incurred, compared to the well-mixed population setting, leading therefore to significantly higher levels of cooperation for a wider range of the costs. In structured population settings, both social and non-social guilt can evolve and deploy through clustering with emotional prone strategies, allowing them to be protected from exploiters, especially in case of non-social (less costly) strategies. Overall, our findings provide important insights into the design and engineering of self-organised and distributed cooperative multi-agent systems. ",
    "url": "https://arxiv.org/abs/2302.09859",
    "authors": [
      "Theodor Cimpeanu",
      "Luis Moniz Pereira",
      "Anh Han"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Dynamical Systems (math.DS)",
      "Adaptation and Self-Organizing Systems (nlin.AO)"
    ]
  },
  {
    "id": "arXiv:2302.09884",
    "title": "GlocalFuse-Depth: Fusing Transformers and CNNs for All-day  Self-supervised Monocular Depth Estimation",
    "abstract": "In recent years, self-supervised monocular depth estimation has drawn much attention since it frees of depth annotations and achieved remarkable results on standard benchmarks. However, most of existing methods only focus on either daytime or nighttime images, thus their performance degrades on the other domain because of the large domain shift between daytime and nighttime images. To address this problem, in this paper we propose a two-branch network named GlocalFuse-Depth for self-supervised depth estimation of all-day images. The daytime and nighttime image in input image pair are fed into the two branches: CNN branch and Transformer branch, respectively, where both fine-grained details and global dependency can be efficiently captured. Besides, a novel fusion module is proposed to fuse multi-dimensional features from the two branches. Extensive experiments demonstrate that GlocalFuse-Depth achieves state-of-the-art results for all-day images on the Oxford RobotCar dataset, which proves the superiority of our method. ",
    "url": "https://arxiv.org/abs/2302.09884",
    "authors": [
      "Zezheng Zhang",
      "Ryan K. Y. Chan",
      "Kenneth K. Y. Wong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09885",
    "title": "Mental Health Coping Stories on Social Media: A Causal-Inference Study  of Papageno Effect",
    "abstract": "The Papageno effect concerns how media can play a positive role in preventing and mitigating suicidal ideation and behaviors. With the increasing ubiquity and widespread use of social media, individuals often express and share lived experiences and struggles with mental health. However, there is a gap in our understanding about the existence and effectiveness of the Papageno effect in social media, which we study in this paper. In particular, we adopt a causal-inference framework to examine the impact of exposure to mental health coping stories on individuals on Twitter. We obtain a Twitter dataset with $\\sim$2M posts by $\\sim$10K individuals. We consider engaging with coping stories as the Treatment intervention, and adopt a stratified propensity score approach to find matched cohorts of Treatment and Control individuals. We measure the psychosocial shifts in affective, behavioral, and cognitive outcomes in longitudinal Twitter data before and after engaging with the coping stories. Our findings reveal that, engaging with coping stories leads to decreased stress and depression, and improved expressive writing, diversity, and interactivity. Our work discusses the practical and platform design implications in supporting mental wellbeing. ",
    "url": "https://arxiv.org/abs/2302.09885",
    "authors": [
      "Yunhao Yuan",
      "Koustuv Saha",
      "Barbara Keller",
      "Erkki Tapio Isometsä",
      "Talayeh Aledavood"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.09886",
    "title": "InOR-Net: Incremental 3D Object Recognition Network for Point Cloud  Representation",
    "abstract": "3D object recognition has successfully become an appealing research topic in the real-world. However, most existing recognition models unreasonably assume that the categories of 3D objects cannot change over time in the real-world. This unrealistic assumption may result in significant performance degradation for them to learn new classes of 3D objects consecutively, due to the catastrophic forgetting on old learned classes. Moreover, they cannot explore which 3D geometric characteristics are essential to alleviate the catastrophic forgetting on old classes of 3D objects. To tackle the above challenges, we develop a novel Incremental 3D Object Recognition Network (i.e., InOR-Net), which could recognize new classes of 3D objects continuously via overcoming the catastrophic forgetting on old classes. Specifically, a category-guided geometric reasoning is proposed to reason local geometric structures with distinctive 3D characteristics of each class by leveraging intrinsic category information. We then propose a novel critic-induced geometric attention mechanism to distinguish which 3D geometric characteristics within each class are beneficial to overcome the catastrophic forgetting on old classes of 3D objects, while preventing the negative influence of useless 3D characteristics. In addition, a dual adaptive fairness compensations strategy is designed to overcome the forgetting brought by class imbalance, by compensating biased weights and predictions of the classifier. Comparison experiments verify the state-of-the-art performance of the proposed InOR-Net model on several public point cloud datasets. ",
    "url": "https://arxiv.org/abs/2302.09886",
    "authors": [
      "Jiahua Dong",
      "Yang Cong",
      "Gan Sun",
      "Lixu Wang",
      "Lingjuan Lyu",
      "Jun Li",
      "Ender Konukoglu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09902",
    "title": "Variation Enhanced Attacks Against RRAM-based Neuromorphic Computing  System",
    "abstract": "The RRAM-based neuromorphic computing system has amassed explosive interests for its superior data processing capability and energy efficiency than traditional architectures, and thus being widely used in many data-centric applications. The reliability and security issues of the NCS therefore become an essential problem. In this paper, we systematically investigated the adversarial threats to the RRAM-based NCS and observed that the RRAM hardware feature can be leveraged to strengthen the attack effect, which has not been granted sufficient attention by previous algorithmic attack methods. Thus, we proposed two types of hardware-aware attack methods with respect to different attack scenarios and objectives. The first is adversarial attack, VADER, which perturbs the input samples to mislead the prediction of neural networks. The second is fault injection attack, EFI, which perturbs the network parameter space such that a specified sample will be classified to a target label, while maintaining the prediction accuracy on other samples. Both attack methods leverage the RRAM properties to improve the performance compared with the conventional attack methods. Experimental results show that our hardware-aware attack methods can achieve nearly 100% attack success rate with extremely low operational cost, while maintaining the attack stealthiness. ",
    "url": "https://arxiv.org/abs/2302.09902",
    "authors": [
      "Hao Lv",
      "Bing Li",
      "Lei Zhang",
      "Cheng Liu",
      "Ying Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09920",
    "title": "Two-Tier Multi-Rate Slotted ALOHA for OWC/RF-Based IoT Networks",
    "abstract": "We consider a massive Internet of Things (IoT) scenario where indoor IoT devices access the network via optical wireless communication (OWC) IoT systems that relay data via a backhaul radio frequency (RF) low-power wide-area network (LP WAN). We propose a novel two-tier multi-rate Slotted ALOHA (SA) system model to design and analyse such hybrid OWC/RF networks. For a particular hybrid OWC/RF setup, we present an in-depth numerical investigation that provides insights into the proposed two-tier multi-rate hybrid OWC/RF SA system design. ",
    "url": "https://arxiv.org/abs/2302.09920",
    "authors": [
      "Milica Petkovic",
      "Dejan Vukobratovic",
      "Andrea Munari",
      "Federico Clazzer"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2302.09923",
    "title": "Prompt Stealing Attacks Against Text-to-Image Generation Models",
    "abstract": "Text-to-Image generation models have revolutionized the artwork design process and enabled anyone to create high-quality images by entering text descriptions called prompts. Creating a high-quality prompt that consists of a subject and several modifiers can be time-consuming and costly. In consequence, a trend of trading high-quality prompts on specialized marketplaces has emerged. In this paper, we propose a novel attack, namely prompt stealing attack, which aims to steal prompts from generated images by text-to-image generation models. Successful prompt stealing attacks direct violate the intellectual property and privacy of prompt engineers and also jeopardize the business model of prompt trading marketplaces. We first perform a large-scale analysis on a dataset collected by ourselves and show that a successful prompt stealing attack should consider a prompt's subject as well as its modifiers. We then propose the first learning-based prompt stealing attack, PromptStealer, and demonstrate its superiority over two baseline methods quantitatively and qualitatively. We also make some initial attempts to defend PromptStealer. In general, our study uncovers a new attack surface in the ecosystem created by the popular text-to-image generation models. We hope our results can help to mitigate the threat. To facilitate research in this field, we will share our dataset and code with the community. ",
    "url": "https://arxiv.org/abs/2302.09923",
    "authors": [
      "Xinyue Shen",
      "Yiting Qu",
      "Michael Backes",
      "Yang Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09939",
    "title": "A Text Mining Analysis of Data Protection Politics: The Case of Plenary  Sessions of the European Parliament",
    "abstract": "Data protection laws and policies have been studied extensively in recent years, but little is known about the parliamentary politics of data protection. This imitation applies even to the European Union (EU) that has taken the global lead in data protection and privacy regulation. For patching this notable gap in existing research, this paper explores the data protection questions raised by the Members of the European Parliament (MEPs) in the Parliament's plenary sessions and the answers given to these by the European Commission. Over a thousand of such questions and answers are covered in a period from 1995 to early 2023. Given computational analysis based on text mining, the results indicate that (a) data protection has been actively debated in the Parliament during the past twenty years. No noticeable longitudinal trends are present; the debates have been relatively constant. As could be expected, (b) the specific data protection laws in the EU have frequently been referenced in these debates, which (c) do not seem to align along conventional political dimensions such as the left-right axis. Furthermore, (d) numerous distinct data protection topics have been debated by the parliamentarians, indicating that data protection politics in the EU go well-beyond the recently enacted regulations. ",
    "url": "https://arxiv.org/abs/2302.09939",
    "authors": [
      "Jukka Ruohonen"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2302.09947",
    "title": "Query Performance Prediction for Neural IR: Are We There Yet?",
    "abstract": "Evaluation in Information Retrieval relies on post-hoc empirical procedures, which are time-consuming and expensive operations. To alleviate this, Query Performance Prediction (QPP) models have been developed to estimate the performance of a system without the need for human-made relevance judgements. Such models, usually relying on lexical features from queries and corpora, have been applied to traditional sparse IR methods - with various degrees of success. With the advent of neural IR and large Pre-trained Language Models, the retrieval paradigm has significantly shifted towards more semantic signals. In this work, we study and analyze to what extent current QPP models can predict the performance of such systems. Our experiments consider seven traditional bag-of-words and seven BERT-based IR approaches, as well as nineteen state-of-the-art QPPs evaluated on two collections, Deep Learning '19 and Robust '04. Our findings show that QPPs perform statistically significantly worse on neural IR systems. In settings where semantic signals are prominent (e.g., passage retrieval), their performance on neural models drops by as much as 10% compared to bag-of-words approaches. On top of that, in lexical-oriented scenarios, QPPs fail to predict performance for neural IR systems on those queries where they differ from traditional approaches the most. ",
    "url": "https://arxiv.org/abs/2302.09947",
    "authors": [
      "Guglielmo Faggioli",
      "Thibault Formal",
      "Stefano Marchesin",
      "Stéphane Clinchant",
      "Nicola Ferro",
      "Benjamin Piwowarski"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2302.09952",
    "title": "Why is the prediction wrong? Towards underfitting case explanation via  meta-classification",
    "abstract": "In this paper we present a heuristic method to provide individual explanations for those elements in a dataset (data points) which are wrongly predicted by a given classifier. Since the general case is too difficult, in the present work we focus on faulty data from an underfitted model. First, we project the faulty data into a hand-crafted, and thus human readable, intermediate representation (meta-representation, profile vectors), with the aim of separating the two main causes of miss-classification: the classifier is not strong enough, or the data point belongs to an area of the input space where classes are not separable. Second, in the space of these profile vectors, we present a method to fit a meta-classifier (decision tree) and express its output as a set of interpretable (human readable) explanation rules, which leads to several target diagnosis labels: data point is either correctly classified, or faulty due to a too weak model, or faulty due to mixed (overlapped) classes in the input space. Experimental results on several real datasets show more than 80% diagnosis label accuracy and confirm that the proposed intermediate representation allows to achieve a high degree of invariance with respect to the classifier used in the input space and to the dataset being classified, i.e. we can learn the metaclassifier on a dataset with a given classifier and successfully predict diagnosis labels for a different dataset or classifier (or both). ",
    "url": "https://arxiv.org/abs/2302.09952",
    "authors": [
      "Sheng Zhou",
      "Pierre Blanchart",
      "Michel Crucianu",
      "Marin Ferecatu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09971",
    "title": "Social4Rec: Distilling User Preference from Social Graph for Video  Recommendation in Tencent",
    "abstract": "Modeling user interest accurately is crucial to recommendation systems. Existing works capture user interest from historical behaviors. Due to the sparsity and noise in user behavior data, behavior based models learn incomplete and sometimes inaccurate preference patterns and easily suffer from the cold user problem. To address these issues, we propose a social graph enhanced framework for behavior based models, namely Social4Rec. The social graph involving multiple relation types is extracted to find users with similar interests. It is challenging due to the trivial and sparse relations in social graph. Specifically, we first propose a Cluster-Calibrate-Merge network (CCM) to discover interest groups satisfying three properties: intrinsic self-organizing patterns through cluster layer, robustness to sparse relations through knowledge distillation of calibrator layer. We then use the averaged user interest representation within each group from CCM to complete each user behavior embedding and obtain relation specific interest aware embedding. To alleviate the trivial relation problem, relation specific interest aware embedding are aggregated among relation types through attention mechanism to obtain the interest aware social embedding for each user. It is combined with user behavior embedding to derive the matching score between the user and item. Both offline and online experiments on Tencent Video, which is one of the biggest video recommendation platforms with nearly one billion users in China, demonstrate the superiority of our work, especially for cold users. The codes are available on https://github.com/Social4Rec/SocialN ",
    "url": "https://arxiv.org/abs/2302.09971",
    "authors": [
      "Xuanji Xiao",
      "Huaqiang Dai",
      "Qian Dong",
      "Shuzi Niu",
      "Yuzhen Liu",
      "Pei Liu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2302.09977",
    "title": "Dynamic Graph Neural Network with Adaptive Edge Attributes for Air  Quality Predictions",
    "abstract": "Air quality prediction is a typical spatio-temporal modeling problem, which always uses different components to handle spatial and temporal dependencies in complex systems separately. Previous models based on time series analysis and Recurrent Neural Network (RNN) methods have only modeled time series while ignoring spatial information. Previous GCNs-based methods usually require providing spatial correlation graph structure of observation sites in advance. The correlations among these sites and their strengths are usually calculated using prior information. However, due to the limitations of human cognition, limited prior information cannot reflect the real station-related structure or bring more effective information for accurate prediction. To this end, we propose a novel Dynamic Graph Neural Network with Adaptive Edge Attributes (DGN-AEA) on the message passing network, which generates the adaptive bidirected dynamic graph by learning the edge attributes as model parameters. Unlike prior information to establish edges, our method can obtain adaptive edge information through end-to-end training without any prior information. Thus reduced the complexity of the problem. Besides, the hidden structural information between the stations can be obtained as model by-products, which can help make some subsequent decision-making analyses. Experimental results show that our model received state-of-the-art performance than other baselines. ",
    "url": "https://arxiv.org/abs/2302.09977",
    "authors": [
      "Jing Xu",
      "Shuo Wang",
      "Na Ying",
      "Xiao Xiao",
      "Jiang Zhang",
      "Yun Cheng",
      "Zhiling Jin",
      "Gangfeng Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.09995",
    "title": "Selectively Providing Reliance Calibration Cues With Reliance Prediction",
    "abstract": "For effective collaboration between humans and intelligent agents that employ machine learning for decision-making, humans must understand what agents can and cannot do to avoid over/under-reliance. A solution to this problem is adjusting human reliance through communication using reliance calibration cues (RCCs) to help humans assess agents' capabilities. Previous studies typically attempted to calibrate reliance by continuously presenting RCCs, and when an agent should provide RCCs remains an open question. To answer this, we propose Pred-RC, a method for selectively providing RCCs. Pred-RC uses a cognitive reliance model to predict whether a human will assign a task to an agent. By comparing the prediction results for both cases with and without an RCC, Pred-RC evaluates the influence of the RCC on human reliance. We tested Pred-RC in a human-AI collaboration task and found that it can successfully calibrate human reliance with a reduced number of RCCs. ",
    "url": "https://arxiv.org/abs/2302.09995",
    "authors": [
      "Yosuke Fukuchi",
      "Seiji Yamada"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2302.10005",
    "title": "Black Boxes, White Noise: Similarity Detection for Neural Functions",
    "abstract": "Similarity, or clone, detection has important applications in copyright violation, software theft, code search, and the detection of malicious components. There is now a good number of open source and proprietary clone detectors for programs written in traditional programming languages. However, the increasing adoption of deep learning models in software poses a challenge to these tools: these models implement functions that are inscrutable black boxes. As more software includes these DNN functions, new techniques are needed in order to assess the similarity between deep learning components of software. Previous work has unveiled techniques for comparing the representations learned at various layers of deep neural network models by feeding canonical inputs to the models. Our goal is to be able to compare DNN functions when canonical inputs are not available -- because they may not be in many application scenarios. The challenge, then, is to generate appropriate inputs and to identify a metric that, for those inputs, is capable of representing the degree of functional similarity between two comparable DNN functions. Our approach uses random input with values between -1 and 1, in a shape that is compatible with what the DNN models expect. We then compare the outputs by performing correlation analysis. Our study shows how it is possible to perform similarity analysis even in the absence of meaningful canonical inputs. The response to random inputs of two comparable DNN functions exposes those functions' similarity, or lack thereof. Of all the metrics tried, we find that Spearman's rank correlation coefficient is the most powerful and versatile, although in special cases other methods and metrics are more expressive. We present a systematic empirical study comparing the effectiveness of several similarity metrics using a dataset of 56,355 classifiers collected from GitHub. This is accompanied by a sensitivity analysis that reveals how certain models' training related properties affect the effectiveness of the similarity metrics. To the best of our knowledge, this is the first work that shows how similarity of DNN functions can be detected by using random inputs. Our study of correlation metrics, and the identification of Spearman correlation coefficient as the most powerful among them for this purpose, establishes a complete and practical method for DNN clone detection that can be used in the design of new tools. It may also serve as inspiration for other program analysis tasks whose approaches break in the presence of DNN components. ",
    "url": "https://arxiv.org/abs/2302.10005",
    "authors": [
      "Farima Farmahinifarahani",
      "Cristina V. Lopes"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2302.10019",
    "title": "SegMobaTree: The Segmented Multilayer Online Balanced Tree for  high-performance IPv6 Lookup in the Edge Network",
    "abstract": "With the development of IPv6 and edge computing, the edge network should support IPv6 lookup (the longest prefix matching, LPM) with high lookup speed, high update speed, and low memory cost. However, the trie-based algorithms, e.g., SAIL and Poptrie, mainly focus on the IPv4 ruleset but have disadvantages in the edge IPv6 ruleset with longer prefix length. The binary-based algorithm Hi-BST also has limited lookup speed with too many memory accesses. Therefore, we propose the SegMobaTree algorithm to achieve high-performance IPv6 lookup in the edge network. First, MobaTree is a multilayer online balanced tree to perform high-speed binary search among rules with different prefix lengths. Second, to avoid one large tree, we propose the dynamic programming method to split prefix lengths into a few suitable segments, which tradeoff between the number of segments and the scale of trees. Compared to SAIL, Poptrie, and Hi-BST, SegMobaTree achieves 1.5x, 1.7x, 1.6x lookup speed and 11.8x, 32.8x, 1.3x update speed with low memory cost. ",
    "url": "https://arxiv.org/abs/2302.10019",
    "authors": [
      "Chunyang Zhang",
      "Gaogang Xie"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2302.10036",
    "title": "Fundamental Limits of Topology-Aware Shared-Cache Networks",
    "abstract": "This work studies a well-known shared-cache coded caching scenario where each cache can serve an arbitrary number of users, analyzing the case where there is some knowledge about such number of users (i.e., the topology) during the content placement phase. Under the assumption of regular placement and a cumulative cache size that can be optimized across the different caches, we derive the fundamental limits of performance by introducing a novel cache-size optimization and placement scheme and a novel information-theoretic converse. The converse employs new index coding techniques to bypass traditional uniformity requirements, thus finely capturing the heterogeneity of the problem, and it provides a new approach to handle asymmetric settings. The new fundamental limits reveal that heterogeneous topologies can in fact outperform their homogeneous counterparts where each cache is associated to an equal number of users. These results are extended to capture the scenario of topological uncertainty where the perceived/estimated topology does not match the true network topology. This scenario is further elevated to the stochastic setting where the user-to-cache association is random and unknown, and it is shown that the proposed scheme is robust to such noisy or inexact knowledge on the topology. ",
    "url": "https://arxiv.org/abs/2302.10036",
    "authors": [
      "Emanuele Parrinello",
      "Antonio Bazco-Nogueras",
      "Petros Elia"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2302.10040",
    "title": "Ontology-aware Network for Zero-shot Sketch-based Image Retrieval",
    "abstract": "Zero-Shot Sketch-Based Image Retrieval (ZSSBIR) is an emerging task. The pioneering work focused on the modal gap but ignored inter-class information. Although recent work has begun to consider the triplet-based or contrast-based loss to mine inter-class information, positive and negative samples need to be carefully selected, or the model is prone to lose modality-specific information. To respond to these issues, an Ontology-Aware Network (OAN) is proposed. Specifically, the smooth inter-class independence learning mechanism is put forward to maintain inter-class peculiarity. Meanwhile, distillation-based consistency preservation is utilized to keep modality-specific information. Extensive experiments have demonstrated the superior performance of our algorithm on two challenging Sketchy and Tu-Berlin datasets. ",
    "url": "https://arxiv.org/abs/2302.10040",
    "authors": [
      "Haoxiang Zhang",
      "He Jiang",
      "Ziqiang Wang",
      "Deqiang Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.10046",
    "title": "Extending Orthogonal Planar Graph Drawings is Fixed-Parameter Tractable",
    "abstract": "The task of finding an extension to a given partial drawing of a graph while adhering to constraints on the representation has been extensively studied in the literature, with well-known results providing efficient algorithms for fundamental representations such as planar and beyond-planar topological drawings. In this paper, we consider the extension problem for bend-minimal orthogonal drawings of planar connected graphs, which is among the most fundamental geometric graph drawing representations. While the problem was known to be \\NP-hard, it is natural to consider the case where only a small part of the graph is still to be drawn. Here, we establish the fixed-parameter tractability of the problem when parameterized by the size of the missing subgraph. Our algorithm is based on multiple novel ingredients which intertwine geometric and combinatorial arguments. These include the identification of a new graph representation of bend-equivalent regions for vertex placement in the plane, establishing a bound on the treewidth of this auxiliary graph, and a global point-grid that allows us to discretize the possible placement of bends and vertices into locally bounded subgrids for each of the above regions. ",
    "url": "https://arxiv.org/abs/2302.10046",
    "authors": [
      "Sujoy Bhore",
      "Robert Ganian",
      "Liana Khazaliya",
      "Fabrizio Montecchiani",
      "Martin Nöllenburg"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2302.10069",
    "title": "A Study on V2G impact on the Reliability of Modern Distribution Networks",
    "abstract": "The increased penetration of electrical vehicles (EVs) in the distribution system creates a power system with many small moving batteries. With better charging technologies and market structures, the opportunity of using EVs for reliability purposes increases. By utilizing EVs for Vehicle-to-Grid (V2G), they can support the distribution network during outages or other issues. In this paper, we aim to investigate the impact V2G has on the reliability of modern distribution networks. We propose three new EV-oriented reliability indices to provide an overview of the impact experienced by the EVs in the system. For the reliability study, we use our developed reliability assessment tool for distribution networks. The tool is an open available software where the example network and datasets are embedded. We have extended this reliability tool to include a method for evaluating and calculating the reliability of distribution networks containing EVs with V2G possibilities. The paper also includes a thorough sensitivity analysis to further investigate the V2G impact of different parameters. ",
    "url": "https://arxiv.org/abs/2302.10069",
    "authors": [
      "Stine Fleischer Myhre",
      "Olav Bjarte Fosso",
      "Oddbjørn Gjerde",
      "Poul Einar Heegaard"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.10106",
    "title": "Towards Understanding the Survival of Patients with High-Grade  Gastroenteropancreatic Neuroendocrine Neoplasms: An Investigation of Ensemble  Feature Selection in the Prediction of Overall Survival",
    "abstract": "Determining the most informative features for predicting the overall survival of patients diagnosed with high-grade gastroenteropancreatic neuroendocrine neoplasms is crucial to improve individual treatment plans for patients, as well as the biological understanding of the disease. Recently developed ensemble feature selectors like the Repeated Elastic Net Technique for Feature Selection (RENT) and the User-Guided Bayesian Framework for Feature Selection (UBayFS) allow the user to identify such features in datasets with low sample sizes. While RENT is purely data-driven, UBayFS is capable of integrating expert knowledge a priori in the feature selection process. In this work we compare both feature selectors on a dataset comprising of 63 patients and 134 features from multiple sources, including basic patient characteristics, baseline blood values, tumor histology, imaging, and treatment information. Our experiments involve data-driven and expert-driven setups, as well as combinations of both. We use findings from clinical literature as a source of expert knowledge. Our results demonstrate that both feature selectors allow accurate predictions, and that expert knowledge has a stabilizing effect on the feature set, while the impact on predictive performance is limited. The features WHO Performance Status, Albumin, Platelets, Ki-67, Tumor Morphology, Total MTV, Total TLG, and SUVmax are the most stable and predictive features in our study. ",
    "url": "https://arxiv.org/abs/2302.10106",
    "authors": [
      "Anna Jenul",
      "Henning Langen Stokmo",
      "Stefan Schrunner",
      "Mona-Elisabeth Revheim",
      "Geir Olav Hjortland",
      "Oliver Tomic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.10126",
    "title": "iQPP: A Benchmark for Image Query Performance Prediction",
    "abstract": "To date, query performance prediction (QPP) in the context of content-based image retrieval remains a largely unexplored task, especially in the query-by-example scenario, where the query is an image. To boost the exploration of the QPP task in image retrieval, we propose the first benchmark for image query performance prediction (iQPP). First, we establish a set of four data sets (PASCAL VOC 2012, Caltech-101, ROxford5k and RParis6k) and estimate the ground-truth difficulty of each query as the average precision or the precision@k, using two state-of-the-art image retrieval models. Next, we propose and evaluate novel pre-retrieval and post-retrieval query performance predictors, comparing them with existing or adapted (from text to image) predictors. The empirical results show that most predictors do not generalize across evaluation scenarios. Our comprehensive experiments indicate that iQPP is a challenging benchmark, revealing an important research gap that needs to be addressed in future work. We release our code and data as open source at https://github.com/Eduard6421/iQPP, to foster future research. ",
    "url": "https://arxiv.org/abs/2302.10126",
    "authors": [
      "Eduard Poesina",
      "Radu Tudor Ionescu",
      "Josiane Mothe"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2302.10135",
    "title": "Enhancing Causal Discovery from Robot Sensor Data in Dynamic Scenarios",
    "abstract": "Identifying the main features and learning the causal relationships of a dynamic system from time-series of sensor data are key problems in many real-world robot applications. In this paper, we propose an extension of a state-of-the-art causal discovery method, PCMCI, embedding an additional feature-selection module based on transfer entropy. Starting from a prefixed set of variables, the new algorithm reconstructs the causal model of the observed system by considering only its main features and neglecting those deemed unnecessary for understanding the evolution of the system. We first validate the method on a toy problem and on synthetic data of brain network, for which the ground-truth models are available, and then on a real-world robotics scenario using a large-scale time-series dataset of human trajectories. The experiments demonstrate that our solution outperforms the previous state-of-the-art technique in terms of accuracy and computational efficiency, allowing better and faster causal discovery of meaningful models from robot sensor data. ",
    "url": "https://arxiv.org/abs/2302.10135",
    "authors": [
      "Luca Castri",
      "Sariah Mghames",
      "Marc Hanheide",
      "Nicola Bellotto"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.10149",
    "title": "Poisoning Web-Scale Training Datasets is Practical",
    "abstract": "Deep learning models are often trained on distributed, webscale datasets crawled from the internet. In this paper, we introduce two new dataset poisoning attacks that intentionally introduce malicious examples to a model's performance. Our attacks are immediately practical and could, today, poison 10 popular datasets. Our first attack, split-view poisoning, exploits the mutable nature of internet content to ensure a dataset annotator's initial view of the dataset differs from the view downloaded by subsequent clients. By exploiting specific invalid trust assumptions, we show how we could have poisoned 0.01% of the LAION-400M or COYO-700M datasets for just $60 USD. Our second attack, frontrunning poisoning, targets web-scale datasets that periodically snapshot crowd-sourced content -- such as Wikipedia -- where an attacker only needs a time-limited window to inject malicious examples. In light of both attacks, we notify the maintainers of each affected dataset and recommended several low-overhead defenses. ",
    "url": "https://arxiv.org/abs/2302.10149",
    "authors": [
      "Nicholas Carlini",
      "Matthew Jagielski",
      "Christopher A. Choquette-Choo",
      "Daniel Paleka",
      "Will Pearce",
      "Hyrum Anderson",
      "Andreas Terzis",
      "Kurt Thomas",
      "Florian Tramèr"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.10164",
    "title": "Seasoning Model Soups for Robustness to Adversarial and Natural  Distribution Shifts",
    "abstract": "Adversarial training is widely used to make classifiers robust to a specific threat or adversary, such as $\\ell_p$-norm bounded perturbations of a given $p$-norm. However, existing methods for training classifiers robust to multiple threats require knowledge of all attacks during training and remain vulnerable to unseen distribution shifts. In this work, we describe how to obtain adversarially-robust model soups (i.e., linear combinations of parameters) that smoothly trade-off robustness to different $\\ell_p$-norm bounded adversaries. We demonstrate that such soups allow us to control the type and level of robustness, and can achieve robustness to all threats without jointly training on all of them. In some cases, the resulting model soups are more robust to a given $\\ell_p$-norm adversary than the constituent model specialized against that same adversary. Finally, we show that adversarially-robust model soups can be a viable tool to adapt to distribution shifts from a few examples. ",
    "url": "https://arxiv.org/abs/2302.10164",
    "authors": [
      "Francesco Croce",
      "Sylvestre-Alvise Rebuffi",
      "Evan Shelhamer",
      "Sven Gowal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09200",
    "title": "Brainomaly: Unsupervised Neurologic Disease Detection Utilizing  Unannotated T1-weighted Brain MR Images",
    "abstract": "Deep neural networks have revolutionized the field of supervised learning by enabling accurate predictions through learning from large annotated datasets. However, acquiring large annotated medical imaging datasets is a challenging task, especially for rare diseases, due to the high cost, time, and effort required for annotation. In these scenarios, unsupervised disease detection methods, such as anomaly detection, can save significant human effort. A typically used approach for anomaly detection is to learn the images from healthy subjects only, assuming the model will detect the images from diseased subjects as outliers. However, in many real-world scenarios, unannotated datasets with a mix of healthy and diseased individuals are available. Recent studies have shown improvement in unsupervised disease/anomaly detection using such datasets of unannotated images from healthy and diseased individuals compared to datasets that only include images from healthy individuals. A major issue remains unaddressed in these studies, which is selecting the best model for inference from a set of trained models without annotated samples. To address this issue, we propose Brainomaly, a GAN-based image-to-image translation method for neurologic disease detection using unannotated T1-weighted brain MRIs of individuals with neurologic diseases and healthy subjects. Brainomaly is trained to remove the diseased regions from the input brain MRIs and generate MRIs of corresponding healthy brains. Instead of generating the healthy images directly, Brainomaly generates an additive map where each voxel indicates the amount of changes required to make the input image look healthy. In addition, Brainomaly uses a pseudo-AUC metric for inference model selection, which further improves the detection performance. Our Brainomaly outperforms existing state-of-the-art methods by large margins. ",
    "url": "https://arxiv.org/abs/2302.09200",
    "authors": [
      "Md Mahfuzur Rahman Siddiquee",
      "Jay Shah",
      "Teresa Wu",
      "Catherine Chong",
      "Todd J. Schwedt",
      "Gina Dumkrieger",
      "Simona Nikolova",
      "Baoxin Li"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09235",
    "title": "Generalization and Stability of Interpolating Neural Networks with  Minimal Width",
    "abstract": "We investigate the generalization and optimization of $k$-homogeneous shallow neural-network classifiers in the interpolating regime. The study focuses on analyzing the performance of the model when it is capable of perfectly classifying the input data with a positive margin $\\gamma$. When using gradient descent with logistic-loss minimization, we show that the training loss converges to zero at a rate of $\\tilde O(1/\\gamma^{2/k} T)$ given a polylogarithmic number of neurons. This suggests that gradient descent can find a perfect classifier for $n$ input data within $\\tilde{\\Omega}(n)$ iterations. Additionally, through a stability analysis we show that with $m=\\Omega(\\log^{4/k} (n))$ neurons and $T=\\Omega(n)$ iterations, the test loss is bounded by $\\tilde{O}(1/\\gamma^{2/k} n)$. This is in contrast to existing stability results which require polynomial width and yield suboptimal generalization rates. Central to our analysis is the use of a new self-bounded weak convexity property, which leads to a generalized local quasi-convexity property for sufficiently parameterized neural-network classifiers. Eventually, despite the objective's non-convexity, this leads to convergence and generalization-gap bounds that are similar to those in the convex setting of linear logistic regression. ",
    "url": "https://arxiv.org/abs/2302.09235",
    "authors": [
      "Hossein Taheri",
      "Christos Thrampoulidis"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09244",
    "title": "Dual-Domain Self-Supervised Learning for Accelerated Non-Cartesian MRI  Reconstruction",
    "abstract": "While enabling accelerated acquisition and improved reconstruction accuracy, current deep MRI reconstruction networks are typically supervised, require fully sampled data, and are limited to Cartesian sampling patterns. These factors limit their practical adoption as fully-sampled MRI is prohibitively time-consuming to acquire clinically. Further, non-Cartesian sampling patterns are particularly desirable as they are more amenable to acceleration and show improved motion robustness. To this end, we present a fully self-supervised approach for accelerated non-Cartesian MRI reconstruction which leverages self-supervision in both k-space and image domains. In training, the undersampled data are split into disjoint k-space domain partitions. For the k-space self-supervision, we train a network to reconstruct the input undersampled data from both the disjoint partitions and from itself. For the image-level self-supervision, we enforce appearance consistency obtained from the original undersampled data and the two partitions. Experimental results on our simulated multi-coil non-Cartesian MRI dataset demonstrate that DDSS can generate high-quality reconstruction that approaches the accuracy of the fully supervised reconstruction, outperforming previous baseline methods. Finally, DDSS is shown to scale to highly challenging real-world clinical MRI reconstruction acquired on a portable low-field (0.064 T) MRI scanner with no data available for supervised training while demonstrating improved image quality as compared to traditional reconstruction, as determined by a radiologist study. ",
    "url": "https://arxiv.org/abs/2302.09244",
    "authors": [
      "Bo Zhou",
      "Jo Schlemper",
      "Neel Dey",
      "Seyed Sadegh Mohseni Salehi",
      "Kevin Sheth",
      "Chi Liu",
      "James S. Duncan",
      "Michal Sofka"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.09256",
    "title": "Multi-dimensional frequency dynamic convolution with confident mean  teacher for sound event detection",
    "abstract": "Recently, convolutional neural networks (CNNs) have been widely used in sound event detection (SED). However, traditional convolution is deficient in learning time-frequency domain representation of different sound events. To address this issue, we propose multi-dimensional frequency dynamic convolution (MFDConv), a new design that endows convolutional kernels with frequency-adaptive dynamic properties along multiple dimensions. MFDConv utilizes a novel multi-dimensional attention mechanism with a parallel strategy to learn complementary frequency-adaptive attentions, which substantially strengthen the feature extraction ability of convolutional kernels. Moreover, in order to promote the performance of mean teacher, we propose the confident mean teacher to increase the accuracy of pseudo-labels from the teacher and train the student with high confidence labels. Experimental results show that the proposed methods achieve 0.470 and 0.692 of PSDS1 and PSDS2 on the DESED real validation dataset. ",
    "url": "https://arxiv.org/abs/2302.09256",
    "authors": [
      "Shengchang Xiao"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2302.09288",
    "title": "Data Augmentation for Imbalanced Regression",
    "abstract": "In this work, we consider the problem of imbalanced data in a regression framework when the imbalanced phenomenon concerns continuous or discrete covariates. Such a situation can lead to biases in the estimates. In this case, we propose a data augmentation algorithm that combines a weighted resampling (WR) and a data augmentation (DA) procedure. In a first step, the DA procedure permits exploring a wider support than the initial one. In a second step, the WR method drives the exogenous distribution to a target one. We discuss the choice of the DA procedure through a numerical study that illustrates the advantages of this approach. Finally, an actuarial application is studied. ",
    "url": "https://arxiv.org/abs/2302.09288",
    "authors": [
      "Samuel Stocksieker",
      "Denys Pommeret",
      "Arthur Charpentier"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2302.09331",
    "title": "Front-End Adapter: Adapting Front-End Input of Speech based  Self-Supervised Learning for Speech Recognition",
    "abstract": "Recent years have witnessed a boom in self-supervised learning (SSL) in various areas including speech processing. Speech based SSL models present promising performance in a range of speech related tasks. However, the training of SSL models is computationally expensive and a common practice is to fine-tune a released SSL model on the specific task. It is essential to use consistent front-end input during pre-training and fine-tuning. This consistency may introduce potential issues when the optimal front-end is not the same as that used in pre-training. In this paper, we propose a simple but effective front-end adapter to address this front-end discrepancy. By minimizing the distance between the outputs of different front-ends, the filterbank feature (Fbank) can be compatible with SSL models which are pre-trained with waveform. The experiment results demonstrate the effectiveness of our proposed front-end adapter on several popular SSL models for the speech recognition task. ",
    "url": "https://arxiv.org/abs/2302.09331",
    "authors": [
      "Xie Chen",
      "Ziyang Ma",
      "Changli Tang",
      "Yujin Wang",
      "Zhisheng Zheng"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2302.09341",
    "title": "A Heterogeneous Multiscale Method for Power System Simulation  Considering Electromagnetic Transients",
    "abstract": "Traditional dynamic security assessment faces challenges as power systems are experiencing a transformation to inverter-based-resource (IBR) dominated systems, for which electromagnetic transient (EMT) dynamics have to be considered. However, EMT simulation is time-consuming especially for a large power grid because the mathematical model based on detailed component modeling is highly stiff and needs to be integrated at tiny time steps due to numerical stability. This paper proposes a heterogeneous multiscale method (HMM) to address the simulation of a power system considering EMT dynamics as a multiscale problem. The method aims to accurately simulate the macroscopic dynamics of the system even when EMT dynamics are dominating. By force estimation using a kernel function, the proposed method automatically generates a macro model on the fly of simulation based on the micro model of EMT dynamics. It can flexibly switch between the micro- and macro-models to capture important EMT dynamics during some time intervals while skipping over other time intervals of less interest to achieve a superior simulation speed. The method is illustrated by a case study on a two-machine EMT model to demonstrate its potential for power system simulation. ",
    "url": "https://arxiv.org/abs/2302.09341",
    "authors": [
      "Kaiyang Huang",
      "Min Xiong",
      "Yang Liu",
      "Kai Sun",
      "Feng Qiu"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Systems and Control (eess.SY)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2302.09381",
    "title": "Speaker and Language Change Detection using Wav2vec2 and Whisper",
    "abstract": "We investigate recent transformer networks pre-trained for automatic speech recognition for their ability to detect speaker and language changes in speech. We do this by simply adding speaker (change) or language targets to the labels. For Wav2vec2 pre-trained networks, we also investigate if the representation for the speaker change symbol can be conditioned to capture speaker identity characteristics. Using a number of constructed data sets we show that these capabilities are definitely there, with speaker recognition equal error rates of the order of 10% and language detection error rates of a few percent. We will publish the code for reproducibility. ",
    "url": "https://arxiv.org/abs/2302.09381",
    "authors": [
      "Tijn Berns",
      "Nik Vaessen",
      "David A. van Leeuwen"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2302.09437",
    "title": "RobustDistiller: Compressing Universal Speech Representations for  Enhanced Environment Robustness",
    "abstract": "Self-supervised speech pre-training enables deep neural network models to capture meaningful and disentangled factors from raw waveform signals. The learned universal speech representations can then be used across numerous downstream tasks. These representations, however, are sensitive to distribution shifts caused by environmental factors, such as noise and/or room reverberation. Their large sizes, in turn, make them unfeasible for edge applications. In this work, we propose a knowledge distillation methodology termed RobustDistiller which compresses universal representations while making them more robust against environmental artifacts via a multi-task learning objective. The proposed layer-wise distillation recipe is evaluated on top of three well-established universal representations, as well as with three downstream tasks. Experimental results show the proposed methodology applied on top of the WavLM Base+ teacher model outperforming all other benchmarks across noise types and levels, as well as reverberation times. Oftentimes, the obtained results with the student model (24M parameters) achieved results inline with those of the teacher model (95M). ",
    "url": "https://arxiv.org/abs/2302.09437",
    "authors": [
      "Heitor R. Guimarães",
      "Arthur Pimentel",
      "Anderson R. Avila",
      "Mehdi Rezagholizadeh",
      "Boxing Chen",
      "Tiago H. Falk"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2302.09516",
    "title": "A Bibliography of Multiple Sclerosis Lesions Detection Methods using  Brain MRIs",
    "abstract": "Introduction: Multiple Sclerosis (MS) is a chronic disease that affects millions of people across the globe. MS can critically affect different organs of the central nervous system such as the eyes, the spinal cord, and the brain. Background: To help physicians in diagnosing MS lesions, computer-aided methods are widely used. In this regard, a considerable research has been carried out in the area of automatic detection and segmentation of MS lesions in magnetic resonance images (MRIs). Methodology: In this study, we review the different approaches that have been used in computer-aided detection and segmentation of MS lesions. Our review resulted in categorizing MS lesion segmentation approaches into six broad categories: data-driven, statistical, supervised machine learning, unsupervised machine learning, fuzzy, and deep learning-based techniques. We critically analyze the different techniques under these approaches and highlight their strengths and weaknesses. Results: From the study, we observe that a considerable amount of work, around 25% of related literature, is focused on statistical-based MS lesion segmentation techniques, followed by 21.15% for data-driven based methods, 19.23% for deep learning and 15.38% for supervised methods. Implication: The study points out the challenges/gaps to be addressed in future research. The study shows the work which has been done in last one decade in detection and segmentation of MS lesions. The results show that, in recent years, deep learning methods are outperforming all the others methods. ",
    "url": "https://arxiv.org/abs/2302.09516",
    "authors": [
      "Atif Shah",
      "Maged S. Al-Shaibani",
      "Moataz Ahmad",
      "Reem Bunyan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09614",
    "title": "On Existence of Must-Include Paths and Cycles in Undirected Graphs",
    "abstract": "Given an undirected graph $G=(V,E)$ and vertices $s,t,w_1,w_2\\in V$, we study finding whether there exists a simple path $P$ from $s$ to $t$ such that $w_1,w_2 \\in P$. As a sub-problem, we study the question: given an undirected graph and three of its edges, does there exist a simple cycle containing all those edges? We provide necessary and sufficient conditions for the existence of such paths and cycles, and develop efficient algorithms to solve this and related problems. ",
    "url": "https://arxiv.org/abs/2302.09614",
    "authors": [
      "Yefim Dinitz",
      "Solomon Eyal Shimony"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2302.09696",
    "title": "An Efficient and Robust Method for Chest X-Ray Rib Suppression that  Improves Pulmonary Abnormality Diagnosis",
    "abstract": "Suppression of thoracic bone shadows on chest X-rays (CXRs) has been indicated to improve the diagnosis of pulmonary disease. Previous approaches can be categorized as unsupervised physical and supervised deep learning models. Nevertheless, with physical models able to preserve morphological details but at the cost of extremely long processing time, existing DL methods face challenges of gathering sufficient/qualitative ground truth (GT) for robust training, thus leading to failure in maintaining clinically acceptable false positive rates. We hereby propose a generalizable yet efficient workflow of two stages: (1) training pairs generation with GT bone shadows eliminated in by a physical model in spatially transformed gradient fields. (2) fully supervised image denoising network training on stage-one datasets for fast rib removal on incoming CXRs. For step two, we designed a densely connected network called SADXNet, combined with peak signal to noise ratio and multi-scale structure similarity index measure objective minimization to suppress bony structures. The SADXNet organizes spatial filters in U shape (e.g., X=7; filters = 16, 64, 256, 512, 256, 64, 16) and preserves the feature map dimension throughout the network flow. Visually, SADXNet can suppress the rib edge and that near the lung wall/vertebra without jeopardizing the vessel/abnormality conspicuity. Quantitively, it achieves RMSE of ~0 during testing with one prediction taking <1s. Downstream tasks including lung nodule detection as well as common lung disease classification and localization are used to evaluate our proposed rib suppression mechanism. We observed 3.23% and 6.62% area under the curve (AUC) increase as well as 203 and 385 absolute false positive decrease for lung nodule detection and common lung disease localization, separately. ",
    "url": "https://arxiv.org/abs/2302.09696",
    "authors": [
      "Di Xu",
      "Qifan Xu",
      "Kevin Nhieu",
      "Dan Ruan",
      "Ke Sheng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09712",
    "title": "Depth Degeneracy in Neural Networks: Vanishing Angles in Fully Connected  ReLU Networks on Initialization",
    "abstract": "Stacking many layers to create truly deep neural networks is arguably what has led to the recent explosion of these methods. However, many properties of deep neural networks are not yet understood. One such mystery is the depth degeneracy phenomenon: the deeper you make your network, the closer your network is to a constant function on initialization. In this paper, we examine the evolution of the angle between two inputs to a ReLU neural network as a function of the number of layers. By using combinatorial expansions, we find precise formulas for how fast this angle goes to zero as depth increases. Our formulas capture microscopic fluctuations that are not visible in the popular framework of infinite width limits, and yet have a significant effect on predicted behaviour. The formulas are given in terms of the mixed moments of correlated Gaussians passed through the ReLU function. We also find a surprising combinatorial connection between these mixed moments and the Bessel numbers. ",
    "url": "https://arxiv.org/abs/2302.09712",
    "authors": [
      "Cameron Jakub",
      "Mihai Nica"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2302.09807",
    "title": "A Novel Collaborative Self-Supervised Learning Method for Radiomic Data",
    "abstract": "The computer-aided disease diagnosis from radiomic data is important in many medical applications. However, developing such a technique relies on annotating radiological images, which is a time-consuming, labor-intensive, and expensive process. In this work, we present the first novel collaborative self-supervised learning method to solve the challenge of insufficient labeled radiomic data, whose characteristics are different from text and image data. To achieve this, we present two collaborative pretext tasks that explore the latent pathological or biological relationships between regions of interest and the similarity and dissimilarity information between subjects. Our method collaboratively learns the robust latent feature representations from radiomic data in a self-supervised manner to reduce human annotation efforts, which benefits the disease diagnosis. We compared our proposed method with other state-of-the-art self-supervised learning methods on a simulation study and two independent datasets. Extensive experimental results demonstrated that our method outperforms other self-supervised learning methods on both classification and regression tasks. With further refinement, our method shows the potential advantage in automatic disease diagnosis with large-scale unlabeled data available. ",
    "url": "https://arxiv.org/abs/2302.09807",
    "authors": [
      "Zhiyuan Li",
      "Hailong Li",
      "Anca L. Ralescu",
      "Jonathan R. Dillman",
      "Nehal A. Parikh",
      "Lili He"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.10015",
    "title": "Comparison of orchard networks using their extended $μ$-representation",
    "abstract": "Phylogenetic networks generalize phylogenetic trees in order to model reticulation events. Although the comparison of phylogenetic trees is well studied, and there are multiple ways to do it in an efficient way, the situation is much different for phylogenetic networks. Some classes of phylogenetic networks, mainly tree-child networks, are known to be classified efficiently by their $\\mu$-representation, which essentially counts, for every node, the number of paths to each leaf. In this paper, we introduce the extended $\\mu$-representation of networks, where the number of paths to reticulations is also taken into account. This modification allows us to distinguish orchard networks and to define a sound metric on the space of such networks that can, moreover, be computed efficiently. The class of orchard networks, as well as being one of the classes with biological significance (one such network can be interpreted as a tree with extra arcs involving coexisting organisms), is one of the most generic ones (in mathematical terms) for which such a representation can (conjecturally) exist, since a slight relaxation of the definition leads to a problem that is Graph Isomorphism Complete. ",
    "url": "https://arxiv.org/abs/2302.10015",
    "authors": [
      "Gabriel Cardona",
      "Joan Carles Pons",
      "Gerard Ribas",
      "Tomás Martínez Coronado"
    ],
    "subjectives": [
      "Populations and Evolution (q-bio.PE)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2302.10051",
    "title": "A normative framework for deriving neural networks with  multi-compartmental neurons and non-Hebbian plasticity",
    "abstract": "An established normative approach for understanding the algorithmic basis of neural computation is to derive online algorithms from principled computational objectives and evaluate their compatibility with anatomical and physiological observations. Similarity matching objectives have served as successful starting points for deriving online algorithms that map onto neural networks (NNs) with point neurons and Hebbian/anti-Hebbian plasticity. These NN models account for many anatomical and physiological observations; however, the objectives have limited computational power and the derived NNs do not explain multi-compartmental neuronal structures and non-Hebbian forms of plasticity that are prevalent throughout the brain. In this article, we review and unify recent extensions of the similarity matching approach to address more complex objectives, including a broad range of unsupervised and self-supervised learning tasks that can be formulated as generalized eigenvalue problems or nonnegative matrix factorization problems. Interestingly, the online algorithms derived from these objectives naturally map onto NNs with multi-compartmental neurons and local, non-Hebbian learning rules. Therefore, this unified extension of the similarity matching approach provides a normative framework that facilitates understanding the multi-compartmental neuronal structures and non-Hebbian plasticity found throughout the brain. ",
    "url": "https://arxiv.org/abs/2302.10051",
    "authors": [
      "David Lipshutz",
      "Yanis Bahroun",
      "Siavash Golkar",
      "Anirvan M. Sengupta",
      "Dmitri B. Chklovskii"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.10074",
    "title": "Quantum routing in planar graph using perfect state transfer",
    "abstract": "In this article, we consider a spin-spin interaction network governed by $XX + YY$ Hamiltonian. The vertices and edges of the network represent the spin objects and their interactions, respectively. We take a privilege to switch on or off any interaction, that assists us to perform multiple perfect state transfers in a graph simultaneously. We also build up a salable network allowing quantum communication between two arbitrary vertices. Later we utilize the combinatorial characteristics of hypercube graphs to propose a static routing schema to communicate simultaneously between a set of senders and a set of receivers in a planar network. Our construction is new and significantly powerful. We elaborate multiple examples of planar graphs supporting quantum routing where classical routing is not possible. ",
    "url": "https://arxiv.org/abs/2302.10074",
    "authors": [
      "Supriyo Dutta"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2302.10128",
    "title": "Sketch In, Sketch Out: Accelerating both Learning and Inference for  Structured Prediction with Kernels",
    "abstract": "Surrogate kernel-based methods offer a flexible solution to structured output prediction by leveraging the kernel trick in both input and output spaces. In contrast to energy-based models, they avoid to pay the cost of inference during training, while enjoying statistical guarantees. However, without approximation, these approaches are condemned to be used only on a limited amount of training data. In this paper, we propose to equip surrogate kernel methods with approximations based on sketching, seen as low rank projections of feature maps both on input and output feature maps. We showcase the approach on Input Output Kernel ridge Regression (or Kernel Dependency Estimation) and provide excess risk bounds that can be in turn directly plugged on the final predictive model. An analysis of the complexity in time and memory show that sketching the input kernel mostly reduces training time while sketching the output kernel allows to reduce the inference time. Furthermore, we show that Gaussian and sub-Gaussian sketches are admissible sketches in the sense that they induce projection operators ensuring a small excess risk. Experiments on different tasks consolidate our findings. ",
    "url": "https://arxiv.org/abs/2302.10128",
    "authors": [
      "Tamim El Ahmad",
      "Luc Brogat-Motte",
      "Pierre Laforgue",
      "Florence d'Alché-Buc"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.10147",
    "title": "A DNN based Normalized Time-frequency Weighted Criterion for Robust  Wideband DoA Estimation",
    "abstract": "Deep neural networks (DNNs) have greatly benefited direction of arrival (DoA) estimation methods for speech source localization in noisy environments. However, their localization accuracy is still far from satisfactory due to the vulnerability to nonspeech interference. To improve the robustness against interference, we propose a DNN based normalized time-frequency (T-F) weighted criterion which minimizes the distance between the candidate steering vectors and the filtered snapshots in the T-F domain. Our method requires no eigendecomposition and uses a simple normalization to prevent the optimization objective from being misled by noisy filtered snapshots. We also study different designs of T-F weights guided by a DNN. We find that duplicating the Hadamard product of speech ratio masks is highly effective and better than other techniques such as direct masking and taking the mean in the proposed approach. However, the best-performing design of T-F weights is criterion-dependent in general. Experiments show that the proposed method outperforms popular DNN based DoA estimation methods including widely used subspace methods in noisy and reverberant environments. ",
    "url": "https://arxiv.org/abs/2302.10147",
    "authors": [
      "Kuan-Lin Chen",
      "Ching-Hua Lee",
      "Bhaskar D. Rao",
      "Harinath Garudadri"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:1912.12979",
    "title": "Discriminative Clustering with Representation Learning with any Ratio of  Labeled to Unlabeled Data",
    "abstract": " Comments: Published in Statistics and Computing, 2022 ",
    "url": "https://arxiv.org/abs/1912.12979",
    "authors": [
      "Corinne Jones",
      "Vincent Roulet",
      "Zaid Harchaoui"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2011.05367",
    "title": "Detecting Social Media Manipulation in Low-Resource Languages",
    "abstract": " Title: Detecting Social Media Manipulation in Low-Resource Languages ",
    "url": "https://arxiv.org/abs/2011.05367",
    "authors": [
      "Samar Haider",
      "Luca Luceri",
      "Ashok Deb",
      "Adam Badawy",
      "Nanyun Peng",
      "Emilio Ferrara"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2012.01724",
    "title": "Parallel Residual Bi-Fusion Feature Pyramid Network for Accurate  Single-Shot Object Detection",
    "abstract": " Comments: accepted by IEEE transactions on Image Processing ",
    "url": "https://arxiv.org/abs/2012.01724",
    "authors": [
      "Ping-Yang Chen",
      "Ming-Ching Chang",
      "Jun-Wei Hsieh",
      "Yong-Sheng Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2102.06514",
    "title": "Large-Scale Representation Learning on Graphs via Bootstrapping",
    "abstract": " Comments: Published as a conference paper at ICLR 2022 ",
    "url": "https://arxiv.org/abs/2102.06514",
    "authors": [
      "Shantanu Thakoor",
      "Corentin Tallec",
      "Mohammad Gheshlaghi Azar",
      "Mehdi Azabou",
      "Eva L. Dyer",
      "Rémi Munos",
      "Petar Veličković",
      "Michal Valko"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.16198",
    "title": "Adversarial examples within the training distribution: A widespread  challenge",
    "abstract": " Title: Adversarial examples within the training distribution: A widespread  challenge ",
    "url": "https://arxiv.org/abs/2106.16198",
    "authors": [
      "Spandan Madan",
      "Tomotake Sasaki",
      "Hanspeter Pfister",
      "Tzu-Mao Li",
      "Xavier Boix"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.02450",
    "title": "End-To-End Data-Dependent Routing in Multi-Path Neural Networks",
    "abstract": " Comments: Neural Computing and Applications 2023 ",
    "url": "https://arxiv.org/abs/2107.02450",
    "authors": [
      "Dumindu Tissera",
      "Rukshan Wijessinghe",
      "Kasun Vithanage",
      "Alex Xavier",
      "Subha Fernando",
      "Ranga Rodrigo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.07978",
    "title": "Nodal auxiliary space preconditioning for the surface de Rham complex",
    "abstract": " Comments: 29 pages ",
    "url": "https://arxiv.org/abs/2107.07978",
    "authors": [
      "Yuwen Li"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2107.08020",
    "title": "Online Graph Topology Learning from Matrix-valued Time Series",
    "abstract": " Title: Online Graph Topology Learning from Matrix-valued Time Series ",
    "url": "https://arxiv.org/abs/2107.08020",
    "authors": [
      "Yiye Jiang",
      "Jérémie Bigot",
      "Sofian Maabout"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.08461",
    "title": "Differentially Private Bayesian Neural Networks on Accuracy, Privacy and  Reliability",
    "abstract": " Title: Differentially Private Bayesian Neural Networks on Accuracy, Privacy and  Reliability ",
    "url": "https://arxiv.org/abs/2107.08461",
    "authors": [
      "Qiyiwen Zhang",
      "Zhiqi Bu",
      "Kan Chen",
      "Qi Long"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2109.08927",
    "title": "Weakly Supervised Explainable Phrasal Reasoning with Neural Fuzzy Logic",
    "abstract": " Comments: Accepted by ICLR 2023 ",
    "url": "https://arxiv.org/abs/2109.08927",
    "authors": [
      "Zijun Wu",
      "Zi Xuan Zhang",
      "Atharva Naik",
      "Zhijian Mei",
      "Mauajama Firdaus",
      "Lili Mou"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.14082",
    "title": "Sample-Efficient Safety Assurances using Conformal Prediction",
    "abstract": " Title: Sample-Efficient Safety Assurances using Conformal Prediction ",
    "url": "https://arxiv.org/abs/2109.14082",
    "authors": [
      "Rachel Luo",
      "Shengjia Zhao",
      "Jonathan Kuck",
      "Boris Ivanovic",
      "Silvio Savarese",
      "Edward Schmerling",
      "Marco Pavone"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.15538",
    "title": "On Cross-Layer Alignment for Model Fusion of Heterogeneous Neural  Networks",
    "abstract": " Comments: Accepted to ICASSP 2023, 30 pages, 4 figures, 21 tables ",
    "url": "https://arxiv.org/abs/2110.15538",
    "authors": [
      "Dang Nguyen",
      "Trang Nguyen",
      "Khai Nguyen",
      "Dinh Phung",
      "Hung Bui",
      "Nhat Ho"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.02306",
    "title": "Leveraging Causal Graphs for Blocking in Randomized Experiments",
    "abstract": " Comments: 22 pages, 6 figures, and 1 table; Accepted for presentation at the 2nd Conference on Causal Learning and Reasoning (CLeaR 2023), T\\\"ubingen, Germany; To be published in the Proceedings of Machine Learning Research (PMLR) ",
    "url": "https://arxiv.org/abs/2111.02306",
    "authors": [
      "Abhishek Kumar Umrawal"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Econometrics (econ.EM)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.05648",
    "title": "Minimax detection of localized signals in statistical inverse problems",
    "abstract": " Title: Minimax detection of localized signals in statistical inverse problems ",
    "url": "https://arxiv.org/abs/2112.05648",
    "authors": [
      "Markus Pohlmann",
      "Frank Werner",
      "Axel Munk"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2112.05965",
    "title": "Parallelized Robust Distributed Model Predictive Control in the Presence  of Coupled State Constraints",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2112.05965 ",
    "url": "https://arxiv.org/abs/2112.05965",
    "authors": [
      "Adrian Wiltz",
      "Fei Chen",
      "Dimos V. Dimarogonas"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2112.13246",
    "title": "Towards Federated Learning on Time-Evolving Heterogeneous Data",
    "abstract": " Title: Towards Federated Learning on Time-Evolving Heterogeneous Data ",
    "url": "https://arxiv.org/abs/2112.13246",
    "authors": [
      "Yongxin Guo",
      "Tao Lin",
      "Xiaoying Tang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.06860",
    "title": "Hodge allocation for cooperative rewards: a generalization of Shapley's  cooperative value allocation theory via Hodge theory on graphs",
    "abstract": " Comments: This article embodies the author's articles arxiv.org/abs/2106.15094 and arxiv.org/abs/2107.10510. v4 represents a thorough revision, with new results, figures and title ",
    "url": "https://arxiv.org/abs/2203.06860",
    "authors": [
      "Tongseok Lim"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Computer Science and Game Theory (cs.GT)",
      "Theoretical Economics (econ.TH)",
      "Mathematical Physics (math-ph)"
    ]
  },
  {
    "id": "arXiv:2203.07302",
    "title": "Mixed Evidence for Gestalt Grouping in Deep Neural Networks",
    "abstract": " Comments: Accepted in Computational Brain & Behaviour ",
    "url": "https://arxiv.org/abs/2203.07302",
    "authors": [
      "Valerio Biscione",
      "Jeffrey S. Bowers"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.09952",
    "title": "Conquering Ghosts: Relation Learning for Information Reliability  Representation and End-to-End Robust Navigation",
    "abstract": " Title: Conquering Ghosts: Relation Learning for Information Reliability  Representation and End-to-End Robust Navigation ",
    "url": "https://arxiv.org/abs/2203.09952",
    "authors": [
      "Kefan Jin",
      "Xingyao Han"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.14495",
    "title": "Conjugate Gradient Method for Generative Adversarial Networks",
    "abstract": " Comments: Accepted to AISTATS 2023 ",
    "url": "https://arxiv.org/abs/2203.14495",
    "authors": [
      "Hiroki Naganuma",
      "Hideaki Iiduka"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.15878",
    "title": "Characterizations of graph classes via convex geometries: A survey",
    "abstract": " Comments: 18 pages ",
    "url": "https://arxiv.org/abs/2203.15878",
    "authors": [
      "Mitre C. Dourado",
      "Marisa Gutierrez",
      "Fábio Protti",
      "Rudini Sampaio",
      "Silvia Tondato"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2205.09435",
    "title": "Adversarial random forests for density estimation and generative  modeling",
    "abstract": " Comments: Camera ready version (AISTATS 2023) ",
    "url": "https://arxiv.org/abs/2205.09435",
    "authors": [
      "David S. Watson",
      "Kristin Blesch",
      "Jan Kapar",
      "Marvin N. Wright"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2205.12886",
    "title": "You Need to Read Again: Multi-granularity Perception Network for Moment  Retrieval in Videos",
    "abstract": " Comments: in SIGIR 2022 ",
    "url": "https://arxiv.org/abs/2205.12886",
    "authors": [
      "Xin Sun",
      "Xuan Wang",
      "Jialin Gao",
      "Qiong Liu",
      "Xi Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2205.13705",
    "title": "Heterogeneous Collaborative Learning for Personalized Healthcare  Analytics via Messenger Distillation",
    "abstract": " Title: Heterogeneous Collaborative Learning for Personalized Healthcare  Analytics via Messenger Distillation ",
    "url": "https://arxiv.org/abs/2205.13705",
    "authors": [
      "Guanhua Ye",
      "Tong Chen",
      "Yawen Li",
      "Lizhen Cui",
      "Quoc Viet Hung Nguyen",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2205.15814",
    "title": "Contrasting quadratic assignments for set-based representation learning",
    "abstract": " Title: Contrasting quadratic assignments for set-based representation learning ",
    "url": "https://arxiv.org/abs/2205.15814",
    "authors": [
      "Artem Moskalev",
      "Ivan Sosnovik",
      "Volker Fischer",
      "Arnold Smeulders"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.01804",
    "title": "A tensor factorization model of multilayer network interdependence",
    "abstract": " Title: A tensor factorization model of multilayer network interdependence ",
    "url": "https://arxiv.org/abs/2206.01804",
    "authors": [
      "Izabel Aguiar",
      "Dane Taylor",
      "Johan Ugander"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2206.02058",
    "title": "When Personalization Harms: Reconsidering the Use of Group Attributes in  Prediction",
    "abstract": " Title: When Personalization Harms: Reconsidering the Use of Group Attributes in  Prediction ",
    "url": "https://arxiv.org/abs/2206.02058",
    "authors": [
      "Vinith M. Suriyakumar",
      "Marzyeh Ghassemi",
      "Berk Ustun"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.03410",
    "title": "Fast and Robust Non-Rigid Registration Using Accelerated  Majorization-Minimization",
    "abstract": " Comments: Accepted to IEEE Transactions on Pattern Analysis and Machine Intelligence ",
    "url": "https://arxiv.org/abs/2206.03410",
    "authors": [
      "Yuxin Yao",
      "Bailin Deng",
      "Weiwei Xu",
      "Juyong Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2206.05263",
    "title": "Causal Balancing for Domain Generalization",
    "abstract": " Comments: Published at ICLR 2023 ",
    "url": "https://arxiv.org/abs/2206.05263",
    "authors": [
      "Xinyi Wang",
      "Michael Saxon",
      "Jiachen Li",
      "Hongyang Zhang",
      "Kun Zhang",
      "William Yang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.06318",
    "title": "Limited-Trust in Diffusion of Competing Alternatives over Social  Networks",
    "abstract": " Title: Limited-Trust in Diffusion of Competing Alternatives over Social  Networks ",
    "url": "https://arxiv.org/abs/2206.06318",
    "authors": [
      "Vincent Leon",
      "S. Rasoul Etesami",
      "Rakesh Nagi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computer Science and Game Theory (cs.GT)",
      "Theoretical Economics (econ.TH)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2206.13092",
    "title": "Split Localized Conformal Prediction",
    "abstract": " Comments: 21 pages, 7 figures, 8 tables ",
    "url": "https://arxiv.org/abs/2206.13092",
    "authors": [
      "Xing Han",
      "Ziyang Tang",
      "Joydeep Ghosh",
      "Qiang Liu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.04396",
    "title": "Graph Generative Model for Benchmarking Graph Neural Networks",
    "abstract": " Title: Graph Generative Model for Benchmarking Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2207.04396",
    "authors": [
      "Minji Yoon",
      "Yue Wu",
      "John Palowitch",
      "Bryan Perozzi",
      "Ruslan Salakhutdinov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2207.05987",
    "title": "DocPrompting: Generating Code by Retrieving the Docs",
    "abstract": " Comments: ICLR 2023 (notable-top-25%); code and data are available at this https URL ",
    "url": "https://arxiv.org/abs/2207.05987",
    "authors": [
      "Shuyan Zhou",
      "Uri Alon",
      "Frank F. Xu",
      "Zhiruo Wang",
      "Zhengbao Jiang",
      "Graham Neubig"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2207.06221",
    "title": "Collaboration-Aware Graph Convolutional Network for Recommender Systems",
    "abstract": " Title: Collaboration-Aware Graph Convolutional Network for Recommender Systems ",
    "url": "https://arxiv.org/abs/2207.06221",
    "authors": [
      "Yu Wang",
      "Yuying Zhao",
      "Yi Zhang",
      "Tyler Derr"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.08937",
    "title": "A Community-Aware Framework for Social Influence Maximization",
    "abstract": " Comments: 14 pages, 4 figures, and 7 tables; Accepted for publication in IEEE Transactions on Emerging Topics in Computational Intelligence (TETCI) in Dec 2022 ",
    "url": "https://arxiv.org/abs/2207.08937",
    "authors": [
      "Abhishek K. Umrawal",
      "Christopher J. Quinn",
      "Vaneet Aggarwal"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.10422",
    "title": "Differentiable Integrated Motion Prediction and Planning with Learnable  Cost Function for Autonomous Driving",
    "abstract": " Title: Differentiable Integrated Motion Prediction and Planning with Learnable  Cost Function for Autonomous Driving ",
    "url": "https://arxiv.org/abs/2207.10422",
    "authors": [
      "Zhiyu Huang",
      "Haochen Liu",
      "Jingda Wu",
      "Chen Lv"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2208.00971",
    "title": "Probabilistic forecasts of extreme heatwaves using convolutional neural  networks in a regime of lack of data",
    "abstract": " Comments: 34 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2208.00971",
    "authors": [
      "George Miloshevich",
      "Bastien Cozian",
      "Patrice Abry",
      "Pierre Borgnat",
      "Freddy Bouchet"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2208.01359",
    "title": "Solving singular generalized eigenvalue problems. Part II: projection  and augmentation",
    "abstract": " Title: Solving singular generalized eigenvalue problems. Part II: projection  and augmentation ",
    "url": "https://arxiv.org/abs/2208.01359",
    "authors": [
      "Michiel E. Hochstenbach",
      "Christian Mehl",
      "Bor Plestenjak"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2208.05728",
    "title": "Continual Transfer Learning for Cross-Domain Click-Through Rate  Prediction at Taobao",
    "abstract": " Comments: Accepted by WWW 2023 industry track ",
    "url": "https://arxiv.org/abs/2208.05728",
    "authors": [
      "Lixin Liu",
      "Yanling Wang",
      "Tianming Wang",
      "Dong Guan",
      "Jiawei Wu",
      "Jingxu Chen",
      "Rong Xiao",
      "Wenxiang Zhu",
      "Fei Fang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2208.06073",
    "title": "Conditional Antibody Design as 3D Equivariant Graph Translation",
    "abstract": " Comments: Accepted to ICLR 2023 as oral presentation ",
    "url": "https://arxiv.org/abs/2208.06073",
    "authors": [
      "Xiangzhe Kong",
      "Wenbing Huang",
      "Yang Liu"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.08320",
    "title": "BIC: Twitter Bot Detection with Text-Graph Interaction and Semantic  Consistency",
    "abstract": " Title: BIC: Twitter Bot Detection with Text-Graph Interaction and Semantic  Consistency ",
    "url": "https://arxiv.org/abs/2208.08320",
    "authors": [
      "Zhenyu Lei",
      "Herun Wan",
      "Wenqian Zhang",
      "Shangbin Feng",
      "Zilong Chen",
      "Jundong Li",
      "Qinghua Zheng",
      "Minnan Luo"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.10024",
    "title": "GCISG: Guided Causal Invariant Learning for Improved Syn-to-real  Generalization",
    "abstract": " Comments: Accepted to ECCV 2022 ",
    "url": "https://arxiv.org/abs/2208.10024",
    "authors": [
      "Gilhyun Nam",
      "Gyeongjae Choi",
      "Kyungmin Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.14153",
    "title": "Identifying Weight-Variant Latent Causal Models",
    "abstract": " Title: Identifying Weight-Variant Latent Causal Models ",
    "url": "https://arxiv.org/abs/2208.14153",
    "authors": [
      "Yuhang Liu",
      "Zhen Zhang",
      "Dong Gong",
      "Mingming Gong",
      "Biwei Huang",
      "Anton van den Hengel",
      "Kun Zhang",
      "Javen Qinfeng Shi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.00445",
    "title": "Interpreting Embedding Spaces by Conceptualization",
    "abstract": " Title: Interpreting Embedding Spaces by Conceptualization ",
    "url": "https://arxiv.org/abs/2209.00445",
    "authors": [
      "Adi Simhi",
      "Shaul Markovitch"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.03255",
    "title": "No More Attacks on Proof-of-Stake Ethereum?",
    "abstract": " Title: No More Attacks on Proof-of-Stake Ethereum? ",
    "url": "https://arxiv.org/abs/2209.03255",
    "authors": [
      "Francesco D'Amato",
      "Joachim Neu",
      "Ertem Nusret Tas",
      "David Tse"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2209.03753",
    "title": "Improved Robust Algorithms for Learning with Discriminative Feature  Feedback",
    "abstract": " Comments: AISTATS 2023 ",
    "url": "https://arxiv.org/abs/2209.03753",
    "authors": [
      "Sivan Sabato"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.06520",
    "title": "Scalable Spatiotemporal Graph Neural Networks",
    "abstract": " Comments: Published as conference paper at AAAI 23 ",
    "url": "https://arxiv.org/abs/2209.06520",
    "authors": [
      "Andrea Cini",
      "Ivan Marisca",
      "Filippo Maria Bianchi",
      "Cesare Alippi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.07334",
    "title": "What is a good doge? Analyzing the patrician social network of the  Republic of Venice",
    "abstract": " Title: What is a good doge? Analyzing the patrician social network of the  Republic of Venice ",
    "url": "https://arxiv.org/abs/2209.07334",
    "authors": [
      "J. J. Merelo-Guervós"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2209.08647",
    "title": "Why Deep Surgical Models Fail?: Revisiting Surgical Action Triplet  Recognition through the Lens of Robustness",
    "abstract": " Title: Why Deep Surgical Models Fail?: Revisiting Surgical Action Triplet  Recognition through the Lens of Robustness ",
    "url": "https://arxiv.org/abs/2209.08647",
    "authors": [
      "Yanqi Cheng",
      "Lihao Liu",
      "Shujun Wang",
      "Yueming Jin",
      "Carola-Bibiane Schönlieb",
      "Angelica I. Aviles-Rivero"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.12340",
    "title": "Solving Seismic Wave Equations on Variable Velocity Models with Fourier  Neural Operator",
    "abstract": " Comments: 26 pages, 17 figures ",
    "url": "https://arxiv.org/abs/2209.12340",
    "authors": [
      "Bian Li",
      "Hanchen Wang",
      "Xiu Yang",
      "Youzuo Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Geophysics (physics.geo-ph)"
    ]
  },
  {
    "id": "arXiv:2209.15265",
    "title": "Overparameterized ReLU Neural Networks Learn the Simplest Models: Neural  Isometry and Exact Recovery",
    "abstract": " Title: Overparameterized ReLU Neural Networks Learn the Simplest Models: Neural  Isometry and Exact Recovery ",
    "url": "https://arxiv.org/abs/2209.15265",
    "authors": [
      "Yifei Wang",
      "Yixuan Hua",
      "Emmanuel Candés",
      "Mert Pilanci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2210.00665",
    "title": "Distributed Non-Convex Optimization with One-Bit Compressors on  Heterogeneous Data: Efficient and Resilient Algorithms",
    "abstract": " Title: Distributed Non-Convex Optimization with One-Bit Compressors on  Heterogeneous Data: Efficient and Resilient Algorithms ",
    "url": "https://arxiv.org/abs/2210.00665",
    "authors": [
      "Ming Xiang",
      "Lili Su"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2210.02113",
    "title": "Optimization-Informed Neural Networks",
    "abstract": " Comments: I need to retract this paper because it has many problems in the methodological design as well as in the mathematical proof. These errors will mislead the readers! And it is difficult for me to fix these errors in a short time ",
    "url": "https://arxiv.org/abs/2210.02113",
    "authors": [
      "Dawen Wu",
      "Abdel Lisser"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2210.02299",
    "title": "SHINE-Mapping: Large-Scale 3D Mapping Using Sparse Hierarchical Implicit  Neural Representations",
    "abstract": " Comments: 6+1 pages, accepted at ICRA'23 ",
    "url": "https://arxiv.org/abs/2210.02299",
    "authors": [
      "Xingguang Zhong",
      "Yue Pan",
      "Jens Behley",
      "Cyrill Stachniss"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2210.03458",
    "title": "PAC Security: Automatic Privacy Measurement and Control of Data  Processing",
    "abstract": " Title: PAC Security: Automatic Privacy Measurement and Control of Data  Processing ",
    "url": "https://arxiv.org/abs/2210.03458",
    "authors": [
      "Hanshen Xiao",
      "Srinivas Devadas"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2210.03952",
    "title": "Detaching and Boosting: Dual Engine for Scale-Invariant Self-Supervised  Monocular Depth Estimation",
    "abstract": " Comments: Accepted by ICLR and IEEE Robotics and Automation Letters (RAL) ",
    "url": "https://arxiv.org/abs/2210.03952",
    "authors": [
      "Peizhe Jiang",
      "Wei Yang",
      "Xiaoqing Ye",
      "Xiao Tan",
      "Meng Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.10570",
    "title": "Spoofed training data for speech spoofing countermeasure can be  efficiently created using neural vocoders",
    "abstract": " Comments: ICASSP 2023 accepted. Code: this https URL ",
    "url": "https://arxiv.org/abs/2210.10570",
    "authors": [
      "Xin Wang",
      "Junichi Yamagishi"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2210.14688",
    "title": "Scaling Law Analysis for Covariance Based Activity Detection in  Cooperative Multi-Cell Massive MIMO",
    "abstract": " Comments: 5 pages, 2 figures, accepted for publication in IEEE ICASSP 2023 ",
    "url": "https://arxiv.org/abs/2210.14688",
    "authors": [
      "Ziyue Wang",
      "Ya-Feng Liu",
      "Zhaorui Wang",
      "Wei Yu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2210.15947",
    "title": "NeRFPlayer: A Streamable Dynamic Scene Representation with Decomposed  Neural Radiance Fields",
    "abstract": " Comments: Project page: this https URL ",
    "url": "https://arxiv.org/abs/2210.15947",
    "authors": [
      "Liangchen Song",
      "Anpei Chen",
      "Zhong Li",
      "Zhang Chen",
      "Lele Chen",
      "Junsong Yuan",
      "Yi Xu",
      "Andreas Geiger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2210.15976",
    "title": "BEBERT: Efficient and Robust Binary Ensemble BERT",
    "abstract": " Comments: To appear in 2023 IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP 2023) ",
    "url": "https://arxiv.org/abs/2210.15976",
    "authors": [
      "Jiayi Tian",
      "Chao Fang",
      "Haonan Wang",
      "Zhongfeng Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.16127",
    "title": "Target-Speaker Voice Activity Detection via Sequence-to-Sequence  Prediction",
    "abstract": " Comments: Accepted by ICASSP2023 ",
    "url": "https://arxiv.org/abs/2210.16127",
    "authors": [
      "Ming Cheng",
      "Weiqing Wang",
      "Yucong Zhang",
      "Xiaoyi Qin",
      "Ming Li"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2210.16498",
    "title": "Articulatory Representation Learning Via Joint Factor Analysis and  Neural Matrix Factorization",
    "abstract": " Comments: Accepted to 2023 ICASSP. Camera Ready ",
    "url": "https://arxiv.org/abs/2210.16498",
    "authors": [
      "Jiachen Lian",
      "Alan W Black",
      "Yijing Lu",
      "Louis Goldstein",
      "Shinji Watanabe",
      "Gopala K. Anumanchipalli"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2210.16535",
    "title": "Causal Discovery of Dynamic Models for Predicting Human Spatial  Interactions",
    "abstract": " Comments: Published at 2022 International Conference on Social Robotics (ICSR) ",
    "url": "https://arxiv.org/abs/2210.16535",
    "authors": [
      "Luca Castri",
      "Sariah Mghames",
      "Marc Hanheide",
      "Nicola Bellotto"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.00241",
    "title": "Adversarial Policies Beat Superhuman Go AIs",
    "abstract": " Comments: 58 pages, see paper for changelog ",
    "url": "https://arxiv.org/abs/2211.00241",
    "authors": [
      "Tony T. Wang",
      "Adam Gleave",
      "Tom Tseng",
      "Nora Belrose",
      "Kellin Pelrine",
      "Joseph Miller",
      "Michael D Dennis",
      "Yawen Duan",
      "Viktor Pogrebniak",
      "Sergey Levine",
      "Stuart Russell"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2211.01177",
    "title": "Neural Systematic Binder",
    "abstract": " Comments: Project Page: this https URL ",
    "url": "https://arxiv.org/abs/2211.01177",
    "authors": [
      "Gautam Singh",
      "Yeongbin Kim",
      "Sungjin Ahn"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.06291",
    "title": "Do Bayesian Neural Networks Need To Be Fully Stochastic?",
    "abstract": " Comments: Published at AISTATS2023 (Oral) ",
    "url": "https://arxiv.org/abs/2211.06291",
    "authors": [
      "Mrinank Sharma",
      "Sebastian Farquhar",
      "Eric Nalisnick",
      "Tom Rainforth"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2211.08573",
    "title": "Realization of Causal Representation Learning to Adjust Confounding Bias  in Latent Space",
    "abstract": " Title: Realization of Causal Representation Learning to Adjust Confounding Bias  in Latent Space ",
    "url": "https://arxiv.org/abs/2211.08573",
    "authors": [
      "Jia Li",
      "Xiang Li",
      "Xiaowei Jia",
      "Michael Steinbach",
      "Vipin Kumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2211.11505",
    "title": "Local-to-Global Registration for Bundle-Adjusting Neural Radiance Fields",
    "abstract": " Title: Local-to-Global Registration for Bundle-Adjusting Neural Radiance Fields ",
    "url": "https://arxiv.org/abs/2211.11505",
    "authors": [
      "Yue Chen",
      "Xingyu Chen",
      "Xuan Wang",
      "Qi Zhang",
      "Yu Guo",
      "Ying Shan",
      "Fei Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.12040",
    "title": "Rethinking Implicit Neural Representations for Vision Learners",
    "abstract": " Comments: Accepted to IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 2023 ",
    "url": "https://arxiv.org/abs/2211.12040",
    "authors": [
      "Yiran Song",
      "Qianyu Zhou",
      "Lizhuang Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.15028",
    "title": "Joint Multimodal Entity-Relation Extraction Based on Edge-enhanced Graph  Alignment Network and Word-pair Relation Tagging",
    "abstract": " Comments: accepted in AAAI-2023 ",
    "url": "https://arxiv.org/abs/2211.15028",
    "authors": [
      "Li Yuan",
      "Yi Cai",
      "Jin Wang",
      "Qing Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2212.01957",
    "title": "CSTAR: Towards Compact and STructured Deep Neural Networks with  Adversarial Robustness",
    "abstract": " Comments: AAAI-23 ",
    "url": "https://arxiv.org/abs/2212.01957",
    "authors": [
      "Huy Phan",
      "Miao Yin",
      "Yang Sui",
      "Bo Yuan",
      "Saman Zonouz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.04703",
    "title": "Implementing Neural Network-Based Equalizers in a Coherent Optical  Transmission System Using Field-Programmable Gate Arrays",
    "abstract": " Comments: Invited paper at Journal of Lightwave Technology - IEEE ",
    "url": "https://arxiv.org/abs/2212.04703",
    "authors": [
      "Pedro J. Freire",
      "Sasipim Srivallapanondh",
      "Michael Anderson",
      "Bernhard Spinnler",
      "Thomas Bex",
      "Tobias A. Eriksson",
      "Antonio Napoli",
      "Wolfgang Schairer",
      "Nelson Costa",
      "Michaela Blott",
      "Sergei K. Turitsyn",
      "Jaroslaw E. Prilepsky"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Hardware Architecture (cs.AR)",
      "Computational Complexity (cs.CC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.04983",
    "title": "Adversarial Weight Perturbation Improves Generalization in Graph Neural  Networks",
    "abstract": " Comments: AAAI 2023 (oral) ",
    "url": "https://arxiv.org/abs/2212.04983",
    "authors": [
      "Yihan Wu",
      "Aleksandar Bojchevski",
      "Heng Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.05354",
    "title": "Phenomenological modeling of diverse and heterogeneous synaptic dynamics  at natural density",
    "abstract": " Comments: 38 pages, 5 figures, LaTeX; added two figures, clarified and extended formulations, updated format, added references ",
    "url": "https://arxiv.org/abs/2212.05354",
    "authors": [
      "Agnes Korcsak-Gorzo",
      "Charl Linssen",
      "Jasper Albers",
      "Stefan Dasbach",
      "Renato Duarte",
      "Susanne Kunkel",
      "Abigail Morrison",
      "Johanna Senk",
      "Jonas Stapmanns",
      "Tom Tetzlaff",
      "Markus Diesmann",
      "Sacha J. van Albada"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2212.06008",
    "title": "Who Evaluates the Evaluators? On Automatic Metrics for Assessing  AI-based Offensive Code Generators",
    "abstract": " Title: Who Evaluates the Evaluators? On Automatic Metrics for Assessing  AI-based Offensive Code Generators ",
    "url": "https://arxiv.org/abs/2212.06008",
    "authors": [
      "Pietro Liguori",
      "Cristina Improta",
      "Roberto Natella",
      "Bojan Cukic",
      "Domenico Cotroneo"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.09060",
    "title": "Parsing as a lifting problem and the Chomsky-Schützenberger  representation theorem",
    "abstract": " Comments: reformatted for publication in ENTICS, proceedings of MFPS 2022 ",
    "url": "https://arxiv.org/abs/2212.09060",
    "authors": [
      "Paul-André Melliès",
      "Noam Zeilberger"
    ],
    "subjectives": [
      "Category Theory (math.CT)",
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2212.09970",
    "title": "Data Augmentation on Graphs: A Technical Survey",
    "abstract": " Comments: Under review ",
    "url": "https://arxiv.org/abs/2212.09970",
    "authors": [
      "Jiajun Zhou",
      "Chenxuan Xie",
      "Zhenyu Wen",
      "Xiangyu Zhao",
      "Qi Xuan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.12317",
    "title": "Matching Cuts in Graphs of High Girth and H-Free Graphs",
    "abstract": " Title: Matching Cuts in Graphs of High Girth and H-Free Graphs ",
    "url": "https://arxiv.org/abs/2212.12317",
    "authors": [
      "Carl Feghali",
      "Felicia Lucke",
      "Daniel Paulusma",
      "Bernard Ries"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2212.12440",
    "title": "HAC-Net: A Hybrid Attention-Based Convolutional Neural Network for  Highly Accurate Protein-Ligand Binding Affinity Prediction",
    "abstract": " Title: HAC-Net: A Hybrid Attention-Based Convolutional Neural Network for  Highly Accurate Protein-Ligand Binding Affinity Prediction ",
    "url": "https://arxiv.org/abs/2212.12440",
    "authors": [
      "Gregory W. Kyro",
      "Rafael I. Brent",
      "Victor S. Batista"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14548",
    "title": "How would Stance Detection Techniques Evolve after the Launch of  ChatGPT?",
    "abstract": " Title: How would Stance Detection Techniques Evolve after the Launch of  ChatGPT? ",
    "url": "https://arxiv.org/abs/2212.14548",
    "authors": [
      "Bowen Zhang",
      "Daijun Ding",
      "Liwen Jing"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.03049",
    "title": "AutoAC: Towards Automated Attribute Completion for Heterogeneous Graph  Neural Network",
    "abstract": " Title: AutoAC: Towards Automated Attribute Completion for Heterogeneous Graph  Neural Network ",
    "url": "https://arxiv.org/abs/2301.03049",
    "authors": [
      "Guanghui Zhu",
      "Zhennan Zhu",
      "Wenjie Wang",
      "Zhuoer Xu",
      "Chunfeng Yuan",
      "Yihua Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08859",
    "title": "Logical Message Passing Networks with One-hop Inference on Atomic  Formulas",
    "abstract": " Comments: Accepted by ICLR 2023. 20 pages, 4 figures, and 9 tables. Our implementation can be found at this https URL ",
    "url": "https://arxiv.org/abs/2301.08859",
    "authors": [
      "Zihao Wang",
      "Yangqiu Song",
      "Ginny Y. Wong",
      "Simon See"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2301.08930",
    "title": "Dense RGB SLAM with Neural Implicit Maps",
    "abstract": " Comments: Accepted by ICLR 2023; Camera-Ready Version; The code is at poptree.github.io/DIM-SLAM ",
    "url": "https://arxiv.org/abs/2301.08930",
    "authors": [
      "Heng Li",
      "Xiaodong Gu",
      "Weihao Yuan",
      "Luwei Yang",
      "Zilong Dong",
      "Ping Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.09771",
    "title": "Automation and AI Technology in Surface Mining With a Brief Introduction  to Open-Pit Operations in the Pilbara",
    "abstract": " Comments: Keywords: Mining automation, robotics, intelligent systems, machine learning, remote sensing, geostatistics, planning, scheduling, optimization, modelling, geology, complex systems. Document: 12 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2301.09771",
    "authors": [
      "Raymond Leung",
      "Andrew J Hill",
      "Arman Melkumyan"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "General Literature (cs.GL)"
    ]
  },
  {
    "id": "arXiv:2301.11490",
    "title": "Neural Episodic Control with State Abstraction",
    "abstract": " Title: Neural Episodic Control with State Abstraction ",
    "url": "https://arxiv.org/abs/2301.11490",
    "authors": [
      "Zhuo Li",
      "Derui Zhu",
      "Yujing Hu",
      "Xiaofei Xie",
      "Lei Ma",
      "Yan Zheng",
      "Yan Song",
      "Yingfeng Chen",
      "Jianjun Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2301.13122",
    "title": "Towards Adversarial Realism and Robust Learning for IoT Intrusion  Detection and Classification",
    "abstract": " Comments: 19 pages, 5 tables, 7 figures, Annals of Telecommunications journal ",
    "url": "https://arxiv.org/abs/2301.13122",
    "authors": [
      "João Vitorino",
      "Isabel Praça",
      "Eva Maia"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.03251",
    "title": "SCALE-UP: An Efficient Black-box Input-level Backdoor Detection via  Analyzing Scaled Prediction Consistency",
    "abstract": " Title: SCALE-UP: An Efficient Black-box Input-level Backdoor Detection via  Analyzing Scaled Prediction Consistency ",
    "url": "https://arxiv.org/abs/2302.03251",
    "authors": [
      "Junfeng Guo",
      "Yiming Li",
      "Xun Chen",
      "Hanqing Guo",
      "Lichao Sun",
      "Cong Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.03881",
    "title": "On Generalized Degree Fairness in Graph Neural Networks",
    "abstract": " Comments: This paper has been accepted by AAAI 2023 ",
    "url": "https://arxiv.org/abs/2302.03881",
    "authors": [
      "Zemin Liu",
      "Trung-Kien Nguyen",
      "Yuan Fang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.05093",
    "title": "Unified Vision-Language Representation Modeling for E-Commerce  Same-Style Products Retrieval",
    "abstract": " Comments: Accepted in The Web Conference (WWW2023) Industry Track. 5 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2302.05093",
    "authors": [
      "Ben Chen",
      "Linbo Jin",
      "Xinxin Wang",
      "Dehong Gao",
      "Wen Jiang",
      "Wei Ning"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2302.06607",
    "title": "Generative Adversarial Equilibrium Solvers",
    "abstract": " Comments: 41 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2302.06607",
    "authors": [
      "Denizalp Goktas",
      "David C. Parkes",
      "Ian Gemp",
      "Luke Marris",
      "Georgios Piliouras",
      "Romuald Elie",
      "Guy Lever",
      "Andrea Tacchetti"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2302.07033",
    "title": "Model Checking Disjoint-Paths Logic on Topological-Minor-Free Graph  Classes",
    "abstract": " Title: Model Checking Disjoint-Paths Logic on Topological-Minor-Free Graph  Classes ",
    "url": "https://arxiv.org/abs/2302.07033",
    "authors": [
      "Nicole Schirrmacher",
      "Sebastian Siebertz",
      "Giannos Stamoulis",
      "Dimitrios M. Thilikos",
      "Alexandre Vigny"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2302.07360",
    "title": "Self-supervised learning of object pose estimation using keypoint  prediction",
    "abstract": " Comments: 21 pages, 9 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2302.07360",
    "authors": [
      "Zahra Gharaee",
      "Felix Järemo Lawin",
      "Per-Erik Forssén"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07868",
    "title": "Target Specific De Novo Design of Drug Candidate Molecules with Graph  Transformer-based Generative Adversarial Networks",
    "abstract": " Title: Target Specific De Novo Design of Drug Candidate Molecules with Graph  Transformer-based Generative Adversarial Networks ",
    "url": "https://arxiv.org/abs/2302.07868",
    "authors": [
      "Atabey Ünlü",
      "Elif Çevrim",
      "Ahmet Sarıgün",
      "Hayriye Çelikbilek",
      "Heval Ataş Güvenilir",
      "Altay Koyaş",
      "Deniz Cansen Kahraman",
      "Abdurrahman Olğaç",
      "Ahmet Rifaioğlu",
      "Tunca Doğan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2302.08070",
    "title": "Local Causal Discovery for Estimating Causal Effects",
    "abstract": " Comments: Accepted at CLeaR 2023 ",
    "url": "https://arxiv.org/abs/2302.08070",
    "authors": [
      "Shantanu Gupta",
      "David Childers",
      "Zachary C. Lipton"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2302.08727",
    "title": "Building Shortcuts between Distant Nodes with Biaffine Mapping for Graph  Convolutional Networks",
    "abstract": " Title: Building Shortcuts between Distant Nodes with Biaffine Mapping for Graph  Convolutional Networks ",
    "url": "https://arxiv.org/abs/2302.08727",
    "authors": [
      "Acong Zhang",
      "Jincheng Huang",
      "Ping Li",
      "Kai Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.08796",
    "title": "Approaching epidemiological dynamics of COVID-19 with physics-informed  neural networks",
    "abstract": " Comments: 23 pages, 14 figures ",
    "url": "https://arxiv.org/abs/2302.08796",
    "authors": [
      "Shuai Han",
      "Lukas Stelz",
      "Horst Stoecker",
      "Lingxiao Wang",
      "Kai Zhou"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Physics and Society (physics.soc-ph)",
      "Populations and Evolution (q-bio.PE)"
    ]
  },
  {
    "id": "arXiv:2302.08913",
    "title": "Referential communication in heterogeneous communities of pre-trained  visual deep networks",
    "abstract": " Title: Referential communication in heterogeneous communities of pre-trained  visual deep networks ",
    "url": "https://arxiv.org/abs/2302.08913",
    "authors": [
      "Matéo Mahaut",
      "Francesca Franzon",
      "Roberto Dessì",
      "Marco Baroni"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.08967",
    "title": "sMRI-PatchNet: A novel explainable patch-based deep learning network for  Alzheimer's disease diagnosis and discriminative atrophy localisation with  Structural MRI",
    "abstract": " Title: sMRI-PatchNet: A novel explainable patch-based deep learning network for  Alzheimer's disease diagnosis and discriminative atrophy localisation with  Structural MRI ",
    "url": "https://arxiv.org/abs/2302.08967",
    "authors": [
      "Xin Zhang",
      "Liangxiu Han",
      "Lianghao Han",
      "Haoming Chen",
      "Darren Dancey",
      "Daoqiang Zhang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  }
]