[
  {
    "id": "arXiv:2301.07107",
    "title": "Mortality Prediction with Adaptive Feature Importance Recalibration for  Peritoneal Dialysis Patients: a deep-learning-based study on a real-world  longitudinal follow-up dataset",
    "abstract": "Objective: Peritoneal Dialysis (PD) is one of the most widely used life-supporting therapies for patients with End-Stage Renal Disease (ESRD). Predicting mortality risk and identifying modifiable risk factors based on the Electronic Medical Records (EMR) collected along with the follow-up visits are of great importance for personalized medicine and early intervention. Here, our objective is to develop a deep learning model for a real-time, individualized, and interpretable mortality prediction model - AICare. Method and Materials: Our proposed model consists of a multi-channel feature extraction module and an adaptive feature importance recalibration module. AICare explicitly identifies the key features that strongly indicate the outcome prediction for each patient to build the health status embedding individually. This study has collected 13,091 clinical follow-up visits and demographic data of 656 PD patients. To verify the application universality, this study has also collected 4,789 visits of 1,363 hemodialysis dialysis (HD) as an additional experiment dataset to test the prediction performance, which will be discussed in the Appendix. Results: 1) Experiment results show that AICare achieves 81.6%/74.3% AUROC and 47.2%/32.5% AUPRC for the 1-year mortality prediction task on PD/HD dataset respectively, which outperforms the state-of-the-art comparative deep learning models. 2) This study first provides a comprehensive elucidation of the relationship between the causes of mortality in patients with PD and clinical features based on an end-to-end deep learning model. 3) This study first reveals the pattern of variation in the importance of each feature in the mortality prediction based on built-in interpretability. 4) We develop a practical AI-Doctor interaction system to visualize the trajectory of patients' health status and risk indicators. ",
    "url": "https://arxiv.org/abs/2301.07107",
    "authors": [
      "Liantao Ma",
      "Chaohe Zhang",
      "Junyi Gao",
      "Xianfeng Jiao",
      "Zhihao Yu",
      "Xinyu Ma",
      "Yasha Wang",
      "Wen Tang",
      "Xinju Zhao",
      "Wenjie Ruan",
      "Tao Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.07137",
    "title": "Heterogeneous Multi-Robot Reinforcement Learning",
    "abstract": "Cooperative multi-robot tasks can benefit from heterogeneity in the robots' physical and behavioral traits. In spite of this, traditional Multi-Agent Reinforcement Learning (MARL) frameworks lack the ability to explicitly accommodate policy heterogeneity, and typically constrain agents to share neural network parameters. This enforced homogeneity limits application in cases where the tasks benefit from heterogeneous behaviors. In this paper, we crystallize the role of heterogeneity in MARL policies. Towards this end, we introduce Heterogeneous Graph Neural Network Proximal Policy Optimization (HetGPPO), a paradigm for training heterogeneous MARL policies that leverages a Graph Neural Network for differentiable inter-agent communication. HetGPPO allows communicating agents to learn heterogeneous behaviors while enabling fully decentralized training in partially observable environments. We complement this with a taxonomical overview that exposes more heterogeneity classes than previously identified. To motivate the need for our model, we present a characterization of techniques that homogeneous models can leverage to emulate heterogeneous behavior, and show how this \"apparent heterogeneity\" is brittle in real-world conditions. Through simulations and real-world experiments, we show that: (i) when homogeneous methods fail due to strong heterogeneous requirements, HetGPPO succeeds, and, (ii) when homogeneous methods are able to learn apparently heterogeneous behaviors, HetGPPO achieves higher resilience to both training and deployment noise. ",
    "url": "https://arxiv.org/abs/2301.07137",
    "authors": [
      "Matteo Bettini",
      "Ajay Shankar",
      "Amanda Prorok"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2301.07144",
    "title": "The Feasibility of Algorithmic Detection and Decentralised Moderation  for Protecting Women from Online Abuse",
    "abstract": "Online abuse is becoming an increasingly prevalent issue in modern-day society, with 41 percent of Americans having experienced online harassment in some capacity in 2021. People who identify as women, in particular, can be subjected to a wide range of abusive behavior online, with gender-specific experiences cited broadly in recent literature across fields such as blogging, politics, and journalism. In response to this rise in abusive content, platforms have been found to largely employ \"individualistic moderation\" approaches, aiming to protect users from harmful content through the screening and management of singular interactions or accounts. Yet, previous work performed by the author of this paper has shown that in the cases of women in particular, these approaches can often be ineffective; failing to protect users from multi-dimensional abuse spanning prolonged time periods, different platforms, and varying interaction types. In recognition of its increasing complexity, platforms are beginning to outsource content moderation to users in a new and decentralized approach. The goal of this research is to examine the feasibility of using multidimensional abuse indicators in a Twitter-based moderation algorithm aiming to protect women from female-targeted online abuse. This research outlines three indicators of multidimensional abuse, explores how these indicators can be extracted as features from Twitter data, and proposes a technical framework for deploying an end-to-end moderation algorithm using these features. ",
    "url": "https://arxiv.org/abs/2301.07144",
    "authors": [
      "Sarah Barrington"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2301.07209",
    "title": "Learning a Formality-Aware Japanese Sentence Representation",
    "abstract": "While the way intermediate representations are generated in encoder-decoder sequence-to-sequence models typically allow them to preserve the semantics of the input sentence, input features such as formality might be left out. On the other hand, downstream tasks such as translation would benefit from working with a sentence representation that preserves formality in addition to semantics, so as to generate sentences with the appropriate level of social formality -- the difference between speaking to a friend versus speaking with a supervisor. We propose a sequence-to-sequence method for learning a formality-aware representation for Japanese sentences, where sentence generation is conditioned on both the original representation of the input sentence, and a side constraint which guides the sentence representation towards preserving formality information. Additionally, we propose augmenting the sentence representation with a learned representation of formality which facilitates the extraction of formality in downstream tasks. We address the lack of formality-annotated parallel data by adapting previous works on procedural formality classification of Japanese sentences. Experimental results suggest that our techniques not only helps the decoder recover the formality of the input sentence, but also slightly improves the preservation of input sentence semantics. ",
    "url": "https://arxiv.org/abs/2301.07209",
    "authors": [
      "Henry Li Xinyuan",
      "Ray Lee",
      "Jerry Chen",
      "Kelly Marchisio"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07261",
    "title": "A Note on the $k$-colored Crossing Ratio of Dense Geometric Graphs",
    "abstract": "A \\emph{geometric graph} is a graph whose vertex set is a set of points in general position in the plane, and its edges are straight line segments joining these points. We show that for every integer $k \\ge 2$, there exists a constat $c>0$ such that the following holds. The edges of every dense geometric graph can be colored with $k$ colors, such that the number of pairs of edges of the same color that cross is at most $(1/k-c)$ times the total number of pairs of edges that cross. The case when $k=2$ and $G$ is a complete geometric graph, was proved by Aichholzer et al.[\\emph{GD} 2019]. ",
    "url": "https://arxiv.org/abs/2301.07261",
    "authors": [
      "Ruy Fabila-Monroy"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2301.07275",
    "title": "Multi-compartment Neuron and Population Encoding improved Spiking Neural  Network for Deep Distributional Reinforcement Learning",
    "abstract": "Inspired by the information processing with binary spikes in the brain, the spiking neural networks (SNNs) exhibit significant low energy consumption and are more suitable for incorporating multi-scale biological characteristics. Spiking Neurons, as the basic information processing unit of SNNs, are often simplified in most SNNs which only consider LIF point neuron and do not take into account the multi-compartmental structural properties of biological neurons. This limits the computational and learning capabilities of SNNs. In this paper, we proposed a brain-inspired SNN-based deep distributional reinforcement learning algorithm with combination of bio-inspired multi-compartment neuron (MCN) model and population coding method. The proposed multi-compartment neuron built the structure and function of apical dendritic, basal dendritic, and somatic computing compartments to achieve the computational power close to that of biological neurons. Besides, we present an implicit fractional embedding method based on spiking neuron population encoding. We tested our model on Atari games, and the experiment results show that the performance of our model surpasses the vanilla ANN-based FQF model and ANN-SNN conversion method based Spiking-FQF models. The ablation experiments show that the proposed multi-compartment neural model and quantile fraction implicit population spike representation play an important role in realizing SNN-based deep distributional reinforcement learning. ",
    "url": "https://arxiv.org/abs/2301.07275",
    "authors": [
      "Yinqian Sun",
      "Yi Zeng",
      "Feifei Zhao",
      "Zhuoya Zhao"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.07281",
    "title": "Detecting and Ranking Causal Anomalies in End-to-End Complex System",
    "abstract": "With the rapid development of technology, the automated monitoring systems of large-scale factories are becoming more and more important. By collecting a large amount of machine sensor data, we can have many ways to find anomalies. We believe that the real core value of an automated monitoring system is to identify and track the cause of the problem. The most famous method for finding causal anomalies is RCA, but there are many problems that cannot be ignored. They used the AutoRegressive eXogenous (ARX) model to create a time-invariant correlation network as a machine profile, and then use this profile to track the causal anomalies by means of a method called fault propagation. There are two major problems in describing the behavior of a machine by using the correlation network established by ARX: (1) It does not take into account the diversity of states (2) It does not separately consider the correlations with different time-lag. Based on these problems, we propose a framework called Ranking Causal Anomalies in End-to-End System (RCAE2E), which completely solves the problems mentioned above. In the experimental part, we use synthetic data and real-world large-scale photoelectric factory data to verify the correctness and existence of our method hypothesis. ",
    "url": "https://arxiv.org/abs/2301.07281",
    "authors": [
      "Ching Chang",
      "Cheng-Han Yeh",
      "Wen-Chih Peng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07282",
    "title": "The Chance of Winning Election Impacts on Social Media Strategy",
    "abstract": "Social media has been a paramount arena for election campaigns for political actors. While many studies have been paying attention to the political campaigns related to partisanship, politicians also can conduct different campaigns according to their chances of winning. Leading candidates, for example, do not behave the same as fringe candidates in their elections, and vice versa. We, however, know little about this difference in social media political campaign strategies according to their odds in elections. We tackle this problem by analyzing candidates' tweets in terms of users, topics, and sentiment of replies. Our study finds that, as their chances of winning increase, candidates narrow the targets they communicate with, from people in general to the electrical districts and specific persons (verified accounts or accounts with many followers). Our study brings new insights into the candidates' campaign strategies through the analysis based on the novel perspective of the candidate's electoral situation. ",
    "url": "https://arxiv.org/abs/2301.07282",
    "authors": [
      "Taichi Murayama",
      "Akira Matsui",
      "Kunihiro Miyazaki",
      "Yasuko Matsubara",
      "Yasushi Sakurai"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2301.07283",
    "title": "Contrastive Learning for Self-Supervised Pre-Training of Point Cloud  Segmentation Networks With Image Data",
    "abstract": "Reducing the quantity of annotations required for supervised training is vital when labels are scarce and costly. This reduction is particularly important for semantic segmentation tasks involving 3D datasets, which are often significantly smaller and more challenging to annotate than their image-based counterparts. Self-supervised pre-training on unlabelled data is one way to reduce the amount of manual annotations needed. Previous work has focused on pre-training with point clouds exclusively. While useful, this approach often requires two or more registered views. In the present work, we combine image and point cloud modalities by first learning self-supervised image features and then using these features to train a 3D model. By incorporating image data, which is often included in many 3D datasets, our pre-training method only requires a single scan of a scene and can be applied to cases where localization information is unavailable. We demonstrate that our pre-training approach, despite using single scans, achieves comparable performance to other multi-scan, point cloud-only methods. ",
    "url": "https://arxiv.org/abs/2301.07283",
    "authors": [
      "Andrej Janda",
      "Brandon Wagstaff",
      "Edwin G. Ng",
      "Jonathan Kelly"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.07284",
    "title": "Label Inference Attack against Split Learning under Regression Setting",
    "abstract": "As a crucial building block in vertical Federated Learning (vFL), Split Learning (SL) has demonstrated its practice in the two-party model training collaboration, where one party holds the features of data samples and another party holds the corresponding labels. Such method is claimed to be private considering the shared information is only the embedding vectors and gradients instead of private raw data and labels. However, some recent works have shown that the private labels could be leaked by the gradients. These existing attack only works under the classification setting where the private labels are discrete. In this work, we step further to study the leakage in the scenario of the regression model, where the private labels are continuous numbers (instead of discrete labels in classification). This makes previous attacks harder to infer the continuous labels due to the unbounded output range. To address the limitation, we propose a novel learning-based attack that integrates gradient information and extra learning regularization objectives in aspects of model training properties, which can infer the labels under regression settings effectively. The comprehensive experiments on various datasets and models have demonstrated the effectiveness of our proposed attack. We hope our work can pave the way for future analyses that make the vFL framework more secure. ",
    "url": "https://arxiv.org/abs/2301.07284",
    "authors": [
      "Shangyu Xie",
      "Xin Yang",
      "Yuanshun Yao",
      "Tianyi Liu",
      "Taiqing Wang",
      "Jiankai Sun"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07295",
    "title": "Adapting Multilingual Speech Representation Model for a New,  Underresourced Language through Multilingual Fine-tuning and Continued  Pretraining",
    "abstract": "In recent years, neural models learned through self-supervised pretraining on large scale multilingual text or speech data have exhibited promising results for underresourced languages, especially when a relatively large amount of data from related language(s) is available. While the technology has a potential for facilitating tasks carried out in language documentation projects, such as speech transcription, pretraining a multilingual model from scratch for every new language would be highly impractical. We investigate the possibility for adapting an existing multilingual wav2vec 2.0 model for a new language, focusing on actual fieldwork data from a critically endangered tongue: Ainu. Specifically, we (i) examine the feasibility of leveraging data from similar languages also in fine-tuning; (ii) verify whether the model's performance can be improved by further pretraining on target language data. Our results show that continued pretraining is the most effective method to adapt a wav2vec 2.0 model for a new language and leads to considerable reduction in error rates. Furthermore, we find that if a model pretrained on a related speech variety or an unrelated language with similar phonological characteristics is available, multilingual fine-tuning using additional data from that language can have positive impact on speech recognition performance when there is very little labeled data in the target language. ",
    "url": "https://arxiv.org/abs/2301.07295",
    "authors": [
      "Karol Nowakowski",
      "Michal Ptaszynski",
      "Kyoko Murasaki",
      "Jagna Nieuważny"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2301.07300",
    "title": "Relaxed Graph Color Bound for the Maximum k-plex Problem",
    "abstract": "As a relaxation of the clique, a k-plex of a graph is a vertex set that each vertex is not connected with at most k vertices of this set. Given an undirected graph, the Maximum k-plex Problem (MkP) aims to find its largest k-plex. Branch and bound algorithms are a type of well-studied and effective method for exact MkP solving, whose performance depends heavily on the quality of the upper bounds. In this paper, we investigate the relaxation properties of k-plex and propose an effective upper bound called Relaxed Graph color Bound (RGB) for the MkP. To describe and calculate RGB, we propose a new quasi-independent set structure that focuses on the number of conflict vertices. We combine RGB with two of the state-of-the-art branch and bound MkP algorithms, Maplex and KpLeX. Extensive experiments on real-world benchmarks, DIMACS benchmarks, and random graphs show the excellent performance of our proposed method over the state-of-the-art algorithms. ",
    "url": "https://arxiv.org/abs/2301.07300",
    "authors": [
      "Jiongzhi Zheng",
      "Mingming Jin",
      "Yan Jin",
      "Kun He"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2301.07301",
    "title": "PTA-Det: Point Transformer Associating Point cloud and Image for 3D  Object Detection",
    "abstract": "In autonomous driving, 3D object detection based on multi-modal data has become an indispensable approach when facing complex environments around the vehicle. During multi-modal detection, LiDAR and camera are simultaneously applied for capturing and modeling. However, due to the intrinsic discrepancies between the LiDAR point and camera image, the fusion of the data for object detection encounters a series of problems. Most multi-modal detection methods perform even worse than LiDAR-only methods. In this investigation, we propose a method named PTA-Det to improve the performance of multi-modal detection. Accompanied by PTA-Det, a Pseudo Point Cloud Generation Network is proposed, which can convert image information including texture and semantic features by pseudo points. Thereafter, through a transformer-based Point Fusion Transition (PFT) module, the features of LiDAR points and pseudo points from image can be deeply fused under a unified point-based representation. The combination of these modules can conquer the major obstacle in feature fusion across modalities and realizes a complementary and discriminative representation for proposal generation. Extensive experiments on the KITTI dataset show the PTA-Det achieves a competitive result and support its effectiveness. ",
    "url": "https://arxiv.org/abs/2301.07301",
    "authors": [
      "Rui Wan",
      "Tianyun Zhao",
      "Wei Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07306",
    "title": "Improve Noise Tolerance of Robust Loss via Noise-Awareness",
    "abstract": "Robust loss minimization is an important strategy for handling robust learning issue on noisy labels. Current robust losses, however, inevitably involve hyperparameters to be tuned for different datasets with noisy labels, manually or heuristically through cross validation, which makes them fairly hard to be generally applied in practice. Existing robust loss methods usually assume that all training samples share common hyperparameters, which are independent of instances. This limits the ability of these methods on distinguishing individual noise properties of different samples, making them hardly adapt to different noise structures. To address above issues, we propose to assemble robust loss with instance-dependent hyperparameters to improve their noise-tolerance with theoretical guarantee. To achieve setting such instance-dependent hyperparameters for robust loss, we propose a meta-learning method capable of adaptively learning a hyperparameter prediction function, called Noise-Aware-Robust-Loss-Adjuster (NARL-Adjuster). Specifically, through mutual amelioration between hyperparameter prediction function and classifier parameters in our method, both of them can be simultaneously finely ameliorated and coordinated to attain solutions with good generalization capability. Four kinds of SOTA robust losses are attempted to be integrated with our algorithm, and experiments substantiate the general availability and effectiveness of the proposed method in both its noise tolerance and generalization performance. Meanwhile, the explicit parameterized structure makes the meta-learned prediction function capable of being readily transferrable and plug-and-play to unseen datasets with noisy labels. Specifically, we transfer our meta-learned NARL-Adjuster to unseen tasks, including several real noisy datasets, and achieve better performance compared with conventional hyperparameter tuning strategy. ",
    "url": "https://arxiv.org/abs/2301.07306",
    "authors": [
      "Kehui Ding",
      "Jun Shu",
      "Deyu Meng",
      "Zongben Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.07307",
    "title": "Workload-Aware Scheduling using Markov Decision Process for  Infrastructure-Assisted Learning-Based Multi-UAV Surveillance Networks",
    "abstract": "In modern networking research, infrastructure-assisted unmanned autonomous vehicles (UAVs) are actively considered for real-time learning-based surveillance and aerial data-delivery under unexpected 3D free mobility and coordination. In this system model, it is essential to consider the power limitation in UAVs and autonomous object recognition (for abnormal behavior detection) deep learning model performance in infrastructure/towers. To overcome the power limitation of UAVs, this paper proposes a novel aerial scheduling algorithm between multi-UAVs and multi-towers where the towers conduct wireless power transfer toward UAVs. In addition, to take care of the high-performance learning model training in towers, the training data from UAVs should be fairly delivered to towers because larger data delivery will make huge computation overhead whereas the less data delivery will introduce overfitting. Therefore, fair data distribution from UAVs to their associated towers is essentially required. Therefore, this paper proposes a novel workload-aware scheduling algorithm between multi-towers and multi-UAVs for joint power-charging from towers to their associated UAVs and training data delivery from UAVs to their associated towers. For computing the workload-aware optimal scheduling decisions in each unit time, our solution approach for the given scheduling problem is designed based on Markov decision process (MDP) to deal with (i) time-varying low-complexity computation and (ii) pseudo-polynomial optimality. As shown in performance evaluation results, our proposed algorithm ensures (i) sufficient times for resource exchanges between towers and UAVs, (ii) the most even and uniform data collection during the processes compared to the other algorithms, and (iii) the performance of all towers converges to optimal levels. ",
    "url": "https://arxiv.org/abs/2301.07307",
    "authors": [
      "Soohyun Park",
      "Chanyoung Park",
      "Soyi Jung",
      "Jae-Hyun Kim",
      "Joongheon Kim"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2301.07310",
    "title": "MR.Brick: Designing A Remote Mixed-reality Educational Game System for  Promoting Children's Social & Collaborative Skills",
    "abstract": "Children are one of the groups most influenced by COVID-19-related social distancing, and a lack of contact with peers can limit their opportunities to develop social and collaborative skills. However, remote socialization and collaboration as an alternative approach is still a great challenge for children. This paper presents MR.Brick, a Mixed Reality (MR) educational game system that helps children adapt to remote collaboration. A controlled experimental study involving 24 children aged six to ten was conducted to compare MR.Brick with the traditional video game by measuring their social and collaborative skills and analyzing their multi-modal playing behaviours. The results showed that MR.Brick was more conducive to children's remote collaboration experience than the traditional video game. Given the lack of training systems designed for children to collaborate remotely, this study may inspire interaction design and educational research in related fields. ",
    "url": "https://arxiv.org/abs/2301.07310",
    "authors": [
      "Yudan Wu",
      "Shanhe You",
      "Zixuan Guo",
      "Xiangyang Li",
      "Guyue Zhou",
      "Jiangtao Gong"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2301.07316",
    "title": "Adaptively Integrated Knowledge Distillation and Prediction Uncertainty  for Continual Learning",
    "abstract": "Current deep learning models often suffer from catastrophic forgetting of old knowledge when continually learning new knowledge. Existing strategies to alleviate this issue often fix the trade-off between keeping old knowledge (stability) and learning new knowledge (plasticity). However, the stability-plasticity trade-off during continual learning may need to be dynamically changed for better model performance. In this paper, we propose two novel ways to adaptively balance model stability and plasticity. The first one is to adaptively integrate multiple levels of old knowledge and transfer it to each block level in the new model. The second one uses prediction uncertainty of old knowledge to naturally tune the importance of learning new knowledge during model training. To our best knowledge, this is the first time to connect model prediction uncertainty and knowledge distillation for continual learning. In addition, this paper applies a modified CutMix particularly to augment the data for old knowledge, further alleviating the catastrophic forgetting issue. Extensive evaluations on the CIFAR100 and the ImageNet datasets confirmed the effectiveness of the proposed method for continual learning. ",
    "url": "https://arxiv.org/abs/2301.07316",
    "authors": [
      "Kanghao Chen",
      "Sijia Liu",
      "Ruixuan Wang",
      "Wei-Shi Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07317",
    "title": "Security and Privacy in Cache-Aided Linear Function Retrieval for  Multi-access Coded Caching",
    "abstract": "A multi-access network consisting of $N$ files, $C$ caches, $K$ users with each user having access to a unique set of $r$ caches has been introduced recently by Muralidhar et al. (\"Maddah-Ali-Niesen Scheme for Multi-access Coded Caching,\" in \\textit{Proc. ITW}, 2021). It considers Single File Retrieval (SFR) i.e, each user demands an arbitrary file from the server. It proposes a coded caching scheme which was shown to be optimal under the assumption of uncoded placement by Brunero and Elia (\"Fundamental Limits of Combinatorial Multi-Access Caching\" in {\\textit{arXiv:2110.07426} }). The above multi-access network is referred to as combinatorial topology which is considered in this work with three additional features : a) Linear Function Retrieval (LFR) i.e., each user is interested in retrieving an arbitrary linear combination of files in the server's library; b) Security i.e., the content of the library must be kept secure from an eavesdropper who obtains the signal sent by the server; c) Privacy i.e., each user can only get its required file and can not get any information about the demands of other users. Achievable Secure, Private LFR (SP-LFR) scheme, Secure LFR (S-LFR) scheme and Improved S-LFR scheme are proposed. As special cases, our work recovers some of the results by Yan and Tuninetti (\"Key Superposition Simultaneously Achieves Security and Privacy in Cache-Aided Linear Function Retrieval,\" in \\textit{Trans. Inf. Forensics and Security}, 2021\") and Sengupta et al.(\"Fundamental limits of caching with secure delivery,\" in \\textit{Trans. Inf. Forensics and Security}, 2015). At a memory point, $M=\\frac{r\\binom{C}{r}}{C}$, the SP-LFR scheme is within a constant multiplicative factor from the optimal rate for $N\\geq2Kr$ and at, $M=\\frac{\\binom{C}{r}}{C}$, the improved S-LFR scheme is within a constant multiplicative factor from the optimal rate for $N\\geq2K$. ",
    "url": "https://arxiv.org/abs/2301.07317",
    "authors": [
      "Mallikharjuna Chinnapadamala",
      "B. Sundar Rajan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2301.07320",
    "title": "Robust Knowledge Adaptation for Federated Unsupervised Person ReID",
    "abstract": "Person Re-identification (ReID) has been extensively studied in recent years due to the increasing demand in public security. However, collecting and dealing with sensitive personal data raises privacy concerns. Therefore, federated learning has been explored for Person ReID, which aims to share minimal sensitive data between different parties (clients). However, existing federated learning based person ReID methods generally rely on laborious and time-consuming data annotations and it is difficult to guarantee cross-domain consistency. Thus, in this work, a federated unsupervised cluster-contrastive (FedUCC) learning method is proposed for Person ReID. FedUCC introduces a three-stage modelling strategy following a coarse-to-fine manner. In detail, generic knowledge, specialized knowledge and patch knowledge are discovered using a deep neural network. This enables the sharing of mutual knowledge among clients while retaining local domain-specific knowledge based on the kinds of network layers and their parameters. Comprehensive experiments on 8 public benchmark datasets demonstrate the state-of-the-art performance of our proposed method. ",
    "url": "https://arxiv.org/abs/2301.07320",
    "authors": [
      "Jianfeng Weng",
      "Kun Hu",
      "Tingting Yao",
      "Jingya Wang",
      "Zhiyong Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.07382",
    "title": "ViT-AE++: Improving Vision Transformer Autoencoder for Self-supervised  Medical Image Representations",
    "abstract": "Self-supervised learning has attracted increasing attention as it learns data-driven representation from data without annotations. Vision transformer-based autoencoder (ViT-AE) by He et al. (2021) is a recent self-supervised learning technique that employs a patch-masking strategy to learn a meaningful latent space. In this paper, we focus on improving ViT-AE (nicknamed ViT-AE++) for a more effective representation of both 2D and 3D medical images. We propose two new loss functions to enhance the representation during the training stage. The first loss term aims to improve self-reconstruction by considering the structured dependencies and hence indirectly improving the representation. The second loss term leverages contrastive loss to directly optimize the representation from two randomly masked views. As an independent contribution, we extended ViT-AE++ to a 3D fashion for volumetric medical images. We extensively evaluate ViT-AE++ on both natural images and medical images, demonstrating consistent improvement over vanilla ViT-AE and its superiority over other contrastive learning approaches. ",
    "url": "https://arxiv.org/abs/2301.07382",
    "authors": [
      "Chinmay Prabhakar",
      "Hongwei Bran Li",
      "Jiancheng Yang",
      "Suprosana Shit",
      "Benedikt Wiestler",
      "Bjoern Menze"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.07405",
    "title": "HiDAnet: RGB-D Salient Object Detection via Hierarchical Depth Awareness",
    "abstract": "RGB-D saliency detection aims to fuse multi-modal cues to accurately localize salient regions. Existing works often adopt attention modules for feature modeling, with few methods explicitly leveraging fine-grained details to merge with semantic cues. Thus, despite the auxiliary depth information, it is still challenging for existing models to distinguish objects with similar appearances but at distinct camera distances. In this paper, from a new perspective, we propose a novel Hierarchical Depth Awareness network (HiDAnet) for RGB-D saliency detection. Our motivation comes from the observation that the multi-granularity properties of geometric priors correlate well with the neural network hierarchies. To realize multi-modal and multi-level fusion, we first use a granularity-based attention scheme to strengthen the discriminatory power of RGB and depth features separately. Then we introduce a unified cross dual-attention module for multi-modal and multi-level fusion in a coarse-to-fine manner. The encoded multi-modal features are gradually aggregated into a shared decoder. Further, we exploit a multi-scale loss to take full advantage of the hierarchical information. Extensive experiments on challenging benchmark datasets demonstrate that our HiDAnet performs favorably over the state-of-the-art methods by large margins. ",
    "url": "https://arxiv.org/abs/2301.07405",
    "authors": [
      "Zongwei Wu",
      "Guillaume Allibert",
      "Fabrice Meriaudeau",
      "Chao Ma",
      "Cédric Demonceaux"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.07407",
    "title": "TAME: Attention Mechanism Based Feature Fusion for Generating  Explanation Maps of Convolutional Neural Networks",
    "abstract": "The apparent ``black box'' nature of neural networks is a barrier to adoption in applications where explainability is essential. This paper presents TAME (Trainable Attention Mechanism for Explanations), a method for generating explanation maps with a multi-branch hierarchical attention mechanism. TAME combines a target model's feature maps from multiple layers using an attention mechanism, transforming them into an explanation map. TAME can easily be applied to any convolutional neural network (CNN) by streamlining the optimization of the attention mechanism's training method and the selection of target model's feature maps. After training, explanation maps can be computed in a single forward pass. We apply TAME to two widely used models, i.e. VGG-16 and ResNet-50, trained on ImageNet and show improvements over previous top-performing methods. We also provide a comprehensive ablation study comparing the performance of different variations of TAME's architecture. TAME source code is made publicly available at https://github.com/bmezaris/TAME ",
    "url": "https://arxiv.org/abs/2301.07407",
    "authors": [
      "Mariano Ntrougkas",
      "Nikolaos Gkalelis",
      "Vasileios Mezaris"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.07422",
    "title": "Run-time Failure Detection via Non-intrusive Event Analysis in a  Large-Scale Cloud Computing Platform",
    "abstract": "Cloud computing systems fail in complex and unforeseen ways due to unexpected combinations of events and interactions among hardware and software components. These failures are especially problematic when they are silent, i.e., not accompanied by any explicit failure notification, hindering the timely detection and recovery. In this work, we propose an approach to run-time failure detection tailored for monitoring multi-tenant and concurrent cloud computing systems. The approach uses a non-intrusive form of event tracing, without manual changes to the system's internals to propagate session identifiers (IDs), and builds a set of lightweight monitoring rules from fault-free executions. We evaluated the effectiveness of the approach in detecting failures in the context of the OpenStack cloud computing platform, a complex and \"off-the-shelf\" distributed system, by executing a campaign of fault injection experiments in a multi-tenant scenario. Our experiments show that the approach detects the failure with an F1 score (0.85) and accuracy (0.77) higher than the ones provided by the OpenStack failure logging mechanisms (0.53 and 0.50) and two non--session-aware run-time verification approaches (both lower than 0.15). Moreover, the approach significantly decreases the average time to detect failures at run-time (~114 seconds) compared to the OpenStack logging mechanisms. ",
    "url": "https://arxiv.org/abs/2301.07422",
    "authors": [
      "Domenico Cotroneo",
      "Luigi De Simone",
      "Pietro Liguori",
      "Roberto Natella"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2301.07424",
    "title": "Autonomous Slalom Maneuver Based on Expert Drivers' Behavior Using  Convolutional Neural Network",
    "abstract": "Lane changing and obstacle avoidance are one of the most important tasks in automated cars. To date, many algorithms have been suggested that are generally based on path trajectory or reinforcement learning approaches. Although these methods have been efficient, they are not able to accurately imitate a smooth path traveled by an expert driver. In this paper, a method is presented to mimic drivers' behavior using a convolutional neural network (CNN). First, seven features are extracted from a dataset gathered from four expert drivers in a driving simulator. Then, these features are converted from 1D arrays to 2D arrays and injected into a CNN. The CNN model computes the desired steering wheel angle and sends it to an adaptive PD controller. Finally, the control unit applies proper torque to the steering wheel. Results show that the CNN model can mimic the drivers' behavior with an R2-squared of 0.83. Also, the performance of the presented method was evaluated in the driving simulator for 17 trials, which avoided all traffic cones successfully. In some trials, the presented method performed a smoother maneuver compared to the expert drivers. ",
    "url": "https://arxiv.org/abs/2301.07424",
    "authors": [
      "Shafagh A. Pashaki",
      "Ali Nahvi",
      "Ahmad Ahmadi",
      "Sajad Tavakoli",
      "Shahin Naeemi",
      "Salar H. Shamchi"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07427",
    "title": "Boosting Synthetic Data Generation with Effective Nonlinear Causal  Discovery",
    "abstract": "Synthetic data generation has been widely adopted in software testing, data privacy, imbalanced learning, and artificial intelligence explanation. In all such contexts, it is crucial to generate plausible data samples. A common assumption of approaches widely used for data generation is the independence of the features. However, typically, the variables of a dataset depend on one another, and these dependencies are not considered in data generation leading to the creation of implausible records. The main problem is that dependencies among variables are typically unknown. In this paper, we design a synthetic dataset generator for tabular data that can discover nonlinear causalities among the variables and use them at generation time. State-of-the-art methods for nonlinear causal discovery are typically inefficient. We boost them by restricting the causal discovery among the features appearing in the frequent patterns efficiently retrieved by a pattern mining algorithm. We design a framework for generating synthetic datasets with known causalities to validate our proposal. Broad experimentation on many synthetic and real datasets with known causalities shows the effectiveness of the proposed method. ",
    "url": "https://arxiv.org/abs/2301.07427",
    "authors": [
      "Martina Cinquini",
      "Fosca Giannotti",
      "Riccardo Guidotti"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.07468",
    "title": "Model-based inexact graph matching on top of CNNs for semantic scene  understanding",
    "abstract": "Deep learning based pipelines for semantic segmentation often ignore structural information available on annotated images used for training. We propose a novel post-processing module enforcing structural knowledge about the objects of interest to improve segmentation results provided by deep learning. This module corresponds to a \"many-to-one-or-none\" inexact graph matching approach, and is formulated as a quadratic assignment problem. Our approach is compared to a CNN-based segmentation (for various CNN backbones) on two public datasets, one for face segmentation from 2D RGB images (FASSEG), and the other for brain segmentation from 3D MRIs (IBSR). Evaluations are performed using two types of structural information (distances and directional relations, , this choice being a hyper-parameter of our generic framework). On FASSEG data, results show that our module improves accuracy of the CNN by about 6.3% (the Hausdorff distance decreases from 22.11 to 20.71). On IBSR data, the improvement is of 51% (the Hausdorff distance decreases from 11.01 to 5.4). In addition, our approach is shown to be resilient to small training datasets that often limit the performance of deep learning methods: the improvement increases as the size of the training dataset decreases. ",
    "url": "https://arxiv.org/abs/2301.07468",
    "authors": [
      "Jérémy Chopin",
      "Jean-Baptiste Fasquel",
      "Harold Mouchère",
      "Rozenn Dahyot",
      "Isabelle Bloch"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.07471",
    "title": "Significance of anonymity and privacy in improving inclusivity and  diversity in Higher Education Learning Environments",
    "abstract": "Interactions between lecturers and students are the key to learning in the higher education environment. In this paper, the investigation pursues two different contexts to understand these interactions and the impact of anonymity and privacy in different interactions in the Computer Science (CS) department. The first context \"different interaction between a lecturer and students\" is investigated using phenomenological research approach by interviewing lecturer in CS ($N_a = 5$). The second context \"the significance of anonymity and privacy in interactions\" is investigated using a quantitative and qualitative questionnaire-based research method using an online student questionnaire ($N_b = 53$). The study finds a large gap between students' perception of preferred communication methods and the use of the same communication method. From the second context study, it is evident that \"anonymity and privacy\" in online surveys and module evaluations are preferred by all student participants, thus supporting diversity and inclusivity. ",
    "url": "https://arxiv.org/abs/2301.07471",
    "authors": [
      "Poonam Yadav"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2301.07473",
    "title": "Discrete Latent Structure in Neural Networks",
    "abstract": "Many types of data from fields including natural language processing, computer vision, and bioinformatics, are well represented by discrete, compositional structures such as trees, sequences, or matchings. Latent structure models are a powerful tool for learning to extract such representations, offering a way to incorporate structural bias, discover insight about the data, and interpret decisions. However, effective training is challenging, as neural networks are typically designed for continuous computation. This text explores three broad strategies for learning with discrete latent structure: continuous relaxation, surrogate gradients, and probabilistic estimation. Our presentation relies on consistent notations for a wide range of models. As such, we reveal many new connections between latent structure learning strategies, showing how most consist of the same small set of fundamental building blocks, but use them differently, leading to substantially different applicability and properties. ",
    "url": "https://arxiv.org/abs/2301.07473",
    "authors": [
      "Vlad Niculae",
      "Caio F. Corro",
      "Nikita Nangia",
      "Tsvetomila Mihaylova",
      "André F. T. Martins"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.07482",
    "title": "ReFresh: Reducing Memory Access from Exploiting Stable Historical  Embeddings for Graph Neural Network Training",
    "abstract": "A key performance bottleneck when training graph neural network (GNN) models on large, real-world graphs is loading node features onto a GPU. Due to limited GPU memory, expensive data movement is necessary to facilitate the storage of these features on alternative devices with slower access (e.g. CPU memory). Moreover, the irregularity of graph structures contributes to poor data locality which further exacerbates the problem. Consequently, existing frameworks capable of efficiently training large GNN models usually incur a significant accuracy degradation because of the inevitable shortcuts involved. To address these limitations, we instead propose ReFresh, a general-purpose GNN mini-batch training framework that leverages a historical cache for storing and reusing GNN node embeddings instead of re-computing them through fetching raw features at every iteration. Critical to its success, the corresponding cache policy is designed, using a combination of gradient-based and staleness criteria, to selectively screen those embeddings which are relatively stable and can be cached, from those that need to be re-computed to reduce estimation errors and subsequent downstream accuracy loss. When paired with complementary system enhancements to support this selective historical cache, ReFresh is able to accelerate the training speed on large graph datasets such as ogbn-papers100M and MAG240M by 4.6x up to 23.6x and reduce the memory access by 64.5% (85.7% higher than a raw feature cache), with less than 1% influence on test accuracy. ",
    "url": "https://arxiv.org/abs/2301.07482",
    "authors": [
      "Kezhao Huang",
      "Haitian Jiang",
      "Minjie Wang",
      "Guangxuan Xiao",
      "David Wipf",
      "Xiang Song",
      "Quan Gan",
      "Zengfeng Huang",
      "Jidong Zhai",
      "Zheng Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07485",
    "title": "Image Embedding for Denoising Generative Models",
    "abstract": "Denoising Diffusion models are gaining increasing popularity in the field of generative modeling for several reasons, including the simple and stable training, the excellent generative quality, and the solid probabilistic foundation. In this article, we address the problem of {\\em embedding} an image into the latent space of Denoising Diffusion Models, that is finding a suitable ``noisy'' image whose denoising results in the original image. We particularly focus on Denoising Diffusion Implicit Models due to the deterministic nature of their reverse diffusion process. As a side result of our investigation, we gain a deeper insight into the structure of the latent space of diffusion models, opening interesting perspectives on its exploration, the definition of semantic trajectories, and the manipulation/conditioning of encodings for editing purposes. A particularly interesting property highlighted by our research, which is also characteristic of this class of generative models, is the independence of the latent representation from the networks implementing the reverse diffusion process. In other words, a common seed passed to different networks (each trained on the same dataset), eventually results in identical images. ",
    "url": "https://arxiv.org/abs/2301.07485",
    "authors": [
      "Andrea Asperti",
      "Davide Evangelista",
      "Samuele Marro",
      "Fabio Merizzi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07486",
    "title": "CINM (Cinnamon): A Compilation Infrastructure for Heterogeneous Compute  In-Memory and Compute Near-Memory Paradigms",
    "abstract": "The rise of data-intensive applications exposed the limitations of conventional processor-centric von-Neumann architectures that struggle to meet the off-chip memory bandwidth demand. Therefore, recent innovations in computer architecture advocate compute-in-memory (CIM) and compute-near-memory (CNM), non-von- Neumann paradigms achieving orders-of-magnitude improvements in performance and energy consumption. Despite significant technological breakthroughs in the last few years, the programmability of these systems is still a serious challenge. Their programming models are too low-level and specific to particular system implementations. Since such future architectures are predicted to be highly heterogenous, developing novel compiler abstractions and frameworks become necessary. To this end, we present CINM (Cinnamon), a first end-to-end compilation flow that leverages the hierarchal abstractions to generalize over different CIM and CNM devices and enable device-agnostic and device-aware optimizations. Cinnamon progressively lowers input programs and performs optimizations at each level in the lowering pipeline. To show its efficacy, we evaluate CINM on a set of benchmarks for the well-known UPMEM CNM system and the memristors-based CIM accelerators. We show that Cinnamon, supporting multiple hardware targets, generates high-performance code comparable to or better than state-of-the-art implementations. ",
    "url": "https://arxiv.org/abs/2301.07486",
    "authors": [
      "Asif Ali Khan",
      "Hamid Farzaneh",
      "Karl F. A. Friebel",
      "Lorenzo Chelini",
      "Jeronimo Castrillon"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2301.07487",
    "title": "Adversarial Robust Deep Reinforcement Learning Requires Redefining  Robustness",
    "abstract": "Learning from raw high dimensional data via interaction with a given environment has been effectively achieved through the utilization of deep neural networks. Yet the observed degradation in policy performance caused by imperceptible worst-case policy dependent translations along high sensitivity directions (i.e. adversarial perturbations) raises concerns on the robustness of deep reinforcement learning policies. In our paper, we show that these high sensitivity directions do not lie only along particular worst-case directions, but rather are more abundant in the deep neural policy landscape and can be found via more natural means in a black-box setting. Furthermore, we show that vanilla training techniques intriguingly result in learning more robust policies compared to the policies learnt via the state-of-the-art adversarial training techniques. We believe our work lays out intriguing properties of the deep reinforcement learning policy manifold and our results can help to build robust and generalizable deep reinforcement learning policies. ",
    "url": "https://arxiv.org/abs/2301.07487",
    "authors": [
      "Ezgi Korkmaz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.07498",
    "title": "A Robust Classification Framework for Byzantine-Resilient Stochastic  Gradient Descent",
    "abstract": "This paper proposes a Robust Gradient Classification Framework (RGCF) for Byzantine fault tolerance in distributed stochastic gradient descent. The framework consists of a pattern recognition filter which we train to be able to classify individual gradients as Byzantine by using their direction alone. This filter is robust to an arbitrary number of Byzantine workers for convex as well as non-convex optimisation settings, which is a significant improvement on the prior work that is robust to Byzantine faults only when up to 50% of the workers are Byzantine. This solution does not require an estimate of the number of Byzantine workers; its running time is not dependent on the number of workers and can scale up to training instances with a large number of workers without a loss in performance. We validate our solution by training convolutional neural networks on the MNIST dataset in the presence of Byzantine workers. ",
    "url": "https://arxiv.org/abs/2301.07498",
    "authors": [
      "Shashank Reddy Chirra",
      "Kalyan Varma Nadimpalli",
      "Shrisha Rao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2301.07520",
    "title": "Adversarial AI in Insurance: Pervasiveness and Resilience",
    "abstract": "The rapid and dynamic pace of Artificial Intelligence (AI) and Machine Learning (ML) is revolutionizing the insurance sector. AI offers significant, very much welcome advantages to insurance companies, and is fundamental to their customer-centricity strategy. It also poses challenges, in the project and implementation phase. Among those, we study Adversarial Attacks, which consist of the creation of modified input data to deceive an AI system and produce false outputs. We provide examples of attacks on insurance AI applications, categorize them, and argue on defence methods and precautionary systems, considering that they can involve few-shot and zero-shot multilabelling. A related topic, with growing interest, is the validation and verification of systems incorporating AI and ML components. These topics are discussed in various sections of this paper. ",
    "url": "https://arxiv.org/abs/2301.07520",
    "authors": [
      "Elisa Luciano",
      "Matteo Cattaneo",
      "Ron Kenett"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "General Finance (q-fin.GN)"
    ]
  },
  {
    "id": "arXiv:2301.07524",
    "title": "Towards Causal Analysis of Empirical Software Engineering Data: The  Impact of Programming Languages on Coding Competitions",
    "abstract": "There is abundant observational data in the software engineering domain, whereas running large-scale controlled experiments is often practically impossible. Thus, most empirical studies can only report statistical correlations -- instead of potentially more insightful and robust causal relations. This paper discusses some novel techniques that support analyzing purely observational data for causal relations. Using fundamental causal models such as directed acyclic graphs, one can rigorously express, and partially validate, causal hypotheses; and then use the causal information to guide the construction of a statistical model that captures genuine causal relations -- such that correlation does imply causation. We apply these ideas to analyzing public data about programmer performance in Code Jam, a large world-wide coding contest organized by Google every year. Specifically, we look at the impact of different programming languages on a participant's performance in the contest. While the overall effect associated with programming languages is weak compared to other variables -- regardless of whether we consider correlational or causal links -- we found considerable differences between a purely statistical and a causal analysis of the very same data. The takeaway message is that even an imperfect causal analysis of observational data can help answer the salient research questions more precisely and more robustly than with just purely statistical techniques. ",
    "url": "https://arxiv.org/abs/2301.07524",
    "authors": [
      "Carlo A. Furia",
      "Richard Torkar",
      "Robert Feldt"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2301.07526",
    "title": "AutoFraudNet: A Multimodal Network to Detect Fraud in the Auto Insurance  Industry",
    "abstract": "In the insurance industry detecting fraudulent claims is a critical task with a significant financial impact. A common strategy to identify fraudulent claims is looking for inconsistencies in the supporting evidence. However, this is a laborious and cognitively heavy task for human experts as insurance claims typically come with a plethora of data from different modalities (e.g. images, text and metadata). To overcome this challenge, the research community has focused on multimodal machine learning frameworks that can efficiently reason through multiple data sources. Despite recent advances in multimodal learning, these frameworks still suffer from (i) challenges of joint-training caused by the different characteristics of different modalities and (ii) overfitting tendencies due to high model complexity. In this work, we address these challenges by introducing a multimodal reasoning framework, AutoFraudNet (Automobile Insurance Fraud Detection Network), for detecting fraudulent auto-insurance claims. AutoFraudNet utilizes a cascaded slow fusion framework and state-of-the-art fusion block, BLOCK Tucker, to alleviate the challenges of joint-training. Furthermore, it incorporates a light-weight architectural design along with additional losses to prevent overfitting. Through extensive experiments conducted on a real-world dataset, we demonstrate: (i) the merits of multimodal approaches, when compared to unimodal and bimodal methods, and (ii) the effectiveness of AutoFraudNet in fusing various modalities to boost performance (over 3\\% in PR AUC). ",
    "url": "https://arxiv.org/abs/2301.07526",
    "authors": [
      "Azin Asgarian",
      "Rohit Saha",
      "Daniel Jakubovitz",
      "Julia Peyre"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07531",
    "title": "Safety Verification of Neural Network Control Systems Using Guaranteed  Neural Network Model Reduction",
    "abstract": "This paper aims to enhance the computational efficiency of safety verification of neural network control systems by developing a guaranteed neural network model reduction method. First, a concept of model reduction precision is proposed to describe the guaranteed distance between the outputs of a neural network and its reduced-size version. A reachability-based algorithm is proposed to accurately compute the model reduction precision. Then, by substituting a reduced-size neural network controller into the closed-loop system, an algorithm to compute the reachable set of the original system is developed, which is able to support much more computationally efficient safety verification processes. Finally, the developed methods are applied to a case study of the Adaptive Cruise Control system with a neural network controller, which is shown to significantly reduce the computational time of safety verification and thus validate the effectiveness of the method. ",
    "url": "https://arxiv.org/abs/2301.07531",
    "authors": [
      "Weiming Xiang",
      "Zhongzhu Shao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.07533",
    "title": "A Multi-Scale Framework for Out-of-Distribution Detection in Dermoscopic  Images",
    "abstract": "The automatic detection of skin diseases via dermoscopic images can improve the efficiency in diagnosis and help doctors make more accurate judgments. However, conventional skin disease recognition systems may produce high confidence for out-of-distribution (OOD) data, which may become a major security vulnerability in practical applications. In this paper, we propose a multi-scale detection framework to detect out-of-distribution skin disease image data to ensure the robustness of the system. Our framework extracts features from different layers of the neural network. In the early layers, rectified activation is used to make the output features closer to the well-behaved distribution, and then an one-class SVM is trained to detect OOD data; in the penultimate layer, an adapted Gram matrix is used to calculate the features after rectified activation, and finally the layer with the best performance is chosen to compute a normality score. Experiments show that the proposed framework achieves superior performance when compared with other state-of-the-art methods in the task of skin disease recognition. ",
    "url": "https://arxiv.org/abs/2301.07533",
    "authors": [
      "Zhongzheng Huang",
      "Tao Wang",
      "Yuanzheng Cai",
      "Lingyu Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.07584",
    "title": "Joint Representation Learning for Text and 3D Point Cloud",
    "abstract": "Recent advancements in vision-language pre-training (e.g. CLIP) have shown that vision models can benefit from language supervision. While many models using language modality have achieved great success on 2D vision tasks, the joint representation learning of 3D point cloud with text remains under-explored due to the difficulty of 3D-Text data pair acquisition and the irregularity of 3D data structure. In this paper, we propose a novel Text4Point framework to construct language-guided 3D point cloud models. The key idea is utilizing 2D images as a bridge to connect the point cloud and the language modalities. The proposed Text4Point follows the pre-training and fine-tuning paradigm. During the pre-training stage, we establish the correspondence of images and point clouds based on the readily available RGB-D data and use contrastive learning to align the image and point cloud representations. Together with the well-aligned image and text features achieved by CLIP, the point cloud features are implicitly aligned with the text embeddings. Further, we propose a Text Querying Module to integrate language information into 3D representation learning by querying text embeddings with point cloud features. For fine-tuning, the model learns task-specific 3D representations under informative language guidance from the label set without 2D images. Extensive experiments demonstrate that our model shows consistent improvement on various downstream tasks, such as point cloud semantic segmentation, instance segmentation, and object detection. The code will be available here: https://github.com/LeapLabTHU/Text4Point ",
    "url": "https://arxiv.org/abs/2301.07584",
    "authors": [
      "Rui Huang",
      "Xuran Pan",
      "Henry Zheng",
      "Haojun Jiang",
      "Zhifeng Xie",
      "Shiji Song",
      "Gao Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07597",
    "title": "How Close is ChatGPT to Human Experts? Comparison Corpus, Evaluation,  and Detection",
    "abstract": "The introduction of ChatGPT has garnered widespread attention in both academic and industrial communities. ChatGPT is able to respond effectively to a wide range of human questions, providing fluent and comprehensive answers that significantly surpass previous public chatbots in terms of security and usefulness. On one hand, people are curious about how ChatGPT is able to achieve such strength and how far it is from human experts. On the other hand, people are starting to worry about the potential negative impacts that large language models (LLMs) like ChatGPT could have on society, such as fake news, plagiarism, and social security issues. In this work, we collected tens of thousands of comparison responses from both human experts and ChatGPT, with questions ranging from open-domain, financial, medical, legal, and psychological areas. We call the collected dataset the Human ChatGPT Comparison Corpus (HC3). Based on the HC3 dataset, we study the characteristics of ChatGPT's responses, the differences and gaps from human experts, and future directions for LLMs. We conducted comprehensive human evaluations and linguistic analyses of ChatGPT-generated content compared with that of humans, where many interesting results are revealed. After that, we conduct extensive experiments on how to effectively detect whether a certain text is generated by ChatGPT or humans. We build three different detection systems, explore several key factors that influence their effectiveness, and evaluate them in different scenarios. The dataset, code, and models are all publicly available at https://github.com/Hello-SimpleAI/chatgpt-comparison-detection. ",
    "url": "https://arxiv.org/abs/2301.07597",
    "authors": [
      "Biyang Guo",
      "Xin Zhang",
      "Ziyuan Wang",
      "Minqi Jiang",
      "Jinran Nie",
      "Yuxuan Ding",
      "Jianwei Yue",
      "Yupeng Wu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.07627",
    "title": "A novel dataset and a two-stage mitosis nuclei detection method based on  hybrid anchor branch",
    "abstract": "Mitosis detection is one of the challenging problems in computational pathology, and mitotic count is an important index of cancer grading for pathologists. However, current counts of mitotic nuclei rely on pathologists looking microscopically at the number of mitotic nuclei in hot spots, which is subjective and time-consuming. In this paper, we propose a two-stage cascaded network, named FoCasNet, for mitosis detection. In the first stage, a detection network named M_det is proposed to detect as many mitoses as possible. In the second stage, a classification network M_class is proposed to refine the results of the first stage. In addition, the attention mechanism, normalization method, and hybrid anchor branch classification subnet are introduced to improve the overall detection performance. Our method achieves the current highest F1-score of 0.888 on the public dataset ICPR 2012. We also evaluated our method on the GZMH dataset released by our research team for the first time and reached the highest F1-score of 0.563, which is also better than multiple classic detection networks widely used at present. It confirmed the effectiveness and generalization of our method. The code will be available at: https://github.com/antifen/mitosis-nuclei-detection. ",
    "url": "https://arxiv.org/abs/2301.07627",
    "authors": [
      "Huadeng Wang",
      "Hao Xu",
      "Bingbing Li",
      "Xipeng Pan",
      "Lingqi Zeng",
      "Rushi Lan",
      "Xiaonan Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.07634",
    "title": "Training Semantic Segmentation on Heterogeneous Datasets",
    "abstract": "We explore semantic segmentation beyond the conventional, single-dataset homogeneous training and bring forward the problem of Heterogeneous Training of Semantic Segmentation (HTSS). HTSS involves simultaneous training on multiple heterogeneous datasets, i.e. datasets with conflicting label spaces and different (weak) annotation types from the perspective of semantic segmentation. The HTSS formulation exposes deep networks to a larger and previously unexplored aggregation of information that can potentially enhance semantic segmentation in three directions: i) performance: increased segmentation metrics on seen datasets, ii) generalization: improved segmentation metrics on unseen datasets, and iii) knowledgeability: increased number of recognizable semantic concepts. To research these benefits of HTSS, we propose a unified framework, that incorporates heterogeneous datasets in a single-network training pipeline following the established FCN standard. Our framework first curates heterogeneous datasets to bring them into a common format and then trains a single-backbone FCN on all of them simultaneously. To achieve this, it transforms weak annotations, which are incompatible with semantic segmentation, to per-pixel labels, and hierarchizes their label spaces into a universal taxonomy. The trained HTSS models demonstrate performance and generalization gains over a wide range of datasets and extend the inference label space entailing hundreds of semantic classes. ",
    "url": "https://arxiv.org/abs/2301.07634",
    "authors": [
      "Panagiotis Meletis",
      "Gijs Dubbelman"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07639",
    "title": "A Comparative Analysis of Bias Amplification in Graph Neural Network  Approaches for Recommender Systems",
    "abstract": "Recommender Systems (RSs) are used to provide users with personalized item recommendations and help them overcome the problem of information overload. Currently, recommendation methods based on deep learning are gaining ground over traditional methods such as matrix factorization due to their ability to represent the complex relationships between users and items and to incorporate additional information. The fact that these data have a graph structure and the greater capability of Graph Neural Networks (GNNs) to learn from these structures has led to their successful incorporation into recommender systems. However, the bias amplification issue needs to be investigated while using these algorithms. Bias results in unfair decisions, which can negatively affect the company reputation and financial status due to societal disappointment and environmental harm. In this paper, we aim to comprehensively study this problem through a literature review and an analysis of the behavior against biases of different GNN-based algorithms compared to state-of-the-art methods. We also intend to explore appropriate solutions to tackle this issue with the least possible impact on the model performance. ",
    "url": "https://arxiv.org/abs/2301.07639",
    "authors": [
      "Nikzad Chizari",
      "Niloufar Shoeibi",
      "María N. Moreno-García"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.07665",
    "title": "An investigation of the reconstruction capacity of stacked convolutional  autoencoders for log-mel-spectrograms",
    "abstract": "In audio processing applications, the generation of expressive sounds based on high-level representations demonstrates a high demand. These representations can be used to manipulate the timbre and influence the synthesis of creative instrumental notes. Modern algorithms, such as neural networks, have inspired the development of expressive synthesizers based on musical instrument timbre compression. Unsupervised deep learning methods can achieve audio compression by training the network to learn a mapping from waveforms or spectrograms to low-dimensional representations. This study investigates the use of stacked convolutional autoencoders for the compression of time-frequency audio representations for a variety of instruments for a single pitch. Further exploration of hyper-parameters and regularization techniques is demonstrated to enhance the performance of the initial design. In an unsupervised manner, the network is able to reconstruct a monophonic and harmonic sound based on latent representations. In addition, we introduce an evaluation metric to measure the similarity between the original and reconstructed samples. Evaluating a deep generative model for the synthesis of sound is a challenging task. Our approach is based on the accuracy of the generated frequencies as it presents a significant metric for the perception of harmonic sounds. This work is expected to accelerate future experiments on audio compression using neural autoencoders. ",
    "url": "https://arxiv.org/abs/2301.07665",
    "authors": [
      "Anastasia Natsiou",
      "Luca Longo",
      "Sean O'Leary"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2301.07666",
    "title": "DDS: Decoupled Dynamic Scene-Graph Generation Network",
    "abstract": "Scene-graph generation involves creating a structural representation of the relationships between objects in a scene by predicting subject-object-relation triplets from input data. However, existing methods show poor performance in detecting triplets outside of a predefined set, primarily due to their reliance on dependent feature learning. To address this issue we propose DDS -- a decoupled dynamic scene-graph generation network -- that consists of two independent branches that can disentangle extracted features. The key innovation of the current paper is the decoupling of the features representing the relationships from those of the objects, which enables the detection of novel object-relationship combinations. The DDS model is evaluated on three datasets and outperforms previous methods by a significant margin, especially in detecting previously unseen triplets. ",
    "url": "https://arxiv.org/abs/2301.07666",
    "authors": [
      "A S M Iftekhar",
      "Raphael Ruschel",
      "Satish Kumar",
      "Suya You",
      "B.S. Manjunath"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.07703",
    "title": "Robust Zero-crossings Detection in Noisy Signals using Topological  Signal Processing",
    "abstract": "We explore a novel application of zero-dimensional persistent homology from Topological Data Analysis (TDA) for bracketing zero-crossings of both one-dimensional continuous functions, and uniformly sampled time series. We present an algorithm and show its robustness in the presence of noise for a range of sampling frequencies. In comparison to state-of-the-art software-based methods for finding zeros of a time series, our method generally converges faster, provides higher accuracy, and is capable of finding all the roots in a given interval instead of converging only to one of them. We also present and compare options for automatically setting the persistence threshold parameter that influences the accurate bracketing of the roots. ",
    "url": "https://arxiv.org/abs/2301.07703",
    "authors": [
      "Sunia Tanweer",
      "Firas A. Khasawneh",
      "Elizabeth Munch"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.07191",
    "title": "A New Construction of the Vietoris-Rips Complex",
    "abstract": "We present a new, inductive construction of the Vietoris-Rips complex, in which we take advantage of a small amount of unexploited combinatorial structure in the $k$-skeleton of the complex in order to avoid unnecessary comparisons when identifying its $(k+1)$-simplices. In doing so, we achieve an order-of-magnitude speedup over current algorithms when constructing the clique complexes of Erd\\H{o}s-R\\'enyi graphs. ",
    "url": "https://arxiv.org/abs/2301.07191",
    "authors": [
      "Antonio Rieser"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Geometry (cs.CG)",
      "Algebraic Topology (math.AT)",
      "Geometric Topology (math.GT)"
    ]
  },
  {
    "id": "arXiv:2301.07206",
    "title": "Dual-sPLS: a family of Dual Sparse Partial Least Squares regressions for  feature selection and prediction with tunable sparsity; evaluation on  simulated and near-infrared (NIR) data",
    "abstract": "Relating a set of variables X to a response y is crucial in chemometrics. A quantitative prediction objective can be enriched by qualitative data interpretation, for instance by locating the most influential features. When high-dimensional problems arise, dimension reduction techniques can be used. Most notable are projections (e.g. Partial Least Squares or PLS ) or variable selections (e.g. lasso). Sparse partial least squares combine both strategies, by blending variable selection into PLS. The variant presented in this paper, Dual-sPLS, generalizes the classical PLS1 algorithm. It provides balance between accurate prediction and efficient interpretation. It is based on penalizations inspired by classical regression methods (lasso, group lasso, least squares, ridge) and uses the dual norm notion. The resulting sparsity is enforced by an intuitive shrinking ratio parameter. Dual-sPLS favorably compares to similar regression methods, on simulated and real chemical data. Code is provided as an open-source package in R: \\url{https://CRAN.R-project.org/package=dual.spls}. ",
    "url": "https://arxiv.org/abs/2301.07206",
    "authors": [
      "Louna Alsouki",
      "Laurent Duval",
      "Clément Marteau",
      "Rami El Haddad",
      "François Wahl"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2301.07210",
    "title": "Causal Falsification of Digital Twins",
    "abstract": "Digital twins hold substantial promise in many applications, but rigorous procedures for assessing their accuracy are essential for their widespread deployment in safety-critical settings. By formulating this task within the framework of causal inference, we show it is not possible to certify that a twin is \"correct\" using real-world observational data unless potentially tenuous assumptions are made about the data-generating process. To avoid these assumptions, we propose an assessment strategy that instead aims to find cases where the twin is not correct, and present a general-purpose statistical procedure for doing so that may be used across a wide variety of applications and twin models. Our approach yields reliable and actionable information about the twin under only the assumption of an i.i.d. dataset of real-world observations, and in particular remains sound even in the presence of arbitrary unmeasured confounding. We demonstrate the effectiveness of our methodology via a large-scale case study involving sepsis modelling within the Pulse Physiology Engine, which we assess using the MIMIC-III dataset of ICU patients. ",
    "url": "https://arxiv.org/abs/2301.07210",
    "authors": [
      "Rob Cornish",
      "Muhammad Faaiz Taufiq",
      "Arnaud Doucet",
      "Chris Holmes"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2301.07286",
    "title": "Reslicing Ultrasound Images for Data Augmentation and Vessel  Reconstruction",
    "abstract": "Robot-guided catheter insertion has the potential to deliver urgent medical care in situations where medical personnel are unavailable. However, this technique requires accurate and reliable segmentation of anatomical landmarks in the body. For the ultrasound imaging modality, obtaining large amounts of training data for a segmentation model is time-consuming and expensive. This paper introduces RESUS (RESlicing of UltraSound Images), a weak supervision data augmentation technique for ultrasound images based on slicing reconstructed 3D volumes from tracked 2D images. This technique allows us to generate views which cannot be easily obtained in vivo due to physical constraints of ultrasound imaging, and use these augmented ultrasound images to train a semantic segmentation model. We demonstrate that RESUS achieves statistically significant improvement over training with non-augmented images and highlight qualitative improvements through vessel reconstruction. ",
    "url": "https://arxiv.org/abs/2301.07286",
    "authors": [
      "Cecilia Morales",
      "Jason Yao",
      "Tejas Rane",
      "Robert Edman",
      "Howie Choset",
      "Artur Dubrawski"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.07331",
    "title": "HLC2: a highly efficient cross-matching framework for large astronomical  catalogues on heterogeneous computing environments",
    "abstract": "Cross-matching operation, which is to find corresponding data for the same celestial object or region from multiple catalogues,is indispensable to astronomical data analysis and research. Due to the large amount of astronomical catalogues generated by the ongoing and next-generation large-scale sky surveys, the time complexity of the cross-matching is increasing dramatically. Heterogeneous computing environments provide a theoretical possibility to accelerate the cross-matching, but the performance advantages of heterogeneous computing resources have not been fully utilized. To meet the challenge of cross-matching for substantial increasing amount of astronomical observation data, this paper proposes Heterogeneous-computing-enabled Large Catalogue Cross-matcher (HLC2), a high-performance cross-matching framework based on spherical position deviation on CPU-GPU heterogeneous computing platforms. It supports scalable and flexible cross-matching and can be directly applied to the fusion of large astronomical cataloguesfrom survey missions and astronomical data centres. A performance estimation model is proposed to locate the performance bottlenecks and guide the optimizations. A two-level partitioning strategy is designed to generate an optimized data placement according to the positions of celestial objects to increase throughput. To make HLC2 a more adaptive solution, the architecture-aware task splitting, thread parallelization, and concurrent scheduling strategies are designed and integrated. Moreover, a novel quad-direction strategy is proposed for the boundary problem to effectively balance performance and completeness. We have experimentally evaluated HLC2 using public released catalogue data. Experiments demonstrate that HLC2 scales well on different sizes of catalogues and the cross-matching speed is significantly improved compared to the state-of-the-art cross-matchers. ",
    "url": "https://arxiv.org/abs/2301.07331",
    "authors": [
      "Yajie Zhang",
      "Ce Yu",
      "Chao Sun",
      "Jian Xiao",
      "Kun Li",
      "Yifei Mu",
      "Chenzhou Cui"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2301.07475",
    "title": "Curvilinear object segmentation in medical images based on ODoS filter  and deep learning network",
    "abstract": "Automatic segmentation of curvilinear objects in medical images plays an important role in the diagnosis and evaluation of human diseases, yet it is a challenging uncertainty for the complex segmentation task due to different issues like various image appearance, low contrast between curvilinear objects and their surrounding backgrounds, thin and uneven curvilinear structures, and improper background illumination. To overcome these challenges, we present a unique curvilinear structure segmentation framework based on oriented derivative of stick (ODoS) filter and deep learning network for curvilinear object segmentation in medical images. Currently, a large number of deep learning models emphasis on developing deep architectures and ignore capturing the structural features of curvature objects, which may lead to unsatisfactory results. In consequence, a new approach that incorporates the ODoS filter as part of a deep learning network is presented to improve the spatial attention of curvilinear objects. In which, the original image is considered as principal part to describe various image appearance and complex background illumination, the multi-step strategy is used to enhance contrast between curvilinear objects and their surrounding backgrounds, and the vector field is applied to discriminate thin and uneven curvilinear structures. Subsequently, a deep learning framework is employed to extract varvious structural features for curvilinear object segmentation in medical images. The performance of the computational model was validated in experiments with publicly available DRIVE, STARE and CHASEDB1 datasets. Experimental results indicate that the presented model has yielded surprising results compared with some state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2301.07475",
    "authors": [
      "Yuanyuan Peng",
      "Lin Pan",
      "Pengpeng Luan",
      "Hongbin Tu",
      "Xiong Li"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07528",
    "title": "Quantum-inspired tensor network for Earth science",
    "abstract": "Deep Learning (DL) is one of many successful methodologies to extract informative patterns and insights from ever increasing noisy large-scale datasets (in our case, satellite images). However, DL models consist of a few thousand to millions of training parameters, and these training parameters require tremendous amount of electrical power for extracting informative patterns from noisy large-scale datasets (e.g., computationally expensive). Hence, we employ a quantum-inspired tensor network for compressing trainable parameters of physics-informed neural networks (PINNs) in Earth science. PINNs are DL models penalized by enforcing the law of physics; in particular, the law of physics is embedded in DL models. In addition, we apply tensor decomposition to HyperSpectral Images (HSIs) to improve their spectral resolution. A quantum-inspired tensor network is also the native formulation to efficiently represent and train quantum machine learning models on big datasets on GPU tensor cores. Furthermore, the key contribution of this paper is twofold: (I) we reduced a number of trainable parameters of PINNs by using a quantum-inspired tensor network, and (II) we improved the spectral resolution of remotely-sensed images by employing tensor decomposition. As a benchmark PDE, we solved Burger's equation. As practical satellite data, we employed HSIs of Indian Pine, USA and of Pavia University, Italy. ",
    "url": "https://arxiv.org/abs/2301.07528",
    "authors": [
      "Soronzonbold Otgonbaatar",
      "Dieter Kranzlmüller"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2301.07568",
    "title": "Beating the Best: Improving on AlphaFold2 at Protein Structure  Prediction",
    "abstract": "The goal of Protein Structure Prediction (PSP) problem is to predict a protein's 3D structure (confirmation) from its amino acid sequence. The problem has been a 'holy grail' of science since the Noble prize-winning work of Anfinsen demonstrated that protein conformation was determined by sequence. A recent and important step towards this goal was the development of AlphaFold2, currently the best PSP method. AlphaFold2 is probably the highest profile application of AI to science. Both AlphaFold2 and RoseTTAFold (another impressive PSP method) have been published and placed in the public domain (code & models). Stacking is a form of ensemble machine learning ML in which multiple baseline models are first learnt, then a meta-model is learnt using the outputs of the baseline level model to form a model that outperforms the base models. Stacking has been successful in many applications. We developed the ARStack PSP method by stacking AlphaFold2 and RoseTTAFold. ARStack significantly outperforms AlphaFold2. We rigorously demonstrate this using two sets of non-homologous proteins, and a test set of protein structures published after that of AlphaFold2 and RoseTTAFold. As more high quality prediction methods are published it is likely that ensemble methods will increasingly outperform any single method. ",
    "url": "https://arxiv.org/abs/2301.07568",
    "authors": [
      "Abbi Abdel-Rehim",
      "Oghenejokpeme Orhobor",
      "Hang Lou",
      "Hao Ni",
      "Ross D. King"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1809.10736",
    "title": "Controllable Neural Story Plot Generation via Reward Shaping",
    "abstract": " Comments: Pradyumna Tambwekar & Murtaza Dhuliawala contributed equally ",
    "url": "https://arxiv.org/abs/1809.10736",
    "authors": [
      "Pradyumna Tambwekar",
      "Murtaza Dhuliawala",
      "Lara J. Martin",
      "Animesh Mehta",
      "Brent Harrison",
      "Mark O. Riedl"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:1810.05602",
    "title": "Perfectly Secure Communication, based on Graph-Topological Addressing in  Unique-Neighborhood Networks",
    "abstract": " Title: Perfectly Secure Communication, based on Graph-Topological Addressing in  Unique-Neighborhood Networks ",
    "url": "https://arxiv.org/abs/1810.05602",
    "authors": [
      "Stefan Rass"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:1905.05055",
    "title": "Object Detection in 20 Years: A Survey",
    "abstract": " Comments: Accepted by Proceedings of the IEEE ",
    "url": "https://arxiv.org/abs/1905.05055",
    "authors": [
      "Zhengxia Zou",
      "Keyan Chen",
      "Zhenwei Shi",
      "Yuhong Guo",
      "Jieping Ye"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2006.14563",
    "title": "Dynamically Mitigating Data Discrepancy with Balanced Focal Loss for  Replay Attack Detection",
    "abstract": " Comments: The 25th International Conference on Pattern Recognition (ICPR2020) ",
    "url": "https://arxiv.org/abs/2006.14563",
    "authors": [
      "Yongqiang Dou",
      "Haocheng Yang",
      "Maolin Yang",
      "Yanyan Xu",
      "Dengfeng Ke"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2012.10794",
    "title": "Sample Complexity of Adversarially Robust Linear Classification on  Separated Data",
    "abstract": " Title: Sample Complexity of Adversarially Robust Linear Classification on  Separated Data ",
    "url": "https://arxiv.org/abs/2012.10794",
    "authors": [
      "Robi Bhattacharjee",
      "Somesh Jha",
      "Kamalika Chaudhuri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2012.14512",
    "title": "No-substitution k-means Clustering with Adversarial Order",
    "abstract": " Comments: accepted to ALT 2021 ",
    "url": "https://arxiv.org/abs/2012.14512",
    "authors": [
      "Robi Bhattacharjee",
      "Michal Moshkovitz"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2102.09086",
    "title": "Consistent Non-Parametric Methods for Maximizing Robustness",
    "abstract": " Comments: accepted to Nuerips 2021 ",
    "url": "https://arxiv.org/abs/2102.09086",
    "authors": [
      "Robi Bhattacharjee",
      "Kamalika Chaudhuri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.02359",
    "title": "How Good Is NLP? A Sober Look at NLP Tasks through the Lens of Social  Impact",
    "abstract": " Comments: Findings of ACL 2021; also accepted at the NLP for Positive Impact workshop@ACL 2021 ",
    "url": "https://arxiv.org/abs/2106.02359",
    "authors": [
      "Zhijing Jin",
      "Geeticka Chauhan",
      "Brian Tse",
      "Mrinmaya Sachan",
      "Rada Mihalcea"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.13621",
    "title": "An Optimal Algorithm for Finding Champions in Tournament Graphs",
    "abstract": " Title: An Optimal Algorithm for Finding Champions in Tournament Graphs ",
    "url": "https://arxiv.org/abs/2111.13621",
    "authors": [
      "Lorenzo Beretta",
      "Franco Maria Nardini",
      "Roberto Trani",
      "Rossano Venturini"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2112.06126",
    "title": "Neural Network Quantization for Efficient Inference: A Survey",
    "abstract": " Comments: 13 pages ",
    "url": "https://arxiv.org/abs/2112.06126",
    "authors": [
      "Olivia Weng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.15530",
    "title": "Scalable Deep Graph Clustering with Random-walk based Self-supervised  Learning",
    "abstract": " Title: Scalable Deep Graph Clustering with Random-walk based Self-supervised  Learning ",
    "url": "https://arxiv.org/abs/2112.15530",
    "authors": [
      "Xiang Li",
      "Dong Li",
      "Ruoming Jin",
      "Gagan Agrawal",
      "Rajiv Ramnath"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2202.07901",
    "title": "Auxiliary Cross-Modal Representation Learning with Triplet Loss  Functions for Online Handwriting Recognition",
    "abstract": " Title: Auxiliary Cross-Modal Representation Learning with Triplet Loss  Functions for Online Handwriting Recognition ",
    "url": "https://arxiv.org/abs/2202.07901",
    "authors": [
      "Felix Ott",
      "David Rügamer",
      "Lucas Heublein",
      "Bernd Bischl",
      "Christopher Mutschler"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.08312",
    "title": "Improved Differential Privacy for SGD via Optimal Private Linear  Operators on Adaptive Streams",
    "abstract": " Comments: 33 pages, 6 figures. Associated code at this https URL ",
    "url": "https://arxiv.org/abs/2202.08312",
    "authors": [
      "Sergey Denisov",
      "Brendan McMahan",
      "Keith Rush",
      "Adam Smith",
      "Abhradeep Guha Thakurta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2205.03721",
    "title": "Category-Independent Articulated Object Tracking with Factor Graphs",
    "abstract": " Comments: V2: Camera-ready IROS 2022 version 11 pages, 10 figures, IROS 2022 ",
    "url": "https://arxiv.org/abs/2205.03721",
    "authors": [
      "Nick Heppert",
      "Toki Migimatsu",
      "Brent Yi",
      "Claire Chen",
      "Jeannette Bohg"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.14851",
    "title": "Exposing Fine-Grained Adversarial Vulnerability of Face Anti-Spoofing  Models",
    "abstract": " Title: Exposing Fine-Grained Adversarial Vulnerability of Face Anti-Spoofing  Models ",
    "url": "https://arxiv.org/abs/2205.14851",
    "authors": [
      "Songlin Yang",
      "Wei Wang",
      "Chenye Xu",
      "Ziwen He",
      "Bo Peng",
      "Jing Dong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.14008",
    "title": "Prediction of Red Wine Quality Using One-dimensional Convolutional  Neural Networks",
    "abstract": " Title: Prediction of Red Wine Quality Using One-dimensional Convolutional  Neural Networks ",
    "url": "https://arxiv.org/abs/2208.14008",
    "authors": [
      "S. Di",
      "Y. Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.03299",
    "title": "Multimodal learning with graphs",
    "abstract": " Comments: 27 pages, 5 figures, 2 boxes ",
    "url": "https://arxiv.org/abs/2209.03299",
    "authors": [
      "Yasha Ektefaie",
      "George Dasoulas",
      "Ayush Noori",
      "Maha Farhat",
      "Marinka Zitnik"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.16875",
    "title": "A Multi-modal Deformable Land-air Robot for Complex Environments",
    "abstract": " Title: A Multi-modal Deformable Land-air Robot for Complex Environments ",
    "url": "https://arxiv.org/abs/2210.16875",
    "authors": [
      "Xinyu Zhang",
      "Yuanhao Huang",
      "Kangyao Huang",
      "Xiaoyu Wang",
      "Dafeng Jin",
      "Huaping Liu",
      "Jun Li"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2211.04071",
    "title": "Improving performance of real-time full-band blind packet-loss  concealment with predictive network",
    "abstract": " Comments: Submitted to ICASSP 2023, 5 pages, 1 figure, 4 tables ",
    "url": "https://arxiv.org/abs/2211.04071",
    "authors": [
      "Viet-Anh Nguyen",
      "Anh H. T. Nguyen",
      "Andy W. H. Khong"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2211.04756",
    "title": "Spiking Neural Network Decision Feedback Equalization",
    "abstract": " Comments: accepted for publication at SCC 2023 ",
    "url": "https://arxiv.org/abs/2211.04756",
    "authors": [
      "Eike-Manuel Bansbach",
      "Alexander von Bank",
      "Laurent Schmalen"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2211.07533",
    "title": "Generalized Balancing Weights via Deep Neural Networks",
    "abstract": " Comments: The main theorem and algorithms are partially changed, because errors were found in the proof of the theorem ",
    "url": "https://arxiv.org/abs/2211.07533",
    "authors": [
      "Yoshiaki Kitazawa"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.11554",
    "title": "Programming by Example and Text-to-Code Translation for Conversational  Code Generation",
    "abstract": " Comments: 13 pages, 2 figures, conference preprint ",
    "url": "https://arxiv.org/abs/2211.11554",
    "authors": [
      "Eli Whitehouse",
      "William Gerard",
      "Yauhen Klimovich",
      "Marc Franco-Salvador"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2211.14302",
    "title": "Neural DAEs: Constrained neural networks",
    "abstract": " Comments: Updated the experiments and preparing for submission to JCP ",
    "url": "https://arxiv.org/abs/2211.14302",
    "authors": [
      "Tue Boesen",
      "Eldad Haber",
      "Uri M. Ascher"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2212.10682",
    "title": "Privacy-Protecting Behaviours of Risk Detection in People with Dementia  using Videos",
    "abstract": " Title: Privacy-Protecting Behaviours of Risk Detection in People with Dementia  using Videos ",
    "url": "https://arxiv.org/abs/2212.10682",
    "authors": [
      "Pratik K. Mishra",
      "Andrea Iaboni",
      "Bing Ye",
      "Kristine Newman",
      "Alex Mihailidis",
      "Shehroz S. Khan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.12970",
    "title": "Refined Edge Usage of Graph Neural Networks for Edge Prediction",
    "abstract": " Comments: Pre-print ",
    "url": "https://arxiv.org/abs/2212.12970",
    "authors": [
      "Jiarui Jin",
      "Yangkun Wang",
      "Weinan Zhang",
      "Quan Gan",
      "Xiang Song",
      "Yong Yu",
      "Zheng Zhang",
      "David Wipf"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2301.03155",
    "title": "Instance Segmentation Based Graph Extraction for Handwritten Circuit  Diagram Images",
    "abstract": " Comments: As submitted to ICPRAM23 ",
    "url": "https://arxiv.org/abs/2301.03155",
    "authors": [
      "Johannes Bayer",
      "Amit Kumar Roy",
      "Andreas Dengel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.05599",
    "title": "Short-time SSVEP data extension by a novel generative adversarial  networks based framework",
    "abstract": " Comments: 10 pages, 8 figures, 2 tables, submitted to IEEE TBME ",
    "url": "https://arxiv.org/abs/2301.05599",
    "authors": [
      "Yudong Pan",
      "Ning Li",
      "Yangsong Zhang"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.05892",
    "title": "Object Detection performance variation on compressed satellite image  datasets with iquaflow",
    "abstract": " Title: Object Detection performance variation on compressed satellite image  datasets with iquaflow ",
    "url": "https://arxiv.org/abs/2301.05892",
    "authors": [
      "Pau Gallés",
      "Katalin Takats",
      "Javier Marin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.06080",
    "title": "Comprehensive Literature Survey on Deep Learning used in Image  Memorability Prediction and Modification",
    "abstract": " Title: Comprehensive Literature Survey on Deep Learning used in Image  Memorability Prediction and Modification ",
    "url": "https://arxiv.org/abs/2301.06080",
    "authors": [
      "Ananya Sadana",
      "Nikita Thakur",
      "Nikita Poria",
      "Astika Anand",
      "Seeja K.R"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.06156",
    "title": "Least-Squares Neural Network (LSNN) Method for Linear Advection-Reaction  Equation: General Discontinuous Interface",
    "abstract": " Comments: Submitted to SIAM Journal on Scientific Computing (SISC) ",
    "url": "https://arxiv.org/abs/2301.06156",
    "authors": [
      "Zhiqiang Cai",
      "Junpyo Choi",
      "Min Liu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2301.06331",
    "title": "Hybrid quantum-classical convolutional neural networks to improve  molecular protein binding affinity predictions",
    "abstract": " Comments: 14 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2301.06331",
    "authors": [
      "L. Domingo",
      "M. Djukic",
      "C. Johnson",
      "F. Borondo"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2301.06701",
    "title": "Operator Learning Framework for Digital Twin and Complex Engineering  Systems",
    "abstract": " Title: Operator Learning Framework for Digital Twin and Complex Engineering  Systems ",
    "url": "https://arxiv.org/abs/2301.06701",
    "authors": [
      "Kazuma Kobayashi",
      "James Daniell",
      "Syed B. Alam"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Computation (stat.CO)",
      "Machine Learning (stat.ML)"
    ]
  }
]