[
  {
    "id": "arXiv:2402.09469",
    "title": "Fourier Circuits in Neural Networks: Unlocking the Potential of Large  Language Models in Mathematical Reasoning and Modular Arithmetic",
    "abstract": "In the evolving landscape of machine learning, a pivotal challenge lies in deciphering the internal representations harnessed by neural networks and Transformers. Building on recent progress toward comprehending how networks execute distinct target functions, our study embarks on an exploration of the underlying reasons behind networks adopting specific computational strategies. We direct our focus to the complex algebraic learning task of modular addition involving $k$ inputs. Our research presents a thorough analytical characterization of the features learned by stylized one-hidden layer neural networks and one-layer Transformers in addressing this task. A cornerstone of our theoretical framework is the elucidation of how the principle of margin maximization shapes the features adopted by one-hidden layer neural networks. Let $p$ denote the modulus, $D_p$ denote the dataset of modular arithmetic with $k$ inputs and $m$ denote the network width. We demonstrate that a neuron count of $ m \\geq 2^{2k-2} \\cdot (p-1) $, these networks attain a maximum $ L_{2,k+1} $-margin on the dataset $ D_p $. Furthermore, we establish that each hidden-layer neuron aligns with a specific Fourier spectrum, integral to solving modular addition problems. By correlating our findings with the empirical observations of similar studies, we contribute to a deeper comprehension of the intrinsic computational mechanisms of neural networks. Furthermore, we observe similar computational mechanisms in the attention matrix of the Transformer. This research stands as a significant stride in unraveling their operation complexities, particularly in the realm of complex algebraic tasks. ",
    "url": "https://arxiv.org/abs/2402.09469",
    "authors": [
      "Jiuxiang Gu",
      "Chenyang Li",
      "Yingyu Liang",
      "Zhenmei Shi",
      "Zhao Song",
      "Tianyi Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.09477",
    "title": "PANORAMIA: Privacy Auditing of Machine Learning Models without  Retraining",
    "abstract": "We introduce a privacy auditing scheme for ML models that relies on membership inference attacks using generated data as \"non-members\". This scheme, which we call PANORAMIA, quantifies the privacy leakage for large-scale ML models without control of the training process or model re-training and only requires access to a subset of the training data. To demonstrate its applicability, we evaluate our auditing scheme across multiple ML domains, ranging from image and tabular data classification to large-scale language models. ",
    "url": "https://arxiv.org/abs/2402.09477",
    "authors": [
      "Mishaal Kazmi",
      "Hadrien Lautraite",
      "Alireza Akbari",
      "Mauricio Soroco",
      "Qiaoyue Tang",
      "Tao Wang",
      "Sébastien Gambs",
      "Mathias Lécuyer"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09478",
    "title": "Data Reconstruction Attacks and Defenses: A Systematic Evaluation",
    "abstract": "Reconstruction attacks and defenses are essential in understanding the data leakage problem in machine learning. However, prior work has centered around empirical observations of gradient inversion attacks, lacks theoretical groundings, and was unable to disentangle the usefulness of defending methods versus the computational limitation of attacking methods. In this work, we propose a strong reconstruction attack in the setting of federated learning. The attack reconstructs intermediate features and nicely integrates with and outperforms most of the previous methods. On this stronger attack, we thoroughly investigate both theoretically and empirically the effect of the most common defense methods. Our findings suggest that among various defense mechanisms, such as gradient clipping, dropout, additive noise, local aggregation, etc., gradient pruning emerges as the most effective strategy to defend against state-of-the-art attacks. ",
    "url": "https://arxiv.org/abs/2402.09478",
    "authors": [
      "Sheng Liu",
      "Zihan Wang",
      "Qi Lei"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09486",
    "title": "UMOEA/D: A Multiobjective Evolutionary Algorithm for Uniform Pareto  Objectives based on Decomposition",
    "abstract": "Multiobjective optimization (MOO) is prevalent in numerous applications, in which a Pareto front (PF) is constructed to display optima under various preferences. Previous methods commonly utilize the set of Pareto objectives (particles on the PF) to represent the entire PF. However, the empirical distribution of the Pareto objectives on the PF is rarely studied, which implicitly impedes the generation of diverse and representative Pareto objectives in previous methods. To bridge the gap, we suggest in this paper constructing \\emph{uniformly distributed} Pareto objectives on the PF, so as to alleviate the limited diversity found in previous MOO approaches. We are the first to formally define the concept of ``uniformity\" for an MOO problem. We optimize the maximal minimal distances on the Pareto front using a neural network, resulting in both asymptotically and non-asymptotically uniform Pareto objectives. Our proposed method is validated through experiments on real-world and synthetic problems, which demonstrates the efficacy in generating high-quality uniform Pareto objectives and the encouraging performance exceeding existing state-of-the-art methods. The detailed model implementation and the code are scheduled to be open-sourced upon publication. ",
    "url": "https://arxiv.org/abs/2402.09486",
    "authors": [
      "Xiaoyuan Zhang",
      "Xi Lin",
      "Yichi Zhang",
      "Yifan Chen",
      "Qingfu Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09497",
    "title": "Instruction Tuning for Secure Code Generation",
    "abstract": "Modern language models (LMs) have gained widespread acceptance in everyday and professional contexts, particularly in programming. An essential procedure enabling this adoption is instruction tuning, which substantially enhances LMs' practical utility by training them to follow user instructions and human preferences. However, existing instruction tuning schemes overlook a crucial aspect: the security of generated code. As a result, even the state-of-the-art instruction-tuned LMs frequently produce unsafe code, posing significant security risks. In this work, we introduce SafeCoder to address this gap. SafeCoder performs security-centric fine-tuning using a diverse and high-quality dataset that we collected using an automated pipeline. We integrate the security fine-tuning with standard instruction tuning, to facilitate a joint optimization of both security and utility. Despite its simplicity, we show that SafeCoder is effective across a variety of popular LMs and datasets. It is able to drastically improve security (by about 30%), while preserving utility. ",
    "url": "https://arxiv.org/abs/2402.09497",
    "authors": [
      "Jingxuan He",
      "Mark Vero",
      "Gabriela Krasnopolska",
      "Martin Vechev"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2402.09498",
    "title": "Detection of the most influential variables for preventing postpartum  urinary incontinence using machine learning techniques",
    "abstract": "Background: Postpartum urinary incontinence (PUI) is a common issue among postnatal women. Previous studies identified potential related variables, but lacked analysis on certain intrinsic and extrinsic patient variables during pregnancy. Objective: The study aims to evaluate the most influential variables in PUI using machine learning, focusing on intrinsic, extrinsic, and combined variable groups. Methods: Data from 93 pregnant women were analyzed using machine learning and oversampling techniques. Four key variables were predicted: occurrence, frequency, intensity of urinary incontinence, and stress urinary incontinence. Results: Models using extrinsic variables were most accurate, with 70% accuracy for urinary incontinence, 77% for frequency, 71% for intensity, and 93% for stress urinary incontinence. Conclusions: The study highlights extrinsic variables as significant predictors of PUI issues. This suggests that PUI prevention might be achievable through healthy habits during pregnancy, although further research is needed for confirmation. ",
    "url": "https://arxiv.org/abs/2402.09498",
    "authors": [
      "José Alberto Benítez-Andrades",
      "María Teresa García-Ordás",
      "María Álvarez-González",
      "Raquel Leirós-Rodríguez",
      "Ana F López Rodríguez"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.09528",
    "title": "Help Me to Understand this Commit! -- A Vision for Contextualized Code  Reviews",
    "abstract": "Background: Modern Code Review (MCR) is a key component for delivering high-quality software and sharing knowledge among developers. Effective reviews require an in-depth understanding of the code and demand from the reviewers to contextualize the change from different perspectives. Aim: While there is a plethora of research on solutions that support developers to understand changed code, we have observed that many provide only narrow, specialized insights and very few aggregate information in a meaningful manner. Therefore, we aim to provide a vision of improving code understanding in MCR. Method: We classified 53 research papers suggesting proposals to improve MCR code understanding. We use this classification, the needs expressed by code reviewers from previous research, and the information we have not found in the literature for extrapolation. Results: We identified four major types of support systems and suggest an environment for contextualized code reviews. Furthermore, we illustrate with a set of scenarios how such an environment would improve the effectiveness of code reviews. Conclusions: Current research focuses mostly on providing narrow support for developers. We outline a vision for how MCR can be improved by using context and reducing the cognitive load on developers. We hope our vision can foster future advancements in development environments. ",
    "url": "https://arxiv.org/abs/2402.09528",
    "authors": [
      "Michael Unterkalmsteiner",
      "Deepika Badampudi",
      "Ricardo Britto",
      "Nauman bin Ali"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2402.09530",
    "title": "Reducing Texture Bias of Deep Neural Networks via Edge Enhancing  Diffusion",
    "abstract": "Convolutional neural networks (CNNs) for image processing tend to focus on localized texture patterns, commonly referred to as texture bias. While most of the previous works in the literature focus on the task of image classification, we go beyond this and study the texture bias of CNNs in semantic segmentation. In this work, we propose to train CNNs on pre-processed images with less texture to reduce the texture bias. Therein, the challenge is to suppress image texture while preserving shape information. To this end, we utilize edge enhancing diffusion (EED), an anisotropic image diffusion method initially introduced for image compression, to create texture reduced duplicates of existing datasets. Extensive numerical studies are performed with both CNNs and vision transformer models trained on original data and EED-processed data from the Cityscapes dataset and the CARLA driving simulator. We observe strong texture-dependence of CNNs and moderate texture-dependence of transformers. Training CNNs on EED-processed images enables the models to become completely ignorant with respect to texture, demonstrating resilience with respect to texture re-introduction to any degree. Additionally we analyze the performance reduction in depth on a level of connected components in the semantic segmentation and study the influence of EED pre-processing on domain generalization as well as adversarial robustness. ",
    "url": "https://arxiv.org/abs/2402.09530",
    "authors": [
      "Edgar Heinert",
      "Matthias Rottmann",
      "Kira Maag",
      "Karsten Kahl"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.09540",
    "title": "Why Does Differential Privacy with Large Epsilon Defend Against  Practical Membership Inference Attacks?",
    "abstract": "For small privacy parameter $\\epsilon$, $\\epsilon$-differential privacy (DP) provides a strong worst-case guarantee that no membership inference attack (MIA) can succeed at determining whether a person's data was used to train a machine learning model. The guarantee of DP is worst-case because: a) it holds even if the attacker already knows the records of all but one person in the data set; and b) it holds uniformly over all data sets. In practical applications, such a worst-case guarantee may be overkill: practical attackers may lack exact knowledge of (nearly all of) the private data, and our data set might be easier to defend, in some sense, than the worst-case data set. Such considerations have motivated the industrial deployment of DP models with large privacy parameter (e.g. $\\epsilon \\geq 7$), and it has been observed empirically that DP with large $\\epsilon$ can successfully defend against state-of-the-art MIAs. Existing DP theory cannot explain these empirical findings: e.g., the theoretical privacy guarantees of $\\epsilon \\geq 7$ are essentially vacuous. In this paper, we aim to close this gap between theory and practice and understand why a large DP parameter can prevent practical MIAs. To tackle this problem, we propose a new privacy notion called practical membership privacy (PMP). PMP models a practical attacker's uncertainty about the contents of the private data. The PMP parameter has a natural interpretation in terms of the success rate of a practical MIA on a given data set. We quantitatively analyze the PMP parameter of two fundamental DP mechanisms: the exponential mechanism and Gaussian mechanism. Our analysis reveals that a large DP parameter often translates into a much smaller PMP parameter, which guarantees strong privacy against practical MIAs. Using our findings, we offer principled guidance for practitioners in choosing the DP parameter. ",
    "url": "https://arxiv.org/abs/2402.09540",
    "authors": [
      "Andrew Lowy",
      "Zhuohang Li",
      "Jing Liu",
      "Toshiaki Koike-Akino",
      "Kieran Parsons",
      "Ye Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09557",
    "title": "Enhancing Source Code Representations for Deep Learning with Static  Analysis",
    "abstract": "Deep learning techniques applied to program analysis tasks such as code classification, summarization, and bug detection have seen widespread interest. Traditional approaches, however, treat programming source code as natural language text, which may neglect significant structural or semantic details. Additionally, most current methods of representing source code focus solely on the code, without considering beneficial additional context. This paper explores the integration of static analysis and additional context such as bug reports and design patterns into source code representations for deep learning models. We use the Abstract Syntax Tree-based Neural Network (ASTNN) method and augment it with additional context information obtained from bug reports and design patterns, creating an enriched source code representation that significantly enhances the performance of common software engineering tasks such as code classification and code clone detection. Utilizing existing open-source code data, our approach improves the representation and processing of source code, thereby improving task performance. ",
    "url": "https://arxiv.org/abs/2402.09557",
    "authors": [
      "Xueting Guan",
      "Christoph Treude"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2402.09558",
    "title": "Bidirectional Generative Pre-training for Improving Time Series  Representation Learning",
    "abstract": "Learning time-series representations for discriminative tasks has been a long-standing challenge. Current pre-training methods are limited in either unidirectional next-token prediction or randomly masked token prediction. We propose a novel architecture called Bidirectional Timely Generative Pre-trained Transformer (BiTimelyGPT), which pre-trains on time-series data by both next-token and previous-token predictions in alternating transformer layers. This pre-training task preserves original distribution and data shapes of the time-series. Additionally, the full-rank forward and backward attention matrices exhibit more expressive representation capabilities. Using biosignal data, BiTimelyGPT demonstrates superior performance in predicting neurological functionality, disease diagnosis, and physiological signs. By visualizing the attention heatmap, we observe that the pre-trained BiTimelyGPT can identify discriminative segments from time-series sequences, even more so after fine-tuning on the task. ",
    "url": "https://arxiv.org/abs/2402.09558",
    "authors": [
      "Ziyang Song",
      "Qincheng Lu",
      "He Zhu",
      "Yue Li"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09565",
    "title": "Graph-Skeleton: ~1% Nodes are Sufficient to Represent Billion-Scale  Graph",
    "abstract": "Due to the ubiquity of graph data on the web, web graph mining has become a hot research spot. Nonetheless, the prevalence of large-scale web graphs in real applications poses significant challenges to storage, computational capacity and graph model design. Despite numerous studies to enhance the scalability of graph models, a noticeable gap remains between academic research and practical web graph mining applications. One major cause is that in most industrial scenarios, only a small part of nodes in a web graph are actually required to be analyzed, where we term these nodes as target nodes, while others as background nodes. In this paper, we argue that properly fetching and condensing the background nodes from massive web graph data might be a more economical shortcut to tackle the obstacles fundamentally. To this end, we make the first attempt to study the problem of massive background nodes compression for target nodes classification. Through extensive experiments, we reveal two critical roles played by the background nodes in target node classification: enhancing structural connectivity between target nodes, and feature correlation with target nodes. Followingthis, we propose a novel Graph-Skeleton1 model, which properly fetches the background nodes, and further condenses the semantic and topological information of background nodes within similar target-background local structures. Extensive experiments on various web graph datasets demonstrate the effectiveness and efficiency of the proposed method. In particular, for MAG240M dataset with 0.24 billion nodes, our generated skeleton graph achieves highly comparable performance while only containing 1.8% nodes of the original graph. ",
    "url": "https://arxiv.org/abs/2402.09565",
    "authors": [
      "Linfeng Cao",
      "Haoran Deng",
      "Chunping Wang",
      "Lei Chen",
      "Yang Yang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.09568",
    "title": "Irreducible Markov Chains on spaces of graphs with fixed degree-color  sequences",
    "abstract": "We study a colored generalization of the famous simple-switch Markov chain for sampling the set of graphs with a fixed degree sequence. Here we consider the space of graphs with colored vertices, in which we fix the degree sequence and another statistic arising from the vertex coloring, and prove that the set can be connected with simple color-preserving switches or moves. These moves form a basis for defining an irreducible Markov chain necessary for testing statistical model fit to block-partitioned network data. Our methods further generalize well-known algebraic results from the 1990s: namely, that the corresponding moves can be used to construct a regular triangulation for a generalization of the second hypersimplex. On the other hand, in contrast to the monochromatic case, we show that for simple graphs, the 1-norm of the moves necessary to connect the space increases with the number of colors. ",
    "url": "https://arxiv.org/abs/2402.09568",
    "authors": [
      "Félix Almendra-Hernández",
      "Jesús A. De Loera",
      "Sonja Petrović"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Commutative Algebra (math.AC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2402.09569",
    "title": "Automated Plaque Detection and Agatston Score Estimation on Non-Contrast  CT Scans: A Multicenter Study",
    "abstract": "Coronary artery calcification (CAC) is a strong and independent predictor of cardiovascular disease (CVD). However, manual assessment of CAC often requires radiological expertise, time, and invasive imaging techniques. The purpose of this multicenter study is to validate an automated cardiac plaque detection model using a 3D multiclass nnU-Net for gated and non-gated non-contrast chest CT volumes. CT scans were performed at three tertiary care hospitals and collected as three datasets, respectively. Heart, aorta, and lung segmentations were determined using TotalSegmentator, while plaques in the coronary arteries and heart valves were manually labeled for 801 volumes. In this work we demonstrate how the nnU-Net semantic segmentation pipeline may be adapted to detect plaques in the coronary arteries and valves. With a linear correction, nnU-Net deep learning methods may also accurately estimate Agatston scores on chest non-contrast CT scans. Compared to manual Agatson scoring, automated Agatston scoring indicated a slope of the linear regression of 0.841 with an intercept of +16 HU (R2 = 0.97). These results are an improvement over previous work assessing automated Agatston score computation in non-gated CT scans. ",
    "url": "https://arxiv.org/abs/2402.09569",
    "authors": [
      "Andrew M. Nguyen",
      "Jianfei Liu",
      "Tejas Sudharshan Mathai",
      "Peter C. Grayson",
      "Ronald M. Summers"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.09586",
    "title": "WERank: Towards Rank Degradation Prevention for Self-Supervised Learning  Using Weight Regularization",
    "abstract": "A common phenomena confining the representation quality in Self-Supervised Learning (SSL) is dimensional collapse (also known as rank degeneration), where the learned representations are mapped to a low dimensional subspace of the representation space. The State-of-the-Art SSL methods have shown to suffer from dimensional collapse and fall behind maintaining full rank. Recent approaches to prevent this problem have proposed using contrastive losses, regularization techniques, or architectural tricks. We propose WERank, a new regularizer on the weight parameters of the network to prevent rank degeneration at different layers of the network. We provide empirical evidence and mathematical justification to demonstrate the effectiveness of the proposed regularization method in preventing dimensional collapse. We verify the impact of WERank on graph SSL where dimensional collapse is more pronounced due to the lack of proper data augmentation. We empirically demonstrate that WERank is effective in helping BYOL to achieve higher rank during SSL pre-training and consequently downstream accuracy during evaluation probing. Ablation studies and experimental analysis shed lights on the underlying factors behind the performance gains of the proposed approach. ",
    "url": "https://arxiv.org/abs/2402.09586",
    "authors": [
      "Ali Saheb Pasand",
      "Reza Moravej",
      "Mahdi Biparva",
      "Ali Ghodsi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09591",
    "title": "Reconstructing the Geometry of Random Geometric Graphs",
    "abstract": "Random geometric graphs are random graph models defined on metric spaces. Such a model is defined by first sampling points from a metric space and then connecting each pair of sampled points with probability that depends on their distance, independently among pairs. In this work, we show how to efficiently reconstruct the geometry of the underlying space from the sampled graph under the manifold assumption, i.e., assuming that the underlying space is a low dimensional manifold and that the connection probability is a strictly decreasing function of the Euclidean distance between the points in a given embedding of the manifold in $\\mathbb{R}^N$. Our work complements a large body of work on manifold learning, where the goal is to recover a manifold from sampled points sampled in the manifold along with their (approximate) distances. ",
    "url": "https://arxiv.org/abs/2402.09591",
    "authors": [
      "Han Huang",
      "Pakawut Jiradilok",
      "Elchanan Mossel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2402.09592",
    "title": "A Web-Based Tool for Automatic Data Collection, Curation, and  Visualization of Complex Healthcare Survey Studies including Social Network  Analysis",
    "abstract": "There is a great concern nowadays regarding alcohol consumption and drug abuse, especially in young people. Analyzing the social environment where these adolescents are immersed, as well as a series of measures determining the alcohol abuse risk or personal situation and perception using a number of questionnaires like AUDIT, FAS, KIDSCREEN, and others, it is possible to gain insight into the current situation of a given individual regarding his/her consumption behavior. But this analysis, in order to be achieved, requires the use of tools that can ease the process of questionnaire creation, data gathering, curation and representation, and later analysis and visualization to the user. This research presents the design and construction of a web-based platform able to facilitate each of the mentioned processes by integrating the different phases into an intuitive system with a graphical user interface that hides the complexity underlying each of the questionnaires and techniques used and presenting the results in a flexible and visual way, avoiding any manual handling of data during the process. Advantages of this approach are shown and compared to the previous situation where some of the tasks were accomplished by time consuming and error prone manipulations of data. ",
    "url": "https://arxiv.org/abs/2402.09592",
    "authors": [
      "José Alberto Benítez-Andrades",
      "José Emilio Labra",
      "Enedina Quiroga",
      "Vicente Martín",
      "Isaías García",
      "Pilar Marqués-Sánchez",
      "Carmen Benavides"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2402.09596",
    "title": "Pulmonologists-Level lung cancer detection based on standard blood test  results and smoking status using an explainable machine learning approach",
    "abstract": "Lung cancer (LC) remains the primary cause of cancer-related mortality, largely due to late-stage diagnoses. Effective strategies for early detection are therefore of paramount importance. In recent years, machine learning (ML) has demonstrated considerable potential in healthcare by facilitating the detection of various diseases. In this retrospective development and validation study, we developed an ML model based on dynamic ensemble selection (DES) for LC detection. The model leverages standard blood sample analysis and smoking history data from a large population at risk in Denmark. The study includes all patients examined on suspicion of LC in the Region of Southern Denmark from 2009 to 2018. We validated and compared the predictions by the DES model with diagnoses provided by five pulmonologists. Among the 38,944 patients, 9,940 had complete data of which 2,505 (25\\%) had LC. The DES model achieved an area under the roc curve of 0.77$\\pm$0.01, sensitivity of 76.2\\%$\\pm$2.4\\%, specificity of 63.8\\%$\\pm$2.3\\%, positive predictive value of 41.6\\%$\\pm$1.2\\%, and F\\textsubscript{1}-score of 53.8\\%$\\pm$1.1\\%. The DES model outperformed all five pulmonologists, achieving a sensitivity 9\\% higher than their average. The model identified smoking status, age, total calcium levels, neutrophil count, and lactate dehydrogenase as the most important factors for the detection of LC. The results highlight the successful application of the ML approach in detecting LC, surpassing pulmonologists' performance. Incorporating clinical and laboratory data in future risk assessment models can improve decision-making and facilitate timely referrals. ",
    "url": "https://arxiv.org/abs/2402.09596",
    "authors": [
      "Ricco Noel Hansen Flyckt",
      "Louise Sjodsholm",
      "Margrethe Høstgaard Bang Henriksen",
      "Claus Lohman Brasen",
      "Ali Ebrahimi",
      "Ole Hilberg",
      "Torben Frøstrup Hansen",
      "Uffe Kock Wiil",
      "Lars Henrik Jensen",
      "Abdolrahman Peimankar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09600",
    "title": "Low-Rank Graph Contrastive Learning for Node Classification",
    "abstract": "Graph Neural Networks (GNNs) have been widely used to learn node representations and with outstanding performance on various tasks such as node classification. However, noise, which inevitably exists in real-world graph data, would considerably degrade the performance of GNNs revealed by recent studies. In this work, we propose a novel and robust GNN encoder, Low-Rank Graph Contrastive Learning (LR-GCL). Our method performs transductive node classification in two steps. First, a low-rank GCL encoder named LR-GCL is trained by prototypical contrastive learning with low-rank regularization. Next, using the features produced by LR-GCL, a linear transductive classification algorithm is used to classify the unlabeled nodes in the graph. Our LR-GCL is inspired by the low frequency property of the graph data and its labels, and it is also theoretically motivated by our sharp generalization bound for transductive learning. To the best of our knowledge, our theoretical result is among the first to theoretically demonstrate the advantage of low-rank learning in graph contrastive learning supported by strong empirical performance. Extensive experiments on public benchmarks demonstrate the superior performance of LR-GCL and the robustness of the learned node representations. The code of LR-GCL is available at \\url{https://anonymous.4open.science/r/Low-Rank_Graph_Contrastive_Learning-64A6/}. ",
    "url": "https://arxiv.org/abs/2402.09600",
    "authors": [
      "Yancheng Wang",
      "Yingzhen Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.09603",
    "title": "Scalable Graph Self-Supervised Learning",
    "abstract": "In regularization Self-Supervised Learning (SSL) methods for graphs, computational complexity increases with the number of nodes in graphs and embedding dimensions. To mitigate the scalability of non-contrastive graph SSL, we propose a novel approach to reduce the cost of computing the covariance matrix for the pre-training loss function with volume-maximization terms. Our work focuses on reducing the cost associated with the loss computation via graph node or dimension sampling. We provide theoretical insight into why dimension sampling would result in accurate loss computations and support it with mathematical derivation of the novel approach. We develop our experimental setup on the node-level graph prediction tasks, where SSL pre-training has shown to be difficult due to the large size of real world graphs. Our experiments demonstrate that the cost associated with the loss computation can be reduced via node or dimension sampling without lowering the downstream performance. Our results demonstrate that sampling mostly results in improved downstream performance. Ablation studies and experimental analysis are provided to untangle the role of the different factors in the experimental setup. ",
    "url": "https://arxiv.org/abs/2402.09603",
    "authors": [
      "Ali Saheb Pasand",
      "Reza Moravej",
      "Mahdi Biparva",
      "Raika Karimi",
      "Ali Ghodsi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.09608",
    "title": "Exact, Fast and Expressive Poisson Point Processes via Squared Neural  Families",
    "abstract": "We introduce squared neural Poisson point processes (SNEPPPs) by parameterising the intensity function by the squared norm of a two layer neural network. When the hidden layer is fixed and the second layer has a single neuron, our approach resembles previous uses of squared Gaussian process or kernel methods, but allowing the hidden layer to be learnt allows for additional flexibility. In many cases of interest, the integrated intensity function admits a closed form and can be computed in quadratic time in the number of hidden neurons. We enumerate a far more extensive number of such cases than has previously been discussed. Our approach is more memory and time efficient than naive implementations of squared or exponentiated kernel methods or Gaussian processes. Maximum likelihood and maximum a posteriori estimates in a reparameterisation of the final layer of the intensity function can be obtained by solving a (strongly) convex optimisation problem using projected gradient descent. We demonstrate SNEPPPs on real, and synthetic benchmarks, and provide a software implementation. https://github.com/RussellTsuchida/snefy ",
    "url": "https://arxiv.org/abs/2402.09608",
    "authors": [
      "Russell Tsuchida",
      "Cheng Soon Ong",
      "Dino Sejdinovic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.09631",
    "title": "MiMiC: Minimally Modified Counterfactuals in the Representation Space",
    "abstract": "Language models often exhibit undesirable behaviors, such as gender bias or toxic language. Interventions in the representation space were shown effective in mitigating such issues by altering the LM behavior. We first show that two prominent intervention techniques, Linear Erasure and Steering Vectors, do not enable a high degree of control and are limited in expressivity. We then propose a novel intervention methodology for generating expressive counterfactuals in the representation space, aiming to make representations of a source class (e.g., ``toxic'') resemble those of a target class (e.g., ``non-toxic''). This approach, generalizing previous linear intervention techniques, utilizes a closed-form solution for the Earth Mover's problem under Gaussian assumptions and provides theoretical guarantees on the representation space's geometric organization. We further build on this technique and derive a nonlinear intervention that enables controlled generation. We demonstrate the effectiveness of the proposed approaches in mitigating bias in multiclass classification and in reducing the generation of toxic language, outperforming strong baselines. ",
    "url": "https://arxiv.org/abs/2402.09631",
    "authors": [
      "Shashwat Singh",
      "Shauli Ravfogel",
      "Jonathan Herzig",
      "Roee Aharoni",
      "Ryan Cotterell",
      "Ponnurangam Kumaraguru"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2402.09639",
    "title": "Misinformation Regulation in the Presence of Competition between Social  Media Platforms (Extended Version)",
    "abstract": "Social media platforms have diverse content moderation policies, with many prominent actors hesitant to impose strict regulations. A key reason for this reluctance could be the competitive advantage that comes with lax regulation. A popular platform that starts enforcing content moderation rules may fear that it could lose users to less-regulated alternative platforms. Moreover, if users continue harmful activities on other platforms, regulation ends up being futile. This article examines the competitive aspect of content moderation by considering the motivations of all involved players (platformer, news source, and social media users), identifying the regulation policies sustained in equilibrium, and evaluating the information quality available on each platform. Applied to simple yet relevant social networks such as stochastic block models, our model reveals the conditions for a popular platform to enforce strict regulation without losing users. Effectiveness of regulation depends on the diffusive property of news posts, friend interaction qualities in social media, the sizes and cohesiveness of communities, and how much sympathizers appreciate surprising news from influencers. ",
    "url": "https://arxiv.org/abs/2402.09639",
    "authors": [
      "So Sasaki",
      "Cédric Langbort"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2402.09642",
    "title": "Answer is All You Need: Instruction-following Text Embedding via  Answering the Question",
    "abstract": "This work aims to build a text embedder that can capture characteristics of texts specified by user instructions. Despite its tremendous potential to deploy user-oriented embeddings, none of previous approaches provides a concrete solution for it. This paper offers a new viewpoint, which treats the instruction as a question about the input text and encodes the expected answers to obtain the representation accordingly. Intuitively, texts with the same (implicit) semantics would share similar answers following the instruction, thus leading to more similar embeddings. Specifically, we propose InBedder that instantiates this embed-via-answering idea by only fine-tuning language models on abstractive question answering tasks. InBedder demonstrates significantly improved instruction-following capabilities according to our proposed instruction awareness tests and instruction robustness tests, when applied to both large language models (LLMs) (e.g., llama-2-7b) and smaller encoder-based LMs (e.g., roberta-large). Additionally, our qualitative analysis of clustering outcomes, achieved by applying different instructions to the same corpus, demonstrates a high degree of interpretability. ",
    "url": "https://arxiv.org/abs/2402.09642",
    "authors": [
      "Letian Peng",
      "Yuwei Zhang",
      "Zilong Wang",
      "Jayanth Srinivasa",
      "Gaowen Liu",
      "Zihan Wang",
      "Jingbo Shang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.09650",
    "title": "Foul prediction with estimated poses from soccer broadcast video",
    "abstract": "Recent advances in computer vision have made significant progress in tracking and pose estimation of sports players. However, there have been fewer studies on behavior prediction with pose estimation in sports, in particular, the prediction of soccer fouls is challenging because of the smaller image size of each player and of difficulty in the usage of e.g., the ball and pose information. In our research, we introduce an innovative deep learning approach for anticipating soccer fouls. This method integrates video data, bounding box positions, image details, and pose information by curating a novel soccer foul dataset. Our model utilizes a combination of convolutional and recurrent neural networks (CNNs and RNNs) to effectively merge information from these four modalities. The experimental results show that our full model outperformed the ablated models, and all of the RNN modules, bounding box position and image, and estimated pose were useful for the foul prediction. Our findings have important implications for a deeper understanding of foul play in soccer and provide a valuable reference for future research and practice in this area. ",
    "url": "https://arxiv.org/abs/2402.09650",
    "authors": [
      "Jiale Fang",
      "Calvin Yeung",
      "Keisuke Fujii"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09657",
    "title": "Digital versus Analog Transmissions for Federated Learning over Wireless  Networks",
    "abstract": "In this paper, we quantitatively compare these two effective communication schemes, i.e., digital and analog ones, for wireless federated learning (FL) over resource-constrained networks, highlighting their essential differences as well as their respective application scenarios. We first examine both digital and analog transmission methods, together with a unified and fair comparison scheme under practical constraints. A universal convergence analysis under various imperfections is established for FL performance evaluation in wireless networks. These analytical results reveal that the fundamental difference between the two paradigms lies in whether communication and computation are jointly designed or not. The digital schemes decouple the communication design from specific FL tasks, making it difficult to support simultaneous uplink transmission of massive devices with limited bandwidth. In contrast, the analog communication allows over-the-air computation (AirComp), thus achieving efficient spectrum utilization. However, computation-oriented analog transmission reduces power efficiency, and its performance is sensitive to computational errors. Finally, numerical simulations are conducted to verify these theoretical observations. ",
    "url": "https://arxiv.org/abs/2402.09657",
    "authors": [
      "Jiacheng Yao",
      "Wei Xu",
      "Zhaohui Yang",
      "Xiaohu You",
      "Mehdi Bennis",
      "H. Vincent Poor"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2402.09664",
    "title": "CodeMind: A Framework to Challenge Large Language Models for Code  Reasoning",
    "abstract": "Solely relying on test passing to evaluate Large Language Models (LLMs) for code synthesis may result in unfair assessment or promoting models with data leakage. As an alternative, we introduce CodeMind, a framework designed to gauge the code reasoning abilities of LLMs. CodeMind currently supports three code reasoning tasks: Independent Execution Reasoning (IER), Dependent Execution Reasoning (DER), and Specification Reasoning (SR). The first two evaluate models to predict the execution output of an arbitrary code or code the model could correctly synthesize. The third one evaluates the extent to which LLMs implement the specified expected behavior. Our extensive evaluation of nine LLMs across five benchmarks in two different programming languages using CodeMind shows that LLMs fairly understand control flow constructs and, in general, are capable of reasoning how inputs evolve to output, specifically for simple programs and the ones they can correctly synthesize. However, their performance drops for code with higher complexity, non-trivial logical and arithmetic operators, non-primitive types, and API calls. Furthermore, we observe that, while correlated, specification reasoning (essential for code synthesis) does not imply execution reasoning (essential for broader programming tasks such as testing and debugging): ranking LLMs based on test passing can be different compared to code reasoning. ",
    "url": "https://arxiv.org/abs/2402.09664",
    "authors": [
      "Changshu Liu",
      "Shizhuo Dylan Zhang",
      "Reyhaneh Jabbarvand"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2402.09666",
    "title": "EntailE: Introducing Textual Entailment in Commonsense Knowledge Graph  Completion",
    "abstract": "Commonsense knowledge graph completion is a new challenge for commonsense knowledge graph construction and application. In contrast to factual knowledge graphs such as Freebase and YAGO, commonsense knowledge graphs (CSKGs; e.g., ConceptNet) utilize free-form text to represent named entities, short phrases, and events as their nodes. Such a loose structure results in large and sparse CSKGs, which makes the semantic understanding of these nodes more critical for learning rich commonsense knowledge graph embedding. While current methods leverage semantic similarities to increase the graph density, the semantic plausibility of the nodes and their relations are under-explored. Previous works adopt conceptual abstraction to improve the consistency of modeling (event) plausibility, but they are not scalable enough and still suffer from data sparsity. In this paper, we propose to adopt textual entailment to find implicit entailment relations between CSKG nodes, to effectively densify the subgraph connecting nodes within the same conceptual class, which indicates a similar level of plausibility. Each node in CSKG finds its top entailed nodes using a finetuned transformer over natural language inference (NLI) tasks, which sufficiently capture textual entailment signals. The entailment relation between these nodes are further utilized to: 1) build new connections between source triplets and entailed nodes to densify the sparse CSKGs; 2) enrich the generalization ability of node representations by comparing the node embeddings with a contrastive loss. Experiments on two standard CSKGs demonstrate that our proposed framework EntailE can improve the performance of CSKG completion tasks under both transductive and inductive settings. ",
    "url": "https://arxiv.org/abs/2402.09666",
    "authors": [
      "Ying Su",
      "Tianqing Fang",
      "Huiru Xiao",
      "Weiqi Wang",
      "Yangqiu Song",
      "Tong Zhang",
      "Lei Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.09674",
    "title": "PAL: Proxy-Guided Black-Box Attack on Large Language Models",
    "abstract": "Large Language Models (LLMs) have surged in popularity in recent months, but they have demonstrated concerning capabilities to generate harmful content when manipulated. While techniques like safety fine-tuning aim to minimize harmful use, recent works have shown that LLMs remain vulnerable to attacks that elicit toxic responses. In this work, we introduce the Proxy-Guided Attack on LLMs (PAL), the first optimization-based attack on LLMs in a black-box query-only setting. In particular, it relies on a surrogate model to guide the optimization and a sophisticated loss designed for real-world LLM APIs. Our attack achieves 84% attack success rate (ASR) on GPT-3.5-Turbo and 48% on Llama-2-7B, compared to 4% for the current state of the art. We also propose GCG++, an improvement to the GCG attack that reaches 94% ASR on white-box Llama-2-7B, and the Random-Search Attack on LLMs (RAL), a strong but simple baseline for query-based attacks. We believe the techniques proposed in this work will enable more comprehensive safety testing of LLMs and, in the long term, the development of better security guardrails. The code can be found at https://github.com/chawins/pal. ",
    "url": "https://arxiv.org/abs/2402.09674",
    "authors": [
      "Chawin Sitawarin",
      "Norman Mu",
      "David Wagner",
      "Alexandre Araujo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09676",
    "title": "HyperMagNet: A Magnetic Laplacian based Hypergraph Neural Network",
    "abstract": "In data science, hypergraphs are natural models for data exhibiting multi-way relations, whereas graphs only capture pairwise. Nonetheless, many proposed hypergraph neural networks effectively reduce hypergraphs to undirected graphs via symmetrized matrix representations, potentially losing important information. We propose an alternative approach to hypergraph neural networks in which the hypergraph is represented as a non-reversible Markov chain. We use this Markov chain to construct a complex Hermitian Laplacian matrix - the magnetic Laplacian - which serves as the input to our proposed hypergraph neural network. We study HyperMagNet for the task of node classification, and demonstrate its effectiveness over graph-reduction based hypergraph neural networks. ",
    "url": "https://arxiv.org/abs/2402.09676",
    "authors": [
      "Tatyana Benko",
      "Martin Buck",
      "Ilya Amburg",
      "Stephen J. Young",
      "Sinan G. Aksoy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09687",
    "title": "Robust Learning-Augmented Dictionaries",
    "abstract": "We present the first learning-augmented data structure for implementing dictionaries with optimal consistency and robustness. Our data structure, named RobustSL, is a skip list augmented by predictions of access frequencies of elements in a data sequence. With proper predictions, RobustSL has optimal consistency (achieves static optimality). At the same time, it maintains a logarithmic running time for each operation, ensuring optimal robustness, even if predictions are generated adversarially. Therefore, RobustSL has all the advantages of the recent learning-augmented data structures of Lin, Luo, and Woodruff (ICML 2022) and Cao et al. (arXiv 2023), while providing robustness guarantees that are absent in the previous work. Numerical experiments show that RobustSL outperforms alternative data structures using both synthetic and real datasets. ",
    "url": "https://arxiv.org/abs/2402.09687",
    "authors": [
      "Ali Zeynali",
      "Shahin Kamali",
      "Mohammad Hajiesmaili"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09695",
    "title": "Reward Poisoning Attack Against Offline Reinforcement Learning",
    "abstract": "We study the problem of reward poisoning attacks against general offline reinforcement learning with deep neural networks for function approximation. We consider a black-box threat model where the attacker is completely oblivious to the learning algorithm and its budget is limited by constraining both the amount of corruption at each data point, and the total perturbation. We propose an attack strategy called `policy contrast attack'. The high-level idea is to make some low-performing policies appear as high-performing while making high-performing policies appear as low-performing. To the best of our knowledge, we propose the first black-box reward poisoning attack in the general offline RL setting. We provide theoretical insights on the attack design and empirically show that our attack is efficient against current state-of-the-art offline RL algorithms in different kinds of learning datasets. ",
    "url": "https://arxiv.org/abs/2402.09695",
    "authors": [
      "Yinglun Xu",
      "Rohan Gumaste",
      "Gagandeep Singh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.09701",
    "title": "HOACS: Homomorphic Obfuscation Assisted Concealing of Secrets to Thwart  Trojan Attacks in COTS Processor",
    "abstract": "Commercial-off-the-shelf (COTS) components are often preferred over custom Integrated Circuits (ICs) to achieve reduced system development time and cost, easy adoption of new technologies, and replaceability. Unfortunately, the integration of COTS components introduces serious security concerns. None of the entities in the COTS IC supply chain are trusted from a consumer's perspective, leading to a ''zero trust'' threat model. Any of these entities could introduce hidden malicious circuits or hardware Trojans within the component, allowing an attacker in the field to extract secret information (e.g., cryptographic keys) or cause a functional failure. Existing solutions to counter hardware Trojans are inapplicable in such a zero-trust scenario as they assume either the design house or the foundry to be trusted and consider the design to be available for either analysis or modification. In this work, we have proposed a software-oriented countermeasure to ensure the confidentiality of secret assets against hardware Trojans that can be seamlessly integrated in existing COTS microprocessors. The proposed solution does not require any supply chain entity to be trusted and does not require analysis or modification of the IC design. To protect secret assets in an untrusted microprocessor, the proposed method leverages the concept of residue number coding (RNC) to transform the software functions operating on the asset to be fully homomorphic. We have implemented the proposed solution to protect the secret key within the Advanced Encryption Standard (AES) program and presented a detailed security analysis. We also have developed a plugin for the LLVM compiler toolchain that automatically integrates the solution in AES. Finally, we compare the execution time overhead of the operations in the RNC-based technique with comparable homomorphic solutions and demonstrate significant improvement. ",
    "url": "https://arxiv.org/abs/2402.09701",
    "authors": [
      "Tanvir Hossain",
      "Matthew Showers",
      "Mahmudul Hasan",
      "Tamzidul Hoque"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.09707",
    "title": "On the adversarial robustness of Locality-Sensitive Hashing in Hamming  space",
    "abstract": "Locality-sensitive hashing~[Indyk,Motwani'98] is a classical data structure for approximate nearest neighbor search. It allows, after a close to linear time preprocessing of the input dataset, to find an approximately nearest neighbor of any fixed query in sublinear time in the dataset size. The resulting data structure is randomized and succeeds with high probability for every fixed query. In many modern applications of nearest neighbor search the queries are chosen adaptively. In this paper, we study the robustness of the locality-sensitive hashing to adaptive queries in Hamming space. We present a simple adversary that can, under mild assumptions on the initial point set, provably find a query to the approximate near neighbor search data structure that the data structure fails on. Crucially, our adaptive algorithm finds the hard query exponentially faster than random sampling. ",
    "url": "https://arxiv.org/abs/2402.09707",
    "authors": [
      "Michael Kapralov",
      "Mikhail Makarov",
      "Christian Sohler"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2402.09710",
    "title": "Preserving Data Privacy for ML-driven Applications in Open Radio Access  Networks",
    "abstract": "Deep learning offers a promising solution to improve spectrum access techniques by utilizing data-driven approaches to manage and share limited spectrum resources for emerging applications. For several of these applications, the sensitive wireless data (such as spectrograms) are stored in a shared database or multistakeholder cloud environment and are therefore prone to privacy leaks. This paper aims to address such privacy concerns by examining the representative case study of shared database scenarios in 5G Open Radio Access Network (O-RAN) networks where we have a shared database within the near-real-time (near-RT) RAN intelligent controller. We focus on securing the data that can be used by machine learning (ML) models for spectrum sharing and interference mitigation applications without compromising the model and network performances. The underlying idea is to leverage a (i) Shuffling-based learnable encryption technique to encrypt the data, following which, (ii) employ a custom Vision transformer (ViT) as the trained ML model that is capable of performing accurate inferences on such encrypted data. The paper offers a thorough analysis and comparisons with analogous convolutional neural networks (CNN) as well as deeper architectures (such as ResNet-50) as baselines. Our experiments showcase that the proposed approach significantly outperforms the baseline CNN with an improvement of 24.5% and 23.9% for the percent accuracy and F1-Score respectively when operated on encrypted data. Though deeper ResNet-50 architecture is obtained as a slightly more accurate model, with an increase of 4.4%, the proposed approach boasts a reduction of parameters by 99.32%, and thus, offers a much-improved prediction time by nearly 60%. ",
    "url": "https://arxiv.org/abs/2402.09710",
    "authors": [
      "Pranshav Gajjar",
      "Azuka Chiejina",
      "Vijay K. Shah"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09711",
    "title": "Node Duplication Improves Cold-start Link Prediction",
    "abstract": "Graph Neural Networks (GNNs) are prominent in graph machine learning and have shown state-of-the-art performance in Link Prediction (LP) tasks. Nonetheless, recent studies show that GNNs struggle to produce good results on low-degree nodes despite their overall strong performance. In practical applications of LP, like recommendation systems, improving performance on low-degree nodes is critical, as it amounts to tackling the cold-start problem of improving the experiences of users with few observed interactions. In this paper, we investigate improving GNNs' LP performance on low-degree nodes while preserving their performance on high-degree nodes and propose a simple yet surprisingly effective augmentation technique called NodeDup. Specifically, NodeDup duplicates low-degree nodes and creates links between nodes and their own duplicates before following the standard supervised LP training scheme. By leveraging a ''multi-view'' perspective for low-degree nodes, NodeDup shows significant LP performance improvements on low-degree nodes without compromising any performance on high-degree nodes. Additionally, as a plug-and-play augmentation module, NodeDup can be easily applied to existing GNNs with very light computational cost. Extensive experiments show that NodeDup achieves 38.49%, 13.34%, and 6.76% improvements on isolated, low-degree, and warm nodes, respectively, on average across all datasets compared to GNNs and state-of-the-art cold-start methods. ",
    "url": "https://arxiv.org/abs/2402.09711",
    "authors": [
      "Zhichun Guo",
      "Tong Zhao",
      "Yozen Liu",
      "Kaiwen Dong",
      "William Shiao",
      "Neil Shah",
      "Nitesh V. Chawla"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2402.09715",
    "title": "DPBalance: Efficient and Fair Privacy Budget Scheduling for Federated  Learning as a Service",
    "abstract": "Federated learning (FL) has emerged as a prevalent distributed machine learning scheme that enables collaborative model training without aggregating raw data. Cloud service providers further embrace Federated Learning as a Service (FLaaS), allowing data analysts to execute their FL training pipelines over differentially-protected data. Due to the intrinsic properties of differential privacy, the enforced privacy level on data blocks can be viewed as a privacy budget that requires careful scheduling to cater to diverse training pipelines. Existing privacy budget scheduling studies prioritize either efficiency or fairness individually. In this paper, we propose DPBalance, a novel privacy budget scheduling mechanism that jointly optimizes both efficiency and fairness. We first develop a comprehensive utility function incorporating data analyst-level dominant shares and FL-specific performance metrics. A sequential allocation mechanism is then designed using the Lagrange multiplier method and effective greedy heuristics. We theoretically prove that DPBalance satisfies Pareto Efficiency, Sharing Incentive, Envy-Freeness, and Weak Strategy Proofness. We also theoretically prove the existence of a fairness-efficiency tradeoff in privacy budgeting. Extensive experiments demonstrate that DPBalance outperforms state-of-the-art solutions, achieving an average efficiency improvement of $1.44\\times \\sim 3.49 \\times$, and an average fairness improvement of $1.37\\times \\sim 24.32 \\times$. ",
    "url": "https://arxiv.org/abs/2402.09715",
    "authors": [
      "Yu Liu",
      "Zibo Wang",
      "Yifei Zhu",
      "Chen Chen"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09716",
    "title": "User Privacy Harms and Risks in Conversational AI: A Proposed Framework",
    "abstract": "This study presents a unique framework that applies and extends Solove (2006)'s taxonomy to address privacy concerns in interactions with text-based AI chatbots. As chatbot prevalence grows, concerns about user privacy have heightened. While existing literature highlights design elements compromising privacy, a comprehensive framework is lacking. Through semi-structured interviews with 13 participants interacting with two AI chatbots, this study identifies 9 privacy harms and 9 privacy risks in text-based interactions. Using a grounded theory approach for interview and chatlog analysis, the framework examines privacy implications at various interaction stages. The aim is to offer developers, policymakers, and researchers a tool for responsible and secure implementation of conversational AI, filling the existing gap in addressing privacy issues associated with text-based AI chatbots. ",
    "url": "https://arxiv.org/abs/2402.09716",
    "authors": [
      "Ece Gumusel",
      "Kyrie Zhixuan Zhou",
      "Madelyn Rose Sanfilippo"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2402.09722",
    "title": "Reg-NF: Efficient Registration of Implicit Surfaces within Neural Fields",
    "abstract": "Neural fields, coordinate-based neural networks, have recently gained popularity for implicitly representing a scene. In contrast to classical methods that are based on explicit representations such as point clouds, neural fields provide a continuous scene representation able to represent 3D geometry and appearance in a way which is compact and ideal for robotics applications. However, limited prior methods have investigated registering multiple neural fields by directly utilising these continuous implicit representations. In this paper, we present Reg-NF, a neural fields-based registration that optimises for the relative 6-DoF transformation between two arbitrary neural fields, even if those two fields have different scale factors. Key components of Reg-NF include a bidirectional registration loss, multi-view surface sampling, and utilisation of volumetric signed distance functions (SDFs). We showcase our approach on a new neural field dataset for evaluating registration problems. We provide an exhaustive set of experiments and ablation studies to identify the performance of our approach, while also discussing limitations to provide future direction to the research community on open challenges in utilizing neural fields in unconstrained environments. ",
    "url": "https://arxiv.org/abs/2402.09722",
    "authors": [
      "Stephen Hausler",
      "David Hall",
      "Sutharsan Mahendren",
      "Peyman Moghadam"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.09736",
    "title": "Federated Analytics-Empowered Frequent Pattern Mining for Decentralized  Web 3.0 Applications",
    "abstract": "The emerging Web 3.0 paradigm aims to decentralize existing web services, enabling desirable properties such as transparency, incentives, and privacy preservation. However, current Web 3.0 applications supported by blockchain infrastructure still cannot support complex data analytics tasks in a scalable and privacy-preserving way. This paper introduces the emerging federated analytics (FA) paradigm into the realm of Web 3.0 services, enabling data to stay local while still contributing to complex web analytics tasks in a privacy-preserving way. We propose FedWeb, a tailored FA design for important frequent pattern mining tasks in Web 3.0. FedWeb remarkably reduces the number of required participating data owners to support privacy-preserving Web 3.0 data analytics based on a novel distributed differential privacy technique. The correctness of mining results is guaranteed by a theoretically rigid candidate filtering scheme based on Hoeffding's inequality and Chebychev's inequality. Two response budget saving solutions are proposed to further reduce participating data owners. Experiments on three representative Web 3.0 scenarios show that FedWeb can improve data utility by ~25.3% and reduce the participating data owners by ~98.4%. ",
    "url": "https://arxiv.org/abs/2402.09736",
    "authors": [
      "Zibo Wang",
      "Yifei Zhu",
      "Dan Wang",
      "Zhu Han"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.09738",
    "title": "Align before Attend: Aligning Visual and Textual Features for Multimodal  Hateful Content Detection",
    "abstract": "Multimodal hateful content detection is a challenging task that requires complex reasoning across visual and textual modalities. Therefore, creating a meaningful multimodal representation that effectively captures the interplay between visual and textual features through intermediate fusion is critical. Conventional fusion techniques are unable to attend to the modality-specific features effectively. Moreover, most studies exclusively concentrated on English and overlooked other low-resource languages. This paper proposes a context-aware attention framework for multimodal hateful content detection and assesses it for both English and non-English languages. The proposed approach incorporates an attention layer to meaningfully align the visual and textual features. This alignment enables selective focus on modality-specific features before fusing them. We evaluate the proposed approach on two benchmark hateful meme datasets, viz. MUTE (Bengali code-mixed) and MultiOFF (English). Evaluation results demonstrate our proposed approach's effectiveness with F1-scores of $69.7$% and $70.3$% for the MUTE and MultiOFF datasets. The scores show approximately $2.5$% and $3.2$% performance improvement over the state-of-the-art systems on these datasets. Our implementation is available at https://github.com/eftekhar-hossain/Bengali-Hateful-Memes. ",
    "url": "https://arxiv.org/abs/2402.09738",
    "authors": [
      "Eftekhar Hossain",
      "Omar Sharif",
      "Mohammed Moshiul Hoque",
      "Sarah M. Preum"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.09743",
    "title": "Quickest Detection of False Data Injection Attack in Distributed Process  Tracking",
    "abstract": "This paper addresses the problem of detecting false data injection (FDI) attacks in a distributed network without a fusion center, represented by a connected graph among multiple agent nodes. Each agent node is equipped with a sensor, and uses a Kalman consensus information filter (KCIF) to track a discrete time global process with linear dynamics and additive Gaussian noise. The state estimate of the global process at any sensor is computed from the local observation history and the information received by that agent node from its neighbors. At an unknown time, an attacker starts altering the local observation of one agent node. In the Bayesian setting where there is a known prior distribution of the attack beginning instant, we formulate a Bayesian quickest change detection (QCD) problem for FDI detection in order to minimize the mean detection delay subject to a false alarm probability constraint. While it is well-known that the optimal Bayesian QCD rule involves checking the Shriyaev's statistic against a threshold, we demonstrate how to compute the Shriyaev's statistic at each node in a recursive fashion given our non-i.i.d. observations. Next, we consider non-Bayesian QCD where the attack begins at an arbitrary and unknown time, and the detector seeks to minimize the worst case detection delay subject to a constraint on the mean time to false alarm and probability of misidentification. We use the multiple hypothesis sequential probability ratio test for attack detection and identification at each sensor. For unknown attack strategy, we use the window-limited generalized likelihood ratio (WL-GLR) algorithm to solve the QCD problem. Numerical results demonstrate the performances and trade-offs of the proposed algorithms. ",
    "url": "https://arxiv.org/abs/2402.09743",
    "authors": [
      "Saqib Abbas Baba",
      "Arpan Chattopadhyay"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.09756",
    "title": "Mixture of Experts for Network Optimization: A Large Language  Model-enabled Approach",
    "abstract": "Optimizing various wireless user tasks poses a significant challenge for networking systems because of the expanding range of user requirements. Despite advancements in Deep Reinforcement Learning (DRL), the need for customized optimization tasks for individual users complicates developing and applying numerous DRL models, leading to substantial computation resource and energy consumption and can lead to inconsistent outcomes. To address this issue, we propose a novel approach utilizing a Mixture of Experts (MoE) framework, augmented with Large Language Models (LLMs), to analyze user objectives and constraints effectively, select specialized DRL experts, and weigh each decision from the participating experts. Specifically, we develop a gate network to oversee the expert models, allowing a collective of experts to tackle a wide array of new tasks. Furthermore, we innovatively substitute the traditional gate network with an LLM, leveraging its advanced reasoning capabilities to manage expert model selection for joint decisions. Our proposed method reduces the need to train new DRL models for each unique optimization problem, decreasing energy consumption and AI model implementation costs. The LLM-enabled MoE approach is validated through a general maze navigation task and a specific network service provider utility maximization task, demonstrating its effectiveness and practical applicability in optimizing complex networking systems. ",
    "url": "https://arxiv.org/abs/2402.09756",
    "authors": [
      "Hongyang Du",
      "Guangyuan Liu",
      "Yijing Lin",
      "Dusit Niyato",
      "Jiawen Kang",
      "Zehui Xiong",
      "Dong In Kim"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.09769",
    "title": "Representation Learning Using a Single Forward Pass",
    "abstract": "We propose a neuroscience-inspired Solo Pass Embedded Learning Algorithm (SPELA). SPELA is a prime candidate for training and inference applications in Edge AI devices. At the same time, SPELA can optimally cater to the need for a framework to study perceptual representation learning and formation. SPELA has distinctive features such as neural priors (in the form of embedded vectors), no weight transport, no update locking of weights, complete local Hebbian learning, single forward pass with no storage of activations, and single weight update per sample. Juxtaposed with traditional approaches, SPELA operates without the need for backpropagation. We show that our algorithm can perform nonlinear classification on a noisy boolean operation dataset. Additionally, we exhibit high performance using SPELA across MNIST, KMNIST, and Fashion MNIST. Lastly, we show the few-shot and 1-epoch learning capabilities of SPELA on MNIST, KMNIST, and Fashion MNIST, where it consistently outperforms backpropagation. ",
    "url": "https://arxiv.org/abs/2402.09769",
    "authors": [
      "Aditya Somasundaram",
      "Pushkal Mishra",
      "Ayon Borthakur"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.09786",
    "title": "Examining Pathological Bias in a Generative Adversarial Network  Discriminator: A Case Study on a StyleGAN3 Model",
    "abstract": "Generative adversarial networks generate photorealistic faces that are often indistinguishable by humans from real faces. We find that the discriminator in the pre-trained StyleGAN3 model, a popular GAN network, systematically stratifies scores by both image- and face-level qualities and that this disproportionately affects images across gender, race, and other categories. We examine the discriminator's bias for color and luminance across axes perceived race and gender; we then examine axes common in research on stereotyping in social psychology. ",
    "url": "https://arxiv.org/abs/2402.09786",
    "authors": [
      "Alvin Grissom II",
      "Ryan F. Lei",
      "Jeova Farias Sales Rocha Neto",
      "Bailey Lin",
      "Ryan Trotter"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09792",
    "title": "System-level Impact of Non-Ideal Program-Time of Charge Trap Flash (CTF)  on Deep Neural Network",
    "abstract": "Learning of deep neural networks (DNN) using Resistive Processing Unit (RPU) architecture is energy-efficient as it utilizes dedicated neuromorphic hardware and stochastic computation of weight updates for in-memory computing. Charge Trap Flash (CTF) devices can implement RPU-based weight updates in DNNs. However, prior work has shown that the weight updates (V_T) in CTF-based RPU are impacted by the non-ideal program time of CTF. The non-ideal program time is affected by two factors of CTF. Firstly, the effects of the number of input pulses (N) or pulse width (pw), and secondly, the gap between successive update pulses (t_gap) used for the stochastic computation of weight updates. Therefore, the impact of this non-ideal program time must be studied for neural network training simulations. In this study, Firstly, we propose a pulse-train design compensation technique to reduce the total error caused by non-ideal program time of CTF and stochastic variance of a network. Secondly, we simulate RPU-based DNN with non-ideal program time of CTF on MNIST and Fashion-MNIST datasets. We find that for larger N (~1000), learning performance approaches the ideal (software-level) training level and, therefore, is not much impacted by the choice of t_gap used to implement RPU-based weight updates. However, for lower N (<500), learning performance depends on T_gap of the pulses. Finally, we also performed an ablation study to isolate the causal factor of the improved learning performance. We conclude that the lower noise level in the weight updates is the most likely significant factor to improve the learning performance of DNN. Thus, our study attempts to compensate for the error caused by non-ideal program time and standardize the pulse length (N) and pulse gap (t_gap) specifications for CTF-based RPUs for accurate system-level on-chip training. ",
    "url": "https://arxiv.org/abs/2402.09792",
    "authors": [
      "S. Shrivastava",
      "A. Biswas",
      "S. Chakrabarty",
      "G. Dash",
      "V. Saraswat",
      "U. Ganguly"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Emerging Technologies (cs.ET)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2402.09797",
    "title": "A cross-talk robust multichannel VAD model for multiparty agent  interactions trained using synthetic re-recordings",
    "abstract": "In this work, we propose a novel cross-talk rejection framework for a multi-channel multi-talker setup for a live multiparty interactive show. Our far-field audio setup is required to be hands-free during live interaction and comprises four adjacent talkers with directional microphones in the same space. Such setups often introduce heavy cross-talk between channels, resulting in reduced automatic speech recognition (ASR) and natural language understanding (NLU) performance. To address this problem, we propose voice activity detection (VAD) model for all talkers using multichannel information, which is then used to filter audio for downstream tasks. We adopt a synthetic training data generation approach through playback and re-recording for such scenarios, simulating challenging speech overlap conditions. We train our models on this synthetic data and demonstrate that our approach outperforms single-channel VAD models and energy-based multi-channel VAD algorithm in various acoustic environments. In addition to VAD results, we also present multiparty ASR evaluation results to highlight the impact of using our VAD model for filtering audio in downstream tasks by significantly reducing the insertion error. ",
    "url": "https://arxiv.org/abs/2402.09797",
    "authors": [
      "Hyewon Han",
      "Naveen Kumar"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Human-Computer Interaction (cs.HC)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2402.09799",
    "title": "Co-Designing a wiki-based community knowledge management system for  personal science",
    "abstract": "Personal science is the practice of addressing personally relevant health questions through self-research. Implementing personal science can be challenging, due to the need to develop and adopt research protocols, tools, and methods. While online communities can provide valuable peer support, tools for systematically accessing community knowledge are lacking. The objective of this study is to apply a participatory design process involving a community of personal science practitioners to develop a peer-produced knowledge base that supports the needs of practitioners as consumers and contributors of knowledge. The process led to the development of the Personal Science Wiki, an open repository for documenting and accessing individual self-tracking projects while facilitating the establishment of consensus knowledge. After initial design iterations and a field testing phase, we performed a user study with 21 participants to test and improve the platform, and to explore suitable information architectures. The study deepened our understanding of barriers to scaling the personal science community, established an infrastructure for knowledge management actively used by the community, and provided lessons on challenges, information needs, representations, and architectures to support individuals with their personal health inquiries ",
    "url": "https://arxiv.org/abs/2402.09799",
    "authors": [
      "Katharina Kloppenborg",
      "Mad Price Ball",
      "Steven Jonas",
      "Gary Isaac Wolf",
      "Bastian Greshake Tzovaras"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2402.09811",
    "title": "TEXTRON: Weakly Supervised Multilingual Text Detection through Data  Programming",
    "abstract": "Several recent deep learning (DL) based techniques perform considerably well on image-based multilingual text detection. However, their performance relies heavily on the availability and quality of training data. There are numerous types of page-level document images consisting of information in several modalities, languages, fonts, and layouts. This makes text detection a challenging problem in the field of computer vision (CV), especially for low-resource or handwritten languages. Furthermore, there is a scarcity of word-level labeled data for text detection, especially for multilingual settings and Indian scripts that incorporate both printed and handwritten text. Conventionally, Indian script text detection requires training a DL model on plenty of labeled data, but to the best of our knowledge, no relevant datasets are available. Manual annotation of such data requires a lot of time, effort, and expertise. In order to solve this problem, we propose TEXTRON, a Data Programming-based approach, where users can plug various text detection methods into a weak supervision-based learning framework. One can view this approach to multilingual text detection as an ensemble of different CV-based techniques and DL approaches. TEXTRON can leverage the predictions of DL models pre-trained on a significant amount of language data in conjunction with CV-based methods to improve text detection in other languages. We demonstrate that TEXTRON can improve the detection performance for documents written in Indian languages, despite the absence of corresponding labeled data. Further, through extensive experimentation, we show improvement brought about by our approach over the current State-of-the-art (SOTA) models, especially for handwritten Devanagari text. Code and dataset has been made available at https://github.com/IITB-LEAP-OCR/TEXTRON ",
    "url": "https://arxiv.org/abs/2402.09811",
    "authors": [
      "Dhruv Kudale",
      "Badri Vishal Kasuba",
      "Venkatapathy Subramanian",
      "Parag Chaudhuri",
      "Ganesh Ramakrishnan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.09820",
    "title": "Enhancing Cybersecurity Resilience in Finance with Deep Learning for  Advanced Threat Detection",
    "abstract": "In the age of the Internet, people's lives are increasingly dependent on today's network technology. However, network technology is a double-edged sword, bringing convenience to people but also posing many security challenges. Maintaining network security and protecting the legitimate interests of users is at the heart of network construction. Threat detection is an important part of a complete and effective defense system. In the field of network information security, the technical update of network attack and network protection is spiraling. How to effectively detect unknown threats is one of the concerns of network protection. Currently, network threat detection is usually based on rules and traditional machine learning methods, which create artificial rules or extract common spatiotemporal features, which cannot be applied to large-scale data applications, and the emergence of unknown threats causes the detection accuracy of the original model to decline. With this in mind, this paper uses deep learning for advanced threat detection to improve cybersecurity resilienc e in the financial industry. Many network security researchers have shifted their focus to exceptio n-based intrusion detection techniques. The detection technology mainly uses statistical machine learning methods - collecting normal program and network behavior data, extracting multidimensional features, and training decision machine learning models on this basis (commonly used include naive Bayes, decision trees, support vector machines, random forests, etc.). In the detection phase, program code or network behavior that deviates from the normal value beyond the tolerance is considered malicious code or network attack behavior. ",
    "url": "https://arxiv.org/abs/2402.09820",
    "authors": [
      "Yulu Gong",
      "Mengran Zhu",
      "Shuning Huo",
      "Yafei Xiang",
      "Hanyi Yu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "General Finance (q-fin.GN)"
    ]
  },
  {
    "id": "arXiv:2402.09834",
    "title": "All in One and One for All: A Simple yet Effective Method towards  Cross-domain Graph Pretraining",
    "abstract": "Large Language Models (LLMs) have revolutionized the fields of computer vision (CV) and natural language processing (NLP). One of the most notable advancements of LLMs is that a single model is trained on vast and diverse datasets spanning multiple domains -- a paradigm we term `All in One'. This methodology empowers LLMs with super generalization capabilities, facilitating an encompassing comprehension of varied data distributions. Leveraging these capabilities, a single LLM demonstrates remarkable versatility across a variety of domains -- a paradigm we term `One for All'. However, applying this idea to the graph field remains a formidable challenge, with cross-domain pretraining often resulting in negative transfer. This issue is particularly important in few-shot learning scenarios, where the paucity of training data necessitates the incorporation of external knowledge sources. In response to this challenge, we propose a novel approach called Graph COordinators for PrEtraining (GCOPE), that harnesses the underlying commonalities across diverse graph datasets to enhance few-shot learning. Our novel methodology involves a unification framework that amalgamates disparate graph datasets during the pretraining phase to distill and transfer meaningful knowledge to target tasks. Extensive experiments across multiple graph datasets demonstrate the superior efficacy of our approach. By successfully leveraging the synergistic potential of multiple graph datasets for pretraining, our work stands as a pioneering contribution to the realm of graph foundational model. ",
    "url": "https://arxiv.org/abs/2402.09834",
    "authors": [
      "Haihong Zhao",
      "Aochuan Chen",
      "Xiangguo Sun",
      "Hong Cheng",
      "Jia Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09835",
    "title": "Parameterized Algorithms for Steiner Forest in Bounded Width Graphs",
    "abstract": "In this paper we reassess the parameterized complexity and approximability of the well-studied Steiner Forest problem in several graph classes of bounded width. The problem takes an edge-weighted graph and pairs of vertices as input, and the aim is to find a minimum cost subgraph in which each given vertex pair lies in the same connected component. It is known that this problem is APX-hard in general, and NP-hard on graphs of treewidth 3, treedepth 4, and feedback vertex set size 2. However, Bateni, Hajiaghayi and Marx [JACM, 2011] gave an approximation scheme with a runtime of $n^{O(\\frac{k^2}{\\varepsilon})}$ on graphs of treewidth $k$. Our main result is a much faster efficient parameterized approximation scheme (EPAS) with a runtime of $2^{O(\\frac{k^2}{\\varepsilon} \\log \\frac{k^2}{\\varepsilon})} \\cdot n^{O(1)}$. If $k$ instead is the vertex cover number of the input graph, we show how to compute the optimum solution in $2^{O(k \\log k)} \\cdot n^{O(1)}$ time, and we also prove that this runtime dependence on $k$ is asymptotically best possible, under ETH. Furthermore, if $k$ is the size of a feedback edge set, then we obtain a faster $2^{O(k)} \\cdot n^{O(1)}$ time algorithm, which again cannot be improved under ETH. ",
    "url": "https://arxiv.org/abs/2402.09835",
    "authors": [
      "Andreas Emil Feldmann",
      "Michael Lampis"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2402.09850",
    "title": "Application of a metric for complex polynomials to bounded modification  of planar Pythagorean-hodograph curves",
    "abstract": "By interpreting planar polynomial curves as complex-valued functions of a real parameter, an inner product, norm, metric function, and the notion of orthogonality may be defined for such curves. This approach is applied to the complex pre-image polynomials that generate planar Pythagorean-hodograph (PH) curves, to facilitate the implementation of bounded modifications of them that preserve their PH nature. The problems of bounded modifications under the constraint of fixed curve end points and end tangent directions, and of increasing the arc length of a PH curve by a prescribed amount, are also addressed. ",
    "url": "https://arxiv.org/abs/2402.09850",
    "authors": [
      "Rida T. Farouki",
      "Marjeta Knez",
      "Vito Vitrih",
      "Emil Žagar"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2402.09872",
    "title": "Social Reward: Evaluating and Enhancing Generative AI through  Million-User Feedback from an Online Creative Community",
    "abstract": "Social reward as a form of community recognition provides a strong source of motivation for users of online platforms to engage and contribute with content. The recent progress of text-conditioned image synthesis has ushered in a collaborative era where AI empowers users to craft original visual artworks seeking community validation. Nevertheless, assessing these models in the context of collective community preference introduces distinct challenges. Existing evaluation methods predominantly center on limited size user studies guided by image quality and prompt alignment. This work pioneers a paradigm shift, unveiling Social Reward - an innovative reward modeling framework that leverages implicit feedback from social network users engaged in creative editing of generated images. We embark on an extensive journey of dataset curation and refinement, drawing from Picsart: an online visual creation and editing platform, yielding a first million-user-scale dataset of implicit human preferences for user-generated visual art named Picsart Image-Social. Our analysis exposes the shortcomings of current metrics in modeling community creative preference of text-to-image models' outputs, compelling us to introduce a novel predictive model explicitly tailored to address these limitations. Rigorous quantitative experiments and user study show that our Social Reward model aligns better with social popularity than existing metrics. Furthermore, we utilize Social Reward to fine-tune text-to-image models, yielding images that are more favored by not only Social Reward, but also other established metrics. These findings highlight the relevance and effectiveness of Social Reward in assessing community appreciation for AI-generated artworks, establishing a closer alignment with users' creative goals: creating popular visual art. Codes can be accessed at https://github.com/Picsart-AI-Research/Social-Reward ",
    "url": "https://arxiv.org/abs/2402.09872",
    "authors": [
      "Arman Isajanyan",
      "Artur Shatveryan",
      "David Kocharyan",
      "Zhangyang Wang",
      "Humphrey Shi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.09874",
    "title": "Camouflage is all you need: Evaluating and Enhancing Language Model  Robustness Against Camouflage Adversarial Attacks",
    "abstract": "Adversarial attacks represent a substantial challenge in Natural Language Processing (NLP). This study undertakes a systematic exploration of this challenge in two distinct phases: vulnerability evaluation and resilience enhancement of Transformer-based models under adversarial attacks. In the evaluation phase, we assess the susceptibility of three Transformer configurations, encoder-decoder, encoder-only, and decoder-only setups, to adversarial attacks of escalating complexity across datasets containing offensive language and misinformation. Encoder-only models manifest a 14% and 21% performance drop in offensive language detection and misinformation detection tasks, respectively. Decoder-only models register a 16% decrease in both tasks, while encoder-decoder models exhibit a maximum performance drop of 14% and 26% in the respective tasks. The resilience-enhancement phase employs adversarial training, integrating pre-camouflaged and dynamically altered data. This approach effectively reduces the performance drop in encoder-only models to an average of 5% in offensive language detection and 2% in misinformation detection tasks. Decoder-only models, occasionally exceeding original performance, limit the performance drop to 7% and 2% in the respective tasks. Although not surpassing the original performance, Encoder-decoder models can reduce the drop to an average of 6% and 2% respectively. Results suggest a trade-off between performance and robustness, with some models maintaining similar performance while gaining robustness. Our study and adversarial training techniques have been incorporated into an open-source tool for generating camouflaged datasets. However, methodology effectiveness depends on the specific camouflage technique and data encountered, emphasizing the need for continued exploration. ",
    "url": "https://arxiv.org/abs/2402.09874",
    "authors": [
      "Álvaro Huertas-García",
      "Alejandro Martín",
      "Javier Huertas-Tato",
      "David Camacho"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.09886",
    "title": "Self-Supervised Learning of Visual Robot Localization Using LED State  Prediction as a Pretext Task",
    "abstract": "We propose a novel self-supervised approach for learning to visually localize robots equipped with controllable LEDs. We rely on a few training samples labeled with position ground truth and many training samples in which only the LED state is known, whose collection is cheap. We show that using LED state prediction as a pretext task significantly helps to learn the visual localization end task. The resulting model does not require knowledge of LED states during inference. We instantiate the approach to visual relative localization of nano-quadrotors: experimental results show that using our pretext task significantly improves localization accuracy (from 68.3% to 76.2%) and outperforms alternative strategies, such as a supervised baseline, model pre-training, and an autoencoding pretext task. We deploy our model aboard a 27-g Crazyflie nano-drone, running at 21 fps, in a position-tracking task of a peer nano-drone. Our approach, relying on position labels for only 300 images, yields a mean tracking error of 4.2 cm versus 11.9 cm of a supervised baseline model trained without our pretext task. Videos and code of the proposed approach are available at https://github.com/idsia-robotics/leds-as-pretext ",
    "url": "https://arxiv.org/abs/2402.09886",
    "authors": [
      "Mirko Nava",
      "Nicholas Carlotti",
      "Luca Crupi",
      "Daniele Palossi",
      "Alessandro Giusti"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2402.09891",
    "title": "Predictors from causal features do not generalize better to new domains",
    "abstract": "We study how well machine learning models trained on causal features generalize across domains. We consider 16 prediction tasks on tabular datasets covering applications in health, employment, education, social benefits, and politics. Each dataset comes with multiple domains, allowing us to test how well a model trained in one domain performs in another. For each prediction task, we select features that have a causal influence on the target of prediction. Our goal is to test the hypothesis that models trained on causal features generalize better across domains. Without exception, we find that predictors using all available features, regardless of causality, have better in-domain and out-of-domain accuracy than predictors using causal features. Moreover, even the absolute drop in accuracy from one domain to the other is no better for causal predictors than for models that use all features. If the goal is to generalize to new domains, practitioners might as well train the best possible model on all available features. ",
    "url": "https://arxiv.org/abs/2402.09891",
    "authors": [
      "Vivian Y. Nastl",
      "Moritz Hardt"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.09911",
    "title": "Enhancing Large Language Models with Pseudo- and Multisource- Knowledge  Graphs for Open-ended Question Answering",
    "abstract": "Mitigating the hallucinations of Large Language Models (LLMs) and enhancing them is a crucial task. Although some existing methods employ model self-enhancement techniques, they fall short of effectively addressing unknown factual hallucinations. Using Knowledge Graph (KG) enhancement approaches fails to address the generalization across different KG sources and the enhancement of open-ended answer questions simultaneously. To tackle these limitations, there is a framework that combines Pseudo-Graph Generation and Atomic Knowledge Verification proposed. The enhancement of LLM using KG in an open-ended question-answering setting is implemented by leveraging the Pseudo-Graph Generation. Atomic Knowledge Verification utilizes atomic-level knowledge querying and verification to achieve generalizability under different KG sources. Compared to the baseline, this approach yields a minimum improvement of 11.5 in the ROUGE-L score for open-ended questions. For precise questions, we observe a minimum accuracy improvement of 7.5. Moreover, there is also demonstration that this framework exhibits generalizability across different KG sources. In summary, our results pave the way for enhancing LLMs by incorporating Pseudo- and Multisource-KGs, particularly in the context of open-ended questions. ",
    "url": "https://arxiv.org/abs/2402.09911",
    "authors": [
      "Jiaxiang Liu",
      "Tong Zhou",
      "Yubo Chen",
      "Kang Liu",
      "Jun Zhao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.09919",
    "title": "Road Graph Generator: Mapping roads at construction sites from GPS data",
    "abstract": "We present a method for road inference from GPS trajectories to map construction sites. This task introduces a unique challenge due to the erratic and non-standard movement patterns of construction machinery, which diverge significantly from typical vehicular traffic on established roads. Our method first identifies intersections in the road network that serve as critical decision points, and later connects them with edges, producing a graph, which subsequently can be used for planning and task-allocation. We demonstrate the effectiveness of our approach by mapping roads at a real-life construction site in Norway. ",
    "url": "https://arxiv.org/abs/2402.09919",
    "authors": [
      "Katarzyna Michałowska",
      "Helga Margrete Bodahl Holmestad",
      "Signe Riemer-Sørensen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.09934",
    "title": "Paying Attention to Deflections: Mining Pragmatic Nuances for  Whataboutism Detection in Online Discourse",
    "abstract": "Whataboutism, a potent tool for disrupting narratives and sowing distrust, remains under-explored in quantitative NLP research. Moreover, past work has not distinguished its use as a strategy for misinformation and propaganda from its use as a tool for pragmatic and semantic framing. We introduce new datasets from Twitter and YouTube, revealing overlaps as well as distinctions between whataboutism, propaganda, and the tu quoque fallacy. Furthermore, drawing on recent work in linguistic semantics, we differentiate the `what about' lexical construct from whataboutism. Our experiments bring to light unique challenges in its accurate detection, prompting the introduction of a novel method using attention weights for negative sample mining. We report significant improvements of 4% and 10% over previous state-of-the-art methods in our Twitter and YouTube collections, respectively. ",
    "url": "https://arxiv.org/abs/2402.09934",
    "authors": [
      "Khiem Phi",
      "Noushin Salek Faramarzi",
      "Chenlu Wang",
      "Ritwik Banerjee"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.09944",
    "title": "Loopy-SLAM: Dense Neural SLAM with Loop Closures",
    "abstract": "Neural RGBD SLAM techniques have shown promise in dense Simultaneous Localization And Mapping (SLAM), yet face challenges such as error accumulation during camera tracking resulting in distorted maps. In response, we introduce Loopy-SLAM that globally optimizes poses and the dense 3D model. We use frame-to-model tracking using a data-driven point-based submap generation method and trigger loop closures online by performing global place recognition. Robust pose graph optimization is used to rigidly align the local submaps. As our representation is point based, map corrections can be performed efficiently without the need to store the entire history of input frames used for mapping as typically required by methods employing a grid based mapping structure. Evaluation on the synthetic Replica and real-world TUM-RGBD and ScanNet datasets demonstrate competitive or superior performance in tracking, mapping, and rendering accuracy when compared to existing dense neural RGBD SLAM methods. Project page: notchla.github.io/Loopy-SLAM. ",
    "url": "https://arxiv.org/abs/2402.09944",
    "authors": [
      "Lorenzo Liso",
      "Erik Sandström",
      "Vladimir Yugay",
      "Luc Van Gool",
      "Martin R. Oswald"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.09965",
    "title": "Hierarchy Representation of Data in Machine Learnings",
    "abstract": "When there are models with clear-cut judgment results for several data points, it is possible that most models exhibit a relationship where if they correctly judge one target, they also correctly judge another target. Conversely, if most models incorrectly judge one target, they may also incorrectly judge another target. We propose a method for visualizing this hierarchy among targets. This information is expected to be beneficial for model improvement. ",
    "url": "https://arxiv.org/abs/2402.09965",
    "authors": [
      "Han Yegang",
      "Park Minjun",
      "Byun Duwon",
      "Park Inkyu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.09982",
    "title": "Data Augmentation and Transfer Learning Approaches Applied to Facial  Expressions Recognition",
    "abstract": "The face expression is the first thing we pay attention to when we want to understand a person's state of mind. Thus, the ability to recognize facial expressions in an automatic way is a very interesting research field. In this paper, because the small size of available training datasets, we propose a novel data augmentation technique that improves the performances in the recognition task. We apply geometrical transformations and build from scratch GAN models able to generate new synthetic images for each emotion type. Thus, on the augmented datasets we fine tune pretrained convolutional neural networks with different architectures. To measure the generalization ability of the models, we apply extra-database protocol approach, namely we train models on the augmented versions of training dataset and test them on two different databases. The combination of these techniques allows to reach average accuracy values of the order of 85\\% for the InceptionResNetV2 model. ",
    "url": "https://arxiv.org/abs/2402.09982",
    "authors": [
      "Enrico Randellini",
      "Leonardo Rigutini",
      "Claudio Sacca'"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09992",
    "title": "Risk-Sensitive Soft Actor-Critic for Robust Deep Reinforcement Learning  under Distribution Shifts",
    "abstract": "We study the robustness of deep reinforcement learning algorithms against distribution shifts within contextual multi-stage stochastic combinatorial optimization problems from the operations research domain. In this context, risk-sensitive algorithms promise to learn robust policies. While this field is of general interest to the reinforcement learning community, most studies up-to-date focus on theoretical results rather than real-world performance. With this work, we aim to bridge this gap by formally deriving a novel risk-sensitive deep reinforcement learning algorithm while providing numerical evidence for its efficacy. Specifically, we introduce discrete Soft Actor-Critic for the entropic risk measure by deriving a version of the Bellman equation for the respective Q-values. We establish a corresponding policy improvement result and infer a practical algorithm. We introduce an environment that represents typical contextual multi-stage stochastic combinatorial optimization problems and perform numerical experiments to empirically validate our algorithm's robustness against realistic distribution shifts, without compromising performance on the training distribution. We show that our algorithm is superior to risk-neutral Soft Actor-Critic as well as to two benchmark approaches for robust deep reinforcement learning. Thereby, we provide the first structured analysis on the robustness of reinforcement learning under distribution shifts in the realm of contextual multi-stage stochastic combinatorial optimization problems. ",
    "url": "https://arxiv.org/abs/2402.09992",
    "authors": [
      "Tobias Enders",
      "James Harrison",
      "Maximilian Schiffer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2402.10001",
    "title": "Privacy Attacks in Decentralized Learning",
    "abstract": "Decentralized Gradient Descent (D-GD) allows a set of users to perform collaborative learning without sharing their data by iteratively averaging local model updates with their neighbors in a network graph. The absence of direct communication between non-neighbor nodes might lead to the belief that users cannot infer precise information about the data of others. In this work, we demonstrate the opposite, by proposing the first attack against D-GD that enables a user (or set of users) to reconstruct the private data of other users outside their immediate neighborhood. Our approach is based on a reconstruction attack against the gossip averaging protocol, which we then extend to handle the additional challenges raised by D-GD. We validate the effectiveness of our attack on real graphs and datasets, showing that the number of users compromised by a single or a handful of attackers is often surprisingly large. We empirically investigate some of the factors that affect the performance of the attack, namely the graph topology, the number of attackers, and their position in the graph. ",
    "url": "https://arxiv.org/abs/2402.10001",
    "authors": [
      "Abdellah El Mrini",
      "Edwige Cyffers",
      "Aurélien Bellet"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.10002",
    "title": "MM-Point: Multi-View Information-Enhanced Multi-Modal Self-Supervised 3D  Point Cloud Understanding",
    "abstract": "In perception, multiple sensory information is integrated to map visual information from 2D views onto 3D objects, which is beneficial for understanding in 3D environments. But in terms of a single 2D view rendered from different angles, only limited partial information can be provided.The richness and value of Multi-view 2D information can provide superior self-supervised signals for 3D objects. In this paper, we propose a novel self-supervised point cloud representation learning method, MM-Point, which is driven by intra-modal and inter-modal similarity objectives. The core of MM-Point lies in the Multi-modal interaction and transmission between 3D objects and multiple 2D views at the same time. In order to more effectively simultaneously perform the consistent cross-modal objective of 2D multi-view information based on contrastive learning, we further propose Multi-MLP and Multi-level Augmentation strategies. Through carefully designed transformation strategies, we further learn Multi-level invariance in 2D Multi-views. MM-Point demonstrates state-of-the-art (SOTA) performance in various downstream tasks. For instance, it achieves a peak accuracy of 92.4% on the synthetic dataset ModelNet40, and a top accuracy of 87.8% on the real-world dataset ScanObjectNN, comparable to fully supervised methods. Additionally, we demonstrate its effectiveness in tasks such as few-shot classification, 3D part segmentation and 3D semantic segmentation. ",
    "url": "https://arxiv.org/abs/2402.10002",
    "authors": [
      "Hai-Tao Yu",
      "Mofei Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2402.10011",
    "title": "Clifford Group Equivariant Simplicial Message Passing Networks",
    "abstract": "We introduce Clifford Group Equivariant Simplicial Message Passing Networks, a method for steerable E(n)-equivariant message passing on simplicial complexes. Our method integrates the expressivity of Clifford group-equivariant layers with simplicial message passing, which is topologically more intricate than regular graph message passing. Clifford algebras include higher-order objects such as bivectors and trivectors, which express geometric features (e.g., areas, volumes) derived from vectors. Using this knowledge, we represent simplex features through geometric products of their vertices. To achieve efficient simplicial message passing, we share the parameters of the message network across different dimensions. Additionally, we restrict the final message to an aggregation of the incoming messages from different dimensions, leading to what we term shared simplicial message passing. Experimental results show that our method is able to outperform both equivariant and simplicial graph neural networks on a variety of geometric tasks. ",
    "url": "https://arxiv.org/abs/2402.10011",
    "authors": [
      "Cong Liu",
      "David Ruhe",
      "Floor Eijkelboom",
      "Patrick Forré"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10013",
    "title": "Bridging the Empirical-Theoretical Gap in Neural Network Formal Language  Learning Using Minimum Description Length",
    "abstract": "Neural networks offer good approximation to many tasks but consistently fail to reach perfect generalization, even when theoretical work shows that such perfect solutions can be expressed by certain architectures. Using the task of formal language learning, we focus on one simple formal language and show that the theoretically correct solution is in fact not an optimum of commonly used objectives -- even with regularization techniques that according to common wisdom should lead to simple weights and good generalization (L1, L2) or other meta-heuristics (early-stopping, dropout). However, replacing standard targets with the Minimum Description Length objective (MDL) results in the correct solution being an optimum. ",
    "url": "https://arxiv.org/abs/2402.10013",
    "authors": [
      "Nur Lan",
      "Emmanuel Chemla",
      "Roni Katzir"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2402.10030",
    "title": "Systematic Literature Review of EM-SCA Attacks on Encryption",
    "abstract": "Cryptography is vital for data security, but cryptographic algorithms can still be vulnerable to side-channel attacks (SCAs), physical assaults exploiting power consumption and EM radiation. SCAs pose a significant threat to cryptographic integrity, compromising device keys. While literature on SCAs focuses on real-world devices, the rise of sophisticated devices necessitates fresh approaches. Electromagnetic side-channel analysis (EM-SCA) gathers information by monitoring EM radiation, capable of retrieving encryption keys and detecting malicious activity. This study evaluates EM-SCA's impact on encryption across scenarios and explores its role in digital forensics and law enforcement. Addressing encryption susceptibility to EM-SCA can empower forensic investigators in overcoming encryption challenges, maintaining their crucial role in law enforcement. Additionally, the paper defines EM-SCA's current state in attacking encryption, highlighting vulnerable and resistant encryption algorithms and devices, and promising EM-SCA approaches. This study offers a comprehensive analysis of EM-SCA in law enforcement and digital forensics, suggesting avenues for further research. ",
    "url": "https://arxiv.org/abs/2402.10030",
    "authors": [
      "Muhammad Rusyaidi Zunaidi",
      "Asanka Sayakkara",
      "Mark Scanlon"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.10044",
    "title": "On the Domain Generalizability of RF Fingerprints Through Multifractal  Dimension Representation",
    "abstract": "RF data-driven device fingerprinting through the use of deep learning has recently surfaced as a possible method for enabling secure device identification and authentication. Traditional approaches are commonly susceptible to the domain adaptation problem where a model trained on data collected under one domain performs badly when tested on data collected under a different domain. Some examples of a domain change include varying the location or environment of the device and varying the time or day of the data collection. In this work, we propose using multifractal analysis and the variance fractal dimension trajectory (VFDT) as a data representation input to the deep neural network to extract device fingerprints that are domain generalizable. We analyze the effectiveness of the proposed VFDT representation in detecting device-specific signatures from hardware-impaired IQ (in-phase and quadrature) signals, and we evaluate its robustness in real-world settings, using an experimental testbed of 30 WiFi-enabled Pycom devices. Our experimental results show that the proposed VFDT representation improves the scalability, robustness and generalizability of the deep learning models significantly compared to when using IQ data samples. ",
    "url": "https://arxiv.org/abs/2402.10044",
    "authors": [
      "Benjamin Johnson",
      "Bechir Hamdaoui"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.10045",
    "title": "Short-Form Videos and Mental Health: A Knowledge-Guided Multimodal  Neural Topic Model",
    "abstract": "While short-form videos head to reshape the entire social media landscape, experts are exceedingly worried about their depressive impacts on viewers, as evidenced by medical studies. To prevent widespread consequences, platforms are eager to predict these videos' impact on viewers' mental health. Subsequently, they can take intervention measures, such as revising recommendation algorithms and displaying viewer discretion. Nevertheless, applicable predictive methods lack relevance to well-established medical knowledge, which outlines clinically proven external and environmental factors of depression. To account for such medical knowledge, we resort to an emergent methodological discipline, seeded Neural Topic Models (NTMs). However, existing seeded NTMs suffer from the limitations of single-origin topics, unknown topic sources, unclear seed supervision, and suboptimal convergence. To address those challenges, we develop a novel Knowledge-guided Multimodal NTM to predict a short-form video's depressive impact on viewers. Extensive empirical analyses using TikTok and Douyin datasets prove that our method outperforms state-of-the-art benchmarks. Our method also discovers medically relevant topics from videos that are linked to depressive impact. We contribute to IS with a novel video analytics method that is generalizable to other video classification problems. Practically, our method can help platforms understand videos' mental impacts, thus adjusting recommendations and video topic disclosure. ",
    "url": "https://arxiv.org/abs/2402.10045",
    "authors": [
      "Jiaheng Xie",
      "Ruicheng Liang",
      "Yidong Chai",
      "Yang Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10059",
    "title": "Partial synchrony for free? New bounds for Byzantine agreement via a  generic transformation across network models",
    "abstract": "Byzantine consensus allows n processes to decide on a common value, in spite of arbitrary failures. The seminal Dolev-Reischuk bound states that any deterministic solution to Byzantine consensus exchanges Omega(n^2) bits. In recent years, great advances have been made in deterministic Byzantine agreement for partially synchronous networks, with state-of-the-art cryptographic solutions achieving O(n^2 \\kappa) bits (where $\\kappa$ is the security parameter) and nearly matching the lower bound. In contrast, for synchronous networks, optimal solutions with O(n^2) bits, with no cryptography and the same failure tolerance, have been known for more than three decades. Can this gap in network models be closed? In this paper, we present Repeater, the first generic transformation of Byzantine agreement algorithms from synchrony to partial synchrony. Repeater is modular, relying on existing and novel algorithms for its sub-modules. With the right choice of modules, Repeater requires no additional cryptography, is optimally resilient (n = 3t+1, where t is the maximum number of failures) and, for constant-size inputs, preserves the worst-case per-process bit complexity of the transformed synchronous algorithm. Leveraging Repeater, we present the first partially synchronous algorithm that (1) achieves optimal bit complexity (O(n^2) bits), (2) resists a computationally unbounded adversary (no cryptography), and (3) is optimally-resilient (n = 3t+1), thus showing that the Dolev-Reischuk bound is tight in partial synchrony. Moreover, we adapt Repeater for long inputs, introducing several new algorithms with improved complexity and weaker (or completely absent) cryptographic assumptions. ",
    "url": "https://arxiv.org/abs/2402.10059",
    "authors": [
      "Pierre Civit",
      "Muhammad Ayaz Dzulfikar",
      "Seth Gilbert",
      "Rachid Guerraoui",
      "Jovan Komatovic",
      "Manuel Vidigueira",
      "Igor Zablotchi"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2402.10062",
    "title": "Optimal Parameter and Neuron Pruning for Out-of-Distribution Detection",
    "abstract": "For a machine learning model deployed in real world scenarios, the ability of detecting out-of-distribution (OOD) samples is indispensable and challenging. Most existing OOD detection methods focused on exploring advanced training skills or training-free tricks to prevent the model from yielding overconfident confidence score for unknown samples. The training-based methods require expensive training cost and rely on OOD samples which are not always available, while most training-free methods can not efficiently utilize the prior information from the training data. In this work, we propose an \\textbf{O}ptimal \\textbf{P}arameter and \\textbf{N}euron \\textbf{P}runing (\\textbf{OPNP}) approach, which aims to identify and remove those parameters and neurons that lead to over-fitting. The main method is divided into two steps. In the first step, we evaluate the sensitivity of the model parameters and neurons by averaging gradients over all training samples. In the second step, the parameters and neurons with exceptionally large or close to zero sensitivities are removed for prediction. Our proposal is training-free, compatible with other post-hoc methods, and exploring the information from all training data. Extensive experiments are performed on multiple OOD detection tasks and model architectures, showing that our proposed OPNP consistently outperforms the existing methods by a large margin. ",
    "url": "https://arxiv.org/abs/2402.10062",
    "authors": [
      "Chao Chen",
      "Zhihang Fu",
      "Kai Liu",
      "Ze Chen",
      "Mingyuan Tao",
      "Jieping Ye"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.10063",
    "title": "Balancing the Causal Effects in Class-Incremental Learning",
    "abstract": "Class-Incremental Learning (CIL) is a practical and challenging problem for achieving general artificial intelligence. Recently, Pre-Trained Models (PTMs) have led to breakthroughs in both visual and natural language processing tasks. Despite recent studies showing PTMs' potential ability to learn sequentially, a plethora of work indicates the necessity of alleviating the catastrophic forgetting of PTMs. Through a pilot study and a causal analysis of CIL, we reveal that the crux lies in the imbalanced causal effects between new and old data. Specifically, the new data encourage models to adapt to new classes while hindering the adaptation of old classes. Similarly, the old data encourages models to adapt to old classes while hindering the adaptation of new classes. In other words, the adaptation process between new and old classes conflicts from the causal perspective. To alleviate this problem, we propose Balancing the Causal Effects (BaCE) in CIL. Concretely, BaCE proposes two objectives for building causal paths from both new and old data to the prediction of new and classes, respectively. In this way, the model is encouraged to adapt to all classes with causal effects from both new and old data and thus alleviates the causal imbalance problem. We conduct extensive experiments on continual image classification, continual text classification, and continual named entity recognition. Empirical results show that BaCE outperforms a series of CIL methods on different tasks and settings. ",
    "url": "https://arxiv.org/abs/2402.10063",
    "authors": [
      "Junhao Zheng",
      "Ruiyan Wang",
      "Chongzhi Zhang",
      "Huawen Feng",
      "Qianli Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10064",
    "title": "Navigating the Maize: Cyclic and conditional computational graphs for  molecular simulation",
    "abstract": "Many computational chemistry and molecular simulation workflows can be expressed as graphs. This abstraction is useful to modularize and potentially reuse existing components, as well as provide parallelization and ease reproducibility. Existing tools represent the computation as a directed acyclic graph (DAG), thus allowing efficient execution by parallelization of concurrent branches. These systems can, however, generally not express cyclic and conditional workflows. We therefore developed Maize, a workflow manager for cyclic and conditional graphs based on the principles of flow-based programming. By running each node of the graph concurrently in separate processes and allowing communication at any time through dedicated inter-node channels, arbitrary graph structures can be executed. We demonstrate the effectiveness of the tool on a dynamic active learning task in computational drug design, involving the use of a small molecule generative model and an associated scoring system. ",
    "url": "https://arxiv.org/abs/2402.10064",
    "authors": [
      "Thomas Löhr",
      "Michael Dodds",
      "Lili Cao",
      "Mikhail Kabeshov",
      "Michele Assante",
      "Jon-Paul Janet",
      "Marco Klähn",
      "Ola Engkvist"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10066",
    "title": "NYCTALE: Neuro-Evidence Transformer for Adaptive and Personalized Lung  Nodule Invasiveness Prediction",
    "abstract": "Drawing inspiration from the primate brain's intriguing evidence accumulation process, and guided by models from cognitive psychology and neuroscience, the paper introduces the NYCTALE framework, a neuro-inspired and evidence accumulation-based Transformer architecture. The proposed neuro-inspired NYCTALE offers a novel pathway in the domain of Personalized Medicine (PM) for lung cancer diagnosis. In nature, Nyctales are small owls known for their nocturnal behavior, hunting primarily during the darkness of night. The NYCTALE operates in a similarly vigilant manner, i.e., processing data in an evidence-based fashion and making predictions dynamically/adaptively. Distinct from conventional Computed Tomography (CT)-based Deep Learning (DL) models, the NYCTALE performs predictions only when sufficient amount of evidence is accumulated. In other words, instead of processing all or a pre-defined subset of CT slices, for each person, slices are provided one at a time. The NYCTALE framework then computes an evidence vector associated with contribution of each new CT image. A decision is made once the total accumulated evidence surpasses a specific threshold. Preliminary experimental analyses conducted using a challenging in-house dataset comprising 114 subjects. The results are noteworthy, suggesting that NYCTALE outperforms the benchmark accuracy even with approximately 60% less training data on this demanding and small dataset. ",
    "url": "https://arxiv.org/abs/2402.10066",
    "authors": [
      "Sadaf Khademi",
      "Anastasia Oikonomou",
      "Konstantinos N. Plataniotis",
      "Arash Mohammadi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2402.10069",
    "title": "Learning fast changing slow in spiking neural networks",
    "abstract": "Reinforcement learning (RL) faces substantial challenges when applied to real-life problems, primarily stemming from the scarcity of available data due to limited interactions with the environment. This limitation is exacerbated by the fact that RL often demands a considerable volume of data for effective learning. The complexity escalates further when implementing RL in recurrent spiking networks, where inherent noise introduced by spikes adds a layer of difficulty. Life-long learning machines must inherently resolve the plasticity-stability paradox. Striking a balance between acquiring new knowledge and maintaining stability is crucial for artificial agents. In this context, we take inspiration from machine learning technology and introduce a biologically plausible implementation of proximal policy optimization, arguing that it significantly alleviates this challenge. Our approach yields two notable advancements: first, the ability to assimilate new information without necessitating alterations to the current policy, and second, the capability to replay experiences without succumbing to policy divergence. Furthermore, when contrasted with other experience replay (ER) techniques, our method demonstrates the added advantage of being computationally efficient in an online setting. We demonstrate that the proposed methodology enhances the efficiency of learning, showcasing its potential impact on neuromorphic and real-world applications. ",
    "url": "https://arxiv.org/abs/2402.10069",
    "authors": [
      "Cristiano Capone",
      "Paolo Muratore"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10074",
    "title": "GraphCBAL: Class-Balanced Active Learning for Graph Neural Networks via  Reinforcement Learning",
    "abstract": "Graph neural networks (GNNs) have recently demonstrated significant success. Active learning for GNNs aims to query the valuable samples from the unlabeled data for annotation to maximize the GNNs' performance at a low cost. However, most existing methods for reinforced active learning in GNNs may lead to a highly imbalanced class distribution, especially in highly skewed class scenarios. This further adversely affects the classification performance. To tackle this issue, in this paper, we propose a novel reinforced class-balanced active learning framework for GNNs, namely, GraphCBAL. It learns an optimal policy to acquire class-balanced and informative nodes for annotation, maximizing the performance of GNNs trained with selected labeled nodes. GraphCBAL designs class-balance-aware states, as well as a reward function that achieves trade-off between model performance and class balance. We further upgrade GraphCBAL to GraphCBAL++ by introducing a punishment mechanism to obtain a more class-balanced labeled set. Extensive experiments on multiple datasets demonstrate the effectiveness of the proposed approaches, achieving superior performance over state-of-the-art baselines. In particular, our methods can strike the balance between classification results and class balance. ",
    "url": "https://arxiv.org/abs/2402.10074",
    "authors": [
      "Chengcheng Yu",
      "Jiapeng Zhu",
      "Xiang Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10082",
    "title": "FedRDF: A Robust and Dynamic Aggregation Function against Poisoning  Attacks in Federated Learning",
    "abstract": "Federated Learning (FL) represents a promising approach to typical privacy concerns associated with centralized Machine Learning (ML) deployments. Despite its well-known advantages, FL is vulnerable to security attacks such as Byzantine behaviors and poisoning attacks, which can significantly degrade model performance and hinder convergence. The effectiveness of existing approaches to mitigate complex attacks, such as median, trimmed mean, or Krum aggregation functions, has been only partially demonstrated in the case of specific attacks. Our study introduces a novel robust aggregation mechanism utilizing the Fourier Transform (FT), which is able to effectively handling sophisticated attacks without prior knowledge of the number of attackers. Employing this data technique, weights generated by FL clients are projected into the frequency domain to ascertain their density function, selecting the one exhibiting the highest frequency. Consequently, malicious clients' weights are excluded. Our proposed approach was tested against various model poisoning attacks, demonstrating superior performance over state-of-the-art aggregation methods. ",
    "url": "https://arxiv.org/abs/2402.10082",
    "authors": [
      "Enrique Mármol Campos",
      "Aurora González Vidal",
      "José Luis Hernández Ramos",
      "Antonio Skarmeta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.10085",
    "title": "Develop End-to-End Anomaly Detection System",
    "abstract": "Anomaly detection plays a crucial role in ensuring network robustness. However, implementing intelligent alerting systems becomes a challenge when considering scenarios in which anomalies can be caused by both malicious and non-malicious events, leading to the difficulty of determining anomaly patterns. The lack of labeled data in the computer networking domain further exacerbates this issue, impeding the development of robust models capable of handling real-world scenarios. To address this challenge, in this paper, we propose an end-to-end anomaly detection model development pipeline. This framework makes it possible to consume user feedback and enable continuous user-centric model performance evaluation and optimization. We demonstrate the efficacy of the framework by way of introducing and bench-marking a new forecasting model -- named \\emph{Lachesis} -- on a real-world networking problem. Experiments have demonstrated the robustness and effectiveness of the two proposed versions of \\emph{Lachesis} compared with other models proposed in the literature. Our findings underscore the potential for improving the performance of data-driven products over their life cycles through a harmonized integration of user feedback and iterative development. ",
    "url": "https://arxiv.org/abs/2402.10085",
    "authors": [
      "Emanuele Mengoli",
      "Zhiyuan Yao",
      "Wutao Wei"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10087",
    "title": "Decentralized Covert Routing in Heterogeneous Networks Using  Reinforcement Learning",
    "abstract": "This letter investigates covert routing communications in a heterogeneous network where a source transmits confidential data to a destination with the aid of relaying nodes where each transmitter judiciously chooses one modality among multiple communication modalities. We develop a novel reinforcement learning-based covert routing algorithm that finds a route from the source to the destination where each node identifies its next hop and modality only based on the local feedback information received from its neighboring nodes. We show based on numerical simulations that the proposed covert routing strategy has only negligible performance loss compared to the optimal centralized routing scheme. ",
    "url": "https://arxiv.org/abs/2402.10087",
    "authors": [
      "Justin Kong",
      "Terrence J. Moore",
      "Fikadu T. Dagefu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.10097",
    "title": "Adaptive Federated Learning in Heterogeneous Wireless Networks with  Independent Sampling",
    "abstract": "Federated Learning (FL) algorithms commonly sample a random subset of clients to address the straggler issue and improve communication efficiency. While recent works have proposed various client sampling methods, they have limitations in joint system and data heterogeneity design, which may not align with practical heterogeneous wireless networks. In this work, we advocate a new independent client sampling strategy to minimize the wall-clock training time of FL, while considering data heterogeneity and system heterogeneity in both communication and computation. We first derive a new convergence bound for non-convex loss functions with independent client sampling and then propose an adaptive bandwidth allocation scheme. Furthermore, we propose an efficient independent client sampling algorithm based on the upper bounds on the convergence rounds and the expected per-round training time, to minimize the wall-clock time of FL, while considering both the data and system heterogeneity. Experimental results under practical wireless network settings with real-world prototype demonstrate that the proposed independent sampling scheme substantially outperforms the current best sampling schemes under various training models and datasets. ",
    "url": "https://arxiv.org/abs/2402.10097",
    "authors": [
      "Jiaxiang Geng",
      "Yanzhao Hou",
      "Xiaofeng Tao",
      "Juncheng Wang",
      "Bing Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2402.10101",
    "title": "Deep Learning Based Situation Awareness for Multiple Missiles Evasion",
    "abstract": "As the effective range of air-to-air missiles increases, it becomes harder for human operators to maintain the situational awareness needed to keep a UAV safe. In this work, we propose a decision support tool to help UAV operators in Beyond Visual Range (BVR) air combat scenarios assess the risks of different options and make decisions based on those. Earlier work focused on the threat posed by a single missile, and in this work, we extend the ideas to several missile threats. The proposed method uses Deep Neural Networks (DNN) to learn from high-fidelity simulations to provide the operator with an outcome estimate for a set of different strategies. Our results demonstrate that the proposed system can manage multiple incoming missiles, evaluate a family of options, and recommend the least risky course of action. ",
    "url": "https://arxiv.org/abs/2402.10101",
    "authors": [
      "Edvards Scukins",
      "Markus Klein",
      "Lars Kroon",
      "Petter Ögren"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10107",
    "title": "Quantized Embedding Vectors for Controllable Diffusion Language Models",
    "abstract": "Improving the controllability, portability, and inference speed of diffusion language models (DLMs) is a key challenge in natural language generation. While recent research has shown significant success in complex text generation with language models, the memory and computational power are still very demanding and fall short of expectations, which naturally results in low portability and instability for the models. To mitigate these issues, numerous well-established methods were proposed for neural network quantization. To further enhance their portability of independent deployment as well as improve their stability evaluated by language perplexity, we propose a novel approach called the Quantized Embedding Controllable Diffusion Language Model (QE-CDLM). QE-CDLM builds upon the recent successful controllable DLMs by remodeling the task-specific embedding space via quantization. This leads to a gradient-based controller for the generation tasks, and more stable intermediate latent variables are obtained, which naturally brings in an accelerated convergence as well as better controllability. Additionally, the adaption fine-tuning method is employed to reduce tunable weights. Experimental results on five challenging fine-grained control tasks demonstrate that QE-CDLM compares favorably to existing methods in terms of quality and feasibility, achieving better perplexity and lightweight fine-tuning. ",
    "url": "https://arxiv.org/abs/2402.10107",
    "authors": [
      "Cheng Kang",
      "Xinye Chen",
      "Yong Hu",
      "Daniel Novak"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10109",
    "title": "Towards Reducing Diagnostic Errors with Interpretable Risk Prediction",
    "abstract": "Many diagnostic errors occur because clinicians cannot easily access relevant information in patient Electronic Health Records (EHRs). In this work we propose a method to use LLMs to identify pieces of evidence in patient EHR data that indicate increased or decreased risk of specific diagnoses; our ultimate aim is to increase access to evidence and reduce diagnostic errors. In particular, we propose a Neural Additive Model to make predictions backed by evidence with individualized risk estimates at time-points where clinicians are still uncertain, aiming to specifically mitigate delays in diagnosis and errors stemming from an incomplete differential. To train such a model, it is necessary to infer temporally fine-grained retrospective labels of eventual \"true\" diagnoses. We do so with LLMs, to ensure that the input text is from before a confident diagnosis can be made. We use an LLM to retrieve an initial pool of evidence, but then refine this set of evidence according to correlations learned by the model. We conduct an in-depth evaluation of the usefulness of our approach by simulating how it might be used by a clinician to decide between a pre-defined list of differential diagnoses. ",
    "url": "https://arxiv.org/abs/2402.10109",
    "authors": [
      "Denis Jered McInerney",
      "William Dickinson",
      "Lucy Flynn",
      "Andrea Young",
      "Geoffrey Young",
      "Jan-Willem van de Meent",
      "Byron C. Wallace"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10119",
    "title": "Physics-Informed Neural Network Policy Iteration: Algorithms,  Convergence, and Verification",
    "abstract": "Solving nonlinear optimal control problems is a challenging task, particularly for high-dimensional problems. We propose algorithms for model-based policy iterations to solve nonlinear optimal control problems with convergence guarantees. The main component of our approach is an iterative procedure that utilizes neural approximations to solve linear partial differential equations (PDEs), ensuring convergence. We present two variants of the algorithms. The first variant formulates the optimization problem as a linear least square problem, drawing inspiration from extreme learning machine (ELM) for solving PDEs. This variant efficiently handles low-dimensional problems with high accuracy. The second variant is based on a physics-informed neural network (PINN) for solving PDEs and has the potential to address high-dimensional problems. We demonstrate that both algorithms outperform traditional approaches, such as Galerkin methods, by a significant margin. We provide a theoretical analysis of both algorithms in terms of convergence of neural approximations towards the true optimal solutions in a general setting. Furthermore, we employ formal verification techniques to demonstrate the verifiable stability of the resulting controllers. ",
    "url": "https://arxiv.org/abs/2402.10119",
    "authors": [
      "Yiming Meng",
      "Ruikun Zhou",
      "Amartya Mukherjee",
      "Maxwell Fitzsimmons",
      "Christopher Song",
      "Jun Liu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2402.10122",
    "title": "Mitigating subjectivity and bias in AI development indices: A robust  approach to redefining country rankings",
    "abstract": "Countries worldwide have been implementing different actions national strategies for Artificial Intelligence (AI) to shape policy priorities and guide their development concerning AI. Several AI indices have emerged to assess countries' progress in AI development, aiding decision-making on investments and policy choices. Typically, these indices combine multiple indicators using linear additive methods such as weighted sums, although they are limited in their ability to account for interactions among indicators. Another limitation concerns the use of deterministic weights, which can be perceived as subjective and vulnerable to debate and scrutiny, especially by nations that feel disadvantaged. Aiming at mitigating these problems, we conduct a methodological analysis to derive AI indices based on multiple criteria decision analysis. Initially, we assess correlations between different AI dimensions and employ the Choquet integral to model them. Thus, we apply the Stochastic Multicriteria Acceptability Analysis (SMAA) to conduct a sensitivity analysis using both weighted sum and Choquet integral in order to evaluate the stability of the indices with regard the weights. Finally, we introduce a novel ranking methodology based on SMAA, which considers several sets of weights to derive the ranking of countries. As a result, instead of using predefined weights, in the proposed approach, the ranking is achieved based on the probabilities of countries in occupying a specific position. In the computational analysis, we utilize the data employed in The Global AI Index proposed by Tortoise. Results reveal correlations in the data, and our approach effectively mitigates bias. In the sensitivity analysis, we scrutinize changes in the ranking resulting from weight adjustments. We demonstrate that our proposal rankings closely align with those derived from weight variations, proving to be more robust. ",
    "url": "https://arxiv.org/abs/2402.10122",
    "authors": [
      "Betania Silva C Campello",
      "Guilherme Dean Pelegrina",
      "Renata Pelissari",
      "Ricardo Suyama",
      "Leonardo Tomazeli Duarte"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2402.10158",
    "title": "InfoNet: Neural Estimation of Mutual Information without Test-Time  Optimization",
    "abstract": "Estimating mutual correlations between random variables or data streams is essential for intelligent behavior and decision-making. As a fundamental quantity for measuring statistical relationships, mutual information has been extensively studied and utilized for its generality and equitability. However, existing methods often lack the efficiency needed for real-time applications, such as test-time optimization of a neural network, or the differentiability required for end-to-end learning, like histograms. We introduce a neural network called InfoNet, which directly outputs mutual information estimations of data streams by leveraging the attention mechanism and the computational efficiency of deep learning infrastructures. By maximizing a dual formulation of mutual information through large-scale simulated training, our approach circumvents time-consuming test-time optimization and offers generalization ability. We evaluate the effectiveness and generalization of our proposed mutual information estimation scheme on various families of distributions and applications. Our results demonstrate that InfoNet and its training process provide a graceful efficiency-accuracy trade-off and order-preserving properties. We will make the code and models available as a comprehensive toolbox to facilitate studies in different fields requiring real-time mutual information estimation. ",
    "url": "https://arxiv.org/abs/2402.10158",
    "authors": [
      "Zhengyang Hu",
      "Song Kang",
      "Qunsong Zeng",
      "Kaibin Huang",
      "Yanchao Yang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2402.10163",
    "title": "Hidden Traveling Waves bind Working Memory Variables in Recurrent Neural  Networks",
    "abstract": "Traveling waves are a fundamental phenomenon in the brain, playing a crucial role in short-term information storage. In this study, we leverage the concept of traveling wave dynamics within a neural lattice to formulate a theoretical model of neural working memory, study its properties, and its real world implications in AI. The proposed model diverges from traditional approaches, which assume information storage in static, register-like locations updated by interference. Instead, the model stores data as waves that is updated by the wave's boundary conditions. We rigorously examine the model's capabilities in representing and learning state histories, which are vital for learning history-dependent dynamical systems. The findings reveal that the model reliably stores external information and enhances the learning process by addressing the diminishing gradient problem. To understand the model's real-world applicability, we explore two cases: linear boundary condition and non-linear, self-attention-driven boundary condition. The experiments reveal that the linear scenario is effectively learned by Recurrent Neural Networks (RNNs) through backpropagation when modeling history-dependent dynamical systems. Conversely, the non-linear scenario parallels the autoregressive loop of an attention-only transformer. Collectively, our findings suggest the broader relevance of traveling waves in AI and its potential in advancing neural network architectures. ",
    "url": "https://arxiv.org/abs/2402.10163",
    "authors": [
      "Arjun Karuvally",
      "Terrence J. Sejnowski",
      "Hava T. Siegelmann"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2402.10184",
    "title": "Rethinking Information Structures in RLHF: Reward Generalization from a  Graph Theory Perspective",
    "abstract": "There is a trilemma in reinforcement learning from human feedback (RLHF): the incompatibility between highly diverse contexts, low labeling cost, and reliable alignment performance. Here we aim to mitigate such incompatibility through the design of dataset information structures during reward modeling. Specifically, we first reexamine the RLHF process and propose a theoretical framework portraying it as an autoencoding process over text distributions. Our framework formalizes the RLHF objective of ensuring distributional consistency between human preference and large language model (LLM) behavior. Building on this framework, we then systematically investigate the performance impact of information structure in the reward modeling stage of RLHF. To further understand reward generalization in the reward modeling stage, we introduce a new method based on random graph theory that models generalization in the semantic space. A key insight of our analysis is the superiority of the tree-based information structure in reward modeling, compared to chain-based baselines adopted by conventional RLHF methods. We derive that under highly complex contexts with limited data, the tree-based reward model (RM) induces up to $\\Theta(\\log n/\\log\\log n)$ times less variance than chain-based RM where $n$ is the dataset size. To validate our theoretical contribution, we demonstrate that on three different NLP tasks, the tree-based RM achieves 65% win rate on average against chain-based baselines. Looking forward, we hope our framework can serve as a step towards understanding goal misgeneralization. ",
    "url": "https://arxiv.org/abs/2402.10184",
    "authors": [
      "Tianyi Qiu",
      "Fanzhi Zeng",
      "Jiaming Ji",
      "Dong Yan",
      "Kaile Wang",
      "Jiayi Zhou",
      "Han Yang",
      "Josef Dai",
      "Xuehai Pan",
      "Yaodong Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2402.10196",
    "title": "A Trembling House of Cards? Mapping Adversarial Attacks against Language  Agents",
    "abstract": "Language agents powered by large language models (LLMs) have seen exploding development. Their capability of using language as a vehicle for thought and communication lends an incredible level of flexibility and versatility. People have quickly capitalized on this capability to connect LLMs to a wide range of external components and environments: databases, tools, the Internet, robotic embodiment, etc. Many believe an unprecedentedly powerful automation technology is emerging. However, new automation technologies come with new safety risks, especially for intricate systems like language agents. There is a surprisingly large gap between the speed and scale of their development and deployment and our understanding of their safety risks. Are we building a house of cards? In this position paper, we present the first systematic effort in mapping adversarial attacks against language agents. We first present a unified conceptual framework for agents with three major components: Perception, Brain, and Action. Under this framework, we present a comprehensive discussion and propose 12 potential attack scenarios against different components of an agent, covering different attack strategies (e.g., input manipulation, adversarial demonstrations, jailbreaking, backdoors). We also draw connections to successful attack strategies previously applied to LLMs. We emphasize the urgency to gain a thorough understanding of language agent risks before their widespread deployment. ",
    "url": "https://arxiv.org/abs/2402.10196",
    "authors": [
      "Lingbo Mo",
      "Zeyi Liao",
      "Boyuan Zheng",
      "Yu Su",
      "Chaowei Xiao",
      "Huan Sun"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10206",
    "title": "Ising on the Graph: Task-specific Graph Subsampling via the Ising Model",
    "abstract": "Reducing a graph while preserving its overall structure is an important problem with many applications. Typically, the reduction approaches either remove edges (sparsification) or merge nodes (coarsening) in an unsupervised way with no specific downstream task in mind. In this paper, we present an approach for subsampling graph structures using an Ising model defined on either the nodes or edges and learning the external magnetic field of the Ising model using a graph neural network. Our approach is task-specific as it can learn how to reduce a graph for a specific downstream task in an end-to-end fashion. The utilized loss function of the task does not even have to be differentiable. We showcase the versatility of our approach on three distinct applications: image segmentation, 3D shape sparsification, and sparse approximate matrix inverse determination. ",
    "url": "https://arxiv.org/abs/2402.10206",
    "authors": [
      "Maria Bånkestad",
      "Jennifer Andersson",
      "Sebastian Mair",
      "Jens Sjölund"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.09416",
    "title": "Deep Manifold Transformation for Protein Representation Learning",
    "abstract": "Protein representation learning is critical in various tasks in biology, such as drug design and protein structure or function prediction, which has primarily benefited from protein language models and graph neural networks. These models can capture intrinsic patterns from protein sequences and structures through masking and task-related losses. However, the learned protein representations are usually not well optimized, leading to performance degradation due to limited data, difficulty adapting to new tasks, etc. To address this, we propose a new \\underline{d}eep \\underline{m}anifold \\underline{t}ransformation approach for universal \\underline{p}rotein \\underline{r}epresentation \\underline{l}earning (DMTPRL). It employs manifold learning strategies to improve the quality and adaptability of the learned embeddings. Specifically, we apply a novel manifold learning loss during training based on the graph inter-node similarity. Our proposed DMTPRL method outperforms state-of-the-art baselines on diverse downstream tasks across popular datasets. This validates our approach for learning universal and robust protein representations. We promise to release the code after acceptance. ",
    "url": "https://arxiv.org/abs/2402.09416",
    "authors": [
      "Bozhen Hu",
      "Zelin Zang",
      "Cheng Tan",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09424",
    "title": "Epilepsy Seizure Detection and Prediction using an Approximate Spiking  Convolutional Transformer",
    "abstract": "Epilepsy is a common disease of the nervous system. Timely prediction of seizures and intervention treatment can significantly reduce the accidental injury of patients and protect the life and health of patients. This paper presents a neuromorphic Spiking Convolutional Transformer, named Spiking Conformer, to detect and predict epileptic seizure segments from scalped long-term electroencephalogram (EEG) recordings. We report evaluation results from the Spiking Conformer model using the Boston Children's Hospital-MIT (CHB-MIT) EEG dataset. By leveraging spike-based addition operations, the Spiking Conformer significantly reduces the classification computational cost compared to the non-spiking model. Additionally, we introduce an approximate spiking neuron layer to further reduce spike-triggered neuron updates by nearly 38% without sacrificing accuracy. Using raw EEG data as input, the proposed Spiking Conformer achieved an average sensitivity rate of 94.9% and a specificity rate of 99.3% for the seizure detection task, and 96.8%, 89.5% for the seizure prediction task, and needs >10x fewer operations compared to the non-spiking equivalent model. ",
    "url": "https://arxiv.org/abs/2402.09424",
    "authors": [
      "Qinyu Chen",
      "Congyi Sun",
      "Chang Gao",
      "Shih-Chii Liu"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09426",
    "title": "Graph Koopman Autoencoder for Predictive Covert Communication Against  UAV Surveillance",
    "abstract": "Low Probability of Detection (LPD) communication aims to obscure the very presence of radio frequency (RF) signals, going beyond just hiding the content of the communication. However, the use of Unmanned Aerial Vehicles (UAVs) introduces a challenge, as UAVs can detect RF signals from the ground by hovering over specific areas of interest. With the growing utilization of UAVs in modern surveillance, there is a crucial need for a thorough understanding of their unknown nonlinear dynamic trajectories to effectively implement LPD communication. Unfortunately, this critical information is often not readily available, posing a significant hurdle in LPD communication. To address this issue, we consider a case-study for enabling terrestrial LPD communication in the presence of multiple UAVs that are engaged in surveillance. We introduce a novel framework that combines graph neural networks (GNN) with Koopman theory to predict the trajectories of multiple fixed-wing UAVs over an extended prediction horizon. Using the predicted UAV locations, we enable LPD communication in a terrestrial ad-hoc network by controlling nodes' transmit powers to keep the received power at UAVs' predicted locations minimized. Our extensive simulations validate the efficacy of the proposed framework in accurately predicting the trajectories of multiple UAVs, thereby effectively establishing LPD communication. ",
    "url": "https://arxiv.org/abs/2402.09426",
    "authors": [
      "Sivaram Krishnan",
      "Jihong Park",
      "Gregory Sherman",
      "Benjamin Campbell",
      "Jinho Choi"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2402.09433",
    "title": "Electrical Behavior Association Mining for Household ShortTerm Energy  Consumption Forecasting",
    "abstract": "Accurate household short-term energy consumption forecasting (STECF) is crucial for home energy management, but it is technically challenging, due to highly random behaviors of individual residential users. To improve the accuracy of STECF on a day-ahead scale, this paper proposes an novel STECF methodology that leverages association mining in electrical behaviors. First, a probabilistic association quantifying and discovering method is proposed to model the pairwise behaviors association and generate associated clusters. Then, a convolutional neural network-gated recurrent unit (CNN-GRU) based forecasting is provided to explore the temporal correlation and enhance accuracy. The testing results demonstrate that this methodology yields a significant enhancement in the STECF. ",
    "url": "https://arxiv.org/abs/2402.09433",
    "authors": [
      "Heyang Yu",
      "Yuxi Sun",
      "Yintao Liu",
      "Guangchao Geng",
      "Quanyuan Jiang"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2402.09434",
    "title": "Disentangling Imperfect: A Wavelet-Infused Multilevel Heterogeneous  Network for Human Activity Recognition in Flawed Wearable Sensor Data",
    "abstract": "The popularity and diffusion of wearable devices provides new opportunities for sensor-based human activity recognition that leverages deep learning-based algorithms. Although impressive advances have been made, two major challenges remain. First, sensor data is often incomplete or noisy due to sensor placement and other issues as well as data transmission failure, calling for imputation of missing values, which also introduces noise. Second, human activity has multi-scale characteristics. Thus, different groups of people and even the same person may behave differently under different circumstances. To address these challenges, we propose a multilevel heterogeneous neural network, called MHNN, for sensor data analysis. We utilize multilevel discrete wavelet decomposition to extract multi-resolution features from sensor data. This enables distinguishing signals with different frequencies, thereby suppressing noise. As the components resulting from the decomposition are heterogeneous, we equip the proposed model with heterogeneous feature extractors that enable the learning of multi-scale features. Due to the complementarity of these features, we also include a cross aggregation module for enhancing their interactions. An experimental study using seven publicly available datasets offers evidence that MHNN can outperform other cutting-edge models and offers evidence of robustness to missing values and noise. An ablation study confirms the importance of each module. ",
    "url": "https://arxiv.org/abs/2402.09434",
    "authors": [
      "Mengna Liu",
      "Dong Xiang",
      "Xu Cheng",
      "Xiufeng Liu",
      "Dalin Zhang",
      "Shengyong Chen",
      "Christian S. Jensen"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09447",
    "title": "Wavelet Analysis of Noninvasive EEG Signals Discriminates Complex and  Natural Grasp Types",
    "abstract": "This research aims to decode hand grasps from Electroencephalograms (EEGs) for dexterous neuroprosthetic development and Brain-Computer Interface (BCI) applications, especially for patients with motor disorders. Particularly, it focuses on distinguishing two complex natural power and precision grasps in addition to a neutral condition as a no-movement condition using a new EEG-based BCI platform and wavelet signal processing. Wavelet analysis involved generating time-frequency and topographic maps from wavelet power coefficients. Then, by using machine learning techniques with novel wavelet features, we achieved high average accuracies: 85.16% for multiclass, 95.37% for No-Movement vs Power, 95.40% for No-Movement vs Precision, and 88.07% for Power vs Precision, demonstrating the effectiveness of these features in EEG-based grasp differentiation. In contrast to previous studies, a critical part of our study was permutation feature importance analysis, which highlighted key features for grasp classification. It revealed that the most crucial brain activities during grasping occur in the motor cortex, within the alpha and beta frequency bands. These insights demonstrate the potential of wavelet features in real-time neuroprosthetic technology and BCI applications. ",
    "url": "https://arxiv.org/abs/2402.09447",
    "authors": [
      "Ali Rabiee",
      "Sima Ghafoori",
      "Anna Cetera",
      "Reza Abiri"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2402.09450",
    "title": "Guiding Masked Representation Learning to Capture Spatio-Temporal  Relationship of Electrocardiogram",
    "abstract": "Electrocardiograms (ECG) are widely employed as a diagnostic tool for monitoring electrical signals originating from a heart. Recent machine learning research efforts have focused on the application of screening various diseases using ECG signals. However, adapting to the application of screening disease is challenging in that labeled ECG data are limited. Achieving general representation through self-supervised learning (SSL) is a well-known approach to overcome the scarcity of labeled data; however, a naive application of SSL to ECG data, without considering the spatial-temporal relationships inherent in ECG signals, may yield suboptimal results. In this paper, we introduce ST-MEM (Spatio-Temporal Masked Electrocardiogram Modeling), designed to learn spatio-temporal features by reconstructing masked 12-lead ECG data. ST-MEM outperforms other SSL baseline methods in various experimental settings for arrhythmia classification tasks. Moreover, we demonstrate that ST-MEM is adaptable to various lead combinations. Through quantitative and qualitative analysis, we show a spatio-temporal relationship within ECG data. ",
    "url": "https://arxiv.org/abs/2402.09450",
    "authors": [
      "Yeongyeon Na",
      "Minje Park",
      "Yunwon Tae",
      "Sunghoon Joo"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09453",
    "title": "Improving EEG Signal Classification Accuracy Using Wasserstein  Generative Adversarial Networks",
    "abstract": "Electroencephalography (EEG) plays a vital role in recording brain activities and is integral to the development of brain-computer interface (BCI) technologies. However, the limited availability and high variability of EEG signals present substantial challenges in creating reliable BCIs. To address this issue, we propose a practical solution drawing on the latest developments in deep learning and Wasserstein Generative Adversarial Network (WGAN). The WGAN was trained on the BCI2000 dataset, consisting of around 1500 EEG recordings and 64 channels from 45 individuals. The generated EEG signals were evaluated via three classifiers yielding improved average accuracies. The quality of generated signals measured using Frechet Inception Distance (FID) yielded scores of 1.345 and 11.565 for eyes-open and closed respectively. Even without a spectral or spatial loss term, our WGAN model was able to emulate the spectral and spatial properties of the EEG training data. The WGAN-generated data mirrored the dominant alpha activity during closed-eye resting and high delta waves in the training data in its topographic map and power spectral density (PSD) plot. Our research testifies to the potential of WGANs in addressing the limited EEG data issue for BCI development by enhancing a small dataset to improve classifier generalizability. ",
    "url": "https://arxiv.org/abs/2402.09453",
    "authors": [
      "Joshua Park",
      "Priyanshu Mahey",
      "Ore Adeniyi"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09459",
    "title": "Custom IMU-Based Wearable System for Robust 2.4 GHz Wireless Human Body  Parts Orientation Tracking and 3D Movement Visualization on an Avatar",
    "abstract": "Recent studies confirm the applicability of Inertial Measurement Unit (IMU)-based systems for human motion analysis. Notwithstanding, high-end IMU-based commercial solutions are yet too expensive and complex to democratize their use among a wide range of potential users. Less featured entry-level commercial solutions are being introduced in the market, trying to fill this gap, but still present some limitations that need to be overcome. At the same time, there is a growing number of scientific papers using not commercial, but custom do-it-yourself IMU-based systems in medical and sports applications. Even though these solutions can help to popularize the use of this technology, they have more limited features and the description on how to design and build them from scratch is yet too scarce in the literature. The aim of this work is two-fold: (1) Proving the feasibility of building an affordable custom solution aimed at simultaneous multiple body parts orientation tracking; while providing a detailed bottom-up description of the required hardware, tools, and mathematical operations to estimate and represent 3D movement in real-time. (2) Showing how the introduction of a custom 2.4 GHz communication protocol including a channel hopping strategy can address some of the current communication limitations of entry-level commercial solutions. The proposed system can be used for wireless real-time human body parts orientation tracking with up to 10 custom sensors, at least at 50 Hz. In addition, it provides a more reliable motion data acquisition in Bluetooth and Wi-Fi crowded environments, where the use of entry-level commercial solutions might be unfeasible. This system can be used as a groundwork for developing affordable human motion analysis solutions that do not require an accurate kinematic analysis. ",
    "url": "https://arxiv.org/abs/2402.09459",
    "authors": [
      "Javier González-Alonso",
      "David Oviedo-Pastor",
      "Héctor J. Aguado",
      "Francisco J. Díaz-Pernas",
      "David González-Ortega",
      "Mario Martínez-Zarzuela"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09461",
    "title": "A Novel Approach to WaveNet Architecture for RF Signal Separation with  Learnable Dilation and Data Augmentation",
    "abstract": "In this paper, we address the intricate issue of RF signal separation by presenting a novel adaptation of the WaveNet architecture that introduces learnable dilation parameters, significantly enhancing signal separation in dense RF spectrums. Our focused architectural refinements and innovative data augmentation strategies have markedly improved the model's ability to discern complex signal sources. This paper details our comprehensive methodology, including the refined model architecture, data preparation techniques, and the strategic training strategy that have been pivotal to our success. The efficacy of our approach is evidenced by the substantial improvements recorded: a 58.82\\% increase in SINR at a BER of $10^{-3}$ for OFDM-QPSK with EMI Signal 1, surpassing traditional benchmarks. Notably, our model achieved first place in the challenge \\cite{datadrivenrf2024}, demonstrating its superior performance and establishing a new standard for machine learning applications within the RF communications domain. ",
    "url": "https://arxiv.org/abs/2402.09461",
    "authors": [
      "Yu Tian",
      "Ahmed Alhammadi",
      "Abdullah Quran",
      "Abubakar Sani Ali"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09464",
    "title": "Different Algorithms (Might) Uncover Different Patterns: A Brain-Age  Prediction Case Study",
    "abstract": "Machine learning is a rapidly evolving field with a wide range of applications, including biological signal analysis, where novel algorithms often improve the state-of-the-art. However, robustness to algorithmic variability - measured by different algorithms, consistently uncovering similar findings - is seldom explored. In this paper we investigate whether established hypotheses in brain-age prediction from EEG research validate across algorithms. First, we surveyed literature and identified various features known to be informative for brain-age prediction. We employed diverse feature extraction techniques, processing steps, and models, and utilized the interpretative power of SHapley Additive exPlanations (SHAP) values to align our findings with the existing research in the field. Few of our models achieved state-of-the-art performance on the specific data-set we utilized. Moreover, analysis demonstrated that while most models do uncover similar patterns in the EEG signals, some variability could still be observed. Finally, a few prominent findings could only be validated using specific models. We conclude by suggesting remedies to the potential implications of this lack of robustness to model variability. ",
    "url": "https://arxiv.org/abs/2402.09464",
    "authors": [
      "Tobias Ettling",
      "Sari Saba-Sadiya",
      "Gemma Roig"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2402.09474",
    "title": "Deciphering Heartbeat Signatures: A Vision Transformer Approach to  Explainable Atrial Fibrillation Detection from ECG Signals",
    "abstract": "Remote patient monitoring based on wearable single-lead electrocardiogram (ECG) devices has significant potential for enabling the early detection of heart disease, especially in combination with artificial intelligence (AI) approaches for automated heart disease detection. There have been prior studies applying AI approaches based on deep learning for heart disease detection. However, these models are yet to be widely accepted as a reliable aid for clinical diagnostics, in part due to the current black-box perception surrounding many AI algorithms. In particular, there is a need to identify the key features of the ECG signal that contribute toward making an accurate diagnosis, thereby enhancing the interpretability of the model. In the present study, we develop a vision transformer approach to identify atrial fibrillation based on single-lead ECG data. A residual network (ResNet) approach is also developed for comparison with the vision transformer approach. These models are applied to the Chapman-Shaoxing dataset to classify atrial fibrillation, as well as another common arrhythmia, sinus bradycardia, and normal sinus rhythm heartbeats. The models enable the identification of the key regions of the heartbeat that determine the resulting classification, and highlight the importance of P-waves and T-waves, as well as heartbeat duration and signal amplitude, in distinguishing normal sinus rhythm from atrial fibrillation and sinus bradycardia. ",
    "url": "https://arxiv.org/abs/2402.09474",
    "authors": [
      "Aruna Mohan",
      "Danne Elbers",
      "Or Zilbershot",
      "Fatemeh Afghah",
      "David Vorchheimer"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09495",
    "title": "On the Potential of Network-Based Features for Fraud Detection",
    "abstract": "Online transaction fraud presents substantial challenges to businesses and consumers, risking significant financial losses. Conventional rule-based systems struggle to keep pace with evolving fraud tactics, leading to high false positive rates and missed detections. Machine learning techniques offer a promising solution by leveraging historical data to identify fraudulent patterns. This article explores using the personalised PageRank (PPR) algorithm to capture the social dynamics of fraud by analysing relationships between financial accounts. The primary objective is to compare the performance of traditional features with the addition of PPR in fraud detection models. Results indicate that integrating PPR enhances the model's predictive power, surpassing the baseline model. Additionally, the PPR feature provides unique and valuable information, evidenced by its high feature importance score. Feature stability analysis confirms consistent feature distributions across training and test datasets. ",
    "url": "https://arxiv.org/abs/2402.09495",
    "authors": [
      "Catayoun Azarm",
      "Erman Acar",
      "Mickey van Zeelt"
    ],
    "subjectives": [
      "Risk Management (q-fin.RM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09567",
    "title": "TAI-GAN: A Temporally and Anatomically Informed Generative Adversarial  Network for early-to-late frame conversion in dynamic cardiac PET inter-frame  motion correction",
    "abstract": "Inter-frame motion in dynamic cardiac positron emission tomography (PET) using rubidium-82 (82-Rb) myocardial perfusion imaging impacts myocardial blood flow (MBF) quantification and the diagnosis accuracy of coronary artery diseases. However, the high cross-frame distribution variation due to rapid tracer kinetics poses a considerable challenge for inter-frame motion correction, especially for early frames where intensity-based image registration techniques often fail. To address this issue, we propose a novel method called Temporally and Anatomically Informed Generative Adversarial Network (TAI-GAN) that utilizes an all-to-one mapping to convert early frames into those with tracer distribution similar to the last reference frame. The TAI-GAN consists of a feature-wise linear modulation layer that encodes channel-wise parameters generated from temporal information and rough cardiac segmentation masks with local shifts that serve as anatomical information. Our proposed method was evaluated on a clinical 82-Rb PET dataset, and the results show that our TAI-GAN can produce converted early frames with high image quality, comparable to the real reference frames. After TAI-GAN conversion, the motion estimation accuracy and subsequent myocardial blood flow (MBF) quantification with both conventional and deep learning-based motion correction methods were improved compared to using the original frames. ",
    "url": "https://arxiv.org/abs/2402.09567",
    "authors": [
      "Xueqi Guo",
      "Luyao Shi",
      "Xiongchao Chen",
      "Qiong Liu",
      "Bo Zhou",
      "Huidong Xie",
      "Yi-Hwa Liu",
      "Richard Palyo",
      "Edward J. Miller",
      "Albert J. Sinusas",
      "Lawrence H. Staib",
      "Bruce Spottiswoode",
      "Chi Liu",
      "Nicha C. Dvornek"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.09623",
    "title": "Conformalized Adaptive Forecasting of Heterogeneous Trajectories",
    "abstract": "This paper presents a new conformal method for generating simultaneous forecasting bands guaranteed to cover the entire path of a new random trajectory with sufficiently high probability. Prompted by the need for dependable uncertainty estimates in motion planning applications where the behavior of diverse objects may be more or less unpredictable, we blend different techniques from online conformal prediction of single and multiple time series, as well as ideas for addressing heteroscedasticity in regression. This solution is both principled, providing precise finite-sample guarantees, and effective, often leading to more informative predictions than prior methods. ",
    "url": "https://arxiv.org/abs/2402.09623",
    "authors": [
      "Yanfei Zhou",
      "Lars Lindemann",
      "Matteo Sesia"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09754",
    "title": "Robust SVD Made Easy: A fast and reliable algorithm for large-scale data  analysis",
    "abstract": "The singular value decomposition (SVD) is a crucial tool in machine learning and statistical data analysis. However, it is highly susceptible to outliers in the data matrix. Existing robust SVD algorithms often sacrifice speed for robustness or fail in the presence of only a few outliers. This study introduces an efficient algorithm, called Spherically Normalized SVD, for robust SVD approximation that is highly insensitive to outliers, computationally scalable, and provides accurate approximations of singular vectors. The proposed algorithm achieves remarkable speed by utilizing only two applications of a standard reduced-rank SVD algorithm to appropriately scaled data, significantly outperforming competing algorithms in computation times. To assess the robustness of the approximated singular vectors and their subspaces against data contamination, we introduce new notions of breakdown points for matrix-valued input, including row-wise, column-wise, and block-wise breakdown points. Theoretical and empirical analyses demonstrate that our algorithm exhibits higher breakdown points compared to standard SVD and its modifications. We empirically validate the effectiveness of our approach in applications such as robust low-rank approximation and robust principal component analysis of high-dimensional microarray datasets. Overall, our study presents a highly efficient and robust solution for SVD approximation that overcomes the limitations of existing algorithms in the presence of outliers. ",
    "url": "https://arxiv.org/abs/2402.09754",
    "authors": [
      "Sangil Han",
      "Kyoowon Kim",
      "Sungkyu Jung"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2402.09804",
    "title": "Coevolution of relationship and interaction in cooperative dynamical  multiplex networks",
    "abstract": "While actors in a population can interact with anyone else freely, social relations significantly influence our inclination towards particular individuals. The consequence of such interactions, however, may also form the intensity of our relations established earlier. These dynamical processes are captured via a coevolutionary model staged in multiplex networks with two distinct layers. In a so-called relationship layer the weights of edges among players may change in time as a consequence of games played in the alternative interaction layer. As an reasonable assumption, bilateral cooperation confirms while mutual defection weakens these weight factors. Importantly, the fitness of a player, which basically determines the success of a strategy imitation, depends not only on the payoff collected from interactions, but also on the individual relationship index calculated from the mentioned weight factors of related edges. Within the framework of weak prisoner's dilemma situation we explore the potential outcomes of the mentioned coevolutionary process where we assume different topologies for relationship layer. We find that higher average degree of the relationship graph is more beneficial to maintain cooperation in regular graphs, but the randomness of links could be a decisive factor in harsh situations. Surprisingly, a stronger coupling between relationship index and fitness discourage the evolution of cooperation by weakening the direct consequence of a strategy change. To complete our study we also monitor how the distribution of relationship index vary and detect a strong relation between its polarization and the general cooperation level. ",
    "url": "https://arxiv.org/abs/2402.09804",
    "authors": [
      "Xiaojin Xiong",
      "Ziyan Zeng",
      "Minyu Feng",
      "Attila Szolnoki"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Computer Science and Game Theory (cs.GT)",
      "Pattern Formation and Solitons (nlin.PS)"
    ]
  },
  {
    "id": "arXiv:2402.09948",
    "title": "Neural 5G Indoor Localization with IMU Supervision",
    "abstract": "Radio signals are well suited for user localization because they are ubiquitous, can operate in the dark and maintain privacy. Many prior works learn mappings between channel state information (CSI) and position fully-supervised. However, that approach relies on position labels which are very expensive to acquire. In this work, this requirement is relaxed by using pseudo-labels during deployment, which are calculated from an inertial measurement unit (IMU). We propose practical algorithms for IMU double integration and training of the localization system. We show decimeter-level accuracy on simulated and challenging real data of 5G measurements. Our IMU-supervised method performs similarly to fully-supervised, but requires much less effort to deploy. ",
    "url": "https://arxiv.org/abs/2402.09948",
    "authors": [
      "Aleksandr Ermolov",
      "Shreya Kadambi",
      "Maximilian Arnold",
      "Mohammed Hirzallah",
      "Roohollah Amiri",
      "Deepak Singh Mahendar Singh",
      "Srinivas Yerramalli",
      "Daniel Dijkman",
      "Fatih Porikli",
      "Taesang Yoo",
      "Bence Major"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10026",
    "title": "Hybrid CNN Bi-LSTM neural network for Hyperspectral image classification",
    "abstract": "Hyper spectral images have drawn the attention of the researchers for its complexity to classify. It has nonlinear relation between the materials and the spectral information provided by the HSI image. Deep learning methods have shown superiority in learning this nonlinearity in comparison to traditional machine learning methods. Use of 3-D CNN along with 2-D CNN have shown great success for learning spatial and spectral features. However, it uses comparatively large number of parameters. Moreover, it is not effective to learn inter layer information. Hence, this paper proposes a neural network combining 3-D CNN, 2-D CNN and Bi-LSTM. The performance of this model has been tested on Indian Pines(IP) University of Pavia(PU) and Salinas Scene(SA) data sets. The results are compared with the state of-the-art deep learning-based models. This model performed better in all three datasets. It could achieve 99.83, 99.98 and 100 percent accuracy using only 30 percent trainable parameters of the state-of-art model in IP, PU and SA datasets respectively. ",
    "url": "https://arxiv.org/abs/2402.10026",
    "authors": [
      "Alok Ranjan Sahoo",
      "Pavan Chakraborty"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.10055",
    "title": "Robust semi-automatic vessel tracing in the human retinal image by an  instance segmentation neural network",
    "abstract": "The morphology and hierarchy of the vascular systems are essential for perfusion in supporting metabolism. In human retina, one of the most energy-demanding organs, retinal circulation nourishes the entire inner retina by an intricate vasculature emerging and remerging at the optic nerve head (ONH). Thus, tracing the vascular branching from ONH through the vascular tree can illustrate vascular hierarchy and allow detailed morphological quantification, and yet remains a challenging task. Here, we presented a novel approach for a robust semi-automatic vessel tracing algorithm on human fundus images by an instance segmentation neural network (InSegNN). Distinct from semantic segmentation, InSegNN separates and labels different vascular trees individually and therefore enable tracing each tree throughout its branching. We have built-in three strategies to improve robustness and accuracy with temporal learning, spatial multi-sampling, and dynamic probability map. We achieved 83% specificity, and 50% improvement in Symmetric Best Dice (SBD) compared to literature, and outperformed baseline U-net. We have demonstrated tracing individual vessel trees from fundus images, and simultaneously retain the vessel hierarchy information. InSegNN paves a way for any subsequent morphological analysis of vascular morphology in relation to retinal diseases. ",
    "url": "https://arxiv.org/abs/2402.10055",
    "authors": [
      "Siyi Chen",
      "Amir H. Kashani",
      "Ji Yi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.10071",
    "title": "Approximate Message Passing-Enhanced Graph Neural Network for OTFS Data  Detection",
    "abstract": "Orthogonal time frequency space (OTFS) modulation has emerged as a promising solution to support high-mobility wireless communications, for which, cost-effective data detectors are critical. Although graph neural network (GNN)-based data detectors can achieve decent detection accuracy at reasonable computation cost, they fail to best harness prior information of transmitted data. To further minimize the data detection error of OTFS systems, this letter develops an AMP-GNN-based detector, leveraging the approximate message passing (AMP) algorithm to iteratively improve the symbol estimates of a GNN. Given the inter-Doppler interference (IDI) symbols incur substantial computational overhead to the constructed GNN, learning-based IDI approximation is implemented to sustain low detection complexity. Simulation results demonstrate a remarkable bit error rate (BER) performance achieved by the proposed AMP-GNN-based detector compared to existing baselines. Meanwhile, the proposed IDI approximation scheme avoids a large amount of computations with negligible BER degradation. ",
    "url": "https://arxiv.org/abs/2402.10071",
    "authors": [
      "Wenhao Zhuang",
      "Yuyi Mao",
      "Hengtao He",
      "Lei Xie",
      "Shenghui Song",
      "Yao Ge",
      "Zhi Ding"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2402.10127",
    "title": "Nonlinear spiked covariance matrices and signal propagation in deep  neural networks",
    "abstract": "Many recent works have studied the eigenvalue spectrum of the Conjugate Kernel (CK) defined by the nonlinear feature map of a feedforward neural network. However, existing results only establish weak convergence of the empirical eigenvalue distribution, and fall short of providing precise quantitative characterizations of the ''spike'' eigenvalues and eigenvectors that often capture the low-dimensional signal structure of the learning problem. In this work, we characterize these signal eigenvalues and eigenvectors for a nonlinear version of the spiked covariance model, including the CK as a special case. Using this general result, we give a quantitative description of how spiked eigenstructure in the input data propagates through the hidden layers of a neural network with random weights. As a second application, we study a simple regime of representation learning where the weight matrix develops a rank-one signal component over training and characterize the alignment of the target function with the spike eigenvector of the CK on test data. ",
    "url": "https://arxiv.org/abs/2402.10127",
    "authors": [
      "Zhichao Wang",
      "Denny Wu",
      "Zhou Fan"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2204.09092",
    "title": "Indiscriminate Data Poisoning Attacks on Neural Networks",
    "abstract": " Comments: Accepted to TMLR in 2022 ",
    "url": "https://arxiv.org/abs/2204.09092",
    "authors": [
      "Yiwei Lu",
      "Gautam Kamath",
      "Yaoliang Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2207.06944",
    "title": "Differentially Private Graph Learning via Sensitivity-Bounded  Personalized PageRank",
    "abstract": " Title: Differentially Private Graph Learning via Sensitivity-Bounded  Personalized PageRank ",
    "url": "https://arxiv.org/abs/2207.06944",
    "authors": [
      "Alessandro Epasto",
      "Vahab Mirrokni",
      "Bryan Perozzi",
      "Anton Tsitsulin",
      "Peilin Zhong"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.00963",
    "title": "FrOoDo: Framework for Out-of-Distribution Detection",
    "abstract": " Title: FrOoDo: Framework for Out-of-Distribution Detection ",
    "url": "https://arxiv.org/abs/2208.00963",
    "authors": [
      "Jonathan Stieber",
      "Moritz Fuchs",
      "Anirban Mukhopadhyay"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.02200",
    "title": "Task-wise Sampling Convolutions for Arbitrary-Oriented Object Detection  in Aerial Images",
    "abstract": " Comments: 15 pages, 13 figures, 11 tables ",
    "url": "https://arxiv.org/abs/2209.02200",
    "authors": [
      "Zhanchao Huang",
      "Wei Li",
      "Xiang-Gen Xia",
      "Hao Wang",
      "Ran Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.09022",
    "title": "Label-Efficient Object Detection via Region Proposal Network  Pre-Training",
    "abstract": " Comments: Accepted by Neurocomputing ",
    "url": "https://arxiv.org/abs/2211.09022",
    "authors": [
      "Nanqing Dong",
      "Linus Ericsson",
      "Yongxin Yang",
      "Ales Leonardis",
      "Steven McDonagh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.00462",
    "title": "A Latent Space Correlation-Aware Autoencoder for Anomaly Detection in  Skewed Data",
    "abstract": " Title: A Latent Space Correlation-Aware Autoencoder for Anomaly Detection in  Skewed Data ",
    "url": "https://arxiv.org/abs/2301.00462",
    "authors": [
      "Padmaksha Roy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.02133",
    "title": "A note on highly connected $K_{2,\\ell}$-minor free graphs",
    "abstract": " Title: A note on highly connected $K_{2,\\ell}$-minor free graphs ",
    "url": "https://arxiv.org/abs/2301.02133",
    "authors": [
      "Nicolas Bousquet",
      "Théo Pierron",
      "Alexandra Wesolek"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2301.04943",
    "title": "Robust Nonlinear Optimal Control via System Level Synthesis",
    "abstract": " Comments: submitted to IEEE Transactions on Automatic Control (TAC) ",
    "url": "https://arxiv.org/abs/2301.04943",
    "authors": [
      "Antoine P. Leeman",
      "Johannes Köhler",
      "Andrea Zanelli",
      "Samir Bennani",
      "Melanie N. Zeilinger"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.04944",
    "title": "Learning Complex Teamwork Tasks Using a Given Sub-task Decomposition",
    "abstract": " Title: Learning Complex Teamwork Tasks Using a Given Sub-task Decomposition ",
    "url": "https://arxiv.org/abs/2302.04944",
    "authors": [
      "Elliot Fosong",
      "Arrasy Rahman",
      "Ignacio Carlucho",
      "Stefano V. Albrecht"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.04315",
    "title": "Microseismic source imaging using physics-informed neural networks with  hard constraints",
    "abstract": " Comments: IEEE Transactions on Geoscience and Remote Sensing 2024 ",
    "url": "https://arxiv.org/abs/2304.04315",
    "authors": [
      "Xinquan Huang",
      "Tariq Alkhalifah"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2305.15244",
    "title": "Neural Lyapunov and Optimal Control",
    "abstract": " Title: Neural Lyapunov and Optimal Control ",
    "url": "https://arxiv.org/abs/2305.15244",
    "authors": [
      "Daniel Layeghi",
      "Steve Tonneau",
      "Michael Mistry"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.15508",
    "title": "How to Fix a Broken Confidence Estimator: Evaluating Post-hoc Methods  for Selective Classification with Deep Neural Networks",
    "abstract": " Title: How to Fix a Broken Confidence Estimator: Evaluating Post-hoc Methods  for Selective Classification with Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2305.15508",
    "authors": [
      "Luís Felipe P. Cattelan",
      "Danilo Silva"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.17000",
    "title": "DistriBlock: Identifying adversarial audio samples by leveraging  characteristics of the output distribution",
    "abstract": " Title: DistriBlock: Identifying adversarial audio samples by leveraging  characteristics of the output distribution ",
    "url": "https://arxiv.org/abs/2305.17000",
    "authors": [
      "Matías P. Pizarro B.",
      "Dorothea Kolossa",
      "Asja Fischer"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.04689",
    "title": "Multiscale Flow for Robust and Optimal Cosmological Analysis",
    "abstract": " Comments: 14 pages, 7 figures. Comments welcome ",
    "url": "https://arxiv.org/abs/2306.04689",
    "authors": [
      "Biwei Dai",
      "Uros Seljak"
    ],
    "subjectives": [
      "Cosmology and Nongalactic Astrophysics (astro-ph.CO)",
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2306.09739",
    "title": "Stabilized Neural Differential Equations for Learning Dynamics with  Explicit Constraints",
    "abstract": " Comments: 22 pages, 8 figures. Accepted at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2306.09739",
    "authors": [
      "Alistair White",
      "Niki Kilbertus",
      "Maximilian Gelbrecht",
      "Niklas Boers"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2306.14291",
    "title": "Hyp-OW: Exploiting Hierarchical Structure Learning with Hyperbolic  Distance Enhances Open World Object Detection",
    "abstract": " Comments: Accepted at AAAI 2024 || keywords: Open World Object Detection, Hyperbolic Distance, Unknown Detection, Deformable Transformers, Hierarchical Representation Learning ",
    "url": "https://arxiv.org/abs/2306.14291",
    "authors": [
      "Thang Doan",
      "Xin Li",
      "Sima Behpour",
      "Wenbin He",
      "Liang Gou",
      "Liu Ren"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.16958",
    "title": "Identifiability of Direct Effects from Summary Causal Graphs",
    "abstract": " Title: Identifiability of Direct Effects from Summary Causal Graphs ",
    "url": "https://arxiv.org/abs/2306.16958",
    "authors": [
      "Simon Ferreira",
      "Charles K. Assaad"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.02591",
    "title": "ODD: A Benchmark Dataset for the NLP-based Opioid Related Aberrant  Behavior Detection",
    "abstract": " Comments: Under review ",
    "url": "https://arxiv.org/abs/2307.02591",
    "authors": [
      "Sunjae Kwon",
      "Xun Wang",
      "Weisong Liu",
      "Emily Druhl",
      "Minhee L. Sung",
      "Joel I. Reisman",
      "Wenjun Li",
      "Robert D. Kerns",
      "William Becker",
      "Hong Yu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.10187",
    "title": "Personalized Privacy Amplification via Importance Sampling",
    "abstract": " Comments: Preprint. Under review ",
    "url": "https://arxiv.org/abs/2307.10187",
    "authors": [
      "Dominik Fay",
      "Sebastian Mair",
      "Jens Sjölund"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.13912",
    "title": "Embedding Democratic Values into Social Media AIs via Societal Objective  Functions",
    "abstract": " Comments: This paper has been accepted to CSCW 2024 and will be published in Proc. ACM Hum.-Comput. Interact. 8, CSCW1, Article 163 (April 2024) ",
    "url": "https://arxiv.org/abs/2307.13912",
    "authors": [
      "Chenyan Jia",
      "Michelle S. Lam",
      "Minh Chau Mai",
      "Jeff Hancock",
      "Michael S. Bernstein"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.15154",
    "title": "A/B Testing and Best-arm Identification for Linear Bandits with  Robustness to Non-stationarity",
    "abstract": " Comments: 25 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2307.15154",
    "authors": [
      "Zhihan Xiong",
      "Romain Camilleri",
      "Maryam Fazel",
      "Lalit Jain",
      "Kevin Jamieson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.03306",
    "title": "Implicit Graph Neural Diffusion Networks: Convergence, Generalization,  and Over-Smoothing",
    "abstract": " Comments: 57 pages ",
    "url": "https://arxiv.org/abs/2308.03306",
    "authors": [
      "Guoji Fu",
      "Mohammed Haroon Dupty",
      "Yanfei Dong",
      "Lee Wee Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.10044",
    "title": "A simple counting rule to evaluate directionality of arbitrary rail  networks",
    "abstract": " Title: A simple counting rule to evaluate directionality of arbitrary rail  networks ",
    "url": "https://arxiv.org/abs/2308.10044",
    "authors": [
      "Dai Akita",
      "Daniel Thorsten Schenz"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2308.12969",
    "title": "ROAM: Robust and Object-Aware Motion Generation Using Neural Pose  Descriptors",
    "abstract": " Comments: 14 pages, 11 figures; project page: this https URL ",
    "url": "https://arxiv.org/abs/2308.12969",
    "authors": [
      "Wanyue Zhang",
      "Rishabh Dabral",
      "Thomas Leimkühler",
      "Vladislav Golyanik",
      "Marc Habermann",
      "Christian Theobalt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.00557",
    "title": "Concentrated Differential Privacy for Bandits",
    "abstract": " Comments: Appears in IEEE SaTML 2024 ",
    "url": "https://arxiv.org/abs/2309.00557",
    "authors": [
      "Achraf Azize",
      "Debabrota Basu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2309.03447",
    "title": "Broadband Ground Motion Synthesis via Generative Adversarial Neural  Operators: Development and Validation",
    "abstract": " Title: Broadband Ground Motion Synthesis via Generative Adversarial Neural  Operators: Development and Validation ",
    "url": "https://arxiv.org/abs/2309.03447",
    "authors": [
      "Yaozhong Shi",
      "Grigorios Lavrentiadis",
      "Domniki Asimaki",
      "Zachary E. Ross",
      "Kamyar Azizzadenesheli"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.10652",
    "title": "Nonlinear dynamic analysis of shear- and torsion-free rods using  isogeometric discretization, outlier removal and robust time integration",
    "abstract": " Title: Nonlinear dynamic analysis of shear- and torsion-free rods using  isogeometric discretization, outlier removal and robust time integration ",
    "url": "https://arxiv.org/abs/2309.10652",
    "authors": [
      "Thi-Hoa Nguyen",
      "Bruno A. Roccia",
      "René R. Hiemstra",
      "Cristian G. Gebhardt",
      "Dominik Schillinger"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2309.14053",
    "title": "Revisiting LARS for Large Batch Training Generalization of Neural  Networks",
    "abstract": " Title: Revisiting LARS for Large Batch Training Generalization of Neural  Networks ",
    "url": "https://arxiv.org/abs/2309.14053",
    "authors": [
      "Khoi Do",
      "Duong Nguyen",
      "Hoa Nguyen",
      "Long Tran-Thanh",
      "Nguyen-Hoang Tran",
      "Quoc-Viet Pham"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.00938",
    "title": "An FPRAS for two terminal reliability in directed acyclic graphs",
    "abstract": " Comments: 30 pages. v3: improved presentation ",
    "url": "https://arxiv.org/abs/2310.00938",
    "authors": [
      "Weiming Feng",
      "Heng Guo"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2310.06379",
    "title": "Initialization Bias of Fourier Neural Operator: Revisiting the Edge of  Chaos",
    "abstract": " Title: Initialization Bias of Fourier Neural Operator: Revisiting the Edge of  Chaos ",
    "url": "https://arxiv.org/abs/2310.06379",
    "authors": [
      "Takeshi Koshizuka",
      "Masahiro Fujisawa",
      "Yusuke Tanaka",
      "Issei Sato"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.09298",
    "title": "ByteStack-ID: Integrated Stacked Model Leveraging Payload Byte Frequency  for Grayscale Image-based Network Intrusion Detection",
    "abstract": " Comments: 6 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2310.09298",
    "authors": [
      "Irfan Khan",
      "Yasir Ali Farrukh",
      "Syed Wali"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11787",
    "title": "NeuroCUT: A Neural Approach for Robust Graph Partitioning",
    "abstract": " Title: NeuroCUT: A Neural Approach for Robust Graph Partitioning ",
    "url": "https://arxiv.org/abs/2310.11787",
    "authors": [
      "Rishi Shah",
      "Krishnanshu Jain",
      "Sahil Manchanda",
      "Sourav Medya",
      "Sayan Ranu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.12595",
    "title": "Meta-Learning With Hierarchical Models Based on Similarity of Causal  Mechanisms",
    "abstract": " Title: Meta-Learning With Hierarchical Models Based on Similarity of Causal  Mechanisms ",
    "url": "https://arxiv.org/abs/2310.12595",
    "authors": [
      "Sophie Wharrie",
      "Samuel Kaski"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.16955",
    "title": "Break it, Imitate it, Fix it: Robustness by Generating Human-Like  Attacks",
    "abstract": " Title: Break it, Imitate it, Fix it: Robustness by Generating Human-Like  Attacks ",
    "url": "https://arxiv.org/abs/2310.16955",
    "authors": [
      "Aradhana Sinha",
      "Ananth Balashankar",
      "Ahmad Beirami",
      "Thi Avrahami",
      "Jilin Chen",
      "Alex Beutel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.01591",
    "title": "Better Fair than Sorry: Adversarial Missing Data Imputation for Fair  GNNs",
    "abstract": " Title: Better Fair than Sorry: Adversarial Missing Data Imputation for Fair  GNNs ",
    "url": "https://arxiv.org/abs/2311.01591",
    "authors": [
      "Debolina Halder Lina",
      "Arlei Silva"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.12356",
    "title": "Random Linear Projections Loss for Hyperplane-Based Optimization in  Neural Networks",
    "abstract": " Title: Random Linear Projections Loss for Hyperplane-Based Optimization in  Neural Networks ",
    "url": "https://arxiv.org/abs/2311.12356",
    "authors": [
      "Shyam Venkatasubramanian",
      "Ahmed Aloui",
      "Vahid Tarokh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.13681",
    "title": "Compact 3D Gaussian Representation for Radiance Field",
    "abstract": " Comments: Project page: this http URL ",
    "url": "https://arxiv.org/abs/2311.13681",
    "authors": [
      "Joo Chan Lee",
      "Daniel Rho",
      "Xiangyu Sun",
      "Jong Hwan Ko",
      "Eunbyung Park"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2311.17978",
    "title": "AutArch: An AI-assisted workflow for object detection and automated  recording in archaeological catalogues",
    "abstract": " Title: AutArch: An AI-assisted workflow for object detection and automated  recording in archaeological catalogues ",
    "url": "https://arxiv.org/abs/2311.17978",
    "authors": [
      "Kevin Klein",
      "Alyssa Wohde",
      "Alexander V. Gorelik",
      "Volker Heyd",
      "Ralf Lämmel",
      "Yoan Diekmann",
      "Maxime Brami"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.05119",
    "title": "Quantifying white matter hyperintensity and brain volumes in  heterogeneous clinical and low-field portable MRI",
    "abstract": " Title: Quantifying white matter hyperintensity and brain volumes in  heterogeneous clinical and low-field portable MRI ",
    "url": "https://arxiv.org/abs/2312.05119",
    "authors": [
      "Pablo Laso",
      "Stefano Cerri",
      "Annabel Sorby-Adams",
      "Jennifer Guo",
      "Farrah Mateen",
      "Philipp Goebl",
      "Jiaming Wu",
      "Peirong Liu",
      "Hongwei Li",
      "Sean I. Young",
      "Benjamin Billot",
      "Oula Puonti",
      "Gordon Sze",
      "Sam Payabavash",
      "Adam DeHavenon",
      "Kevin N. Sheth",
      "Matthew S. Rosen",
      "John Kirsch",
      "Nicola Strisciuglio",
      "Jelmer M. Wolterink",
      "Arman Eshaghi",
      "Frederik Barkhof",
      "W. Taylor Kimberly",
      "Juan Eugenio Iglesias"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.10594",
    "title": "Physics-Informed Representation and Learning: Control and Risk  Quantification",
    "abstract": " Comments: Accepted at the AAAI 24 conference ",
    "url": "https://arxiv.org/abs/2312.10594",
    "authors": [
      "Zhuoyuan Wang",
      "Reece Keller",
      "Xiyu Deng",
      "Kenta Hoshino",
      "Takashi Tanaka",
      "Yorie Nakahira"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2312.10913",
    "title": "GINN-LP: A Growing Interpretable Neural Network for Discovering  Multivariate Laurent Polynomial Equations",
    "abstract": " Comments: 14 pages, 12 figures, Accepted by AAAI24 ",
    "url": "https://arxiv.org/abs/2312.10913",
    "authors": [
      "Nisal Ranasinghe",
      "Damith Senanayake",
      "Sachith Seneviratne",
      "Malin Premaratne",
      "Saman Halgamuge"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.11560",
    "title": "Learning from Emergence: A Study on Proactively Inhibiting the  Monosemantic Neurons of Artificial Neural Networks",
    "abstract": " Comments: 15 pages, 4 figures, conference ",
    "url": "https://arxiv.org/abs/2312.11560",
    "authors": [
      "Jiachuan Wang",
      "Shimin Di",
      "Lei Chen",
      "Charles Wang Wai Ng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2312.11581",
    "title": "Protect Your Score: Contact Tracing With Differential Privacy Guarantees",
    "abstract": " Comments: Accepted to The 38th Annual AAAI Conference on Artificial Intelligence (AAAI 2024) ",
    "url": "https://arxiv.org/abs/2312.11581",
    "authors": [
      "Rob Romijnders",
      "Christos Louizos",
      "Yuki M. Asano",
      "Max Welling"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.14188",
    "title": "Enhancing Neural Theorem Proving through Data Augmentation and Dynamic  Sampling Method",
    "abstract": " Title: Enhancing Neural Theorem Proving through Data Augmentation and Dynamic  Sampling Method ",
    "url": "https://arxiv.org/abs/2312.14188",
    "authors": [
      "Rahul Vishwakarma",
      "Subhankar Mishra"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2401.01505",
    "title": "Sports-QA: A Large-Scale Video Question Answering Benchmark for Complex  and Professional Sports",
    "abstract": " Title: Sports-QA: A Large-Scale Video Question Answering Benchmark for Complex  and Professional Sports ",
    "url": "https://arxiv.org/abs/2401.01505",
    "authors": [
      "Haopeng Li",
      "Andong Deng",
      "Qiuhong Ke",
      "Jun Liu",
      "Hossein Rahmani",
      "Yulan Guo",
      "Bernt Schiele",
      "Chen Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.06643",
    "title": "Effects of diversity incentives on sample diversity and downstream model  performance in LLM-based text augmentation",
    "abstract": " Comments: 24 pages, updated with new experimets - Mistral as downstream task classifier and new method combination (of taboo and hints methods) ",
    "url": "https://arxiv.org/abs/2401.06643",
    "authors": [
      "Jan Cegin",
      "Branislav Pecher",
      "Jakub Simko",
      "Ivan Srba",
      "Maria Bielikova",
      "Peter Brusilovsky"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.14681",
    "title": "MasonTigers@LT-EDI-2024: An Ensemble Approach Towards Detecting  Homophobia and Transphobia in Social Media Comments",
    "abstract": " Title: MasonTigers@LT-EDI-2024: An Ensemble Approach Towards Detecting  Homophobia and Transphobia in Social Media Comments ",
    "url": "https://arxiv.org/abs/2401.14681",
    "authors": [
      "Dhiman Goswami",
      "Sadiya Sayara Chowdhury Puspo",
      "Md Nishat Raihan",
      "Al Nahian Bin Emran"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.15857",
    "title": "Opinion Dynamics in Social Multiplex Networks with Mono and  Bi-directional Interactions in the Presence of Leaders",
    "abstract": " Title: Opinion Dynamics in Social Multiplex Networks with Mono and  Bi-directional Interactions in the Presence of Leaders ",
    "url": "https://arxiv.org/abs/2401.15857",
    "authors": [
      "Amirreza Talebi",
      "Sayed Pedram Haeri Boroujeni",
      "Abolfazl Razi"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2401.16785",
    "title": "HawkEye: Advancing Robust Regression with Bounded, Smooth, and  Insensitive Loss Function",
    "abstract": " Title: HawkEye: Advancing Robust Regression with Bounded, Smooth, and  Insensitive Loss Function ",
    "url": "https://arxiv.org/abs/2401.16785",
    "authors": [
      "Mushir Akhtar",
      "M. Tanveer",
      "Mohd. Arshad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.17809",
    "title": "SWEA: Changing Factual Knowledge in Large Language Models via Subject  Word Embedding Altering",
    "abstract": " Comments: Under review; Our code will be released ",
    "url": "https://arxiv.org/abs/2401.17809",
    "authors": [
      "Xiaopeng Li",
      "Shasha Li",
      "Shezheng Song",
      "Huijun Liu",
      "Bin Ji",
      "Xi Wang",
      "Jun Ma",
      "Jie Yu",
      "Xiaodong Liu",
      "Jing Wang",
      "Weimin Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.00176",
    "title": "Adversarial Quantum Machine Learning: An Information-Theoretic  Generalization Analysis",
    "abstract": " Comments: 10 pages, 2 figures. Fixed a typo (wrong inequality sign) in lemma 2 and extended to cover the whole range of values of p. Added reference on inequalities in trace norms ",
    "url": "https://arxiv.org/abs/2402.00176",
    "authors": [
      "Petros Georgiou",
      "Sharu Theresa Jose",
      "Osvaldo Simeone"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.02009",
    "title": "Robust Multi-Task Learning with Excess Risks",
    "abstract": " Title: Robust Multi-Task Learning with Excess Risks ",
    "url": "https://arxiv.org/abs/2402.02009",
    "authors": [
      "Yifei He",
      "Shiji Zhou",
      "Guojun Zhang",
      "Hyokun Yun",
      "Yi Xu",
      "Belinda Zeng",
      "Trishul Chilimbi",
      "Han Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.02037",
    "title": "EffiBench: Benchmarking the Efficiency of Automatically Generated Code",
    "abstract": " Comments: 26 pages, 13 figures, 18 tables ",
    "url": "https://arxiv.org/abs/2402.02037",
    "authors": [
      "Dong Huang",
      "Jie M.Zhang",
      "Yuhao Qing",
      "Heming Cui"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.04447",
    "title": "Context-Aware Spectrum Coexistence of Terrestrial Beyond 5G Networks in  Satellite Bands",
    "abstract": " Title: Context-Aware Spectrum Coexistence of Terrestrial Beyond 5G Networks in  Satellite Bands ",
    "url": "https://arxiv.org/abs/2402.04447",
    "authors": [
      "Ta Seen Reaz Niloy",
      "Zoheb Hasan",
      "Rob Smith",
      "Vikram R. Anapana",
      "Vijay K. Shah"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.05067",
    "title": "Multiscale Modelling with Physics-informed Neural Network: from  Large-scale Dynamics to Small-scale Predictions in Complex Systems",
    "abstract": " Title: Multiscale Modelling with Physics-informed Neural Network: from  Large-scale Dynamics to Small-scale Predictions in Complex Systems ",
    "url": "https://arxiv.org/abs/2402.05067",
    "authors": [
      "Jing Wang",
      "Zheng Li",
      "Pengyu Lai",
      "Rui Wang",
      "Di Yang",
      "Dewu Yang",
      "Hui Xu"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2402.05872",
    "title": "You've Got to Feel It To Believe It: Multi-Modal Bayesian Inference for  Semantic and Property Prediction",
    "abstract": " Title: You've Got to Feel It To Believe It: Multi-Modal Bayesian Inference for  Semantic and Property Prediction ",
    "url": "https://arxiv.org/abs/2402.05872",
    "authors": [
      "Parker Ewen",
      "Hao Chen",
      "Yuzhen Chen",
      "Anran Li",
      "Anup Bagali",
      "Gitesh Gunjal",
      "Ram Vasudevan"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2402.06808",
    "title": "Explain Variance of Prediction in Variational Time Series Models for  Clinical Deterioration Prediction",
    "abstract": " Title: Explain Variance of Prediction in Variational Time Series Models for  Clinical Deterioration Prediction ",
    "url": "https://arxiv.org/abs/2402.06808",
    "authors": [
      "Jiacheng Liu",
      "Jaideep Srivastava"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.07180",
    "title": "MAGNETO: Edge AI for Human Activity Recognition -- Privacy and  Personalization",
    "abstract": " Comments: Accepted by EDBT 2024 (demo track) ",
    "url": "https://arxiv.org/abs/2402.07180",
    "authors": [
      "Jingwei Zuo",
      "George Arvanitakis",
      "Mthandazo Ndhlovu",
      "Hakim Hacid"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.07738",
    "title": "Universal Link Predictor By In-Context Learning on Graphs",
    "abstract": " Comments: Preprint ",
    "url": "https://arxiv.org/abs/2402.07738",
    "authors": [
      "Kaiwen Dong",
      "Haitao Mao",
      "Zhichun Guo",
      "Nitesh V. Chawla"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.08090",
    "title": "Learning Neural Contracting Dynamics: Extended Linearization and Global  Guarantees",
    "abstract": " Comments: 9 pages, 3 figures. Under Review ",
    "url": "https://arxiv.org/abs/2402.08090",
    "authors": [
      "Sean Jaffe",
      "Alexander Davydov",
      "Deniz Lapsekili",
      "Ambuj Singh",
      "Francesco Bullo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2402.08595",
    "title": "Homomorphism Counts for Graph Neural Networks: All About That Basis",
    "abstract": " Title: Homomorphism Counts for Graph Neural Networks: All About That Basis ",
    "url": "https://arxiv.org/abs/2402.08595",
    "authors": [
      "Emily Jin",
      "Michael Bronstein",
      "Ismail Ilkan Ceylan",
      "Matthias Lanzinger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.08777",
    "title": "DNABERT-S: Learning Species-Aware DNA Embedding with Genome Foundation  Models",
    "abstract": " Title: DNABERT-S: Learning Species-Aware DNA Embedding with Genome Foundation  Models ",
    "url": "https://arxiv.org/abs/2402.08777",
    "authors": [
      "Zhihan Zhou",
      "Weimin Wu",
      "Harrison Ho",
      "Jiayi Wang",
      "Lizhen Shi",
      "Ramana V Davuluri",
      "Zhong Wang",
      "Han Liu"
    ],
    "subjectives": [
      "Genomics (q-bio.GN)",
      "Artificial Intelligence (cs.AI)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.08991",
    "title": "Towards Robust Model-Based Reinforcement Learning Against Adversarial  Corruption",
    "abstract": " Title: Towards Robust Model-Based Reinforcement Learning Against Adversarial  Corruption ",
    "url": "https://arxiv.org/abs/2402.08991",
    "authors": [
      "Chenlu Ye",
      "Jiafan He",
      "Quanquan Gu",
      "Tong Zhang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09094",
    "title": "Unity is Strength: Enhancing Precision in Reentrancy Vulnerability  Detection of Smart Contract Analysis Tools",
    "abstract": " Title: Unity is Strength: Enhancing Precision in Reentrancy Vulnerability  Detection of Smart Contract Analysis Tools ",
    "url": "https://arxiv.org/abs/2402.09094",
    "authors": [
      "Zexu Wang",
      "Jiachi Chen",
      "Zibin Zheng",
      "Peilin Zheng",
      "Yu Zhang",
      "Weizhe Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2402.09132",
    "title": "Exploring the Adversarial Capabilities of Large Language Models",
    "abstract": " Title: Exploring the Adversarial Capabilities of Large Language Models ",
    "url": "https://arxiv.org/abs/2402.09132",
    "authors": [
      "Lukas Struppek",
      "Minh Hieu Le",
      "Dominik Hintersdorf",
      "Kristian Kersting"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09234",
    "title": "Multi-Hierarchical Surrogate Learning for Structural Dynamical Crash  Simulations Using Graph Convolutional Neural Networks",
    "abstract": " Title: Multi-Hierarchical Surrogate Learning for Structural Dynamical Crash  Simulations Using Graph Convolutional Neural Networks ",
    "url": "https://arxiv.org/abs/2402.09234",
    "authors": [
      "Jonas Kneifl",
      "Jörg Fehr",
      "Steven L. Brunton",
      "J. Nathan Kutz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2402.09338",
    "title": "Neural Networks Asymptotic Behaviours for the Resolution of Inverse  Problems",
    "abstract": " Title: Neural Networks Asymptotic Behaviours for the Resolution of Inverse  Problems ",
    "url": "https://arxiv.org/abs/2402.09338",
    "authors": [
      "Luigi Del Debbio",
      "Manuel Naviglio",
      "Francesco Tarantelli"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Artificial Intelligence (cs.AI)",
      "High Energy Physics - Lattice (hep-lat)",
      "High Energy Physics - Theory (hep-th)"
    ]
  }
]