[
  {
    "id": "arXiv:2401.17319",
    "title": "Decentralized Federated Learning: A Survey on Security and Privacy",
    "abstract": "Federated learning has been rapidly evolving and gaining popularity in recent years due to its privacy-preserving features, among other advantages. Nevertheless, the exchange of model updates and gradients in this architecture provides new attack surfaces for malicious users of the network which may jeopardize the model performance and user and data privacy. For this reason, one of the main motivations for decentralized federated learning is to eliminate server-related threats by removing the server from the network and compensating for it through technologies such as blockchain. However, this advantage comes at the cost of challenging the system with new privacy threats. Thus, performing a thorough security analysis in this new paradigm is necessary. This survey studies possible variations of threats and adversaries in decentralized federated learning and overviews the potential defense mechanisms. Trustability and verifiability of decentralized federated learning are also considered in this study. ",
    "url": "https://arxiv.org/abs/2401.17319",
    "authors": [
      "Ehsan Hallaji",
      "Roozbeh Razavi-Far",
      "Mehrdad Saif",
      "Boyu Wang",
      "Qiang Yang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.17342",
    "title": "A Latent Space Metric for Enhancing Prediction Confidence in Earth  Observation Data",
    "abstract": "This study presents a new approach for estimating confidence in machine learning model predictions, specifically in regression tasks utilizing Earth Observation (EO) data, with a particular focus on mosquito abundance (MA) estimation. We take advantage of a Variational AutoEncoder architecture, to derive a confidence metric by the latent space representations of EO datasets. This methodology is pivotal in establishing a correlation between the Euclidean distance in latent representations and the Absolute Error (AE) in individual MA predictions. Our research focuses on EO datasets from the Veneto region in Italy and the Upper Rhine Valley in Germany, targeting areas significantly affected by mosquito populations. A key finding is a notable correlation of 0.46 between the AE of MA predictions and the proposed confidence metric. This correlation signifies a robust, new metric for quantifying the reliability and enhancing the trustworthiness of the AI model's predictions in the context of both EO data analysis and mosquito abundance studies. ",
    "url": "https://arxiv.org/abs/2401.17342",
    "authors": [
      "Ioannis Pitsiorlas",
      "Argyro Tsantalidou",
      "George Arvanitakis",
      "Marios Kountouris",
      "Charalambos Kontoes"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.17399",
    "title": "ATPPNet: Attention based Temporal Point cloud Prediction Network",
    "abstract": "Point cloud prediction is an important yet challenging task in the field of autonomous driving. The goal is to predict future point cloud sequences that maintain object structures while accurately representing their temporal motion. These predicted point clouds help in other subsequent tasks like object trajectory estimation for collision avoidance or estimating locations with the least odometry drift. In this work, we present ATPPNet, a novel architecture that predicts future point cloud sequences given a sequence of previous time step point clouds obtained with LiDAR sensor. ATPPNet leverages Conv-LSTM along with channel-wise and spatial attention dually complemented by a 3D-CNN branch for extracting an enhanced spatio-temporal context to recover high quality fidel predictions of future point clouds. We conduct extensive experiments on publicly available datasets and report impressive performance outperforming the existing methods. We also conduct a thorough ablative study of the proposed architecture and provide an application study that highlights the potential of our model for tasks like odometry estimation. ",
    "url": "https://arxiv.org/abs/2401.17399",
    "authors": [
      "Kaustab Pal",
      "Aditya Sharma",
      "Avinash Sharma",
      "K. Madhava Krishna"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.17404",
    "title": "ROAMER: Robust Offroad Autonomy using Multimodal State Estimation with  Radar Velocity Integration",
    "abstract": "Reliable offroad autonomy requires low-latency, high-accuracy state estimates of pose as well as velocity, which remain viable throughout environments with sub-optimal operating conditions for the utilized perception modalities. As state estimation remains a single point of failure system in the majority of aspiring autonomous systems, failing to address the environmental degradation the perception sensors could potentially experience given the operating conditions, can be a mission-critical shortcoming. In this work, a method for integration of radar velocity information in a LiDAR-inertial odometry solution is proposed, enabling consistent estimation performance even with degraded LiDAR-inertial odometry. The proposed method utilizes the direct velocity-measuring capabilities of an Frequency Modulated Continuous Wave (FMCW) radar sensor to enhance the LiDAR-inertial smoother solution onboard the vehicle through integration of the forward velocity measurement into the graph-based smoother. This leads to increased robustness in the overall estimation solution, even in the absence of LiDAR data. This method was validated by hardware experiments conducted onboard an all-terrain vehicle traveling at high speed, ~12 m/s, in demanding offroad environments. ",
    "url": "https://arxiv.org/abs/2401.17404",
    "authors": [
      "Morten Nissov",
      "Shehryar Khattak",
      "Jeffrey A. Edlund",
      "Curtis Padgett",
      "Kostas Alexis",
      "Patrick Spieler"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.17405",
    "title": "Camouflage Adversarial Attacks on Multiple Agent Systems",
    "abstract": "The multi-agent reinforcement learning systems (MARL) based on the Markov decision process (MDP) have emerged in many critical applications. To improve the robustness/defense of MARL systems against adversarial attacks, the study of various adversarial attacks on reinforcement learning systems is very important. Previous works on adversarial attacks considered some possible features to attack in MDP, such as the action poisoning attacks, the reward poisoning attacks, and the state perception attacks. In this paper, we propose a brand-new form of attack called the camouflage attack in the MARL systems. In the camouflage attack, the attackers change the appearances of some objects without changing the actual objects themselves; and the camouflaged appearances may look the same to all the targeted recipient (victim) agents. The camouflaged appearances can mislead the recipient agents to misguided actions. We design algorithms that give the optimal camouflage attacks minimizing the rewards of recipient agents. Our numerical and theoretical results show that camouflage attacks can rival the more conventional, but likely more difficult state perception attacks. We also investigate cost-constrained camouflage attacks and showed numerically how cost budgets affect the attack performance. ",
    "url": "https://arxiv.org/abs/2401.17405",
    "authors": [
      "Ziqing Lu",
      "Guanlin Liu",
      "Lifeng Lai",
      "Weiyu Xu"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2401.17435",
    "title": "Can Large Language Models Replace Economic Choice Prediction Labs?",
    "abstract": "Economic choice prediction is an essential challenging task, often constrained by the difficulties in acquiring human choice data. Indeed, experimental economics studies had focused mostly on simple choice settings. The AI community has recently contributed to that effort in two ways: considering whether LLMs can substitute for humans in the above-mentioned simple choice prediction settings, and the study through ML lens of more elaborated but still rigorous experimental economics settings, employing incomplete information, repetitive play, and natural language communication, notably language-based persuasion games. This leaves us with a major inspiration: can LLMs be used to fully simulate the economic environment and generate data for efficient human choice prediction, substituting for the elaborated economic lab studies? We pioneer the study of this subject, demonstrating its feasibility. In particular, we show that a model trained solely on LLM-generated data can effectively predict human behavior in a language-based persuasion game, and can even outperform models trained on actual human data. ",
    "url": "https://arxiv.org/abs/2401.17435",
    "authors": [
      "Eilam Shapira",
      "Omer Madmon",
      "Roi Reichart",
      "Moshe Tennenholtz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Science and Game Theory (cs.GT)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2401.17477",
    "title": "Detecting mental disorder on social media: a ChatGPT-augmented  explainable approach",
    "abstract": "In the digital era, the prevalence of depressive symptoms expressed on social media has raised serious concerns, necessitating advanced methodologies for timely detection. This paper addresses the challenge of interpretable depression detection by proposing a novel methodology that effectively combines Large Language Models (LLMs) with eXplainable Artificial Intelligence (XAI) and conversational agents like ChatGPT. In our methodology, explanations are achieved by integrating BERTweet, a Twitter-specific variant of BERT, into a novel self-explanatory model, namely BERT-XDD, capable of providing both classification and explanations via masked attention. The interpretability is further enhanced using ChatGPT to transform technical explanations into human-readable commentaries. By introducing an effective and modular approach for interpretable depression detection, our methodology can contribute to the development of socially responsible digital platforms, fostering early intervention and support for mental health challenges under the guidance of qualified healthcare professionals. ",
    "url": "https://arxiv.org/abs/2401.17477",
    "authors": [
      "Loris Belcastro",
      "Riccardo Cantini",
      "Fabrizio Marozzo",
      "Domenico Talia",
      "Paolo Trunfio"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.17480",
    "title": "Colony-Enhanced Recurrent Neural Architecture Search: Collaborative  Ant-Based Optimization",
    "abstract": "Crafting neural network architectures manually is a formidable challenge often leading to suboptimal and inefficient structures. The pursuit of the perfect neural configuration is a complex task, prompting the need for a metaheuristic approach such as Neural Architecture Search (NAS). Drawing inspiration from the ingenious mechanisms of nature, this paper introduces Collaborative Ant-based Neural Topology Search (CANTS-N), pushing the boundaries of NAS and Neural Evolution (NE). In this innovative approach, ant-inspired agents meticulously construct neural network structures, dynamically adapting within a dynamic environment, much like their natural counterparts. Guided by Particle Swarm Optimization (PSO), CANTS-N's colonies optimize architecture searches, achieving remarkable improvements in mean squared error (MSE) over established methods, including BP-free CANTS, BP CANTS, and ANTS. Scalable, adaptable, and forward-looking, CANTS-N has the potential to reshape the landscape of NAS and NE. This paper provides detailed insights into its methodology, results, and far-reaching implications. ",
    "url": "https://arxiv.org/abs/2401.17480",
    "authors": [
      "Abdelrahman Elsaid"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2401.17499",
    "title": "AdvGPS: Adversarial GPS for Multi-Agent Perception Attack",
    "abstract": "The multi-agent perception system collects visual data from sensors located on various agents and leverages their relative poses determined by GPS signals to effectively fuse information, mitigating the limitations of single-agent sensing, such as occlusion. However, the precision of GPS signals can be influenced by a range of factors, including wireless transmission and obstructions like buildings. Given the pivotal role of GPS signals in perception fusion and the potential for various interference, it becomes imperative to investigate whether specific GPS signals can easily mislead the multi-agent perception system. To address this concern, we frame the task as an adversarial attack challenge and introduce \\textsc{AdvGPS}, a method capable of generating adversarial GPS signals which are also stealthy for individual agents within the system, significantly reducing object detection accuracy. To enhance the success rates of these attacks in a black-box scenario, we introduce three types of statistically sensitive natural discrepancies: appearance-based discrepancy, distribution-based discrepancy, and task-aware discrepancy. Our extensive experiments on the OPV2V dataset demonstrate that these attacks substantially undermine the performance of state-of-the-art methods, showcasing remarkable transferability across different point cloud based 3D detection systems. This alarming revelation underscores the pressing need to address security implications within multi-agent perception systems, thereby underscoring a critical area of research. ",
    "url": "https://arxiv.org/abs/2401.17499",
    "authors": [
      "Jinlong Li",
      "Baolu Li",
      "Xinyu Liu",
      "Jianwu Fang",
      "Felix Juefei-Xu",
      "Qing Guo",
      "Hongkai Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.17504",
    "title": "CaMU: Disentangling Causal Effects in Deep Model Unlearning",
    "abstract": "Machine unlearning requires removing the information of forgetting data while keeping the necessary information of remaining data. Despite recent advancements in this area, existing methodologies mainly focus on the effect of removing forgetting data without considering the negative impact this can have on the information of the remaining data, resulting in significant performance degradation after data removal. Although some methods try to repair the performance of remaining data after removal, the forgotten information can also return after repair. Such an issue is due to the intricate intertwining of the forgetting and remaining data. Without adequately differentiating the influence of these two kinds of data on the model, existing algorithms take the risk of either inadequate removal of the forgetting data or unnecessary loss of valuable information from the remaining data. To address this shortcoming, the present study undertakes a causal analysis of the unlearning and introduces a novel framework termed Causal Machine Unlearning (CaMU). This framework adds intervention on the information of remaining data to disentangle the causal effects between forgetting data and remaining data. Then CaMU eliminates the causal impact associated with forgetting data while concurrently preserving the causal relevance of the remaining data. Comprehensive empirical results on various datasets and models suggest that CaMU enhances performance on the remaining data and effectively minimizes the influences of forgetting data. Notably, this work is the first to interpret deep model unlearning tasks from a new perspective of causality and provide a solution based on causal analysis, which opens up new possibilities for future research in deep model unlearning. ",
    "url": "https://arxiv.org/abs/2401.17504",
    "authors": [
      "Shaofei Shen",
      "Chenhao Zhang",
      "Alina Bialkowski",
      "Weitong Chen",
      "Miao Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2401.17511",
    "title": "Linguistically Communicating Uncertainty in Patient-Facing Risk  Prediction Models",
    "abstract": "This paper addresses the unique challenges associated with uncertainty quantification in AI models when applied to patient-facing contexts within healthcare. Unlike traditional eXplainable Artificial Intelligence (XAI) methods tailored for model developers or domain experts, additional considerations of communicating in natural language, its presentation and evaluating understandability are necessary. We identify the challenges in communication model performance, confidence, reasoning and unknown knowns using natural language in the context of risk prediction. We propose a design aimed at addressing these challenges, focusing on the specific application of in-vitro fertilisation outcome prediction. ",
    "url": "https://arxiv.org/abs/2401.17511",
    "authors": [
      "Adarsa Sivaprasad",
      "Ehud Reiter"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.17512",
    "title": "A Cradle-to-Gate Life Cycle Analysis of Bitcoin Mining Equipment Using  Sphera LCA and ecoinvent Databases",
    "abstract": "Bitcoin mining is regularly pointed out for its massive energy consumption and associated greenhouse gas emissions, hence contributing significantly to climate change. However, most studies ignore the environmental impacts of producing mining equipment, which is problematic given the short lifespan of such highly specific hardware. In this study, we perform a cradle-to-gate life cycle assessment (LCA) of dedicated Bitcoin mining equipment, considering their specific architecture. Our results show that the application-specific integrated circuit designed for Bitcoin mining is the main contributor to production-related impacts. This observation applies to most impact categories, including the global warming potential. In addition, this finding stresses out the necessity to carefully consider the specificity of the hardware. By comparing these results with several usage scenarios, we also demonstrate that the impacts of producing this type of equipment can be significant (up to 80% of the total life cycle impacts), depending on the sources of electricity supply for the use phase. Therefore, we highlight the need to consider the production phase when assessing the environmental impacts of Bitcoin mining hardware. To test the validity of our results, we use the Sphera LCA and ecoinvent databases for the background modeling of our system. Surprisingly, it leads to results with variations of up to 4 orders of magnitude for toxicity-related indicators, despite using the same foreground modeling. This database mismatch phenomenon, already identified in previous studies, calls for better understanding, consideration and discussion of environmental impacts in the field of electronics, going well beyond climate change indicators. ",
    "url": "https://arxiv.org/abs/2401.17512",
    "authors": [
      "Ludmila Courtillat--Piazza",
      "Thibault Pirson",
      "Louis Golard",
      "David Bol"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2401.17517",
    "title": "Force Push: Robust Single-Point Pushing with Force Feedback",
    "abstract": "We present the first controller for quasistatic robotic planar pushing with single-point contact using only force feedback. We consider an omnidirectional mobile robot pushing an object (the \"slider\") along a given path, where the robot is equipped with a force-torque sensor to measure the force at the contact point with the slider. The geometric, inertial, and frictional parameters of the slider are not known to the controller, nor are measurements of the slider's pose. We assume that the robot can be localized so that the global position of the contact point is always known and that the approximate initial position of the slider is provided. Simulations and real-world experiments show that our controller yields stable pushes that are robust to a wide range of slider parameters and state perturbations along both straight and curved paths. Furthermore, we use an admittance controller to adjust the pushing velocity based on the measured force when the slider contacts obstacles like walls. ",
    "url": "https://arxiv.org/abs/2401.17517",
    "authors": [
      "Adam Heins",
      "Angela P. Schoellig"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.17519",
    "title": "Modeling and analysis of a flexible spinning Euler-Bernoulli beam with  centrifugal stiffening and softening: A Linear Fractional Representation  approach with application to spinning spacecraft",
    "abstract": "The derivation of a linear fractional representation (LFR) model for a flexible, spinning and uniform Euler-Bernoulli beam is accomplished using the {Lagrange} technique, fully capturing the centrifugal force generated by the spinning motion and accounting for its dependence on the angular velocity. This six degrees of freedom (DOF) model accounts for the behavior of deflection in the moving body frame, encompassing the bending, traction and torsion dynamics. The model is also designed to be compliant with the Two-Input-Two-Output Port (TITOP) approach, which offers the possibility to model complex multibody mechanical systems, while keeping the uncertain nature of the plant and condensing all the possible mechanical configurations in a single LFR. To evaluate the effectiveness of the model, various scenarios are considered and their results are tabulated. These scenarios include uniform beams with fixed root boundary conditions for different values of tip mass, root offset and angular velocity. The results from the analysis of the uniform cantilever beam are compared with solutions found in the literature and obtained from a commercial finite element software. Ultimately, this paper presents a multibody model for a spinning spacecraft mission scenario. A comprehensive analysis of the system dynamics is conducted, providing insights into the behavior of the spacecraft under spinning conditions. ",
    "url": "https://arxiv.org/abs/2401.17519",
    "authors": [
      "Ricardo Rodrigues",
      "Daniel Alazard",
      "Francesco Sanfedino",
      "Tommaso Mauriello",
      "Paolo Iannelli"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Space Physics (physics.space-ph)"
    ]
  },
  {
    "id": "arXiv:2401.17522",
    "title": "On the Sum Secrecy Rate Maximisation for Wireless Vehicular Networks",
    "abstract": "Wireless communications form the backbone of future vehicular networks, playing a critical role in applications ranging from traffic control to vehicular road safety. However, the dynamic structure of these networks creates security vulnerabilities, making security considerations an integral part of network design. We address these security concerns from a physical layer security aspect by investigating achievable secrecy rates in wireless vehicular networks. Specifically, we aim to maximize the sum secrecy rate from all vehicular pairs subject to bandwidth and power resource constraints. For the considered problem, we first propose a solution based on the successive convex approximation (SCA) method, which has not been applied in this context before. To further reduce the complexity of the SCA-based method, we also propose a low-complexity solution based on a fast iterative shrinkage-thresholding algorithm (FISTA). Our simulation results for SCA and FISTA show a trade-off between convergence and runtime. While the SCA method achieves better convergence, the FISTA-based approach is at least 300 times faster than the SCA method. ",
    "url": "https://arxiv.org/abs/2401.17522",
    "authors": [
      "Muhammad Farooq",
      "Le-Nam Tran",
      "Fatemeh Golpayegani",
      "Nima Afraz"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2401.17536",
    "title": "PipeNet: Question Answering with Semantic Pruning over Knowledge Graphs",
    "abstract": "It is well acknowledged that incorporating explicit knowledge graphs (KGs) can benefit question answering. Existing approaches typically follow a grounding-reasoning pipeline in which entity nodes are first grounded for the query (question and candidate answers), and then a reasoning module reasons over the matched multi-hop subgraph for answer prediction. Although the pipeline largely alleviates the issue of extracting essential information from giant KGs, efficiency is still an open challenge when scaling up hops in grounding the subgraphs. In this paper, we target at finding semantically related entity nodes in the subgraph to improve the efficiency of graph reasoning with KG. We propose a grounding-pruning-reasoning pipeline to prune noisy nodes, remarkably reducing the computation cost and memory usage while also obtaining decent subgraph representation. In detail, the pruning module first scores concept nodes based on the dependency distance between matched spans and then prunes the nodes according to score ranks. To facilitate the evaluation of pruned subgraphs, we also propose a graph attention network (GAT) based module to reason with the subgraph data. Experimental results on CommonsenseQA and OpenBookQA demonstrate the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2401.17536",
    "authors": [
      "Ying Su",
      "Jipeng Zhang",
      "Yangqiu Song",
      "Tong Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.17545",
    "title": "Three-Stage Adjusted Regression Forecasting (TSARF) for Software Defect  Prediction",
    "abstract": "Software reliability growth models (SRGM) enable failure data collected during testing. Specifically, nonhomogeneous Poisson process (NHPP) SRGM are the most commonly employed models. While software reliability growth models are important, efficient modeling of complex software systems increases the complexity of models. Increased model complexity presents a challenge in identifying robust and computationally efficient algorithms to identify model parameters and reduces the generalizability of the models. Existing studies on traditional software reliability growth models suggest that NHPP models characterize defect data as a smooth continuous curve and fail to capture changes in the defect discovery process. Therefore, the model fits well under ideal conditions, but it is not adaptable and will only fit appropriately shaped data. Neural networks and other machine learning methods have been applied to greater effect [5], however limited due to lack of large samples of defect data especially at earlier stages of testing. ",
    "url": "https://arxiv.org/abs/2401.17545",
    "authors": [
      "Shadow Pritchard",
      "Bhaskar Mitra",
      "Vidhyashree Nagaraju"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2401.17546",
    "title": "Effective Multi-Stage Training Model For Edge Computing Devices In  Intrusion Detection",
    "abstract": "Intrusion detection poses a significant challenge within expansive and persistently interconnected environments. As malicious code continues to advance and sophisticated attack methodologies proliferate, various advanced deep learning-based detection approaches have been proposed. Nevertheless, the complexity and accuracy of intrusion detection models still need further enhancement to render them more adaptable to diverse system categories, particularly within resource-constrained devices, such as those embedded in edge computing systems. This research introduces a three-stage training paradigm, augmented by an enhanced pruning methodology and model compression techniques. The objective is to elevate the system's effectiveness, concurrently maintaining a high level of accuracy for intrusion detection. Empirical assessments conducted on the UNSW-NB15 dataset evince that this solution notably reduces the model's dimensions, while upholding accuracy levels equivalent to similar proposals. ",
    "url": "https://arxiv.org/abs/2401.17546",
    "authors": [
      "Thua Huynh Trong",
      "Thanh Nguyen Hoang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.17566",
    "title": "IQ Skew and Imbalance Estimation for Coherent Point-to-Multi-Point  Optical Networks",
    "abstract": "Coherent point-to-multi-point (PtMP) optical network based on digital subcarrier multiplexing (DSCM) has been a promising technology for metro and access networks to achieve cost savings, low latency, and high flexibility. In-phase and quadrature (IQ) impairments of the coherent transceiver (e.g. IQ skew and power imbalance) cause severe performance degradation. In the DSCM-based coherent PtMP optical networks, it is hard to realize far-end IQ-impairments estimation for the hub transmitter because the leaf on one subcarrier cannot acquire the signal on the symmetrical subcarrier. In this paper, we propose a far-end IQ-impairments estimation based on the specially designed time-and-frequency interleaving tones (TFITs), which can simultaneously estimate IQ skews and power imbalances of the hub transmitter and leaf receiver at an individual leaf. The feasibility of the TFITs-based IQ-impairments estimation has been experimentally verified by setting up $8$Gbaud/SC$\\times$$4$SCs DSCM-based coherent PtMP optical network. The experimental results depict that the absolute errors in the estimated IQ skew and power imbalance are within $\\pm 0.5$ps and $\\pm 0.2$dB, respectively. In conclusion, TFITs-based IQ-impairments estimation has great potential for DSCM-based coherent PtMP optical networks. ",
    "url": "https://arxiv.org/abs/2401.17566",
    "authors": [
      "Ji Zhou",
      "Jianrui Zeng",
      "Haide Wang",
      "Dong Guo",
      "Liangchuan Li",
      "Weiping Liu",
      "Changyuan Yu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.17577",
    "title": "Robustness in Wireless Distributed Learning: An Information-Theoretic  Analysis",
    "abstract": "In this paper, we take an information-theoretic approach to understand the robustness in wireless distributed learning. Upon measuring the difference in loss functions, we provide an upper bound of the performance deterioration due to imperfect wireless channels. Moreover, we characterize the transmission rate under task performance guarantees and propose the channel capacity gain resulting from the inherent robustness in wireless distributed learning. An efficient algorithm for approximating the derived upper bound is established for practical use. The effectiveness of our results is illustrated by the numerical simulations. ",
    "url": "https://arxiv.org/abs/2401.17577",
    "authors": [
      "Yangshuo He",
      "Guanding Yu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.17580",
    "title": "Graph Contrastive Learning with Cohesive Subgraph Awareness",
    "abstract": "Graph contrastive learning (GCL) has emerged as a state-of-the-art strategy for learning representations of diverse graphs including social and biomedical networks. GCL widely uses stochastic graph topology augmentation, such as uniform node dropping, to generate augmented graphs. However, such stochastic augmentations may severely damage the intrinsic properties of a graph and deteriorate the following representation learning process. We argue that incorporating an awareness of cohesive subgraphs during the graph augmentation and learning processes has the potential to enhance GCL performance. To this end, we propose a novel unified framework called CTAug, to seamlessly integrate cohesion awareness into various existing GCL mechanisms. In particular, CTAug comprises two specialized modules: topology augmentation enhancement and graph learning enhancement. The former module generates augmented graphs that carefully preserve cohesion properties, while the latter module bolsters the graph encoder's ability to discern subgraph patterns. Theoretical analysis shows that CTAug can strictly improve existing GCL mechanisms. Empirical experiments verify that CTAug can achieve state-of-the-art performance for graph representation learning, especially for graphs with high degrees. The code is available at https://doi.org/10.5281/zenodo.10594093, or https://github.com/wuyucheng2002/CTAug. ",
    "url": "https://arxiv.org/abs/2401.17580",
    "authors": [
      "Yucheng Wu",
      "Leye Wang",
      "Xiao Han",
      "Han-Jia Ye"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.17602",
    "title": "Assertion Detection Large Language Model In-context Learning LoRA  Fine-tuning",
    "abstract": "In this study, we aim to address the task of assertion detection when extracting medical concepts from clinical notes, a key process in clinical natural language processing (NLP). Assertion detection in clinical NLP usually involves identifying assertion types for medical concepts in the clinical text, namely certainty (whether the medical concept is positive, negated, possible, or hypothetical), temporality (whether the medical concept is for present or the past history), and experiencer (whether the medical concept is described for the patient or a family member). These assertion types are essential for healthcare professionals to quickly and clearly understand the context of medical conditions from unstructured clinical texts, directly influencing the quality and outcomes of patient care. Although widely used, traditional methods, particularly rule-based NLP systems and machine learning or deep learning models, demand intensive manual efforts to create patterns and tend to overlook less common assertion types, leading to an incomplete understanding of the context. To address this challenge, our research introduces a novel methodology that utilizes Large Language Models (LLMs) pre-trained on a vast array of medical data for assertion detection. We enhanced the current method with advanced reasoning techniques, including Tree of Thought (ToT), Chain of Thought (CoT), and Self-Consistency (SC), and refine it further with Low-Rank Adaptation (LoRA) fine-tuning. We first evaluated the model on the i2b2 2010 assertion dataset. Our method achieved a micro-averaged F-1 of 0.89, with 0.11 improvements over the previous works. To further assess the generalizability of our approach, we extended our evaluation to a local dataset that focused on sleep concept extraction. Our approach achieved an F-1 of 0.74, which is 0.31 higher than the previous method. ",
    "url": "https://arxiv.org/abs/2401.17602",
    "authors": [
      "Yuelyu Ji",
      "Zeshui Yu",
      "Yanshan Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.17611",
    "title": "Estimating Diffusion Degree on Graph Streams",
    "abstract": "The challenges of graph stream algorithms are twofold. First, each edge needs to be processed only once, and second, it needs to work on highly constrained memory. Diffusion degree is a measure of node centrality that can be calculated (for all nodes) trivially for static graphs using a single Breadth-First Search (BFS). However, keeping track of the Diffusion Degree in a graph stream is nontrivial. The memory requirement for exact calculation is equivalent to keeping the whole graph in memory. The present paper proposes an estimator (or sketch) of diffusion degree for graph streams. We prove the correctness of the proposed sketch and the upper bound of the estimated error. Given $\\epsilon, \\delta \\in (0,1)$, we achieve error below $\\epsilon(b_u-a_u)d_u\\lambda$ in node $u$ with probability $1-\\delta$ by utilizing $O(n\\frac1{\\epsilon^2}\\log{\\frac1{\\delta}})$ space, where $b_u$ and $a_u$ are the maximum and minimum degrees of neighbors of $u$, $\\lambda$ is diffusion probability, and $d_u$ is the degree of node $u$. With the help of this sketch, we propose an algorithm to extract the top-$k$ influencing nodes in the graph stream. Comparative experiments show that the spread of top-$k$ nodes by the proposed graph stream algorithm is equivalent to or better than the spread of top-$k$ nodes extracted by the exact algorithm. ",
    "url": "https://arxiv.org/abs/2401.17611",
    "authors": [
      "Vinit Ramesh Gore",
      "Suman Kundu",
      "Anggy Eka Pratiwi"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2401.17612",
    "title": "IGCN: Integrative Graph Convolutional Networks for Multi-modal Data",
    "abstract": "Recent advances in Graph Neural Networks (GNN) have led to a considerable growth in graph data modeling for multi-modal data which contains various types of nodes and edges. Although some integrative prediction solutions have been developed recently for network-structured data, these methods have some restrictions. For a node classification task involving multi-modal data, certain data modalities may perform better when predicting one class, while others might excel in predicting a different class. Thus, to obtain a better learning representation, advanced computational methodologies are required for the integrative analysis of multi-modal data. Moreover, existing integrative tools lack a comprehensive and cohesive understanding of the rationale behind their specific predictions, making them unsuitable for enhancing model interpretability. Addressing these restrictions, we introduce a novel integrative neural network approach for multi-modal data networks, named Integrative Graph Convolutional Networks (IGCN). IGCN learns node embeddings from multiple topologies and fuses the multiple node embeddings into a weighted form by assigning attention coefficients to the node embeddings. Our proposed attention mechanism helps identify which types of data receive more emphasis for each sample to predict a certain class. Therefore, IGCN has the potential to unravel previously unknown characteristics within different node classification tasks. We benchmarked IGCN on several datasets from different domains, including a multi-omics dataset to predict cancer subtypes and a multi-modal clinical dataset to predict the progression of Alzheimer's disease. Experimental results show that IGCN outperforms or is on par with the state-of-the-art and baseline methods. ",
    "url": "https://arxiv.org/abs/2401.17612",
    "authors": [
      "Cagri Ozdemir",
      "Mohammad Al Olaimat",
      "Yashu Vashishath",
      "Serdar Bozdag",
      "Alzheimer's Disease Neuroimaging Initiative"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.17615",
    "title": "Graph Multi-Similarity Learning for Molecular Property Prediction",
    "abstract": "Effective molecular representation learning is essential for molecular property prediction. Contrastive learning, a prominent self-supervised approach for molecular representation learning, relies on establishing positive and negative pairs. However, this binary similarity categorization oversimplifies the nature of complex molecular relationships and overlooks the degree of relative similarities among molecules, posing challenges to the effectiveness and generality of representation learning. In response to this challenge, we propose the Graph Multi-Similarity Learning for Molecular Property Prediction (GraphMSL) framework. GraphMSL incorporates a generalized multi-similarity metric in a continuous scale, capturing self-similarity and relative similarities. The unimodal multi-similarity metrics are derived from various chemical modalities, and the fusion of these metrics into a multimodal form significantly enhances the effectiveness of GraphMSL. In addition, the flexibility of fusion function can reshape the focus of the model to convey different chemical semantics. GraphMSL proves effective in drug discovery evaluations through various downstream tasks and post-hoc analysis of learnt representations. Its notable performance suggests significant potential for the exploration of new drug candidates. ",
    "url": "https://arxiv.org/abs/2401.17615",
    "authors": [
      "Hao Xu",
      "Zhengyang Zhou",
      "Pengyu Hong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2401.17618",
    "title": "Beyond Control: Exploring Novel File System Objects for Data-Only  Attacks on Linux Systems",
    "abstract": "The widespread deployment of control-flow integrity has propelled non-control data attacks into the mainstream. In the domain of OS kernel exploits, by corrupting critical non-control data, local attackers can directly gain root access or privilege escalation without hijacking the control flow. As a result, OS kernels have been restricting the availability of such non-control data. This forces attackers to continue to search for more exploitable non-control data in OS kernels. However, discovering unknown non-control data can be daunting because they are often tied heavily to semantics and lack universal patterns. We make two contributions in this paper: (1) discover critical non-control objects in the file subsystem and (2) analyze their exploitability. This work represents the first study, with minimal domain knowledge, to semi-automatically discover and evaluate exploitable non-control data within the file subsystem of the Linux kernel. Our solution utilizes a custom analysis and testing framework that statically and dynamically identifies promising candidate objects. Furthermore, we categorize these discovered objects into types that are suitable for various exploit strategies, including a novel strategy necessary to overcome the defense that isolates many of these objects. These objects have the advantage of being exploitable without requiring KASLR, thus making the exploits simpler and more reliable. We use 18 real-world CVEs to evaluate the exploitability of the file system objects using various exploit strategies. We develop 10 end-to-end exploits using a subset of CVEs against the kernel with all state-of-the-art mitigations enabled. ",
    "url": "https://arxiv.org/abs/2401.17618",
    "authors": [
      "Jinmeng Zhou",
      "Jiayi Hu",
      "Ziyue Pan",
      "Jiaxun Zhu",
      "Guoren Li",
      "Wenbo Shen",
      "Yulei Sui",
      "Zhiyun Qian"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Operating Systems (cs.OS)"
    ]
  },
  {
    "id": "arXiv:2401.17628",
    "title": "Elephants Do Not Forget: Differential Privacy with State Continuity for  Privacy Budget",
    "abstract": "Current implementations of differentially-private (DP) systems either lack support to track the global privacy budget consumed on a dataset, or fail to faithfully maintain the state continuity of this budget. We show that failure to maintain a privacy budget enables an adversary to mount replay, rollback and fork attacks - obtaining answers to many more queries than what a secure system would allow. As a result the attacker can reconstruct secret data that DP aims to protect - even if DP code runs in a Trusted Execution Environment (TEE). We propose ElephantDP, a system that aims to provide the same guarantees as a trusted curator in the global DP model would, albeit set in an untrusted environment. Our system relies on a state continuity module to provide protection for the privacy budget and a TEE to faithfully execute DP code and update the budget. To provide security, our protocol makes several design choices including the content of the persistent state and the order between budget updates and query answers. We prove that ElephantDP provides liveness (i.e., the protocol can restart from a correct state and respond to queries as long as the budget is not exceeded) and DP confidentiality (i.e., an attacker learns about a dataset as much as it would from interacting with a trusted curator). Our implementation and evaluation of the protocol use Intel SGX as a TEE to run the DP code and a network of TEEs to maintain state continuity. Compared to an insecure baseline, we observe only 1.1-2$\\times$ overheads and lower relative overheads for larger datasets and complex DP queries. ",
    "url": "https://arxiv.org/abs/2401.17628",
    "authors": [
      "Jiankai Jin",
      "Chitchanok Chuengsatiansup",
      "Toby Murray",
      "Benjamin I. P. Rubinstein",
      "Yuval Yarom",
      "Olga Ohrimenko"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.17632",
    "title": "What Do Self-Supervised Speech and Speaker Models Learn? New Findings  From a Cross Model Layer-Wise Analysis",
    "abstract": "Self-supervised learning (SSL) has attracted increased attention for learning meaningful speech representations. Speech SSL models, such as WavLM, employ masked prediction training to encode general-purpose representations. In contrast, speaker SSL models, exemplified by DINO-based models, adopt utterance-level training objectives primarily for speaker representation. Understanding how these models represent information is essential for refining model efficiency and effectiveness. Unlike the various analyses of speech SSL, there has been limited investigation into what information speaker SSL captures and how its representation differs from speech SSL or other fully-supervised speaker models. This paper addresses these fundamental questions. We explore the capacity to capture various speech properties by applying SUPERB evaluation probing tasks to speech and speaker SSL models. We also examine which layers are predominantly utilized for each task to identify differences in how speech is represented. Furthermore, we conduct direct comparisons to measure the similarities between layers within and across models. Our analysis unveils that 1) the capacity to represent content information is somewhat unrelated to enhanced speaker representation, 2) specific layers of speech SSL models would be partly specialized in capturing linguistic information, and 3) speaker SSL models tend to disregard linguistic information but exhibit more sophisticated speaker representation. ",
    "url": "https://arxiv.org/abs/2401.17632",
    "authors": [
      "Takanori Ashihara",
      "Marc Delcroix",
      "Takafumi Moriya",
      "Kohei Matsuura",
      "Taichi Asami",
      "Yusuke Ijima"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2401.17663",
    "title": "Social Robot Navigation with Adaptive Proxemics Based on Emotions",
    "abstract": "The primary aim of this paper is to investigate the integration of emotions into the social navigation framework to analyse its effect on both navigation and human physiological safety and comfort. The proposed framework uses leg detection to find the whereabouts of people and computes adaptive proxemic zones based on their emotional state. We designed several case studies in a simulated environment and examined 3 different emotions; positive (happy), neutral and negative (angry). A survey study was conducted with 70 participants to explore their impressions about the navigation of the robot and compare the human safety and comfort measurements results. Both survey and simulation results showed that integrating emotions into proxemic zones has a significant effect on the physical safety of a human. The results revealed that when a person is angry, the robot is expected to navigate further than the standard distance to support his/her physiological comfort and safety. The results also showed that reducing the navigation distance is not preferred when a person is happy. ",
    "url": "https://arxiv.org/abs/2401.17663",
    "authors": [
      "Baris Bilen",
      "Hasan Kivrak Pinar Uluer",
      "Hatice Kose"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.17699",
    "title": "Unified Physical-Digital Face Attack Detection",
    "abstract": "Face Recognition (FR) systems can suffer from physical (i.e., print photo) and digital (i.e., DeepFake) attacks. However, previous related work rarely considers both situations at the same time. This implies the deployment of multiple models and thus more computational burden. The main reasons for this lack of an integrated model are caused by two factors: (1) The lack of a dataset including both physical and digital attacks with ID consistency which means the same ID covers the real face and all attack types; (2) Given the large intra-class variance between these two attacks, it is difficult to learn a compact feature space to detect both attacks simultaneously. To address these issues, we collect a Unified physical-digital Attack dataset, called UniAttackData. The dataset consists of $1,800$ participations of 2 and 12 physical and digital attacks, respectively, resulting in a total of 29,706 videos. Then, we propose a Unified Attack Detection framework based on Vision-Language Models (VLMs), namely UniAttackDetection, which includes three main modules: the Teacher-Student Prompts (TSP) module, focused on acquiring unified and specific knowledge respectively; the Unified Knowledge Mining (UKM) module, designed to capture a comprehensive feature space; and the Sample-Level Prompt Interaction (SLPI) module, aimed at grasping sample-level semantics. These three modules seamlessly form a robust unified attack detection framework. Extensive experiments on UniAttackData and three other datasets demonstrate the superiority of our approach for unified face attack detection. ",
    "url": "https://arxiv.org/abs/2401.17699",
    "authors": [
      "Hao Fang",
      "Ajian Liu",
      "Haocheng Yuan",
      "Junze Zheng",
      "Dingheng Zeng",
      "Yanhong Liu",
      "Jiankang Deng",
      "Sergio Escalera",
      "Xiaoming Liu",
      "Jun Wan",
      "Zhen Lei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.17704",
    "title": "Computing the forcing spectrum of outerplanar graphs in polynomial time",
    "abstract": "The forcing number of a graph with a perfect matching $M$ is the minimum number of edges in $M$ whose endpoints need to be deleted, such that the remaining graph only has a single perfect matching. This number is of great interest in theoretical chemistry, since it conveys information about the structural properties of several interesting molecules. On the other hand, in bipartite graphs the forcing number corresponds to the famous feedback vertex set problem in digraphs. Determining the complexity of finding the smallest forcing number of a given planar graph is still a widely open and important question in this area, originally proposed by Afshani, Hatami, and Mahmoodian in 2004. We take a first step towards the resolution of this question by providing an algorithm that determines the set of all possible forcing numbers of an outerplanar graph in polynomial time. This is the first polynomial-time algorithm concerning this problem for a class of graphs of comparable or greater generality. ",
    "url": "https://arxiv.org/abs/2401.17704",
    "authors": [
      "Maximilian Gorsky",
      "Fabian Kreßin"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2401.17710",
    "title": "Aesthetic Preference Prediction in Interior Design: Fuzzy Approach",
    "abstract": "Interior design is all about creating spaces that look and feel good. However, the subjective nature of aesthetic preferences presents a significant challenge in defining and quantifying what makes an interior design visually appealing. The current paper addresses this gap by introducing a novel methodology for quantifying and predicting aesthetic preferences in interior design. Our study combines fuzzy logic with image processing techniques. We collected a dataset of interior design images from social media platforms, focusing on essential visual attributes such as color harmony, lightness, and complexity. We integrate these features using weighted average to compute a general aesthetic score. Our approach considers individual color preferences in calculating the overall aesthetic preference. We initially gather user ratings for primary colors like red, brown, and others to understand their preferences. Then, we use the pixel count of the top five dominant colors in the image to get the color scheme preference. The color scheme preference and the aesthetic score are then passed as inputs to the fuzzy inference system to calculate an overall preference score. This score represents a comprehensive measure of the user's preference for a particular interior design, considering their color choices and general aesthetic appeal. We used the 2AFC (Two-Alternative Forced Choice) method to validate our methodology, achieving a notable hit rate of 0.7. This study can help designers and professionals better understand and meet people's interior design preferences, especially in a world that relies heavily on digital media. ",
    "url": "https://arxiv.org/abs/2401.17710",
    "authors": [
      "Ayana Adilova",
      "Pakizar Shamoi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.17711",
    "title": "Prediction of multitasking performance post-longitudinal tDCS via  EEG-based functional connectivity and machine learning methods",
    "abstract": "Predicting and understanding the changes in cognitive performance, especially after a longitudinal intervention, is a fundamental goal in neuroscience. Longitudinal brain stimulation-based interventions like transcranial direct current stimulation (tDCS) induce short-term changes in the resting membrane potential and influence cognitive processes. However, very little research has been conducted on predicting these changes in cognitive performance post-intervention. In this research, we intend to address this gap in the literature by employing different EEG-based functional connectivity analyses and machine learning algorithms to predict changes in cognitive performance in a complex multitasking task. Forty subjects were divided into experimental and active-control conditions. On Day 1, all subjects executed a multitasking task with simultaneous 32-channel EEG being acquired. From Day 2 to Day 7, subjects in the experimental condition undertook 15 minutes of 2mA anodal tDCS stimulation during task training. Subjects in the active-control condition undertook 15 minutes of sham stimulation during task training. On Day 10, all subjects again executed the multitasking task with EEG acquisition. Source-level functional connectivity metrics, namely phase lag index and directed transfer function, were extracted from the EEG data on Day 1 and Day 10. Various machine learning models were employed to predict changes in cognitive performance. Results revealed that the multi-layer perceptron and directed transfer function recorded a cross-validation training RMSE of 5.11% and a test RMSE of 4.97%. We discuss the implications of our results in developing real-time cognitive state assessors for accurately predicting cognitive performance in dynamic and complex tasks post-tDCS intervention ",
    "url": "https://arxiv.org/abs/2401.17711",
    "authors": [
      "Akash K Rao",
      "Shashank Uttrani",
      "Vishnu K Menon",
      "Darshil Shah",
      "Arnav Bhavsar",
      "Shubhajit Roy Chowdhury",
      "Varun Dutt"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.17723",
    "title": "LoRec: Large Language Model for Robust Sequential Recommendation against  Poisoning Attacks",
    "abstract": "Sequential recommender systems stand out for their ability to capture users' dynamic interests and the patterns of item-to-item transitions. However, the inherent openness of sequential recommender systems renders them vulnerable to poisoning attacks, where fraudulent users are injected into the training data to manipulate learned patterns. Traditional defense strategies predominantly depend on predefined assumptions or rules extracted from specific known attacks, limiting their generalizability to unknown attack types. To solve the above problems, considering the rich open-world knowledge encapsulated in Large Language Models (LLMs), our research initially focuses on the capabilities of LLMs in the detection of unknown fraudulent activities within recommender systems, a strategy we denote as LLM4Dec. Empirical evaluations demonstrate the substantial capability of LLMs in identifying unknown fraudsters, leveraging their expansive, open-world knowledge. Building upon this, we propose the integration of LLMs into defense strategies to extend their effectiveness beyond the confines of known attacks. We propose LoRec, an advanced framework that employs LLM-Enhanced Calibration to strengthen the robustness of sequential recommender systems against poisoning attacks. LoRec integrates an LLM-enhanced CalibraTor (LCT) that refines the training process of sequential recommender systems with knowledge derived from LLMs, applying a user-wise reweighting to diminish the impact of fraudsters injected by attacks. By incorporating LLMs' open-world knowledge, the LCT effectively converts the limited, specific priors or rules into a more general pattern of fraudsters, offering improved defenses against poisoning attacks. Our comprehensive experiments validate that LoRec, as a general framework, significantly strengthens the robustness of sequential recommender systems. ",
    "url": "https://arxiv.org/abs/2401.17723",
    "authors": [
      "Kaike Zhang",
      "Qi Cao",
      "Yunfan Wu",
      "Fei Sun",
      "Huawei Shen",
      "Xueqi Cheng"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2401.17738",
    "title": "Harnessing Smartwatch Microphone Sensors for Cough Detection and  Classification",
    "abstract": "This study investigates the potential of using smartwatches with built-in microphone sensors for monitoring coughs and detecting various cough types. We conducted a study involving 32 participants and collected 9 hours of audio data in a controlled manner. Afterward, we processed this data using a structured approach, resulting in 223 positive cough samples. We further improved the dataset through augmentation techniques and employed a specialized 1D CNN model. This model achieved an impressive accuracy rate of 98.49% while non-walking and 98.2% while walking, showing smartwatches can detect cough. Moreover, our research successfully identified four distinct types of coughs using clustering techniques. ",
    "url": "https://arxiv.org/abs/2401.17738",
    "authors": [
      "Pranay Jaiswal",
      "Haroon R. Lone"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2401.17743",
    "title": "Algorithmic Robust Forecast Aggregation",
    "abstract": "Forecast aggregation combines the predictions of multiple forecasters to improve accuracy. However, the lack of knowledge about forecasters' information structure hinders optimal aggregation. Given a family of information structures, robust forecast aggregation aims to find the aggregator with minimal worst-case regret compared to the omniscient aggregator. Previous approaches for robust forecast aggregation rely on heuristic observations and parameter tuning. We propose an algorithmic framework for robust forecast aggregation. Our framework provides efficient approximation schemes for general information aggregation with a finite family of possible information structures. In the setting considered by Arieli et al. (2018) where two agents receive independent signals conditioned on a binary state, our framework also provides efficient approximation schemes by imposing Lipschitz conditions on the aggregator or discrete conditions on agents' reports. Numerical experiments demonstrate the effectiveness of our method by providing a nearly optimal aggregator in the setting considered by Arieli et al. (2018). ",
    "url": "https://arxiv.org/abs/2401.17743",
    "authors": [
      "Yongkang Guo",
      "Jason D. Hartline",
      "Zhihuan Huang",
      "Yuqing Kong",
      "Anant Shah",
      "Fang-Yi Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2401.17745",
    "title": "Gesture Controlled Robot For Human Detection",
    "abstract": "It is very important to locate survivors from collapsed buildings so that rescue operations can be arranged. Many lives are lost due to lack of competent systems to detect people in these collapsed buildings at the right time. So here we have designed a hand gesture controlled robot which is capable of detecting humans under these collapsed building parts. The proposed work can be used to access specific locations that are not humanly possible, and detect those humans trapped under the rubble of collapsed buildings. This information is then used to notify the rescue team to take adequate measures and initiate rescue operations accordingly. ",
    "url": "https://arxiv.org/abs/2401.17745",
    "authors": [
      "Athira T.S",
      "Honey Manoj",
      "R S Vishnu Priya",
      "Vishnu K Menon",
      "Srilekshmi M"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.17746",
    "title": "Logit Poisoning Attack in Distillation-based Federated Learning and its  Countermeasures",
    "abstract": "Distillation-based federated learning has emerged as a promising collaborative learning approach, where clients share the output logit vectors of a public dataset rather than their private model parameters. This practice reduces the risk of privacy invasion attacks and facilitates heterogeneous learning. The landscape of poisoning attacks within distillation-based federated learning is complex, with existing research employing traditional data poisoning strategies targeting the models' parameters. However, these attack schemes primarily have shortcomings rooted in their original designs, which target the model parameters rather than the logit vectors. Furthermore, they do not adequately consider the role of logit vectors in carrying information during the knowledge transfer process. This misalignment results in less efficiency in the context of distillation-based federated learning. Due to the limitations of existing methodologies, our research delves into the intrinsic properties of the logit vector, striving for a more nuanced understanding. We introduce a two-stage scheme for logit poisoning attacks, addressing previous shortcomings. Initially, we collect the local logits, generate the representative vectors, categorize the logit elements within the vector, and design a shuffling table to maximize information entropy. Then, we intentionally scale the shuffled logit vectors to enhance the magnitude of the target vectors. Concurrently, we propose an efficient defense algorithm to counter this new poisoning scheme by calculating the distance between estimated benign vectors and vectors uploaded by users. Through extensive experiments, our study illustrates the significant threat posed by the proposed logit poisoning attack and highlights the effectiveness of our defense algorithm. ",
    "url": "https://arxiv.org/abs/2401.17746",
    "authors": [
      "Yonghao Yu",
      "Shunan Zhu",
      "Jinglu Hu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.17748",
    "title": "A Dynamical Neural Galerkin Scheme for Filtering Problems",
    "abstract": "This paper considers the filtering problem which consists in reconstructing the state of a dynamical system with partial observations coming from sensor measurements, and the knowledge that the dynamics are governed by a physical PDE model with unknown parameters. We present a filtering algorithm where the reconstruction of the dynamics is done with neural network approximations whose weights are dynamically updated using observational data. In addition to the estimate of the state, we also obtain time-dependent parameter estimations of the PDE parameters governing the observed evolution. We illustrate the behavior of the method in a one-dimensional KdV equation involving the transport of solutions with local support. Our numerical investigation reveals the importance of the location and number of the observations. In particular, it suggests to consider dynamical sensor placement. ",
    "url": "https://arxiv.org/abs/2401.17748",
    "authors": [
      "Joubine Aghili",
      "Joy Zialesi Atokple",
      "Marie Billaud-Friess",
      "Guillaume Garnier",
      "Olga Mula",
      "Norbert Tognon"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2401.17752",
    "title": "PF-GNN: Differentiable particle filtering based approximation of  universal graph representations",
    "abstract": "Message passing Graph Neural Networks (GNNs) are known to be limited in expressive power by the 1-WL color-refinement test for graph isomorphism. Other more expressive models either are computationally expensive or need preprocessing to extract structural features from the graph. In this work, we propose to make GNNs universal by guiding the learning process with exact isomorphism solver techniques which operate on the paradigm of Individualization and Refinement (IR), a method to artificially introduce asymmetry and further refine the coloring when 1-WL stops. Isomorphism solvers generate a search tree of colorings whose leaves uniquely identify the graph. However, the tree grows exponentially large and needs hand-crafted pruning techniques which are not desirable from a learning perspective. We take a probabilistic view and approximate the search tree of colorings (i.e. embeddings) by sampling multiple paths from root to leaves of the search tree. To learn more discriminative representations, we guide the sampling process with particle filter updates, a principled approach for sequential state estimation. Our algorithm is end-to-end differentiable, can be applied with any GNN as backbone and learns richer graph representations with only linear increase in runtime. Experimental evaluation shows that our approach consistently outperforms leading GNN models on both synthetic benchmarks for isomorphism detection as well as real-world datasets. ",
    "url": "https://arxiv.org/abs/2401.17752",
    "authors": [
      "Mohammed Haroon Dupty",
      "Yanfei Dong",
      "Wee Sun Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.17755",
    "title": "CauESC: A Causal Aware Model for Emotional Support Conversation",
    "abstract": "Emotional Support Conversation aims at reducing the seeker's emotional distress through supportive response. Existing approaches have two limitations: (1) They ignore the emotion causes of the distress, which is important for fine-grained emotion understanding; (2) They focus on the seeker's own mental state rather than the emotional dynamics during interaction between speakers. To address these issues, we propose a novel framework CauESC, which firstly recognizes the emotion causes of the distress, as well as the emotion effects triggered by the causes, and then understands each strategy of verbal grooming independently and integrates them skillfully. Experimental results on the benchmark dataset demonstrate the effectiveness of our approach and show the benefits of emotion understanding from cause to effect and independent-integrated strategy modeling. ",
    "url": "https://arxiv.org/abs/2401.17755",
    "authors": [
      "Wei Chen",
      "Hengxu Lin",
      "Qun Zhang",
      "Xiaojin Zhang",
      "Xiang Bai",
      "Xuanjing Huang",
      "Zhongyu Wei"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.17773",
    "title": "SNP-S3: Shared Network Pre-training and Significant Semantic  Strengthening for Various Video-Text Tasks",
    "abstract": "We present a framework for learning cross-modal video representations by directly pre-training on raw data to facilitate various downstream video-text tasks. Our main contributions lie in the pre-training framework and proxy tasks. First, based on the shortcomings of two mainstream pixel-level pre-training architectures (limited applications or less efficient), we propose Shared Network Pre-training (SNP). By employing one shared BERT-type network to refine textual and cross-modal features simultaneously, SNP is lightweight and could support various downstream applications. Second, based on the intuition that people always pay attention to several \"significant words\" when understanding a sentence, we propose the Significant Semantic Strengthening (S3) strategy, which includes a novel masking and matching proxy task to promote the pre-training performance. Experiments conducted on three downstream video-text tasks and six datasets demonstrate that, we establish a new state-of-the-art in pixel-level video-text pre-training; we also achieve a satisfactory balance between the pre-training efficiency and the fine-tuning performance. The codebase are available at https://github.com/alipay/Ant-Multi-Modal-Framework/tree/main/prj/snps3_vtp. ",
    "url": "https://arxiv.org/abs/2401.17773",
    "authors": [
      "Xingning Dong",
      "Qingpei Guo",
      "Tian Gan",
      "Qing Wang",
      "Jianlong Wu",
      "Xiangyuan Ren",
      "Yuan Cheng",
      "Wei Chu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2401.17789",
    "title": "Robustly overfitting latents for flexible neural image compression",
    "abstract": "Neural image compression has made a great deal of progress. State-of-the-art models are based on variational autoencoders and are outperforming classical models. Neural compression models learn to encode an image into a quantized latent representation that can be efficiently sent to the decoder, which decodes the quantized latent into a reconstructed image. While these models have proven successful in practice, they lead to sub-optimal results due to imperfect optimization and limitations in the encoder and decoder capacity. Recent work shows how to use stochastic Gumbel annealing (SGA) to refine the latents of pre-trained neural image compression models. We extend this idea by introducing SGA+, which contains three different methods that build upon SGA. Further, we give a detailed analysis of our proposed methods, show how they improve performance, and show that they are less sensitive to hyperparameter choices. Besides, we show how each method can be extended to three- instead of two-class rounding. Finally, we show how refinement of the latents with our best-performing method improves the compression performance on the Tecnick dataset and how it can be deployed to partly move along the rate-distortion curve. ",
    "url": "https://arxiv.org/abs/2401.17789",
    "authors": [
      "Yura Perugachi-Diaz",
      "Arwin Gansekoele",
      "Sandjai Bhulai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.17791",
    "title": "Graph Transformers without Positional Encodings",
    "abstract": "Recently, Transformers for graph representation learning have become increasingly popular, achieving state-of-the-art performance on a wide-variety of datasets, either alone or in combination with message-passing graph neural networks (MP-GNNs). Infusing graph inductive-biases in the innately structure-agnostic transformer architecture in the form of structural or positional encodings (PEs) is key to achieving these impressive results. However, designing such encodings is tricky and disparate attempts have been made to engineer such encodings including Laplacian eigenvectors, relative random-walk probabilities (RRWP), spatial encodings, centrality encodings, edge encodings etc. In this work, we argue that such encodings may not be required at all, provided the attention mechanism itself incorporates information about the graph structure. We introduce Eigenformer, which uses a novel spectrum-aware attention mechanism cognizant of the Laplacian spectrum of the graph, and empirically show that it achieves performance comparable to SOTA MP-GNN architectures and Graph Transformers on a number of standard GNN benchmark datasets, even surpassing the SOTA on some datasets. We also find that our architecture is much faster to train in terms of number of epochs, presumably due to the innate graph inductive biases. ",
    "url": "https://arxiv.org/abs/2401.17791",
    "authors": [
      "Ayush Garg"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.17802",
    "title": "Distillation Enhanced Time Series Forecasting Network with Momentum  Contrastive Learning",
    "abstract": "Contrastive representation learning is crucial in time series analysis as it alleviates the issue of data noise and incompleteness as well as sparsity of supervision signal. However, existing constrastive learning frameworks usually focus on intral-temporal features, which fails to fully exploit the intricate nature of time series data. To address this issue, we propose DE-TSMCL, an innovative distillation enhanced framework for long sequence time series forecasting. Specifically, we design a learnable data augmentation mechanism which adaptively learns whether to mask a timestamp to obtain optimized sub-sequences. Then, we propose a contrastive learning task with momentum update to explore inter-sample and intra-temporal correlations of time series to learn the underlying structure feature on the unlabeled time series. Meanwhile, we design a supervised task to learn more robust representations and facilitate the contrastive learning process. Finally, we jointly optimize the above two tasks. By developing model loss from multiple tasks, we can learn effective representations for downstream forecasting task. Extensive experiments, in comparison with state-of-the-arts, well demonstrate the effectiveness of DE-TSMCL, where the maximum improvement can reach to 27.3%. ",
    "url": "https://arxiv.org/abs/2401.17802",
    "authors": [
      "Haozhi Gao",
      "Qianqian Ren",
      "Jinbao Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.17809",
    "title": "SWEA: Changing Factual Knowledge in Large Language Models via Subject  Word Embedding Altering",
    "abstract": "Model editing has recently gained widespread attention. Current model editing methods primarily involve modifying model parameters or adding additional modules to the existing model. However, the former causes irreversible damage to LLMs, while the latter incurs additional inference overhead and fuzzy vector matching is not always reliable. To address these issues, we propose an expandable Subject Word Embedding Altering (SWEA) framework, which modifies the representation of subjects and achieve the goal of editing knowledge during the inference stage. SWEA uses precise key matching outside the model and performs reliable subject word embedding altering, thus protecting the original weights of the model without increasing inference overhead. We then propose optimizing then suppressing fusion method, which first optimizes the embedding vector for the editing target and then suppresses the Knowledge Embedding Dimension (KED) to obtain the final fused embedding. We thus propose SWEAOS method for editing factual knowledge in LLMs. We demonstrate the state-of-the-art performance of SWEAOS on the COUNTERFACT and zsRE datasets. To further validate the reasoning ability of SWEAOS in editing knowledge, we evaluate it on the more complex RIPPLEEDITS benchmark. The results on two subdatasets demonstrate that our SWEAOS possesses state-of-the-art reasoning ability. ",
    "url": "https://arxiv.org/abs/2401.17809",
    "authors": [
      "Xiaopeng Li",
      "Shasha Li",
      "Bin Ji",
      "Shezheng Song",
      "Xi Wang",
      "Jun Ma",
      "Jie Yu",
      "Xiaodong Liu",
      "Jing Wang",
      "Weimin Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.17820",
    "title": "The 1/3-conjectures for domination in cubic graphs",
    "abstract": "A set S of vertices in a graph G is a dominating set of G if every vertex not in S is adjacent to a vertex in S . The domination number of G, denoted by $\\gamma$(G), is the minimum cardinality of a dominating set in G. In a breakthrough paper in 2008, L{\\\"o}wenstein and Rautenbach proved that if G is a cubic graph of order n and girth at least 83, then $\\gamma$(G) $\\le$ n/3. A natural question is if this girth condition can be lowered. The question gave birth to two 1/3-conjectures for domination in cubic graphs. The first conjecture, posed by Verstraete in 2010, states that if G is a cubic graph on n vertices with girth at least 6, then $\\gamma$(G) $\\le$ n/3. The second conjecture, first posed as a question by Kostochka in 2009, states that if G is a cubic, bipartite graph of order n, then $\\gamma$(G) $\\le$n/3. In this paper, we prove Verstraete's conjecture when there is no 7-cycle and no 8-cycle, and we prove the Kostochka's related conjecture for bipartite graphs when there is no 4-cycle and no 8-cycle. ",
    "url": "https://arxiv.org/abs/2401.17820",
    "authors": [
      "Paul Dorbec",
      "Michael Antony Henning"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2401.17821",
    "title": "Do Object Detection Localization Errors Affect Human Performance and  Trust?",
    "abstract": "Bounding boxes are often used to communicate automatic object detection results to humans, aiding humans in a multitude of tasks. We investigate the relationship between bounding box localization errors and human task performance. We use observer performance studies on a visual multi-object counting task to measure both human trust and performance with different levels of bounding box accuracy. The results show that localization errors have no significant impact on human accuracy or trust in the system. Recall and precision errors impact both human performance and trust, suggesting that optimizing algorithms based on the F1 score is more beneficial in human-computer tasks. Lastly, the paper offers an improvement on bounding boxes in multi-object counting tasks with center dots, showing improved performance and better resilience to localization inaccuracy. ",
    "url": "https://arxiv.org/abs/2401.17821",
    "authors": [
      "Sven de Witte",
      "Ombretta Strafforello",
      "Jan van Gemert"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2401.17827",
    "title": "Neural Machine Translation for Malayalam Paraphrase Generation",
    "abstract": "This study explores four methods of generating paraphrases in Malayalam, utilizing resources available for English paraphrasing and pre-trained Neural Machine Translation (NMT) models. We evaluate the resulting paraphrases using both automated metrics, such as BLEU, METEOR, and cosine similarity, as well as human annotation. Our findings suggest that automated evaluation measures may not be fully appropriate for Malayalam, as they do not consistently align with human judgment. This discrepancy underscores the need for more nuanced paraphrase evaluation approaches especially for highly agglutinative languages. ",
    "url": "https://arxiv.org/abs/2401.17827",
    "authors": [
      "Christeena Varghese",
      "Sergey Koshelev",
      "Ivan P. Yamshchikov"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.17838",
    "title": "A Cross-View Hierarchical Graph Learning Hypernetwork for Skill  Demand-Supply Joint Prediction",
    "abstract": "The rapidly changing landscape of technology and industries leads to dynamic skill requirements, making it crucial for employees and employers to anticipate such shifts to maintain a competitive edge in the labor market. Existing efforts in this area either rely on domain-expert knowledge or regarding skill evolution as a simplified time series forecasting problem. However, both approaches overlook the sophisticated relationships among different skills and the inner-connection between skill demand and supply variations. In this paper, we propose a Cross-view Hierarchical Graph learning Hypernetwork (CHGH) framework for joint skill demand-supply prediction. Specifically, CHGH is an encoder-decoder network consisting of i) a cross-view graph encoder to capture the interconnection between skill demand and supply, ii) a hierarchical graph encoder to model the co-evolution of skills from a cluster-wise perspective, and iii) a conditional hyper-decoder to jointly predict demand and supply variations by incorporating historical demand-supply gaps. Extensive experiments on three real-world datasets demonstrate the superiority of the proposed framework compared to seven baselines and the effectiveness of the three modules. ",
    "url": "https://arxiv.org/abs/2401.17838",
    "authors": [
      "Wenshuo Chao",
      "Zhaopeng Qiu",
      "Likang Wu",
      "Zhuoning Guo",
      "Zhi Zheng",
      "Hengshu Zhu",
      "Hao Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.17840",
    "title": "Propagation Dynamics of Rumor vs. Non-rumor across Multiple Social Media  Platforms Driven by User Characteristics",
    "abstract": "Studying information propagation dynamics in social media can elucidate user behaviors and patterns. However, previous research often focuses on single platforms and fails to differentiate between the nuanced roles of source users and other participants in cascades. To address these limitations, we analyze propagation cascades on Twitter and Weibo combined with a crawled dataset of nearly one million users with authentic attributes. Our preliminary findings from multiple platforms robustly indicate that rumors tend to spread more deeply, while non-rumors distribute more broadly. Interestingly, we discover that the spread of rumors is slower, persists longer, and, in most cases, involves fewer participants than that of non-rumors. And an undiscovered highlight is that reputable active users, termed `onlookers', inadvertently or unwittingly spread rumors due to their extensive online interactions and the allure of sensational fake news. Conversely, celebrities exhibit caution, mindful of releasing unverified information. Additionally, we identify cascade features aligning with exponential patterns, highlight the Credibility Erosion Effect (CEE) phenomenon in the propagation process, and discover the different contents and policies between the two platforms. Our findings enhance current understanding and provide a valuable statistical analysis for future research. ",
    "url": "https://arxiv.org/abs/2401.17840",
    "authors": [
      "Dongpeng Hou",
      "Shu Yin",
      "Chao Gao",
      "Xianghua Li",
      "Zhen Wang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.17859",
    "title": "Towards Semantic Consistency: Dirichlet Energy Driven Robust Multi-Modal  Entity Alignment",
    "abstract": "In Multi-Modal Knowledge Graphs (MMKGs), Multi-Modal Entity Alignment (MMEA) is crucial for identifying identical entities across diverse modal attributes. However, semantic inconsistency, mainly due to missing modal attributes, poses a significant challenge. Traditional approaches rely on attribute interpolation, but this often introduces modality noise, distorting the original semantics. Moreover, the lack of a universal theoretical framework limits advancements in achieving semantic consistency. This study introduces a novel approach, DESAlign, which addresses these issues by applying a theoretical framework based on Dirichlet energy to ensure semantic consistency. We discover that semantic inconsistency leads to model overfitting to modality noise, causing performance fluctuations, particularly when modalities are missing. DESAlign innovatively combats over-smoothing and interpolates absent semantics using existing modalities. Our approach includes a multi-modal knowledge graph learning strategy and a propagation technique that employs existing semantic features to compensate for missing ones, providing explicit Euler solutions. Comprehensive evaluations across 18 benchmarks, including monolingual and bilingual scenarios, demonstrate that DESAlign surpasses existing methods, setting a new standard in performance. Further testing on 42 benchmarks with high rates of missing modalities confirms its robustness, offering an effective solution to semantic inconsistency in real-world MMKGs. ",
    "url": "https://arxiv.org/abs/2401.17859",
    "authors": [
      "Yuanyi Wang",
      "Haifeng Sun",
      "Jiabo Wang",
      "Jingyu Wang",
      "Wei Tang",
      "Qi Qi",
      "Shaoling Sun",
      "Jianxin Liao"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2401.17879",
    "title": "AEROBLADE: Training-Free Detection of Latent Diffusion Images Using  Autoencoder Reconstruction Error",
    "abstract": "With recent text-to-image models, anyone can generate deceptively realistic images with arbitrary contents, fueling the growing threat of visual disinformation. A key enabler for generating high-resolution images with low computational cost has been the development of latent diffusion models (LDMs). In contrast to conventional diffusion models, LDMs perform the denoising process in the low-dimensional latent space of a pre-trained autoencoder (AE) instead of the high-dimensional image space. Despite their relevance, the forensic analysis of LDMs is still in its infancy. In this work we propose AEROBLADE, a novel detection method which exploits an inherent component of LDMs: the AE used to transform images between image and latent space. We find that generated images can be more accurately reconstructed by the AE than real images, allowing for a simple detection approach based on the reconstruction error. Most importantly, our method is easy to implement and does not require any training, yet nearly matches the performance of detectors that rely on extensive training. We empirically demonstrate that AEROBLADE is effective against state-of-the-art LDMs including Stable Diffusion and Midjourney. Beyond detection, our approach allows for the qualitative analysis of images, which can be leveraged for identifying inpainted regions. ",
    "url": "https://arxiv.org/abs/2401.17879",
    "authors": [
      "Jonas Ricker",
      "Denis Lukovnikov",
      "Asja Fischer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.17880",
    "title": "Graph Attention-based Reinforcement Learning for Trajectory Design and  Resource Assignment in Multi-UAV Assisted Communication",
    "abstract": "In the multiple unmanned aerial vehicle (UAV)- assisted downlink communication, it is challenging for UAV base stations (UAV BSs) to realize trajectory design and resource assignment in unknown environments. The cooperation and competition between UAV BSs in the communication network leads to a Markov game problem. Multi-agent reinforcement learning is a significant solution for the above decision-making. However, there are still many common issues, such as the instability of the system and low utilization of historical data, that limit its application. In this paper, a novel graph-attention multi-agent trust region (GA-MATR) reinforcement learning framework is proposed to solve the multi-UAV assisted communication problem. Graph recurrent network is introduced to process and analyze complex topology of the communication network, so as to extract useful information and patterns from observational information. The attention mechanism provides additional weighting for conveyed information, so that the critic network can accurately evaluate the value of behavior for UAV BSs. This provides more reliable feedback signals and helps the actor network update the strategy more effectively. Ablation simulations indicate that the proposed approach attains improved convergence over the baselines. UAV BSs learn the optimal communication strategies to achieve their maximum cumulative rewards. Additionally, multi-agent trust region method with monotonic convergence provides an estimated Nash equilibrium for the multi-UAV assisted communication Markov game. ",
    "url": "https://arxiv.org/abs/2401.17880",
    "authors": [
      "Zikai Feng",
      "Di Wu",
      "Mengxing Huang",
      "Chau Yuen"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.17881",
    "title": "PVLR: Prompt-driven Visual-Linguistic Representation Learning for  Multi-Label Image Recognition",
    "abstract": "Multi-label image recognition is a fundamental task in computer vision. Recently, vision-language models have made notable advancements in this area. However, previous methods often failed to effectively leverage the rich knowledge within language models and instead incorporated label semantics into visual features in a unidirectional manner. In this paper, we propose a Prompt-driven Visual-Linguistic Representation Learning (PVLR) framework to better leverage the capabilities of the linguistic modality. In PVLR, we first introduce a dual-prompting strategy comprising Knowledge-Aware Prompting (KAP) and Context-Aware Prompting (CAP). KAP utilizes fixed prompts to capture the intrinsic semantic knowledge and relationships across all labels, while CAP employs learnable prompts to capture context-aware label semantics and relationships. Later, we propose an Interaction and Fusion Module (IFM) to interact and fuse the representations obtained from KAP and CAP. In contrast to the unidirectional fusion in previous works, we introduce a Dual-Modal Attention (DMA) that enables bidirectional interaction between textual and visual features, yielding context-aware label representations and semantic-related visual representations, which are subsequently used to calculate similarities and generate final predictions for all labels. Extensive experiments on three popular datasets including MS-COCO, Pascal VOC 2007, and NUS-WIDE demonstrate the superiority of PVLR. ",
    "url": "https://arxiv.org/abs/2401.17881",
    "authors": [
      "Hao Tan",
      "Zichang Tan",
      "Jun Li",
      "Jun Wan",
      "Zhen Lei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.17887",
    "title": "Detecting Groups in Directed and Non-Directed Bipartite Networks",
    "abstract": "Bipartite networks provide an effective resource for representing, characterizing, and modeling several abstract and real-world systems and structures involving binary relations, which include food webs, social interactions, and customer-product relationships. Of particular interest is the problem of, given a specific bipartite network, to identify possible respective groups or clusters characterized by similar interconnecting patterns. The present work approaches this issue by extending and complementing a previously described coincidence similarity methodology (Bioarxiv, doi.org/10.1101/2022.07.16.500294) in several manners, including the consideration of direct and non-directed bipartite networks, the characterization of groups in those networks, as well as considering synthetic bipartite networks presenting groups as a resource for studying the performance of the described methodology. Several interesting results are described and discussed, including the corroboration of the potential of the coincidence similarity methodology for achieving enhanced separation between the groups in bipartite networks. ",
    "url": "https://arxiv.org/abs/2401.17887",
    "authors": [
      "Alexandre Benatti",
      "Luciano da F. Costa"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.17890",
    "title": "The inherent randomness of news virality on social media",
    "abstract": "Initially conceived for entertainment, social media platforms have profoundly transformed the dissemination of information and consequently reshaped the dynamics of agenda-setting. In this scenario, understanding the factors that capture audience attention and drive viral content is crucial. Employing Gibrat's Law, which posits that an entity's growth rate is unrelated to its size, we examine the engagement growth dynamics of news outlets on social media. Our analysis encloses the Facebook historical data of over a thousand news outlets, encompassing approximately 57 million posts in four European languages from 2008 to the end of 2022. We discover universal growth dynamics according to which news virality is independent of the traditional size or engagement with the outlet. Moreover, our analysis reveals a significant long-term impact of news source reliability on engagement growth, with engagement induced by unreliable sources decreasing over time. We conclude the paper by presenting a statistical model replicating the observed growth dynamics. ",
    "url": "https://arxiv.org/abs/2401.17890",
    "authors": [
      "Emanuele Sangiorgio",
      "Matteo Cinelli",
      "Roy Cerqueti",
      "Walter Quattrociocchi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2401.17895",
    "title": "ReplaceAnything3D:Text-Guided 3D Scene Editing with Compositional Neural  Radiance Fields",
    "abstract": "We introduce ReplaceAnything3D model (RAM3D), a novel text-guided 3D scene editing method that enables the replacement of specific objects within a scene. Given multi-view images of a scene, a text prompt describing the object to replace, and a text prompt describing the new object, our Erase-and-Replace approach can effectively swap objects in the scene with newly generated content while maintaining 3D consistency across multiple viewpoints. We demonstrate the versatility of ReplaceAnything3D by applying it to various realistic 3D scenes, showcasing results of modified foreground objects that are well-integrated with the rest of the scene without affecting its overall integrity. ",
    "url": "https://arxiv.org/abs/2401.17895",
    "authors": [
      "Edward Bartrum",
      "Thu Nguyen-Phuoc",
      "Chris Xie",
      "Zhengqin Li",
      "Numair Khan",
      "Armen Avetisyan",
      "Douglas Lanman",
      "Lei Xiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2401.17910",
    "title": "Controllable Dense Captioner with Multimodal Embedding Bridging",
    "abstract": "In this paper, we propose a controllable dense captioner (ControlCap), which accommodates user's intention to dense captioning by introducing linguistic guidance. ControlCap is defined as a multimodal embedding bridging architecture, which comprises multimodal embedding generation (MEG) module and bi-directional embedding bridging (BEB) module. While MEG module represents objects/regions by combining embeddings of detailed information with context-aware ones, it also endows ControlCap the adaptability to specialized controls by utilizing them as linguistic guidance. BEB module aligns the linguistic guidance with visual embeddings through borrowing/returning features from/to the visual domain and gathering such features to predict text descriptions. Experiments on Visual Genome and VG-COCO datasets show that ControlCap respectively outperforms the state-of-the-art methods by 1.5% and 3.7% (mAP). Last but not least, with the capability of converting region-category pairs to region-text pairs, ControlCap is able to act as a powerful data engine for dense captioning. Code is available at https://github.com/callsys/ControlCap. ",
    "url": "https://arxiv.org/abs/2401.17910",
    "authors": [
      "Yuzhong Zhao",
      "Yue Liu",
      "Zonghao Guo",
      "Weijia Wu",
      "Chen Gong",
      "Qixiang Ye",
      "Fang Wan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.17911",
    "title": "SNNLP: Energy-Efficient Natural Language Processing Using Spiking Neural  Networks",
    "abstract": "As spiking neural networks receive more attention, we look toward applications of this computing paradigm in fields other than computer vision and signal processing. One major field, underexplored in the neuromorphic setting, is Natural Language Processing (NLP), where most state-of-the-art solutions still heavily rely on resource-consuming and power-hungry traditional deep learning architectures. Therefore, it is compelling to design NLP models for neuromorphic architectures due to their low energy requirements, with the additional benefit of a more human-brain-like operating model for processing information. However, one of the biggest issues with bringing NLP to the neuromorphic setting is in properly encoding text into a spike train so that it can be seamlessly handled by both current and future SNN architectures. In this paper, we compare various methods of encoding text as spikes and assess each method's performance in an associated SNN on a downstream NLP task, namely, sentiment analysis. Furthermore, we go on to propose a new method of encoding text as spikes that outperforms a widely-used rate-coding technique, Poisson rate-coding, by around 13\\% on our benchmark NLP tasks. Subsequently, we demonstrate the energy efficiency of SNNs implemented in hardware for the sentiment analysis task compared to traditional deep neural networks, observing an energy efficiency increase of more than 32x during inference and 60x during training while incurring the expected energy-performance tradeoff. ",
    "url": "https://arxiv.org/abs/2401.17911",
    "authors": [
      "R. Alexander Knipper",
      "Kaniz Mishty",
      "Mehdi Sadi",
      "Shubhra Kanti Karmaker Santu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.17914",
    "title": "Attention Graph for Multi-Robot Social Navigation with Deep  Reinforcement Learning",
    "abstract": "Learning robot navigation strategies among pedestrian is crucial for domain based applications. Combining perception, planning and prediction allows us to model the interactions between robots and pedestrians, resulting in impressive outcomes especially with recent approaches based on deep reinforcement learning (RL). However, these works do not consider multi-robot scenarios. In this paper, we present MultiSoc, a new method for learning multi-agent socially aware navigation strategies using RL. Inspired by recent works on multi-agent deep RL, our method leverages graph-based representation of agent interactions, combining the positions and fields of view of entities (pedestrians and agents). Each agent uses a model based on two Graph Neural Network combined with attention mechanisms. First an edge-selector produces a sparse graph, then a crowd coordinator applies node attention to produce a graph representing the influence of each entity on the others. This is incorporated into a model-free RL framework to learn multi-agent policies. We evaluate our approach on simulation and provide a series of experiments in a set of various conditions (number of agents / pedestrians). Empirical results show that our method learns faster than social navigation deep RL mono-agent techniques, and enables efficient multi-agent implicit coordination in challenging crowd navigation with multiple heterogeneous humans. Furthermore, by incorporating customizable meta-parameters, we can adjust the neighborhood density to take into account in our navigation strategy. ",
    "url": "https://arxiv.org/abs/2401.17914",
    "authors": [
      "Erwan Escudie",
      "Laetitia Matignon",
      "Jacques Saraydaryan"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.17916",
    "title": "Source-free Domain Adaptive Object Detection in Remote Sensing Images",
    "abstract": "Recent studies have used unsupervised domain adaptive object detection (UDAOD) methods to bridge the domain gap in remote sensing (RS) images. However, UDAOD methods typically assume that the source domain data can be accessed during the domain adaptation process. This setting is often impractical in the real world due to RS data privacy and transmission difficulty. To address this challenge, we propose a practical source-free object detection (SFOD) setting for RS images, which aims to perform target domain adaptation using only the source pre-trained model. We propose a new SFOD method for RS images consisting of two parts: perturbed domain generation and alignment. The proposed multilevel perturbation constructs the perturbed domain in a simple yet efficient form by perturbing the domain-variant features at the image level and feature level according to the color and style bias. The proposed multilevel alignment calculates feature and label consistency between the perturbed domain and the target domain across the teacher-student network, and introduces the distillation of feature prototype to mitigate the noise of pseudo-labels. By requiring the detector to be consistent in the perturbed domain and the target domain, the detector is forced to focus on domaininvariant features. Extensive results of three synthetic-to-real experiments and three cross-sensor experiments have validated the effectiveness of our method which does not require access to source domain RS images. Furthermore, experiments on computer vision datasets show that our method can be extended to other fields as well. Our code will be available at: https://weixliu.github.io/ . ",
    "url": "https://arxiv.org/abs/2401.17916",
    "authors": [
      "Weixing Liu",
      "Jun Liu",
      "Xin Su",
      "Han Nie",
      "Bin Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.17917",
    "title": "GuardFS: a File System for Integrated Detection and Mitigation of  Linux-based Ransomware",
    "abstract": "Although ransomware has received broad attention in media and research, this evolving threat vector still poses a systematic threat. Related literature has explored their detection using various approaches leveraging Machine and Deep Learning. While these approaches are effective in detecting malware, they do not answer how to use this intelligence to protect against threats, raising concerns about their applicability in a hostile environment. Solutions that focus on mitigation rarely explore how to prevent and not just alert or halt its execution, especially when considering Linux-based samples. This paper presents GuardFS, a file system-based approach to investigate the integration of detection and mitigation of ransomware. Using a bespoke overlay file system, data is extracted before files are accessed. Models trained on this data are used by three novel defense configurations that obfuscate, delay, or track access to the file system. The experiments on GuardFS test the configurations in a reactive setting. The results demonstrate that although data loss cannot be completely prevented, it can be significantly reduced. Usability and performance analysis demonstrate that the defense effectiveness of the configurations relates to their impact on resource consumption and usability. ",
    "url": "https://arxiv.org/abs/2401.17917",
    "authors": [
      "Jan von der Assen",
      "Chao Feng",
      "Alberto Huertas Celdrán",
      "Róbert Oleš",
      "Gérôme Bovet",
      "Burkhard Stiller"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.17948",
    "title": "HyperZ$\\cdot$Z$\\cdot$W Operator Connects Slow-Fast Networks for Full  Context Interaction",
    "abstract": "The self-attention mechanism utilizes large implicit weight matrices, programmed through dot product-based activations with very few trainable parameters, to enable long sequence modeling. In this paper, we investigate the possibility of discarding residual learning by employing large implicit kernels to achieve full context interaction at each layer of the network. To accomplish it, we introduce coordinate-based implicit MLPs as a slow network to generate hyper-kernels for another fast convolutional network. To get context-varying weights for fast dynamic encoding, we propose a $\\mathrm{Hyper}\\mathcal{Z{\\cdot}Z{\\cdot}W}$ operator that connects hyper-kernels ($\\mathcal{W}$) and hidden activations ($\\mathcal{Z}$) through simple elementwise multiplication, followed by convolution of $\\mathcal{Z}$ using the context-dependent $\\mathcal{W}$. Based on this design, we present a novel Terminator architecture that integrates hyper-kernels of different sizes to produce multi-branch hidden representations for enhancing the feature extraction capability of each layer. Additionally, a bottleneck layer is employed to compress the concatenated channels, allowing only valuable information to propagate to the subsequent layers. Notably, our model incorporates several innovative components and exhibits excellent properties, such as introducing local feedback error for updating the slow network, stable zero-mean features, faster training convergence, and fewer model parameters. Extensive experimental results on pixel-level 1D and 2D image classification benchmarks demonstrate the superior performance of our architecture. ",
    "url": "https://arxiv.org/abs/2401.17948",
    "authors": [
      "Harvie Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.17967",
    "title": "CONCORD: Towards a DSL for Configurable Graph Code Representation",
    "abstract": "Deep learning is widely used to uncover hidden patterns in large code corpora. To achieve this, constructing a format that captures the relevant characteristics and features of source code is essential. Graph-based representations have gained attention for their ability to model structural and semantic information. However, existing tools lack flexibility in constructing graphs across different programming languages, limiting their use. Additionally, the output of these tools often lacks interoperability and results in excessively large graphs, making graph-based neural networks training slower and less scalable. We introduce CONCORD, a domain-specific language to build customizable graph representations. It implements reduction heuristics to reduce graphs' size complexity. We demonstrate its effectiveness in code smell detection as an illustrative use case and show that: first, CONCORD can produce code representations automatically per the specified configuration, and second, our heuristics can achieve comparable performance with significantly reduced size. CONCORD will help researchers a) create and experiment with customizable graph-based code representations for different software engineering tasks involving DL, b) reduce the engineering work to generate graph representations, c) address the issue of scalability in GNN models, and d) enhance the reproducibility of experiments in research through a standardized approach to code representation and analysis. ",
    "url": "https://arxiv.org/abs/2401.17967",
    "authors": [
      "Mootez Saad",
      "Tushar Sharma"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.17972",
    "title": "MelNet: A Real-Time Deep Learning Algorithm for Object Detection",
    "abstract": "In this study, a novel deep learning algorithm for object detection, named MelNet, was introduced. MelNet underwent training utilizing the KITTI dataset for object detection. Following 300 training epochs, MelNet attained an mAP (mean average precision) score of 0.732. Additionally, three alternative models -YOLOv5, EfficientDet, and Faster-RCNN-MobileNetv3- were trained on the KITTI dataset and juxtaposed with MelNet for object detection. The outcomes underscore the efficacy of employing transfer learning in certain instances. Notably, preexisting models trained on prominent datasets (e.g., ImageNet, COCO, and Pascal VOC) yield superior results. Another finding underscores the viability of creating a new model tailored to a specific scenario and training it on a specific dataset. This investigation demonstrates that training MelNet exclusively on the KITTI dataset also surpasses EfficientDet after 150 epochs. Consequently, post-training, MelNet's performance closely aligns with that of other pre-trained models. ",
    "url": "https://arxiv.org/abs/2401.17972",
    "authors": [
      "Yashar Azadvatan",
      "Murat Kurt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.17975",
    "title": "Understanding polysemanticity in neural networks through coding theory",
    "abstract": "Despite substantial efforts, neural network interpretability remains an elusive goal, with previous research failing to provide succinct explanations of most single neurons' impact on the network output. This limitation is due to the polysemantic nature of most neurons, whereby a given neuron is involved in multiple unrelated network states, complicating the interpretation of that neuron. In this paper, we apply tools developed in neuroscience and information theory to propose both a novel practical approach to network interpretability and theoretical insights into polysemanticity and the density of codes. We infer levels of redundancy in the network's code by inspecting the eigenspectrum of the activation's covariance matrix. Furthermore, we show how random projections can reveal whether a network exhibits a smooth or non-differentiable code and hence how interpretable the code is. This same framework explains the advantages of polysemantic neurons to learning performance and explains trends found in recent results by Elhage et al.~(2022). Our approach advances the pursuit of interpretability in neural networks, providing insights into their underlying structure and suggesting new avenues for circuit-level interpretability. ",
    "url": "https://arxiv.org/abs/2401.17975",
    "authors": [
      "Simon C. Marshall",
      "Jan H. Kirchner"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.17981",
    "title": "Enhancing Multimodal Large Language Models with Vision Detection Models:  An Empirical Study",
    "abstract": "Despite the impressive capabilities of Multimodal Large Language Models (MLLMs) in integrating text and image modalities, challenges remain in accurately interpreting detailed visual elements. This paper presents an empirical study on enhancing MLLMs with state-of-the-art (SOTA) object detection and Optical Character Recognition models to improve fine-grained image understanding and reduce hallucination in responses. Our research investigates the embedding-based infusion of detection information, the impact of such infusion on the MLLMs' original abilities, and the interchangeability of detection models. We conduct systematic experiments with models such as LLaVA-1.5, DINO, and PaddleOCRv2, revealing that our approach not only refines MLLMs' performance in specific visual tasks but also maintains their original strengths. The resulting enhanced MLLMs outperform SOTA models on 9 out of 10 benchmarks, achieving an improvement of up to 12.99% on the normalized average score, marking a notable advancement in multimodal understanding. We release our codes to facilitate further exploration into the fine-grained multimodal dialogue capabilities of MLLMs. ",
    "url": "https://arxiv.org/abs/2401.17981",
    "authors": [
      "Qirui Jiao",
      "Daoyuan Chen",
      "Yilun Huang",
      "Yaliang Li",
      "Ying Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.17992",
    "title": "Multilinear Operator Networks",
    "abstract": "Despite the remarkable capabilities of deep neural networks in image recognition, the dependence on activation functions remains a largely unexplored area and has yet to be eliminated. On the other hand, Polynomial Networks is a class of models that does not require activation functions, but have yet to perform on par with modern architectures. In this work, we aim close this gap and propose MONet, which relies solely on multilinear operators. The core layer of MONet, called Mu-Layer, captures multiplicative interactions of the elements of the input token. MONet captures high-degree interactions of the input elements and we demonstrate the efficacy of our approach on a series of image recognition and scientific computing benchmarks. The proposed model outperforms prior polynomial networks and performs on par with modern architectures. We believe that MONet can inspire further research on models that use entirely multilinear operations. ",
    "url": "https://arxiv.org/abs/2401.17992",
    "authors": [
      "Yixin Cheng",
      "Grigorios G. Chrysos",
      "Markos Georgopoulos",
      "Volkan Cevher"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.17996",
    "title": "Development and Adaptation of Robotic Vision in the Real-World: the  Challenge of Door Detection",
    "abstract": "Mobile service robots are increasingly prevalent in human-centric, real-world domains, operating autonomously in unconstrained indoor environments. In such a context, robotic vision plays a central role in enabling service robots to perceive high-level environmental features from visual observations. Despite the data-driven approaches based on deep learning push the boundaries of vision systems, applying these techniques to real-world robotic scenarios presents unique methodological challenges. Traditional models fail to represent the challenging perception constraints typical of service robots and must be adapted for the specific environment where robots finally operate. We propose a method leveraging photorealistic simulations that balances data quality and acquisition costs for synthesizing visual datasets from the robot perspective used to train deep architectures. Then, we show the benefits in qualifying a general detector for the target domain in which the robot is deployed, showing also the trade-off between the effort for obtaining new examples from such a setting and the performance gain. In our extensive experimental campaign, we focus on the door detection task (namely recognizing the presence and the traversability of doorways) that, in dynamic settings, is useful to infer the topology of the map. Our findings are validated in a real-world robot deployment, comparing prominent deep-learning models and demonstrating the effectiveness of our approach in practical settings. ",
    "url": "https://arxiv.org/abs/2401.17996",
    "authors": [
      "Michele Antonazzi",
      "Matteo Luperto",
      "N. Alberto Borghese",
      "Nicola Basilico"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.18018",
    "title": "Prompt-Driven LLM Safeguarding via Directed Representation Optimization",
    "abstract": "Prepending model inputs with safety prompts is a common practice of safeguarding large language models (LLMs) from complying with queries that contain harmful intents. However, the working mechanisms of safety prompts have not yet been fully understood, which hinders the potential for automatically optimizing them for improved LLM safety. Motivated by this problem, we investigate the impact of safety prompts from the perspective of model representations. We find that in models' representation space, harmful and harmless queries can be largely distinguished, but this is not noticeably enhanced by safety prompts. Instead, the queries' representations are moved by different safety prompts in similar directions, where models become more prone to refusal (i.e., refusing to provide assistance) even when the queries are harmless. Inspired by these findings, we propose a method called DRO (Directed Representation Optimization) for automatic safety prompt optimization. DRO treats safety prompts as continuous, trainable embeddings and learns to move the representations of harmful/harmless queries along/opposite the direction in which the model's refusal probability increases. We demonstrate that DRO remarkably improves the safeguarding performance of human-crafted safety prompts and outperforms strong baselines, as evaluated on out-of-domain benchmarks, without compromising the general model capability. ",
    "url": "https://arxiv.org/abs/2401.18018",
    "authors": [
      "Chujie Zheng",
      "Fan Yin",
      "Hao Zhou",
      "Fandong Meng",
      "Jie Zhou",
      "Kai-Wei Chang",
      "Minlie Huang",
      "Nanyun Peng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.18019",
    "title": "Joining Entities Across Relation and Graph with a Unified Model",
    "abstract": "This paper introduces RG (Relational Genetic) model, a revised relational model to represent graph-structured data in RDBMS while preserving its topology, for efficiently and effectively extracting data in different formats from disparate sources. Along with: (a) SQL$_\\delta$, an SQL dialect augmented with graph pattern queries and tuple-vertex joins, such that one can extract graph properties via graph pattern matching, and \"semantically\" match entities across relations and graphs; (b) a logical representation of graphs in RDBMS, which introduces an exploration operator for efficient pattern querying, supports also browsing and updating graph-structured data; and (c) a strategy to uniformly evaluate SQL, pattern and hybrid queries that join tuples and vertices, all inside an RDBMS by leveraging its optimizer without performance degradation on switching different execution engines. A lightweight system, WhiteDB, is developed as an implementation to evaluate the benefits it can actually bring on real-life data. We empirically verified that the RG model enables the graph pattern queries to be answered as efficiently as in native graph engines; can consider the access on graph and relation in any order for optimal plan; and supports effective data enrichment. ",
    "url": "https://arxiv.org/abs/2401.18019",
    "authors": [
      "Wenzhi Fu"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2401.18035",
    "title": "Optimizing contrastive learning for cortical folding pattern detection",
    "abstract": "The human cerebral cortex has many bumps and grooves called gyri and sulci. Even though there is a high inter-individual consistency for the main cortical folds, this is not the case when we examine the exact shapes and details of the folding patterns. Because of this complexity, characterizing the cortical folding variability and relating them to subjects' behavioral characteristics or pathologies is still an open scientific problem. Classical approaches include labeling a few specific patterns, either manually or semi-automatically, based on geometric distances, but the recent availability of MRI image datasets of tens of thousands of subjects makes modern deep-learning techniques particularly attractive. Here, we build a self-supervised deep-learning model to detect folding patterns in the cingulate region. We train a contrastive self-supervised model (SimCLR) on both Human Connectome Project (1101 subjects) and UKBioBank (21070 subjects) datasets with topological-based augmentations on the cortical skeletons, which are topological objects that capture the shape of the folds. We explore several backbone architectures (convolutional network, DenseNet, and PointNet) for the SimCLR. For evaluation and testing, we perform a linear classification task on a database manually labeled for the presence of the \"double-parallel\" folding pattern in the cingulate region, which is related to schizophrenia characteristics. The best model, giving a test AUC of 0.76, is a convolutional network with 6 layers, a 10-dimensional latent space, a linear projection head, and using the branch-clipping augmentation. This is the first time that a self-supervised deep learning model has been applied to cortical skeletons on such a large dataset and quantitatively evaluated. We can now envisage the next step: applying it to other brain regions to detect other biomarkers. ",
    "url": "https://arxiv.org/abs/2401.18035",
    "authors": [
      "Aymeric Gaudin",
      "Louise Guillon",
      "Clara Fischer",
      "Arnaud Cachia",
      "Denis Rivière",
      "Jean-François Mangin",
      "Joël Chavas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.18054",
    "title": "Benchmarking Sensitivity of Continual Graph Learning for Skeleton-Based  Action Recognition",
    "abstract": "Continual learning (CL) is the research field that aims to build machine learning models that can accumulate knowledge continuously over different tasks without retraining from scratch. Previous studies have shown that pre-training graph neural networks (GNN) may lead to negative transfer (Hu et al., 2020) after fine-tuning, a setting which is closely related to CL. Thus, we focus on studying GNN in the continual graph learning (CGL) setting. We propose the first continual graph learning benchmark for spatio-temporal graphs and use it to benchmark well-known CGL methods in this novel setting. The benchmark is based on the N-UCLA and NTU-RGB+D datasets for skeleton-based action recognition. Beyond benchmarking for standard performance metrics, we study the class and task-order sensitivity of CGL methods, i.e., the impact of learning order on each class/task's performance, and the architectural sensitivity of CGL methods with backbone GNN at various widths and depths. We reveal that task-order robust methods can still be class-order sensitive and observe results that contradict previous empirical observations on architectural sensitivity in CL. ",
    "url": "https://arxiv.org/abs/2401.18054",
    "authors": [
      "Wei Wei",
      "Tom De Schepper",
      "Kevin Mets"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.18064",
    "title": "Neural Locality Sensitive Hashing for Entity Blocking",
    "abstract": "Locality-sensitive hashing (LSH) is a fundamental algorithmic technique widely employed in large-scale data processing applications, such as nearest-neighbor search, entity resolution, and clustering. However, its applicability in some real-world scenarios is limited due to the need for careful design of hashing functions that align with specific metrics. Existing LSH-based Entity Blocking solutions primarily rely on generic similarity metrics such as Jaccard similarity, whereas practical use cases often demand complex and customized similarity rules surpassing the capabilities of generic similarity metrics. Consequently, designing LSH functions for these customized similarity rules presents considerable challenges. In this research, we propose a neuralization approach to enhance locality-sensitive hashing by training deep neural networks to serve as hashing functions for complex metrics. We assess the effectiveness of this approach within the context of the entity resolution problem, which frequently involves the use of task-specific metrics in real-world applications. Specifically, we introduce NLSHBlock (Neural-LSH Block), a novel blocking methodology that leverages pre-trained language models, fine-tuned with a novel LSH-based loss function. Through extensive evaluations conducted on a diverse range of real-world datasets, we demonstrate the superiority of NLSHBlock over existing methods, exhibiting significant performance improvements. Furthermore, we showcase the efficacy of NLSHBlock in enhancing the performance of the entity matching phase, particularly within the semi-supervised setting. ",
    "url": "https://arxiv.org/abs/2401.18064",
    "authors": [
      "Runhui Wang",
      "Luyang Kong",
      "Yefan Tao",
      "Andrew Borthwick",
      "Davor Golac",
      "Henrik Johnson",
      "Shadie Hijazi",
      "Dong Deng",
      "Yongfeng Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2401.18083",
    "title": "Improved Scene Landmark Detection for Camera Localization",
    "abstract": "Camera localization methods based on retrieval, local feature matching, and 3D structure-based pose estimation are accurate but require high storage, are slow, and are not privacy-preserving. A method based on scene landmark detection (SLD) was recently proposed to address these limitations. It involves training a convolutional neural network (CNN) to detect a few predetermined, salient, scene-specific 3D points or landmarks and computing camera pose from the associated 2D-3D correspondences. Although SLD outperformed existing learning-based approaches, it was notably less accurate than 3D structure-based methods. In this paper, we show that the accuracy gap was due to insufficient model capacity and noisy labels during training. To mitigate the capacity issue, we propose to split the landmarks into subgroups and train a separate network for each subgroup. To generate better training labels, we propose using dense reconstructions to estimate visibility of scene landmarks. Finally, we present a compact architecture to improve memory efficiency. Accuracy wise, our approach is on par with state of the art structure based methods on the INDOOR-6 dataset but runs significantly faster and uses less storage. Code and models can be found at https://github.com/microsoft/SceneLandmarkLocalization. ",
    "url": "https://arxiv.org/abs/2401.18083",
    "authors": [
      "Tien Do",
      "Sudipta N. Sinha"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.17317",
    "title": "Detection of Auditory Brainstem Response Peaks Using Image Processing  Techniques in Infants with Normal Hearing Sensitivity",
    "abstract": "Introduction: The auditory brainstem response (ABR) is measured to find the brainstem-level peripheral auditory nerve system integrity in children having normal hearing. The Auditory Evoked Potential (AEP) is generated using acoustic stimuli. Interpreting these waves requires competence to avoid misdiagnosing hearing problems. Automating ABR test labeling with computer vision may reduce human error. Method: The ABR test results of 26 children aged 1 to 20 months with normal hearing in both ears were used. A new approach is suggested for automatically calculating the peaks of waves of different intensities (in decibels). The procedure entails acquiring wave images from an Audera device using the Color Thresholder method, segmenting each wave as a single wave image using the Image Region Analyzer application, converting all wave images into waves using Image Processing (IP) techniques, and finally calculating the latency of the peaks for each wave to be used by an audiologist for diagnosing the disease. Findings: Image processing techniques were able to detect 1, 3, and 5 waves in the diagnosis field with accuracy (0.82), (0.98), and (0.98), respectively, and its precision for waves 1, 3, and 5, were respectively (0.32), (0.97) and (0.87). This evaluation also worked well in the thresholding part and 82.7 % correctly detected the ABR waves. Conclusion: Our findings indicate that the audiology test battery suite can be made more accurate, quick, and error-free by using technology to automatically detect and label ABR waves. ",
    "url": "https://arxiv.org/abs/2401.17317",
    "authors": [
      "Amir Majidpour",
      "Samer Kais Jameel",
      "Jafar Majidpour",
      "Houra Bagheri",
      "Tarik A.Rashid",
      "Ahmadreza Nazeri",
      "Mahshid Moheb Aleaba"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2401.17424",
    "title": "Application of Neural Networks for the Reconstruction of Supernova  Neutrino Energy Spectra Following Fast Neutrino Flavor Conversions",
    "abstract": "Neutrinos can undergo fast flavor conversions (FFCs) within extremely dense astrophysical environments such as core-collapse supernovae (CCSNe) and neutron star mergers (NSMs). In this study, we explore FFCs in a \\emph{multi-energy} neutrino gas, revealing that when the FFC growth rate significantly exceeds that of the vacuum Hamiltonian, all neutrinos (regardless of energy) share a common survival probability dictated by the energy-integrated neutrino spectrum. We then employ physics-informed neural networks (PINNs) to predict the asymptotic outcomes of FFCs within such a multi-energy neutrino gas. These predictions are based on the first two moments of neutrino angular distributions for each energy bin, typically available in state-of-the-art CCSN and NSM simulations. Our PINNs achieve errors as low as $\\lesssim6\\%$ and $\\lesssim 18\\%$ for predicting the number of neutrinos in the electron channel and the relative absolute error in the neutrino moments, respectively. ",
    "url": "https://arxiv.org/abs/2401.17424",
    "authors": [
      "Sajad Abbar",
      "Meng-Ru Wu",
      "Zewei Xiong"
    ],
    "subjectives": [
      "High Energy Astrophysical Phenomena (astro-ph.HE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.17442",
    "title": "Detection of Signals in Colored Noise: Leading Eigenvalue Test for  Non-central $F$-matrices",
    "abstract": "This paper investigates the signal detection problem in colored noise with an unknown covariance matrix. In particular, we focus on detecting an unknown non-random signal by capitalizing on the leading eigenvalue of the whitened sample covariance matrix as the test statistic (a.k.a. Roy's largest root test). Since the unknown signal is non-random, the whitened sample covariance matrix turns out to have a non-central $F$-distribution. This distribution assumes a singular or non-singular form depending on whether the number of observations $p\\lessgtr$ the system dimensionality $m$. Therefore, we statistically characterize the leading eigenvalue of the singular and non-singular $F$-matrices by deriving their cumulative distribution functions (c.d.f.). Subsequently, they have been utilized in deriving the corresponding receiver operating characteristic (ROC) profiles. We also extend our analysis into the high dimensional domain. It turns out that, when the signal is sufficiently strong, the maximum eigenvalue can reliably detect it in this regime. Nevertheless, weak signals cannot be detected in the high dimensional regime with the leading eigenvalue. ",
    "url": "https://arxiv.org/abs/2401.17442",
    "authors": [
      "Prathapasinghe Dharmawansa",
      "Saman Atapattu",
      "Jamie Evans",
      "Kandeepan Sithamparanathan"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2401.17503",
    "title": "Differentiated Service Entanglement Routing for Quantum Networks",
    "abstract": "The entanglement distribution networks with various topologies are mainly implemented by active wavelength multiplexing routing strategies. However, designing an entanglement routing scheme, which achieves the maximized network connections and the optimal overall network efficiency simultaneously, remains a huge challenge for quantum networks. In this article, we propose a differentiated service entanglement routing (DSER) scheme, which firstly finds out the lowest loss paths and supported wavelength channels with the tensor-based path searching algorithm, and then allocates the paired channels with the differentiated routing strategies. The evaluation results show that the proposed DSER scheme can be performed for constructing various large scale quantum networks. ",
    "url": "https://arxiv.org/abs/2401.17503",
    "authors": [
      "Hui Han",
      "Bo Liu",
      "Bangying Tang",
      "Siyu Xiong",
      "Jinquan Huang",
      "Wanrong Yu",
      "Shuhui Chen"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.17513",
    "title": "A PNP ion channel deep learning solver with local neural network and  finite element input data",
    "abstract": "In this paper, a deep learning method for solving an improved one-dimensional Poisson-Nernst-Planck ion channel (PNPic) model, called the PNPic deep learning solver, is presented. In particular, it combines a novel local neural network scheme with an effective PNPic finite element solver. Since the input data of the neural network scheme only involves a small local patch of coarse grid solutions, which the finite element solver can quickly produce, the PNPic deep learning solver can be trained much faster than any corresponding conventional global neural network solvers. After properly trained, it can output a predicted PNPic solution in a much higher degree of accuracy than the low cost coarse grid solutions and can reflect different perturbation cases on the parameters, ion channel subregions, and interface and boundary values, etc. Consequently, the PNPic deep learning solver can generate a numerical solution with high accuracy for a family of PNPic models. As an initial study, two types of numerical tests were done by perturbing one and two parameters of the PNPic model, respectively, as well as the tests done by using a few perturbed interface positions of the model as training samples. These tests demonstrate that the PNPic deep learning solver can generate highly accurate PNPic numerical solutions. ",
    "url": "https://arxiv.org/abs/2401.17513",
    "authors": [
      "Hwi Lee",
      "Zhen Chao",
      "Harris Cobb",
      "Yingjie Liu",
      "Dexuan Xie"
    ],
    "subjectives": [
      "Biological Physics (physics.bio-ph)",
      "Artificial Intelligence (cs.AI)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2401.17690",
    "title": "EnCLAP: Combining Neural Audio Codec and Audio-Text Joint Embedding for  Automated Audio Captioning",
    "abstract": "We propose EnCLAP, a novel framework for automated audio captioning. EnCLAP employs two acoustic representation models, EnCodec and CLAP, along with a pretrained language model, BART. We also introduce a new training objective called masked codec modeling that improves acoustic awareness of the pretrained language model. Experimental results on AudioCaps and Clotho demonstrate that our model surpasses the performance of baseline models. Source code will be available at https://github.com/jaeyeonkim99/EnCLAP . An online demo is available at https://huggingface.co/spaces/enclap-team/enclap . ",
    "url": "https://arxiv.org/abs/2401.17690",
    "authors": [
      "Jaeyeon Kim",
      "Jaeyoon Jung",
      "Jinjoo Lee",
      "Sang Hoon Woo"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2401.17737",
    "title": "Hierarchical Bias-Driven Stratification for Interpretable Causal Effect  Estimation",
    "abstract": "Interpretability and transparency are essential for incorporating causal effect models from observational data into policy decision-making. They can provide trust for the model in the absence of ground truth labels to evaluate the accuracy of such models. To date, attempts at transparent causal effect estimation consist of applying post hoc explanation methods to black-box models, which are not interpretable. Here, we present BICauseTree: an interpretable balancing method that identifies clusters where natural experiments occur locally. Our approach builds on decision trees with a customized objective function to improve balancing and reduce treatment allocation bias. Consequently, it can additionally detect subgroups presenting positivity violations, exclude them, and provide a covariate-based definition of the target population we can infer from and generalize to. We evaluate the method's performance using synthetic and realistic datasets, explore its bias-interpretability tradeoff, and show that it is comparable with existing approaches. ",
    "url": "https://arxiv.org/abs/2401.17737",
    "authors": [
      "Lucile Ter-Minassian",
      "Liran Szlak",
      "Ehud Karavani",
      "Chris Holmes",
      "Yishai Shimoni"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.17814",
    "title": "Detection of Critical Events in Renewable Energy Production Time Series",
    "abstract": "The introduction of more renewable energy sources into the energy system increases the variability and weather dependence of electricity generation. Power system simulations are used to assess the adequacy and reliability of the electricity grid over decades, but often become computational intractable for such long simulation periods with high technical detail. To alleviate this computational burden, we investigate the use of outlier detection algorithms to find periods of extreme renewable energy generation which enables detailed modelling of the performance of power systems under these circumstances. Specifically, we apply the Maximum Divergent Intervals (MDI) algorithm to power generation time series that have been derived from ERA5 historical climate reanalysis covering the period from 1950 through 2019. By applying the MDI algorithm on these time series, we identified intervals of extreme low and high energy production. To determine the outlierness of an interval different divergence measures can be used. Where the cross-entropy measure results in shorter and strongly peaking outliers, the unbiased Kullback-Leibler divergence tends to detect longer and more persistent intervals. These intervals are regarded as potential risks for the electricity grid by domain experts, showcasing the capability of the MDI algorithm to detect critical events in these time series. For the historical period analysed, we found no trend in outlier intensity, or shift and lengthening of the outliers that could be attributed to climate change. By applying MDI on climate model output, power system modellers can investigate the adequacy and possible changes of risk for the current and future electricity grid under a wider range of scenarios. ",
    "url": "https://arxiv.org/abs/2401.17814",
    "authors": [
      "Laurens P. Stoop",
      "Erik Duijm",
      "Ad J. Feelders",
      "Machteld van den Broek"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2401.17846",
    "title": "Drift Diffusion Model to understand (mis)information sharing dynamic in  complex networks",
    "abstract": "Sharing misinformation threatens societies as misleading news shapes the risk perception of individuals. We witnessed this during the COVID-19 pandemic, where misinformation undermined the effectiveness of stay-at-home orders, posing an additional obstacle in the fight against the virus. In this research, we study misinformation spreading, reanalyzing behavioral data on online sharing, and analyzing decision-making mechanisms using the Drift Diffusion Model (DDM). We find that subjects display an increased instinctive inclination towards sharing misleading news, but rational thinking significantly curbs this reaction, especially for more cautious and older individuals. Using an agent-based model, we expand this individual knowledge to a social network where individuals are exposed to misinformation through friends and share (or not) content with probabilities driven by DDM. The natural shape of the Twitter network provides a fertile ground for any news to rapidly become viral, yet we found that limiting users' followers proves to be an appropriate and feasible containment strategy. ",
    "url": "https://arxiv.org/abs/2401.17846",
    "authors": [
      "Lucila G. Alvarez-Zuzek",
      "Jelena Grujic",
      "Riccardo Gallotti"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.17860",
    "title": "Automorphism groups of Cayley graphs generated by general transposition  sets",
    "abstract": "In this paper we study the Cayley graph $\\mathrm{Cay}(S_n,T)$ of the symmetric group $S_n$ generated by a set of transpositions $T$. We show that for $n\\geq 5$ the Cayley graph is normal. As a corollary, we show that its automorphism group is a direct product of $S_n$ and the automorphism group of the transposition graph associated to $T$. This provides an affirmative answer to a conjecture raised by Ganesan in arXiv:1703.08109, showing that $\\mathrm{Cay}(S_n,T)$ is normal if and only if the transposition graph is not $C_4$ or $K_n$. ",
    "url": "https://arxiv.org/abs/2401.17860",
    "authors": [
      "Dion Gijswijt",
      "Frank de Meijer"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2401.18012",
    "title": "Causal Coordinated Concurrent Reinforcement Learning",
    "abstract": "In this work, we propose a novel algorithmic framework for data sharing and coordinated exploration for the purpose of learning more data-efficient and better performing policies under a concurrent reinforcement learning (CRL) setting. In contrast to other work which make the assumption that all agents act under identical environments, we relax this restriction and instead consider the formulation where each agent acts within an environment which shares a global structure but also exhibits individual variations. Our algorithm leverages a causal inference algorithm in the form of Additive Noise Model - Mixture Model (ANM-MM) in extracting model parameters governing individual differentials via independence enforcement. We propose a new data sharing scheme based on a similarity measure of the extracted model parameters and demonstrate superior learning speeds on a set of autoregressive, pendulum and cart-pole swing-up tasks and finally, we show the effectiveness of diverse action selection between common agents under a sparse reward setting. To the best of our knowledge, this is the first work in considering non-identical environments in CRL and one of the few works which seek to integrate causal inference with reinforcement learning (RL). ",
    "url": "https://arxiv.org/abs/2401.18012",
    "authors": [
      "Tim Tse",
      "Isaac Chan",
      "Zhitang Chen"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.18017",
    "title": "Causal Discovery by Kernel Deviance Measures with Heterogeneous  Transforms",
    "abstract": "The discovery of causal relationships in a set of random variables is a fundamental objective of science and has also recently been argued as being an essential component towards real machine intelligence. One class of causal discovery techniques are founded based on the argument that there are inherent structural asymmetries between the causal and anti-causal direction which could be leveraged in determining the direction of causation. To go about capturing these discrepancies between cause and effect remains to be a challenge and many current state-of-the-art algorithms propose to compare the norms of the kernel mean embeddings of the conditional distributions. In this work, we argue that such approaches based on RKHS embeddings are insufficient in capturing principal markers of cause-effect asymmetry involving higher-order structural variabilities of the conditional distributions. We propose Kernel Intrinsic Invariance Measure with Heterogeneous Transform (KIIM-HT) which introduces a novel score measure based on heterogeneous transformation of RKHS embeddings to extract relevant higher-order moments of the conditional densities for causal discovery. Inference is made via comparing the score of each hypothetical cause-effect direction. Tests and comparisons on a synthetic dataset, a two-dimensional synthetic dataset and the real-world benchmark dataset T\\\"ubingen Cause-Effect Pairs verify our approach. In addition, we conduct a sensitivity analysis to the regularization parameter to faithfully compare previous work to our method and an experiment with trials on varied hyperparameter values to showcase the robustness of our algorithm. ",
    "url": "https://arxiv.org/abs/2401.18017",
    "authors": [
      "Tim Tse",
      "Zhitang Chen",
      "Shengyu Zhu",
      "Yue Liu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.18030",
    "title": "Distributed fixed-point algorithms for dynamic convex optimization over  decentralized and unbalanced wireless networks",
    "abstract": "We consider problems where agents in a network seek a common quantity, measured independently and periodically by each agent through a local time-varying process. Numerous solvers addressing such problems have been developed in the past, featuring various adaptations of the local processing and the consensus step. However, existing solvers still lack support for advanced techniques, such as superiorization and over-the-air function computation (OTA-C). To address this limitation, we introduce a comprehensive framework for the analysis of distributed algorithms by characterizing them using the quasi-Fej\\'er type algorithms and an extensive communication model. Under weak assumptions, we prove almost sure convergence of the algorithm to a common estimate for all agents. Moreover, we develop a specific class of algorithms within this framework to tackle distributed optimization problems with time-varying objectives, and, assuming that a time-invariant solution exists, prove its convergence to a solution. We also present a novel OTA-C protocol for consensus step in large decentralized networks, reducing communication overhead and enhancing network autonomy as compared to the existing protocols. The effectiveness of the algorithm, featuring superiorization and OTA-C, is demonstrated in a real-world application of distributed supervised learning over time-varying wireless networks, highlighting its low-latency and energy-efficiency compared to standard approaches. ",
    "url": "https://arxiv.org/abs/2401.18030",
    "authors": [
      "Navneet Agrawal",
      "Renato L.G. Cavalcante",
      "Slawomir Stanczak"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2401.18065",
    "title": "Game susceptibility, Correlation and Payoff capacity as a measure of  Cooperative behavior in the thermodynamic limit of some Social dilemmas",
    "abstract": "Analytically, finding the origins of cooperative behavior in infinite-player games is an exciting topic of current interest. Previously, cooperative behavior has been studied by considering game magnetization and individual player's average payoff as indicators. This paper shows that game susceptibility, correlation, and payoff capacity can aid in understanding cooperative behavior in social dilemmas in the thermodynamic limit. In this paper, we compare three analytical methods, i.e., Nash equilibrium mapping (NEM), Darwinian selection (DS), and Aggregate selection (AS), with a numerical-based method (ABM) via the game susceptibility, correlation, and payoff capacity as indicators of cooperative behavior. AS and DS fail compared to NEM and ABM by giving incorrect results for the indicators in question. The results obtained via NEM and ABM are in good agreement for all three indicators in question, for both Hawk-Dove and the Public goods games. After comparing the results obtained for all five indicators, we see that individual players' average payoff and payoff capacity are the best indicators to study cooperative behavior among players in the thermodynamic limit. This paper finds that NEM and ABM, along with the selected indicators, offer valuable insights into cooperative behavior in infinite-player games, contributing to understanding social dilemmas in the thermodynamic limit. ",
    "url": "https://arxiv.org/abs/2401.18065",
    "authors": [
      "Rajdeep Tah",
      "Colin Benjamin"
    ],
    "subjectives": [
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Multiagent Systems (cs.MA)",
      "Populations and Evolution (q-bio.PE)"
    ]
  },
  {
    "id": "arXiv:2112.10953",
    "title": "An adaptation of InfoMap to absorbing random walks using  absorption-scaled graphs",
    "abstract": " Title: An adaptation of InfoMap to absorbing random walks using  absorption-scaled graphs ",
    "url": "https://arxiv.org/abs/2112.10953",
    "authors": [
      "Esteban Vargas Bernal",
      "Mason A. Porter",
      "Joseph H. Tien"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)",
      "Adaptation and Self-Organizing Systems (nlin.AO)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2202.13833",
    "title": "Formally verified asymptotic consensus in robust networks",
    "abstract": " Comments: This paper has been accepted for publication at the TACAS,2024 conference ",
    "url": "https://arxiv.org/abs/2202.13833",
    "authors": [
      "Mohit Tekriwal",
      "Avi Tachna-Fram",
      "Jean-Baptiste Jeannin",
      "Manos Kapritsos",
      "Dimitra Panagou"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2206.05239",
    "title": "StructCoder: Structure-Aware Transformer for Code Generation",
    "abstract": " Title: StructCoder: Structure-Aware Transformer for Code Generation ",
    "url": "https://arxiv.org/abs/2206.05239",
    "authors": [
      "Sindhu Tipirneni",
      "Ming Zhu",
      "Chandan K. Reddy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2209.09641",
    "title": "Calibrating Segmentation Networks with Margin-based Label Smoothing",
    "abstract": " Comments: MedIA 2023. The code is available at this https URL arXiv admin note: substantial text overlap with arXiv:2111.15430 ",
    "url": "https://arxiv.org/abs/2209.09641",
    "authors": [
      "Balamurali Murugesan",
      "Bingyuan Liu",
      "Adrian Galdran",
      "Ismail Ben Ayed",
      "Jose Dolz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.06225",
    "title": "On the Generalizability of ECG-based Stress Detection Models",
    "abstract": " Comments: Published in Proceedings of 2022 21st IEEE International Conference on Machine Learning and Applications (ICMLA) ",
    "url": "https://arxiv.org/abs/2210.06225",
    "authors": [
      "Pooja Prajod",
      "Elisabeth André"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.10558",
    "title": "On-the-fly Denoising for Data Augmentation in Natural Language  Understanding",
    "abstract": " Comments: Findings of EACL 2024 ",
    "url": "https://arxiv.org/abs/2212.10558",
    "authors": [
      "Tianqing Fang",
      "Wenxuan Zhou",
      "Fangyu Liu",
      "Hongming Zhang",
      "Yangqiu Song",
      "Muhao Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.11673",
    "title": "Bayesian Self-Supervised Contrastive Learning",
    "abstract": " Comments: 24 pages ",
    "url": "https://arxiv.org/abs/2301.11673",
    "authors": [
      "Bin Liu",
      "Bang Wang",
      "Tianrui Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.07363",
    "title": "An Integrated Cyber-Physical Risk Assessment Framework for Worst-Case  Attacks in Industrial Control Systems",
    "abstract": " Title: An Integrated Cyber-Physical Risk Assessment Framework for Worst-Case  Attacks in Industrial Control Systems ",
    "url": "https://arxiv.org/abs/2304.07363",
    "authors": [
      "Navid Aftabi",
      "Dan Li",
      "Ph.D.",
      "Thomas Sharkey",
      "Ph.D"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.00066",
    "title": "The Kolmogorov N-width for linear transport: Exact representation and  the influence of the data",
    "abstract": " Title: The Kolmogorov N-width for linear transport: Exact representation and  the influence of the data ",
    "url": "https://arxiv.org/abs/2305.00066",
    "authors": [
      "Florian Arbes",
      "Constantin Greif",
      "Karsten Urban"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2305.06614",
    "title": "Robust stability of moving horizon estimation for continuous-time  systems",
    "abstract": " Comments: Replaced by accepted version ",
    "url": "https://arxiv.org/abs/2305.06614",
    "authors": [
      "Julian D. Schiller",
      "Matthias A. Müller"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.06715",
    "title": "Backpropagation-Free 4D Continuous Ant-Based Neural Topology Search",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2011.10831 ",
    "url": "https://arxiv.org/abs/2305.06715",
    "authors": [
      "AbdElRahman ElSaid",
      "Karl Ricanek",
      "Zeming Lyu",
      "Alexander Ororbia",
      "Travis Desell"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2305.11588",
    "title": "Text2NeRF: Text-Driven 3D Scene Generation with Neural Radiance Fields",
    "abstract": " Comments: Accepted by TVCG; Homepage: this https URL Code:this https URL ",
    "url": "https://arxiv.org/abs/2305.11588",
    "authors": [
      "Jingbo Zhang",
      "Xiaoyu Li",
      "Ziyu Wan",
      "Can Wang",
      "Jing Liao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2305.12095",
    "title": "CARD: Channel Aligned Robust Blend Transformer for Time Series  Forecasting",
    "abstract": " Comments: ICLR 2024 ",
    "url": "https://arxiv.org/abs/2305.12095",
    "authors": [
      "Wang Xue",
      "Tian Zhou",
      "Qingsong Wen",
      "Jinyang Gao",
      "Bolin Ding",
      "Rong Jin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.08915",
    "title": "Prompt Performance Prediction for Image Generation",
    "abstract": " Title: Prompt Performance Prediction for Image Generation ",
    "url": "https://arxiv.org/abs/2306.08915",
    "authors": [
      "Nicolas Bizzozzero",
      "Ihab Bendidi",
      "Olivier Risser-Maroix"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2306.09882",
    "title": "Uncertainty Quantification via Spatial-Temporal Tweedie Model for  Zero-inflated and Long-tail Travel Demand Prediction",
    "abstract": " Comments: In proceeding of CIKM 2023. Doi: this https URL ",
    "url": "https://arxiv.org/abs/2306.09882",
    "authors": [
      "Xinke Jiang",
      "Dingyi Zhuang",
      "Xianghui Zhang",
      "Hao Chen",
      "Jiayuan Luo",
      "Xiaowei Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)",
      "Other Statistics (stat.OT)"
    ]
  },
  {
    "id": "arXiv:2307.00162",
    "title": "What Do Self-Supervised Speech Models Know About Words?",
    "abstract": " Comments: Pre-MIT Press publication version ",
    "url": "https://arxiv.org/abs/2307.00162",
    "authors": [
      "Ankita Pasad",
      "Chung-Ming Chien",
      "Shane Settle",
      "Karen Livescu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2307.01406",
    "title": "Performance metrics for the continuous distribution of entanglement in  multi-user quantum networks",
    "abstract": " Comments: 9 pages with 7 figures (main text); 13 pages appendix with 7 figures. v2: minor improvements to readability, corrected typos ",
    "url": "https://arxiv.org/abs/2307.01406",
    "authors": [
      "Álvaro G. Iñesta",
      "Stephanie Wehner"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2307.05318",
    "title": "Predicting small molecules solubilities on endpoint devices using deep  ensemble neural networks",
    "abstract": " Title: Predicting small molecules solubilities on endpoint devices using deep  ensemble neural networks ",
    "url": "https://arxiv.org/abs/2307.05318",
    "authors": [
      "Mayk Caldas Ramos",
      "Andrew D. White"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.06555",
    "title": "Deep Network Approximation: Beyond ReLU to Diverse Activation Functions",
    "abstract": " Title: Deep Network Approximation: Beyond ReLU to Diverse Activation Functions ",
    "url": "https://arxiv.org/abs/2307.06555",
    "authors": [
      "Shijun Zhang",
      "Jianfeng Lu",
      "Hongkai Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.08202",
    "title": "Enhancing Next-Generation Urban Connectivity: Is the Integrated  HAPS-Terrestrial Network a Solution?",
    "abstract": " Comments: 8 pages singlecolumn, 4 figures, under review in IEEE Communications Letters ",
    "url": "https://arxiv.org/abs/2307.08202",
    "authors": [
      "Afsoon Alidadi Shamsabadi",
      "Animesh Yadav",
      "Halim Yanikomeroglu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2307.15176",
    "title": "RCT Rejection Sampling for Causal Estimation Evaluation",
    "abstract": " Comments: Code and data at this https URL ",
    "url": "https://arxiv.org/abs/2307.15176",
    "authors": [
      "Katherine A. Keith",
      "Sergey Feldman",
      "David Jurgens",
      "Jonathan Bragg",
      "Rohit Bhattacharya"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2308.02126",
    "title": "Cognitive TransFuser: Semantics-guided Transformer-based Sensor Fusion  for Improved Waypoint Prediction",
    "abstract": " Comments: Accepted to RiTA 2023 ",
    "url": "https://arxiv.org/abs/2308.02126",
    "authors": [
      "Hwan-Soo Choi",
      "Jongoh Jeong",
      "Young Hoo Cho",
      "Kuk-Jin Yoon",
      "Jong-Hwan Kim"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.12612",
    "title": "Try with Simpler -- An Evaluation of Improved Principal Component  Analysis in Log-based Anomaly Detection",
    "abstract": " Comments: Accepted by TOSEM ",
    "url": "https://arxiv.org/abs/2308.12612",
    "authors": [
      "Lin Yang",
      "Junjie Chen",
      "Shutao Gao",
      "Zhihao Gong",
      "Hongyu Zhang",
      "Yue Kang",
      "Huaan Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.13352",
    "title": "A Generic Machine Learning Framework for Fully-Unsupervised Anomaly  Detection with Contaminated Data",
    "abstract": " Title: A Generic Machine Learning Framework for Fully-Unsupervised Anomaly  Detection with Contaminated Data ",
    "url": "https://arxiv.org/abs/2308.13352",
    "authors": [
      "Markus Ulmer",
      "Jannik Zgraggen",
      "Lilach Goren Huber"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.03160",
    "title": "ResFields: Residual Neural Fields for Spatiotemporal Signals",
    "abstract": " Comments: [ICLR 2024 Spotlight] Project and code at: this https URL ",
    "url": "https://arxiv.org/abs/2309.03160",
    "authors": [
      "Marko Mihajlovic",
      "Sergey Prokudin",
      "Marc Pollefeys",
      "Siyu Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.08648",
    "title": "MAPLE: Mobile App Prediction Leveraging Large Language Model Embeddings",
    "abstract": " Title: MAPLE: Mobile App Prediction Leveraging Large Language Model Embeddings ",
    "url": "https://arxiv.org/abs/2309.08648",
    "authors": [
      "Yonchanok Khaokaew",
      "Hao Xue",
      "Flora D. Salim"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.08929",
    "title": "Leveraging Multi-lingual Positive Instances in Contrastive Learning to  Improve Sentence Embedding",
    "abstract": " Comments: Accepted to EACL 2024, main conference ",
    "url": "https://arxiv.org/abs/2309.08929",
    "authors": [
      "Kaiyan Zhao",
      "Qiyu Wu",
      "Xin-Qiang Cai",
      "Yoshimasa Tsuruoka"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2309.15375",
    "title": "PPG-to-ECG Signal Translation for Continuous Atrial Fibrillation  Detection via Attention-based Deep State-Space Modeling",
    "abstract": " Title: PPG-to-ECG Signal Translation for Continuous Atrial Fibrillation  Detection via Attention-based Deep State-Space Modeling ",
    "url": "https://arxiv.org/abs/2309.15375",
    "authors": [
      "Khuong Vo",
      "Mostafa El-Khamy",
      "Yoojin Choi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.02573",
    "title": "Robust Collision Detection for Robots with Variable Stiffness Actuation  by Using MAD-CNN: Modularized-Attention-Dilated Convolutional Neural Network",
    "abstract": " Title: Robust Collision Detection for Robots with Variable Stiffness Actuation  by Using MAD-CNN: Modularized-Attention-Dilated Convolutional Neural Network ",
    "url": "https://arxiv.org/abs/2310.02573",
    "authors": [
      "Zhenwei Niu",
      "Lyes Saad Saoud",
      "Irfan Hussain"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2310.04645",
    "title": "Do self-supervised speech and language models extract similar  representations as human brain?",
    "abstract": " Comments: To appear in 2024 IEEE International Conference on Acoustics, Speech and Signal Processing ",
    "url": "https://arxiv.org/abs/2310.04645",
    "authors": [
      "Peili Chen",
      "Linyang He",
      "Li Fu",
      "Lu Fan",
      "Edward F. Chang",
      "Yuanning Li"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.13139",
    "title": "Graph Neural Networks with polynomial activations have limited  expressivity",
    "abstract": " Title: Graph Neural Networks with polynomial activations have limited  expressivity ",
    "url": "https://arxiv.org/abs/2310.13139",
    "authors": [
      "Sammy Khalife"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.13786",
    "title": "Fundamental Limits of Membership Inference Attacks on Machine Learning  Models",
    "abstract": " Title: Fundamental Limits of Membership Inference Attacks on Machine Learning  Models ",
    "url": "https://arxiv.org/abs/2310.13786",
    "authors": [
      "Eric Aubinais",
      "Elisabeth Gassiat",
      "Pablo Piantanida"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.06643",
    "title": "Privacy Risks Analysis and Mitigation in Federated Learning for Medical  Images",
    "abstract": " Comments: V1 ",
    "url": "https://arxiv.org/abs/2311.06643",
    "authors": [
      "Badhan Chandra Das",
      "M. Hadi Amini",
      "Yanzhao Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.12076",
    "title": "Towards Few-shot Out-of-Distribution Detection",
    "abstract": " Title: Towards Few-shot Out-of-Distribution Detection ",
    "url": "https://arxiv.org/abs/2311.12076",
    "authors": [
      "Jiuqing Dong",
      "Yongbin Gao",
      "Heng Zhou",
      "Jun Cen",
      "Yifan Yao",
      "Sook Yoon",
      "Park Dong Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.12831",
    "title": "ECNR: Efficient Compressive Neural Representation of Time-Varying  Volumetric Datasets",
    "abstract": " Comments: Accepted by IEEE PacificVis 2024 (conference papers track) ",
    "url": "https://arxiv.org/abs/2311.12831",
    "authors": [
      "Kaiyuan Tang",
      "Chaoli Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14097",
    "title": "ACT: Adversarial Consistency Models",
    "abstract": " Title: ACT: Adversarial Consistency Models ",
    "url": "https://arxiv.org/abs/2311.14097",
    "authors": [
      "Fei Kong",
      "Jinhao Duan",
      "Lichao Sun",
      "Hao Cheng",
      "Renjing Xu",
      "Hengtao Shen",
      "Xiaofeng Zhu",
      "Xiaoshuang Shi",
      "Kaidi Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.12784",
    "title": "Fast Cell Library Characterization for Design Technology Co-Optimization  Based on Graph Neural Networks",
    "abstract": " Title: Fast Cell Library Characterization for Design Technology Co-Optimization  Based on Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2312.12784",
    "authors": [
      "Tianliang Ma",
      "Zhihui Deng",
      "Xuguang Sun",
      "Leilai Shao",
      "Kainlu Low"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.16699",
    "title": "Computational Tradeoffs of Optimization-Based Bound Tightening in ReLU  Networks",
    "abstract": " Comments: 8 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2312.16699",
    "authors": [
      "Fabian Badilla",
      "Marcos Goycoolea",
      "Gonzalo Muñoz",
      "Thiago Serra"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.01145",
    "title": "HAAQI-Net: A non-intrusive neural music quality assessment model for  hearing aids",
    "abstract": " Title: HAAQI-Net: A non-intrusive neural music quality assessment model for  hearing aids ",
    "url": "https://arxiv.org/abs/2401.01145",
    "authors": [
      "Dyah A. M. G. Wisnu",
      "Epri W. Pratiwi",
      "Stefano Rini",
      "Ryandhimas E. Zezario",
      "Hsin-Min Wang",
      "Yu Tsao"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2401.04286",
    "title": "Universal Consistency of Wide and Deep ReLU Neural Networks and Minimax  Optimal Convergence Rates for Kolmogorov-Donoho Optimal Function Classes",
    "abstract": " Title: Universal Consistency of Wide and Deep ReLU Neural Networks and Minimax  Optimal Convergence Rates for Kolmogorov-Donoho Optimal Function Classes ",
    "url": "https://arxiv.org/abs/2401.04286",
    "authors": [
      "Hyunouk Ko",
      "Xiaoming Huo"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.06657",
    "title": "Accelerating Tactile Internet with QUIC: A Security and Privacy  Perspective",
    "abstract": " Comments: 7 pages, 3 figures, 1 table ",
    "url": "https://arxiv.org/abs/2401.06657",
    "authors": [
      "Jayasree Sengupta",
      "Debasmita Dey",
      "Simone Ferlin",
      "Nirnay Ghosh",
      "Vaibhav Bajpai"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.07031",
    "title": "Code Security Vulnerability Repair Using Reinforcement Learning with  Large Language Models",
    "abstract": " Title: Code Security Vulnerability Repair Using Reinforcement Learning with  Large Language Models ",
    "url": "https://arxiv.org/abs/2401.07031",
    "authors": [
      "Nafis Tanveer Islam",
      "Mohammad Bahrami Karkevandi",
      "Peyman Najafirad"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2401.08357",
    "title": "SAMF: Small-Area-Aware Multi-focus Image Fusion for Object Detection",
    "abstract": " Comments: Accepted to International Conference on Acoustics, Speech and Signal Processing (ICASSP) 2024 ",
    "url": "https://arxiv.org/abs/2401.08357",
    "authors": [
      "Xilai Li",
      "Xiaosong Li",
      "Haishu Tan",
      "Jinyang Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.11143",
    "title": "Gaussian Adaptive Attention is All You Need: Robust Contextual  Representations Across Multiple Modalities",
    "abstract": " Title: Gaussian Adaptive Attention is All You Need: Robust Contextual  Representations Across Multiple Modalities ",
    "url": "https://arxiv.org/abs/2401.11143",
    "authors": [
      "Georgios Ioannides",
      "Aman Chadha",
      "Aaron Elkins"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2401.11395",
    "title": "UniM-OV3D: Uni-Modality Open-Vocabulary 3D Scene Understanding with  Fine-Grained Feature Representation",
    "abstract": " Title: UniM-OV3D: Uni-Modality Open-Vocabulary 3D Scene Understanding with  Fine-Grained Feature Representation ",
    "url": "https://arxiv.org/abs/2401.11395",
    "authors": [
      "Qingdong He",
      "Jinlong Peng",
      "Zhengkai Jiang",
      "Kai Wu",
      "Xiaozhong Ji",
      "Jiangning Zhang",
      "Yabiao Wang",
      "Chengjie Wang",
      "Mingang Chen",
      "Yunsheng Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.11415",
    "title": "A Fast Parallel Approach for Neighborhood-based Link Prediction by  Disregarding Large Hubs",
    "abstract": " Comments: 16 pages, 11 figures, 1 table ",
    "url": "https://arxiv.org/abs/2401.11415",
    "authors": [
      "Subhajit Sahu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2401.13554",
    "title": "PanAf20K: A Large Video Dataset for Wild Ape Detection and Behaviour  Recognition",
    "abstract": " Comments: Accepted at IJCV ",
    "url": "https://arxiv.org/abs/2401.13554",
    "authors": [
      "Otto Brookes",
      "Majid Mirmehdi",
      "Colleen Stephens",
      "Samuel Angedakin",
      "Katherine Corogenes",
      "Dervla Dowd",
      "Paula Dieguez",
      "Thurston C. Hicks",
      "Sorrel Jones",
      "Kevin Lee",
      "Vera Leinert",
      "Juan Lapuente",
      "Maureen S. McCarthy",
      "Amelia Meier",
      "Mizuki Murai",
      "Emmanuelle Normand",
      "Virginie Vergnes",
      "Erin G. Wessling",
      "Roman M. Wittig",
      "Kevin Langergraber",
      "Nuria Maldonado",
      "Xinyu Yang",
      "Klaus Zuberbuhler",
      "Christophe Boesch",
      "Mimi Arandjelovic",
      "Hjalmar Kuhl",
      "Tilo Burghardt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.14203",
    "title": "Statistical Characterization of RIS-assisted UAV Communications in  Terrestrial and Non-Terrestrial Networks Under Channel Aging",
    "abstract": " Comments: 6 pages, 3 figures and 7 subfigures, IEEE ICC'24 (Revision) ",
    "url": "https://arxiv.org/abs/2401.14203",
    "authors": [
      "Thanh Luan Nguyen",
      "Georges Kaddoum",
      "Tri Nhu Do",
      "Zygmunt J. Haas"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2401.14442",
    "title": "Improving Antibody Humanness Prediction using Patent Data",
    "abstract": " Comments: 13 pages, 6 figures, Code: this https URL ",
    "url": "https://arxiv.org/abs/2401.14442",
    "authors": [
      "Talip Ucar",
      "Aubin Ramon",
      "Dino Oglic",
      "Rebecca Croasdale-Wood",
      "Tom Diethe",
      "Pietro Sormanni"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.14678",
    "title": "Prompt-enhanced Federated Content Representation Learning for  Cross-domain Recommendation",
    "abstract": " Comments: 11 pages, 3 figures, accepted by WWW 2024 ",
    "url": "https://arxiv.org/abs/2401.14678",
    "authors": [
      "Lei Guo",
      "Ziang Lu",
      "Junliang Yu",
      "Nguyen Quoc Viet Hung",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2401.15885",
    "title": "Rectify the Regression Bias in Long-Tailed Object Detection",
    "abstract": " Title: Rectify the Regression Bias in Long-Tailed Object Detection ",
    "url": "https://arxiv.org/abs/2401.15885",
    "authors": [
      "Ke Zhu",
      "Minghao Fu",
      "Jie Shao",
      "Tianyu Liu",
      "Jianxin Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.15893",
    "title": "Arbitrary-Scale Downscaling of Tidal Current Data Using Implicit  Continuous Representation",
    "abstract": " Title: Arbitrary-Scale Downscaling of Tidal Current Data Using Implicit  Continuous Representation ",
    "url": "https://arxiv.org/abs/2401.15893",
    "authors": [
      "Dongheon Lee",
      "Seungmyong Jeong",
      "Youngmin Ro"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.15940",
    "title": "Knowledge-Aware Code Generation with Large Language Models",
    "abstract": " Comments: Accepted in ICPC 2024 ",
    "url": "https://arxiv.org/abs/2401.15940",
    "authors": [
      "Tao Huang",
      "Zhihong Sun",
      "Zhi Jin",
      "Ge Li",
      "Chen Lyu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2401.16403",
    "title": "ViLexNorm: A Lexical Normalization Corpus for Vietnamese Social Media  Text",
    "abstract": " Comments: Accepted at the EACL 2024 Main Conference ",
    "url": "https://arxiv.org/abs/2401.16403",
    "authors": [
      "Thanh-Nhi Nguyen",
      "Thanh-Phong Le",
      "Kiet Van Nguyen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.16655",
    "title": "Rademacher Complexity of Neural ODEs via Chen-Fliess Series",
    "abstract": " Comments: 14 pages; submitted to L4DC 2024 ",
    "url": "https://arxiv.org/abs/2401.16655",
    "authors": [
      "Joshua Hanson",
      "Maxim Raginsky"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2401.16986",
    "title": "Causal Machine Learning for Cost-Effective Allocation of Development Aid",
    "abstract": " Title: Causal Machine Learning for Cost-Effective Allocation of Development Aid ",
    "url": "https://arxiv.org/abs/2401.16986",
    "authors": [
      "Milan Kuzmanovic",
      "Dennis Frauen",
      "Tobias Hatt",
      "Stefan Feuerriegel"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.17219",
    "title": "Faster coloring and embedding in dense hypergraphs via stability",
    "abstract": " Comments: added THM 1.3 ",
    "url": "https://arxiv.org/abs/2401.17219",
    "authors": [
      "Jianfeng Hou",
      "Xizhi Liu",
      "Hongbin Zhao"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Complexity (cs.CC)"
    ]
  }
]