[
  {
    "id": "arXiv:2301.04218",
    "title": "Diffusion Models For Stronger Face Morphing Attacks",
    "abstract": "Face morphing attacks seek to deceive a Face Recognition (FR) system by presenting a morphed image consisting of the biometric qualities from two different identities with the aim of triggering a false acceptance with one of the two identities, thereby presenting a significant threat to biometric systems. The success of a morphing attack is dependent on the ability of the morphed image to represent the biometric characteristics of both identities that were used to create the image. We present a novel morphing attack that uses a Diffusion-based architecture to improve the visual fidelity of the image and improve the ability of the morphing attack to represent characteristics from both identities. We demonstrate the high fidelity of the proposed attack by evaluating its visual fidelity via the Frechet Inception Distance. Extensive experiments are conducted to measure the vulnerability of FR systems to the proposed attack. The proposed attack is compared to two state-of-the-art GAN-based morphing attacks along with two Landmark-based attacks. The ability of a morphing attack detector to detect the proposed attack is measured and compared against the other attacks. Additionally, a novel metric to measure the relative strength between morphing attacks is introduced and evaluated. ",
    "url": "https://arxiv.org/abs/2301.04218",
    "authors": [
      "Zander Blasingame",
      "Chen Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.04229",
    "title": "TERRA: Beam Management for Outdoor mm-Wave Networks",
    "abstract": "mm-Wave communication systems use narrow directional beams due to the spectrum's characteristic nature: high path and penetration losses. The mobile and the base station primarily employ beams in line of sight (LoS) direction and when needed in non-line of sight direction. Beam management protocol adapts the base station and mobile side beam direction during user mobility and to sustain the link during blockages. To avoid outage in transient pedestrian blockage of the LoS path, the mobile uses reflected or NLoS path available in indoor environments. Reflected paths can sustain time synchronization and maintain connectivity during temporary blockages. In outdoor environments, such reflections may not be available and prior work relied on dense base station deployment or co-ordinated multi-point access to address outage problem. Instead of dense and hence cost-intensive network deployments, we found experimentally that the mobile can capitalize on ground reflection. We developed TERRA protocol to effectively handle mobile side beam direction during transient blockage events. TERRA avoids outage during pedestrian blockages 84.5 $\\%$ of the time in outdoor environments on concrete and gravel surfaces. TERRA also enables the mobile to perform a soft handover to a reserve neighbor base station in the event of a permanent blockage, without requiring any side information, unlike the existing works. Evaluations show that TERRA maintains received signal strength close to the optimal solution while keeping track of the neighbor base station. ",
    "url": "https://arxiv.org/abs/2301.04229",
    "authors": [
      "Santosh Ganji",
      "Jaewon Kim",
      "Romil Sonigra",
      "P. R. Kumar"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.04243",
    "title": "Robust Human Identity Anonymization using Pose Estimation",
    "abstract": "Many outdoor autonomous mobile platforms require more human identity anonymized data to power their data-driven algorithms. The human identity anonymization should be robust so that less manual intervention is needed, which remains a challenge for current face detection and anonymization systems. In this paper, we propose to use the skeleton generated from the state-of-the-art human pose estimation model to help localize human heads. We develop criteria to evaluate the performance and compare it with the face detection approach. We demonstrate that the proposed algorithm can reduce missed faces and thus better protect the identity information for the pedestrians. We also develop a confidence-based fusion method to further improve the performance. ",
    "url": "https://arxiv.org/abs/2301.04243",
    "authors": [
      "Hengyuan Zhang",
      "Jing-Yan Liao",
      "David Paz",
      "Henrik I. Christensen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04248",
    "title": "Predicting Hateful Discussions on Reddit using Graph Transformer  Networks and Communal Context",
    "abstract": "We propose a system to predict harmful discussions on social media platforms. Our solution uses contextual deep language models and proposes the novel idea of integrating state-of-the-art Graph Transformer Networks to analyze all conversations that follow an initial post. This framework also supports adapting to future comments as the conversation unfolds. In addition, we study whether a community-specific analysis of hate speech leads to more effective detection of hateful discussions. We evaluate our approach on 333,487 Reddit discussions from various communities. We find that community-specific modeling improves performance two-fold and that models which capture wider-discussion context improve accuracy by 28\\% (35\\% for the most hateful content) compared to limited context models. ",
    "url": "https://arxiv.org/abs/2301.04248",
    "authors": [
      "Liam Hebert",
      "Lukasz Golab",
      "Robin Cohen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2301.04260",
    "title": "Variational Bayes Inference for Data Detection in Cell-Free Massive MIMO",
    "abstract": "Cell-free massive MIMO is a promising technology for beyond-5G networks. Through the deployment of many cooperating access points (AP), the technology can significantly enhance user coverage and spectral efficiency compared to traditional cellular systems. Since the APs are distributed over a large area, the level of favorable propagation in cell-free massive MIMO is less than the one in colocated massive MIMO. As a result, the current linear processing schemes are not close to the optimal ones when the number of AP antennas is not very large. The aim of this paper is to develop nonlinear variational Bayes (VB) methods for data detection in cell-free massive MIMO systems. Contrary to existing work in the literature, which only attained point estimates of the transmit data symbols, the proposed methods aim to obtain the posterior distribution and the Bayes estimate of the data symbols. We develop the VB methods accordingly to the levels of cooperation among the APs. Simulation results show significant performance advantages of the developed VB methods over the linear processing techniques. ",
    "url": "https://arxiv.org/abs/2301.04260",
    "authors": [
      "Ly V. Nguyen",
      "Hien Quoc Ngo",
      "Le-Nam Tran",
      "A. Lee Swindlehurst",
      "Duy H. N. Nguyen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.04265",
    "title": "Adversarial Alignment for Source Free Object Detection",
    "abstract": "Source-free object detection (SFOD) aims to transfer a detector pre-trained on a label-rich source domain to an unlabeled target domain without seeing source data. While most existing SFOD methods generate pseudo labels via a source-pretrained model to guide training, these pseudo labels usually contain high noises due to heavy domain discrepancy. In order to obtain better pseudo supervisions, we divide the target domain into source-similar and source-dissimilar parts and align them in the feature space by adversarial learning. Specifically, we design a detection variance-based criterion to divide the target domain. This criterion is motivated by a finding that larger detection variances denote higher recall and larger similarity to the source domain. Then we incorporate an adversarial module into a mean teacher framework to drive the feature spaces of these two subsets indistinguishable. Extensive experiments on multiple cross-domain object detection datasets demonstrate that our proposed method consistently outperforms the compared SFOD methods. ",
    "url": "https://arxiv.org/abs/2301.04265",
    "authors": [
      "Qiaosong Chu",
      "Shuyan Li",
      "Guangyi Chen",
      "Kai Li",
      "Xiu Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.04266",
    "title": "Illegal Intelligent Reflecting Surface Based Active Channel Aging: When  Jammer Can Attack Without Power and CSI",
    "abstract": "Illegal intelligent reflecting surfaces (I-IRSs), i.e., the illegal deployment and utilization of IRSs, impose serious harmful impacts on wireless networks. The existing I-IRS-based illegal jammer (IJ) requires channel state information (CSI) or extra power or both, and therefore, the I-IRS-based IJ seems to be difficult to implement in practical wireless networks. To raise concerns about significant potential threats posed by I-IRSs, we propose an alternative method to jam legitimate users (LUs) without relying on the CSI. By using an I-IRS to actively change wireless channels, the orthogonality of multi-user beamforming vectors and the co-user channels is destroyed, and significant inter-user interference is then caused, which is referred to as active channel aging. Such a fully-passive jammer (FPJ) can launch jamming attacks on multi-user multiple-input single-output (MU-MISO) systems via inter-user interference caused by active channel aging, where the IJ requires no additional transmit power and instantaneous CSI. The simulation results show the effectiveness of the proposed FPJ scheme. Moreover, we also investigate how the transmit power and the number of quantization phase shift bits influence the jamming performance. ",
    "url": "https://arxiv.org/abs/2301.04266",
    "authors": [
      "Huan Huang",
      "Ying Zhang",
      "Hongliang Zhang",
      "Chongfu Zhang",
      "Zhu Han"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.04268",
    "title": "Adversarial Online Multi-Task Reinforcement Learning",
    "abstract": "We consider the adversarial online multi-task reinforcement learning setting, where in each of $K$ episodes the learner is given an unknown task taken from a finite set of $M$ unknown finite-horizon MDP models. The learner's objective is to minimize its regret with respect to the optimal policy for each task. We assume the MDPs in $\\mathcal{M}$ are well-separated under a notion of $\\lambda$-separability, and show that this notion generalizes many task-separability notions from previous works. We prove a minimax lower bound of $\\Omega(K\\sqrt{DSAH})$ on the regret of any learning algorithm and an instance-specific lower bound of $\\Omega(\\frac{K}{\\lambda^2})$ in sample complexity for a class of uniformly-good cluster-then-learn algorithms. We use a novel construction called 2-JAO MDP for proving the instance-specific lower bound. The lower bounds are complemented with a polynomial time algorithm that obtains $\\tilde{O}(\\frac{K}{\\lambda^2})$ sample complexity guarantee for the clustering phase and $\\tilde{O}(\\sqrt{MK})$ regret guarantee for the learning phase, indicating that the dependency on $K$ and $\\frac{1}{\\lambda^2}$ is tight. ",
    "url": "https://arxiv.org/abs/2301.04268",
    "authors": [
      "Quan Nguyen",
      "Nishant A. Mehta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.04285",
    "title": "TAPS: Topology-Aware Intra-Operator Parallelism Strategy Searching  Algorithm for Deep Neural Networks",
    "abstract": "TAPS is a Topology-Aware intra-operator Parallelism strategy Searching algorithm that generates intra-operator parallelism strategies by considering both intra-node and inter-node bandwidth. Most of the existing auto-parallelism works use the communication volume as the communication cost directly when generating strategies, which we prove to be sub-optimal in multi-nodes cases. We design a topology-aware cost model for multi-node intra-operator parallelism strategy searching. Numerical experiments demonstrate that TAPS can generate strategies with up to 85% fewer communication costs, which outperform the latest baselines. ",
    "url": "https://arxiv.org/abs/2301.04285",
    "authors": [
      "Peng Liang",
      "Hao Zheng",
      "Teng Su",
      "Linbo Qiao",
      "Dongsheng Li"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2301.04288",
    "title": "Generic Event Boundary Detection in Video with Pyramid Features",
    "abstract": "Generic event boundary detection (GEBD) aims to split video into chunks at a broad and diverse set of actions as humans naturally perceive event boundaries. In this study, we present an approach that considers the correlation between neighbor frames with pyramid feature maps in both spatial and temporal dimensions to construct a framework for localizing generic events in video. The features at multiple spatial dimensions of a pre-trained ResNet-50 are exploited with different views in the temporal dimension to form a temporal pyramid feature map. Based on that, the similarity between neighbor frames is calculated and projected to build a temporal pyramid similarity feature vector. A decoder with 1D convolution operations is used to decode these similarities to a new representation that incorporates their temporal relationship for later boundary score estimation. Extensive experiments conducted on the GEBD benchmark dataset show the effectiveness of our system and its variations, in which we outperformed the state-of-the-art approaches. Additional experiments on TAPOS dataset, which contains long-form videos with Olympic sport actions, demonstrated the effectiveness of our study compared to others. ",
    "url": "https://arxiv.org/abs/2301.04288",
    "authors": [
      "Van Thong Huynh",
      "Hyung-Jeong Yang",
      "Guee-Sang Lee",
      "Soo-Hyung Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04299",
    "title": "SoK: Adversarial Machine Learning Attacks and Defences in Multi-Agent  Reinforcement Learning",
    "abstract": "Multi-Agent Reinforcement Learning (MARL) is vulnerable to Adversarial Machine Learning (AML) attacks and needs adequate defences before it can be used in real world applications. We have conducted a survey into the use of execution-time AML attacks against MARL and the defences against those attacks. We surveyed related work in the application of AML in Deep Reinforcement Learning (DRL) and Multi-Agent Learning (MAL) to inform our analysis of AML for MARL. We propose a novel perspective to understand the manner of perpetrating an AML attack, by defining Attack Vectors. We develop two new frameworks to address a gap in current modelling frameworks, focusing on the means and tempo of an AML attack against MARL, and identify knowledge gaps and future avenues of research. ",
    "url": "https://arxiv.org/abs/2301.04299",
    "authors": [
      "Maxwell Standen",
      "Junae Kim",
      "Claudia Szabo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.04312",
    "title": "Word-Graph2vec: An efficient word embedding approach on word  co-occurrence graph using random walk sampling",
    "abstract": "Word embedding has become ubiquitous and is widely used in various text mining and natural language processing (NLP) tasks, such as information retrieval, semantic analysis, and machine translation, among many others. Unfortunately, it is prohibitively expensive to train the word embedding in a relatively large corpus. We propose a graph-based word embedding algorithm, called Word-Graph2vec, which converts the large corpus into a word co-occurrence graph, then takes the word sequence samples from this graph by randomly traveling and trains the word embedding on this sampling corpus in the end. We posit that because of the stable vocabulary, relative idioms, and fixed expressions in English, the size and density of the word co-occurrence graph change slightly with the increase in the training corpus. So that Word-Graph2vec has stable runtime on the large scale data set, and its performance advantage becomes more and more obvious with the growth of the training corpus. Extensive experiments conducted on real-world datasets show that the proposed algorithm outperforms traditional Skip-Gram by four-five times in terms of efficiency, while the error generated by the random walk sampling is small. ",
    "url": "https://arxiv.org/abs/2301.04312",
    "authors": [
      "Wenting Li",
      "Yuanzhe Cai",
      "Zeyu Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.04314",
    "title": "ML-FEED: Machine Learning Framework for Efficient Exploit Detection  (Extended version)",
    "abstract": "Machine learning (ML)-based methods have recently become attractive for detecting security vulnerability exploits. Unfortunately, state-of-the-art ML models like long short-term memories (LSTMs) and transformers incur significant computation overheads. This overhead makes it infeasible to deploy them in real-time environments. We propose a novel ML-based exploit detection model, ML-FEED, that enables highly efficient inference without sacrificing performance. We develop a novel automated technique to extract vulnerability patterns from the Common Weakness Enumeration (CWE) and Common Vulnerabilities and Exposures (CVE) databases. This feature enables ML-FEED to be aware of the latest cyber weaknesses. Second, it is not based on the traditional approach of classifying sequences of application programming interface (API) calls into exploit categories. Such traditional methods that process entire sequences incur huge computational overheads. Instead, ML-FEED operates at a finer granularity and predicts the exploits triggered by every API call of the program trace. Then, it uses a state table to update the states of these potential exploits and track the progress of potential exploit chains. ML-FEED also employs a feature engineering approach that uses natural language processing-based word embeddings, frequency vectors, and one-hot encoding to detect semantically-similar instruction calls. Then, it updates the states of the predicted exploit categories and triggers an alarm when a vulnerability fingerprint executes. Our experiments show that ML-FEED is 72.9x and 75,828.9x faster than state-of-the-art lightweight LSTM and transformer models, respectively. We trained and tested ML-FEED on 79 real-world exploit categories. It predicts categories of exploit in real-time with 98.2% precision, 97.4% recall, and 97.8% F1 score. These results also outperform the LSTM and transformer baselines. ",
    "url": "https://arxiv.org/abs/2301.04314",
    "authors": [
      "Tanujay Saha",
      "Tamjid Al-Rahat",
      "Najwa Aaraj",
      "Yuan Tian",
      "Niraj K. Jha"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.04318",
    "title": "Beyond Graph Convolutional Network: An Interpretable  Regularizer-centered Optimization Framework",
    "abstract": "Graph convolutional networks (GCNs) have been attracting widespread attentions due to their encouraging performance and powerful generalizations. However, few work provide a general view to interpret various GCNs and guide GCNs' designs. In this paper, by revisiting the original GCN, we induce an interpretable regularizer-centerd optimization framework, in which by building appropriate regularizers we can interpret most GCNs, such as APPNP, JKNet, DAGNN, and GNN-LF/HF. Further, under the proposed framework, we devise a dual-regularizer graph convolutional network (dubbed tsGCN) to capture topological and semantic structures from graph data. Since the derived learning rule for tsGCN contains an inverse of a large matrix and thus is time-consuming, we leverage the Woodbury matrix identity and low-rank approximation tricks to successfully decrease the high computational complexity of computing infinite-order graph convolutions. Extensive experiments on eight public datasets demonstrate that tsGCN achieves superior performance against quite a few state-of-the-art competitors w.r.t. classification tasks. ",
    "url": "https://arxiv.org/abs/2301.04318",
    "authors": [
      "Shiping Wang",
      "Zhihao Wu",
      "Yuhong Chen",
      "Yong Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.04320",
    "title": "Rethinking complex-valued deep neural networks for monaural speech  enhancement",
    "abstract": "Despite multiple efforts made towards adopting complex-valued deep neural networks (DNNs), it remains an open question whether complex-valued DNNs are generally more effective than real-valued DNNs for monaural speech enhancement. This work is devoted to presenting a critical assessment by systematically examining complex-valued DNNs against their real-valued counterparts. Specifically, we investigate complex-valued DNN atomic units, including linear layers, convolutional layers, long short-term memory (LSTM), and gated linear units. By comparing complex- and real-valued versions of fundamental building blocks in the recently developed gated convolutional recurrent network (GCRN), we show how different mechanisms for basic blocks affect the performance. We also find that the use of complex-valued operations hinders the model capacity when the model size is small. In addition, we examine two recent complex-valued DNNs, i.e. deep complex convolutional recurrent network (DCCRN) and deep complex U-Net (DCUNET). Evaluation results show that both DNNs produce identical performance to their real-valued counterparts while requiring much more computation. Based on these comprehensive comparisons, we conclude that complex-valued DNNs do not provide a performance gain over their real-valued counterparts for monaural speech enhancement, and thus are less desirable due to their higher computational costs. ",
    "url": "https://arxiv.org/abs/2301.04320",
    "authors": [
      "Haibin Wu",
      "Ke Tan",
      "Buye Xu",
      "Anurag Kumar",
      "Daniel Wong"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2301.04330",
    "title": "Fast Kinodynamic Planning on the Constraint Manifold with Deep Neural  Networks",
    "abstract": "Motion planning is a mature area of research in robotics with many well-established methods based on optimization or sampling the state space, suitable for solving kinematic motion planning. However, when dynamic motions under constraints are needed and computation time is limited, fast kinodynamic planning on the constraint manifold is indispensable. In recent years, learning-based solutions have become alternatives to classical approaches, but they still lack comprehensive handling of complex constraints, such as planning on a lower-dimensional manifold of the task space while considering the robot's dynamics. This paper introduces a novel learning-to-plan framework that exploits the concept of constraint manifold, including dynamics, and neural planning methods. Our approach generates plans satisfying an arbitrary set of constraints and computes them in a short constant time, namely the inference time of a neural network. This allows the robot to plan and replan reactively, making our approach suitable for dynamic environments. We validate our approach on two simulated tasks and in a demanding real-world scenario, where we use a Kuka LBR Iiwa 14 robotic arm to perform the hitting movement in robotic Air Hockey. ",
    "url": "https://arxiv.org/abs/2301.04330",
    "authors": [
      "Piotr Kicki",
      "Puze Liu",
      "Davide Tateo",
      "Haitham Bou-Ammar",
      "Krzysztof Walas",
      "Piotr Skrzypczyński",
      "Jan Peters"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.04333",
    "title": "Learnable Path in Neural Controlled Differential Equations",
    "abstract": "Neural controlled differential equations (NCDEs), which are continuous analogues to recurrent neural networks (RNNs), are a specialized model in (irregular) time-series processing. In comparison with similar models, e.g., neural ordinary differential equations (NODEs), the key distinctive characteristics of NCDEs are i) the adoption of the continuous path created by an interpolation algorithm from each raw discrete time-series sample and ii) the adoption of the Riemann--Stieltjes integral. It is the continuous path which makes NCDEs be analogues to continuous RNNs. However, NCDEs use existing interpolation algorithms to create the path, which is unclear whether they can create an optimal path. To this end, we present a method to generate another latent path (rather than relying on existing interpolation algorithms), which is identical to learning an appropriate interpolation method. We design an encoder-decoder module based on NCDEs and NODEs, and a special training method for it. Our method shows the best performance in both time-series classification and forecasting. ",
    "url": "https://arxiv.org/abs/2301.04333",
    "authors": [
      "Sheo Yon Jhin",
      "Minju Jo",
      "Seungji Kook",
      "Noseong Park",
      "Sungpil Woo",
      "Sunhwan Lim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.04338",
    "title": "Synthetic data generation method for data-free knowledge distillation in  regression neural networks",
    "abstract": "Knowledge distillation is the technique of compressing a larger neural network, known as the teacher, into a smaller neural network, known as the student, while still trying to maintain the performance of the larger neural network as much as possible. Existing methods of knowledge distillation are mostly applicable for classification tasks. Many of them also require access to the data used to train the teacher model. To address the problem of knowledge distillation for regression tasks under the absence of original training data, previous work has proposed a data-free knowledge distillation method where synthetic data are generated using a generator model trained adversarially against the student model. These synthetic data and their labels predicted by the teacher model are then used to train the student model. In this study, we investigate the behavior of various synthetic data generation methods and propose a new synthetic data generation strategy that directly optimizes for a large but bounded difference between the student and teacher model. Our results on benchmark and case study experiments demonstrate that the proposed strategy allows the student model to learn better and emulate the performance of the teacher model more closely. ",
    "url": "https://arxiv.org/abs/2301.04338",
    "authors": [
      "Tianxun Zhou",
      "Keng-Hwee Chiam"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.04341",
    "title": "A Meta Path-based Approach for Rumor Detection on Social Media",
    "abstract": "The prominent role of social media in people's daily lives has made them more inclined to receive news through social networks than traditional sources. This shift in public behavior has opened doors for some to diffuse fake news on social media; and subsequently cause negative economic, political, and social consequences as well as distrust among the public. There are many proposed methods to solve the rumor detection problem, most of which do not take full advantage of the heterogeneous nature of news propagation networks. With this intention, we considered a previously proposed architecture as our baseline and performed the idea of structural feature extraction from the heterogeneous rumor propagation over its architecture using the concept of meta path-based embeddings. We named our model Meta Path-based Global Local Attention Network (MGLAN). Extensive experimental analysis on three state-of-the-art datasets has demonstrated that MGLAN outperforms other models by capturing node-level discrimination to different node types. ",
    "url": "https://arxiv.org/abs/2301.04341",
    "authors": [
      "Bita Azarijoo",
      "Mostafa Salehi",
      "Shaghayegh Najari"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.04344",
    "title": "Robust Bayesian Target Value Optimization",
    "abstract": "We consider the problem of finding an input to a stochastic black box function such that the scalar output of the black box function is as close as possible to a target value in the sense of the expected squared error. While the optimization of stochastic black boxes is classic in (robust) Bayesian optimization, the current approaches based on Gaussian processes predominantly focus either on i) maximization/minimization rather than target value optimization or ii) on the expectation, but not the variance of the output, ignoring output variations due to stochasticity in uncontrollable environmental variables. In this work, we fill this gap and derive acquisition functions for common criteria such as the expected improvement, the probability of improvement, and the lower confidence bound, assuming that aleatoric effects are Gaussian with known variance. Our experiments illustrate that this setting is compatible with certain extensions of Gaussian processes, and show that the thus derived acquisition functions can outperform classical Bayesian optimization even if the latter assumptions are violated. An industrial use case in billet forging is presented. ",
    "url": "https://arxiv.org/abs/2301.04344",
    "authors": [
      "Johannes G. Hoffer",
      "Sascha Ranftl",
      "Bernhard C. Geiger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.04347",
    "title": "Counteracts: Testing Stereotypical Representation in Pre-trained  Language Models",
    "abstract": "Language models have demonstrated strong performance on various natural language understanding tasks. Similar to humans, language models could also have their own bias that is learned from the training data. As more and more downstream tasks integrate language models as part of the pipeline, it is necessary to understand the internal stereotypical representation and the methods to mitigate the negative effects. In this paper, we proposed a simple method to test the internal stereotypical representation in pre-trained language models using counterexamples. We mainly focused on gender bias, but the method can be extended to other types of bias. We evaluated models on 9 different cloze-style prompts consisting of knowledge and base prompts. Our results indicate that pre-trained language models show a certain amount of robustness when using unrelated knowledge, and prefer shallow linguistic cues, such as word position and syntactic structure, to alter the internal stereotypical representation. Such findings shed light on how to manipulate language models in a neutral approach for both finetuning and evaluation. ",
    "url": "https://arxiv.org/abs/2301.04347",
    "authors": [
      "Damin Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.04352",
    "title": "Graph based Environment Representation for Vision-and-Language  Navigation in Continuous Environments",
    "abstract": "Vision-and-Language Navigation in Continuous Environments (VLN-CE) is a navigation task that requires an agent to follow a language instruction in a realistic environment. The understanding of environments is a crucial part of the VLN-CE task, but existing methods are relatively simple and direct in understanding the environment, without delving into the relationship between language instructions and visual environments. Therefore, we propose a new environment representation in order to solve the above problems. First, we propose an Environment Representation Graph (ERG) through object detection to express the environment in semantic level. This operation enhances the relationship between language and environment. Then, the relational representations of object-object, object-agent in ERG are learned through GCN, so as to obtain a continuous expression about ERG. Sequentially, we combine the ERG expression with object label embeddings to obtain the environment representation. Finally, a new cross-modal attention navigation framework is proposed, incorporating our environment representation and a special loss function dedicated to training ERG. Experimental result shows that our method achieves satisfactory performance in terms of success rate on VLN-CE tasks. Further analysis explains that our method attains better cross-modal matching and strong generalization ability. ",
    "url": "https://arxiv.org/abs/2301.04352",
    "authors": [
      "Ting Wang",
      "Zongkai Wu",
      "Feiyu Yao",
      "Donglin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.04381",
    "title": "Determinate Node Selection for Semi-supervised Classification Oriented  Graph Convolutional Networks",
    "abstract": "Graph Convolutional Networks (GCNs) have been proved successful in the field of semi-supervised node classification by extracting structural information from graph data. However, the random selection of labeled nodes used by GCNs may lead to unstable generalization performance of GCNs. In this paper, we propose an efficient method for the deterministic selection of labeled nodes: the Determinate Node Selection (DNS) algorithm. The DNS algorithm identifies two categories of representative nodes in the graph: typical nodes and divergent nodes. These labeled nodes are selected by exploring the structure of the graph and determining the ability of the nodes to represent the distribution of data within the graph. The DNS algorithm can be applied quite simply on a wide range of semi-supervised graph neural network models for node classification tasks. Through extensive experimentation, we have demonstrated that the incorporation of the DNS algorithm leads to a remarkable improvement in the average accuracy of the model and a significant decrease in the standard deviation, as compared to the original method. ",
    "url": "https://arxiv.org/abs/2301.04381",
    "authors": [
      "Yao Xiao",
      "Ji Xu",
      "Jing Yang",
      "Shaobo Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.04388",
    "title": "Perceive and predict: self-supervised speech representation based loss  functions for speech enhancement",
    "abstract": "Recent work in the domain of speech enhancement has explored the use of self-supervised speech representations to aid in the training of neural speech enhancement models. However, much of this work focuses on using the deepest or final outputs of self supervised speech representation models, rather than the earlier feature encodings. The use of self supervised representations in such a way is often not fully motivated. In this work it is shown that the distance between the feature encodings of clean and noisy speech correlate strongly with psychoacoustically motivated measures of speech quality and intelligibility, as well as with human Mean Opinion Score (MOS) ratings. Experiments using this distance as a loss function are performed and improved performance over the use of STFT spectrogram distance based loss as well as other common loss functions from speech enhancement literature is demonstrated using objective measures such as perceptual evaluation of speech quality (PESQ) and short-time objective intelligibility (STOI). ",
    "url": "https://arxiv.org/abs/2301.04388",
    "authors": [
      "George Close",
      "William Ravenscroft",
      "Thomas Hain",
      "Stefan Goetze"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2301.04400",
    "title": "Resynthesis-based Attacks Against Logic Locking",
    "abstract": "Logic locking has been a promising solution to many hardware security threats, such as intellectual property infringement and overproduction. Due to the increased attention that threats have received, many efficient specialized attacks against logic locking have been introduced over the years. However, the ability of an adversary to manipulate a locked netlist prior to mounting an attack has not been investigated thoroughly. This paper introduces a resynthesis-based strategy that utilizes the strength of a commercial electronic design automation (EDA) tool to reveal the vulnerabilities of a locked circuit. To do so, in a pre-attack step, a locked netlist is resynthesized using different synthesis parameters in a systematic way, leading to a large number of functionally equivalent but structurally different locked circuits. Then, under the oracle-less threat model, where it is assumed that the adversary only possesses the locked circuit, not the original circuit to query, a prominent attack is applied to these generated netlists collectively, from which a large number of key bits are deciphered. Nevertheless, this paper also describes how the proposed oracle-less attack can be integrated with an oracle-guided attack. The feasibility of the proposed approach is demonstrated for several benchmarks, including remarkable results for breaking a recently proposed provably secure logic locking method and deciphering values of a large number of key bits of the CSAW'19 circuits with very high accuracy. ",
    "url": "https://arxiv.org/abs/2301.04400",
    "authors": [
      "F. Almeida",
      "L. Aksoy",
      "Q-L. Nguyen",
      "S. Dupuis",
      "M-L. Flottes",
      "S. Pagliarini"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.04404",
    "title": "A prediction and behavioural analysis of machine learning methods for  modelling travel mode choice",
    "abstract": "The emergence of a variety of Machine Learning (ML) approaches for travel mode choice prediction poses an interesting question to transport modellers: which models should be used for which applications? The answer to this question goes beyond simple predictive performance, and is instead a balance of many factors, including behavioural interpretability and explainability, computational complexity, and data efficiency. There is a growing body of research which attempts to compare the predictive performance of different ML classifiers with classical random utility models. However, existing studies typically analyse only the disaggregate predictive performance, ignoring other aspects affecting model choice. Furthermore, many studies are affected by technical limitations, such as the use of inappropriate validation schemes, incorrect sampling for hierarchical data, lack of external validation, and the exclusive use of discrete metrics. We address these limitations by conducting a systematic comparison of different modelling approaches, across multiple modelling problems, in terms of the key factors likely to affect model choice (out-of-sample predictive performance, accuracy of predicted market shares, extraction of behavioural indicators, and computational efficiency). We combine several real world datasets with synthetic datasets, where the data generation function is known. The results indicate that the models with the highest disaggregate predictive performance (namely extreme gradient boosting and random forests) provide poorer estimates of behavioural indicators and aggregate mode shares, and are more expensive to estimate, than other models, including deep neural networks and Multinomial Logit (MNL). It is further observed that the MNL model performs robustly in a variety of situations, though ML techniques can improve the estimates of behavioural indices such as Willingness to Pay. ",
    "url": "https://arxiv.org/abs/2301.04404",
    "authors": [
      "José Ángel Martín-Baos",
      "Julio Alberto López-Gómez",
      "Luis Rodriguez-Benitez",
      "Tim Hillel",
      "Ricardo García-Ródenas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.04421",
    "title": "Failure Detection for Motion Prediction of Autonomous Driving: An  Uncertainty Perspective",
    "abstract": "Motion prediction is essential for safe and efficient autonomous driving. However, the inexplicability and uncertainty of complex artificial intelligence models may lead to unpredictable failures of the motion prediction module, which may mislead the system to make unsafe decisions. Therefore, it is necessary to develop methods to guarantee reliable autonomous driving, where failure detection is a potential direction. Uncertainty estimates can be used to quantify the degree of confidence a model has in its predictions and may be valuable for failure detection. We propose a framework of failure detection for motion prediction from the uncertainty perspective, considering both motion uncertainty and model uncertainty, and formulate various uncertainty scores according to different prediction stages. The proposed approach is evaluated based on different motion prediction algorithms, uncertainty estimation methods, uncertainty scores, etc., and the results show that uncertainty is promising for failure detection for motion prediction but should be used with caution. ",
    "url": "https://arxiv.org/abs/2301.04421",
    "authors": [
      "Wenbo Shao",
      "Yanchao Xu",
      "Liang Peng",
      "Jun Li",
      "Hong Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04430",
    "title": "Network Adaptive Federated Learning: Congestion and Lossy Compression",
    "abstract": "In order to achieve the dual goals of privacy and learning across distributed data, Federated Learning (FL) systems rely on frequent exchanges of large files (model updates) between a set of clients and the server. As such FL systems are exposed to, or indeed the cause of, congestion across a wide set of network resources. Lossy compression can be used to reduce the size of exchanged files and associated delays, at the cost of adding noise to model updates. By judiciously adapting clients' compression to varying network congestion, an FL application can reduce wall clock training time. To that end, we propose a Network Adaptive Compression (NAC-FL) policy, which dynamically varies the client's lossy compression choices to network congestion variations. We prove, under appropriate assumptions, that NAC-FL is asymptotically optimal in terms of directly minimizing the expected wall clock training time. Further, we show via simulation that NAC-FL achieves robust performance improvements with higher gains in settings with positively correlated delays across time. ",
    "url": "https://arxiv.org/abs/2301.04430",
    "authors": [
      "Parikshit Hegde",
      "Gustavo de Veciana",
      "Aryan Mokhtari"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)",
      "Probability (math.PR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.04447",
    "title": "VS-Net: Multiscale Spatiotemporal Features for Lightweight Video Salient  Document Detection",
    "abstract": "Video Salient Document Detection (VSDD) is an essential task of practical computer vision, which aims to highlight visually salient document regions in video frames. Previous techniques for VSDD focus on learning features without considering the cooperation among and across the appearance and motion cues and thus fail to perform in practical scenarios. Moreover, most of the previous techniques demand high computational resources, which limits the usage of such systems in resource-constrained settings. To handle these issues, we propose VS-Net, which captures multi-scale spatiotemporal information with the help of dilated depth-wise separable convolution and Approximation Rank Pooling. VS-Net extracts the key features locally from each frame across embedding sub-spaces and forwards the features between adjacent and parallel nodes, enhancing model performance globally. Our model generates saliency maps considering both the background and foreground simultaneously, making it perform better in challenging scenarios. The immense experiments regulated on the benchmark MIDV-500 dataset show that the VS-Net model outperforms state-of-the-art approaches in both time and robustness measures. ",
    "url": "https://arxiv.org/abs/2301.04447",
    "authors": [
      "Hemraj Singh",
      "Mridula Verma",
      "Ramalingaswamy Cheruku"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.04451",
    "title": "Heterogeneous Tri-stream Clustering Network",
    "abstract": "Contrastive deep clustering has recently gained significant attention with its ability of joint contrastive learning and clustering via deep neural networks. Despite the rapid progress, previous works mostly require both positive and negative sample pairs for contrastive clustering, which rely on a relative large batch-size. Moreover, they typically adopt a two-stream architecture with two augmented views, which overlook the possibility and potential benefits of multi-stream architectures (especially with heterogeneous or hybrid networks). In light of this, this paper presents a new end-to-end deep clustering approach termed Heterogeneous Tri-stream Clustering Network (HTCN). The tri-stream architecture in HTCN consists of three main components, including two weight-sharing online networks and a target network, where the parameters of the target network are the exponential moving average of that of the online networks. Notably, the two online networks are trained by simultaneously (i) predicting the instance representations of the target network and (ii) enforcing the consistency between the cluster representations of the target network and that of the two online networks. Experimental results on four challenging image datasets demonstrate the superiority of HTCN over the state-of-the-art deep clustering approaches. The code is available at https://github.com/dengxiaozhi/HTCN. ",
    "url": "https://arxiv.org/abs/2301.04451",
    "authors": [
      "Xiaozhi Deng",
      "Dong Huang",
      "Chang-Dong Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04454",
    "title": "Allo-centric Occupancy Grid Prediction for Urban Traffic Scene Using  Video Prediction Networks",
    "abstract": "Prediction of dynamic environment is crucial to safe navigation of an autonomous vehicle. Urban traffic scenes are particularly challenging to forecast due to complex interactions between various dynamic agents, such as vehicles and vulnerable road users. Previous approaches have used egocentric occupancy grid maps to represent and predict dynamic environments. However, these predictions suffer from blurriness, loss of scene structure at turns, and vanishing of agents over longer prediction horizon. In this work, we propose a novel framework to make long-term predictions by representing the traffic scene in a fixed frame, referred as allo-centric occupancy grid. This allows for the static scene to remain fixed and to represent motion of the ego-vehicle on the grid like other agents'. We study the allo-centric grid prediction with different video prediction networks and validate the approach on the real-world Nuscenes dataset. The results demonstrate that the allo-centric grid representation significantly improves scene prediction, in comparison to the conventional ego-centric grid approach. ",
    "url": "https://arxiv.org/abs/2301.04454",
    "authors": [
      "Rabbia Asghar",
      "Lukas Rummelhard",
      "Anne Spalanzani",
      "Christian Laugier"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.04460",
    "title": "Fast spline detection in high density microscopy data",
    "abstract": "Computer-aided analysis of biological microscopy data has seen a massive improvement with the utilization of general-purpose deep learning techniques. Yet, in microscopy studies of multi-organism systems, the problem of collision and overlap remains challenging. This is particularly true for systems composed of slender bodies such as crawling nematodes, swimming spermatozoa, or the beating of eukaryotic or prokaryotic flagella. Here, we develop a novel end-to-end deep learning approach to extract precise shape trajectories of generally motile and overlapping splines. Our method works in low resolution settings where feature keypoints are hard to define and detect. Detection is fast and we demonstrate the ability to track thousands of overlapping organisms simultaneously. While our approach is agnostic to area of application, we present it in the setting of and exemplify its usability on dense experiments of crawling Caenorhabditis elegans. The model training is achieved purely on synthetic data, utilizing a physics-based model for nematode motility, and we demonstrate the model's ability to generalize from simulations to experimental videos. ",
    "url": "https://arxiv.org/abs/2301.04460",
    "authors": [
      "Albert Alonso",
      "Julius B. Kirkegaard"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2301.04467",
    "title": "FrustumFormer: Adaptive Instance-aware Resampling for Multi-view 3D  Detection",
    "abstract": "The transformation of features from 2D perspective space to 3D space is essential to multi-view 3D object detection. Recent approaches mainly focus on the design of view transformation, either pixel-wisely lifting perspective view features into 3D space with estimated depth or grid-wisely constructing BEV features via 3D projection, treating all pixels or grids equally. However, choosing what to transform is also important but has rarely been discussed before. The pixels of a moving car are more informative than the pixels of the sky. To fully utilize the information contained in images, the view transformation should be able to adapt to different image regions according to their contents. In this paper, we propose a novel framework named FrustumFormer, which pays more attention to the features in instance regions via adaptive instance-aware resampling. Specifically, the model obtains instance frustums on the bird's eye view by leveraging image view object proposals. An adaptive occupancy mask within the instance frustum is learned to refine the instance location. Moreover, the temporal frustum intersection could further reduce the localization uncertainty of objects. Comprehensive experiments on the nuScenes dataset demonstrate the effectiveness of FrustumFormer, and we achieve a new state-of-the-art performance on the benchmark. Codes will be released soon. ",
    "url": "https://arxiv.org/abs/2301.04467",
    "authors": [
      "Yuqi Wang",
      "Yuntao Chen",
      "Zhaoxiang Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04470",
    "title": "InstaGraM: Instance-level Graph Modeling for Vectorized HD Map Learning",
    "abstract": "The construction of lightweight High-definition (HD) maps containing geometric and semantic information is of foremost importance for the large-scale deployment of autonomous driving. To automatically generate such type of map from a set of images captured by a vehicle, most works formulate this mapping as a segmentation problem, which implies heavy post-processing to obtain the final vectorized representation. Alternative techniques have the ability to generate an HD map in an end-to-end manner but rely on computationally expensive auto-regressive models. To bring camera-based to an applicable level, we propose InstaGraM, a fast end-to-end network generating a vectorized HD map via instance-level graph modeling of the map elements. Our strategy consists of three main stages: top-view feature extraction, road elements' vertices and edges detection, and conversion to a semantic vector representation. After top-down feature extraction, an encoder-decoder architecture is utilized to predict a set of vertices and edge maps of the road elements. Finally, these vertices along with edge maps are associated through an attentional graph neural network generating a semantic vectorized map. Instead of relying on a common segmentation approach, we propose to regress distance transform maps as they provide strong spatial relations and directional information between vertices. Comprehensive experiments on nuScenes dataset show that our proposed network outperforms HDMapNet by 13.7 mAP and achieves comparable accuracy with VectorMapNet 5x faster inference speed. ",
    "url": "https://arxiv.org/abs/2301.04470",
    "authors": [
      "Juyeb Shin",
      "Francois Rameau",
      "Hyeonjun Jeong",
      "Dongsuk Kum"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04472",
    "title": "Adversarial training with informed data selection",
    "abstract": "With the increasing amount of available data and advances in computing capabilities, deep neural networks (DNNs) have been successfully employed to solve challenging tasks in various areas, including healthcare, climate, and finance. Nevertheless, state-of-the-art DNNs are susceptible to quasi-imperceptible perturbed versions of the original images -- adversarial examples. These perturbations of the network input can lead to disastrous implications in critical areas where wrong decisions can directly affect human lives. Adversarial training is the most efficient solution to defend the network against these malicious attacks. However, adversarial trained networks generally come with lower clean accuracy and higher computational complexity. This work proposes a data selection (DS) strategy to be applied in the mini-batch training. Based on the cross-entropy loss, the most relevant samples in the batch are selected to update the model parameters in the backpropagation. The simulation results show that a good compromise can be obtained regarding robustness and standard accuracy, whereas the computational complexity of the backpropagation pass is reduced. ",
    "url": "https://arxiv.org/abs/2301.04472",
    "authors": [
      "Marcele O. K. Mendonça",
      "Javier Maroto",
      "Pascal Frossard",
      "Paulo S. R. Diniz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.04482",
    "title": "Multiple-level Point Embedding for Solving Human Trajectory Imputation  with Prediction",
    "abstract": "Sparsity is a common issue in many trajectory datasets, including human mobility data. This issue frequently brings more difficulty to relevant learning tasks, such as trajectory imputation and prediction. Nowadays, little existing work simultaneously deals with imputation and prediction on human trajectories. This work plans to explore whether the learning process of imputation and prediction could benefit from each other to achieve better outcomes. And the question will be answered by studying the coexistence patterns between missing points and observed ones in incomplete trajectories. More specifically, the proposed model develops an imputation component based on the self-attention mechanism to capture the coexistence patterns between observations and missing points among encoder-decoder layers. Meanwhile, a recurrent unit is integrated to extract the sequential embeddings from newly imputed sequences for predicting the following location. Furthermore, a new implementation called Imputation Cycle is introduced to enable gradual imputation with prediction enhancement at multiple levels, which helps to accelerate the speed of convergence. The experimental results on three different real-world mobility datasets show that the proposed approach has significant advantages over the competitive baselines across both imputation and prediction tasks in terms of accuracy and stability. ",
    "url": "https://arxiv.org/abs/2301.04482",
    "authors": [
      "Kyle K. Qin",
      "Yongli Ren",
      "Wei Shao",
      "Brennan Lake",
      "Filippo Privitera",
      "Flora D. Salim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.04494",
    "title": "Multi-label Image Classification using Adaptive Graph Convolutional  Networks: from a Single Domain to Multiple Domains",
    "abstract": "This paper proposes an adaptive graph-based approach for multi-label image classification. Graph-based methods have been largely exploited in the field of multi-label classification, given their ability to model label correlations. Specifically, their effectiveness has been proven not only when considering a single domain but also when taking into account multiple domains. However, the topology of the used graph is not optimal as it is pre-defined heuristically. In addition, consecutive Graph Convolutional Network (GCN) aggregations tend to destroy the feature similarity. To overcome these issues, an architecture for learning the graph connectivity in an end-to-end fashion is introduced. This is done by integrating an attention-based mechanism and a similarity-preserving strategy. The proposed framework is then extended to multiple domains using an adversarial training scheme. Numerous experiments are reported on well-known single-domain and multi-domain benchmarks. The results demonstrate that our approach outperforms the state-of-the-art in terms of mean Average Precision (mAP) and model size. ",
    "url": "https://arxiv.org/abs/2301.04494",
    "authors": [
      "Indel Pal Singh",
      "Enjie Ghorbel",
      "Oyebade Oyedotun",
      "Djamila Aouada"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04497",
    "title": "Dynamic Background Reconstruction via Transformer for Infrared Small  Target Detection",
    "abstract": "Infrared small target detection (ISTD) under complex backgrounds is a difficult problem, for the differences between targets and backgrounds are not easy to distinguish. Background reconstruction is one of the methods to deal with this problem. This paper proposes an ISTD method based on background reconstruction called Dynamic Background Reconstruction (DBR). DBR consists of three modules: a dynamic shift window module (DSW), a background reconstruction module (BR), and a detection head (DH). BR takes advantage of Vision Transformers in reconstructing missing patches and adopts a grid masking strategy with a masking ratio of 50\\% to reconstruct clean backgrounds without targets. To avoid dividing one target into two neighboring patches, resulting in reconstructing failure, DSW is performed before input embedding. DSW calculates offsets, according to which infrared images dynamically shift. To reduce False Positive (FP) cases caused by regarding reconstruction errors as targets, DH utilizes a structure of densely connected Transformer to further improve the detection performance. Experimental results show that DBR achieves the best F1-score on the two ISTD datasets, MFIRST (64.10\\%) and SIRST (75.01\\%). ",
    "url": "https://arxiv.org/abs/2301.04497",
    "authors": [
      "Jingchao Peng",
      "Haitao Zhao",
      "Zhengwei Hu",
      "Kaijie Zhao",
      "Zhongze Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04535",
    "title": "Few-shot Learning for Cross-Target Stance Detection by Aggregating  Multimodal Embeddings",
    "abstract": "Despite the increasing popularity of the stance detection task, existing approaches are predominantly limited to using the textual content of social media posts for the classification, overlooking the social nature of the task. The stance detection task becomes particularly challenging in cross-target classification scenarios, where even in few-shot training settings the model needs to predict the stance towards new targets for which the model has only seen few relevant samples during training. To address the cross-target stance detection in social media by leveraging the social nature of the task, we introduce CT-TN, a novel model that aggregates multimodal embeddings derived from both textual and network features of the data. We conduct experiments in a few-shot cross-target scenario on six different combinations of source-destination target pairs. By comparing CT-TN with state-of-the-art cross-target stance detection models, we demonstrate the effectiveness of our model by achieving average performance improvements ranging from 11% to 21% across different baseline models. Experiments with different numbers of shots show that CT-TN can outperform other models after seeing 300 instances of the destination target. Further, ablation experiments demonstrate the positive contribution of each of the components of CT-TN towards the final performance. We further analyse the network interactions between social media users, which reveal the potential of using social features for cross-target stance detection. ",
    "url": "https://arxiv.org/abs/2301.04535",
    "authors": [
      "Parisa Jamadi Khiabani",
      "Arkaitz Zubiaga"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2301.04554",
    "title": "Universal Detection of Backdoor Attacks via Density-based Clustering and  Centroids Analysis",
    "abstract": "In this paper, we propose a Universal Defence based on Clustering and Centroids Analysis (CCA-UD) against backdoor attacks. The goal of the proposed defence is to reveal whether a Deep Neural Network model is subject to a backdoor attack by inspecting the training dataset. CCA-UD first clusters the samples of the training set by means of density-based clustering. Then, it applies a novel strategy to detect the presence of poisoned clusters. The proposed strategy is based on a general misclassification behaviour obtained when the features of a representative example of the analysed cluster are added to benign samples. The capability of inducing a misclassification error is a general characteristic of poisoned samples, hence the proposed defence is attack-agnostic. This mask a significant difference with respect to existing defences, that, either can defend against only some types of backdoor attacks, e.g., when the attacker corrupts the label of the poisoned samples, or are effective only when some conditions on the poisoning ratios adopted by the attacker or the kind of triggering pattern used by the attacker are satisfied. Experiments carried out on several classification tasks, considering different types of backdoor attacks and triggering patterns, including both local and global triggers, reveal that the proposed method is very effective to defend against backdoor attacks in all the cases, always outperforming the state of the art techniques. ",
    "url": "https://arxiv.org/abs/2301.04554",
    "authors": [
      "Wei Guo",
      "Benedetta Tondi",
      "Mauro Barni"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.04571",
    "title": "Improving And Analyzing Neural Speaker Embeddings for ASR",
    "abstract": "Neural speaker embeddings encode the speaker's speech characteristics through a DNN model and are prevalent for speaker verification tasks. However, few studies have investigated the usage of neural speaker embeddings for an ASR system. In this work, we present our efforts w.r.t integrating neural speaker embeddings into a conformer based hybrid HMM ASR system. For ASR, our improved embedding extraction pipeline in combination with the Weighted-Simple-Add integration method results in x-vector and c-vector reaching on par performance with i-vectors. We further compare and analyze different speaker embeddings. We present our acoustic model improvements obtained by switching from newbob learning rate schedule to one cycle learning schedule resulting in a ~3% relative WER reduction on Switchboard, additionally reducing the overall training time by 17%. By further adding neural speaker embeddings, we gain additional ~3% relative WER improvement on Hub5'00. Our best Conformer-based hybrid ASR system with speaker embeddings achieves 9.0% WER on Hub5'00 and Hub5'01 with training on SWB 300h. ",
    "url": "https://arxiv.org/abs/2301.04571",
    "authors": [
      "Christoph Lüscher",
      "Jingjing Xu",
      "Mohammad Zeineldeen",
      "Ralf Schlüter",
      "Hermann Ney"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.04591",
    "title": "MVAM: Multi-variant Attacks on Memory for IoT Trust Computing",
    "abstract": "With the significant development of the Internet of Things and low-cost cloud services, the sensory and data processing requirements of IoT systems are continually going up. TrustZone is a hardware-protected Trusted Execution Environment (TEE) for ARM processors specifically designed for IoT handheld systems. It provides memory isolation techniques to protect trusted application data from being exploited by malicious entities. In this work, we focus on identifying different vulnerabilities of the TrustZone extension of ARM Cortex-M processors. Then design and implement a threat model to execute those attacks. We have found that TrustZone is vulnerable to buffer overflow-based attacks. We have used this to create an attack called MOFlow and successfully leaked the data of another trusted app. This is done by intentionally overflowing the memory of one app to access the encrypted memory of other apps inside the secure world. We have also found that, by not validating the input parameters in the entry function, TrustZone has exposed a security weakness. We call this Achilles heel and present an attack model showing how to exploit this weakness too. Our proposed novel attacks are implemented and successfully tested on two recent ARM Cortex-M processors available on the market (M23 and M33). ",
    "url": "https://arxiv.org/abs/2301.04591",
    "authors": [
      "Arup Kumar Sarker",
      "Md Khairul Islam",
      "Yuan Tian"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.04597",
    "title": "Predicting Tags For Programming Tasks by Combining Textual And Source  Code Data",
    "abstract": "Competitive programming remains a very popular activity that combines both software engineering and education. In order to prepare and to practice, contestants use extensive archives of problems from past contents available on various competitive programming platforms. One way to make this process more effective is to provide an automatic tag system for the tasks. Prior works do that by either using the tasks' problem statements or the code of their solutions. In this study, we investigate which information source is more valuable for tag prediction. To answer that question, we compare existing approaches of both types on the same dataset and with the same set of tags. Then, we propose a novel approach, which is an ensemble of the Gated Graph Neural Network model for analyzing solutions and the Bidirectional Encoder Representations from Transformers model for processing statements. Our experiments show that our approach outperforms previously proposed models by 0.175 of the PR-AUC metric. ",
    "url": "https://arxiv.org/abs/2301.04597",
    "authors": [
      "Artyom Lobanov",
      "Egor Bogomolov",
      "Yaroslav Golubev",
      "Mikhail Mirzayanov",
      "Timofey Bryksin"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2301.04605",
    "title": "Exploring the Approximation Capabilities of Multiplicative Neural  Networks for Smooth Functions",
    "abstract": "Multiplication layers are a key component in various influential neural network modules, including self-attention and hypernetwork layers. In this paper, we investigate the approximation capabilities of deep neural networks with intermediate neurons connected by simple multiplication operations. We consider two classes of target functions: generalized bandlimited functions, which are frequently used to model real-world signals with finite bandwidth, and Sobolev-Type balls, which are embedded in the Sobolev Space $\\mathcal{W}^{r,2}$. Our results demonstrate that multiplicative neural networks can approximate these functions with significantly fewer layers and neurons compared to standard ReLU neural networks, with respect to both input dimension and approximation error. These findings suggest that multiplicative gates can outperform standard feed-forward layers and have potential for improving neural network design. ",
    "url": "https://arxiv.org/abs/2301.04605",
    "authors": [
      "Ido Ben-Shaul",
      "Tomer Galanti",
      "Shai Dekel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Functional Analysis (math.FA)"
    ]
  },
  {
    "id": "arXiv:2301.04608",
    "title": "Padding Module: Learning the Padding in Deep Neural Networks",
    "abstract": "During the last decades, many studies have been dedicated to improving the performance of neural networks, for example, the network architectures, initialization, and activation. However, investigating the importance and effects of learnable padding methods in deep learning remains relatively open. To mitigate the gap, this paper proposes a novel trainable Padding Module that can be placed in a deep learning model. The Padding Module can optimize itself without requiring or influencing the model's entire loss function. To train itself, the Padding Module constructs a ground truth and a predictor from the inputs by leveraging the underlying structure in the input data for supervision. As a result, the Padding Module can learn automatically to pad pixels to the border of its input images or feature maps. The padding contents are realistic extensions to its input data and simultaneously facilitate the deep learning model's downstream task. Experiments have shown that the proposed Padding Module outperforms the state-of-the-art competitors and the baseline methods. For example, the Padding Module has 1.23% and 0.44% more classification accuracy than the zero padding when tested on the VGG16 and ResNet50. ",
    "url": "https://arxiv.org/abs/2301.04608",
    "authors": [
      "Fahad Alrasheedi",
      "Xin Zhong",
      "Pei-Chi Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.04612",
    "title": "Generative-Contrastive Learning for Self-Supervised Latent  Representations of 3D Shapes from Multi-Modal Euclidean Input",
    "abstract": "We propose a combined generative and contrastive neural architecture for learning latent representations of 3D volumetric shapes. The architecture uses two encoder branches for voxel grids and multi-view images from the same underlying shape. The main idea is to combine a contrastive loss between the resulting latent representations with an additional reconstruction loss. That helps to avoid collapsing the latent representations as a trivial solution for minimizing the contrastive loss. A novel switching scheme is used to cross-train two encoders with a shared decoder. The switching scheme also enables the stop gradient operation on a random branch. Further classification experiments show that the latent representations learned with our self-supervised method integrate more useful information from the additional input data implicitly, thus leading to better reconstruction and classification performance. ",
    "url": "https://arxiv.org/abs/2301.04612",
    "authors": [
      "Chengzhi Wu",
      "Julius Pfrommer",
      "Mingyuan Zhou",
      "Jürgen Beyerer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04613",
    "title": "Object Detection in 3D Point Clouds via Local Correlation-Aware Point  Embedding",
    "abstract": "We present an improved approach for 3D object detection in point cloud data based on the Frustum PointNet (F-PointNet). Compared to the original F-PointNet, our newly proposed method considers the point neighborhood when computing point features. The newly introduced local neighborhood embedding operation mimics the convolutional operations in 2D neural networks. Thus features of each point are not only computed with the features of its own or of the whole point cloud but also computed especially with respect to the features of its neighbors. Experiments show that our proposed method achieves better performance than the F-Pointnet baseline on 3D object detection tasks. ",
    "url": "https://arxiv.org/abs/2301.04613",
    "authors": [
      "Chengzhi Wu",
      "Julius Pfrommer",
      "Jürgen Beyerer",
      "Kangning Li",
      "Boris Neubert"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04619",
    "title": "TinyHD: Efficient Video Saliency Prediction with Heterogeneous Decoders  using Hierarchical Maps Distillation",
    "abstract": "Video saliency prediction has recently attracted attention of the research community, as it is an upstream task for several practical applications. However, current solutions are particularly computationally demanding, especially due to the wide usage of spatio-temporal 3D convolutions. We observe that, while different model architectures achieve similar performance on benchmarks, visual variations between predicted saliency maps are still significant. Inspired by this intuition, we propose a lightweight model that employs multiple simple heterogeneous decoders and adopts several practical approaches to improve accuracy while keeping computational costs low, such as hierarchical multi-map knowledge distillation, multi-output saliency prediction, unlabeled auxiliary datasets and channel reduction with teacher assistant supervision. Our approach achieves saliency prediction accuracy on par or better than state-of-the-art methods on DFH1K, UCF-Sports and Hollywood2 benchmarks, while enhancing significantly the efficiency of the model. Code is on https://github.com/feiyanhu/tinyHD ",
    "url": "https://arxiv.org/abs/2301.04619",
    "authors": [
      "Feiyan Hu",
      "Simone Palazzo",
      "Federica Proietto Salanitri",
      "Giovanni Bellitto",
      "Morteza Moradi",
      "Concetto Spampinato",
      "Kevin McGuinness"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04626",
    "title": "Deep Axial Hypercomplex Networks",
    "abstract": "Over the past decade, deep hypercomplex-inspired networks have enhanced feature extraction for image classification by enabling weight sharing across input channels. Recent works make it possible to improve representational capabilities by using hypercomplex-inspired networks which consume high computational costs. This paper reduces this cost by factorizing a quaternion 2D convolutional module into two consecutive vectormap 1D convolutional modules. Also, we use 5D parameterized hypercomplex multiplication based fully connected layers. Incorporating both yields our proposed hypercomplex network, a novel architecture that can be assembled to construct deep axial-hypercomplex networks (DANs) for image classifications. We conduct experiments on CIFAR benchmarks, SVHN, and Tiny ImageNet datasets and achieve better performance with fewer trainable parameters and FLOPS. Our proposed model achieves almost 2% higher performance for CIFAR and SVHN datasets, and more than 3% for the ImageNet-Tiny dataset and takes six times fewer parameters than the real-valued ResNets. Also, it shows state-of-the-art performance on CIFAR benchmarks in hypercomplex space. ",
    "url": "https://arxiv.org/abs/2301.04626",
    "authors": [
      "Nazmul Shahadat",
      "Anthony S. Maida"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.04631",
    "title": "Deep Residual Axial Networks",
    "abstract": "While residual networks (ResNets) demonstrate outstanding performance on computer vision tasks, their computational cost still remains high. Here, we focus on reducing this cost by proposing a new network architecture, axial ResNet, which replaces spatial 2D convolution operations with two consecutive 1D convolution operations. Convergence of very deep axial ResNets has faced degradation problems which prevent the networks from performing efficiently. To mitigate this, we apply a residual connection to each 1D convolutional operation and propose our final novel architecture namely residual axial networks (RANs). Extensive benchmark evaluation shows that RANs outperform with about 49% fewer parameters than ResNets on CIFAR benchmarks, SVHN, and Tiny ImageNet image classification datasets. Moreover, our proposed RANs show significant improvement in validation performance in comparison to the wide ResNets on CIFAR benchmarks and the deep recursive residual networks on image super-resolution dataset. ",
    "url": "https://arxiv.org/abs/2301.04631",
    "authors": [
      "Nazmul Shahadat",
      "Anthony S. Maida"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2301.04632",
    "title": "Federated Learning under Heterogeneous and Correlated Client  Availability",
    "abstract": "The enormous amount of data produced by mobile and IoT devices has motivated the development of federated learning (FL), a framework allowing such devices (or clients) to collaboratively train machine learning models without sharing their local data. FL algorithms (like FedAvg) iteratively aggregate model updates computed by clients on their own datasets. Clients may exhibit different levels of participation, often correlated over time and with other clients. This paper presents the first convergence analysis for a FedAvg-like FL algorithm under heterogeneous and correlated client availability. Our analysis highlights how correlation adversely affects the algorithm's convergence rate and how the aggregation strategy can alleviate this effect at the cost of steering training toward a biased model. Guided by the theoretical analysis, we propose CA-Fed, a new FL algorithm that tries to balance the conflicting goals of maximizing convergence speed and minimizing model bias. To this purpose, CA-Fed dynamically adapts the weight given to each client and may ignore clients with low availability and large correlation. Our experimental results show that CA-Fed achieves higher time-average accuracy and a lower standard deviation than state-of-the-art AdaFed and F3AST, both on synthetic and real datasets. ",
    "url": "https://arxiv.org/abs/2301.04632",
    "authors": [
      "Angelo Rodio",
      "Francescomaria Faticanti",
      "Othmane Marfoq",
      "Giovanni Neglia",
      "Emilio Leonardi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2301.04217",
    "title": "Neighbourhood complexity of graphs of bounded twin-width",
    "abstract": "We give essentially tight bounds for, $\\nu(d,k)$, the maximum number of distinct neighbourhoods on a set $X$ of $k$ vertices in a graph with twin-width at most $d$. Using the celebrated Marcus-Tardos theorem, two independent works [Bonnet et al., Algorithmica '22; Przybyszewski '22] have shown the upper bound $\\nu(d,k) \\leqslant \\exp(\\exp(O(d)))k$, with a double-exponential dependence in the twin-width. We give a short self-contained proof that for every $d$ and $k$, $$\\nu(d,k) \\leqslant (d+2)2^{d+1}k = 2^{d+O(\\log d)}k,$$ and build a bipartite graph implying $\\nu(d,k) \\geqslant 2^{d+\\log d+O(1)}k$, in the regime when $k$ is large enough compared to $d$. ",
    "url": "https://arxiv.org/abs/2301.04217",
    "authors": [
      "Édouard Bonnet",
      "Florent Foucaud",
      "Tuomo Lehtilä",
      "Aline Parreau"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2301.04225",
    "title": "Inferring Gene Regulatory Neural Networks for Bacterial Decision Making  in Biofilms",
    "abstract": "Bacterial cells are sensitive to a range of external signals used to learn the environment. These incoming external signals are then processed using a Gene Regulatory Network (GRN), exhibiting similarities to modern computing algorithms. An in-depth analysis of gene expression dynamics suggests an inherited Gene Regulatory Neural Network (GRNN) behavior within the GRN that enables the cellular decision-making based on received signals from the environment and neighbor cells. In this study, we extract a sub-network of \\textit{Pseudomonas aeruginosa} GRN that is associated with one virulence factor: pyocyanin production as a use case to investigate the GRNN behaviors. Further, using Graph Neural Network (GNN) architecture, we model a single species biofilm to reveal the role of GRNN dynamics on ecosystem-wide decision-making. Varying environmental conditions, we prove that the extracted GRNN computes input signals similar to natural decision-making process of the cell. Identifying of neural network behaviors in GRNs may lead to more accurate bacterial cell activity predictive models for many applications, including human health-related problems and agricultural applications. Further, this model can produce data on causal relationships throughout the network, enabling the possibility of designing tailor-made infection-controlling mechanisms. More interestingly, these GRNNs can perform computational tasks for bio-hybrid computing systems. ",
    "url": "https://arxiv.org/abs/2301.04225",
    "authors": [
      "Samitha Somathilaka",
      "Daniel P. Martins",
      "Xu Li",
      "Yusong Li",
      "Sasitharan Balasubramaniam"
    ],
    "subjectives": [
      "Molecular Networks (q-bio.MN)",
      "Machine Learning (cs.LG)",
      "Cell Behavior (q-bio.CB)"
    ]
  },
  {
    "id": "arXiv:2301.04401",
    "title": "An atrium segmentation network with location guidance and siamese  adjustment",
    "abstract": "The segmentation of atrial scan images is of great significance for the three-dimensional reconstruction of the atrium and the surgical positioning. Most of the existing segmentation networks adopt a 2D structure and only take original images as input, ignoring the context information of 3D images and the role of prior information. In this paper, we propose an atrium segmentation network LGSANet with location guidance and siamese adjustment, which takes adjacent three slices of images as input and adopts an end-to-end approach to achieve coarse-to-fine atrial segmentation. The location guidance(LG) block uses the prior information of the localization map to guide the encoding features of the fine segmentation stage, and the siamese adjustment(SA) block uses the context information to adjust the segmentation edges. On the atrium datasets of ACDC and ASC, sufficient experiments prove that our method can adapt to many classic 2D segmentation networks, so that it can obtain significant performance improvements. ",
    "url": "https://arxiv.org/abs/2301.04401",
    "authors": [
      "Yuhan Xie",
      "Zhiyong Zhang",
      "Shaolong Chen",
      "Changzhen Qiu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2003.00865",
    "title": "Towards Backdoor Attacks and Defense in Robust Machine Learning Models",
    "abstract": " Comments: Accepted in Computers & Security, 2023 ",
    "url": "https://arxiv.org/abs/2003.00865",
    "authors": [
      "Ezekiel Soremekun",
      "Sakshi Udeshi",
      "Sudipta Chattopadhyay"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2007.12140",
    "title": "HITNet: Hierarchical Iterative Tile Refinement Network for Real-time  Stereo Matching",
    "abstract": " Comments: The pretrained models used for submission to benchmarks and sample evaluation scripts can be found at this https URL ",
    "url": "https://arxiv.org/abs/2007.12140",
    "authors": [
      "Vladimir Tankovich",
      "Christian Häne",
      "Yinda Zhang",
      "Adarsh Kowdle",
      "Sean Fanello",
      "Sofien Bouaziz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2011.03353",
    "title": "Self-Supervised Learning for Biological Sample Localization in 3D  Tomographic Images",
    "abstract": " Title: Self-Supervised Learning for Biological Sample Localization in 3D  Tomographic Images ",
    "url": "https://arxiv.org/abs/2011.03353",
    "authors": [
      "Yaroslav Zharov",
      "Alexey Ershov",
      "Tilo Baumbach",
      "Vincent Heuveline"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.11818",
    "title": "Combinatorial Characterizations and Impossibilities for Higher-order  Homophily",
    "abstract": " Title: Combinatorial Characterizations and Impossibilities for Higher-order  Homophily ",
    "url": "https://arxiv.org/abs/2103.11818",
    "authors": [
      "Nate Veldt",
      "Austin R. Benson",
      "Jon Kleinberg"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2106.11732",
    "title": "FLEA: Provably Robust Fair Multisource Learning from Unreliable Training  Data",
    "abstract": " Comments: 10 pages in main text; 42 pages including bibliography and appendix. Published in Transactions of Machine Learning Research (TMLR), 2022, this https URL; project website at this https URL ",
    "url": "https://arxiv.org/abs/2106.11732",
    "authors": [
      "Eugenia Iofinova",
      "Nikola Konstantinov",
      "Christoph H. Lampert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.05475",
    "title": "GiT: Graph Interactive Transformer for Vehicle Re-identification",
    "abstract": " Comments: Accepted in IEEE TIP 2023 ",
    "url": "https://arxiv.org/abs/2107.05475",
    "authors": [
      "Fei Shen",
      "Yi Xie",
      "Jianqing Zhu",
      "Xiaobin Zhu",
      "Huanqiang Zeng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.02394",
    "title": "FAST: Faster Arbitrarily-Shaped Text Detector with Minimalist Kernel  Representation",
    "abstract": " Title: FAST: Faster Arbitrarily-Shaped Text Detector with Minimalist Kernel  Representation ",
    "url": "https://arxiv.org/abs/2111.02394",
    "authors": [
      "Zhe Chen",
      "Jiahao Wang",
      "Wenhai Wang",
      "Guo Chen",
      "Enze Xie",
      "Ping Luo",
      "Tong Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.14698",
    "title": "Asymptotic Learning Requirements for Stealth Attacks on Linearized State  Estimation",
    "abstract": " Comments: accepted by IEEE Transactions on Smart Grid ",
    "url": "https://arxiv.org/abs/2112.14698",
    "authors": [
      "Ke Sun",
      "Iñaki Esnaola",
      "Antonia M. Tulino",
      "H. Vincent Poor"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2201.02550",
    "title": "Textual Data Augmentation for Arabic-English Code-Switching Speech  Recognition",
    "abstract": " Title: Textual Data Augmentation for Arabic-English Code-Switching Speech  Recognition ",
    "url": "https://arxiv.org/abs/2201.02550",
    "authors": [
      "Amir Hussein",
      "Shammur Absar Chowdhury",
      "Ahmed Abdelali",
      "Najim Dehak",
      "Ahmed Ali",
      "Sanjeev Khudanpur"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2201.02933",
    "title": "Causal Discovery from Sparse Time-Series Data Using Echo State Network",
    "abstract": " Title: Causal Discovery from Sparse Time-Series Data Using Echo State Network ",
    "url": "https://arxiv.org/abs/2201.02933",
    "authors": [
      "Haonan Chen",
      "Bo Yuan Chang",
      "Mohamed A. Naiel",
      "Georges Younes",
      "Steven Wardell",
      "Stan Kleinikkink",
      "John S. Zelek"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2201.06819",
    "title": "Sensor Scheduling Design for Complex Networks under a Distributed State  Estimation Framework",
    "abstract": " Title: Sensor Scheduling Design for Complex Networks under a Distributed State  Estimation Framework ",
    "url": "https://arxiv.org/abs/2201.06819",
    "authors": [
      "Peihu Duan",
      "Lidong He",
      "Lingying Huang",
      "Guanrong Chen",
      "Ling Shi"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2202.02943",
    "title": "Learning fair representation with a parametric integral probability  metric",
    "abstract": " Comments: 28 pages, including references and appendix ",
    "url": "https://arxiv.org/abs/2202.02943",
    "authors": [
      "Dongha Kim",
      "Kunwoong Kim",
      "Insung Kong",
      "Ilsang Ohn",
      "Yongdai Kim"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.10446",
    "title": "EINNs: Epidemiologically-informed Neural Networks",
    "abstract": " Comments: Appears in AAAI 2023 ",
    "url": "https://arxiv.org/abs/2202.10446",
    "authors": [
      "Alexander Rodríguez",
      "Jiaming Cui",
      "Naren Ramakrishnan",
      "Bijaya Adhikari",
      "B. Aditya Prakash"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Physics and Society (physics.soc-ph)",
      "Populations and Evolution (q-bio.PE)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2202.11453",
    "title": "Bitwidth Heterogeneous Federated Learning with Progressive Weight  Dequantization",
    "abstract": " Comments: ICML 2022 ",
    "url": "https://arxiv.org/abs/2202.11453",
    "authors": [
      "Jaehong Yoon",
      "Geon Park",
      "Wonyong Jeong",
      "Sung Ju Hwang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2203.01693",
    "title": "Learning Neural Set Functions Under the Optimal Subset Oracle",
    "abstract": " Title: Learning Neural Set Functions Under the Optimal Subset Oracle ",
    "url": "https://arxiv.org/abs/2203.01693",
    "authors": [
      "Zijing Ou",
      "Tingyang Xu",
      "Qinliang Su",
      "Yingzhen Li",
      "Peilin Zhao",
      "Yatao Bian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.15955",
    "title": "Investigating the Properties of Neural Network Representations in  Reinforcement Learning",
    "abstract": " Title: Investigating the Properties of Neural Network Representations in  Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2203.15955",
    "authors": [
      "Han Wang",
      "Erfan Miahi",
      "Martha White",
      "Marlos C. Machado",
      "Zaheer Abbas",
      "Raksha Kumaraswamy",
      "Vincent Liu",
      "Adam White"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.05108",
    "title": "Improved Training of Physics-Informed Neural Networks with Model  Ensembles",
    "abstract": " Title: Improved Training of Physics-Informed Neural Networks with Model  Ensembles ",
    "url": "https://arxiv.org/abs/2204.05108",
    "authors": [
      "Katsiaryna Haitsiukevich",
      "Alexander Ilin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.10777",
    "title": "ParkPredict+: Multimodal Intent and Motion Prediction for Vehicles in  Parking Lots with CNN and Transformer",
    "abstract": " Comments: Published at IEEE ITSC 2022 ",
    "url": "https://arxiv.org/abs/2204.10777",
    "authors": [
      "Xu Shen",
      "Matthew Lacayo",
      "Nidhir Guggilla",
      "Francesco Borrelli"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.08576",
    "title": "Label-Efficient Self-Supervised Federated Learning for Tackling Data  Heterogeneity in Medical Imaging",
    "abstract": " Comments: Code and trained models are available at: this https URL ",
    "url": "https://arxiv.org/abs/2205.08576",
    "authors": [
      "Rui Yan",
      "Liangqiong Qu",
      "Qingyue Wei",
      "Shih-Cheng Huang",
      "Liyue Shen",
      "Daniel Rubin",
      "Lei Xing",
      "Yuyin Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.15462",
    "title": "Causal Explanations for Sequential Decision Making Under Uncertainty",
    "abstract": " Comments: 9 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2205.15462",
    "authors": [
      "Samer B. Nashed",
      "Saaduddin Mahmud",
      "Claudia V. Goldman",
      "Shlomo Zilberstein"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2207.08230",
    "title": "Troll Tweet Detection Using Contextualized Word Representations",
    "abstract": " Title: Troll Tweet Detection Using Contextualized Word Representations ",
    "url": "https://arxiv.org/abs/2207.08230",
    "authors": [
      "Seyhmus Yilmaz",
      "Sultan Zavrak"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.05117",
    "title": "NOTE: Robust Continual Test-time Adaptation Against Temporal Correlation",
    "abstract": " Comments: NeurIPS 2022 camera-ready version ",
    "url": "https://arxiv.org/abs/2208.05117",
    "authors": [
      "Taesik Gong",
      "Jongheon Jeong",
      "Taewon Kim",
      "Yewon Kim",
      "Jinwoo Shin",
      "Sung-Ju Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.12062",
    "title": "Compressing bipartite graphs with a dual reordering scheme",
    "abstract": " Title: Compressing bipartite graphs with a dual reordering scheme ",
    "url": "https://arxiv.org/abs/2209.12062",
    "authors": [
      "Maximilien Danisch",
      "Ioannis Panagiotas",
      "Lionel Tabourier"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2209.13318",
    "title": "Modeling and Control of Discrete Event Systems under Joint  Sensor-Actuator Cyber Attacks",
    "abstract": " Title: Modeling and Control of Discrete Event Systems under Joint  Sensor-Actuator Cyber Attacks ",
    "url": "https://arxiv.org/abs/2209.13318",
    "authors": [
      "Shengbao Zheng",
      "Shaolong Shu",
      "Feng Lin"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2210.05167",
    "title": "The Fast and Accurate Approach to Detection and Segmentation of Melanoma  Skin Cancer using Fine-tuned Yolov3 and SegNet Based on Deep Transfer  Learning",
    "abstract": " Title: The Fast and Accurate Approach to Detection and Segmentation of Melanoma  Skin Cancer using Fine-tuned Yolov3 and SegNet Based on Deep Transfer  Learning ",
    "url": "https://arxiv.org/abs/2210.05167",
    "authors": [
      "Mohamad Taghizadeh",
      "Karim Mohammadi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.06170",
    "title": "Contrastive Neural Ratio Estimation",
    "abstract": " Comments: 10 pages. 33 pages with references and supplemental material. Accepted at NeurIPS 2022. Code at this https URL ",
    "url": "https://arxiv.org/abs/2210.06170",
    "authors": [
      "Benjamin Kurt Miller",
      "Christoph Weniger",
      "Patrick Forré"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)"
    ]
  },
  {
    "id": "arXiv:2210.12239",
    "title": "Auto-Encoder Neural Network Incorporating X-Ray Fluorescence Fundamental  Parameters with Machine Learning",
    "abstract": " Comments: submitted to X-ray Spectrometry journal (Wiley) ",
    "url": "https://arxiv.org/abs/2210.12239",
    "authors": [
      "Matthew Dirks",
      "David Poole"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.14577",
    "title": "Disentangling Past-Future Modeling in Sequential Recommendation via Dual  Networks",
    "abstract": " Comments: Accept by CIKM 2022 ",
    "url": "https://arxiv.org/abs/2210.14577",
    "authors": [
      "Hengyu Zhang",
      "Enming Yuan",
      "Wei Guo",
      "Zhicheng He",
      "Jiarui Qin",
      "Huifeng Guo",
      "Bo Chen",
      "Xiu Li",
      "Ruiming Tang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2211.03413",
    "title": "Max-Min Off-Policy Actor-Critic Method Focusing on Worst-Case Robustness  to Model Misspecification",
    "abstract": " Comments: Neural Information Processing Systems 2022 (NeurIPS '22) ",
    "url": "https://arxiv.org/abs/2211.03413",
    "authors": [
      "Takumi Tanabe",
      "Rei Sato",
      "Kazuto Fukuchi",
      "Jun Sakuma",
      "Youhei Akimoto"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.08604",
    "title": "PU GNN: Chargeback Fraud Detection in P2E MMORPGs via Graph Attention  Networks with Imbalanced PU Labels",
    "abstract": " Comments: Under Review, Industry Track (version 04) ",
    "url": "https://arxiv.org/abs/2211.08604",
    "authors": [
      "Jiho Choi",
      "Junghoon Park",
      "Woocheol Kim",
      "Jin-Hyeok Park",
      "Yumin Suh",
      "Minchang Sung"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2212.03978",
    "title": "Learning Graph Search Heuristics",
    "abstract": " Title: Learning Graph Search Heuristics ",
    "url": "https://arxiv.org/abs/2212.03978",
    "authors": [
      "Michal Pándy",
      "Weikang Qiu",
      "Gabriele Corso",
      "Petar Veličković",
      "Rex Ying",
      "Jure Leskovec",
      "Pietro Liò"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.05190",
    "title": "Neural Bandits for Data Mining: Searching for Dangerous Polypharmacy",
    "abstract": " Comments: This article is presented at the W3PHIAI-23 workshop at AAAI-2023 ",
    "url": "https://arxiv.org/abs/2212.05190",
    "authors": [
      "Alexandre Larouche",
      "Audrey Durand",
      "Richard Khoury",
      "Caroline Sirois"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.10596",
    "title": "Open-Vocabulary Temporal Action Detection with Off-the-Shelf Image-Text  Features",
    "abstract": " Title: Open-Vocabulary Temporal Action Detection with Off-the-Shelf Image-Text  Features ",
    "url": "https://arxiv.org/abs/2212.10596",
    "authors": [
      "Vivek Rathod",
      "Bryan Seybold",
      "Sudheendra Vijayanarasimhan",
      "Austin Myers",
      "Xiuye Gu",
      "Vighnesh Birodkar",
      "David A. Ross"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13638",
    "title": "Battling the Coronavirus Infodemic Among Social Media Users in Africa",
    "abstract": " Comments: 42 pages including appendix, 9 figures ",
    "url": "https://arxiv.org/abs/2212.13638",
    "authors": [
      "Molly Offer-Westort",
      "Leah R. Rosenzweig",
      "Susan Athey"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2212.14111",
    "title": "Effectiveness of Deep Image Embedding Clustering Methods on Tabular Data",
    "abstract": " Title: Effectiveness of Deep Image Embedding Clustering Methods on Tabular Data ",
    "url": "https://arxiv.org/abs/2212.14111",
    "authors": [
      "Sakib Abrar",
      "Ali Sekmen",
      "Manar D. Samad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2301.00411",
    "title": "Detachable Novel Views Synthesis of Dynamic Scenes Using  Distribution-Driven Neural Radiance Fields",
    "abstract": " Title: Detachable Novel Views Synthesis of Dynamic Scenes Using  Distribution-Driven Neural Radiance Fields ",
    "url": "https://arxiv.org/abs/2301.00411",
    "authors": [
      "Boyu Zhang",
      "Wenbo Xu",
      "Zheng Zhu",
      "Guan Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.01850",
    "title": "Bayesian Weapon System Reliability Modeling with Cox-Weibull Neural  Network",
    "abstract": " Comments: Pre-print with minor revisions, accepted to be published in conference proceedings: The 69th Annual Reliability and Maintainability Symposium, January 23-26, 2023, FL, USA ",
    "url": "https://arxiv.org/abs/2301.01850",
    "authors": [
      "Michael Potter",
      "Benny Cheng"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2301.02445",
    "title": "IMKGA-SM: Interpretable Multimodal Knowledge Graph Answer Prediction via  Sequence Modeling",
    "abstract": " Comments: 12pages,10 figures ",
    "url": "https://arxiv.org/abs/2301.02445",
    "authors": [
      "Yilin Wen",
      "Biao Luo",
      "Yuqian Zhao"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.03207",
    "title": "Negative Results of Fusing Code and Documentation for Learning to  Accurately Identify Sensitive Source and Sink Methods An Application to the  Android Framework for Data Leak Detection",
    "abstract": " Comments: 30th IEEE International Conference on Software Analysis, Evolution and Reengineering, RENE track ",
    "url": "https://arxiv.org/abs/2301.03207",
    "authors": [
      "Jordan Samhi",
      "Maria Kober",
      "Abdoul Kader Kabore",
      "Steven Arzt",
      "Tegawendé F. Bissyandé",
      "Jacques Klein"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2301.03953",
    "title": "Channel-aware Decoupling Network for Multi-turn Dialogue Comprehension",
    "abstract": " Comments: Accepted by IEEE Transactions on Neural Networks and Learning Systems (TNNLS). Journal extension of arXiv:2009.06504 ",
    "url": "https://arxiv.org/abs/2301.03953",
    "authors": [
      "Zhuosheng Zhang",
      "Hai Zhao",
      "Longxiang Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  }
]