[
  {
    "id": "arXiv:2110.05645",
    "title": "A global convergence theory for deep ReLU implicit networks via  over-parameterization",
    "abstract": "Implicit deep learning has received increasing attention recently due to the fact that it generalizes the recursive prediction rules of many commonly used neural network architectures. Its prediction rule is provided implicitly based on the solution of an equilibrium equation. Although a line of recent empirical studies has demonstrated its superior performances, the theoretical understanding of implicit neural networks is limited. In general, the equilibrium equation may not be well-posed during the training. As a result, there is no guarantee that a vanilla (stochastic) gradient descent (SGD) training nonlinear implicit neural networks can converge. This paper fills the gap by analyzing the gradient flow of Rectified Linear Unit (ReLU) activated implicit neural networks. For an $m$-width implicit neural network with ReLU activation and $n$ training samples, we show that a randomly initialized gradient descent converges to a global minimum at a linear rate for the square loss function if the implicit neural network is \\textit{over-parameterized}. It is worth noting that, unlike existing works on the convergence of (S)GD on finite-layer over-parameterized neural networks, our convergence results hold for implicit neural networks, where the number of layers is \\textit{infinite}. ",
    "url": "https://arxiv.org/abs/2110.05645",
    "authors": [
      "Tianxiang Gao",
      "Hailiang Liu",
      "Jia Liu",
      "Hridesh Rajan",
      "Hongyang Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.05687",
    "title": "No way to crop: On robust image crop localization",
    "abstract": "Previous image forensics schemes for crop detection are only limited on predicting whether an image has been cropped. This paper presents a novel scheme for image crop localization using robust watermarking. We further extend our scheme to detect tampering attack on the attacked image. We demonstrate that our scheme is the first to provide high-accuracy and robust image crop localization. Besides, the accuracy of tamper detection is comparable to many state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2110.05687",
    "authors": [
      "Qichao Ying",
      "Xiaoxiao Hu",
      "Hang Zhou",
      "Xiangyu Zhang",
      "Zhengxin You",
      "Zhenxing Qian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2110.05712",
    "title": "DecGAN: Decoupling Generative Adversarial Network detecting abnormal  neural circuits for Alzheimer's disease",
    "abstract": "One of the main reasons for Alzheimer's disease (AD) is the disorder of some neural circuits. Existing methods for AD prediction have achieved great success, however, detecting abnormal neural circuits from the perspective of brain networks is still a big challenge. In this work, a novel decoupling generative adversarial network (DecGAN) is proposed to detect abnormal neural circuits for AD. Concretely, a decoupling module is designed to decompose a brain network into two parts: one part is composed of a few sparse graphs which represent the neural circuits largely determining the development of AD; the other part is a supplement graph, whose influence on AD can be ignored. Furthermore, the adversarial strategy is utilized to guide the decoupling module to extract the feature more related to AD. Meanwhile, by encoding the detected neural circuits to hypergraph data, an analytic module associated with the hyperedge neurons algorithm is designed to identify the neural circuits. More importantly, a novel sparse capacity loss based on the spatial-spectral hypergraph similarity is developed to minimize the intrinsic topological distribution of neural circuits, which can significantly improve the accuracy and robustness of the proposed model. Experimental results demonstrate that the proposed model can effectively detect the abnormal neural circuits at different stages of AD, which is helpful for pathological study and early treatment. ",
    "url": "https://arxiv.org/abs/2110.05712",
    "authors": [
      "Junren Pan",
      "Baiying Lei",
      "Shuqiang Wang",
      "Bingchuan Wang",
      "Yong Liu",
      "Yanyan Shen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2110.05840",
    "title": "A bridge between features and evidence for binary attribute-driven  perfect privacy",
    "abstract": "Attribute-driven privacy aims to conceal a single user's attribute, contrary to anonymisation that tries to hide the full identity of the user in some data. When the attribute to protect from malicious inferences is binary, perfect privacy requires the log-likelihood-ratio to be zero resulting in no strength-of-evidence. This work presents an approach based on normalizing flow that maps a feature vector into a latent space where the strength-of-evidence, related to the binary attribute, and an independent residual are disentangled. It can be seen as a non-linear discriminant analysis where the mapping is invertible allowing generation by mapping the latent variable back to the original space. This framework allows to manipulate the log-likelihood-ratio of the data and thus to set it to zero for privacy. We show the applicability of the approach on an attribute-driven privacy task where the sex information is removed from speaker embeddings. Results on VoxCeleb2 dataset show the efficiency of the method that outperforms in terms of privacy and utility our previous experiments based on adversarial disentanglement. ",
    "url": "https://arxiv.org/abs/2110.05840",
    "authors": [
      "Paul-Gauthier Noé",
      "Andreas Nautsch",
      "Driss Matrouf",
      "Pierre-Michel Bousquet",
      "Jean-François Bonastre"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2110.05906",
    "title": "Energy-cost aware off-grid base stations with IoT devices for developing  a green heterogeneous network",
    "abstract": "Heterogeneous network (HetNet) is a specified cellular platform to tackle the rapidly growing anticipated data traffic. From communications perspective, data loads can be mapped to energy loads that are generally placed on the operator networks. Meanwhile, renewable energy aided networks offer to curtail fossil fuel consumption, so to reduce environmental pollution. This paper proposes a renewable energy based power supply architecture for off-grid HetNet using a novel energy sharing model. Solar photovoltaic (PV) along with sufficient energy storage devices are used for each macro, micro, pico, or femto base station (BS). Additionally, biomass generator (BG) is used for macro and micro BSs. The collocated macro and micro BSs are connected through end-to-end resistive lines. A novel weighted proportional-fair resource-scheduling algorithm with sleep mechanisms is proposed for non-real time (NRT) applications by trading-off the power consumption and communication delays. Furthermore, the proposed algorithm with extended discontinuous reception (eDRX) and power saving mode (PSM) for narrowband internet of things (IoT) applications extends battery lifetime for IoT devices. HOMER optimization software is used to perform optimal system architecture, economic, and carbon footprint analyses while Monte-Carlo simulation tool is used for evaluating the throughput and energy efficiency performances. The proposed algorithms are valid for the practical data of the rural areas. We demonstrate the proposed power supply architecture is energy-efficient, cost-effective, reliable, and eco-friendly. ",
    "url": "https://arxiv.org/abs/2110.05906",
    "authors": [
      "Khondoker Ziaul Islam",
      "MD. Sanwar Hossain",
      "B.M. Ruhul Amin",
      "Ferdous Sohel"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2110.05917",
    "title": "On the complexity of structure and substructure connectivity of graphs",
    "abstract": "The connectivity of a graph is an important parameter to measure its reliability. Structure and substructure connectivity are two novel generalizations of the connectivity. In this paper, we characterize the complexity of determining structure and substructure connectivity of graphs, showing that they are both NP-complete. ",
    "url": "https://arxiv.org/abs/2110.05917",
    "authors": [
      "Huazhong Lü",
      "Tingzeng Wu"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2110.06009",
    "title": "Dynamics of scientific collaboration networks due to academic migrations",
    "abstract": "Academic migration is the change of host institution by a researcher, typically aimed at achieving a stronger research profile. Scientific features such as the number of collaborations, the productivity and its research impact tend to be directly affected by such movements. In this paper, we analyse the dynamics of the collaboration network of researchers as they move from an institution to the next one. We specifically highlight cases where they increase and when they shrink, and quantify the dependency between the collaboration networks before and after such a movement. Finally, we drill down the analysis by dividing movements depending on the career stage of the researchers. The analysis shows a remarkable dynamism of collaboration networks across migrations. Interestingly, not always movements result in larger collaboration networks, while the overall similarity between networks across movements is quite limited on average. Qualitatively, the same effects can be found at all career stages, while, clearly, the magnitude of them might vary. These results are based on a dataset extracted from Scopus, containing detailed scientific information for the publications of 84,141 researchers. ",
    "url": "https://arxiv.org/abs/2110.06009",
    "authors": [
      "Pavlos Paraskevopoulos",
      "Chiara Boldrini",
      "Andrea Passarella",
      "Marco Conti"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2110.06020",
    "title": "Uncertainty-based out-of-distribution detection requires suitable  function space priors",
    "abstract": "The need to avoid confident predictions on unfamiliar data has sparked interest in out-of-distribution (OOD) detection. It is widely assumed that Bayesian neural networks (BNNs) are well suited for this task, as the endowed epistemic uncertainty should lead to disagreement in predictions on outliers. In this paper, we question this assumption and show that proper Bayesian inference with function space priors induced by neural networks does not necessarily lead to good OOD detection. To circumvent the use of approximate inference, we start by studying the infinite-width case, where Bayesian inference can be exact due to the correspondence with Gaussian processes. Strikingly, the kernels induced under common architectural choices lead to uncertainties that do not reflect the underlying data generating process and are therefore unsuited for OOD detection. Importantly, we find this OOD behavior to be consistent with the corresponding finite-width networks. Desirable function space properties can be encoded in the prior in weight space, however, this currently only applies to a specified subset of the domain and thus does not inherently extend to OOD data. Finally, we argue that a trade-off between generalization and OOD capabilities might render the application of BNNs for OOD detection undesirable in practice. Overall, our study discloses fundamental problems when naively using BNNs for OOD detection and opens interesting avenues for future research. ",
    "url": "https://arxiv.org/abs/2110.06020",
    "authors": [
      "Francesco D'Angelo",
      "Christian Henning"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.06119",
    "title": "The Turing machine of a harmonic oscillator: from the code to the  dynamic system",
    "abstract": "In this work we consider a dynamic system consisting of a damped harmonic oscillator and we formalize a Turing Machine whose definition in terms of states, alphabet and transition rules, can be considered equivalent to that of the oscillator. We prove that the Turing Machine of a FOR loop corresponds to that of the oscillator and we ask ourselves if it is possible to obtain the dynamic system of the harmonic oscillator as a physical realization of the FOR loop. We discuss the relationship between the results found and the science of Can and Can't. We discuss the possibility of an evolution of computer science also towards non-computerized specialized machines whose operating principle is designed as an automatic process starting from a source code instead of as a work of human ingenuity. The approach to the implementation of algorithms in dynamic systems instead of universal computers can be particularly interesting for the field of both diagnostic and implantable medical devices. ",
    "url": "https://arxiv.org/abs/2110.06119",
    "authors": [
      "Francesco Sisini",
      "Valentina Sisini"
    ],
    "subjectives": [
      "Other Computer Science (cs.OH)",
      "Popular Physics (physics.pop-ph)"
    ]
  },
  {
    "id": "arXiv:2110.06135",
    "title": "Label scarcity in biomedicine: Data-rich latent factor discovery  enhances phenotype prediction",
    "abstract": "High-quality data accumulation is now becoming ubiquitous in the health domain. There is increasing opportunity to exploit rich data from normal subjects to improve supervised estimators in specific diseases with notorious data scarcity. We demonstrate that low-dimensional embedding spaces can be derived from the UK Biobank population dataset and used to enhance data-scarce prediction of health indicators, lifestyle and demographic characteristics. Phenotype predictions facilitated by Variational Autoencoder manifolds typically scaled better with increasing unlabeled data than dimensionality reduction by PCA or Isomap. Performances gains from semisupervison approaches will probably become an important ingredient for various medical data science applications. ",
    "url": "https://arxiv.org/abs/2110.06135",
    "authors": [
      "Marc-Andre Schulz",
      "Bertrand Thirion",
      "Alexandre Gramfort",
      "Gaël Varoquaux",
      "Danilo Bzdok"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2110.05632",
    "title": "Wind-robust sound event detection and denoising for bioacoustics",
    "abstract": "Sound recordings are used in various ecological studies, including acoustic wildlife monitoring. Such surveys require automatic detection of target sound events. However, current detectors, especially those relying on band-limited energy, are severely impacted by wind. The rapid dynamics of this noise invalidate standard noise estimators, and no satisfactory method for dealing with it exists in bioacoustics, where simple training and generalization between conditions are important. We propose to estimate the transient noise level by fitting short-term spectrum models to a wavelet packet representation. This estimator is then combined with log-spectral subtraction to stabilize the background level. The resulting adjusted wavelet series can be analysed by standard energy detectors. We use real monitoring data to tune this workflow, and test it on two acoustic surveys of birds. Additionally, we show how the estimator can be incorporated in a denoising method to restore sound. The proposed noise-robust workflow greatly reduced the number of false alarms in the surveys, compared to unadjusted energy detection. As a result, the survey efficiency (precision of the estimated call density) improved for both species. Denoising was also more effective when using the short-term estimate, whereas standard wavelet shrinkage with a constant noise estimate struggled to remove the effects of wind. In contrast to existing methods, the proposed estimator can adjust for transient broadband noises without requiring additional hardware or extensive tuning to each species. It improved the detection workflow based on very little training data, making it particularly attractive for detection of rare species. ",
    "url": "https://arxiv.org/abs/2110.05632",
    "authors": [
      "Julius Juodakis",
      "Stephen Marsland"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Sound (cs.SD)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2110.05854",
    "title": "A scalable and fast artificial neural network syndrome decoder for  surface codes",
    "abstract": "Surface code error correction offers a highly promising pathway to achieve scalable fault-tolerant quantum computing. When operated as stabilizer codes, surface code computations consist of a syndrome decoding step where measured stabilizer operators are used to determine appropriate corrections for errors in physical qubits. Decoding algorithms have undergone substantial development, with recent work incorporating machine learning (ML) techniques. Despite promising initial results, the ML-based syndrome decoders are still limited to small scale demonstrations with low latency and are incapable of handling surface codes with boundary conditions and various shapes needed for lattice surgery and braiding. Here, we report the development of an artificial neural network (ANN) based scalable and fast syndrome decoder capable of decoding surface codes of arbitrary shape and size with data qubits suffering from the depolarizing error model. Based on rigorous training over 50 million random quantum error instances, our ANN decoder is shown to work with code distances exceeding 1000 (more than 4 million physical qubits), which is the largest ML-based decoder demonstration to-date. The established ANN decoder demonstrates an execution time in principle independent of code distance, implying that its implementation on dedicated hardware could potentially offer surface code decoding times of O($\\mu$sec), commensurate with the experimentally realisable qubit coherence times. With the anticipated scale-up of quantum processors within the next decade, their augmentation with a fast and scalable syndrome decoder such as developed in our work is expected to play a decisive role towards experimental implementation of fault-tolerant quantum information processing. ",
    "url": "https://arxiv.org/abs/2110.05854",
    "authors": [
      "Spiro Gicev",
      "Lloyd C. L. Hollenberg",
      "Muhammad Usman"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.05876",
    "title": "Label-Aware Ranked Loss for robust People Counting using Automotive  in-cabin Radar",
    "abstract": "In this paper, we introduce the Label-Aware Ranked loss, a novel metric loss function. Compared to the state-of-the-art Deep Metric Learning losses, this function takes advantage of the ranked ordering of the labels in regression problems. To this end, we first show that the loss minimises when datapoints of different labels are ranked and laid at uniform angles between each other in the embedding space. Then, to measure its performance, we apply the proposed loss on a regression task of people counting with a short-range radar in a challenging scenario, namely a vehicle cabin. The introduced approach improves the accuracy as well as the neighboring labels accuracy up to 83.0% and 99.9%: An increase of 6.7%and 2.1% on state-of-the-art methods, respectively. ",
    "url": "https://arxiv.org/abs/2110.05876",
    "authors": [
      "Lorenzo Servadei",
      "Huawei Sun",
      "Julius Ott",
      "Michael Stephan",
      "Souvik Hazra",
      "Thomas Stadelmayer",
      "Daniela Sanchez Lopera",
      "Robert Wille",
      "Avik Santra"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.06023",
    "title": "The physics of higher-order interactions in complex systems",
    "abstract": "Complex networks have become the main paradigm for modelling the dynamics of interacting systems. However, networks are intrinsically limited to describing pairwise interactions, whereas real-world systems are often characterized by higher-order interactions involving groups of three or more units. Higher-order structures, such as hypergraphs and simplicial complexes, are therefore a better tool to map the real organization of many social, biological and man-made systems. Here, we highlight recent evidence of collective behaviours induced by higher-order interactions, and we outline three key challenges for the physics of higher-order systems. ",
    "url": "https://arxiv.org/abs/2110.06023",
    "authors": [
      "Federico Battiston",
      "Enrico Amico",
      "Alain Barrat",
      "Ginestra Bianconi",
      "Guilherme Ferraz de Arruda",
      "Benedetta Franceschiello",
      "Iacopo Iacopini",
      "Sonia Kéfi",
      "Vito Latora",
      "Yamir Moreno",
      "Micah M. Murray",
      "Tiago P. Peixoto",
      "Francesco Vaccarino",
      "Giovanni Petri"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Social and Information Networks (cs.SI)",
      "Adaptation and Self-Organizing Systems (nlin.AO)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2110.06082",
    "title": "Efficient Bayesian network structure learning via local Markov boundary  search",
    "abstract": "We analyze the complexity of learning directed acyclic graphical models from observational data in general settings without specific distributional assumptions. Our approach is information-theoretic and uses a local Markov boundary search procedure in order to recursively construct ancestral sets in the underlying graphical model. Perhaps surprisingly, we show that for certain graph ensembles, a simple forward greedy search algorithm (i.e. without a backward pruning phase) suffices to learn the Markov boundary of each node. This substantially improves the sample complexity, which we show is at most polynomial in the number of nodes. This is then applied to learn the entire graph under a novel identifiability condition that generalizes existing conditions from the literature. As a matter of independent interest, we establish finite-sample guarantees for the problem of recovering Markov boundaries from data. Moreover, we apply our results to the special case of polytrees, for which the assumptions simplify, and provide explicit conditions under which polytrees are identifiable and learnable in polynomial time. We further illustrate the performance of the algorithm, which is easy to implement, in a simulation study. Our approach is general, works for discrete or continuous distributions without distributional assumptions, and as such sheds light on the minimal assumptions required to efficiently learn the structure of directed graphical models from data. ",
    "url": "https://arxiv.org/abs/2110.06082",
    "authors": [
      "Ming Gao",
      "Bryon Aragam"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.06126",
    "title": "Spatial mixup: Directional loudness modification as data augmentation  for sound event localization and detection",
    "abstract": "Data augmentation methods have shown great importance in diverse supervised learning problems where labeled data is scarce or costly to obtain. For sound event localization and detection (SELD) tasks several augmentation methods have been proposed, with most borrowing ideas from other domains such as images, speech, or monophonic audio. However, only a few exploit the spatial properties of a full 3D audio scene. We propose Spatial Mixup, as an application of parametric spatial audio effects for data augmentation, which modifies the directional properties of a multi-channel spatial audio signal encoded in the ambisonics domain. Similarly to beamforming, these modifications enhance or suppress signals arriving from certain directions, although the effect is less pronounced. Therefore enabling deep learning models to achieve invariance to small spatial perturbations. The method is evaluated with experiments in the DCASE 2021 Task 3 dataset, where spatial mixup increases performance over a non-augmented baseline, and compares to other well known augmentation methods. Furthermore, combining spatial mixup with other methods greatly improves performance. ",
    "url": "https://arxiv.org/abs/2110.06126",
    "authors": [
      "Ricardo Falcon-Perez",
      "Kazuki Shimada",
      "Yuichiro Koyama",
      "Shusuke Takahashi",
      "Yuki Mitsufuji"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:1906.09501",
    "title": "Learning partial correlation graphs and graphical models by covariance  queries",
    "abstract": " Comments: The title of the paper was changed. The previous title was 'Structure learning in graphical models by covariance queries'. Other minor changes suggested by referees were also implemented ",
    "url": "https://arxiv.org/abs/1906.09501",
    "authors": [
      "Gábor Lugosi",
      "Jakub Truszkowski",
      "Vasiliki Velona",
      "Piotr Zwiernik"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.12695",
    "title": "Orientations and matrix function-based centralities in multiplex network  analysis of urban public transport",
    "abstract": " Title: Orientations and matrix function-based centralities in multiplex network  analysis of urban public transport ",
    "url": "https://arxiv.org/abs/2107.12695",
    "authors": [
      "Kai Bergermann",
      "Martin Stoll"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2108.13714",
    "title": "Competing control scenarios in probabilistic SIR epidemics on  social-contact networks",
    "abstract": " Comments: preprint submitted to journal \\ competing control scenarios ",
    "url": "https://arxiv.org/abs/2108.13714",
    "authors": [
      "Jan B. Broekaert",
      "Davide La Torre",
      "Faizal Hafiz"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Populations and Evolution (q-bio.PE)"
    ]
  },
  {
    "id": "arXiv:2109.06721",
    "title": "Linear block and convolutional MDS codes to required rate, distance and  type",
    "abstract": " Title: Linear block and convolutional MDS codes to required rate, distance and  type ",
    "url": "https://arxiv.org/abs/2109.06721",
    "authors": [
      "Ted Hurley"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2109.12813",
    "title": "An optimised deep spiking neural network architecture without gradients",
    "abstract": " Comments: 18 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2109.12813",
    "authors": [
      "Yeshwanth Bethi",
      "Ying Xu",
      "Gregory Cohen",
      "Andre van Schaik",
      "Saeed Afshar"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.01654",
    "title": "Improved architectures and training algorithms for deep operator  networks",
    "abstract": " Comments: 40 pages, 27 figures, 11 tables ",
    "url": "https://arxiv.org/abs/2110.01654",
    "authors": [
      "Sifan Wang",
      "Hanwen Wang",
      "Paris Perdikaris"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.04265",
    "title": "A study of the robustness of raw waveform based speaker embeddings under  mismatched conditions",
    "abstract": " Title: A study of the robustness of raw waveform based speaker embeddings under  mismatched conditions ",
    "url": "https://arxiv.org/abs/2110.04265",
    "authors": [
      "Ge Zhu",
      "Frank Cwitkowitz",
      "Zhiyao Duan"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2110.05020",
    "title": "MELONS: generating melody with long-term structure using transformers  and structure graph",
    "abstract": " Title: MELONS: generating melody with long-term structure using transformers  and structure graph ",
    "url": "https://arxiv.org/abs/2110.05020",
    "authors": [
      "Yi Zou",
      "Pei Zou",
      "Yi Zhao",
      "Kaixiang Zhang",
      "Ran Zhang",
      "Xiaorui Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  }
]