[
  {
    "id": "arXiv:2111.05854",
    "title": "Deep ReLU neural network approximation of parametric and stochastic  elliptic PDEs with lognormal inputs",
    "abstract": "We investigate non-adaptive methods of deep ReLU neural network approximation of the solution $u$ to parametric and stochastic elliptic PDEs with lognormal inputs on non-compact set $\\mathbb{R}^\\infty$. The approximation error is measured in the norm of the Bochner space $L_2(\\mathbb{R}^\\infty, V, \\gamma)$, where $\\gamma$ is the tensor product standard Gaussian probability on $\\mathbb{R}^\\infty$ and $V$ is the energy space. The approximation is based on an $m$-term truncation of the Hermite generalized polynomial chaos expansion (gpc) of $u$. Under a certain assumption on $\\ell_q$-summability condition for lognormal inputs ($0< q <\\infty$), we proved that for every integer $n > 1$, one can construct a non-adaptive compactly supported deep ReLU neural network $\\boldsymbol{\\phi}_n$ of size not greater than $n$ on $\\mathbb{R}^m$ with $m = \\mathcal{O} (n/\\log n)$, having $m$ outputs so that the summation constituted by replacing polynomials in the $m$-term truncation of Hermite gpc expansion by these $m$ outputs approximates $u$ with an error bound $\\mathcal{O}\\left(\\left(n/\\log n\\right)^{-1/q}\\right)$. This error bound is comparable to the error bound of the best approximation of $u$ by $n$-term truncations of Hermite gpc expansion which is $\\mathcal{O}(n^{-1/q})$. We also obtained some results on similar problems for parametric and stochastic elliptic PDEs with affine inputs, based on the Jacobi and Taylor gpc expansions. ",
    "url": "https://arxiv.org/abs/2111.05854",
    "authors": [
      "Dinh Dũng",
      "Van Kien Nguyen",
      "Duong Thanh Pham"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2111.06135",
    "title": "Decay bounds for Bernstein functions of Hermitian matrices with  applications to the fractional graph Laplacian",
    "abstract": "For many functions of matrices $f(A)$, it is known that their entries exhibit a rapid -- often exponential or even superexponential -- decay away from the sparsity pattern of the matrix $A$. In this paper we specifically focus on the class of Bernstein functions, which contains the fractional powers $A^\\alpha$, $\\alpha \\in (0,1)$ as an important special case, and derive new decay bounds by exploiting known results for the matrix exponential in conjunction with the L\\'evy--Khintchine integral representation. As a particular special case, we find a result concerning the power law decay of the strength of connection in nonlocal network dynamics described by the fractional graph Laplacian, which improves upon known results from the literature by doubling the exponent in the power law. ",
    "url": "https://arxiv.org/abs/2111.06135",
    "authors": [
      "Marcel Schweitzer"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2111.06161",
    "title": "Understanding mobility in networks: A node embedding approach",
    "abstract": "Motivated by the growing number of mobile devices capable of connecting and exchanging messages, we propose a methodology aiming to model and analyze node mobility in networks. We note that many existing solutions in the literature rely on topological measurements calculated directly on the graph of node contacts, aiming to capture the notion of the node's importance in terms of connectivity and mobility patterns beneficial for prototyping, design, and deployment of mobile networks. However, each measure has its specificity and fails to generalize the node importance notions that ultimately change over time. Unlike previous approaches, our methodology is based on a node embedding method that models and unveils the nodes' importance in mobility and connectivity patterns while preserving their spatial and temporal characteristics. We focus on a case study based on a trace of group meetings. The results show that our methodology provides a rich representation for extracting different mobility and connectivity patterns, which can be helpful for various applications and services in mobile networks. ",
    "url": "https://arxiv.org/abs/2111.06161",
    "authors": [
      "Matheus F. C. Barros",
      "Carlos H. G. Ferreira",
      "Bruno Pereira dos Santos",
      "Lourenço A. P. Júnior",
      "Marco Mellia",
      "Jussara M. Almeida"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2111.06175",
    "title": "Training neural networks with synthetic electrocardiograms",
    "abstract": "We present a method for training neural networks with synthetic electrocardiograms that mimic signals produced by a wearable single lead electrocardiogram monitor. We use domain randomization where the synthetic signal properties such as the waveform shape, RR-intervals and noise are varied for every training example. Models trained with synthetic data are compared to their counterparts trained with real data. Detection of r-waves in electrocardiograms recorded during different physical activities and in atrial fibrillation is used to compare the models. By allowing the randomization to increase beyond what is typically observed in the real-world data the performance is on par or superseding the performance of networks trained with real data. Experiments show robust performance with different seeds and training examples on different test sets without any test set specific tuning. The method makes possible to train neural networks using practically free-to-collect data with accurate labels without the need for manual annotations and it opens up the possibility of extending the use of synthetic data on cardiac disease classification when disease specific a priori information is used in the electrocardiogram generation. Additionally the distribution of data can be controlled eliminating class imbalances that are typically observed in health related data and additionally the generated data is inherently private. ",
    "url": "https://arxiv.org/abs/2111.06175",
    "authors": [
      "Matti Kaisti",
      "Juho Laitala",
      "Antti Airola"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.06240",
    "title": "Improvements to short-term weather prediction with  recurrent-convolutional networks",
    "abstract": "The Weather4cast 2021 competition gave the participants a task of predicting the time evolution of two-dimensional fields of satellite-based meteorological data. This paper describes the author's efforts, after initial success in the first stage of the competition, to improve the model further in the second stage. The improvements consisted of a shallower model variant that is competitive against the deeper version, adoption of the AdaBelief optimizer, improved handling of one of the predicted variables where the training set was found not to represent the validation set well, and ensembling multiple models to improve the results further. The largest quantitative improvements to the competition metrics can be attributed to the increased amount of training data available in the second stage of the competition, followed by the effects of model ensembling. Qualitative results show that the model can predict the time evolution of the fields, including the motion of the fields over time, starting with sharp predictions for the immediate future and blurring of the outputs in later frames to account for the increased uncertainty. ",
    "url": "https://arxiv.org/abs/2111.06240",
    "authors": [
      "Jussi Leinonen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)"
    ]
  },
  {
    "id": "arXiv:2111.06259",
    "title": "Learning via Long Short-Term Memory (LSTM) network for predicting  strains in Railway Bridge members under train induced vibration",
    "abstract": "Bridge health monitoring using machine learning tools has become an efficient and cost-effective approach in recent times. In the present study, strains in railway bridge member, available from a previous study conducted by IIT Guwahati has been utilized. These strain data were collected from an existing bridge while trains were passing over the bridge. LSTM is used to train the network and to predict strains in different members of the railway bridge. Actual field data has been used for the purpose of predicting strain in different members using strain data from a single member, yet it has been observed that they are quite agreeable to those of ground truth values. This is in spite of the fact that a lot of noise existed in the data, thus showing the efficacy of LSTM in training and predicting even from noisy field data. This may easily open up the possibility of collecting data from the bridge with a much lesser number of sensors and predicting the strain data in other members through LSTM network. ",
    "url": "https://arxiv.org/abs/2111.06259",
    "authors": [
      "Amartya Dutta",
      "Kamaljyoti Nath"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.06015",
    "title": "Uformer: A Unet based dilated complex & real dual-path conformer network  for simultaneous speech enhancement and dereverberation",
    "abstract": "Complex spectrum and magnitude are considered as two major features of speech enhancement and dereverberation. Traditional approaches always treat these two features separately, ignoring their underlying relationship. In this paper, we proposem Uformer, a Unet based dilated complex & real dual-path conformer network in both complex and magnitude domain for simultaneous speech enhancement and dereverberation. We exploit time attention (TA) and dilated convolution (DC) to leverage local and global contextual information and frequency attention (FA) to model dimensional information. These three sub-modules contained in the proposed dilated complex & real dual-path conformer module effectively improve the speech enhancement and dereverberation performance. Furthermore, hybrid encoder and decoder are adopted to simultaneously model the complex spectrum and magnitude and promote the information interaction between two domains. Encoder decoder attention is also applied to enhance the interaction between encoder and decoder. Our experimental results outperform all SOTA time and complex domain models objectively and subjectively. Specifically, Uformer reaches 3.6032 DNSMOS on the blind test set of Interspeech 2021 DNS Challenge, which outperforms all top-performed models. We also carry out ablation experiments to tease apart all proposed sub-modules that are most important. ",
    "url": "https://arxiv.org/abs/2111.06015",
    "authors": [
      "Yihui Fu",
      "Yun Liu",
      "Jingdong Li",
      "Dawei Luo",
      "Shubo Lv",
      "Yukai Jv",
      "Lei Xie"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2111.06079",
    "title": "Cops and robber on subclasses of $P_5$-free graphs",
    "abstract": "The game of cops and robber is a turn based vertex pursuit game played on a graph between a team of cops and a single robber. The cops and the robber move alternately along the edges of the graph. We say the team of cops win the game if a cop and the robber are at the same vertex of the graph. The minimum number of cops required to win in each component of a graph is called the cop number of the graph. Sivaraman [Discrete Math. 342(2019), pp. 2306-2307] conjectured that for every $t\\geq 5$, the cop number of a connected $P_t$-free graph is at most $t-3$, where $P_t$ denotes a path on $t$-vertices. Turcotte [Discrete Math. 345 (2022), pp. 112660] showed that the cop number of any $2K_2$-free graph is at most $2$, which was earlier conjectured by Sivaraman and Testa. Note that if a connected graph is $2K_2$-free, then it is also $P_5$-free. Liu showed that the cop number of a connected ($P_5$, claw)-free graph is at most $2$ that is the conjecture of Sivaraman is true for ($P_5$, claw)-free graphs. In this paper, we show that the cop number of a connected ($P_5,H$)-free graph is at most $2$, where $H\\in \\{C_4$, $C_5$, diamond, paw, $K_4$, $2K_1\\cup K_2$, $K_3\\cup K_1$, $P_3\\cup P_1\\}$. ",
    "url": "https://arxiv.org/abs/2111.06079",
    "authors": [
      "Uttam K. Gupta",
      "Suchismita Mishra",
      "Dinabandhu Pradhan"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:1911.08938",
    "title": "Problems with SZZ and Features: An empirical study of the state of  practice of defect prediction data collection",
    "abstract": " Comments: Accepted at Empirical Software Engineering, Springer. First three authors are equally contributing ",
    "url": "https://arxiv.org/abs/1911.08938",
    "authors": [
      "Steffen Herbold",
      "Alexander Trautsch",
      "Fabian Trautsch",
      "Benjamin Ledel"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2102.12967",
    "title": "A statistical framework for efficient out of distribution detection in  deep neural networks",
    "abstract": " Title: A statistical framework for efficient out of distribution detection in  deep neural networks ",
    "url": "https://arxiv.org/abs/2102.12967",
    "authors": [
      "Matan Haroush",
      "Tzviel Frostig",
      "Ruth Heller",
      "Daniel Soudry"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2103.16804",
    "title": "TS-RIR: Translated synthetic room impulse responses for speech  augmentation",
    "abstract": " Comments: Accepted to IEEE ASRU 2021. Source code is available at this https URL ",
    "url": "https://arxiv.org/abs/2103.16804",
    "authors": [
      "Anton Ratnarajah",
      "Zhenyu Tang",
      "Dinesh Manocha"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2109.01050",
    "title": "Characterizing possible failure modes in physics-informed neural  networks",
    "abstract": " Comments: 22 pages ",
    "url": "https://arxiv.org/abs/2109.01050",
    "authors": [
      "Aditi S. Krishnapriyan",
      "Amir Gholami",
      "Shandian Zhe",
      "Robert M. Kirby",
      "Michael W. Mahoney"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)"
    ]
  }
]