[
  {
    "id": "arXiv:2308.05750",
    "title": "Turning hazardous volatile matter compounds into fuel by catalytic steam  reforming: An evolutionary machine learning approach",
    "abstract": "Chemical and biomass processing systems release volatile matter compounds into the environment daily. Catalytic reforming can convert these compounds into valuable fuels, but developing stable and efficient catalysts is challenging. Machine learning can handle complex relationships in big data and optimize reaction conditions, making it an effective solution for addressing the mentioned issues. This study is the first to develop a machine-learning-based research framework for modeling, understanding, and optimizing the catalytic steam reforming of volatile matter compounds. Toluene catalytic steam reforming is used as a case study to show how chemical/textural analyses (e.g., X-ray diffraction analysis) can be used to obtain input features for machine learning models. Literature is used to compile a database covering a variety of catalyst characteristics and reaction conditions. The process is thoroughly analyzed, mechanistically discussed, modeled by six machine learning models, and optimized using the particle swarm optimization algorithm. Ensemble machine learning provides the best prediction performance (R2 > 0.976) for toluene conversion and product distribution. The optimal tar conversion (higher than 77.2%) is obtained at temperatures between 637.44 and 725.62 {\\deg}C, with a steam-to-carbon molar ratio of 5.81-7.15 and a catalyst BET surface area 476.03-638.55 m2/g. The feature importance analysis satisfactorily reveals the effects of input descriptors on model prediction. Operating conditions (50.9%) and catalyst properties (49.1%) are equally important in modeling. The developed framework can expedite the search for optimal catalyst characteristics and reaction conditions, not only for catalytic chemical processing but also for related research areas. ",
    "url": "https://arxiv.org/abs/2308.05750",
    "authors": [
      "Alireza Shafizadeh",
      "Hossein Shahbeik",
      "Mohammad Hossein Nadian",
      "Vijai Kumar Gupta",
      "Abdul-Sattar Nizami",
      "Su Shiung Lam",
      "Wanxi Peng",
      "Junting Pan",
      "Meisam Tabatabaei",
      "Mortaza Aghbashlo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.05765",
    "title": "Unleashing the Power of Extra-Tree Feature Selection and Random Forest  Classifier for Improved Survival Prediction in Heart Failure Patients",
    "abstract": "Heart failure is a life-threatening condition that affects millions of people worldwide. The ability to accurately predict patient survival can aid in early intervention and improve patient outcomes. In this study, we explore the potential of utilizing data pre-processing techniques and the Extra-Tree (ET) feature selection method in conjunction with the Random Forest (RF) classifier to improve survival prediction in heart failure patients. By leveraging the strengths of ET feature selection, we aim to identify the most significant predictors associated with heart failure survival. Using the public UCL Heart failure (HF) survival dataset, we employ the ET feature selection algorithm to identify the most informative features. These features are then used as input for grid search of RF. Finally, the tuned RF Model was trained and evaluated using different matrices. The approach was achieved 98.33% accuracy that is the highest over the exiting work. ",
    "url": "https://arxiv.org/abs/2308.05765",
    "authors": [
      "Md. Simul Hasan Talukder",
      "Rejwan Bin Sulaiman",
      "Mouli Bardhan Paul Angon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.05770",
    "title": "Fine-Grained Self-Supervised Learning with Jigsaw Puzzles for Medical  Image Classification",
    "abstract": "Classifying fine-grained lesions is challenging due to minor and subtle differences in medical images. This is because learning features of fine-grained lesions with highly minor differences is very difficult in training deep neural networks. Therefore, in this paper, we introduce Fine-Grained Self-Supervised Learning(FG-SSL) method for classifying subtle lesions in medical images. The proposed method progressively learns the model through hierarchical block such that the cross-correlation between the fine-grained Jigsaw puzzle and regularized original images is close to the identity matrix. We also apply hierarchical block for progressive fine-grained learning, which extracts different information in each step, to supervised learning for discovering subtle differences. Our method does not require an asymmetric model, nor does a negative sampling strategy, and is not sensitive to batch size. We evaluate the proposed fine-grained self-supervised learning method on comprehensive experiments using various medical image recognition datasets. In our experiments, the proposed method performs favorably compared to existing state-of-the-art approaches on the widely-used ISIC2018, APTOS2019, and ISIC2017 datasets. ",
    "url": "https://arxiv.org/abs/2308.05770",
    "authors": [
      "Wongi Park",
      "Jongbin Ryu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.05822",
    "title": "Encode-Store-Retrieve: Enhancing Memory Augmentation through  Language-Encoded Egocentric Perception",
    "abstract": "We depend on our own memory to encode, store, and retrieve our experiences. However, memory lapses can occur. One promising avenue for achieving memory augmentation is through the use of augmented reality head-mounted displays to capture and preserve egocentric videos, a practice commonly referred to as life logging. However, a significant challenge arises from the sheer volume of video data generated through life logging, as the current technology lacks the capability to encode and store such large amounts of data efficiently. Further, retrieving specific information from extensive video archives requires substantial computational power, further complicating the task of quickly accessing desired content. To address these challenges, we propose a memory augmentation system that involves leveraging natural language encoding for video data and storing them in a vector database. This approach harnesses the power of large vision language models to perform the language encoding process. Additionally, we propose using large language models to facilitate natural language querying. Our system underwent extensive evaluation using the QA-Ego4D dataset and achieved state-of-the-art results with a BLEU score of 8.3, outperforming conventional machine learning models that scored between 3.4 and 5.8. Additionally, in a user study, our system received a higher mean response score of 4.13/5 compared to the human participants' score of 2.46/5 on real-life episodic memory tasks. ",
    "url": "https://arxiv.org/abs/2308.05822",
    "authors": [
      "Junxiao Shen",
      "John Dudley",
      "Per Ola Kristensson"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.05832",
    "title": "FLShield: A Validation Based Federated Learning Framework to Defend  Against Poisoning Attacks",
    "abstract": "Federated learning (FL) is revolutionizing how we learn from data. With its growing popularity, it is now being used in many safety-critical domains such as autonomous vehicles and healthcare. Since thousands of participants can contribute in this collaborative setting, it is, however, challenging to ensure security and reliability of such systems. This highlights the need to design FL systems that are secure and robust against malicious participants' actions while also ensuring high utility, privacy of local data, and efficiency. In this paper, we propose a novel FL framework dubbed as FLShield that utilizes benign data from FL participants to validate the local models before taking them into account for generating the global model. This is in stark contrast with existing defenses relying on server's access to clean datasets -- an assumption often impractical in real-life scenarios and conflicting with the fundamentals of FL. We conduct extensive experiments to evaluate our FLShield framework in different settings and demonstrate its effectiveness in thwarting various types of poisoning and backdoor attacks including a defense-aware one. FLShield also preserves privacy of local data against gradient inversion attacks. ",
    "url": "https://arxiv.org/abs/2308.05832",
    "authors": [
      "Ehsanul Kabir",
      "Zeyu Song",
      "Md Rafi Ur Rashid",
      "Shagufta Mehnaz"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.05842",
    "title": "Performance Analysis for Hybrid mmWave and THz Networks with Downlink  and Uplink Decoupled Cell Association",
    "abstract": "It is expected that B5G/6G networks will exploit both terahertz (THz) and millimetre wave (mmWave) frequency bands and will increase flexibility in user equipment (UE)-cell association. In this paper, we introduce a novel stochastic geometry-based framework for the analysis of the signal-to-interference-plus-noise-ratio (SINR) and rate coverage in a multi-tier hybrid mmWave and THz network, where each tier has a particular base station (BS) density, transmit power, bandwidth, number of BS antennas, and cell-association bias factor. The proposed framework incorporates the effects of mmWave and THz channel characteristics, BS beamforming gain, and blockages. We investigate the downlink (DL) and uplink (UL) decoupled cell-association strategy and characterise the per-tier cell-association probability. Based on that, we analytically derive the SINR and rate coverage probabilities of a typical user for both DL and UL transmissions. The analytical results are validated via extensive Monte Carlo simulations. Numerical results demonstrate the superiority of the DL and UL decoupled cell-association strategy in terms of SINR and rate coverage over its coupled counterpart. Moreover, we observe that the superiority of using the DL and UL decoupled cell-association strategy becomes more evident with the dense deployment of THz networks. ",
    "url": "https://arxiv.org/abs/2308.05842",
    "authors": [
      "Yunbai Wang",
      "Chen Chen",
      "Xiaoli Chu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.05846",
    "title": "Seed Kernel Counting using Domain Randomization and Object Tracking  Neural Networks",
    "abstract": "High-throughput phenotyping (HTP) of seeds, also known as seed phenotyping, is the comprehensive assessment of complex seed traits such as growth, development, tolerance, resistance, ecology, yield, and the measurement of parameters that form more complex traits. One of the key aspects of seed phenotyping is cereal yield estimation that the seed production industry relies upon to conduct their business. While mechanized seed kernel counters are available in the market currently, they are often priced high and sometimes outside the range of small scale seed production firms' affordability. The development of object tracking neural network models such as You Only Look Once (YOLO) enables computer scientists to design algorithms that can estimate cereal yield inexpensively. The key bottleneck with neural network models is that they require a plethora of labelled training data before they can be put to task. We demonstrate that the use of synthetic imagery serves as a feasible substitute to train neural networks for object tracking that includes the tasks of object classification and detection. Furthermore, we propose a seed kernel counter that uses a low-cost mechanical hopper, trained YOLOv8 neural network model, and object tracking algorithms on StrongSORT and ByteTrack to estimate cereal yield from videos. The experiment yields a seed kernel count with an accuracy of 95.2\\% and 93.2\\% for Soy and Wheat respectively using the StrongSORT algorithm, and an accuray of 96.8\\% and 92.4\\% for Soy and Wheat respectively using the ByteTrack algorithm. ",
    "url": "https://arxiv.org/abs/2308.05846",
    "authors": [
      "Venkat Margapuri",
      "Prapti Thapaliya",
      "Mitchell Neilsen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.05857",
    "title": "Knowledge Propagation over Conditional Independence Graphs",
    "abstract": "Conditional Independence (CI) graph is a special type of a Probabilistic Graphical Model (PGM) where the feature connections are modeled using an undirected graph and the edge weights show the partial correlation strength between the features. Since the CI graphs capture direct dependence between features, they have been garnering increasing interest within the research community for gaining insights into the systems from various domains, in particular discovering the domain topology. In this work, we propose algorithms for performing knowledge propagation over the CI graphs. Our experiments demonstrate that our techniques improve upon the state-of-the-art on the publicly available Cora and PubMed datasets. ",
    "url": "https://arxiv.org/abs/2308.05857",
    "authors": [
      "Urszula Chajewska",
      "Harsh Shrivastava"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.05869",
    "title": "Shared Memory-contention-aware Concurrent DNN Execution for Diversely  Heterogeneous System-on-Chips",
    "abstract": "Two distinguishing features of state-of-the-art mobile and autonomous systems are 1) there are often multiple workloads, mainly deep neural network (DNN) inference, running concurrently and continuously; and 2) they operate on shared memory system-on-chips (SoC) that embed heterogeneous accelerators tailored for specific operations. State-of-the-art lacks efficient performance and resource management techniques necessary to either maximize total system throughput or minimize end-to-end workload latency. In this work, we propose HaX-CoNN, a novel scheme that characterizes and maps layers in concurrently executing DNN inference workloads to a diverse set of accelerators within a SoC. Our scheme uniquely takes per-layer execution characteristics, shared memory (SM) contention, and inter-accelerator transitions into account to find optimal schedules. We evaluate HaX-CoNN on NVIDIA Orin, NVIDIA Xavier, and Qualcomm Snapdragon 865 SoCs. Our experimental results indicate that HaX-CoNN minimizes memory contention by up to 45% and can improve latency and total throughput by up to 32% and 29%, respectively, compared to the state-of-the-art approaches. ",
    "url": "https://arxiv.org/abs/2308.05869",
    "authors": [
      "Ismet Dagli",
      "Mehmet Belviranli"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Artificial Intelligence (cs.AI)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2308.05881",
    "title": "Aphid Cluster Recognition and Detection in the Wild Using Deep Learning  Models",
    "abstract": "Aphid infestation poses a significant threat to crop production, rural communities, and global food security. While chemical pest control is crucial for maximizing yields, applying chemicals across entire fields is both environmentally unsustainable and costly. Hence, precise localization and management of aphids are essential for targeted pesticide application. The paper primarily focuses on using deep learning models for detecting aphid clusters. We propose a novel approach for estimating infection levels by detecting aphid clusters. To facilitate this research, we have captured a large-scale dataset from sorghum fields, manually selected 5,447 images containing aphids, and annotated each individual aphid cluster within these images. To facilitate the use of machine learning models, we further process the images by cropping them into patches, resulting in a labeled dataset comprising 151,380 image patches. Then, we implemented and compared the performance of four state-of-the-art object detection models (VFNet, GFLV2, PAA, and ATSS) on the aphid dataset. Extensive experimental results show that all models yield stable similar performance in terms of average precision and recall. We then propose to merge close neighboring clusters and remove tiny clusters caused by cropping, and the performance is further boosted by around 17%. The study demonstrates the feasibility of automatically detecting and managing insects using machine learning models. The labeled dataset will be made openly available to the research community. ",
    "url": "https://arxiv.org/abs/2308.05881",
    "authors": [
      "Tianxiao Zhang",
      "Kaidong Li",
      "Xiangyu Chen",
      "Cuncong Zhong",
      "Bo Luo",
      "Ivan Grijalva",
      "Brian McCornack",
      "Daniel Flippo",
      "Ajay Sharda",
      "Guanghui Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.05890",
    "title": "PrivacyLens: A Framework to Collect and Analyze the Landscape of Past,  Present, and Future Smart Device Privacy Policies",
    "abstract": "As the adoption of smart devices continues to permeate all aspects of our lives, concerns surrounding user privacy have become more pertinent than ever before. While privacy policies define the data management practices of their manufacturers, previous work has shown that they are rarely read and understood by users. Hence, automatic analysis of privacy policies has been shown to help provide users with appropriate insights. Previous research has extensively analyzed privacy policies of websites, e-commerce, and mobile applications, but privacy policies of smart devices, present some differences and specific challenges such as the difficulty to find and collect them. We present PrivacyLens, a novel framework for discovering and collecting past, present, and future smart device privacy policies and harnessing NLP and ML algorithms to analyze them. PrivacyLens is currently deployed, collecting, analyzing, and publishing insights about privacy policies to assist different stakeholders of smart devices, such as users, policy authors, and regulators. We show several examples of analytical tasks enabled by PrivacyLens, including comparisons of devices per type and manufacturing country, categorization of privacy policies, and impact of data regulations on data practices. At the time of submitting this paper, PrivacyLens had collected and analyzed more than 1,200 privacy policies for 7,300 smart device ",
    "url": "https://arxiv.org/abs/2308.05890",
    "authors": [
      "Aamir Hamid",
      "Hemanth Reddy Samidi",
      "Tim Finin",
      "Primal Pappachan",
      "Roberto Yus"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2308.05898",
    "title": "Unveiling the Tricks: Automated Detection of Dark Patterns in Mobile  Applications",
    "abstract": "Mobile apps bring us many conveniences, such as online shopping and communication, but some use malicious designs called dark patterns to trick users into doing things that are not in their best interest. Many works have been done to summarize the taxonomy of these patterns and some have tried to mitigate the problems through various techniques. However, these techniques are either time-consuming, not generalisable or limited to specific patterns. To address these issues, we propose UIGuard, a knowledge-driven system that utilizes computer vision and natural language pattern matching to automatically detect a wide range of dark patterns in mobile UIs. Our system relieves the need for manually creating rules for each new UI/app and covers more types with superior performance. In detail, we integrated existing taxonomies into a consistent one, conducted a characteristic analysis and distilled knowledge from real-world examples and the taxonomy. Our UIGuard consists of two components, Property Extraction and Knowledge-Driven Dark Pattern Checker. We collected the first dark pattern dataset, which contains 4,999 benign UIs and 1,353 malicious UIs of 1,660 instances spanning 1,023 mobile apps. Our system achieves a superior performance in detecting dark patterns (micro averages: 0.82 in precision, 0.77 in recall, 0.79 in F1 score). A user study involving 58 participants further shows that \\tool{} significantly increases users' knowledge of dark patterns. ",
    "url": "https://arxiv.org/abs/2308.05898",
    "authors": [
      "Jieshan Chen",
      "Jiamou Sun",
      "Sidong Feng",
      "Zhenchang Xing",
      "Qinghua Lu",
      "Xiwei Xu",
      "Chunyang Chen"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.05903",
    "title": "Comparing the quality of neural network uncertainty estimates for  classification problems",
    "abstract": "Traditional deep learning (DL) models are powerful classifiers, but many approaches do not provide uncertainties for their estimates. Uncertainty quantification (UQ) methods for DL models have received increased attention in the literature due to their usefulness in decision making, particularly for high-consequence decisions. However, there has been little research done on how to evaluate the quality of such methods. We use statistical methods of frequentist interval coverage and interval width to evaluate the quality of credible intervals, and expected calibration error to evaluate classification predicted confidence. These metrics are evaluated on Bayesian neural networks (BNN) fit using Markov Chain Monte Carlo (MCMC) and variational inference (VI), bootstrapped neural networks (NN), Deep Ensembles (DE), and Monte Carlo (MC) dropout. We apply these different UQ for DL methods to a hyperspectral image target detection problem and show the inconsistency of the different methods' results and the necessity of a UQ quality metric. To reconcile these differences and choose a UQ method that appropriately quantifies the uncertainty, we create a simulated data set with fully parameterized probability distribution for a two-class classification problem. The gold standard MCMC performs the best overall, and the bootstrapped NN is a close second, requiring the same computational expense as DE. Through this comparison, we demonstrate that, for a given data set, different models can produce uncertainty estimates of markedly different quality. This in turn points to a great need for principled assessment methods of UQ quality in DL applications. ",
    "url": "https://arxiv.org/abs/2308.05903",
    "authors": [
      "Daniel Ries",
      "Joshua Michalenko",
      "Tyler Ganter",
      "Rashad Imad-Fayez Baiyasi",
      "Jason Adams"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.05921",
    "title": "BATINet: Background-Aware Text to Image Synthesis and Manipulation  Network",
    "abstract": "Background-Induced Text2Image (BIT2I) aims to generate foreground content according to the text on the given background image. Most studies focus on generating high-quality foreground content, although they ignore the relationship between the two contents. In this study, we analyzed a novel Background-Aware Text2Image (BAT2I) task in which the generated content matches the input background. We proposed a Background-Aware Text to Image synthesis and manipulation Network (BATINet), which contains two key components: Position Detect Network (PDN) and Harmonize Network (HN). The PDN detects the most plausible position of the text-relevant object in the background image. The HN harmonizes the generated content referring to background style information. Finally, we reconstructed the generation network, which consists of the multi-GAN and attention module to match more user preferences. Moreover, we can apply BATINet to text-guided image manipulation. It solves the most challenging task of manipulating the shape of an object. We demonstrated through qualitative and quantitative evaluations on the CUB dataset that the proposed model outperforms other state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2308.05921",
    "authors": [
      "Ryugo Morita",
      "Zhiqiang Zhang",
      "Jinjia Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.05930",
    "title": "INR-Arch: A Dataflow Architecture and Compiler for Arbitrary-Order  Gradient Computations in Implicit Neural Representation Processing",
    "abstract": "An increasing number of researchers are finding use for nth-order gradient computations for a wide variety of applications, including graphics, meta-learning (MAML), scientific computing, and most recently, implicit neural representations (INRs). Recent work shows that the gradient of an INR can be used to edit the data it represents directly without needing to convert it back to a discrete representation. However, given a function represented as a computation graph, traditional architectures face challenges in efficiently computing its nth-order gradient due to the higher demand for computing power and higher complexity in data movement. This makes it a promising target for FPGA acceleration. In this work, we introduce INR-Arch, a framework that transforms the computation graph of an nth-order gradient into a hardware-optimized dataflow architecture. We address this problem in two phases. First, we design a dataflow architecture that uses FIFO streams and an optimized computation kernel library, ensuring high memory efficiency and parallel computation. Second, we propose a compiler that extracts and optimizes computation graphs, automatically configures hardware parameters such as latency and stream depths to optimize throughput, while ensuring deadlock-free operation, and outputs High-Level Synthesis (HLS) code for FPGA implementation. We utilize INR editing as our benchmark, presenting results that demonstrate 1.8-4.8x and 1.5-3.6x speedup compared to CPU and GPU baselines respectively. Furthermore, we obtain 3.1-8.9x and 1.7-4.3x lower memory usage, and 1.7-11.3x and 5.5-32.8x lower energy-delay product. Our framework will be made open-source and available on GitHub. ",
    "url": "https://arxiv.org/abs/2308.05930",
    "authors": [
      "Stefan Abi-Karam",
      "Rishov Sarkar",
      "Dejia Xu",
      "Zhiwen Fan",
      "Zhangyang Wang",
      "Cong Hao"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.05935",
    "title": "LittleMu: Deploying an Online Virtual Teaching Assistant via  Heterogeneous Sources Integration and Chain of Teach Prompts",
    "abstract": "Teaching assistants have played essential roles in the long history of education. However, few MOOC platforms are providing human or virtual teaching assistants to support learning for massive online students due to the complexity of real-world online education scenarios and the lack of training data. In this paper, we present a virtual MOOC teaching assistant, LittleMu with minimum labeled training data, to provide question answering and chit-chat services. Consisting of two interactive modules of heterogeneous retrieval and language model prompting, LittleMu first integrates structural, semi- and unstructured knowledge sources to support accurate answers for a wide range of questions. Then, we design delicate demonstrations named \"Chain of Teach\" prompts to exploit the large-scale pre-trained model to handle complex uncollected questions. Except for question answering, we develop other educational services such as knowledge-grounded chit-chat. We test the system's performance via both offline evaluation and online deployment. Since May 2020, our LittleMu system has served over 80,000 users with over 300,000 queries from over 500 courses on XuetangX MOOC platform, which continuously contributes to a more convenient and fair education. Our code, services, and dataset will be available at https://github.com/THU-KEG/VTA. ",
    "url": "https://arxiv.org/abs/2308.05935",
    "authors": [
      "Shangqing Tu",
      "Zheyuan Zhang",
      "Jifan Yu",
      "Chunyang Li",
      "Siyu Zhang",
      "Zijun Yao",
      "Lei Hou",
      "Juanzi Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2308.05939",
    "title": "VERF: Runtime Monitoring of Pose Estimation with Neural Radiance Fields",
    "abstract": "We present VERF, a collection of two methods (VERF-PnP and VERF-Light) for providing runtime assurance on the correctness of a camera pose estimate of a monocular camera without relying on direct depth measurements. We leverage the ability of NeRF (Neural Radiance Fields) to render novel RGB perspectives of a scene. We only require as input the camera image whose pose is being estimated, an estimate of the camera pose we want to monitor, and a NeRF model containing the scene pictured by the camera. We can then predict if the pose estimate is within a desired distance from the ground truth and justify our prediction with a level of confidence. VERF-Light does this by rendering a viewpoint with NeRF at the estimated pose and estimating its relative offset to the sensor image up to scale. Since scene scale is unknown, the approach renders another auxiliary image and reasons over the consistency of the optical flows across the three images. VERF-PnP takes a different approach by rendering a stereo pair of images with NeRF and utilizing the Perspective-n-Point (PnP) algorithm. We evaluate both methods on the LLFF dataset, on data from a Unitree A1 quadruped robot, and on data collected from Blue Origin's sub-orbital New Shepard rocket to demonstrate the effectiveness of the proposed pose monitoring method across a range of scene scales. We also show monitoring can be completed in under half a second on a 3090 GPU. ",
    "url": "https://arxiv.org/abs/2308.05939",
    "authors": [
      "Dominic Maggio",
      "Courtney Mario",
      "Luca Carlone"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.05941",
    "title": "A Robust Planning Model for Offshore Microgrid Considering Tidal Power  and Desalination",
    "abstract": "Increasing attention has been paid to resources on islands, thus microgrids on islands need to be invested. Different from onshore microgrids, offshore microgrids (OM) are usually abundant in ocean renewable energy (ORE), such as offshore wind, tidal power generation (TPG), etc. Moreover, some special loads such as seawater desalination unit (SDU) should be included. In this sense, this paper proposes a planning method for OM to minimize the investment cost while the ORE's fluctuation could be accommodated with robustness. First, a deterministic planning model (DPM) is formulated for the OM with TPG and SDU. A robust planning model (RPM) is then developed considering the uncertainties from both TPG and load demand. The Column-and-constraint generation (C&CG) algorithm is then employed to solve the RPM, producing planning results for the OM that is robust against the worst scenario. Results of the case studies show that the investment and operation decisions of the proposed model are robust, and TPG shows good complementarity with the other RESs. ",
    "url": "https://arxiv.org/abs/2308.05941",
    "authors": [
      "Zhimeng Wang",
      "Ang Xuan",
      "Xinwei Shen",
      "Yunfei Du",
      "Hongbin Sun"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.05943",
    "title": "On Some Closure Properties of nc-eNCE Graph Grammars",
    "abstract": "In the study of automata and grammars, closure properties of the associated languages have been studied extensively. In particular, closure properties of various types of graph grammars have been examined in (Rozenberg and Welzl, Inf. and Control,1986) and (Rozenberg and Welzl, Acta Informatica,1986). In this paper we examine some critical closure properties of the nc-eNCE graph grammars discussed in (Jayakrishna and Mathew, Symmetry 2023) and (Jayakrishna and Mathew, ICMICDS 2022). ",
    "url": "https://arxiv.org/abs/2308.05943",
    "authors": [
      "Jayakrishna Vijayakumar",
      "Lisa Mathew"
    ],
    "subjectives": [
      "Formal Languages and Automata Theory (cs.FL)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2308.05945",
    "title": "Improving Ego-Cluster for Network Effect Measurement",
    "abstract": "Network effect is common in social network platforms. Many new features in social networks are designed to specifically create network effect to improve user engagement. For example, content creators tend to produce more when their articles and posts receive more positive feedback from followers. This paper discusses a new cluster-level experimentation methodology to measure the creator-side metrics in the context of A/B experiment. The methodology is designed to address the cases when the experiment randomization unit and the metric measurement unit are not the same, and it is a part of the overall strategy at LinkedIn to promote a robust creator community and ecosystem. The method is developed based on the widely-cited research at LinkedIn, but significantly improves the clustering algorithm efficiency and flexibility, leading to a stronger capability of the creator-side metrics measurement and increasing velocity for creator-related experiments. ",
    "url": "https://arxiv.org/abs/2308.05945",
    "authors": [
      "Wentao Su",
      "Weitao Duan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2308.05948",
    "title": "Uncertainty-Aware Cross-Modal Transfer Network for Sketch-Based 3D Shape  Retrieval",
    "abstract": "In recent years, sketch-based 3D shape retrieval has attracted growing attention. While many previous studies have focused on cross-modal matching between hand-drawn sketches and 3D shapes, the critical issue of how to handle low-quality and noisy samples in sketch data has been largely neglected. This paper presents an uncertainty-aware cross-modal transfer network (UACTN) that addresses this issue. UACTN decouples the representation learning of sketches and 3D shapes into two separate tasks: classification-based sketch uncertainty learning and 3D shape feature transfer. We first introduce an end-to-end classification-based approach that simultaneously learns sketch features and uncertainty, allowing uncertainty to prevent overfitting noisy sketches by assigning different levels of importance to clean and noisy sketches. Then, 3D shape features are mapped into the pre-learned sketch embedding space for feature alignment. Extensive experiments and ablation studies on two benchmarks demonstrate the superiority of our proposed method compared to state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2308.05948",
    "authors": [
      "Yiyang Cai",
      "Jiaming Lu",
      "Jiewen Wang",
      "Shuang Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.05957",
    "title": "Node Embedding for Homophilous Graphs with ARGEW: Augmentation of Random  walks by Graph Edge Weights",
    "abstract": "Representing nodes in a network as dense vectors node embeddings is important for understanding a given network and solving many downstream tasks. In particular, for weighted homophilous graphs where similar nodes are connected with larger edge weights, we desire node embeddings where node pairs with strong weights have closer embeddings. Although random walk based node embedding methods like node2vec and node2vec+ do work for weighted networks via including edge weights in the walk transition probabilities, our experiments show that the embedding result does not adequately reflect edge weights. In this paper, we propose ARGEW (Augmentation of Random walks by Graph Edge Weights), a novel augmentation method for random walks that expands the corpus in such a way that nodes with larger edge weights end up with closer embeddings. ARGEW can work with any random walk based node embedding method, because it is independent of the random sampling strategy itself and works on top of the already-performed walks. With several real-world networks, we demonstrate that with ARGEW, compared to not using it, the desired pattern that node pairs with larger edge weights have closer embeddings is much clearer. We also examine ARGEW's performance in node classification: node2vec with ARGEW outperforms pure node2vec and is not sensitive to hyperparameters (i.e. consistently good). In fact, it achieves similarly good results as supervised GCN, even without any node feature or label information during training. Finally, we explain why ARGEW works consistently well by exploring the coappearance distributions using a synthetic graph with clear structural roles. ",
    "url": "https://arxiv.org/abs/2308.05957",
    "authors": [
      "Jun Hee Kim",
      "Jaeman Son",
      "Hyunsoo Kim",
      "Eunjo Lee"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.05961",
    "title": "Compositional Learning in Transformer-Based Human-Object Interaction  Detection",
    "abstract": "Human-object interaction (HOI) detection is an important part of understanding human activities and visual scenes. The long-tailed distribution of labeled instances is a primary challenge in HOI detection, promoting research in few-shot and zero-shot learning. Inspired by the combinatorial nature of HOI triplets, some existing approaches adopt the idea of compositional learning, in which object and action features are learned individually and re-composed as new training samples. However, these methods follow the CNN-based two-stage paradigm with limited feature extraction ability, and often rely on auxiliary information for better performance. Without introducing any additional information, we creatively propose a transformer-based framework for compositional HOI learning. Human-object pair representations and interaction representations are re-composed across different HOI instances, which involves richer contextual information and promotes the generalization of knowledge. Experiments show our simple but effective method achieves state-of-the-art performance, especially on rare HOI classes. ",
    "url": "https://arxiv.org/abs/2308.05961",
    "authors": [
      "Zikun Zhuang",
      "Ruihao Qian",
      "Chi Xie",
      "Shuang Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.05967",
    "title": "YOLOrtho -- A Unified Framework for Teeth Enumeration and Dental Disease  Detection",
    "abstract": "Detecting dental diseases through panoramic X-rays images is a standard procedure for dentists. Normally, a dentist need to identify diseases and find the infected teeth. While numerous machine learning models adopting this two-step procedure have been developed, there has not been an end-to-end model that can identify teeth and their associated diseases at the same time. To fill the gap, we develop YOLOrtho, a unified framework for teeth enumeration and dental disease detection. We develop our model on Dentex Challenge 2023 data, which consists of three distinct types of annotated data. The first part is labeled with quadrant, and the second part is labeled with quadrant and enumeration and the third part is labeled with quadrant, enumeration and disease. To further improve detection, we make use of Tufts Dental public dataset. To fully utilize the data and learn both teeth detection and disease identification simultaneously, we formulate diseases as attributes attached to their corresponding teeth. Due to the nature of position relation in teeth enumeration, We replace convolution layer with CoordConv in our model to provide more position information for the model. We also adjust the model architecture and insert one more upsampling layer in FPN in favor of large object detection. Finally, we propose a post-process strategy for teeth layout that corrects teeth enumeration based on linear sum assignment. Results from experiments show that our model exceeds large Diffusion-based model. ",
    "url": "https://arxiv.org/abs/2308.05967",
    "authors": [
      "Shenxiao Mei",
      "Chenglong Ma",
      "Feihong Shen",
      "Huikai Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.05983",
    "title": "Face Encryption via Frequency-Restricted Identity-Agnostic Attacks",
    "abstract": "Billions of people are sharing their daily live images on social media everyday. However, malicious collectors use deep face recognition systems to easily steal their biometric information (e.g., faces) from these images. Some studies are being conducted to generate encrypted face photos using adversarial attacks by introducing imperceptible perturbations to reduce face information leakage. However, existing studies need stronger black-box scenario feasibility and more natural visual appearances, which challenge the feasibility of privacy protection. To address these problems, we propose a frequency-restricted identity-agnostic (FRIA) framework to encrypt face images from unauthorized face recognition without access to personal information. As for the weak black-box scenario feasibility, we obverse that representations of the average feature in multiple face recognition models are similar, thus we propose to utilize the average feature via the crawled dataset from the Internet as the target to guide the generation, which is also agnostic to identities of unknown face recognition systems; in nature, the low-frequency perturbations are more visually perceptible by the human vision system. Inspired by this, we restrict the perturbation in the low-frequency facial regions by discrete cosine transform to achieve the visual naturalness guarantee. Extensive experiments on several face recognition models demonstrate that our FRIA outperforms other state-of-the-art methods in generating more natural encrypted faces while attaining high black-box attack success rates of 96%. In addition, we validate the efficacy of FRIA using real-world black-box commercial API, which reveals the potential of FRIA in practice. Our codes can be found in https://github.com/XinDong10/FRIA. ",
    "url": "https://arxiv.org/abs/2308.05983",
    "authors": [
      "Xin Dong",
      "Rui Wang",
      "Siyuan Liang",
      "Aishan Liu",
      "Lihua Jing"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.05985",
    "title": "TrajPAC: Towards Robustness Verification of Pedestrian Trajectory  Prediction Models",
    "abstract": "Robust pedestrian trajectory forecasting is crucial to developing safe autonomous vehicles. Although previous works have studied adversarial robustness in the context of trajectory forecasting, some significant issues remain unaddressed. In this work, we try to tackle these crucial problems. Firstly, the previous definitions of robustness in trajectory prediction are ambiguous. We thus provide formal definitions for two kinds of robustness, namely label robustness and pure robustness. Secondly, as previous works fail to consider robustness about all points in a disturbance interval, we utilise a probably approximately correct (PAC) framework for robustness verification. Additionally, this framework can not only identify potential counterexamples, but also provides interpretable analyses of the original methods. Our approach is applied using a prototype tool named TrajPAC. With TrajPAC, we evaluate the robustness of four state-of-the-art trajectory prediction models -- Trajectron++, MemoNet, AgentFormer, and MID -- on trajectories from five scenes of the ETH/UCY dataset and scenes of the Stanford Drone Dataset. Using our framework, we also experimentally study various factors that could influence robustness performance. ",
    "url": "https://arxiv.org/abs/2308.05985",
    "authors": [
      "Liang Zhang",
      "Nathaniel Xu",
      "Pengfei Yang",
      "Gaojie Jin",
      "Cheng-Chao Huang",
      "Lijun Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.05987",
    "title": "Advancing the study of Large-Scale Learning in Overlapped Speech  Detection",
    "abstract": "Overlapped Speech Detection (OSD) is an important part of speech applications involving analysis of multi-party conversations. However, Most of the existing OSD models are trained and evaluated on specific dataset, which limits the application scenarios of these models. In order to solve this problem, we conduct a study of large-scale learning (LSL) in OSD and propose a more general 16K single-channel OSD model. In our study, 522 hours of labeled audio in different languages and styles are collected and used as the large-scale dataset. Rigorous comparative experiments are designed and used to evaluate the effectiveness of LSL in OSD task and the performance of OSD models based on different deep neural networks. The results show that LSL can significantly improve the performance and robustness of OSD models, and the OSD model based on Conformer (CF-OSD) with LSL is currently the best 16K single-channel OSD model. Moreover, the CF-OSD with LSL establishes a state-of-the-art performance with a F1-score of 80.8% and 52.0% on the Alimeeting test set and DIHARD II evaluation set, respectively. ",
    "url": "https://arxiv.org/abs/2308.05987",
    "authors": [
      "Zhaohui Yin",
      "Jingguang Tian",
      "Xinhui Hu",
      "Xinkang Xu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.05988",
    "title": "MS3D++: Ensemble of Experts for Multi-Source Unsupervised Domain  Adaption in 3D Object Detection",
    "abstract": "Deploying 3D detectors in unfamiliar domains has been demonstrated to result in a drastic drop of up to 70-90% in detection rate due to variations in lidar, geographical region, or weather conditions from their original training dataset. This domain gap leads to missing detections for densely observed objects, misaligned confidence scores, and increased high-confidence false positives, rendering the detector highly unreliable. To address this, we introduce MS3D++, a self-training framework for multi-source unsupervised domain adaptation in 3D object detection. MS3D++ provides a straightforward approach to domain adaptation by generating high-quality pseudo-labels, enabling the adaptation of 3D detectors to a diverse range of lidar types, regardless of their density. Our approach effectively fuses predictions of an ensemble of multi-frame pre-trained detectors from different source domains to improve domain generalization. We subsequently refine the predictions temporally to ensure temporal consistency in box localization and object classification. Furthermore, we present an in-depth study into the performance and idiosyncrasies of various 3D detector components in a cross-domain context, providing valuable insights for improved cross-domain detector ensembling. Experimental results on Waymo, nuScenes and Lyft demonstrate that detectors trained with MS3D++ pseudo-labels achieve state-of-the-art performance, comparable to training with human-annotated labels in Bird's Eye View (BEV) evaluation for both low and high density lidar. ",
    "url": "https://arxiv.org/abs/2308.05988",
    "authors": [
      "Darren Tsai",
      "Julie Stephany Berrio",
      "Mao Shan",
      "Eduardo Nebot",
      "Stewart Worrall"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.05991",
    "title": "Cyclic-Bootstrap Labeling for Weakly Supervised Object Detection",
    "abstract": "Recent progress in weakly supervised object detection is featured by a combination of multiple instance detection networks (MIDN) and ordinal online refinement. However, with only image-level annotation, MIDN inevitably assigns high scores to some unexpected region proposals when generating pseudo labels. These inaccurate high-scoring region proposals will mislead the training of subsequent refinement modules and thus hamper the detection performance. In this work, we explore how to ameliorate the quality of pseudo-labeling in MIDN. Formally, we devise Cyclic-Bootstrap Labeling (CBL), a novel weakly supervised object detection pipeline, which optimizes MIDN with rank information from a reliable teacher network. Specifically, we obtain this teacher network by introducing a weighted exponential moving average strategy to take advantage of various refinement modules. A novel class-specific ranking distillation algorithm is proposed to leverage the output of weighted ensembled teacher network for distilling MIDN with rank information. As a result, MIDN is guided to assign higher scores to accurate proposals among their neighboring ones, thus benefiting the subsequent pseudo labeling. Extensive experiments on the prevalent PASCAL VOC 2007 \\& 2012 and COCO datasets demonstrate the superior performance of our CBL framework. Code will be available at https://github.com/Yinyf0804/WSOD-CBL/. ",
    "url": "https://arxiv.org/abs/2308.05991",
    "authors": [
      "Yufei Yin",
      "Jiajun Deng",
      "Wengang Zhou",
      "Li Li",
      "Houqiang Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.05996",
    "title": "Deep Task-specific Bottom Representation Network for Multi-Task  Recommendation",
    "abstract": "Neural-based multi-task learning (MTL) has gained significant improvement, and it has been successfully applied to recommendation system (RS). Recent deep MTL methods for RS (e.g. MMoE, PLE) focus on designing soft gating-based parameter-sharing networks that implicitly learn a generalized representation for each task. However, MTL methods may suffer from performance degeneration when dealing with conflicting tasks, as negative transfer effects can occur on the task-shared bottom representation. This can result in a reduced capacity for MTL methods to capture task-specific characteristics, ultimately impeding their effectiveness and hindering the ability to generalize well on all tasks. In this paper, we focus on the bottom representation learning of MTL in RS and propose the Deep Task-specific Bottom Representation Network (DTRN) to alleviate the negative transfer problem. DTRN obtains task-specific bottom representation explicitly by making each task has its own representation learning network in the bottom representation modeling stage. Specifically, it extracts the user's interests from multiple types of behavior sequences for each task through the parameter-efficient hypernetwork. To further obtain the dedicated representation for each task, DTRN refines the representation of each feature by employing a SENet-like network for each task. The two proposed modules can achieve the purpose of getting task-specific bottom representation to relieve tasks' mutual interference. Moreover, the proposed DTRN is flexible to combine with existing MTL methods. Experiments on one public dataset and one industrial dataset demonstrate the effectiveness of the proposed DTRN. Furthermore, we deploy DTRN in an industrial recommender system and gain remarkable improvements in multiple tasks. ",
    "url": "https://arxiv.org/abs/2308.05996",
    "authors": [
      "Qi Liu",
      "Zhilong Zhou",
      "Gangwei Jiang",
      "Tiezheng Ge",
      "Defu Lian"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.06015",
    "title": "Enhancing Generalization of Universal Adversarial Perturbation through  Gradient Aggregation",
    "abstract": "Deep neural networks are vulnerable to universal adversarial perturbation (UAP), an instance-agnostic perturbation capable of fooling the target model for most samples. Compared to instance-specific adversarial examples, UAP is more challenging as it needs to generalize across various samples and models. In this paper, we examine the serious dilemma of UAP generation methods from a generalization perspective -- the gradient vanishing problem using small-batch stochastic gradient optimization and the local optima problem using large-batch optimization. To address these problems, we propose a simple and effective method called Stochastic Gradient Aggregation (SGA), which alleviates the gradient vanishing and escapes from poor local optima at the same time. Specifically, SGA employs the small-batch training to perform multiple iterations of inner pre-search. Then, all the inner gradients are aggregated as a one-step gradient estimation to enhance the gradient stability and reduce quantization errors. Extensive experiments on the standard ImageNet dataset demonstrate that our method significantly enhances the generalization ability of UAP and outperforms other state-of-the-art methods. The code is available at https://github.com/liuxuannan/Stochastic-Gradient-Aggregation. ",
    "url": "https://arxiv.org/abs/2308.06015",
    "authors": [
      "Xuannan Liu",
      "Yaoyao Zhong",
      "Yuhang Zhang",
      "Lixiong Qin",
      "Weihong Deng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.06024",
    "title": "Spatial-information Guided Adaptive Context-aware Network for Efficient  RGB-D Semantic Segmentation",
    "abstract": "Efficient RGB-D semantic segmentation has received considerable attention in mobile robots, which plays a vital role in analyzing and recognizing environmental information. According to previous studies, depth information can provide corresponding geometric relationships for objects and scenes, but actual depth data usually exist as noise. To avoid unfavorable effects on segmentation accuracy and computation, it is necessary to design an efficient framework to leverage cross-modal correlations and complementary cues. In this paper, we propose an efficient lightweight encoder-decoder network that reduces the computational parameters and guarantees the robustness of the algorithm. Working with channel and spatial fusion attention modules, our network effectively captures multi-level RGB-D features. A globally guided local affinity context module is proposed to obtain sufficient high-level context information. The decoder utilizes a lightweight residual unit that combines short- and long-distance information with a few redundant computations. Experimental results on NYUv2, SUN RGB-D, and Cityscapes datasets show that our method achieves a better trade-off among segmentation accuracy, inference time, and parameters than the state-of-the-art methods. The source code will be at https://github.com/MVME-HBUT/SGACNet ",
    "url": "https://arxiv.org/abs/2308.06024",
    "authors": [
      "Yang Zhang",
      "Chenyun Xiong",
      "Junjie Liu",
      "Xuhui Ye",
      "Guodong Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.06037",
    "title": "Deep Context Interest Network for Click-Through Rate Prediction",
    "abstract": "Click-Through Rate (CTR) prediction, estimating the probability of a user clicking on an item, is essential in industrial applications, such as online advertising. Many works focus on user behavior modeling to improve CTR prediction performance. However, most of those methods only model users' positive interests from users' click items while ignoring the context information, which is the display items around the clicks, resulting in inferior performance. In this paper, we highlight the importance of context information on user behavior modeling and propose a novel model named Deep Context Interest Network (DCIN), which integrally models the click and its display context to learn users' context-aware interests. DCIN consists of three key modules: 1) Position-aware Context Aggregation Module (PCAM), which performs aggregation of display items with an attention mechanism; 2) Feedback-Context Fusion Module (FCFM), which fuses the representation of clicks and display contexts through non-linear feature interaction; 3) Interest Matching Module (IMM), which activates interests related with the target item. Moreover, we provide our hands-on solution to implement our DCIN model on large-scale industrial systems. The significant improvements in both offline and online evaluations demonstrate the superiority of our proposed DCIN method. Notably, DCIN has been deployed on our online advertising system serving the main traffic, which brings 1.5% CTR and 1.5% RPM lift. ",
    "url": "https://arxiv.org/abs/2308.06037",
    "authors": [
      "Xuyang Hou",
      "Zhe Wang",
      "Qi Liu",
      "Tan Qu",
      "Jia Cheng",
      "Jun Lei"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.06038",
    "title": "Diverse Data Augmentation with Diffusions for Effective Test-time Prompt  Tuning",
    "abstract": "Benefiting from prompt tuning, recent years have witnessed the promising performance of pre-trained vision-language models, e.g., CLIP, on versatile downstream tasks. In this paper, we focus on a particular setting of learning adaptive prompts on the fly for each test sample from an unseen new domain, which is known as test-time prompt tuning (TPT). Existing TPT methods typically rely on data augmentation and confidence selection. However, conventional data augmentation techniques, e.g., random resized crops, suffers from the lack of data diversity, while entropy-based confidence selection alone is not sufficient to guarantee prediction fidelity. To address these issues, we propose a novel TPT method, named DiffTPT, which leverages pre-trained diffusion models to generate diverse and informative new data. Specifically, we incorporate augmented data by both conventional method and pre-trained stable diffusion to exploit their respective merits, improving the models ability to adapt to unknown new test data. Moreover, to ensure the prediction fidelity of generated data, we introduce a cosine similarity-based filtration technique to select the generated data with higher similarity to the single test sample. Our experiments on test datasets with distribution shifts and unseen categories demonstrate that DiffTPT improves the zero-shot accuracy by an average of 5.13\\% compared to the state-of-the-art TPT method. Our code and models will be publicly released. ",
    "url": "https://arxiv.org/abs/2308.06038",
    "authors": [
      "Chun-Mei Feng",
      "Kai Yu",
      "Yong Liu",
      "Salman Khan",
      "Wangmeng Zuo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.06044",
    "title": "Going Deep and Going Wide: Counting Logic and Homomorphism  Indistinguishability over Graphs of Bounded Treedepth and Treewidth",
    "abstract": "We study the expressive power of first-order logic with counting quantifiers, especially the $k$-variable and quantifier-rank-$q$ fragment $\\mathsf{C}^k_q$, using homomorphism indistinguishability. Recently, Dawar, Jakl, and Reggio (2021) proved that two graphs satisfy the same $\\mathsf{C}^k_q$-sentences if and only if they are homomorphism indistinguishable over the class $\\mathcal{T}^k_q$ of graphs admitting a $k$-pebble forest cover of depth $q$. Their proof builds on the categorical framework of game comonads developed by Abramsky, Dawar, and Wang (2017). We reprove their result using elementary techniques inspired by Dvo\\v{r}\\'ak (2010). Using these techniques we also give a characterisation of guarded counting logic. Our main focus, however, is to provide a graph theoretic analysis of the graph class $\\mathcal{T}^k_q$. This allows us to separate $\\mathcal{T}^k_q$ from the intersection of the graph class $\\mathcal{TW}_{k-1}$, that is graphs of treewidth less or equal $k-1$, and $\\mathcal{TD}_q$, that is graphs of treedepth at most $q$ if $q$ is sufficiently larger than $k$. We are able to lift this separation to the semantic separation of the respective homomorphism indistinguishability relations. A part of this separation is to prove that the class $\\mathcal{TD}_q$ is homomorphism distinguishing closed, which was already conjectured by Roberson (2022). ",
    "url": "https://arxiv.org/abs/2308.06044",
    "authors": [
      "Eva Fluck",
      "Tim Seppelt",
      "Gian Luca Spitzer"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2308.06058",
    "title": "Adaptive SGD with Polyak stepsize and Line-search: Robust Convergence  and Variance Reduction",
    "abstract": "The recently proposed stochastic Polyak stepsize (SPS) and stochastic line-search (SLS) for SGD have shown remarkable effectiveness when training over-parameterized models. However, in non-interpolation settings, both algorithms only guarantee convergence to a neighborhood of a solution which may result in a worse output than the initial guess. While artificially decreasing the adaptive stepsize has been proposed to address this issue (Orvieto et al. [2022]), this approach results in slower convergence rates for convex and over-parameterized models. In this work, we make two contributions: Firstly, we propose two new variants of SPS and SLS, called AdaSPS and AdaSLS, which guarantee convergence in non-interpolation settings and maintain sub-linear and linear convergence rates for convex and strongly convex functions when training over-parameterized models. AdaSLS requires no knowledge of problem-dependent parameters, and AdaSPS requires only a lower bound of the optimal function value as input. Secondly, we equip AdaSPS and AdaSLS with a novel variance reduction technique and obtain algorithms that require $\\smash{\\widetilde{\\mathcal{O}}}(n+1/\\epsilon)$ gradient evaluations to achieve an $\\mathcal{O}(\\epsilon)$-suboptimality for convex functions, which improves upon the slower $\\mathcal{O}(1/\\epsilon^2)$ rates of AdaSPS and AdaSLS without variance reduction in the non-interpolation regimes. Moreover, our result matches the fast rates of AdaSVRG but removes the inner-outer-loop structure, which is easier to implement and analyze. Finally, numerical experiments on synthetic and real datasets validate our theory and demonstrate the effectiveness and robustness of our algorithms. ",
    "url": "https://arxiv.org/abs/2308.06058",
    "authors": [
      "Xiaowen Jiang",
      "Sebastian U. Stich"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.06063",
    "title": "A Case Study on Context Encoding in Multi-Encoder based Document-Level  Neural Machine Translation",
    "abstract": "Recent studies have shown that the multi-encoder models are agnostic to the choice of context, and the context encoder generates noise which helps improve the models in terms of BLEU score. In this paper, we further explore this idea by evaluating with context-aware pronoun translation test set by training multi-encoder models trained on three different context settings viz, previous two sentences, random two sentences, and a mix of both as context. Specifically, we evaluate the models on the ContraPro test set to study how different contexts affect pronoun translation accuracy. The results show that the model can perform well on the ContraPro test set even when the context is random. We also analyze the source representations to study whether the context encoder generates noise. Our analysis shows that the context encoder provides sufficient information to learn discourse-level information. Additionally, we observe that mixing the selected context (the previous two sentences in this case) and the random context is generally better than the other settings. ",
    "url": "https://arxiv.org/abs/2308.06063",
    "authors": [
      "Ramakrishna Appicharla",
      "Baban Gain",
      "Santanu Pal",
      "Asif Ekbal"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.06072",
    "title": "Out-of-Distribution Detection for Monocular Depth Estimation",
    "abstract": "In monocular depth estimation, uncertainty estimation approaches mainly target the data uncertainty introduced by image noise. In contrast to prior work, we address the uncertainty due to lack of knowledge, which is relevant for the detection of data not represented by the training distribution, the so-called out-of-distribution (OOD) data. Motivated by anomaly detection, we propose to detect OOD images from an encoder-decoder depth estimation model based on the reconstruction error. Given the features extracted with the fixed depth encoder, we train an image decoder for image reconstruction using only in-distribution data. Consequently, OOD images result in a high reconstruction error, which we use to distinguish between in- and out-of-distribution samples. We built our experiments on the standard NYU Depth V2 and KITTI benchmarks as in-distribution data. Our post hoc method performs astonishingly well on different models and outperforms existing uncertainty estimation approaches without modifying the trained encoder-decoder depth estimation model. ",
    "url": "https://arxiv.org/abs/2308.06072",
    "authors": [
      "Julia Hornauer",
      "Adrian Holzbock",
      "Vasileios Belagiannis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.06085",
    "title": "A matrix-free parallel solution method for the three-dimensional  heterogeneous Helmholtz equation",
    "abstract": "The Helmholtz equation is related to seismic exploration, sonar, antennas, and medical imaging applications. It is one of the most challenging problems to solve in terms of accuracy and convergence due to the scalability issues of the numerical solvers. For 3D large-scale applications, high-performance parallel solvers are also needed. In this paper, a matrix-free parallel iterative solver is presented for the three-dimensional (3D) heterogeneous Helmholtz equation. We consider the preconditioned Krylov subspace methods for solving the linear system obtained from finite-difference discretization. The Complex Shifted Laplace Preconditioner (CSLP) is employed since it results in a linear increase in the number of iterations as a function of the wavenumber. The preconditioner is approximately inverted using one parallel 3D multigrid cycle. For parallel computing, the global domain is partitioned blockwise. The matrix-vector multiplication and preconditioning operator are implemented in a matrix-free way instead of constructing large, memory-consuming coefficient matrices. Numerical experiments of 3D model problems demonstrate the robustness and outstanding strong scaling of our matrix-free parallel solution method. Moreover, the weak parallel scalability indicates our approach is suitable for realistic 3D heterogeneous Helmholtz problems with minimized pollution error. ",
    "url": "https://arxiv.org/abs/2308.06085",
    "authors": [
      "Jinqiang Chen",
      "Vandana Dwarka",
      "Cornelis Vuik"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2308.06087",
    "title": "Audio-Visual Spatial Integration and Recursive Attention for Robust  Sound Source Localization",
    "abstract": "The objective of the sound source localization task is to enable machines to detect the location of sound-making objects within a visual scene. While the audio modality provides spatial cues to locate the sound source, existing approaches only use audio as an auxiliary role to compare spatial regions of the visual modality. Humans, on the other hand, utilize both audio and visual modalities as spatial cues to locate sound sources. In this paper, we propose an audio-visual spatial integration network that integrates spatial cues from both modalities to mimic human behavior when detecting sound-making objects. Additionally, we introduce a recursive attention network to mimic human behavior of iterative focusing on objects, resulting in more accurate attention regions. To effectively encode spatial information from both modalities, we propose audio-visual pair matching loss and spatial region alignment loss. By utilizing the spatial cues of audio-visual modalities and recursively focusing objects, our method can perform more robust sound source localization. Comprehensive experimental results on the Flickr SoundNet and VGG-Sound Source datasets demonstrate the superiority of our proposed method over existing approaches. Our code is available at: https://github.com/VisualAIKHU/SIRA-SSL ",
    "url": "https://arxiv.org/abs/2308.06087",
    "authors": [
      "Sung Jin Um",
      "Dongjin Kim",
      "Jung Uk Kim"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.06095",
    "title": "Neural Conversation Models and How to Rein Them in: A Survey of Failures  and Fixes",
    "abstract": "Recent conditional language models are able to continue any kind of text source in an often seemingly fluent way. This fact encouraged research in the area of open-domain conversational systems that are based on powerful language models and aim to imitate an interlocutor by generating appropriate contributions to a written dialogue. From a linguistic perspective, however, the complexity of contributing to a conversation is high. In this survey, we interpret Grice's maxims of cooperative conversation from the perspective of this specific research area and systematize the literature under the aspect of what makes a contribution appropriate: A neural conversation model has to be fluent, informative, consistent, coherent, and follow social norms. In order to ensure these qualities, recent approaches try to tame the underlying language models at various intervention points, such as data, training regime or decoding. Sorted by these categories and intervention points, we discuss promising attempts and suggest novel ways for future research. ",
    "url": "https://arxiv.org/abs/2308.06095",
    "authors": [
      "Fabian Galetzka",
      "Anne Beyer",
      "David Schlangen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.06106",
    "title": "Hawkes Processes with Delayed Granger Causality",
    "abstract": "We aim to explicitly model the delayed Granger causal effects based on multivariate Hawkes processes. The idea is inspired by the fact that a causal event usually takes some time to exert an effect. Studying this time lag itself is of interest. Given the proposed model, we first prove the identifiability of the delay parameter under mild conditions. We further investigate a model estimation method under a complex setting, where we want to infer the posterior distribution of the time lags and understand how this distribution varies across different scenarios. We treat the time lags as latent variables and formulate a Variational Auto-Encoder (VAE) algorithm to approximate the posterior distribution of the time lags. By explicitly modeling the time lags in Hawkes processes, we add flexibility to the model. The inferred time-lag posterior distributions are of scientific meaning and help trace the original causal time that supports the root cause analysis. We empirically evaluate our model's event prediction and time-lag inference accuracy on synthetic and real data, achieving promising results. ",
    "url": "https://arxiv.org/abs/2308.06106",
    "authors": [
      "Chao Yang",
      "Hengyuan Miao",
      "Shuang Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.06107",
    "title": "Test-Time Adaptation for Backdoor Defense",
    "abstract": "Deep neural networks have played a crucial part in many critical domains, such as autonomous driving, face recognition, and medical diagnosis. However, deep neural networks are facing security threats from backdoor attacks and can be manipulated into attacker-decided behaviors by the backdoor attacker. To defend the backdoor, prior research has focused on using clean data to remove backdoor attacks before model deployment. In this paper, we investigate the possibility of defending against backdoor attacks at test time by utilizing partially poisoned data to remove the backdoor from the model. To address the problem, a two-stage method Test-Time Backdoor Defense (TTBD) is proposed. In the first stage, we propose two backdoor sample detection methods, namely DDP and TeCo, to identify poisoned samples from a batch of mixed, partially poisoned samples. Once the poisoned samples are detected, we employ Shapley estimation to calculate the contribution of each neuron's significance in the network, locate the poisoned neurons, and prune them to remove backdoor in the models. Our experiments demonstrate that TTBD removes the backdoor successfully with only a batch of partially poisoned data across different model architectures and datasets against different types of backdoor attacks. ",
    "url": "https://arxiv.org/abs/2308.06107",
    "authors": [
      "Jiyang Guan",
      "Jian Liang",
      "Ran He"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.06112",
    "title": "Lip2Vec: Efficient and Robust Visual Speech Recognition via  Latent-to-Latent Visual to Audio Representation Mapping",
    "abstract": "Visual Speech Recognition (VSR) differs from the common perception tasks as it requires deeper reasoning over the video sequence, even by human experts. Despite the recent advances in VSR, current approaches rely on labeled data to fully train or finetune their models predicting the target speech. This hinders their ability to generalize well beyond the training set and leads to performance degeneration under out-of-distribution challenging scenarios. Unlike previous works that involve auxiliary losses or complex training procedures and architectures, we propose a simple approach, named Lip2Vec that is based on learning a prior model. Given a robust visual speech encoder, this network maps the encoded latent representations of the lip sequence to their corresponding latents from the audio pair, which are sufficiently invariant for effective text decoding. The generated audio representation is then decoded to text using an off-the-shelf Audio Speech Recognition (ASR) model. The proposed model compares favorably with fully-supervised learning methods on the LRS3 dataset achieving 26 WER. Unlike SoTA approaches, our model keeps a reasonable performance on the VoxCeleb test set. We believe that reprogramming the VSR as an ASR task narrows the performance gap between the two and paves the way for more flexible formulations of lip reading. ",
    "url": "https://arxiv.org/abs/2308.06112",
    "authors": [
      "Yasser Abdelaziz Dahou Djilali",
      "Sanath Narayan",
      "Haithem Boussaid",
      "Ebtessam Almazrouei",
      "Merouane Debbah"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.06113",
    "title": "A Uniform Representation of Classical and Quantum Source Code for Static  Code Analysis",
    "abstract": "The emergence of quantum computing raises the question of how to identify (security-relevant) programming errors during development. However, current static code analysis tools fail to model information specific to quantum computing. In this paper, we identify this information and propose to extend classical code analysis tools accordingly. Among such tools, we identify the Code Property Graph to be very well suited for this task as it can be easily extended with quantum computing specific information. For our proof of concept, we implemented a tool which includes information from the quantum world in the graph and demonstrate its ability to analyze source code written in Qiskit and OpenQASM. Our tool brings together the information from the classical and quantum world, enabling analysis across both domains. By combining all relevant information into a single detailed analysis, this powerful tool can facilitate tackling future quantum source code analysis challenges. ",
    "url": "https://arxiv.org/abs/2308.06113",
    "authors": [
      "Maximilian Kaul",
      "Alexander Küchler",
      "Christian Banse"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.06116",
    "title": "The Stochastic Steepest Descent Method for Robust Optimization in Banach  Spaces",
    "abstract": "Stochastic gradient methods have been a popular and powerful choice of optimization methods, aimed at minimizing functions. Their advantage lies in the fact that that one approximates the gradient as opposed to using the full Jacobian matrix. One research direction, related to this, has been on the application to infinite-dimensional problems, where one may naturally have a Hilbert space framework. However, there has been limited work done on considering this in a more general setup, such as where the natural framework is that of a Banach space. This article aims to address this by the introduction of a novel stochastic method, the stochastic steepest descent method (SSD). The SSD will follow the spirit of stochastic gradient descent, which utilizes Riesz representation to identify gradients and derivatives. Our choice for using such a method is that it naturally allows one to adopt a Banach space setting, for which recent applications have exploited the benefit of this, such as in PDE-constrained shape optimization. We provide a convergence theory related to this under mild assumptions. Furthermore, we demonstrate the performance of this method on a couple of numerical applications, namely a $p$-Laplacian and an optimal control problem. Our assumptions are verified in these applications. ",
    "url": "https://arxiv.org/abs/2308.06116",
    "authors": [
      "Neil K. Chada",
      "Philip J. Herbert"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2308.06129",
    "title": "Uncertainty Quantification for Image-based Traffic Prediction across  Cities",
    "abstract": "Despite the strong predictive performance of deep learning models for traffic prediction, their widespread deployment in real-world intelligent transportation systems has been restrained by a lack of interpretability. Uncertainty quantification (UQ) methods provide an approach to induce probabilistic reasoning, improve decision-making and enhance model deployment potential. To gain a comprehensive picture of the usefulness of existing UQ methods for traffic prediction and the relation between obtained uncertainties and city-wide traffic dynamics, we investigate their application to a large-scale image-based traffic dataset spanning multiple cities and time periods. We compare two epistemic and two aleatoric UQ methods on both temporal and spatio-temporal transfer tasks, and find that meaningful uncertainty estimates can be recovered. We further demonstrate how uncertainty estimates can be employed for unsupervised outlier detection on changes in city traffic dynamics. We find that our approach can capture both temporal and spatial effects on traffic behaviour in a representative case study for the city of Moscow. Our work presents a further step towards boosting uncertainty awareness in traffic prediction tasks, and aims to highlight the value contribution of UQ methods to a better understanding of city traffic dynamics. ",
    "url": "https://arxiv.org/abs/2308.06129",
    "authors": [
      "Alexander Timans",
      "Nina Wiedemann",
      "Nishant Kumar",
      "Ye Hong",
      "Martin Raubal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.06132",
    "title": "PDE Discovery for Soft Sensors Using Coupled Physics-Informed Neural  Network with Akaike's Information Criterion",
    "abstract": "Soft sensors have been extensively used to monitor key variables using easy-to-measure variables and mathematical models. Partial differential equations (PDEs) are model candidates for soft sensors in industrial processes with spatiotemporal dependence. However, gaps often exist between idealized PDEs and practical situations. Discovering proper structures of PDEs, including the differential operators and source terms, can remedy the gaps. To this end, a coupled physics-informed neural network with Akaike's criterion information (CPINN-AIC) is proposed for PDE discovery of soft sensors. First, CPINN is adopted for obtaining solutions and source terms satisfying PDEs. Then, we propose a data-physics-hybrid loss function for training CPINN, in which undetermined combinations of differential operators are involved. Consequently, AIC is used to discover the proper combination of differential operators. Finally, the artificial and practical datasets are used to verify the feasibility and effectiveness of CPINN-AIC for soft sensors. The proposed CPINN-AIC is a data-driven method to discover proper PDE structures and neural network-based solutions for soft sensors. ",
    "url": "https://arxiv.org/abs/2308.06132",
    "authors": [
      "Aina Wang",
      "Pan Qin",
      "Xi-Ming Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.06138",
    "title": "Application of Artificial Neural Networks for Investigation of Pressure  Filtration Performance, a Zinc Leaching Filter Cake Moisture Modeling",
    "abstract": "Machine Learning (ML) is a powerful tool for material science applications. Artificial Neural Network (ANN) is a machine learning technique that can provide high prediction accuracy. This study aimed to develop an ANN model to predict the cake moisture of the pressure filtration process of zinc production. The cake moisture was influenced by seven parameters: temperature (35 and 65 Celsius), solid concentration (0.2 and 0.38 g/L), pH (2, 3.5, and 5), air-blow time (2, 10, and 15 min), cake thickness (14, 20, 26, and 34 mm), pressure, and filtration time. The study conducted 288 tests using two types of fabrics: polypropylene (S1) and polyester (S2). The ANN model was evaluated by the Coefficient of determination (R2), the Mean Square Error (MSE), and the Mean Absolute Error (MAE) metrics for both datasets. The results showed R2 values of 0.88 and 0.83, MSE values of 6.243x10-07 and 1.086x10-06, and MAE values of 0.00056 and 0.00088 for S1 and S2, respectively. These results indicated that the ANN model could predict the cake moisture of pressure filtration in the zinc leaching process with high accuracy. ",
    "url": "https://arxiv.org/abs/2308.06138",
    "authors": [
      "Masoume Kazemi",
      "Davood Moradkhani",
      "Alireza A. Alipour"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.06155",
    "title": "Phased Deep Spatio-temporal Learning for Highway Traffic Volume  Prediction",
    "abstract": "Inter-city highway transportation is significant for citizens' modern urban life and generates heterogeneous sensory data with spatio-temporal characteristics. As a routine analysis in transportation domain, daily traffic volume estimation faces challenges for highway toll stations including lacking of exploration of correlative spatio-temporal features from a long-term perspective and effective means to deal with data imbalance which always deteriorates the predictive performance. In this paper, a deep spatio-temporal learning method is proposed to predict daily traffic volume in three phases. In feature pre-processing phase, data is normalized elaborately according to latent long-tail distribution. In spatio-temporal learning phase, a hybrid model is employed combining fully convolution network (FCN) and long short-term memory (LSTM), which considers time, space, meteorology, and calendar from heterogeneous data. In decision phase, traffic volumes on a coming day at network-wide toll stations would be achieved effectively, which is especially calibrated for vital few highway stations. Using real-world data from one Chinese provincial highway, extensive experiments show our method has distinct improvement for predictive accuracy than various traditional models, reaching 5.269 and 0.997 in MPAE and R-squre metrics, respectively. ",
    "url": "https://arxiv.org/abs/2308.06155",
    "authors": [
      "Weilong Ding",
      "Tianpu Zhang",
      "Zhe Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.06165",
    "title": "Task Conditioned BERT for Joint Intent Detection and Slot-filling",
    "abstract": "Dialogue systems need to deal with the unpredictability of user intents to track dialogue state and the heterogeneity of slots to understand user preferences. In this paper we investigate the hypothesis that solving these challenges as one unified model will allow the transfer of parameter support data across the different tasks. The proposed principled model is based on a Transformer encoder, trained on multiple tasks, and leveraged by a rich input that conditions the model on the target inferences. Conditioning the Transformer encoder on multiple target inferences over the same corpus, i.e., intent and multiple slot types, allows learning richer language interactions than a single-task model would be able to. In fact, experimental results demonstrate that conditioning the model on an increasing number of dialogue inference tasks leads to improved results: on the MultiWOZ dataset, the joint intent and slot detection can be improved by 3.2\\% by conditioning on intent, 10.8\\% by conditioning on slot and 14.4\\% by conditioning on both intent and slots. Moreover, on real conversations with Farfetch costumers, the proposed conditioned BERT can achieve high joint-goal and intent detection performance throughout a dialogue. ",
    "url": "https://arxiv.org/abs/2308.06165",
    "authors": [
      "Diogo Tavares",
      "Pedro Azevedo",
      "David Semedo",
      "Ricardo Sousa",
      "João Magalhães"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.06173",
    "title": "Physical Adversarial Attacks For Camera-based Smart Systems: Current  Trends, Categorization, Applications, Research Challenges, and Future Outlook",
    "abstract": "In this paper, we present a comprehensive survey of the current trends focusing specifically on physical adversarial attacks. We aim to provide a thorough understanding of the concept of physical adversarial attacks, analyzing their key characteristics and distinguishing features. Furthermore, we explore the specific requirements and challenges associated with executing attacks in the physical world. Our article delves into various physical adversarial attack methods, categorized according to their target tasks in different applications, including classification, detection, face recognition, semantic segmentation and depth estimation. We assess the performance of these attack methods in terms of their effectiveness, stealthiness, and robustness. We examine how each technique strives to ensure the successful manipulation of DNNs while mitigating the risk of detection and withstanding real-world distortions. Lastly, we discuss the current challenges and outline potential future research directions in the field of physical adversarial attacks. We highlight the need for enhanced defense mechanisms, the exploration of novel attack strategies, the evaluation of attacks in different application domains, and the establishment of standardized benchmarks and evaluation criteria for physical adversarial attacks. Through this comprehensive survey, we aim to provide a valuable resource for researchers, practitioners, and policymakers to gain a holistic understanding of physical adversarial attacks in computer vision and facilitate the development of robust and secure DNN-based systems. ",
    "url": "https://arxiv.org/abs/2308.06173",
    "authors": [
      "Amira Guesmi",
      "Muhammad Abdullah Hanif",
      "Bassem Ouni",
      "Muhammed Shafique"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.06182",
    "title": "Noise-Resilient Designs for Optical Neural Networks",
    "abstract": "All analog signal processing is fundamentally subject to noise, and this is also the case in modern implementations of Optical Neural Networks (ONNs). Therefore, to mitigate noise in ONNs, we propose two designs that are constructed from a given, possibly trained, Neural Network (NN) that one wishes to implement. Both designs have the capability that the resulting ONNs gives outputs close to the desired NN. To establish the latter, we analyze the designs mathematically. Specifically, we investigate a probabilistic framework for the first design that establishes that the design is correct, i.e., for any feed-forward NN with Lipschitz continuous activation functions, an ONN can be constructed that produces output arbitrarily close to the original. ONNs constructed with the first design thus also inherit the universal approximation property of NNs. For the second design, we restrict the analysis to NNs with linear activation functions and characterize the ONNs' output distribution using exact formulas. Finally, we report on numerical experiments with LeNet ONNs that give insight into the number of components required in these designs for certain accuracy gains. We specifically study the effect of noise as a function of the depth of an ONN. The results indicate that in practice, adding just a few components in the manner of the first or the second design can already be expected to increase the accuracy of ONNs considerably. ",
    "url": "https://arxiv.org/abs/2308.06182",
    "authors": [
      "Gianluca Kosmella",
      "Ripalta Stabile",
      "Jaron Sanders"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Signal Processing (eess.SP)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:2308.06197",
    "title": "Complex Facial Expression Recognition Using Deep Knowledge Distillation  of Basic Features",
    "abstract": "Complex emotion recognition is a cognitive task that has so far eluded the same excellent performance of other tasks that are at or above the level of human cognition. Emotion recognition through facial expressions is particularly difficult due to the complexity of emotions expressed by the human face. For a machine to approach the same level of performance in this domain as a human, it may need to synthesise knowledge and understand new concepts in real-time as humans do. Humans are able to learn new concepts using only few examples, by distilling the important information from memories and discarding the rest. Similarly, continual learning methods learn new classes whilst retaining the knowledge of known classes, whilst few-shot learning methods are able to learn new classes using very few training examples. We propose a novel continual learning method inspired by human cognition and learning that can accurately recognise new compound expression classes using few training samples, by building on and retaining its knowledge of basic expression classes. Using GradCAM visualisations, we demonstrate the relationship between basic and compound facial expressions, which our method leverages through knowledge distillation and a novel Predictive Sorting Memory Replay. Our method achieves the current state-of-the-art in continual learning for complex facial expression recognition with 74.28% Overall Accuracy on new classes. We also demonstrate that using continual learning for complex facial expression recognition achieves far better performance than non-continual learning methods, improving on state-of-the-art non-continual learning methods by 13.95%. To the best of our knowledge, our work is also the first to apply few-shot learning to complex facial expression recognition, achieving the state-of-the-art with 100% accuracy using a single training sample for each expression class. ",
    "url": "https://arxiv.org/abs/2308.06197",
    "authors": [
      "Angus Maiden",
      "Bahareh Nakisa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.06203",
    "title": "Towards a Causal Probabilistic Framework for Prediction,  Action-Selection & Explanations for Robot Block-Stacking Tasks",
    "abstract": "Uncertainties in the real world mean that is impossible for system designers to anticipate and explicitly design for all scenarios that a robot might encounter. Thus, robots designed like this are fragile and fail outside of highly-controlled environments. Causal models provide a principled framework to encode formal knowledge of the causal relationships that govern the robot's interaction with its environment, in addition to probabilistic representations of noise and uncertainty typically encountered by real-world robots. Combined with causal inference, these models permit an autonomous agent to understand, reason about, and explain its environment. In this work, we focus on the problem of a robot block-stacking task due to the fundamental perception and manipulation capabilities it demonstrates, required by many applications including warehouse logistics and domestic human support robotics. We propose a novel causal probabilistic framework to embed a physics simulation capability into a structural causal model to permit robots to perceive and assess the current state of a block-stacking task, reason about the next-best action from placement candidates, and generate post-hoc counterfactual explanations. We provide exemplar next-best action selection results and outline planned experimentation in simulated and real-world robot block-stacking tasks. ",
    "url": "https://arxiv.org/abs/2308.06203",
    "authors": [
      "Ricardo Cannizzaro",
      "Jonathan Routley",
      "Lars Kunze"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.06217",
    "title": "Continual Face Forgery Detection via Historical Distribution Preserving",
    "abstract": "Face forgery techniques have advanced rapidly and pose serious security threats. Existing face forgery detection methods try to learn generalizable features, but they still fall short of practical application. Additionally, finetuning these methods on historical training data is resource-intensive in terms of time and storage. In this paper, we focus on a novel and challenging problem: Continual Face Forgery Detection (CFFD), which aims to efficiently learn from new forgery attacks without forgetting previous ones. Specifically, we propose a Historical Distribution Preserving (HDP) framework that reserves and preserves the distributions of historical faces. To achieve this, we use universal adversarial perturbation (UAP) to simulate historical forgery distribution, and knowledge distillation to maintain the distribution variation of real faces across different models. We also construct a new benchmark for CFFD with three evaluation protocols. Our extensive experiments on the benchmarks show that our method outperforms the state-of-the-art competitors. ",
    "url": "https://arxiv.org/abs/2308.06217",
    "authors": [
      "Ke Sun",
      "Shen Chen",
      "Taiping Yao",
      "Xiaoshuai Sun",
      "Shouhong Ding",
      "Rongrong Ji"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.06227",
    "title": "Comprehensive Benchmarking of Binary Neural Networks on NVM Crossbar  Architectures",
    "abstract": "Non-volatile memory (NVM) crossbars have been identified as a promising technology, for accelerating important machine learning operations, with matrix-vector multiplication being a key example. Binary neural networks (BNNs) are especially well-suited for use with NVM crossbars due to their use of a low-bitwidth representation for both activations and weights. However, the aggressive quantization of BNNs can result in suboptimal accuracy, and the analog effects of NVM crossbars can further degrade the accuracy during inference. This paper presents a comprehensive study that benchmarks BNNs trained and validated on ImageNet and deployed on NeuroSim, a simulator for NVM-crossbar-based PIM architecture. Our study analyzes the impact of various parameters, such as input precision and ADC resolution, on both the accuracy of the inference and the hardware performance metrics. We have found that an ADC resolution of 8-bit with an input precision of 4-bit achieves near-optimal accuracy compared to the original BNNs. In addition, we have identified bottleneck components in the PIM architecture that affect area, latency, and energy consumption, and we demonstrate the impact that different BNN layers have on hardware performance. ",
    "url": "https://arxiv.org/abs/2308.06227",
    "authors": [
      "Ruirong Huang",
      "Zichao Yue",
      "Caroline Huang",
      "Janarbek Matai",
      "Zhiru Zhang"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2308.06261",
    "title": "Enhancing Network Management Using Code Generated by Large Language  Models",
    "abstract": "Analyzing network topologies and communication graphs plays a crucial role in contemporary network management. However, the absence of a cohesive approach leads to a challenging learning curve, heightened errors, and inefficiencies. In this paper, we introduce a novel approach to facilitate a natural-language-based network management experience, utilizing large language models (LLMs) to generate task-specific code from natural language queries. This method tackles the challenges of explainability, scalability, and privacy by allowing network operators to inspect the generated code, eliminating the need to share network data with LLMs, and concentrating on application-specific requests combined with general program synthesis techniques. We design and evaluate a prototype system using benchmark applications, showcasing high accuracy, cost-effectiveness, and the potential for further enhancements using complementary program synthesis techniques. ",
    "url": "https://arxiv.org/abs/2308.06261",
    "authors": [
      "Sathiya Kumaran Mani",
      "Yajie Zhou",
      "Kevin Hsieh",
      "Santiago Segarra",
      "Ranveer Chandra",
      "Srikanth Kandula"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.05591",
    "title": "Optimizing Cache Content Placement in Integrated Terrestrial and  Non-terrestrial Networks",
    "abstract": "Non-terrestrial networks (NTN) offer potential for efficient content broadcast in remote regions, thereby extending the reach of digital services. In this paper, we introduce a novel approach to optimize wireless edge content placement using NTN. Specifically, we dynamically select content for placement via NTN links based on popularity and suitability for delivery through NTN, while considering the orbital motion of LEO satellites. Our comprehensive system-level case studies, based on a practical LEO constellation, demonstrate the significant improvement in placement speed compared to existing methods that neglect network mobility. We further show that the advantages of NTN links over standalone wireless TN solutions are more pronounced in the early stages of content delivery and are amplified by higher content popularity correlation across geographical regions. ",
    "url": "https://arxiv.org/abs/2308.05591",
    "authors": [
      "Feng Wang",
      "Giovanni Geraci",
      "Tony Q. S. Quek"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.05758",
    "title": "SNR-based beaconless multi-scan link acquisition model with vibration  for LEO-to-ground laser communication",
    "abstract": "We propose a link acquisition time model deeply involving the process from the transmitted power to received signal-to-noise ratio (SNR) for LEO-to-ground laser communication for the first time. Compared with the conventional acquisition models founded on geometry analysis with divergence angle threshold, utilizing SNR as the decision criterion is more appropriate for practical engineering requirements. Specially, under the combined effects of platform vibration and turbulence, we decouple the parameters of beam divergence angle, spiral pitch, and coverage factor at a fixed transmitted power for a given average received SNR threshold. Then the single-scan acquisition probability is obtained by integrating the field of uncertainty (FOU), probability distribution of coverage factor, and receiver field angle. Consequently, the closed-form analytical expression of acquisition time expectation adopting multi-scan, which ensures acquisition success, with essential reset time between single-scan is derived. The optimizations concerning the beam divergence angle, spiral pitch, and FOU are presented. Moreover, the influence of platform vibration is investigated. All the analytical derivations are confirmed by Monte Carlo simulations. Notably, we provide a theoretical method for designing the minimum divergence angle modulated by the laser, which not only improves the acquisition performance within a certain vibration range, but also achieves a good trade-off with the system complexity. ",
    "url": "https://arxiv.org/abs/2308.05758",
    "authors": [
      "Sen Yang",
      "Xiaofeng Li"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.05767",
    "title": "EEG-based Emotion Style Transfer Network for Cross-dataset Emotion  Recognition",
    "abstract": "As the key to realizing aBCIs, EEG emotion recognition has been widely studied by many researchers. Previous methods have performed well for intra-subject EEG emotion recognition. However, the style mismatch between source domain (training data) and target domain (test data) EEG samples caused by huge inter-domain differences is still a critical problem for EEG emotion recognition. To solve the problem of cross-dataset EEG emotion recognition, in this paper, we propose an EEG-based Emotion Style Transfer Network (E2STN) to obtain EEG representations that contain the content information of source domain and the style information of target domain, which is called stylized emotional EEG representations. The representations are helpful for cross-dataset discriminative prediction. Concretely, E2STN consists of three modules, i.e., transfer module, transfer evaluation module, and discriminative prediction module. The transfer module encodes the domain-specific information of source and target domains and then re-constructs the source domain's emotional pattern and the target domain's statistical characteristics into the new stylized EEG representations. In this process, the transfer evaluation module is adopted to constrain the generated representations that can more precisely fuse two kinds of complementary information from source and target domains and avoid distorting. Finally, the generated stylized EEG representations are fed into the discriminative prediction module for final classification. Extensive experiments show that the E2STN can achieve the state-of-the-art performance on cross-dataset EEG emotion recognition tasks. ",
    "url": "https://arxiv.org/abs/2308.05767",
    "authors": [
      "Yijin Zhou",
      "Fu Li",
      "Yang Li",
      "Youshuo Ji",
      "Lijian Zhang",
      "Yuanfang Chen",
      "Wenming Zheng",
      "Guangming Shi"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.05817",
    "title": "Comparing Width Parameters on Graph Classes",
    "abstract": "We study how the relationship between non-equivalent width parameters changes once we restrict to some special graph class. As width parameters, we consider treewidth, clique-width, twin-width, mim-width, sim-width and tree-independence number, whereas as graph classes we consider $K_{t,t}$-subgraph-free graphs, line graphs and their common superclass, for $t \\geq 3$, of $K_{t,t}$-free graphs. We first provide a complete comparison when restricted to $K_{t,t}$-subgraph-free graphs, showing in particular that treewidth, clique-width, mim-width, sim-width and tree-independence number are all equivalent. This extends a result of Gurski and Wanke (2000) stating that treewidth and clique-width are equivalent for the class of $K_{t,t}$-subgraph-free graphs. Next, we provide a complete comparison when restricted to line graphs, showing in particular that, on any class of line graphs, clique-width, mim-width, sim-width and tree-independence number are all equivalent, and bounded if and only if the class of root graphs has bounded treewidth. This extends a resut of Gurski and Wanke (2007) stating that a class of graphs~${\\cal G}$ has bounded treewidth if and only if the class of line graphs of graphs in ${\\cal G}$ has bounded clique-width. We then provide an almost-complete comparison for $K_{t,t}$-free graphs, leaving one missing case. Our main result is that $K_{t,t}$-free graphs of bounded mim-width have bounded tree-independence number. This result has structural and algorithmic consequences. In particular, it proves a special case of a conjecture of Dallard, Milani\\v{c} and \\v{S}torgel. Finally, we consider the question of whether boundedness of a certain width parameter is preserved under graph powers. We show that the question has a positive answer for sim-width precisely in the case of odd powers. ",
    "url": "https://arxiv.org/abs/2308.05817",
    "authors": [
      "Nick Brettell",
      "Andrea Munaro",
      "Daniël Paulusma",
      "Shizhou Yang"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2308.05823",
    "title": "Vibrational Stabilization of Complex Network Systems",
    "abstract": "Many natural and man-made network systems need to maintain certain patterns, such as working at equilibria or limit cycles, to function properly. Thus, the ability to stabilize such patterns is crucial. Most of the existing studies on stabilization assume that network systems states can be measured online so that feedback control strategies can be used. However, in many real-world scenarios, systems states, e.g., neuronal activity in the brain, are often difficult to measure. In this paper, we take this situation into account and study the stabilization problem of linear network systems with an open-loop control strategy (vibrational control). We derive a graph-theoretic sufficient condition for structural vibrational stabilizability, under which network systems can always be stabilized. We further provide an approach to select the locations in the network for control placement and design corresponding vibrational inputs to stabilize systems that satisfy this condition. Finally, we provide some numerical results that demonstrate the validity of our theoretical findings. ",
    "url": "https://arxiv.org/abs/2308.05823",
    "authors": [
      "Alberto Maria Nobili",
      "Yuzhen Qin",
      "Carlo Alberto Avizzano",
      "Danielle S. Bassett",
      "Fabio Pasqualetti"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.05843",
    "title": "GaborPINN: Efficient physics informed neural networks using  multiplicative filtered networks",
    "abstract": "The computation of the seismic wavefield by solving the Helmholtz equation is crucial to many practical applications, e.g., full waveform inversion. Physics-informed neural networks (PINNs) provide functional wavefield solutions represented by neural networks (NNs), but their convergence is slow. To address this problem, we propose a modified PINN using multiplicative filtered networks, which embeds some of the known characteristics of the wavefield in training, e.g., frequency, to achieve much faster convergence. Specifically, we use the Gabor basis function due to its proven ability to represent wavefields accurately and refer to the implementation as GaborPINN. Meanwhile, we incorporate prior information on the frequency of the wavefield into the design of the method to mitigate the influence of the discontinuity of the represented wavefield by GaborPINN. The proposed method achieves up to a two-magnitude increase in the speed of convergence as compared with conventional PINNs. ",
    "url": "https://arxiv.org/abs/2308.05843",
    "authors": [
      "Xinquan Huang",
      "Tariq Alkhalifah"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.06139",
    "title": "Shared ancestry graphs and symbolic arboreal maps",
    "abstract": "A network $N$ on a finite set $X$, $|X|\\geq 2$, is a connected directed acyclic graph with leaf set $X$ in which every root in $N$ has outdegree at least 2 and no vertex in $N$ has indegree and outdegree equal to 1; $N$ is arboreal if the underlying unrooted, undirected graph of $N$ is a tree. Networks are of interest in evolutionary biology since they are used, for example, to represent the evolutionary history of a set $X$ of species whose ancestors have exchanged genes in the past. For $M$ some arbitrary set of symbols, $d:{X \\choose 2} \\to M \\cup \\{\\odot\\}$ is a symbolic arboreal map if there exists some arboreal network $N$ whose vertices with outdegree two or more are labelled by elements in $M$ and so that $d(\\{x,y\\})$, $\\{x,y\\} \\in {X \\choose 2}$, is equal to the label of the least common ancestor of $x$ and $y$ in $N$ if this exists and $\\odot$ else. Important examples of symbolic arboreal maps include the symbolic ultrametrics, which arise in areas such as game theory, phylogenetics and cograph theory. In this paper we show that a map $d:{X \\choose 2} \\to M \\cup \\{\\odot\\}$ is a symbolic arboreal map if and only if $d$ satisfies certain 3- and 4-point conditions and the graph with vertex set $X$ and edge set consisting of those pairs $\\{x,y\\} \\in {X \\choose 2}$ with $d(\\{x,y\\}) \\neq \\odot$ is Ptolemaic. To do this, we introduce and prove a key theorem concerning the shared ancestry graph for a network $N$ on $X$, where this is the graph with vertex set $X$ and edge set consisting of those $\\{x,y\\} \\in {X \\choose 2}$ such that $x$ and $y$ share a common ancestor in $N$. In particular, we show that for any connected graph $G$ with vertex set $X$ and edge clique cover $K$ in which there are no two distinct sets in $K$ with one a subset of the other, there is some network with $|K|$ roots and leaf set $X$ whose shared ancestry graph is $G$. ",
    "url": "https://arxiv.org/abs/2308.06139",
    "authors": [
      "Katharina T. Huber",
      "Vincent Moulton",
      "Guillaume E. Scholz"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2308.06213",
    "title": "Change Point Detection With Conceptors",
    "abstract": "Offline change point detection seeks to identify points in a time series where the data generating process changes. This problem is well studied for univariate i.i.d. data, but becomes challenging with increasing dimension and temporal dependence. For the at most one change point problem, we propose the use of a conceptor matrix to learn the characteristic dynamics of a specified training window in a time series. The associated random recurrent neural network acts as a featurizer of the data, and change points are identified from a univariate quantification of the distance between the featurization and the space spanned by a representative conceptor matrix. This model agnostic method can suggest potential locations of interest that warrant further study. We prove that, under mild assumptions, the method provides a consistent estimate of the true change point, and quantile estimates for statistics are produced via a moving block bootstrap of the original data. The method is tested on simulations from several classes of processes, and we evaluate performance with clustering metrics, graphical methods, and observed Type 1 error control. We apply our method to publicly available neural data from rats experiencing bouts of non-REM sleep prior to exploration of a radial maze. ",
    "url": "https://arxiv.org/abs/2308.06213",
    "authors": [
      "Noah D. Gade",
      "Jordan Rodu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:1903.10360",
    "title": "Structured 2D Representation of 3D Data for Shape Processing",
    "abstract": " Comments: Results of some of the experiments were incorrect ",
    "url": "https://arxiv.org/abs/1903.10360",
    "authors": [
      "Kripasindhu Sarkar",
      "Elizabeth Mathews",
      "Didier Stricker"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2010.11750",
    "title": "Precise High-Dimensional Asymptotics for Quantifying Heterogeneous  Transfers",
    "abstract": " Comments: 64 pages, 6 figures; We thoroughly revised the paper by adding new results and reorganizing the presentation ",
    "url": "https://arxiv.org/abs/2010.11750",
    "authors": [
      "Fan Yang",
      "Hongyang R. Zhang",
      "Sen Wu",
      "Christopher Ré",
      "Weijie J. Su"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2011.07089",
    "title": "Robust Quadruped Jumping via Deep Reinforcement Learning",
    "abstract": " Title: Robust Quadruped Jumping via Deep Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2011.07089",
    "authors": [
      "Guillaume Bellegarda",
      "Chuong Nguyen",
      "Quan Nguyen"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2012.01654",
    "title": "Towards Defending Multiple $\\ell_p$-norm Bounded Adversarial  Perturbations via Gated Batch Normalization",
    "abstract": " Comments: Accepted on IJCV ",
    "url": "https://arxiv.org/abs/2012.01654",
    "authors": [
      "Aishan Liu",
      "Shiyu Tang",
      "Xinyun Chen",
      "Lei Huang",
      "Haotong Qin",
      "Xianglong Liu",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2012.01917",
    "title": "Mapping Patterns for Virtual Knowledge Graphs",
    "abstract": " Comments: 40 pages ",
    "url": "https://arxiv.org/abs/2012.01917",
    "authors": [
      "Diego Calvanese",
      "Avigdor Gal",
      "Davide Lanti",
      "Marco Montali",
      "Alessandro Mosca",
      "Roee Shraga"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2105.13061",
    "title": "The Imaginative Generative Adversarial Network: Automatic Data  Augmentation for Dynamic Skeleton-Based Hand Gesture and Human Action  Recognition",
    "abstract": " Title: The Imaginative Generative Adversarial Network: Automatic Data  Augmentation for Dynamic Skeleton-Based Hand Gesture and Human Action  Recognition ",
    "url": "https://arxiv.org/abs/2105.13061",
    "authors": [
      "Junxiao Shen",
      "John Dudley",
      "Per Ola Kristensson"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2110.03894",
    "title": "Neural Model Reprogramming with Similarity Based Mapping for  Low-Resource Spoken Command Classification",
    "abstract": " Comments: Accepted to Interspeech 2023. Code is available at: this https URL ",
    "url": "https://arxiv.org/abs/2110.03894",
    "authors": [
      "Hao Yen",
      "Pin-Jui Ku",
      "Chao-Han Huck Yang",
      "Hu Hu",
      "Sabato Marco Siniscalchi",
      "Pin-Yu Chen",
      "Yu Tsao"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2111.11011",
    "title": "CDistNet: Perceiving Multi-Domain Character Distance for Robust Text  Recognition",
    "abstract": " Comments: Paper accepted for publication at IJCV 2023 ",
    "url": "https://arxiv.org/abs/2111.11011",
    "authors": [
      "Tianlun Zheng",
      "Zhineng Chen",
      "Shancheng Fang",
      "Hongtao Xie",
      "Yu-Gang Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.00929",
    "title": "Designing for Robustness in Electric Grids via a General Effective  Resistance Measure",
    "abstract": " Comments: 9 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2201.00929",
    "authors": [
      "Shriya V. Nagpal",
      "Gokul G. Nair",
      "Francesca Parise",
      "C. Lindsay Anderson"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2201.07646",
    "title": "A Survey on Training Challenges in Generative Adversarial Networks for  Biomedical Image Analysis",
    "abstract": " Comments: Submitted to the AI Review Journal ",
    "url": "https://arxiv.org/abs/2201.07646",
    "authors": [
      "Muhammad Muneeb Saad",
      "Ruairi O'Reilly",
      "Mubashir Husain Rehmani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.04936",
    "title": "Robust Graph Representation Learning for Local Corruption Recovery",
    "abstract": " Comments: WWW '23: Proceedings of the ACM Web Conference 2023 ",
    "url": "https://arxiv.org/abs/2202.04936",
    "authors": [
      "Bingxin Zhou",
      "Yuanhong Jiang",
      "Yu Guang Wang",
      "Jingwei Liang",
      "Junbin Gao",
      "Shirui Pan",
      "Xiaoqun Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.07831",
    "title": "Graph Neural Network Sensitivity Under Probabilistic Error Model",
    "abstract": " Title: Graph Neural Network Sensitivity Under Probabilistic Error Model ",
    "url": "https://arxiv.org/abs/2203.07831",
    "authors": [
      "Xinjue Wang",
      "Esa Ollila",
      "Sergiy A. Vorobyov"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.05492",
    "title": "The performance of the amplitude-based model for complex phase retrieval",
    "abstract": " Comments: 34 pages ",
    "url": "https://arxiv.org/abs/2204.05492",
    "authors": [
      "Yu Xia",
      "Zhiqiang Xu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Information Theory (cs.IT)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2204.08247",
    "title": "Joint Multi-view Unsupervised Feature Selection and Graph Learning",
    "abstract": " Comments: To appear in IEEE Transactions on Emerging Topics in Computational Intelligence ",
    "url": "https://arxiv.org/abs/2204.08247",
    "authors": [
      "Si-Guo Fang",
      "Dong Huang",
      "Chang-Dong Wang",
      "Yong Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.15157",
    "title": "HRFuser: A Multi-resolution Sensor Fusion Architecture for 2D Object  Detection",
    "abstract": " Comments: IEEE International Conference on Intelligent Transportation Systems (ITSC) 2023 ",
    "url": "https://arxiv.org/abs/2206.15157",
    "authors": [
      "Tim Broedermann",
      "Christos Sakaridis",
      "Dengxin Dai",
      "Luc Van Gool"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.04129",
    "title": "How many perturbations break this model? Evaluating robustness beyond  adversarial accuracy",
    "abstract": " Title: How many perturbations break this model? Evaluating robustness beyond  adversarial accuracy ",
    "url": "https://arxiv.org/abs/2207.04129",
    "authors": [
      "Raphael Olivier",
      "Bhiksha Raj"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.03063",
    "title": "Enhancing the Robustness via Adversarial Learning and Joint  Spatial-Temporal Embeddings in Traffic Forecasting",
    "abstract": " Comments: Accepted by CIKM 2023 ",
    "url": "https://arxiv.org/abs/2208.03063",
    "authors": [
      "Juyong Jiang",
      "Binqing Wu",
      "Ling Chen",
      "Kai Zhang",
      "Sunghun Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.09668",
    "title": "Generalised Co-Salient Object Detection",
    "abstract": " Title: Generalised Co-Salient Object Detection ",
    "url": "https://arxiv.org/abs/2208.09668",
    "authors": [
      "Jiawei Liu",
      "Jing Zhang",
      "Ruikai Cui",
      "Kaihao Zhang",
      "Weihao Li",
      "Nick Barnes"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.05483",
    "title": "Self-Supervised Coordinate Projection Network for Sparse-View Computed  Tomography",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2209.05483",
    "authors": [
      "Qing Wu",
      "Ruimin Feng",
      "Hongjiang Wei",
      "Jingyi Yu",
      "Yuyao Zhang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.06801",
    "title": "Robust offset-free nonlinear model predictive control for systems  learned by neural nonlinear autoregressive exogenous models",
    "abstract": " Comments: This is the peer reviewed version of this http URL, available in Open Access on the publisher's website. Please, cite Reference 16 instead ",
    "url": "https://arxiv.org/abs/2210.06801",
    "authors": [
      "Jing Xie",
      "Fabio Bonassi",
      "Marcello Farina",
      "Riccardo Scattolini"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2210.17040",
    "title": "CodeEditor: Learning to Edit Source Code with Pre-trained Models",
    "abstract": " Comments: 18 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2210.17040",
    "authors": [
      "Jia Allen Li",
      "Ge Li",
      "Zhuo Li",
      "Zhi Jin",
      "Xing Hu",
      "Kechi Zhang",
      "Zhiyi Fu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.17316",
    "title": "There is more than one kind of robustness: Fooling Whisper with  adversarial examples",
    "abstract": " Comments: Accepted at InterSpeech 2023 ",
    "url": "https://arxiv.org/abs/2210.17316",
    "authors": [
      "Raphael Olivier",
      "Bhiksha Raj"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2211.08115",
    "title": "Heatmap-based Out-of-Distribution Detection",
    "abstract": " Comments: Accepted to WACV 2023 ",
    "url": "https://arxiv.org/abs/2211.08115",
    "authors": [
      "Julia Hornauer",
      "Vasileios Belagiannis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.11907",
    "title": "Robust Faber--Schauder approximation based on discrete observations of  an antiderivative",
    "abstract": " Comments: 29 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2211.11907",
    "authors": [
      "Xiyue Han",
      "Alexander Schied"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Statistical Finance (q-fin.ST)"
    ]
  },
  {
    "id": "arXiv:2212.02374",
    "title": "On the Trade-off between Over-smoothing and Over-squashing in Deep Graph  Neural Networks",
    "abstract": " Comments: This paper has been accepted for publication at the 32nd ACM International Conference on Information and Knowledge Management (CIKM) 2023 ",
    "url": "https://arxiv.org/abs/2212.02374",
    "authors": [
      "Jhony H. Giraldo",
      "Konstantinos Skianis",
      "Thierry Bouwmans",
      "Fragkiskos D. Malliaros"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.07226",
    "title": "An Efficient Incremental Simple Temporal Network Data Structure for  Temporal Planning",
    "abstract": " Comments: V2: Fixed a typo in the algorithm pseudocode ",
    "url": "https://arxiv.org/abs/2212.07226",
    "authors": [
      "Andrea Micheli"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.01732",
    "title": "UNAEN: Unsupervised Abnormality Extraction Network for MRI Motion  Artifact Reduction",
    "abstract": " Title: UNAEN: Unsupervised Abnormality Extraction Network for MRI Motion  Artifact Reduction ",
    "url": "https://arxiv.org/abs/2301.01732",
    "authors": [
      "Yusheng Zhou",
      "Hao Li",
      "Jianan Liu",
      "Zhengmin Kong",
      "Tao Huang",
      "Euijoon Ahn",
      "Zhihan Lv",
      "Jinman Kim",
      "David Dagan Feng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2301.08427",
    "title": "Which Features are Learned by CodeBert: An Empirical Study of the  BERT-based Source Code Representation Learning",
    "abstract": " Comments: 1 table, 2 figures ",
    "url": "https://arxiv.org/abs/2301.08427",
    "authors": [
      "Lan Zhang",
      "Chen Cao",
      "Zhilong Wang",
      "Peng Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2301.11189",
    "title": "Improving Statistical Fidelity for Neural Image Compression with  Implicit Local Likelihood Models",
    "abstract": " Comments: Upload camera-ready to arXiv. Official version available at this https URL ",
    "url": "https://arxiv.org/abs/2301.11189",
    "authors": [
      "Matthew J. Muckley",
      "Alaaeldin El-Nouby",
      "Karen Ullrich",
      "Hervé Jégou",
      "Jakob Verbeek"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2302.06144",
    "title": "SkCoder: A Sketch-based Approach for Automatic Code Generation",
    "abstract": " Comments: Accepted by the 45th IEEE/ACM International Conference on Software Engineering (ICSE 2023) ",
    "url": "https://arxiv.org/abs/2302.06144",
    "authors": [
      "Jia Allen Li",
      "Yongmin Li",
      "Ge Li",
      "Zhi Jin",
      "Yiyang Hao",
      "Xing Hu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2302.07640",
    "title": "Detection and classification of vocal productions in large scale audio  recordings",
    "abstract": " Title: Detection and classification of vocal productions in large scale audio  recordings ",
    "url": "https://arxiv.org/abs/2302.07640",
    "authors": [
      "Guillem Bonafos",
      "Pierre Pudlo",
      "Jean-Marc Freyermuth",
      "Thierry Legou",
      "Joël Fagot",
      "Samuel Tronçon",
      "Arnaud Rey"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2302.14057",
    "title": "Cross-modal Contrastive Learning for Multimodal Fake News Detection",
    "abstract": " Comments: 9 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2302.14057",
    "authors": [
      "Longzheng Wang",
      "Chuang Zhang",
      "Hongbo Xu",
      "Yongxiu Xu",
      "Xiaohan Xu",
      "Siqi Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2303.08032",
    "title": "Verifying the Robustness of Automatic Credibility Assessment",
    "abstract": " Title: Verifying the Robustness of Automatic Credibility Assessment ",
    "url": "https://arxiv.org/abs/2303.08032",
    "authors": [
      "Piotr Przybyła",
      "Alexander Shvets",
      "Horacio Saggion"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.14029",
    "title": "PENTACET data -- 23 Million Contextual Code Comments and 250,000 SATD  comments",
    "abstract": " Comments: Accepted in MSR 2023 Tools and Data Showcase ",
    "url": "https://arxiv.org/abs/2303.14029",
    "authors": [
      "Murali Sridharan",
      "Leevi Rantala",
      "Mika Mäntylä"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.15109",
    "title": "Improving the Transferability of Adversarial Examples via Direction  Tuning",
    "abstract": " Comments: Accepted by INS 2023 ",
    "url": "https://arxiv.org/abs/2303.15109",
    "authors": [
      "Xiangyuan Yang",
      "Jie Lin",
      "Hanlin Zhang",
      "Xinyu Yang",
      "Peng Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.15939",
    "title": "Generating artificial digital image correlation data using  physics-guided adversarial networks",
    "abstract": " Title: Generating artificial digital image correlation data using  physics-guided adversarial networks ",
    "url": "https://arxiv.org/abs/2303.15939",
    "authors": [
      "David Melching",
      "Erik Schultheis",
      "Eric Breitbarth"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.17780",
    "title": "AceCoder: Utilizing Existing Code to Enhance Code Generation",
    "abstract": " Title: AceCoder: Utilizing Existing Code to Enhance Code Generation ",
    "url": "https://arxiv.org/abs/2303.17780",
    "authors": [
      "Jia Allen Li",
      "Yunfei Zhao",
      "Yongmin Li",
      "Ge Li",
      "Zhi Jin"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.02055",
    "title": "Risk-based Security Measure Allocation Against Injection Attacks on  Actuators",
    "abstract": " Comments: Accepted to IEEE Open Journal of Control Systems (OJ-CSYS) ",
    "url": "https://arxiv.org/abs/2304.02055",
    "authors": [
      "Sribalaji C. Anand",
      "André M. H. Teixeira"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.04979",
    "title": "Quorum Subsumption for Heterogeneous Quorum Systems",
    "abstract": " Title: Quorum Subsumption for Heterogeneous Quorum Systems ",
    "url": "https://arxiv.org/abs/2304.04979",
    "authors": [
      "Xiao Li",
      "Eric Chan",
      "Mohsen Lesani"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2304.09466",
    "title": "MAMAF-Net: Motion-Aware and Multi-Attention Fusion Network for Stroke  Diagnosis",
    "abstract": " Title: MAMAF-Net: Motion-Aware and Multi-Attention Fusion Network for Stroke  Diagnosis ",
    "url": "https://arxiv.org/abs/2304.09466",
    "authors": [
      "Aysen Degerli",
      "Pekka Jakala",
      "Juha Pajula",
      "Milla Immonen",
      "Miguel Bordallo Lopez"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.13031",
    "title": "DQS3D: Densely-matched Quantization-aware Semi-supervised 3D Detection",
    "abstract": " Comments: Accepted to ICCV 2023. Code: this https URL ",
    "url": "https://arxiv.org/abs/2304.13031",
    "authors": [
      "Huan-ang Gao",
      "Beiwen Tian",
      "Pengfei Li",
      "Hao Zhao",
      "Guyue Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02640",
    "title": "Towards Causal Representation Learning and Deconfounding from Indefinite  Data",
    "abstract": " Title: Towards Causal Representation Learning and Deconfounding from Indefinite  Data ",
    "url": "https://arxiv.org/abs/2305.02640",
    "authors": [
      "Hang Chen",
      "Xinyu Yang",
      "Qing Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2305.06024",
    "title": "Larger is not Better: A Survey on the Robustness of Computer Vision  Models against Common Corruptions",
    "abstract": " Title: Larger is not Better: A Survey on the Robustness of Computer Vision  Models against Common Corruptions ",
    "url": "https://arxiv.org/abs/2305.06024",
    "authors": [
      "Shunxin Wang",
      "Raymond Veldhuis",
      "Christoph Brune",
      "Nicola Strisciuglio"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.17271",
    "title": "Robust Lane Detection through Self Pre-training with Masked Sequential  Autoencoders and Fine-tuning with Customized PolyLoss",
    "abstract": " Comments: 12 pages, 8 figures, accepted by journal of IEEE Transactions on Intelligent Transportation Systems ",
    "url": "https://arxiv.org/abs/2305.17271",
    "authors": [
      "Ruohan Li",
      "Yongqi Dong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2306.02649",
    "title": "On the Complexity of Lombardi Graph Drawing",
    "abstract": " Comments: Appears in the Proceedings of the 31st International Symposium on Graph Drawing and Network Visualization (GD 2023) ",
    "url": "https://arxiv.org/abs/2306.02649",
    "authors": [
      "Paul Jungeblut"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Computational Complexity (cs.CC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2306.06551",
    "title": "An Efficient and Accurate Memristive Memory for Array-based Spiking  Neural Networks",
    "abstract": " Title: An Efficient and Accurate Memristive Memory for Array-based Spiking  Neural Networks ",
    "url": "https://arxiv.org/abs/2306.06551",
    "authors": [
      "Hritom Das",
      "Rocco D. Febbo",
      "SNB Tushar",
      "Nishith N. Chakraborty",
      "Maximilian Liehr",
      "Nathaniel Cady",
      "Garrett S. Rose"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2306.10645",
    "title": "Developing Effective Educational Chatbots with ChatGPT prompts: Insights  from Preliminary Tests in a Case Study on Social Media Literacy (with  appendix)",
    "abstract": " Comments: Poster version accepted at the 31st International Conference on Computers in Education (ICCE) ",
    "url": "https://arxiv.org/abs/2306.10645",
    "authors": [
      "Cansu Koyuturk",
      "Mona Yavari",
      "Emily Theophilou",
      "Sathya Bursic",
      "Gregor Donabauer",
      "Alessia Telari",
      "Alessia Testa",
      "Raffaele Boiano",
      "Alessandro Gabbiadini",
      "Davinia Hernandez-Leo",
      "Martin Ruskov",
      "Dimitri Ognibene"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2306.14701",
    "title": "Hard Sample Mining Enabled Supervised Contrastive Feature Learning for  Wind Turbine Pitch System Fault Diagnosis",
    "abstract": " Title: Hard Sample Mining Enabled Supervised Contrastive Feature Learning for  Wind Turbine Pitch System Fault Diagnosis ",
    "url": "https://arxiv.org/abs/2306.14701",
    "authors": [
      "Zixuan Wang",
      "Bo Qin",
      "Mengxuan Li",
      "Chenlu Zhan",
      "Mark D. Butala",
      "Peng Peng",
      "Hongwei Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15932",
    "title": "NIPD: A Federated Learning Person Detection Benchmark Based on  Real-World Non-IID Data",
    "abstract": " Comments: 8 pages, 5 figures, 3 tables, FL-IJCAI 23 conference ",
    "url": "https://arxiv.org/abs/2306.15932",
    "authors": [
      "Kangning Yin",
      "Zhen Ding",
      "Zhihua Dong",
      "Dongsheng Chen",
      "Jie Fu",
      "Xinhui Ji",
      "Guangqiang Yin",
      "Zhiguo Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.00464",
    "title": "Human-to-Human Interaction Detection",
    "abstract": " Title: Human-to-Human Interaction Detection ",
    "url": "https://arxiv.org/abs/2307.00464",
    "authors": [
      "Zhenhua Wang",
      "Kaining Ying",
      "Jiajun Meng",
      "Jifeng Ning"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.03903",
    "title": "Adversarial Self-Attack Defense and Spatial-Temporal Relation Mining for  Visible-Infrared Video Person Re-Identification",
    "abstract": " Comments: 11 pages,8 figures ",
    "url": "https://arxiv.org/abs/2307.03903",
    "authors": [
      "Huafeng Li",
      "Le Xu",
      "Yafei Zhang",
      "Dapeng Tao",
      "Zhengtao Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.12267",
    "title": "Towards Automatic Boundary Detection for Human-AI Collaborative Hybrid  Essay in Education",
    "abstract": " Comments: 9 pages including references, 2 figures ",
    "url": "https://arxiv.org/abs/2307.12267",
    "authors": [
      "Zijie Zeng",
      "Lele Sha",
      "Yuheng Li",
      "Kaixun Yang",
      "Dragan Gašević",
      "Guanliang Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.15130",
    "title": "Bounding the Interleaving Distance for Geometric Graphs with a Loss  Function",
    "abstract": " Comments: Fixed typos and some missed references ",
    "url": "https://arxiv.org/abs/2307.15130",
    "authors": [
      "Erin W. Chambers",
      "Elizabeth Munch",
      "Sarah Percival",
      "Bei Wang"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "General Topology (math.GN)"
    ]
  },
  {
    "id": "arXiv:2307.16727",
    "title": "Multi Agent Navigation in Unconstrained Environments using a Centralized  Attention based Graphical Neural Network Controller",
    "abstract": " Title: Multi Agent Navigation in Unconstrained Environments using a Centralized  Attention based Graphical Neural Network Controller ",
    "url": "https://arxiv.org/abs/2307.16727",
    "authors": [
      "Yining Ma",
      "Qadeer Khan",
      "Daniel Cremers"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2308.01097",
    "title": "Spatio-Temporal Branching for Motion Prediction using Motion Increments",
    "abstract": " Title: Spatio-Temporal Branching for Motion Prediction using Motion Increments ",
    "url": "https://arxiv.org/abs/2308.01097",
    "authors": [
      "Jiexin Wang",
      "Yujie Zhou",
      "Wenwen Qiang",
      "Ying Ba",
      "Bing Su",
      "Ji-Rong Wen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.02080",
    "title": "Causality Guided Disentanglement for Cross-Platform Hate Speech  Detection",
    "abstract": " Title: Causality Guided Disentanglement for Cross-Platform Hate Speech  Detection ",
    "url": "https://arxiv.org/abs/2308.02080",
    "authors": [
      "Paras Sheth",
      "Tharindu Kumarage",
      "Raha Moraffah",
      "Aman Chadha",
      "Huan Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.02525",
    "title": "Can Self-Supervised Representation Learning Methods Withstand  Distribution Shifts and Corruptions?",
    "abstract": " Comments: Accepted at 2023 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW). Corresponding author - prakash.chandra.chhipa@ltu.se ",
    "url": "https://arxiv.org/abs/2308.02525",
    "authors": [
      "Prakash Chandra Chhipa",
      "Johan Rodahl Holmgren",
      "Kanjar De",
      "Rajkumar Saini",
      "Marcus Liwicki"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.02805",
    "title": "Meta-Analysis and Systematic Review for Anomaly Network Intrusion  Detection Systems: Detection Methods, Dataset, Validation Methodology, and  Challenges",
    "abstract": " Title: Meta-Analysis and Systematic Review for Anomaly Network Intrusion  Detection Systems: Detection Methods, Dataset, Validation Methodology, and  Challenges ",
    "url": "https://arxiv.org/abs/2308.02805",
    "authors": [
      "Ziadoon K. Maseer",
      "Robiah Yusof",
      "Baidaa Al-Bander",
      "Abdu Saif",
      "Qusay Kanaan Kadhim"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.02916",
    "title": "Adversarial Erasing with Pruned Elements: Towards Better Graph Lottery  Ticket",
    "abstract": " Comments: 17 pages, 10 figures, Accept by ECAI2023 ",
    "url": "https://arxiv.org/abs/2308.02916",
    "authors": [
      "Yuwen Wang",
      "Shunyu Liu",
      "Kaixuan Chen",
      "Tongtian Zhu",
      "Ji Qiao",
      "Mengjie Shi",
      "Yuanyu Wan",
      "Mingli Song"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04172",
    "title": "Predicting Drug-Drug Interactions Using Knowledge Graphs",
    "abstract": " Title: Predicting Drug-Drug Interactions Using Knowledge Graphs ",
    "url": "https://arxiv.org/abs/2308.04172",
    "authors": [
      "Lizzy Farrugia",
      "Lilian M. Azzopardi",
      "Jeremy Debattista",
      "Charlie Abela"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04365",
    "title": "SLEM: Machine Learning for Path Modeling and Causal Inference with Super  Learner Equation Modeling",
    "abstract": " Title: SLEM: Machine Learning for Path Modeling and Causal Inference with Super  Learner Equation Modeling ",
    "url": "https://arxiv.org/abs/2308.04365",
    "authors": [
      "Matthew J. Vowels"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2308.05309",
    "title": "Homophily-enhanced Structure Learning for Graph Clustering",
    "abstract": " Comments: 11 pages with 7 figures. Accepted by CIKM'23 ",
    "url": "https://arxiv.org/abs/2308.05309",
    "authors": [
      "Ming Gu",
      "Gaoming Yang",
      "Sheng Zhou",
      "Ning Ma",
      "Jiawei Chen",
      "Qiaoyu Tan",
      "Meihan Liu",
      "Jiajun Bu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2308.05721",
    "title": "Deformable Mixer Transformer with Gating for Multi-Task Learning of  Dense Prediction",
    "abstract": " Comments: submitted to IJCV; an extension to our previous AAAI 2023 paper arXiv:2301.03461 ",
    "url": "https://arxiv.org/abs/2308.05721",
    "authors": [
      "Yangyang Xu",
      "Yibo Yang",
      "Bernard Ghanemm",
      "Lefei Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]