[
  {
    "id": "arXiv:2107.05684",
    "title": "Accenture at CheckThat! 2021: Interesting claim identification and  ranking with contextually sensitive lexical training data augmentation",
    "abstract": "This paper discusses the approach used by the Accenture Team for CLEF2021 CheckThat! Lab, Task 1, to identify whether a claim made in social media would be interesting to a wide audience and should be fact-checked. Twitter training and test data were provided in English, Arabic, Spanish, Turkish, and Bulgarian. Claims were to be classified (check-worthy/not check-worthy) and ranked in priority order for the fact-checker. Our method used deep neural network transformer models with contextually sensitive lexical augmentation applied on the supplied training datasets to create additional training samples. This augmentation approach improved the performance for all languages. Overall, our architecture and data augmentation pipeline produced the best submitted system for Arabic, and performance scales according to the quantity of provided training data for English, Spanish, Turkish, and Bulgarian. This paper investigates the deep neural network architectures for each language as well as the provided data to examine why the approach worked so effectively for Arabic, and discusses additional data augmentation measures that should could be useful to this problem. ",
    "url": "https://arxiv.org/abs/2107.05684",
    "authors": [
      "Evan Williams",
      "Paul Rodrigues",
      "Sieu Tran"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2107.05729",
    "title": "Generalization of graph network inferences in higher-order probabilistic  graphical models",
    "abstract": "Probabilistic graphical models provide a powerful tool to describe complex statistical structure, with many real-world applications in science and engineering from controlling robotic arms to understanding neuronal computations. A major challenge for these graphical models is that inferences such as marginalization are intractable for general graphs. These inferences are often approximated by a distributed message-passing algorithm such as Belief Propagation, which does not always perform well on graphs with cycles, nor can it always be easily specified for complex continuous probability distributions. Such difficulties arise frequently in expressive graphical models that include intractable higher-order interactions. In this paper we construct iterative message-passing algorithms using Graph Neural Networks defined on factor graphs to achieve fast approximate inference on graphical models that involve many-variable interactions. Experimental results on several families of graphical models demonstrate the out-of-distribution generalization capability of our method to different sized graphs, and indicate the domain in which our method gains advantage over Belief Propagation. ",
    "url": "https://arxiv.org/abs/2107.05729",
    "authors": [
      "Yicheng Fei",
      "Xaq Pitkow"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.05747",
    "title": "SoftHebb: Bayesian inference in unsupervised Hebbian soft  winner-take-all networks",
    "abstract": "State-of-the-art artificial neural networks (ANNs) require labelled data or feedback between layers, are often biologically implausible, and are vulnerable to adversarial attacks that humans are not susceptible to. On the other hand, Hebbian learning in winner-take-all (WTA) networks, is unsupervised, feed-forward, and biologically plausible. However, an objective optimization theory for WTA networks has been missing, except under very limiting assumptions. Here we derive formally such a theory, based on biologically plausible but generic ANN elements. Through Hebbian learning, network parameters maintain a Bayesian generative model of the data. There is no supervisory loss function, but the network does minimize cross-entropy between its activations and the input distribution. The key is a \"soft\" WTA where there is no absolute \"hard\" winner neuron, and a specific type of Hebbian-like plasticity of weights and biases. We confirm our theory in practice, where, in handwritten digit (MNIST) recognition, our Hebbian algorithm, SoftHebb, minimizes cross-entropy without having access to it, and outperforms the more frequently used, hard-WTA-based method. Strikingly, it even outperforms supervised end-to-end backpropagation, under certain conditions. Specifically, in a two-layered network, SoftHebb outperforms backpropagation when the training dataset is only presented once, when the testing data is noisy, and under gradient-based adversarial attacks. Adversarial attacks that confuse SoftHebb are also confusing to the human eye. Finally, the model can generate interpolations of objects from its input distribution. ",
    "url": "https://arxiv.org/abs/2107.05747",
    "authors": [
      "Timoleon Moraitis",
      "Dmitry Toichkin",
      "Yansong Chua",
      "Qinghai Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2107.05904",
    "title": "Region attention and graph embedding network for occlusion objective  class-based micro-expression recognition",
    "abstract": "Micro-expression recognition (\\textbf{MER}) has attracted lots of researchers' attention in a decade. However, occlusion will occur for MER in real-world scenarios. This paper deeply investigates an interesting but unexplored challenging issue in MER, \\ie, occlusion MER. First, to research MER under real-world occlusion, synthetic occluded micro-expression databases are created by using various mask for the community. Second, to suppress the influence of occlusion, a \\underline{R}egion-inspired \\underline{R}elation \\underline{R}easoning \\underline{N}etwork (\\textbf{RRRN}) is proposed to model relations between various facial regions. RRRN consists of a backbone network, the Region-Inspired (\\textbf{RI}) module and Relation Reasoning (\\textbf{RR}) module. More specifically, the backbone network aims at extracting feature representations from different facial regions, RI module computing an adaptive weight from the region itself based on attention mechanism with respect to the unobstructedness and importance for suppressing the influence of occlusion, and RR module exploiting the progressive interactions among these regions by performing graph convolutions. Experiments are conducted on handout-database evaluation and composite database evaluation tasks of MEGC 2018 protocol. Experimental results show that RRRN can significantly explore the importance of facial regions and capture the cooperative complementary relationship of facial regions for MER. The results also demonstrate RRRN outperforms the state-of-the-art approaches, especially on occlusion, and RRRN acts more robust to occlusion. ",
    "url": "https://arxiv.org/abs/2107.05904",
    "authors": [
      "Qirong Mao",
      "Ling Zhou",
      "Wenming Zheng",
      "Xiuyan Shao",
      "Xiaohua Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.06093",
    "title": "A model-agnostic hypothesis test for community structure and homophily  in networks",
    "abstract": "Networks continue to be of great interest to statisticians, with an emphasis on community detection. Less work, however, has addressed this question: given some network, does it exhibit meaningful community structure? We propose to answer this question in a principled manner by framing it as a statistical hypothesis in terms of a formal and model-agnostic homophily metric. Homophily is a well-studied network property where intra-community edges are more likely than between-community edges. We use the homophily metric to identify and distinguish between three concepts: nominal, collateral, and intrinsic homophily. We propose a simple and interpretable test statistic leveraging this homophily parameter and formulate both asymptotic and bootstrap-based rejection thresholds. We prove its asymptotic properties and demonstrate it outperforms benchmark methods on both simulated and real world data. Furthermore, the proposed method yields rich, provocative insights on classic data sets; namely, that meany well-studied networks do not actually have intrinsic homophily. ",
    "url": "https://arxiv.org/abs/2107.06093",
    "authors": [
      "Eric Yanchenko",
      "Srijan Sengupta"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2107.06096",
    "title": "Blending search queries with social media data to improve forecasts of  economic indicators",
    "abstract": "The forecasting of political, economic, and public health indicators using internet activity has demonstrated mixed results. For example, while some measures of explicitly surveyed public opinion correlate well with social media proxies, the opportunity for profitable investment strategies to be driven solely by sentiment extracted from social media appears to have expired. Nevertheless, the internet's space of potentially predictive input signals is combinatorially vast and will continue to invite careful exploration. Here, we combine unemployment related search data from Google Trends with economic language on Twitter to attempt to nowcast and forecast: 1. State and national unemployment claims for the US, and 2. Consumer confidence in G7 countries. Building off of a recently developed search-query-based model, we show that incorporating Twitter data improves forecasting of unemployment claims, while the original method remains marginally better at nowcasting. Enriching the input signal with temporal statistical features (e.g., moving average and rate of change) further reduces errors, and improves the predictive utility of the proposed method when applied to other economic indices, such as consumer confidence. ",
    "url": "https://arxiv.org/abs/2107.06096",
    "authors": [
      "Yi Li",
      "Asieh Ahani",
      "Haimao Zhan",
      "Kevin Foley",
      "Thayer Alshaabi",
      "Kelsey Linnell",
      "Peter Sheridan Dodds",
      "Christopher M. Danforth",
      "Adam Fox"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)",
      "Applications (stat.AP)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2107.06132",
    "title": "Deep learning approaches to Earth Observation change detection",
    "abstract": "The interest for change detection in the field of remote sensing has increased in the last few years. Searching for changes in satellite images has many useful applications, ranging from land cover and land use analysis to anomaly detection. In particular, urban change detection provides an efficient tool to study urban spread and growth through several years of observation. At the same time, change detection is often a computationally challenging and time-consuming task, which requires innovative methods to guarantee optimal results with unquestionable value and within reasonable time. In this paper we present two different approaches to change detection (semantic segmentation and classification) that both exploit convolutional neural networks to achieve good results, which can be further refined and used in a post-processing workflow for a large variety of applications. ",
    "url": "https://arxiv.org/abs/2107.06132",
    "authors": [
      "Antonio Di Pilato",
      "Nicolò Taggio",
      "Alexis Pompili",
      "Michele Iacobellis",
      "Adriano Di Florio",
      "Davide Passarelli",
      "Sergio Samarelli"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.06185",
    "title": "A new method for vehicle system safety design based on data mining with  uncertainty modeling",
    "abstract": "In this research, a new data mining-based design approach has been developed for designing complex mechanical systems such as a crashworthy passenger car with uncertainty modeling. The method allows exploring the big crash simulation dataset to design the vehicle at multi-levels in a top-down manner (main energy absorbing system, components, and geometric features) and derive design rules based on the whole vehicle body safety requirements to make decisions towards the component and sub-component level design. Full vehicle and component simulation datasets are mined to build decision trees, where the interrelationship among parameters can be revealed and the design rules are derived to produce designs with good performance. This method has been extended by accounting for the uncertainty in the design variables. A new decision tree algorithm for uncertain data (DTUD) is developed to produce the desired designs and evaluate the design performance variations due to the uncertainty in design variables. The framework of this method is implemented by combining the design of experiments (DOE) and crash finite element analysis (FEA) and then demonstrated by designing a passenger car subject to front impact. The results show that the new methodology could achieve the design objectives efficiently and effectively. By applying the new method, the reliability of the final designs is also increased greatly. This approach has the potential to be applied as a general design methodology for a wide range of complex structures and mechanical systems. ",
    "url": "https://arxiv.org/abs/2107.06185",
    "authors": [
      "Xianping Du",
      "Binhui Jiang",
      "Feng Zhu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2107.06236",
    "title": "An FPT algorithm for the embeddability of graphs into two-dimensional  simplicial complexes",
    "abstract": "We consider the embeddability problem of a graph G into a two-dimensional simplicial complex C: Given G and C, decide whether G admits a topological embedding into C. The problem is NP-hard, even in the restricted case where C is homeomorphic to a surface. It is known that the problem admits an algorithm with running time f(c).n^{O(c)}, where n is the size of the graph G and c is the size of the two-dimensional complex C. In other words, that algorithm is polynomial when C is fixed, but the degree of the polynomial depends on C. We prove that the problem is fixed-parameter tractable in the size of the two-dimensional complex, by providing a deterministic f(c).n^3-time algorithm. We also provide a randomized algorithm with expected running time 2^{c^{O(1)}}.n^{O(1)}. Our approach is to reduce to the case where G has bounded branchwidth via an irrelevant vertex method, and to apply dynamic programming. We do not rely on any component of the existing linear-time algorithms for embedding graphs on a fixed surface; the only elaborated tool that we use is an algorithm to compute grid minors. ",
    "url": "https://arxiv.org/abs/2107.06236",
    "authors": [
      "Éric Colin de Verdière",
      "Thomas Magnard"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2107.05709",
    "title": "Optimal input representation in neural systems at the edge of chaos",
    "abstract": "Shedding light onto how biological systems represent, process and store information in noisy environments is a key and challenging goal. A stimulating, though controversial, hypothesis poses that operating in dynamical regimes near the edge of a phase transition, i.e. at criticality or the \"edge of chaos\", can provide information-processing living systems with important operational advantages, creating, e.g., an optimal trade-off between robustness and flexibility. Here, we elaborate on a recent theoretical result, which establishes that the spectrum of covariance matrices of neural networks representing complex inputs in a robust way needs to decay as a power-law of the rank, with an exponent close to unity, a result that has been indeed experimentally verified in neurons of the mouse visual cortex. Aimed at understanding and mimicking these results, we construct an artificial neural network and train it to classify images. Remarkably, we find that the best performance in such a task is obtained when the network operates near the critical point, at which the eigenspectrum of the covariance matrix follows the very same statistics as actual neurons do. Thus, we conclude that operating near criticality can also have -- besides the usually alleged virtues -- the advantage of allowing for flexible, robust and efficient input representations. ",
    "url": "https://arxiv.org/abs/2107.05709",
    "authors": [
      "Guillermo B. Morales",
      "Miguel A. Muñoz"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2107.05838",
    "title": "Analytical approach to the generalized friendship paradox in networks  with correlated attributes",
    "abstract": "One of the interesting phenomena due to the topological heterogeneities in complex networks is the friendship paradox, stating that your friends have on average more friends than you do. Recently, this paradox has been generalized for arbitrary nodal attributes, called a generalized friendship paradox (GFP). In this paper, we analyze the GFP for the networks in which the attributes of neighboring nodes are correlated with each other. The correlation structure between attributes of neighboring nodes is modeled by the Farlie-Gumbel-Morgenstern copula, enabling us to derive approximate analytical solutions of the GFP for three kinds of methods summarizing the neighborhood of the focal node, i.e., mean-based, median-based, and fraction-based methods. The analytical solutions are comparable to simulation results, while some systematic deviations between them might be attributed to the higher-order correlations between nodal attributes. These results help us get deeper insight into how various summarization methods as well as the correlation structure of nodal attributes affect the GFP behavior, hence better understand various related phenomena in complex networks. ",
    "url": "https://arxiv.org/abs/2107.05838",
    "authors": [
      "Hang-Hyun Jo",
      "Eun Lee",
      "Young-Ho Eom"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2107.06099",
    "title": "Drug-Target Interaction Prediction with Graph Attention networks",
    "abstract": "Motivation: Predicting Drug-Target Interaction (DTI) is a well-studied topic in bioinformatics due to its relevance in the fields of proteomics and pharmaceutical research. Although many machine learning methods have been successfully applied in this task, few of them aim at leveraging the inherent heterogeneous graph structure in the DTI network to address the challenge. For better learning and interpreting the DTI topological structure and the similarity, it is desirable to have methods specifically for predicting interactions from the graph structure. Results: We present an end-to-end framework, DTI-GAT (Drug-Target Interaction prediction with Graph Attention networks) for DTI predictions. DTI-GAT incorporates a deep neural network architecture that operates on graph-structured data with the attention mechanism, which leverages both the interaction patterns and the features of drug and protein sequences. DTI-GAT facilitates the interpretation of the DTI topological structure by assigning different attention weights to each node with the self-attention mechanism. Experimental evaluations show that DTI-GAT outperforms various state-of-the-art systems on the binary DTI prediction problem. Moreover, the independent study results further demonstrate that our model can be generalized better than other conventional methods. Availability: The source code and all datasets are available at https://github.com/Haiyang-W/DTI-GRAPH ",
    "url": "https://arxiv.org/abs/2107.06099",
    "authors": [
      "Haiyang Wang",
      "Guangyu Zhou",
      "Siqi Liu",
      "Jyun-Yu Jiang",
      "Wei Wang"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.06104",
    "title": "Functional Magnetic Resonance Imaging data augmentation through  conditional ICA",
    "abstract": "Advances in computational cognitive neuroimaging research are related to the availability of large amounts of labeled brain imaging data, but such data are scarce and expensive to generate. While powerful data generation mechanisms, such as Generative Adversarial Networks (GANs), have been designed in the last decade for computer vision, such improvements have not yet carried over to brain imaging. A likely reason is that GANs training is ill-suited to the noisy, high-dimensional and small-sample data available in functional neuroimaging.In this paper, we introduce Conditional Independent Components Analysis (Conditional ICA): a fast functional Magnetic Resonance Imaging (fMRI) data augmentation technique, that leverages abundant resting-state data to create images by sampling from an ICA decomposition. We then propose a mechanism to condition the generator on classes observed with few samples. We first show that the generative mechanism is successful at synthesizing data indistinguishable from observations, and that it yields gains in classification accuracy in brain decoding problems. In particular it outperforms GANs while being much easier to optimize and interpret. Lastly, Conditional ICA enhances classification accuracy in eight datasets without further parameters tuning. ",
    "url": "https://arxiv.org/abs/2107.06104",
    "authors": [
      "Badr Tajini",
      "Hugo Richard",
      "Bertrand Thirion"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2012.11619",
    "title": "Defence against adversarial attacks using classical and quantum-enhanced  Boltzmann machines",
    "abstract": " Comments: 15 pages, 1 figure. V2: Updated to match published version ",
    "url": "https://arxiv.org/abs/2012.11619",
    "authors": [
      "Aidan Kehoe",
      "Peter Wittek",
      "Yanbo Xue",
      "Alejandro Pozas-Kerstjens"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.00138",
    "title": "Rapid quantification of COVID-19 pneumonia burden from computed  tomography with convolutional LSTM networks",
    "abstract": " Comments: Added a new table (Table 4) and section (Section 3.5), no other results changed ",
    "url": "https://arxiv.org/abs/2104.00138",
    "authors": [
      "Kajetan Grodecki",
      "Aditya Killekar",
      "Andrew Lin",
      "Sebastien Cadet",
      "Priscilla McElhinney",
      "Aryabod Razipour",
      "Cato Chan",
      "Barry D. Pressman",
      "Peter Julien",
      "Judit Simon",
      "Pal Maurovich-Horvat",
      "Nicola Gaibazzi",
      "Udit Thakur",
      "Elisabetta Mancini",
      "Cecilia Agalbato",
      "Jiro Munechika",
      "Hidenari Matsumoto",
      "Roberto Menè",
      "Gianfranco Parati",
      "Franco Cernigliaro",
      "Nitesh Nerlekar",
      "Camilla Torlasco",
      "Gianluca Pontone",
      "Damini Dey",
      "Piotr J. Slomka"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.03693",
    "title": "On set systems definable in sparse graph classes, discrepancy, and  quantifier elimination",
    "abstract": " Title: On set systems definable in sparse graph classes, discrepancy, and  quantifier elimination ",
    "url": "https://arxiv.org/abs/2105.03693",
    "authors": [
      "Mario Grobler",
      "Patrice Ossona de Mendez",
      "Sebastian Siebertz",
      "Alexandre Vigny"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Logic in Computer Science (cs.LO)",
      "Combinatorics (math.CO)",
      "Logic (math.LO)"
    ]
  },
  {
    "id": "arXiv:2105.07671",
    "title": "Classifying variety of customer's online engagement for churn prediction  with mixed-penalty logistic regression",
    "abstract": " Comments: This version is not sufficiently exhaustive; a wrong version of validation results has been released (using a wrong part of a dataset for validation) ",
    "url": "https://arxiv.org/abs/2105.07671",
    "authors": [
      "Petra Posedel Šimović",
      "Davor Horvatic",
      "Edward W. Sun"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Econometrics (econ.EM)"
    ]
  },
  {
    "id": "arXiv:2107.05532",
    "title": "Context-aware virtual adversarial training for anatomically-plausible  segmentation",
    "abstract": " Comments: This paper is accepted at MICCAI2021 ",
    "url": "https://arxiv.org/abs/2107.05532",
    "authors": [
      "Ping Wang",
      "Jizong Peng",
      "Marco Pedersoli",
      "Yuanfeng Zhou",
      "Caiming Zhang",
      "Christian Desrosiers"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]