[
  {
    "id": "arXiv:2307.05517",
    "title": "Adaptive Graph Convolution Networks for Traffic Flow Forecasting",
    "abstract": "Traffic flow forecasting is a highly challenging task due to the dynamic spatial-temporal road conditions. Graph neural networks (GNN) has been widely applied in this task. However, most of these GNNs ignore the effects of time-varying road conditions due to the fixed range of the convolution receptive field. In this paper, we propose a novel Adaptive Graph Convolution Networks (AGC-net) to address this issue in GNN. The AGC-net is constructed by the Adaptive Graph Convolution (AGC) based on a novel context attention mechanism, which consists of a set of graph wavelets with various learnable scales. The AGC transforms the spatial graph representations into time-sensitive features considering the temporal context. Moreover, a shifted graph convolution kernel is designed to enhance the AGC, which attempts to correct the deviations caused by inaccurate topology. Experimental results on two public traffic datasets demonstrate the effectiveness of the AGC-net\\footnote{Code is available at: https://github.com/zhengdaoli/AGC-net} which outperforms other baseline models significantly. ",
    "url": "https://arxiv.org/abs/2307.05517",
    "authors": [
      "Zhengdao Li",
      "Wei Li",
      "Kai Hwang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05528",
    "title": "On Pseudolinear Codes for Correcting Adversarial Errors",
    "abstract": "We consider error-correction coding schemes for adversarial wiretap channels (AWTCs) in which the channel can a) read a fraction of the codeword bits up to a bound $r$ and b) flip a fraction of the bits up to a bound $p$. The channel can freely choose the locations of the bit reads and bit flips via a process with unbounded computational power. Codes for the AWTC are of broad interest in the area of information security, as they can provide data resiliency in settings where an attacker has limited access to a storage or transmission medium. We investigate a family of non-linear codes known as pseudolinear codes, which were first proposed by Guruswami and Indyk (FOCS 2001) for constructing list-decodable codes independent of the AWTC setting. Unlike general non-linear codes, pseudolinear codes admit efficient encoders and have succinct representations. We focus on unique decoding and show that random pseudolinear codes can achieve rates up to the binary symmetric channel (BSC) capacity $1-H_2(p)$ for any $p,r$ in the less noisy region: $p<1/2$ and $r<1-H_2(p)$ where $H_2(\\cdot)$ is the binary entropy function. Thus, pseudolinear codes are the first known optimal-rate binary code family for the less noisy AWTC that admit efficient encoders. The above result can be viewed as a derandomization result of random general codes in the AWTC setting, which in turn opens new avenues for applying derandomization techniques to randomized constructions of AWTC codes. Our proof applies a novel concentration inequality for sums of random variables with limited independence which may be of interest as an analysis tool more generally. ",
    "url": "https://arxiv.org/abs/2307.05528",
    "authors": [
      "Eric Ruzomberka",
      "Homa Nikbakht",
      "Christopher G. Brinton",
      "H. Vincent Poor"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2307.05537",
    "title": "NLP Meets RNA: Unsupervised Embedding Learning for Ribozymes with  Word2Vec",
    "abstract": "Ribozymes, RNA molecules with distinct 3D structures and catalytic activity, have widespread applications in synthetic biology and therapeutics. However, relatively little research has focused on leveraging deep learning to enhance our understanding of ribozymes. This study implements Word2Vec, an unsupervised learning technique for natural language processing, to learn ribozyme embeddings. Ribo2Vec was trained on over 9,000 diverse ribozymes, learning to map sequences to 128 and 256-dimensional vector spaces. Using Ribo2Vec, sequence embeddings for five classes of ribozymes (hatchet, pistol, hairpin, hovlinc, and twister sister) were calculated. Principal component analysis demonstrated the ability of these embeddings to distinguish between ribozyme classes. Furthermore, a simple SVM classifier trained on ribozyme embeddings showed promising results in accurately classifying ribozyme types. Our results suggest that the embedding vectors contained meaningful information about ribozymes. Interestingly, 256-dimensional embeddings behaved similarly to 128-dimensional embeddings, suggesting that a lower dimension vector space is generally sufficient to capture ribozyme features. This approach demonstrates the potential of Word2Vec for bioinformatics, opening new avenues for ribozyme research. Future research includes using a Transformer-based method to learn RNA embeddings, which can capture long-range interactions between nucleotides. ",
    "url": "https://arxiv.org/abs/2307.05537",
    "authors": [
      "Andrew Kean Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2307.05541",
    "title": "High Fidelity 3D Hand Shape Reconstruction via Scalable Graph Frequency  Decomposition",
    "abstract": "Despite the impressive performance obtained by recent single-image hand modeling techniques, they lack the capability to capture sufficient details of the 3D hand mesh. This deficiency greatly limits their applications when high-fidelity hand modeling is required, e.g., personalized hand modeling. To address this problem, we design a frequency split network to generate 3D hand mesh using different frequency bands in a coarse-to-fine manner. To capture high-frequency personalized details, we transform the 3D mesh into the frequency domain, and propose a novel frequency decomposition loss to supervise each frequency component. By leveraging such a coarse-to-fine scheme, hand details that correspond to the higher frequency domain can be preserved. In addition, the proposed network is scalable, and can stop the inference at any resolution level to accommodate different hardware with varying computational powers. To quantitatively evaluate the performance of our method in terms of recovering personalized shape details, we introduce a new evaluation metric named Mean Signal-to-Noise Ratio (MSNR) to measure the signal-to-noise ratio of each mesh frequency component. Extensive experiments demonstrate that our approach generates fine-grained details for high-fidelity 3D hand reconstruction, and our evaluation metric is more effective for measuring mesh details compared with traditional metrics. ",
    "url": "https://arxiv.org/abs/2307.05541",
    "authors": [
      "Tianyu Luan",
      "Yuanhao Zhai",
      "Jingjing Meng",
      "Zhong Li",
      "Zhang Chen",
      "Yi Xu",
      "Junsong Yuan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05547",
    "title": "Robust Routing Made Easy: Reinforcing Networks Against Non-Benign Faults",
    "abstract": "With the increasing scale of communication networks, the likelihood of failures grows as well. Since these networks form a critical backbone of our digital society, it is important that they rely on robust routing algorithms which ensure connectivity despite such failures. While most modern communication networks feature robust routing mechanisms, these mechanisms are often fairly complex to design and verify, as they need to account for the effects of failures and rerouting on communication. This paper conceptualizes the design of robust routing mechanisms, with the aim to avoid such complexity. In particular, we showcase \\emph{simple} and generic blackbox transformations that increase resilience of routing against independently distributed failures, which allows to simulate the routing scheme on the original network, even in the presence of non-benign node failures (henceforth called faults). This is attractive as the system specification and routing policy can simply be preserved. We present a scheme for constructing such a reinforced network, given an existing (synchronous) network and a routing scheme. We prove that this algorithm comes with small constant overheads, and only requires a minimal amount of additional node and edge resources; in fact, if the failure probability is smaller than $1/n$, the algorithm can come without any overhead at all. At the same time, it allows to tolerate a large number of independent random (node) faults, asymptotically almost surely. We complement our analytical results with simulations on different real-world topologies. ",
    "url": "https://arxiv.org/abs/2307.05547",
    "authors": [
      "Christoph Lenzen",
      "Moti Medina",
      "Mehrdad Saberi",
      "Stefan Schmid"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2307.05551",
    "title": "Graph Neural Network-enabled Terahertz-based Flow-guided Nanoscale  Localization",
    "abstract": "Scientific advancements in nanotechnology and advanced materials are paving the way toward nanoscale devices for in-body precision medicine; comprising integrated sensing, computing, communication, data and energy storage capabilities. In the human cardiovascular system, such devices are envisioned to be passively flowing and continuously sensing for detecting events of diagnostic interest. The diagnostic value of detecting such events can be enhanced by assigning to them their physical locations (e.g., body region), which is the main proposition of flow-guided localization. Current flow-guided localization approaches suffer from low localization accuracy and they are by-design unable to localize events within the entire cardiovascular system. Toward addressing this issue, we propose the utilization of Graph Neural Networks (GNNs) for this purpose, and demonstrate localization accuracy and coverage enhancements of our proposal over the existing State of the Art (SotA) approaches. Based on our evaluation, we provide several design guidelines for GNN-enabled flow-guided localization. ",
    "url": "https://arxiv.org/abs/2307.05551",
    "authors": [
      "Gerard Calvo Bartra",
      "Filip Lemic",
      "Sergi Abadal",
      "Xavier Costa Perez"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Emerging Technologies (cs.ET)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.05561",
    "title": "TransPose: A Transformer-based 6D Object Pose Estimation Network with  Depth Refinement",
    "abstract": "As demand for robotics manipulation application increases, accurate vision-based 6D pose estimation becomes essential for autonomous operations. Convolutional Neural Networks (CNNs) based approaches for pose estimation have been previously introduced. However, the quest for better performance still persists especially for accurate robotics manipulation. This quest extends to the Agri-robotics domain. In this paper, we propose TransPose, an improved Transformer-based 6D pose estimation with a depth refinement module. The architecture takes in only an RGB image as input with no additional supplementing modalities such as depth or thermal images. The architecture encompasses an innovative lighter depth estimation network that estimates depth from an RGB image using feature pyramid with an up-sampling method. A transformer-based detection network with additional prediction heads is proposed to directly regress the object's centre and predict the 6D pose of the target. A novel depth refinement module is then used alongside the predicted centers, 6D poses and depth patches to refine the accuracy of the estimated 6D pose. We extensively compared our results with other state-of-the-art methods and analysed our results for fruit-picking applications. The results we achieved show that our proposed technique outperforms the other methods available in the literature. ",
    "url": "https://arxiv.org/abs/2307.05561",
    "authors": [
      "Mahmoud Abdulsalam",
      "Nabil Aouf"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.05564",
    "title": "Augmenters at SemEval-2023 Task 1: Enhancing CLIP in Handling  Compositionality and Ambiguity for Zero-Shot Visual WSD through Prompt  Augmentation and Text-To-Image Diffusion",
    "abstract": "This paper describes our zero-shot approaches for the Visual Word Sense Disambiguation (VWSD) Task in English. Our preliminary study shows that the simple approach of matching candidate images with the phrase using CLIP suffers from the many-to-many nature of image-text pairs. We find that the CLIP text encoder may have limited abilities in capturing the compositionality in natural language. Conversely, the descriptive focus of the phrase varies from instance to instance. We address these issues in our two systems, Augment-CLIP and Stable Diffusion Sampling (SD Sampling). Augment-CLIP augments the text prompt by generating sentences that contain the context phrase with the help of large language models (LLMs). We further explore CLIP models in other languages, as the an ambiguous word may be translated into an unambiguous one in the other language. SD Sampling uses text-to-image Stable Diffusion to generate multiple images from the given phrase, increasing the likelihood that a subset of images match the one that paired with the text. ",
    "url": "https://arxiv.org/abs/2307.05564",
    "authors": [
      "Jie S. Li",
      "Yow-Ting Shiue",
      "Yong-Siang Shih",
      "Jonas Geiping"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.05578",
    "title": "Hate Speech Detection via Dual Contrastive Learning",
    "abstract": "The fast spread of hate speech on social media impacts the Internet environment and our society by increasing prejudice and hurting people. Detecting hate speech has aroused broad attention in the field of natural language processing. Although hate speech detection has been addressed in recent work, this task still faces two inherent unsolved challenges. The first challenge lies in the complex semantic information conveyed in hate speech, particularly the interference of insulting words in hate speech detection. The second challenge is the imbalanced distribution of hate speech and non-hate speech, which may significantly deteriorate the performance of models. To tackle these challenges, we propose a novel dual contrastive learning (DCL) framework for hate speech detection. Our framework jointly optimizes the self-supervised and the supervised contrastive learning loss for capturing span-level information beyond the token-level emotional semantics used in existing models, particularly detecting speech containing abusive and insulting words. Moreover, we integrate the focal loss into the dual contrastive learning framework to alleviate the problem of data imbalance. We conduct experiments on two publicly available English datasets, and experimental results show that the proposed model outperforms the state-of-the-art models and precisely detects hate speeches. ",
    "url": "https://arxiv.org/abs/2307.05578",
    "authors": [
      "Junyu Lu",
      "Hongfei Lin",
      "Xiaokun Zhang",
      "Zhaoqing Li",
      "Tongyue Zhang",
      "Linlin Zong",
      "Fenglong Ma",
      "Bo Xu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.05584",
    "title": "Code Generation for Machine Learning using Model-Driven Engineering and  SysML",
    "abstract": "Data-driven engineering refers to systematic data collection and processing using machine learning to improve engineering systems. Currently, the implementation of data-driven engineering relies on fundamental data science and software engineering skills. At the same time, model-based engineering is gaining relevance for the engineering of complex systems. In previous work, a model-based engineering approach integrating the formalization of machine learning tasks using the general-purpose modeling language SysML is presented. However, formalized machine learning tasks still require the implementation in a specialized programming languages like Python. Therefore, this work aims to facilitate the implementation of data-driven engineering in practice by extending the previous work of formalizing machine learning tasks by integrating model transformation to generate executable code. The method focuses on the modifiability and maintainability of the model transformation so that extensions and changes to the code generation can be integrated without requiring modifications to the code generator. The presented method is evaluated for feasibility in a case study to predict weather forecasts. Based thereon, quality attributes of model transformations are assessed and discussed. Results demonstrate the flexibility and the simplicity of the method reducing efforts for implementation. Further, the work builds a theoretical basis for standardizing data-driven engineering implementation in practice. ",
    "url": "https://arxiv.org/abs/2307.05584",
    "authors": [
      "Simon Raedler",
      "Matthias Rupp",
      "Eugen Rigger",
      "Stefanie Rinderle-Ma"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.05590",
    "title": "Improved Efficiency and Accuracy of the Magnetic Polarizability Tensor  Spectral Signature Object Characterisation for Metal Detection",
    "abstract": "Magnetic polarizability tensors (MPTs) provide an economical characterisation of conducting metallic objects and can aid in the solution of metal detection inverse problems, such as scrap metal sorting, searching for unexploded ordnance in areas of former conflict, and security screening at event venues and transport hubs. Previous work has established explicit formulae for their coefficients and a rigorous mathematical theory for the characterisation they provide. In order to assist with efficient computation of MPT spectral signatures of different objects to enable the construction of large dictionaries of characterisations for classification approaches, this work proposes a new, highly-efficient, strategy for predicting MPT coefficients. This is achieved by solving an eddy current type problem using hp-finite elements in combination with a proper orthogonal decomposition reduced order modelling (ROM) methodology and offers considerable computational savings over our previous approach. Furthermore, an adaptive approach is described for generating new frequency snapshots to further improve the accuracy of the ROM. To improve the resolution of highly conducting and magnetic objects, a recipe is proposed to choose the number and thicknesses of prismatic boundary layers for accurate resolution of thin skin depths in such problems. The paper includes a series of challenging examples to demonstrate the success of the proposed methodologies. ",
    "url": "https://arxiv.org/abs/2307.05590",
    "authors": [
      "James Elgy",
      "Paul D. Ledger"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2307.05605",
    "title": "A Novel Approach to Identify Security Controls in Source Code",
    "abstract": "Secure by Design has become the mainstream development approach ensuring that software systems are not vulnerable to cyberattacks. Architectural security controls need to be carefully monitored over the software development life cycle to avoid critical design flaws. Unfortunately, functional requirements usually get in the way of the security features, and the development team may not correctly address critical security requirements. Identifying tactic-related code pieces in a software project enables an efficient review of the security controls' implementation as well as a resilient software architecture. This paper enumerates a comprehensive list of commonly used security controls and creates a dataset for each one of them by pulling related and unrelated code snippets from the open API of the StackOverflow question and answer platform. It uses the state-of-the-art NLP technique Bidirectional Encoder Representations from Transformers (BERT) and the Tactic Detector from our prior work to show that code pieces that implement security controls could be identified with high confidence. The results show that our model trained on tactic-related and unrelated code snippets derived from StackOverflow is able to identify tactic-related code pieces with F-Measure values above 0.9. ",
    "url": "https://arxiv.org/abs/2307.05605",
    "authors": [
      "Ahmet Okutan",
      "Ali Shokri",
      "Viktoria Koscinski",
      "Mohamad Fazelinia",
      "Mehdi Mirakhorli"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2307.05608",
    "title": "RényiTester: A Variational Approach to Testing Differential Privacy",
    "abstract": "Governments and industries have widely adopted differential privacy as a measure to protect users' sensitive data, creating the need for new implementations of differentially private algorithms. In order to properly test and audit these algorithms, a suite of tools for testing the property of differential privacy is needed. In this work we expand this testing suite and introduce R\\'enyiTester, an algorithm that can verify if a mechanism is R\\'enyi differentially private. Our algorithm computes computes a lower bound of the R\\'enyi divergence between the distributions of a mechanism on neighboring datasets, only requiring black-box access to samples from the audited mechanism. We test this approach on a variety of pure and R\\'enyi differentially private mechanisms with diverse output spaces and show that R\\'enyiTester detects bugs in mechanisms' implementations and design flaws. While detecting that a general mechanism is differentially private is known to be NP hard, we empirically show that tools like R\\'enyiTester provide a way for researchers and engineers to decrease the risk of deploying mechanisms that expose users' privacy. ",
    "url": "https://arxiv.org/abs/2307.05608",
    "authors": [
      "William Kong",
      "Andrés Muñoz Medina",
      "Mónica Ribero"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.05609",
    "title": "Virtual Network Embedding without Explicit Virtual Network Specification",
    "abstract": "Network virtualization enables Internet service providers to run multiple heterogeneous and dedicated network architectures for different customers on a shared substrate. In existing works on virtual network embedding (VNE), each customer formulates a virtual network request (VNR) where a virtual network (VN) is required. Motivated by a concrete example where VN is not a proper VNR formulation to reflect the traffic demand of a customer, we propose a new VNR formulation described by the traffic demand between several access node pairs to complement the existing VNR formulation. Moreover, three different groups of VNE variants are systematically examined. Simulations demonstrate that shared channel embedding, as a new embedding variant under the proposed VNR formulation, improves the acceptance rate and reduces cost and link utility compared to traditional independent channel embedding. ",
    "url": "https://arxiv.org/abs/2307.05609",
    "authors": [
      "Jiangnan Cheng",
      "Yingjie Bi",
      "Ao Tang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.05610",
    "title": "Substance or Style: What Does Your Image Embedding Know?",
    "abstract": "Probes are small networks that predict properties of underlying data from embeddings, and they provide a targeted, effective way to illuminate the information contained in embeddings. While analysis through the use of probes has become standard in NLP, there has been much less exploration in vision. Image foundation models have primarily been evaluated for semantic content. Better understanding the non-semantic information in popular embeddings (e.g., MAE, SimCLR, or CLIP) will shed new light both on the training algorithms and on the uses for these foundation models. We design a systematic transformation prediction task and measure the visual content of embeddings along many axes, including image style, quality, and a range of natural and artificial transformations. Surprisingly, six embeddings (including SimCLR) encode enough non-semantic information to identify dozens of transformations. We also consider a generalization task, where we group similar transformations and hold out several for testing. We find that image-text models (CLIP and ALIGN) are better at recognizing new examples of style transfer than masking-based models (CAN and MAE). Overall, our results suggest that the choice of pre-training algorithm impacts the types of information in the embedding, and certain models are better than others for non-semantic downstream tasks. ",
    "url": "https://arxiv.org/abs/2307.05610",
    "authors": [
      "Cyrus Rashtchian",
      "Charles Herrmann",
      "Chun-Sung Ferng",
      "Ayan Chakrabarti",
      "Dilip Krishnan",
      "Deqing Sun",
      "Da-Cheng Juan",
      "Andrew Tomkins"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05624",
    "title": "CILF:Causality Inspired Learning Framework for Out-of-Distribution  Vehicle Trajectory Prediction",
    "abstract": "Trajectory prediction is critical for autonomous driving vehicles. Most existing methods tend to model the correlation between history trajectory (input) and future trajectory (output). Since correlation is just a superficial description of reality, these methods rely heavily on the i.i.d. assumption and evince a heightened susceptibility to out-of-distribution data. To address this problem, we propose an Out-of- Distribution Causal Graph (OOD-CG), which explicitly defines the underlying causal structure of the data with three entangled latent features: 1) domain-invariant causal feature (IC), 2) domain-variant causal feature (VC), and 3) domain-variant non-causal feature (VN ). While these features are confounded by confounder (C) and domain selector (D). To leverage causal features for prediction, we propose a Causal Inspired Learning Framework (CILF), which includes three steps: 1) extracting domain-invariant causal feature by means of an invariance loss, 2) extracting domain variant feature by domain contrastive learning, and 3) separating domain-variant causal and non-causal feature by encouraging causal sufficiency. We evaluate the performance of CILF in different vehicle trajectory prediction models on the mainstream datasets NGSIM and INTERACTION. Experiments show promising improvements in CILF on domain generalization. ",
    "url": "https://arxiv.org/abs/2307.05624",
    "authors": [
      "Shengyi Li",
      "Qifan Xue",
      "Yezhuo Zhang",
      "Xuanpeng Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.05627",
    "title": "Separate-and-Aggregate: A Transformer-based Patch Refinement Model for  Knowledge Graph Completion",
    "abstract": "Knowledge graph completion (KGC) is the task of inferencing missing facts from any given knowledge graphs (KG). Previous KGC methods typically represent knowledge graph entities and relations as trainable continuous embeddings and fuse the embeddings of the entity $h$ (or $t$) and relation $r$ into hidden representations of query $(h, r, ?)$ (or $(?, r, t$)) to approximate the missing entities. To achieve this, they either use shallow linear transformations or deep convolutional modules. However, the linear transformations suffer from the expressiveness issue while the deep convolutional modules introduce unnecessary inductive bias, which could potentially degrade the model performance. Thus, we propose a novel Transformer-based Patch Refinement Model (PatReFormer) for KGC. PatReFormer first segments the embedding into a sequence of patches and then employs cross-attention modules to allow bi-directional embedding feature interaction between the entities and relations, leading to a better understanding of the underlying KG. We conduct experiments on four popular KGC benchmarks, WN18RR, FB15k-237, YAGO37 and DB100K. The experimental results show significant performance improvement from existing KGC methods on standard KGC evaluation metrics, e.g., MRR and H@n. Our analysis first verifies the effectiveness of our model design choices in PatReFormer. We then find that PatReFormer can better capture KG information from a large relation embedding dimension. Finally, we demonstrate that the strength of PatReFormer is at complex relation types, compared to other KGC models ",
    "url": "https://arxiv.org/abs/2307.05627",
    "authors": [
      "Chen Chen",
      "Yufei Wang",
      "Yang Zhang",
      "Quan Z. Sheng",
      "Kwok-Yan Lam"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.05631",
    "title": "Causal Kripke Models",
    "abstract": "This work extends Halpern and Pearl's causal models for actual causality to a possible world semantics environment. Using this framework we introduce a logic of actual causality with modal operators, which allows for reasoning about causality in scenarios involving multiple possibilities, temporality, knowledge and uncertainty. We illustrate this with a number of examples, and conclude by discussing some future directions for research. ",
    "url": "https://arxiv.org/abs/2307.05631",
    "authors": [
      "Yiwen Ding",
      "Krishna Manoorkar",
      "Apostolos Tzimoulis",
      "Ruoding Wang",
      "Xiaolong Wang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2307.05633",
    "title": "Transaction Fraud Detection via an Adaptive Graph Neural Network",
    "abstract": "Many machine learning methods have been proposed to achieve accurate transaction fraud detection, which is essential to the financial security of individuals and banks. However, most existing methods leverage original features only or require manual feature engineering. They lack the ability to learn discriminative representations from transaction data. Moreover, criminals often commit fraud by imitating cardholders' behaviors, which causes the poor performance of existing detection models. In this paper, we propose an Adaptive Sampling and Aggregation-based Graph Neural Network (ASA-GNN) that learns discriminative representations to improve the performance of transaction fraud detection. A neighbor sampling strategy is performed to filter noisy nodes and supplement information for fraudulent nodes. Specifically, we leverage cosine similarity and edge weights to adaptively select neighbors with similar behavior patterns for target nodes and then find multi-hop neighbors for fraudulent nodes. A neighbor diversity metric is designed by calculating the entropy among neighbors to tackle the camouflage issue of fraudsters and explicitly alleviate the over-smoothing phenomena. Extensive experiments on three real financial datasets demonstrate that the proposed method ASA-GNN outperforms state-of-the-art ones. ",
    "url": "https://arxiv.org/abs/2307.05633",
    "authors": [
      "Yue Tian",
      "Guanjun Liu",
      "Jiacun Wang",
      "Mengchu Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05634",
    "title": "Hyperspherical Embedding for Point Cloud Completion",
    "abstract": "Most real-world 3D measurements from depth sensors are incomplete, and to address this issue the point cloud completion task aims to predict the complete shapes of objects from partial observations. Previous works often adapt an encoder-decoder architecture, where the encoder is trained to extract embeddings that are used as inputs to generate predictions from the decoder. However, the learned embeddings have sparse distribution in the feature space, which leads to worse generalization results during testing. To address these problems, this paper proposes a hyperspherical module, which transforms and normalizes embeddings from the encoder to be on a unit hypersphere. With the proposed module, the magnitude and direction of the output hyperspherical embedding are decoupled and only the directional information is optimized. We theoretically analyze the hyperspherical embedding and show that it enables more stable training with a wider range of learning rates and more compact embedding distributions. Experiment results show consistent improvement of point cloud completion in both single-task and multi-task learning, which demonstrates the effectiveness of the proposed method. ",
    "url": "https://arxiv.org/abs/2307.05634",
    "authors": [
      "Junming Zhang",
      "Haomeng Zhang",
      "Ram Vasudevan",
      "Matthew Johnson-Roberson"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05635",
    "title": "Fundamental limits of overparametrized shallow neural networks for  supervised learning",
    "abstract": "We carry out an information-theoretical analysis of a two-layer neural network trained from input-output pairs generated by a teacher network with matching architecture, in overparametrized regimes. Our results come in the form of bounds relating i) the mutual information between training data and network weights, or ii) the Bayes-optimal generalization error, to the same quantities but for a simpler (generalized) linear model for which explicit expressions are rigorously known. Our bounds, which are expressed in terms of the number of training samples, input dimension and number of hidden units, thus yield fundamental performance limits for any neural network (and actually any learning procedure) trained from limited data generated according to our two-layer teacher neural network model. The proof relies on rigorous tools from spin glasses and is guided by ``Gaussian equivalence principles'' lying at the core of numerous recent analyses of neural networks. With respect to the existing literature, which is either non-rigorous or restricted to the case of the learning of the readout weights only, our results are information-theoretic (i.e. are not specific to any learning algorithm) and, importantly, cover a setting where all the network parameters are trained. ",
    "url": "https://arxiv.org/abs/2307.05635",
    "authors": [
      "Francesco Camilli",
      "Daria Tieplova",
      "Jean Barbier"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Information Theory (cs.IT)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2307.05638",
    "title": "A Comprehensive Survey of Deep Transfer Learning for Anomaly Detection  in Industrial Time Series: Methods, Applications, and Directions",
    "abstract": "Automating the monitoring of industrial processes has the potential to enhance efficiency and optimize quality by promptly detecting abnormal events and thus facilitating timely interventions. Deep learning, with its capacity to discern non-trivial patterns within large datasets, plays a pivotal role in this process. Standard deep learning methods are suitable to solve a specific task given a specific type of data. During training, the algorithms demand large volumes of labeled training data. However, due to the dynamic nature of processes and the environment, it is impractical to acquire the needed data for standard deep learning training for every slightly different case anew. Deep transfer learning offers a solution to this problem. By leveraging knowledge from related tasks and accounting for variations in data distributions, this learning framework solves new tasks even with little or no additional labeled data. The approach bypasses the need to retrain a model from scratch for every new setup and dramatically reduces the labeled data requirement. This survey provides an in-depth review of deep transfer learning, examining the problem settings of transfer learning and classifying the prevailing deep transfer learning methods. Moreover, we delve into applying deep transfer learning in the context of a broad spectrum of time series anomaly detection tasks prevalent in primary industrial domains, e.g., manufacturing process monitoring, predictive maintenance, energy management, and infrastructure facility monitoring. We conclude this survey by underlining the challenges and limitations of deep transfer learning in industrial contexts. We also provide practical directions for solution design and implementation for these tasks, leading to specific, actionable suggestions. ",
    "url": "https://arxiv.org/abs/2307.05638",
    "authors": [
      "Peng Yan",
      "Ahmed Abdulkadir",
      "Matthias Rosenthal",
      "Gerrit A. Schatte",
      "Benjamin F. Grewe",
      "Thilo Stadelmann"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.05639",
    "title": "Learning Active Subspaces and Discovering Important Features with  Gaussian Radial Basis Functions Neural Networks",
    "abstract": "Providing a model that achieves a strong predictive performance and at the same time is interpretable by humans is one of the most difficult challenges in machine learning research due to the conflicting nature of these two objectives. To address this challenge, we propose a modification of the Radial Basis Function Neural Network model by equipping its Gaussian kernel with a learnable precision matrix. We show that precious information is contained in the spectrum of the precision matrix that can be extracted once the training of the model is completed. In particular, the eigenvectors explain the directions of maximum sensitivity of the model revealing the active subspace and suggesting potential applications for supervised dimensionality reduction. At the same time, the eigenvectors highlight the relationship in terms of absolute variation between the input and the latent variables, thereby allowing us to extract a ranking of the input variables based on their importance to the prediction task enhancing the model interpretability. We conducted numerical experiments for regression, classification, and feature selection tasks, comparing our model against popular machine learning models and the state-of-the-art deep learning-based embedding feature selection techniques. Our results demonstrate that the proposed model does not only yield an attractive prediction performance with respect to the competitors but also provides meaningful and interpretable results that potentially could assist the decision-making process in real-world applications. A PyTorch implementation of the model is available on GitHub at the following link. https://github.com/dannyzx/GRBF-NNs ",
    "url": "https://arxiv.org/abs/2307.05639",
    "authors": [
      "Danny D'Agostino",
      "Ilija Ilievski",
      "Christine Annette Shoemaker"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.05648",
    "title": "Image-Processing Based Methods to Improve the Robustness of Robotic  Gripping",
    "abstract": "Image processing techniques have huge impact on most fields of robotics and industrial automation. Real time methods are usually employed in complex automation tasks, assisting with decision making or directly guiding robots and machinery, while post-processing is usually used for retrospective assessment of systems and processes. While artificial intelligence based image processing algorithms (usually neural networks) are more common nowadays, classical methods can also be used effectively even in modern applications. This paper focuses on optical flow based image processing, proving its efficiency by presenting optical flow based solutions for modern challenges in different fields of robotics such as robotic surgery and food industry automation. The main subject of the paper is a smart robotic gripper designed for automated robot cells in the meat industry, that is capable of slip detection and secure gripping of soft, slippery tissues with the help of the implemented optical flow based algorithm. ",
    "url": "https://arxiv.org/abs/2307.05648",
    "authors": [
      "Kristóf Takács",
      "Renáta Nagyné Elek",
      "Tamás Haidegger"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2307.05704",
    "title": "A Causal Ordering Prior for Unsupervised Representation Learning",
    "abstract": "Unsupervised representation learning with variational inference relies heavily on independence assumptions over latent variables. Causal representation learning (CRL), however, argues that factors of variation in a dataset are, in fact, causally related. Allowing latent variables to be correlated, as a consequence of causal relationships, is more realistic and generalisable. So far, provably identifiable methods rely on: auxiliary information, weak labels, and interventional or even counterfactual data. Inspired by causal discovery with functional causal models, we propose a fully unsupervised representation learning method that considers a data generation process with a latent additive noise model (ANM). We encourage the latent space to follow a causal ordering via loss function based on the Hessian of the latent distribution. ",
    "url": "https://arxiv.org/abs/2307.05704",
    "authors": [
      "Avinash Kori",
      "Pedro Sanchez",
      "Konstantinos Vilouras",
      "Ben Glocker",
      "Sotirios A. Tsaftaris"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05722",
    "title": "Exploring Large Language Model for Graph Data Understanding in Online  Job Recommendations",
    "abstract": "Large Language Models (LLMs) have revolutionized natural language processing tasks, demonstrating their exceptional capabilities in various domains. However, their potential for behavior graph understanding in job recommendations remains largely unexplored. This paper focuses on unveiling the capability of large language models in understanding behavior graphs and leveraging this understanding to enhance recommendations in online recruitment, including the promotion of out-of-distribution (OOD) application. We present a novel framework that harnesses the rich contextual information and semantic representations provided by large language models to analyze behavior graphs and uncover underlying patterns and relationships. Specifically, we propose a meta-path prompt constructor that leverages LLM recommender to understand behavior graphs for the first time and design a corresponding path augmentation module to alleviate the prompt bias introduced by path-based sequence input. By leveraging this capability, our framework enables personalized and accurate job recommendations for individual users. We evaluate the effectiveness of our approach on a comprehensive dataset and demonstrate its ability to improve the relevance and quality of recommended quality. This research not only sheds light on the untapped potential of large language models but also provides valuable insights for developing advanced recommendation systems in the recruitment market. The findings contribute to the growing field of natural language processing and offer practical implications for enhancing job search experiences. ",
    "url": "https://arxiv.org/abs/2307.05722",
    "authors": [
      "Likang Wu",
      "Zhaopeng Qiu",
      "Zhi Zheng",
      "Hengshu Zhu",
      "Enhong Chen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2307.05727",
    "title": "An Open-Source Knowledge Graph Ecosystem for the Life Sciences",
    "abstract": "Translational research requires data at multiple scales of biological organization. Advancements in sequencing and multi-omics technologies have increased the availability of these data but researchers face significant integration challenges. Knowledge graphs (KGs) are used to model complex phenomena, and methods exist to automatically construct them. However, tackling complex biomedical integration problems requires flexibility in the way knowledge is modeled. Moreover, existing KG construction methods provide robust tooling at the cost of fixed or limited choices among knowledge representation models. PheKnowLator (Phenotype Knowledge Translator) is a semantic ecosystem for automating the FAIR (Findable, Accessible, Interoperable, and Reusable) construction of ontologically grounded KGs with fully customizable knowledge representation. The ecosystem includes KG construction resources (e.g., data preparation APIs), analysis tools (e.g., SPARQL endpoints and abstraction algorithms), and benchmarks (e.g., prebuilt KGs and embeddings). We evaluate the ecosystem by surveying open-source KG construction methods and analyzing its computational performance when constructing 12 large-scale KGs. With flexible knowledge representation, PheKnowLator enables fully customizable KGs without compromising performance or usability. ",
    "url": "https://arxiv.org/abs/2307.05727",
    "authors": [
      "Tiffany J. Callahan",
      "Ignacio J. Tripodi",
      "Adrianne L. Stefanski",
      "Luca Cappelletti",
      "Sanya B. Taneja",
      "Jordan M. Wyrwa",
      "Elena Casiraghi",
      "Nicolas A. Matentzoglu",
      "Justin Reese",
      "Jonathan C. Silverstein",
      "Charles Tapley Hoyt",
      "Richard D. Boyce",
      "Scott A. Malec",
      "Deepak R. Unni",
      "Marcin P. Joachimiak",
      "Peter N. Robinson",
      "Christopher J. Mungall",
      "Emanuele Cavalleri",
      "Tommaso Fontana",
      "Giorgio Valentini",
      "Marco Mesiti",
      "Lucas A. Gillenwater",
      "Brook Santangelo",
      "Nicole A. Vasilevsky",
      "Robert Hoehndorf",
      "Tellen D. Bennett",
      "Patrick B. Ryan",
      "George Hripcsak",
      "Michael G. Kahn",
      "Michael Bada",
      "William A. Baumgartner Jr",
      "Lawrence E. Hunter"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2307.05740",
    "title": "Minimum Cost Loop Nests for Contraction of a Sparse Tensor with a Tensor  Network",
    "abstract": "Sparse tensor decomposition and completion are common in numerous applications, ranging from machine learning to computational quantum chemistry. Typically, the main bottleneck in optimization of these models are contractions of a single large sparse tensor with a network of several dense matrices or tensors (SpTTN). Prior works on high-performance tensor decomposition and completion have focused on performance and scalability optimizations for specific SpTTN kernels. We present algorithms and a runtime system for identifying and executing the most efficient loop nest for any SpTTN kernel. We consider both enumeration of such loop nests for autotuning and efficient algorithms for finding the lowest cost loop-nest for simpler metrics, such as buffer size or cache miss models. Our runtime system identifies the best choice of loop nest without user guidance, and also provides a distributed-memory parallelization of SpTTN kernels. We evaluate our framework using both real-world and synthetic tensors. Our results demonstrate that our approach outperforms available generalized state-of-the-art libraries and matches the performance of specialized codes. ",
    "url": "https://arxiv.org/abs/2307.05740",
    "authors": [
      "Raghavendra Kanakagiri",
      "Edgar Solomonik"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Mathematical Software (cs.MS)",
      "Performance (cs.PF)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2307.05741",
    "title": "Towards Robust and Efficient Continual Language Learning",
    "abstract": "As the application space of language models continues to evolve, a natural question to ask is how we can quickly adapt models to new tasks. We approach this classic question from a continual learning perspective, in which we aim to continue fine-tuning models trained on past tasks on new tasks, with the goal of \"transferring\" relevant knowledge. However, this strategy also runs the risk of doing more harm than good, i.e., negative transfer. In this paper, we construct a new benchmark of task sequences that target different possible transfer scenarios one might face, such as a sequence of tasks with high potential of positive transfer, high potential for negative transfer, no expected effect, or a mixture of each. An ideal learner should be able to maximally exploit information from all tasks that have any potential for positive transfer, while also avoiding the negative effects of any distracting tasks that may confuse it. We then propose a simple, yet effective, learner that satisfies many of our desiderata simply by leveraging a selective strategy for initializing new models from past task checkpoints. Still, limitations remain, and we hope this benchmark can help the community to further build and analyze such learners. ",
    "url": "https://arxiv.org/abs/2307.05741",
    "authors": [
      "Adam Fisch",
      "Amal Rannen-Triki",
      "Razvan Pascanu",
      "Jörg Bornschein",
      "Angeliki Lazaridou",
      "Elena Gribovskaya",
      "Marc'Aurelio Ranzato"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.05758",
    "title": "Formal and Fuzzing Amplification: Targeting Vulnerability Detection in  5G and Beyond",
    "abstract": "Softwarization and virtualization in 5G and beyond require rigorous testing against vulnerabilities and unintended emergent behaviors for critical infrastructure and network security assurance. Formal methods operates efficiently in protocol-level abstract specification models, and fuzz testing offers comprehensive experimental evaluation of system implementations. In this paper, we propose a novel framework that leverages the respective advantages and coverage of both formal and fuzzing methods to efficiently detect vulnerabilities from protocol logic to implementation stacks hierarchically. The detected attack traces from the formal verification results in critical protocols guide the case generation of fuzz testing, and the feedbacks from fuzz testing further broaden the scope of the formal verification. We examine the proposed framework with the 5G Non Standard-Alone (NSA) security processes, focusing on the Radio Resource Control (RRC) connection process. We first identify protocol-level vulnerabilities of user credentials via formal methods. Following this, we implement bit-level fuzzing to evaluate potential impacts and risks of integrity-vulnerable identifier variation. Concurrently, we conduct command-level mutation-based fuzzing by fixing the assumption identifier to assess the potential impacts and risks of confidentiality-vulnerable identifiers. During this approach, we established 1 attack model and detected 53 vulnerabilities. The vulnerabilities identified used to fortify protocol-level assumptions could further refine search space for the following detection cycles. Consequently, it addresses the prevalent scalability challenges in detecting vulnerabilities and unintended emergent behaviors in large-scale systems in 5G and beyond. ",
    "url": "https://arxiv.org/abs/2307.05758",
    "authors": [
      "Jingda Yang",
      "Ying Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.05760",
    "title": "Line Art Colorization of Fakemon using Generative Adversarial Neural  Networks",
    "abstract": "This work proposes a complete methodology to colorize images of Fakemon, anime-style monster-like creatures. In addition, we propose algorithms to extract the line art from colorized images as well as to extract color hints. Our work is the first in the literature to use automatic color hint extraction, to train the networks specifically with anime-styled creatures and to combine the Pix2Pix and CycleGAN approaches, two different generative adversarial networks that create a single final result. Visual results of the colorizations are feasible but there is still room for improvement. ",
    "url": "https://arxiv.org/abs/2307.05760",
    "authors": [
      "Erick Oliveira Rodrigues",
      "Esteban Clua",
      "Giovani Bernardes Vitor"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05772",
    "title": "Random-Set Convolutional Neural Network (RS-CNN) for Epistemic Deep  Learning",
    "abstract": "Machine learning is increasingly deployed in safety-critical domains where robustness against adversarial attacks is crucial and erroneous predictions could lead to potentially catastrophic consequences. This highlights the need for learning systems to be equipped with the means to determine a model's confidence in its prediction and the epistemic uncertainty associated with it, 'to know when a model does not know'. In this paper, we propose a novel Random-Set Convolutional Neural Network (RS-CNN) for classification which predicts belief functions rather than probability vectors over the set of classes, using the mathematics of random sets, i.e., distributions over the power set of the sample space. Based on the epistemic deep learning approach, random-set models are capable of representing the 'epistemic' uncertainty induced in machine learning by limited training sets. We estimate epistemic uncertainty by approximating the size of credal sets associated with the predicted belief functions, and experimentally demonstrate how our approach outperforms competing uncertainty-aware approaches in a classical evaluation setting. The performance of RS-CNN is best demonstrated on OOD samples where it manages to capture the true prediction while standard CNNs fail. ",
    "url": "https://arxiv.org/abs/2307.05772",
    "authors": [
      "Shireen Kudukkil Manchingal",
      "Muhammad Mubashar",
      "Kaizheng Wang",
      "Keivan Shariatmadar",
      "Fabio Cuzzolin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.05779",
    "title": "Neural Machine Translation Data Generation and Augmentation using  ChatGPT",
    "abstract": "Neural models have revolutionized the field of machine translation, but creating parallel corpora is expensive and time-consuming. We investigate an alternative to manual parallel corpora - hallucinated parallel corpora created by generative language models. Although these models are themselves trained on parallel data, they can leverage a multilingual vector space to create data, and may be able to supplement small manually-procured corpora. Our experiments highlight two key findings - despite a lack of diversity in their output, the hallucinated data improves the translation signal, even when the domain clashes with the original dataset. ",
    "url": "https://arxiv.org/abs/2307.05779",
    "authors": [
      "Wayne Yang",
      "Garrett Nicolai"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.05780",
    "title": "Automated Artifact Detection in Ultra-widefield Fundus Photography of  Patients with Sickle Cell Disease",
    "abstract": "Importance: Ultra-widefield fundus photography (UWF-FP) has shown utility in sickle cell retinopathy screening; however, image artifact may diminish quality and gradeability of images. Objective: To create an automated algorithm for UWF-FP artifact classification. Design: A neural network based automated artifact detection algorithm was designed to identify commonly encountered UWF-FP artifacts in a cross section of patient UWF-FP. A pre-trained ResNet-50 neural network was trained on a subset of the images and the classification accuracy, sensitivity, and specificity were quantified on the hold out test set. Setting: The study is based on patients from a tertiary care hospital site. Participants: There were 243 UWF-FP acquired from patients with sickle cell disease (SCD), and artifact labelling in the following categories was performed: Eyelash Present, Lower Eyelid Obstructing, Upper Eyelid Obstructing, Image Too Dark, Dark Artifact, and Image Not Centered. Results: Overall, the accuracy for each class was Eyelash Present at 83.7%, Lower Eyelid Obstructing at 83.7%, Upper Eyelid Obstructing at 98.0%, Image Too Dark at 77.6%, Dark Artifact at 93.9%, and Image Not Centered at 91.8%. Conclusions and Relevance: This automated algorithm shows promise in identifying common imaging artifacts on a subset of Optos UWF-FP in SCD patients. Further refinement is ongoing with the goal of improving efficiency of tele-retinal screening in sickle cell retinopathy (SCR) by providing a photographer real-time feedback as to the types of artifacts present, and the need for image re-acquisition. This algorithm also may have potential future applicability in other retinal diseases by improving quality and efficiency of image acquisition of UWF-FP. ",
    "url": "https://arxiv.org/abs/2307.05780",
    "authors": [
      "Anqi Feng",
      "Dimitri Johnson",
      "Grace R. Reilly",
      "Loka Thangamathesvaran",
      "Ann Nampomba",
      "Mathias Unberath",
      "Adrienne W. Scott",
      "Craig Jones"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05786",
    "title": "Merging multiple input descriptors and supervisors in a deep neural  network for tractogram filtering",
    "abstract": "One of the main issues of the current tractography methods is their high false-positive rate. Tractogram filtering is an option to remove false-positive streamlines from tractography data in a post-processing step. In this paper, we train a deep neural network for filtering tractography data in which every streamline of a tractogram is classified as {\\em plausible, implausible}, or {\\em inconclusive}. For this, we use four different tractogram filtering strategies as supervisors: TractQuerier, RecobundlesX, TractSeg, and an anatomy-inspired filter. Their outputs are combined to obtain the classification labels for the streamlines. We assessed the importance of different types of information along the streamlines for performing this classification task, including the coordinates of the streamlines, diffusion data, landmarks, T1-weighted information, and a brain parcellation. We found that the streamline coordinates are the most relevant followed by the diffusion data in this particular classification task. ",
    "url": "https://arxiv.org/abs/2307.05786",
    "authors": [
      "Daniel Jörgens",
      "Pierre-Marc Jodoin",
      "Maxime Descoteaux",
      "Rodrigo Moreno"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.05796",
    "title": "Improved POS tagging for spontaneous, clinical speech using data  augmentation",
    "abstract": "This paper addresses the problem of improving POS tagging of transcripts of speech from clinical populations. In contrast to prior work on parsing and POS tagging of transcribed speech, we do not make use of an in domain treebank for training. Instead, we train on an out of domain treebank of newswire using data augmentation techniques to make these structures resemble natural, spontaneous speech. We trained a parser with and without the augmented data and tested its performance using manually validated POS tags in clinical speech produced by patients with various types of neurodegenerative conditions. ",
    "url": "https://arxiv.org/abs/2307.05796",
    "authors": [
      "Seth Kulick",
      "Neville Ryant",
      "David J. Irwin",
      "Naomi Nevler",
      "Sunghye Cho"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.05809",
    "title": "Excitements and Concerns in the Post-ChatGPT Era: Deciphering Public  Perception of AI through Social Media Analysis",
    "abstract": "As AI systems become increasingly prevalent in various aspects of daily life, gaining a comprehensive understanding of public perception towards these AI systems has become increasingly essential for several reasons such as ethical considerations, user experience, fear, disinformation, regulation, collaboration, and co-creation. In this study, we investigate how mass social media users perceive the recent rise of AI frameworks such as ChatGPT. We collect a total of 33,912 comments in 388 unique subreddits spanning from November 30, 2022 to June 8, 2023 using a list of AI-related keywords. We employ BERTopic to uncover the major themes regarding AI on Reddit. Additionally, we seek to gain deeper insights into public opinion by examining the distribution of topics across different subreddits. We observe that technology-related subreddits predominantly focus on the technical aspects of AI models. On the other hand, non-tech subreddits show greater interest in social issues such as concerns about job replacement or furlough. We leverage zero-shot prompting to analyze the sentiment and perception of AI among individual users. Through a comprehensive sentiment and emotion analysis, we discover that tech-centric communities exhibit greater polarization compared to non-tech communities when discussing AI topics. This research contributes to our broader understanding of public opinion surrounding artificial intelligence. ",
    "url": "https://arxiv.org/abs/2307.05809",
    "authors": [
      "Weihong Qi",
      "Jinsheng Pan",
      "Hanjia Lyu",
      "Jiebo Luo"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2307.05815",
    "title": "ObNoCs: Protecting Network-on-Chip Fabrics Against Reverse-Engineering  Attacks",
    "abstract": "Modern System-on-Chip designs typically use Network-on-Chip (NoC) fabrics to implement coordination among integrated hardware blocks. An important class of security vulnerabilities involves a rogue foundry reverse-engineering the NoC topology and routing logic. In this paper, we develop an infrastructure, $\\obnocs$, for protecting NoC fabrics against such attacks. $\\obnocs$ systematically replaces router connections with switches that can be programmed after fabrication to induce the desired topology. Our approach provides provable redaction of NoC functionality: switch configurations induce a large number of legal topologies, only one of which corresponds to the intended topology. We implement the $\\obnocs$ methodology on Intel Quartus\\texttrademark\\ Platform, and experimental results on realistic SoC designs show that the architecture incurs minimal overhead in power, resource utilization, and system latency. ",
    "url": "https://arxiv.org/abs/2307.05815",
    "authors": [
      "Dipal Halder",
      "Maneesh Merugu",
      "Sandip Ray"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2307.05827",
    "title": "Relational Extraction on Wikipedia Tables using Convolutional and Memory  Networks",
    "abstract": "Relation extraction (RE) is the task of extracting relations between entities in text. Most RE methods extract relations from free-form running text and leave out other rich data sources, such as tables. We explore RE from the perspective of applying neural methods on tabularly organized data. We introduce a new model consisting of Convolutional Neural Network (CNN) and Bidirectional-Long Short Term Memory (BiLSTM) network to encode entities and learn dependencies among them, respectively. We evaluate our model on a large and recent dataset and compare results with previous neural methods. Experimental results show that our model consistently outperforms the previous model for the task of relation extraction on tabular data. We perform comprehensive error analyses and ablation study to show the contribution of various components of our model. Finally, we discuss the usefulness and trade-offs of our approach, and provide suggestions for fostering further research. ",
    "url": "https://arxiv.org/abs/2307.05827",
    "authors": [
      "Arif Shahriar",
      "Rohan Saha",
      "Denilson Barbosa"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05828",
    "title": "List Privacy Under Function Recoverability",
    "abstract": "For a given function of user data, a querier must recover with at least a prescribed probability, the value of the function based on a user-provided query response. Subject to this requirement, the user forms the query response so as to minimize the likelihood of the querier guessing a list of prescribed size to which the data value belongs based on the query response. We obtain a general converse upper bound for the maximum list privacy which is shown to be tight for the special case of a binary-valued function through an explicit achievability scheme for the query response. ",
    "url": "https://arxiv.org/abs/2307.05828",
    "authors": [
      "Ajaykrishnan Nageswaran",
      "Prakash Narayan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2307.05829",
    "title": "Distance-Preserving Graph Compression Techniques",
    "abstract": "We study the problem of distance-preserving graph compression for weighted paths and trees. The problem entails a weighted graph $G = (V, E)$ with non-negative weights, and a subset of edges $E^{\\prime} \\subset E$ which needs to be removed from G (with their endpoints merged as a supernode). The goal is to redistribute the weights of the deleted edges in a way that minimizes the error. The error is defined as the sum of the absolute differences of the shortest path lengths between different pairs of nodes before and after contracting $E^{\\prime}$. Based on this error function, we propose optimal approaches for merging any subset of edges in a path and a single edge in a tree. Previous works on graph compression techniques aimed at preserving different graph properties (such as the chromatic number) or solely focused on identifying the optimal set of edges to contract. However, our focus in this paper is on achieving optimal edge contraction (when the contracted edges are provided as input) specifically for weighted trees and paths. ",
    "url": "https://arxiv.org/abs/2307.05829",
    "authors": [
      "Amirali Madani",
      "Anil Maheshwari"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2307.05841",
    "title": "Influential Simplices Mining via Simplicial Convolutional Network",
    "abstract": "Simplicial complexes have recently been in the limelight of higher-order network analysis, where a minority of simplices play crucial roles in structures and functions due to network heterogeneity. We find a significant inconsistency between identifying influential nodes and simplices. Therefore, it remains elusive how to characterize simplices' influence and identify influential simplices, despite the relative maturity of research on influential nodes (0-simplices) identification. Meanwhile, graph neural networks (GNNs) are potent tools that can exploit network topology and node features simultaneously, but they struggle to tackle higher-order tasks. In this paper, we propose a higher-order graph learning model, named influential simplices mining neural network (ISMnet), to identify vital h-simplices in simplicial complexes. It can tackle higher-order tasks by leveraging novel higher-order presentations: hierarchical bipartite graphs and higher-order hierarchical (HoH) Laplacians, where targeted simplices are grouped into a hub set and can interact with other simplices. Furthermore, ISMnet employs learnable graph convolutional operators in each HoH Laplacian domain to capture interactions among simplices, and it can identify influential simplices of arbitrary order by changing the hub set. Empirical results demonstrate that ISMnet significantly outperforms existing methods in ranking 0-simplices (nodes) and 2-simplices. In general, this novel framework excels in identifying influential simplices and promises to serve as a potent tool in higher-order network analysis. ",
    "url": "https://arxiv.org/abs/2307.05841",
    "authors": [
      "Yujie Zeng",
      "Yiming Huang",
      "Qiang Wu",
      "Linyuan Lü"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2307.05853",
    "title": "GLA-GCN: Global-local Adaptive Graph Convolutional Network for 3D Human",
    "abstract": "3D human pose estimation has been researched for decades with promising fruits. 3D human pose lifting is one of the promising research directions toward the task where both estimated pose and ground truth pose data are used for training. Existing pose lifting works mainly focus on improving the performance of estimated pose, but they usually underperform when testing on the ground truth pose data. We observe that the performance of the estimated pose can be easily improved by preparing good quality 2D pose, such as fine-tuning the 2D pose or using advanced 2D pose detectors. As such, we concentrate on improving the 3D human pose lifting via ground truth data for the future improvement of more quality estimated pose data. Towards this goal, a simple yet effective model called Global-local Adaptive Graph Convolutional Network (GLA-GCN) is proposed in this work. Our GLA-GCN globally models the spatiotemporal structure via a graph representation and backtraces local joint features for 3D human pose estimation via individually connected layers. To validate our model design, we conduct extensive experiments on three benchmark datasets: Human3.6M, HumanEva-I, and MPI-INF-3DHP. Experimental results show that our GLA-GCN implemented with ground truth 2D poses significantly outperforms state-of-the-art methods (e.g., up to around 3%, 17%, and 13% error reductions on Human3.6M, HumanEva-I, and MPI-INF-3DHP, respectively). ",
    "url": "https://arxiv.org/abs/2307.05853",
    "authors": [
      "Bruce X.B. Yu",
      "Zhi Zhang",
      "Yongxu Liu",
      "Sheng-hua Zhong",
      "Yan Liu",
      "Chang Wen Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05869",
    "title": "Autonomous and Ubiquitous In-node Learning Algorithms of Active Directed  Graphs and Its Storage Behavior",
    "abstract": "Memory is an important cognitive function for humans. How a brain with such a small power can complete such a complex memory function, the working mechanism behind this is undoubtedly fascinating. Engram theory views memory as the co-activation of specific neuronal clusters. From the perspective of graph theory, nodes represent neurons, and directed edges represent synapses. Then the memory engram is the connected subgraph formed between the activated nodes. In this paper, we use subgraphs as physical carriers of information and propose a parallel distributed information storage algorithm based on node scale in active-directed graphs. An active-directed graph is defined as a graph in which each node has autonomous and independent behavior and relies only on information obtained within the local field of view to make decisions. Unlike static directed graphs used for recording facts, active-directed graphs are decentralized like biological neuron networks and do not have a super manager who has a global view and can control the behavior of each node. Distinct from traditional algorithms with a global field of view, this algorithm is characterized by nodes collaborating globally on resource usage through their limited local field of view. While this strategy may not achieve global optimality as well as algorithms with a global field of view, it offers better robustness, concurrency, decentralization, and bioviability. Finally, it was tested in network capacity, fault tolerance, and robustness. It was found that the algorithm exhibits a larger network capacity in a more sparse network structure because the subgraph generated by a single sample is not a whole but consists of multiple weakly connected components. In this case, the network capacity can be understood as the number of permutations of several weakly connected components in the network. ",
    "url": "https://arxiv.org/abs/2307.05869",
    "authors": [
      "Hui Wei",
      "Weihua Miao",
      "Fushun Li"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2307.05871",
    "title": "A Novel SCL Bit-Flipping Decoding Of Polarization-Adjusted Convolutional  (PAC) Codes",
    "abstract": "Polar codes have attracted the attention of numerous researchers in the past decade due to their excellent performance. However, their performance at short block lengths under standard successive cancellation decoding is far from desirable. An effective method to improve the performance at short lengths is CRC precoding followed by successive-cancellation list decoding. Later, Arikan presented polarization-adjusted convolutional (PAC) codes, which further improve the performance of polar codes. In fact, bit-flipping is another post-processing method that can improve decoding performance. In this paper, we propose a novel SCL Bit-Flipping of PAC Codes. We show that better performance can be achieved using list decoding when the list size is the same for PAC codes (N=128, K=64). The decoding performance of our newly proposed PAC-SCLF with a list size of 32 is 0.3 dB better than that of the traditional PAC-SCL with a list size of 32. We set the maximum number of bit flips to 5. The performance of the list size (L=32) for PAC-SCLF is almost the same as the performance of the list size (L=128) for PAC-SCL. ",
    "url": "https://arxiv.org/abs/2307.05871",
    "authors": [
      "Wei Zhang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2307.05882",
    "title": "Knowledge-Driven Resource Allocation for D2D Networks: A WMMSE Unrolled  Graph Neural Network Approach",
    "abstract": "This paper proposes an novel knowledge-driven approach for resource allocation in device-to-device (D2D) networks using a graph neural network (GNN) architecture. To meet the millisecond-level timeliness and scalability required for the dynamic network environment, our proposed approach incorporates the deep unrolling of the weighted minimum mean square error (WMMSE) algorithm, referred to as domain knowledge, into GNN, thereby reducing computational delay and sample complexity while adapting to various data distributions. Specifically, the aggregation and update functions in the GNN architecture are designed by utilizing the summation and power calculation components of the WMMSE algorithm, which leads to improved model generalization and interpretabiliy. Theoretical analysis of the proposed approach reveals its capability to simplify intricate end-to-end mappings and diminish the model exploration space, resulting in increased network expressiveness and enhanced optimization performance. Simulation results demonstrate the robustness, scalability, and strong performance of the proposed knowledge-driven resource allocation approach across diverse communication topologies without retraining. Our findings contribute to the development of efficient and scalable wireless resource management solutions for distributed and dynamic networks with strict latency requirements. ",
    "url": "https://arxiv.org/abs/2307.05882",
    "authors": [
      "Hao Yang",
      "Nan Cheng",
      "Ruijin Sun",
      "Wei Quan",
      "Rong Chai",
      "Khalid Aldubaikhy",
      "Abdullah Alqasir",
      "Xuemin Shen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2307.05889",
    "title": "Rethinking Mitosis Detection: Towards Diverse Data and Feature  Representation",
    "abstract": "Mitosis detection is one of the fundamental tasks in computational pathology, which is extremely challenging due to the heterogeneity of mitotic cell. Most of the current studies solve the heterogeneity in the technical aspect by increasing the model complexity. However, lacking consideration of the biological knowledge and the complex model design may lead to the overfitting problem while limited the generalizability of the detection model. In this paper, we systematically study the morphological appearances in different mitotic phases as well as the ambiguous non-mitotic cells and identify that balancing the data and feature diversity can achieve better generalizability. Based on this observation, we propose a novel generalizable framework (MitDet) for mitosis detection. The data diversity is considered by the proposed diversity-guided sample balancing (DGSB). And the feature diversity is preserved by inter- and intra- class feature diversity-preserved module (InCDP). Stain enhancement (SE) module is introduced to enhance the domain-relevant diversity of both data and features simultaneously. Extensive experiments have demonstrated that our proposed model outperforms all the SOTA approaches in several popular mitosis detection datasets in both internal and external test sets using minimal annotation efforts with point annotations only. Comprehensive ablation studies have also proven the effectiveness of the rethinking of data and feature diversity balancing. By analyzing the results quantitatively and qualitatively, we believe that our proposed model not only achieves SOTA performance but also might inspire the future studies in new perspectives. Source code is at https://github.com/Onehour0108/MitDet. ",
    "url": "https://arxiv.org/abs/2307.05889",
    "authors": [
      "Hao Wang",
      "Jiatai Lin",
      "Danyi Li",
      "Jing Wang",
      "Bingchao Zhao",
      "Zhenwei Shi",
      "Xipeng Pan",
      "Huadeng Wang",
      "Bingbing Li",
      "Changhong Liang",
      "Guoqiang Han",
      "Li Liang",
      "Chu Han",
      "Zaiyi Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05892",
    "title": "SC-NeuS: Consistent Neural Surface Reconstruction from Sparse and Noisy  Views",
    "abstract": "The recent neural surface reconstruction by volume rendering approaches have made much progress by achieving impressive surface reconstruction quality, but are still limited to dense and highly accurate posed views. To overcome such drawbacks, this paper pays special attention on the consistent surface reconstruction from sparse views with noisy camera poses. Unlike previous approaches, the key difference of this paper is to exploit the multi-view constraints directly from the explicit geometry of the neural surface, which can be used as effective regularization to jointly learn the neural surface and refine the camera poses. To build effective multi-view constraints, we introduce a fast differentiable on-surface intersection to generate on-surface points, and propose view-consistent losses based on such differentiable points to regularize the neural surface learning. Based on this point, we propose a jointly learning strategy for neural surface and camera poses, named SC-NeuS, to perform geometry-consistent surface reconstruction in an end-to-end manner. With extensive evaluation on public datasets, our SC-NeuS can achieve consistently better surface reconstruction results with fine-grained details than previous state-of-the-art neural surface reconstruction approaches, especially from sparse and noisy camera views. ",
    "url": "https://arxiv.org/abs/2307.05892",
    "authors": [
      "Shi-Sheng Huang",
      "Zi-Xin Zou",
      "Yi-Chi Zhang",
      "Hua Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05898",
    "title": "Rectifying Noisy Labels with Sequential Prior: Multi-Scale Temporal  Feature Affinity Learning for Robust Video Segmentation",
    "abstract": "Noisy label problems are inevitably in existence within medical image segmentation causing severe performance degradation. Previous segmentation methods for noisy label problems only utilize a single image while the potential of leveraging the correlation between images has been overlooked. Especially for video segmentation, adjacent frames contain rich contextual information beneficial in cognizing noisy labels. Based on two insights, we propose a Multi-Scale Temporal Feature Affinity Learning (MS-TFAL) framework to resolve noisy-labeled medical video segmentation issues. First, we argue the sequential prior of videos is an effective reference, i.e., pixel-level features from adjacent frames are close in distance for the same class and far in distance otherwise. Therefore, Temporal Feature Affinity Learning (TFAL) is devised to indicate possible noisy labels by evaluating the affinity between pixels in two adjacent frames. We also notice that the noise distribution exhibits considerable variations across video, image, and pixel levels. In this way, we introduce Multi-Scale Supervision (MSS) to supervise the network from three different perspectives by re-weighting and refining the samples. This design enables the network to concentrate on clean samples in a coarse-to-fine manner. Experiments with both synthetic and real-world label noise demonstrate that our method outperforms recent state-of-the-art robust segmentation approaches. Code is available at https://github.com/BeileiCui/MS-TFAL. ",
    "url": "https://arxiv.org/abs/2307.05898",
    "authors": [
      "Beilei Cui",
      "Minqing Zhang",
      "Mengya Xu",
      "An Wang",
      "Wu Yuan",
      "Hongliang Ren"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05899",
    "title": "DiffuseGAE: Controllable and High-fidelity Image Manipulation from  Disentangled Representation",
    "abstract": "Diffusion probabilistic models (DPMs) have shown remarkable results on various image synthesis tasks such as text-to-image generation and image inpainting. However, compared to other generative methods like VAEs and GANs, DPMs lack a low-dimensional, interpretable, and well-decoupled latent code. Recently, diffusion autoencoders (Diff-AE) were proposed to explore the potential of DPMs for representation learning via autoencoding. Diff-AE provides an accessible latent space that exhibits remarkable interpretability, allowing us to manipulate image attributes based on latent codes from the space. However, previous works are not generic as they only operated on a few limited attributes. To further explore the latent space of Diff-AE and achieve a generic editing pipeline, we proposed a module called Group-supervised AutoEncoder(dubbed GAE) for Diff-AE to achieve better disentanglement on the latent code. Our proposed GAE has trained via an attribute-swap strategy to acquire the latent codes for multi-attribute image manipulation based on examples. We empirically demonstrate that our method enables multiple-attributes manipulation and achieves convincing sample quality and attribute alignments, while significantly reducing computational requirements compared to pixel-based approaches for representational decoupling. Code will be released soon. ",
    "url": "https://arxiv.org/abs/2307.05899",
    "authors": [
      "Yipeng Leng",
      "Qiangjuan Huang",
      "Zhiyuan Wang",
      "Yangyang Liu",
      "Haoyu Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05918",
    "title": "DSPC: Efficiently Answering Shortest Path Counting on Dynamic Graphs",
    "abstract": "The widespread use of graph data in various applications and the highly dynamic nature of today's networks have made it imperative to analyze structural trends in dynamic graphs on a continual basis. The shortest path is a fundamental concept in graph analysis and recent research shows that counting the number of shortest paths between two vertices is crucial in applications like potential friend recommendation and betweenness analysis. However, current studies that use hub labeling techniques for real-time shortest path counting are limited by their reliance on a pre-computed index, which cannot tackle frequent updates over dynamic graphs. To address this, we propose a novel approach for maintaining the index in response to changes in the graph structure and develop incremental (IncSPC) and decremental (DecSPC) update algorithms for inserting and deleting vertices/edges, respectively. The main idea of these two algorithms is that we only locate the affected vertices to update the index. Our experiments demonstrate that our dynamic algorithms are up to four orders of magnitude faster processing for incremental updates and up to three orders of magnitude faster processing for hybrid updates than reconstruction. ",
    "url": "https://arxiv.org/abs/2307.05918",
    "authors": [
      "Qingshuai Feng",
      "You Peng",
      "Wenjie Zhang",
      "Xuemin Lin",
      "Ying Zhang"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2307.05923",
    "title": "Pairs-trading System using Quantum-inspired Combinatorial Optimization  Accelerator for Optimal Path Search in Market Graphs",
    "abstract": "Pairs-trading is a trading strategy that involves matching a long position with a short position in two stocks aiming at market-neutral profits. While a typical pairs-trading system monitors the prices of two statistically correlated stocks for detecting a temporary divergence, monitoring and analyzing the prices of more stocks would potentially lead to finding more trading opportunities. Here we report a stock pairs-trading system that finds trading opportunities for any two stocks in an $N$-stock universe using a combinatorial optimization accelerator based on a quantum-inspired algorithm called simulated bifurcation. The trading opportunities are detected through solving an optimal path search problem in an $N$-node directed graph with edge weights corresponding to the products of instantaneous price differences and statistical correlation factors between two stocks. The accelerator is one of Ising machines and operates consecutively to find multiple opportunities in a market situation with avoiding duplicate detections by a tabu search technique. It has been demonstrated in the Tokyo Stock Exchange that the FPGA (field-programmable gate array)-based trading system has a sufficiently low latency (33 $\\mu$s for $N$=15 or 210 pairs) to execute the pairs-trading strategy based on optimal path search in market graphs. ",
    "url": "https://arxiv.org/abs/2307.05923",
    "authors": [
      "Kosuke Tatsumura",
      "Ryo Hidaka",
      "Jun Nakayama",
      "Tomoya Kashimata",
      "Masaya Yamasaki"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2307.05925",
    "title": "A Tractable Statistical Representation of IFTR Fading with Applications",
    "abstract": "The recently introduced independent fluctuating two-ray (IFTR) fading model, consisting of two specular components fluctuating independently plus a diffuse component, has proven to provide an excellent fit to different wireless environments, including the millimeter-wave band. However, the original formulations of the probability density function (PDF) and cumulative distribution function (CDF) of this model are not applicable to all possible values of its defining parameters, and are given in terms of multifold generalized hypergeometric functions, which prevents their widespread use for the derivation of performance metric expressions. In this paper we present a new formulation of the IFTR model as a countable mixture of Gamma distributions which greatly facilitates the performance evaluation for this model in terms of the metrics already known for the much simpler and widely used Nakagami-m fading. Additionally, a closed-form expression is presented for the generalized moment generating function (GMGF), which permits to readily obtain all the moments of the distribution of the model, as well as several relevant performance metrics. Based on these new derivations, the IFTR model is evaluated for the average channel capacity, the outage probability with and without co-channel interference, and the bit error rate (BER), which are verified by Monte Carlo simulations. ",
    "url": "https://arxiv.org/abs/2307.05925",
    "authors": [
      "Maryam Olyaee",
      "Hadi Hashemi",
      "Juan M. Romero-Jerez"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2307.05929",
    "title": "A New Dataset and Comparative Study for Aphid Cluster Detection",
    "abstract": "Aphids are one of the main threats to crops, rural families, and global food security. Chemical pest control is a necessary component of crop production for maximizing yields, however, it is unnecessary to apply the chemical approaches to the entire fields in consideration of the environmental pollution and the cost. Thus, accurately localizing the aphid and estimating the infestation level is crucial to the precise local application of pesticides. Aphid detection is very challenging as each individual aphid is really small and all aphids are crowded together as clusters. In this paper, we propose to estimate the infection level by detecting aphid clusters. We have taken millions of images in the sorghum fields, manually selected 5,447 images that contain aphids, and annotated each aphid cluster in the image. To use these images for machine learning models, we crop the images into patches and created a labeled dataset with over 151,000 image patches. Then, we implement and compare the performance of four state-of-the-art object detection models. ",
    "url": "https://arxiv.org/abs/2307.05929",
    "authors": [
      "Tianxiao Zhang",
      "Kaidong Li",
      "Xiangyu Chen",
      "Cuncong Zhong",
      "Bo Luo",
      "Ivan Grijalva Teran",
      "Brian McCornack",
      "Daniel Flippo",
      "Ajay Sharda",
      "Guanghui Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.05936",
    "title": "Introducing Packet-Level Analysis in Programmable Data Planes to Advance  Network Intrusion Detection",
    "abstract": "Programmable data planes offer precise control over the low-level processing steps applied to network packets, serving as a valuable tool for analysing malicious flows in the field of intrusion detection. Albeit with limitations on physical resources and capabilities, they allow for the efficient extraction of detailed traffic information, which can then be utilised by Machine Learning (ML) algorithms responsible for identifying security threats. In addressing resource constraints, existing solutions in the literature rely on compressing network data through the collection of statistical traffic features in the data plane. While this compression saves memory resources in switches and minimises the burden on the control channel between the data and the control plane, it also results in a loss of information available to the Network Intrusion Detection System (NIDS), limiting access to packet payload, categorical features, and the semantic understanding of network communications, such as the behaviour of packets within traffic flows. This paper proposes P4DDLe, a framework that exploits the flexibility of P4-based programmable data planes for packet-level feature extraction and pre-processing. P4DDLe leverages the programmable data plane to extract raw packet features from the network traffic, categorical features included, and to organise them in a way that the semantics of traffic flows is preserved. To minimise memory and control channel overheads, P4DDLe selectively processes and filters packet-level data, so that all and only the relevant features required by the NIDS are collected. The experimental evaluation with recent Distributed Denial of Service (DDoS) attack data demonstrates that the proposed approach is very efficient in collecting compact and high-quality representations of network flows, ensuring precise detection of DDoS attacks. ",
    "url": "https://arxiv.org/abs/2307.05936",
    "authors": [
      "Roberto Doriguzzi-Corin",
      "Luis Augusto Dias Knob",
      "Luca Mendozzi",
      "Domenico Siracusa",
      "Marco Savi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.05939",
    "title": "Automatically Reconciling the Trade-off between Prediction Accuracy and  Earliness in Prescriptive Business Process Monitoring",
    "abstract": "Prescriptive business process monitoring provides decision support to process managers on when and how to adapt an ongoing business process to prevent or mitigate an undesired process outcome. We focus on the problem of automatically reconciling the trade-off between prediction accuracy and prediction earliness in determining when to adapt. Adaptations should happen sufficiently early to provide enough lead time for the adaptation to become effective. However, earlier predictions are typically less accurate than later predictions. This means that acting on less accurate predictions may lead to unnecessary adaptations or missed adaptations. Different approaches were presented in the literature to reconcile the trade-off between prediction accuracy and earliness. So far, these approaches were compared with different baselines, and evaluated using different data sets or even confidential data sets. This limits the comparability and replicability of the approaches and makes it difficult to choose a concrete approach in practice. We perform a comparative evaluation of the main alternative approaches for reconciling the trade-off between prediction accuracy and earliness. Using four public real-world event log data sets and two types of prediction models, we assess and compare the cost savings of these approaches. The experimental results indicate which criteria affect the effectiveness of an approach and help us state initial recommendations for the selection of a concrete approach in practice. ",
    "url": "https://arxiv.org/abs/2307.05939",
    "authors": [
      "Andreas Metzger",
      "Tristan Kley",
      "Aristide Rothweiler",
      "Klaus Pohl"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.05945",
    "title": "YOGA: Deep Object Detection in the Wild with Lightweight Feature  Learning and Multiscale Attention",
    "abstract": "We introduce YOGA, a deep learning based yet lightweight object detection model that can operate on low-end edge devices while still achieving competitive accuracy. The YOGA architecture consists of a two-phase feature learning pipeline with a cheap linear transformation, which learns feature maps using only half of the convolution filters required by conventional convolutional neural networks. In addition, it performs multi-scale feature fusion in its neck using an attention mechanism instead of the naive concatenation used by conventional detectors. YOGA is a flexible model that can be easily scaled up or down by several orders of magnitude to fit a broad range of hardware constraints. We evaluate YOGA on COCO-val and COCO-testdev datasets with other over 10 state-of-the-art object detectors. The results show that YOGA strikes the best trade-off between model size and accuracy (up to 22% increase of AP and 23-34% reduction of parameters and FLOPs), making it an ideal choice for deployment in the wild on low-end edge devices. This is further affirmed by our hardware implementation and evaluation on NVIDIA Jetson Nano. ",
    "url": "https://arxiv.org/abs/2307.05945",
    "authors": [
      "Raja Sunkara",
      "Tie Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05946",
    "title": "A Bayesian approach to quantifying uncertainties and improving  generalizability in traffic prediction models",
    "abstract": "Deep-learning models for traffic data prediction can have superior performance in modeling complex functions using a multi-layer architecture. However, a major drawback of these approaches is that most of these approaches do not offer forecasts with uncertainty estimates, which are essential for traffic operations and control. Without uncertainty estimates, it is difficult to place any level of trust to the model predictions, and operational strategies relying on overconfident predictions can lead to worsening traffic conditions. In this study, we propose a Bayesian recurrent neural network framework for uncertainty quantification in traffic prediction with higher generalizability by introducing spectral normalization to its hidden layers. In our paper, we have shown that normalization alters the training process of deep neural networks by controlling the model's complexity and reducing the risk of overfitting to the training data. This, in turn, helps improve the generalization performance of the model on out-of-distribution datasets. Results demonstrate that spectral normalization improves uncertainty estimates and significantly outperforms both the layer normalization and model without normalization in single-step prediction horizons. This improved performance can be attributed to the ability of spectral normalization to better localize the feature space of the data under perturbations. Our findings are especially relevant to traffic management applications, where predicting traffic conditions across multiple locations is the goal, but the availability of training data from multiple locations is limited. Spectral normalization, therefore, provides a more generalizable approach that can effectively capture the underlying patterns in traffic data without requiring location-specific models. ",
    "url": "https://arxiv.org/abs/2307.05946",
    "authors": [
      "Agnimitra Sengupta",
      "Sudeepta Mondal",
      "Adway Das",
      "S. Ilgin Guler"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.05948",
    "title": "Diversity-enhancing Generative Network for Few-shot Hypothesis  Adaptation",
    "abstract": "Generating unlabeled data has been recently shown to help address the few-shot hypothesis adaptation (FHA) problem, where we aim to train a classifier for the target domain with a few labeled target-domain data and a well-trained source-domain classifier (i.e., a source hypothesis), for the additional information of the highly-compatible unlabeled data. However, the generated data of the existing methods are extremely similar or even the same. The strong dependency among the generated data will lead the learning to fail. In this paper, we propose a diversity-enhancing generative network (DEG-Net) for the FHA problem, which can generate diverse unlabeled data with the help of a kernel independence measure: the Hilbert-Schmidt independence criterion (HSIC). Specifically, DEG-Net will generate data via minimizing the HSIC value (i.e., maximizing the independence) among the semantic features of the generated data. By DEG-Net, the generated unlabeled data are more diverse and more effective for addressing the FHA problem. Experimental results show that the DEG-Net outperforms existing FHA baselines and further verifies that generating diverse data plays a vital role in addressing the FHA problem ",
    "url": "https://arxiv.org/abs/2307.05948",
    "authors": [
      "Ruijiang Dong",
      "Feng Liu",
      "Haoang Chi",
      "Tongliang Liu",
      "Mingming Gong",
      "Gang Niu",
      "Masashi Sugiyama",
      "Bo Han"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05949",
    "title": "Newell's theory based feature transformations for spatio-temporal  traffic prediction",
    "abstract": "Deep learning (DL) models for spatio-temporal traffic flow forecasting employ convolutional or graph-convolutional filters along with recurrent neural networks to capture spatial and temporal dependencies in traffic data. These models, such as CNN-LSTM, utilize traffic flows from neighboring detector stations to predict flows at a specific location of interest. However, these models are limited in their ability to capture the broader dynamics of the traffic system, as they primarily learn features specific to the detector configuration and traffic characteristics at the target location. Hence, the transferability of these models to different locations becomes challenging, particularly when data is unavailable at the new location for model training. To address this limitation, we propose a traffic flow physics-based feature transformation for spatio-temporal DL models. This transformation incorporates Newell's uncongested and congested-state estimators of traffic flows at the target locations, enabling the models to learn broader dynamics of the system. Our methodology is empirically validated using traffic data from two different locations. The results demonstrate that the proposed feature transformation improves the models' performance in predicting traffic flows over different prediction horizons, as indicated by better goodness-of-fit statistics. An important advantage of our framework is its ability to be transferred to new locations where data is unavailable. This is achieved by appropriately accounting for spatial dependencies based on station distances and various traffic parameters. In contrast, regular DL models are not easily transferable as their inputs remain fixed. It should be noted that due to data limitations, we were unable to perform spatial sensitivity analysis, which calls for further research using simulated data. ",
    "url": "https://arxiv.org/abs/2307.05949",
    "authors": [
      "Agnimitra Sengupta",
      "S. Ilgin Guler"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.05974",
    "title": "Contrastive Learning for Conversion Rate Prediction",
    "abstract": "Conversion rate (CVR) prediction plays an important role in advertising systems. Recently, supervised deep neural network-based models have shown promising performance in CVR prediction. However, they are data hungry and require an enormous amount of training data. In online advertising systems, although there are millions to billions of ads, users tend to click only a small set of them and to convert on an even smaller set. This data sparsity issue restricts the power of these deep models. In this paper, we propose the Contrastive Learning for CVR prediction (CL4CVR) framework. It associates the supervised CVR prediction task with a contrastive learning task, which can learn better data representations exploiting abundant unlabeled data and improve the CVR prediction performance. To tailor the contrastive learning task to the CVR prediction problem, we propose embedding masking (EM), rather than feature masking, to create two views of augmented samples. We also propose a false negative elimination (FNE) component to eliminate samples with the same feature as the anchor sample, to account for the natural property in user behavior data. We further propose a supervised positive inclusion (SPI) component to include additional positive samples for each anchor sample, in order to make full use of sparse but precious user conversion events. Experimental results on two real-world conversion datasets demonstrate the superior performance of CL4CVR. The source code is available at https://github.com/DongRuiHust/CL4CVR. ",
    "url": "https://arxiv.org/abs/2307.05974",
    "authors": [
      "Wentao Ouyang",
      "Rui Dong",
      "Xiuwu Zhang",
      "Chaofeng Guo",
      "Jinmei Luo",
      "Xiangzheng Liu",
      "Yanlong Du"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.06003",
    "title": "Unsupervised Optical Flow Estimation with Dynamic Timing Representation  for Spike Camera",
    "abstract": "Efficiently selecting an appropriate spike stream data length to extract precise information is the key to the spike vision tasks. To address this issue, we propose a dynamic timing representation for spike streams. Based on multi-layers architecture, it applies dilated convolutions on temporal dimension to extract features on multi-temporal scales with few parameters. And we design layer attention to dynamically fuse these features. Moreover, we propose an unsupervised learning method for optical flow estimation in a spike-based manner to break the dependence on labeled data. In addition, to verify the robustness, we also build a spike-based synthetic validation dataset for extreme scenarios in autonomous driving, denoted as SSES dataset. It consists of various corner cases. Experiments show that our method can predict optical flow from spike streams in different high-speed scenes, including real scenes. For instance, our method gets $15\\%$ and $19\\%$ error reduction from the best spike-based work, SCFlow, in $\\Delta t=10$ and $\\Delta t=20$ respectively which are the same settings as the previous works. ",
    "url": "https://arxiv.org/abs/2307.06003",
    "authors": [
      "Lujie Xia",
      "Ziluo Ding",
      "Rui Zhao",
      "Jiyuan Zhang",
      "Lei Ma",
      "Zhaofei Yu",
      "Tiejun Huang",
      "Ruiqin Xiong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.06005",
    "title": "DDNAS: Discretized Differentiable Neural Architecture Search for Text  Classification",
    "abstract": "Neural Architecture Search (NAS) has shown promising capability in learning text representation. However, existing text-based NAS neither performs a learnable fusion of neural operations to optimize the architecture, nor encodes the latent hierarchical categorization behind text input. This paper presents a novel NAS method, Discretized Differentiable Neural Architecture Search (DDNAS), for text representation learning and classification. With the continuous relaxation of architecture representation, DDNAS can use gradient descent to optimize the search. We also propose a novel discretization layer via mutual information maximization, which is imposed on every search node to model the latent hierarchical categorization in text representation. Extensive experiments conducted on eight diverse real datasets exhibit that DDNAS can consistently outperform the state-of-the-art NAS methods. While DDNAS relies on only three basic operations, i.e., convolution, pooling, and none, to be the candidates of NAS building blocks, its promising performance is noticeable and extensible to obtain further improvement by adding more different operations. ",
    "url": "https://arxiv.org/abs/2307.06005",
    "authors": [
      "Kuan-Chun Chen",
      "Cheng-Te Li",
      "Kuo-Jung Lee"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.06007",
    "title": "Building Persuasive Robots with Social Power Strategies",
    "abstract": "Can social power endow social robots with the capacity to persuade? This paper represents our recent endeavor to design persuasive social robots. We have designed and run three different user studies to investigate the effectiveness of different bases of social power (inspired by French and Raven's theory) on peoples' compliance to the requests of social robots. The results show that robotic persuaders that exert social power (specifically from expert, reward, and coercion bases) demonstrate increased ability to influence humans. The first study provides a positive answer and shows that under the same circumstances, people with different personalities prefer robots using a specific social power base. In addition, social rewards can be useful in persuading individuals. The second study suggests that by employing social power, social robots are capable of persuading people objectively to select a less desirable choice among others. Finally, the third study shows that the effect of power on persuasion does not decay over time and might strengthen under specific circumstances. Moreover, exerting stronger social power does not necessarily lead to higher persuasion. Overall, we argue that the results of these studies are relevant for designing human--robot-interaction scenarios especially the ones aiming at behavioral change. ",
    "url": "https://arxiv.org/abs/2307.06007",
    "authors": [
      "Mojgan Hashemian",
      "Marta Couto",
      "Samuel Mascarenhas",
      "Ana Paiva",
      "Pedro A. Santos",
      "Rui Prada"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2307.06023",
    "title": "On the Uplink Distributed Detection in UAV-enabled Aerial Cell-Free  mMIMO Systems",
    "abstract": "In this paper, we investigate the uplink signal detection approaches in the cell-free massive MIMO systems with unmanned aerial vehicles (UAVs) serving as aerial access points (APs). The ground users are equipped with multiple antennas and the ground-to-air propagation channels are subject to correlated Rician fading. To overcome huge signaling overhead in the fully-centralized detection, we propose a two-layer distributed uplink detection scheme, where the uplink signals are first detected in the AP-UAVs by using the minimum mean-squared error (MMSE) detector depending on local channel state information (CSI), and then collected and weighted combined at the CPU-UAV to obtain the refined detection. By using the operator-valued free probability theory, the asymptotic expressions of the combining weights are obtained, which only depend on the statistical CSI and show excellent accuracy. Based on the proposed distributed scheme, we further investigate the impacts of different distributed deployments on the achieved spectral efficiency (SE). Numerical results show that in urban and dense urban environments, it is more beneficial to deploy more AP-UAVs to achieve higher SE. On the other hand, in suburban environment, an optimal ratio between the number of deployed UAVs and the number of antennas per UAV exists to maximize the SE. ",
    "url": "https://arxiv.org/abs/2307.06023",
    "authors": [
      "Xuesong Pan",
      "Zhong Zheng",
      "Xueqing Huang",
      "Zesong Fei"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2307.06029",
    "title": "Pluggable Neural Machine Translation Models via Memory-augmented  Adapters",
    "abstract": "Although neural machine translation (NMT) models perform well in the general domain, it remains rather challenging to control their generation behavior to satisfy the requirement of different users. Given the expensive training cost and the data scarcity challenge of learning a new model from scratch for each user requirement, we propose a memory-augmented adapter to steer pretrained NMT models in a pluggable manner. Specifically, we construct a multi-granular memory based on the user-provided text samples and propose a new adapter architecture to combine the model representations and the retrieved results. We also propose a training strategy using memory dropout to reduce spurious dependencies between the NMT model and the memory. We validate our approach on both style- and domain-specific experiments and the results indicate that our method can outperform several representative pluggable baselines. ",
    "url": "https://arxiv.org/abs/2307.06029",
    "authors": [
      "Yuzhuang Xu",
      "Shuo Wang",
      "Peng Li",
      "Xuebo Liu",
      "Xiaolong Wang",
      "Weidong Liu",
      "Yang Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.06030",
    "title": "Robust internal model control approach for position control of systems  with sandwiched backlash",
    "abstract": "This paper describes the design of a robust controller for position control in systems with sandwiched backlash. The backlash, which is nonsmooth and nonlinear, is inevitable in the operation of many systems, but it can have destructive effects on the stability and performance of feedback systems. In this work, a robust controller is designed using a modified linear internal model control framework. Different controller architectures are considered and compared based on an experimental case study. The experimental testbased is composed of a three-platform structure driven by a stepper motor. The backlash is introduced into the system in a non-destructive and controllable manner by closing an internal nonlinear feedback loop around the stepper motor. The robustness of the designed controller to a large amount of backlash is verified experimentally, and while the stability is maintained, some residual vibrations are observed. The effects on the residual vibration levels of including nonlinear elements in the controller and changing the controller's settling time are also examined experimentally. The robustness to changes and mismodelling of the linear system, with and without the backlash, is described, as is the tracking of a smooth sinusoidal command signal with a growing amount of backlash. Based on the case study, it is concluded that combining the linear internal model control design method with a small dead zone results in a highly robust controller both with respect to the backlash and to changes in the linear system, which ensure stability and good performance. The required robustness is achieved by tuning the controller's settling time and the dead zone width parameters. ",
    "url": "https://arxiv.org/abs/2307.06030",
    "authors": [
      "Yoav Vered",
      "Stephen J. Elliott"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2307.06038",
    "title": "Pyramid Deep Fusion Network for Two-Hand Reconstruction from RGB-D  Images",
    "abstract": "Accurately recovering the dense 3D mesh of both hands from monocular images poses considerable challenges due to occlusions and projection ambiguity. Most of the existing methods extract features from color images to estimate the root-aligned hand meshes, which neglect the crucial depth and scale information in the real world. Given the noisy sensor measurements with limited resolution, depth-based methods predict 3D keypoints rather than a dense mesh. These limitations motivate us to take advantage of these two complementary inputs to acquire dense hand meshes on a real-world scale. In this work, we propose an end-to-end framework for recovering dense meshes for both hands, which employ single-view RGB-D image pairs as input. The primary challenge lies in effectively utilizing two different input modalities to mitigate the blurring effects in RGB images and noises in depth images. Instead of directly treating depth maps as additional channels for RGB images, we encode the depth information into the unordered point cloud to preserve more geometric details. Specifically, our framework employs ResNet50 and PointNet++ to derive features from RGB and point cloud, respectively. Additionally, we introduce a novel pyramid deep fusion network (PDFNet) to aggregate features at different scales, which demonstrates superior efficacy compared to previous fusion strategies. Furthermore, we employ a GCN-based decoder to process the fused features and recover the corresponding 3D pose and dense mesh. Through comprehensive ablation experiments, we have not only demonstrated the effectiveness of our proposed fusion algorithm but also outperformed the state-of-the-art approaches on publicly available datasets. To reproduce the results, we will make our source code and models publicly available at {\\url{https://github.com/zijinxuxu/PDFNet}}. ",
    "url": "https://arxiv.org/abs/2307.06038",
    "authors": [
      "Jinwei Ren",
      "Jianke Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.06046",
    "title": "An OOD Multi-Task Perspective for Link Prediction with New Relation  Types and Nodes",
    "abstract": "The task of inductive link prediction in (discrete) attributed multigraphs infers missing attributed links (relations) between nodes in new test multigraphs. Traditional relational learning methods face the challenge of limited generalization to OOD test multigraphs containing both novel nodes and novel relation types not seen in training. Recently, under the only assumption that all relation types share the same structural predictive patterns (single task), Gao et al. (2023) proposed an OOD link prediction method using the theoretical concept of double exchangeability (for nodes & relation types), in contrast to the (single) exchangeability (only for nodes) used to design Graph Neural Networks (GNNs). In this work we further extend the double exchangeability concept to multi-task double exchangeability, where we define link prediction in attributed multigraphs that can have distinct and potentially conflicting predictive patterns for different sets of relation types (multiple tasks). Our empirical results on real-world datasets demonstrate that our approach can effectively generalize to entirely new relation types in test, without access to additional information, yielding significant performance improvements over existing methods. ",
    "url": "https://arxiv.org/abs/2307.06046",
    "authors": [
      "Jincheng Zhou",
      "Beatrice Bevilacqua",
      "Bruno Ribeiro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.06052",
    "title": "Visualization for Multivariate Gaussian Anomaly Detection in Images",
    "abstract": "This paper introduces a simplified variation of the PaDiM (Pixel-Wise Anomaly Detection through Instance Modeling) method for anomaly detection in images, fitting a single multivariate Gaussian (MVG) distribution to the feature vectors extracted from a backbone convolutional neural network (CNN) and using their Mahalanobis distance as the anomaly score. We introduce an intermediate step in this framework by applying a whitening transformation to the feature vectors, which enables the generation of heatmaps capable of visually explaining the features learned by the MVG. The proposed technique is evaluated on the MVTec-AD dataset, and the results show the importance of visual model validation, providing insights into issues in this framework that were otherwise invisible. The visualizations generated for this paper are publicly available at https://doi.org/10.5281/zenodo.7937978. ",
    "url": "https://arxiv.org/abs/2307.06052",
    "authors": [
      "Joao P C Bertoldo",
      "David Arrustico"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.06065",
    "title": "Operational Support Estimator Networks",
    "abstract": "In this work, we propose a novel approach called Operational Support Estimator Networks (OSENs) for the support estimation task. Support Estimation (SE) is defined as finding the locations of non-zero elements in a sparse signal. By its very nature, the mapping between the measurement and sparse signal is a non-linear operation. Traditional support estimators rely on computationally expensive iterative signal recovery techniques to achieve such non-linearity. Contrary to the convolution layers, the proposed OSEN approach consists of operational layers that can learn such complex non-linearities without the need for deep networks. In this way, the performance of the non-iterative support estimation is greatly improved. Moreover, the operational layers comprise so-called generative \\textit{super neurons} with non-local kernels. The kernel location for each neuron/feature map is optimized jointly for the SE task during the training. We evaluate the OSENs in three different applications: i. support estimation from Compressive Sensing (CS) measurements, ii. representation-based classification, and iii. learning-aided CS reconstruction where the output of OSENs is used as prior knowledge to the CS algorithm for an enhanced reconstruction. Experimental results show that the proposed approach achieves computational efficiency and outperforms competing methods, especially at low measurement rates by a significant margin. The software implementation is publicly shared at https://github.com/meteahishali/OSEN. ",
    "url": "https://arxiv.org/abs/2307.06065",
    "authors": [
      "Mete Ahishali",
      "Mehmet Yamac",
      "Serkan Kiranyaz",
      "Moncef Gabbouj"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.06072",
    "title": "Acceleration of complex matrix multiplication using arbitrary precision  floating-point arithmetic",
    "abstract": "Efficient multiple precision linear numerical computation libraries such as MPLAPACK are critical in dealing with ill-conditioned problems. Specifically, there are optimization methods for matrix multiplication, such as the Strassen algorithm and the Ozaki scheme, which can be used to speed up computation. For complex matrix multiplication, the 3M method can also be used, which requires only three multiplications of real matrices, instead of the 4M method, which requires four multiplications of real matrices. In this study, we extend these optimization methods to arbitrary precision complex matrix multiplication and verify the possible increase in computation speed through benchmark tests. The optimization methods are also applied to complex LU decomposition using matrix multiplication to demonstrate that the Ozaki scheme can be used to achieve higher computation speeds. ",
    "url": "https://arxiv.org/abs/2307.06072",
    "authors": [
      "Tomonori Kouya"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2307.06077",
    "title": "Group Fairness in Social Choice",
    "abstract": "We consider a voting model, where a number of candidates need to be selected subject to certain feasibility constraints. The model generalises committee elections (where there is a single constraint on the number of candidates that need to be selected), various elections with diversity constraints, the model of public decisions (where decisions needs to be taken on a number of independent issues), and the model of collective scheduling. A critical property of voting is that it should be fair -- not only to individuals but also to groups of voters with similar opinions on the subject of the vote; in other words, the outcome of an election should proportionally reflect the voters' preferences. We formulate axioms of proportionality in this general model. Our axioms do not require predefining groups of voters; to the contrary, we ensure that the opinion of every subset of voters whose preferences are cohesive-enough are taken into account to the extent that is proportional to the size of the subset. Our axioms are always satisfiable, and generalize the strongest known satisfiable axioms for the more specific models. We explain how to adapt two prominent committee election rules, Proportional Approval Voting (PAV) and Phragmen Sequential Rule, as well as the concept of stable-priceability to our general model. The two rules satisfy our proportionality axioms if and only if the feasibility constraints are matroids. ",
    "url": "https://arxiv.org/abs/2307.06077",
    "authors": [
      "Tomáš Masařík",
      "Grzegorz Pierczyński",
      "Piotr Skowron"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2307.06084",
    "title": "Neuromorphic analog circuits for robust on-chip always-on learning in  spiking neural networks",
    "abstract": "Mixed-signal neuromorphic systems represent a promising solution for solving extreme-edge computing tasks without relying on external computing resources. Their spiking neural network circuits are optimized for processing sensory data on-line in continuous-time. However, their low precision and high variability can severely limit their performance. To address this issue and improve their robustness to inhomogeneities and noise in both their internal state variables and external input signals, we designed on-chip learning circuits with short-term analog dynamics and long-term tristate discretization mechanisms. An additional hysteretic stop-learning mechanism is included to improve stability and automatically disable weight updates when necessary, to enable continuous always-on learning. We designed a spiking neural network with these learning circuits in a prototype chip using a 180 nm CMOS technology. Simulation and silicon measurement results from the prototype chip are presented. These circuits enable the construction of large-scale spiking neural networks with online learning capabilities for real-world edge computing tasks. ",
    "url": "https://arxiv.org/abs/2307.06084",
    "authors": [
      "Arianna Rubino",
      "Matteo Cartiglia",
      "Melika Payvand",
      "Giacomo Indiveri"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2307.06092",
    "title": "Quantitative CLTs in Deep Neural Networks",
    "abstract": "We study the distribution of a fully connected neural network with random Gaussian weights and biases in which the hidden layer widths are proportional to a large constant $n$. Under mild assumptions on the non-linearity, we obtain quantitative bounds on normal approximations valid at large but finite $n$ and any fixed network depth. Our theorems show, both for the finite-dimensional distributions and the entire process, that the distance between a random fully connected network (and its derivatives) to the corresponding infinite width Gaussian process scales like $n^{-\\gamma}$ for $\\gamma>0,$ with the exponent depending on the metric used to measure discrepancy. Our bounds are stronger in terms of their dependence on network width than any previously available in the literature. ",
    "url": "https://arxiv.org/abs/2307.06092",
    "authors": [
      "Stefano Favaro",
      "Boris Hanin",
      "Domenico Marinucci",
      "Ivan Nourdin",
      "Giovanni Peccati"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Probability (math.PR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.06095",
    "title": "Exact Resource Allocation over Fair Wireless Relay Networks",
    "abstract": "In relay-enabled cellular networks, the intertwined nature of network agents calls for complex schemes to allocate wireless resources. Resources need to be distributed among mobile users while considering how relay resources are allocated, and constrained by the traffic rate achievable by base stations and over backhaul links. In this work, we derive a resource allocation scheme that achieves max-min fairness across mobile users. Furthermore, the optimal allocation is found with linear complexity with respect to the number of mobile users and relays. ",
    "url": "https://arxiv.org/abs/2307.06095",
    "authors": [
      "Edgar Arribas",
      "Vicent Cholvi",
      "Vincenzo Mancuso"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.06097",
    "title": "Learning Stochastic Dynamical Systems as an Implicit Regularization with  Graph Neural Networks",
    "abstract": "Stochastic Gumbel graph networks are proposed to learn high-dimensional time series, where the observed dimensions are often spatially correlated. To that end, the observed randomness and spatial-correlations are captured by learning the drift and diffusion terms of the stochastic differential equation with a Gumble matrix embedding, respectively. In particular, this novel framework enables us to investigate the implicit regularization effect of the noise terms in S-GGNs. We provide a theoretical guarantee for the proposed S-GGNs by deriving the difference between the two corresponding loss functions in a small neighborhood of weight. Then, we employ Kuramoto's model to generate data for comparing the spectral density from the Hessian Matrix of the two loss functions. Experimental results on real-world data, demonstrate that S-GGNs exhibit superior convergence, robustness, and generalization, compared with state-of-the-arts. ",
    "url": "https://arxiv.org/abs/2307.06097",
    "authors": [
      "Jin Guo",
      "Ting Gao",
      "Yufu Lan",
      "Peng Zhang",
      "Sikun Yang",
      "Jinqiao Duan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2307.06101",
    "title": "Air Bumper: A Collision Detection and Reaction Framework for Autonomous  MAV Navigation",
    "abstract": "Autonomous navigation in unknown environments with obstacles remains challenging for micro aerial vehicles (MAVs) due to their limited onboard computing and sensing resources. Although various collision avoidance methods have been developed, it is still possible for drones to collide with unobserved obstacles due to unpredictable disturbances, sensor limitations, and control uncertainty. Instead of completely avoiding collisions, this article proposes Air Bumper, a collision detection and reaction framework, for fully autonomous flight in 3D environments to improve the safety of drones. Our framework only utilizes the onboard inertial measurement unit (IMU) to detect and estimate collisions. We further design a collision recovery control for rapid recovery and collision-aware mapping to integrate collision information into general LiDAR-based sensing and planning frameworks. Our simulation and experimental results show that the quadrotor can rapidly detect, estimate, and recover from collisions with obstacles in 3D space and continue the flight smoothly with the help of the collision-aware map. ",
    "url": "https://arxiv.org/abs/2307.06101",
    "authors": [
      "Ruoyu Wang",
      "Zixuan Guo",
      "Yizhou Chen",
      "Xinyi Wang",
      "Ben M. Chen"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2307.06108",
    "title": "Fast Decoding of Lifted Interleaved Linearized Reed-Solomon Codes for  Multishot Network Coding",
    "abstract": "Mart{\\'\\i}nez-Pe{\\~n}as and Kschischang (IEEE Trans.\\ Inf.\\ Theory, 2019) proposed lifted linearized Reed--Solomon codes as suitable codes for error control in multishot network coding. We show how to construct and decode \\ac{LILRS} codes. Compared to the construction by Mart{\\'\\i}nez-Pe{\\~n}as--Kschischang, interleaving allows to increase the decoding region significantly and decreases the overhead due to the lifting (i.e., increases the code rate), at the cost of an increased packet size. We propose two decoding schemes for \\ac{LILRS} that are both capable of correcting insertions and deletions beyond half the minimum distance of the code by either allowing a list or a small decoding failure probability. We propose a probabilistic unique {\\LOlike} decoder for \\ac{LILRS} codes and an efficient interpolation-based decoding scheme that can be either used as a list decoder (with exponential worst-case list size) or as a probabilistic unique decoder. We derive upper bounds on the decoding failure probability of the probabilistic-unique decoders which show that the decoding failure probability is very small for most channel realizations up to the maximal decoding radius. The tightness of the bounds is verified by Monte Carlo simulations. ",
    "url": "https://arxiv.org/abs/2307.06108",
    "authors": [
      "Hannes Bartz",
      "Sven Puchinger"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2307.06113",
    "title": "Sublinear Time Shortest Path in Expander Graphs",
    "abstract": "Computing a shortest path between two nodes in an undirected unweighted graph is among the most basic algorithmic tasks. Breadth first search solves this problem in linear time, which is clearly also a lower bound in the worst case. However, several works have shown how to solve this problem in sublinear time in expectation when the input graph is drawn from one of several classes of random graphs. In this work, we extend these results by giving sublinear time shortest path (and short path) algorithms for expander graphs. We thus identify a natural deterministic property of a graph (that is satisfied by typical random regular graphs) which suffices for sublinear time shortest paths. The algorithms are very simple, involving only bidirectional breadth first search and short random walks. We also complement our new algorithms by near-matching lower bounds. ",
    "url": "https://arxiv.org/abs/2307.06113",
    "authors": [
      "Noga Alon",
      "Allan Grønlund",
      "Søren Fuglede Jørgensen",
      "Kasper Green Larsen"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2307.06123",
    "title": "SoK: Comparing Different Membership Inference Attacks with a  Comprehensive Benchmark",
    "abstract": "Membership inference (MI) attacks threaten user privacy through determining if a given data example has been used to train a target model. However, it has been increasingly recognized that the \"comparing different MI attacks\" methodology used in the existing works has serious limitations. Due to these limitations, we found (through the experiments in this work) that some comparison results reported in the literature are quite misleading. In this paper, we seek to develop a comprehensive benchmark for comparing different MI attacks, called MIBench, which consists not only the evaluation metrics, but also the evaluation scenarios. And we design the evaluation scenarios from four perspectives: the distance distribution of data samples in the target dataset, the distance between data samples of the target dataset, the differential distance between two datasets (i.e., the target dataset and a generated dataset with only nonmembers), and the ratio of the samples that are made no inferences by an MI attack. The evaluation metrics consist of ten typical evaluation metrics. We have identified three principles for the proposed \"comparing different MI attacks\" methodology, and we have designed and implemented the MIBench benchmark with 84 evaluation scenarios for each dataset. In total, we have used our benchmark to fairly and systematically compare 15 state-of-the-art MI attack algorithms across 588 evaluation scenarios, and these evaluation scenarios cover 7 widely used datasets and 7 representative types of models. All codes and evaluations of MIBench are publicly available at https://github.com/MIBench/MIBench.github.io/blob/main/README.md. ",
    "url": "https://arxiv.org/abs/2307.06123",
    "authors": [
      "Jun Niu",
      "Xiaoyan Zhu",
      "Moxuan Zeng",
      "Ge Zhang",
      "Qingyang Zhao",
      "Chunhui Huang",
      "Yangming Zhang",
      "Suyu An",
      "Yangzhong Wang",
      "Xinghui Yue",
      "Zhipeng He",
      "Weihao Guo",
      "Kuo Shen",
      "Peng Liu",
      "Yulong Shen",
      "Xiaohong Jiang",
      "Jianfeng Ma",
      "Yuqing Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.06135",
    "title": "SayPlan: Grounding Large Language Models using 3D Scene Graphs for  Scalable Task Planning",
    "abstract": "Large language models (LLMs) have demonstrated impressive results in developing generalist planning agents for diverse tasks. However, grounding these plans in expansive, multi-floor, and multi-room environments presents a significant challenge for robotics. We introduce SayPlan, a scalable approach to LLM-based, large-scale task planning for robotics using 3D scene graph (3DSG) representations. To ensure the scalability of our approach, we: (1) exploit the hierarchical nature of 3DSGs to allow LLMs to conduct a semantic search for task-relevant subgraphs from a smaller, collapsed representation of the full graph; (2) reduce the planning horizon for the LLM by integrating a classical path planner and (3) introduce an iterative replanning pipeline that refines the initial plan using feedback from a scene graph simulator, correcting infeasible actions and avoiding planning failures. We evaluate our approach on two large-scale environments spanning up to 3 floors, 36 rooms and 140 objects, and show that our approach is capable of grounding large-scale, long-horizon task plans from abstract, and natural language instruction for a mobile manipulator robot to execute. ",
    "url": "https://arxiv.org/abs/2307.06135",
    "authors": [
      "Krishan Rana",
      "Jesse Haviland",
      "Sourav Garg",
      "Jad Abou-Chakra",
      "Ian Reid",
      "Niko Suenderhauf"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.06143",
    "title": "Learning Kernel-Modulated Neural Representation for Efficient Light  Field Compression",
    "abstract": "Light field is a type of image data that captures the 3D scene information by recording light rays emitted from a scene at various orientations. It offers a more immersive perception than classic 2D images but at the cost of huge data volume. In this paper, we draw inspiration from the visual characteristics of Sub-Aperture Images (SAIs) of light field and design a compact neural network representation for the light field compression task. The network backbone takes randomly initialized noise as input and is supervised on the SAIs of the target light field. It is composed of two types of complementary kernels: descriptive kernels (descriptors) that store scene description information learned during training, and modulatory kernels (modulators) that control the rendering of different SAIs from the queried perspectives. To further enhance compactness of the network meanwhile retain high quality of the decoded light field, we accordingly introduce modulator allocation and kernel tensor decomposition mechanisms, followed by non-uniform quantization and lossless entropy coding techniques, to finally form an efficient compression pipeline. Extensive experiments demonstrate that our method outperforms other state-of-the-art (SOTA) methods by a significant margin in the light field compression task. Moreover, after aligning descriptors, the modulators learned from one light field can be transferred to new light fields for rendering dense views, indicating a potential solution for view synthesis task. ",
    "url": "https://arxiv.org/abs/2307.06143",
    "authors": [
      "Jinglei Shi",
      "Yihong Xu",
      "Christine Guillemot"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2307.06148",
    "title": "NetGPT: A Native-AI Network Architecture Beyond Provisioning  Personalized Generative Services",
    "abstract": "Large language models (LLMs) have triggered tremendous success to empower daily life by generative information, and the personalization of LLMs could further contribute to their applications due to better alignment with human intents. Towards personalized generative services, a collaborative cloud-edge methodology sounds promising, as it facilitates the effective orchestration of heterogeneous distributed communication and computing resources. In this article, after discussing the pros and cons of several candidate cloud-edge collaboration techniques, we put forward NetGPT to capably deploy appropriate LLMs at the edge and the cloud in accordance with their computing capacity. In addition, edge LLMs could efficiently leverage location-based information for personalized prompt completion, thus benefiting the interaction with cloud LLMs. After deploying representative open-source LLMs (e.g., GPT-2-base and LLaMA model) at the edge and the cloud, we present the feasibility of NetGPT on the basis of low-rank adaptation-based light-weight fine-tuning. Subsequently, we highlight substantial essential changes required for a native artificial intelligence (AI) network architecture towards NetGPT, with special emphasis on deeper integration of communications and computing resources and careful calibration of logical AI workflow. Furthermore, we demonstrate several by-product benefits of NetGPT, given edge LLM's astonishing capability to predict trends and infer intents, which possibly leads to a unified solution for intelligent network management \\& orchestration. In a nutshell, we argue that NetGPT is a promising native-AI network architecture beyond provisioning personalized generative services. ",
    "url": "https://arxiv.org/abs/2307.06148",
    "authors": [
      "Yuxuan Chen",
      "Rongpeng Li",
      "Zhifeng Zhao",
      "Chenghui Peng",
      "Jianjun Wu",
      "Ekram Hossain",
      "Honggang Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.06167",
    "title": "Auxiliary-Tasks Learning for Physics-Informed Neural Network-Based  Partial Differential Equations Solving",
    "abstract": "Physics-informed neural networks (PINNs) have emerged as promising surrogate modes for solving partial differential equations (PDEs). Their effectiveness lies in the ability to capture solution-related features through neural networks. However, original PINNs often suffer from bottlenecks, such as low accuracy and non-convergence, limiting their applicability in complex physical contexts. To alleviate these issues, we proposed auxiliary-task learning-based physics-informed neural networks (ATL-PINNs), which provide four different auxiliary-task learning modes and investigate their performance compared with original PINNs. We also employ the gradient cosine similarity algorithm to integrate auxiliary problem loss with the primary problem loss in ATL-PINNs, which aims to enhance the effectiveness of the auxiliary-task learning modes. To the best of our knowledge, this is the first study to introduce auxiliary-task learning modes in the context of physics-informed learning. We conduct experiments on three PDE problems across different fields and scenarios. Our findings demonstrate that the proposed auxiliary-task learning modes can significantly improve solution accuracy, achieving a maximum performance boost of 96.62% (averaging 28.23%) compared to the original single-task PINNs. The code and dataset are open source at https://github.com/junjun-yan/ATL-PINN. ",
    "url": "https://arxiv.org/abs/2307.06167",
    "authors": [
      "Junjun Yan",
      "Xinhai Chen",
      "Zhichao Wang",
      "Enqiang Zhou",
      "Jie Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2307.06179",
    "title": "Large Class Separation is not what you need for Relational  Reasoning-based OOD Detection",
    "abstract": "Standard recognition approaches are unable to deal with novel categories at test time. Their overconfidence on the known classes makes the predictions unreliable for safety-critical applications such as healthcare or autonomous driving. Out-Of-Distribution (OOD) detection methods provide a solution by identifying semantic novelty. Most of these methods leverage a learning stage on the known data, which means training (or fine-tuning) a model to capture the concept of normality. This process is clearly sensitive to the amount of available samples and might be computationally expensive for on-board systems. A viable alternative is that of evaluating similarities in the embedding space produced by large pre-trained models without any further learning effort. We focus exactly on such a fine-tuning-free OOD detection setting. This works presents an in-depth analysis of the recently introduced relational reasoning pre-training and investigates the properties of the learned embedding, highlighting the existence of a correlation between the inter-class feature distance and the OOD detection accuracy. As the class separation depends on the chosen pre-training objective, we propose an alternative loss function to control the inter-class margin, and we show its advantage with thorough experiments. ",
    "url": "https://arxiv.org/abs/2307.06179",
    "authors": [
      "Lorenzo Li Lu",
      "Giulia D'Ascenzi",
      "Francesco Cappio Borlino",
      "Tatiana Tommasi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.06244",
    "title": "Diffusion Based Multi-Agent Adversarial Tracking",
    "abstract": "Target tracking plays a crucial role in real-world scenarios, particularly in drug-trafficking interdiction, where the knowledge of an adversarial target's location is often limited. Improving autonomous tracking systems will enable unmanned aerial, surface, and underwater vehicles to better assist in interdicting smugglers that use manned surface, semi-submersible, and aerial vessels. As unmanned drones proliferate, accurate autonomous target estimation is even more crucial for security and safety. This paper presents Constrained Agent-based Diffusion for Enhanced Multi-Agent Tracking (CADENCE), an approach aimed at generating comprehensive predictions of adversary locations by leveraging past sparse state information. To assess the effectiveness of this approach, we evaluate predictions on single-target and multi-target pursuit environments, employing Monte-Carlo sampling of the diffusion model to estimate the probability associated with each generated trajectory. We propose a novel cross-attention based diffusion model that utilizes constraint-based sampling to generate multimodal track hypotheses. Our single-target model surpasses the performance of all baseline methods on Average Displacement Error (ADE) for predictions across all time horizons. ",
    "url": "https://arxiv.org/abs/2307.06244",
    "authors": [
      "Sean Ye",
      "Manisha Natarajan",
      "Zixuan Wu",
      "Matthew Gombolay"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2307.06260",
    "title": "UGCANet: A Unified Global Context-Aware Transformer-based Network with  Feature Alignment for Endoscopic Image Analysis",
    "abstract": "Gastrointestinal endoscopy is a medical procedure that utilizes a flexible tube equipped with a camera and other instruments to examine the digestive tract. This minimally invasive technique allows for diagnosing and managing various gastrointestinal conditions, including inflammatory bowel disease, gastrointestinal bleeding, and colon cancer. The early detection and identification of lesions in the upper gastrointestinal tract and the identification of malignant polyps that may pose a risk of cancer development are critical components of gastrointestinal endoscopy's diagnostic and therapeutic applications. Therefore, enhancing the detection rates of gastrointestinal disorders can significantly improve a patient's prognosis by increasing the likelihood of timely medical intervention, which may prolong the patient's lifespan and improve overall health outcomes. This paper presents a novel Transformer-based deep neural network designed to perform multiple tasks simultaneously, thereby enabling accurate identification of both upper gastrointestinal tract lesions and colon polyps. Our approach proposes a unique global context-aware module and leverages the powerful MiT backbone, along with a feature alignment block, to enhance the network's representation capability. This novel design leads to a significant improvement in performance across various endoscopic diagnosis tasks. Extensive experiments demonstrate the superior performance of our method compared to other state-of-the-art approaches. ",
    "url": "https://arxiv.org/abs/2307.06260",
    "authors": [
      "Pham Vu Hung",
      "Nguyen Duy Manh",
      "Nguyen Thi Oanh",
      "Nguyen Thi Thuy",
      "Dinh Viet Sang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.06262",
    "title": "An Architecture for Control Plane Slicing in Beyond 5G Networks",
    "abstract": "To accommodate various use cases with differing characteristics, the Fifth Generation (5G) mobile communications system intends to utilize network slicing. Network slicing enables the creation of multiple logical networks over a shared physical network infrastructure. While the problems such as resource allocation for multiple slices in mobile networks have been explored in considerable detail in the existing literature, the suitability of the existing mobile network architecture to support network slicing has not been analysed adequately. We think the existing 5G System (5GS) architecture suffers from certain limitations, such as a lack of slice isolation in its control plane. This work focuses on the future evolution of the existing 5GS architecture from a slicing perspective, especially that of its control plane, addressing some of the limitations of the existing 5GS architecture. We propose a new network architecture which enables efficient slicing in beyond 5G networks. The proposed architecture results in enhanced modularity and scalability of the control plane in sliced mobile networks. In addition, it also brings slice isolation to the control plane, which is not feasible in the existing 5G system. We also present a performance evaluation that confirms the improved performance and scalability of the proposed system viz a viz the existing 5G system. ",
    "url": "https://arxiv.org/abs/2307.06262",
    "authors": [
      "Rashmi Yadav",
      "Rashmi Kamran",
      "Pranav Jha",
      "Abhay Karandikar"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.06272",
    "title": "Exposing the Fake: Effective Diffusion-Generated Images Detection",
    "abstract": "Image synthesis has seen significant advancements with the advent of diffusion-based generative models like Denoising Diffusion Probabilistic Models (DDPM) and text-to-image diffusion models. Despite their efficacy, there is a dearth of research dedicated to detecting diffusion-generated images, which could pose potential security and privacy risks. This paper addresses this gap by proposing a novel detection method called Stepwise Error for Diffusion-generated Image Detection (SeDID). Comprising statistical-based $\\text{SeDID}_{\\text{Stat}}$ and neural network-based $\\text{SeDID}_{\\text{NNs}}$, SeDID exploits the unique attributes of diffusion models, namely deterministic reverse and deterministic denoising computation errors. Our evaluations demonstrate SeDID's superior performance over existing methods when applied to diffusion models. Thus, our work makes a pivotal contribution to distinguishing diffusion model-generated images, marking a significant step in the domain of artificial intelligence security. ",
    "url": "https://arxiv.org/abs/2307.06272",
    "authors": [
      "Ruipeng Ma",
      "Jinhao Duan",
      "Fei Kong",
      "Xiaoshuang Shi",
      "Kaidi Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.06275",
    "title": "Power Loss Minimization of Distribution Network using Different Grid  Strategies",
    "abstract": "Power losses in electrical power systems especially, distribution systems, occur due to several environmental and technical factors. Transmission & Distribution line losses are normally 17% and 50% respectively. These losses are due to the inappropriate size of the conductor, long distribution lines, low power factor, overloading of lines etc. The power losses cause economic loss and reduce the system's reliability. The reliability of electrical power systems can be improved by decreasing network power loss and by improving the voltage profile. In radial distribution systems, power loss can also be minimized through Distributed Generation (DG) system placement. In this thesis, three different grid strategies including real power sharing, reactive power injection and transformer tap changing are discussed and used to minimize line losses. These three proposed grid strategies have been implemented using a power flow study based on Newton-Raphson (NR) and Genetic Algorithm (GA). To minimize line losses, both methods have been used for each grid strategy. The used test system in this research work is the IEEE-30 bus radial distribution system. Results obtained after simulation of each grid strategy using NR and GA shows that real load sharing is reliable with respect to minimization of line loss as compared to reactive power injection and transformer tap changing grid strategy. Comparative analysis has been performed between GA and NR for each grid strategy, results show that Genetic Algorithm is more reliable and efficient for loss minimization as compared to Newton-Raphson. In the base case for optimum power flow solution using genetic algorithm and Newton-Raphson, real line losses are 9.481475MW and 17.557MW respectively. So, GA is preferable for each proposed grid strategy to minimize line losses than NR. ",
    "url": "https://arxiv.org/abs/2307.06275",
    "authors": [
      "Umar Jamil"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2307.06287",
    "title": "Rational Neural Network Controllers",
    "abstract": "Neural networks have shown great success in many machine learning related tasks, due to their ability to act as general function approximators. Recent work has demonstrated the effectiveness of neural networks in control systems (known as neural feedback loops), most notably by using a neural network as a controller. However, one of the big challenges of this approach is that neural networks have been shown to be sensitive to adversarial attacks. This means that, unless they are designed properly, they are not an ideal candidate for controllers due to issues with robustness and uncertainty, which are pivotal aspects of control systems. There has been initial work on robustness to both analyse and design dynamical systems with neural network controllers. However, one prominent issue with these methods is that they use existing neural network architectures tailored for traditional machine learning tasks. These structures may not be appropriate for neural network controllers and it is important to consider alternative architectures. This paper considers rational neural networks and presents novel rational activation functions, which can be used effectively in robustness problems for neural feedback loops. Rational activation functions are replaced by a general rational neural network structure, which is convex in the neural network's parameters. A method is proposed to recover a stabilising controller from a Sum of Squares feasibility test. This approach is then applied to a refined rational neural network which is more compatible with Sum of Squares programming. Numerical examples show that this method can successfully recover stabilising rational neural network controllers for neural feedback loops with non-linear plants with noise and parametric uncertainty. ",
    "url": "https://arxiv.org/abs/2307.06287",
    "authors": [
      "Matthew Newton",
      "Antonis Papachristodoulou"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.06299",
    "title": "Towards a Certified Proof Checker for Deep Neural Network Verification",
    "abstract": "Recent developments in deep neural networks (DNNs) have led to their adoption in safety-critical systems, which in turn has heightened the need for guaranteeing their safety. These safety properties of DNNs can be proven using tools developed by the verification community. However, these tools are themselves prone to implementation bugs and numerical stability problems, which make their reliability questionable. To overcome this, some verifiers produce proofs of their results which can be checked by a trusted checker. In this work, we present a novel implementation of a proof checker for DNN verification. It improves on existing implementations by offering numerical stability and greater verifiability. To achieve this, we leverage two key capabilities of Imandra, an industrial theorem prover: its support of infinite precision real arithmetic and its formal verification infrastructure. So far, we have implemented a proof checker in Imandra, specified its correctness properties and started to verify the checker's compliance with them. Our ongoing work focuses on completing the formal verification of the checker and further optimizing its performance. ",
    "url": "https://arxiv.org/abs/2307.06299",
    "authors": [
      "Remi Desmartin",
      "Omri Isac",
      "Grant Passmore",
      "Kathrin Stark",
      "Guy Katz",
      "Ekaterina Komendantskaya"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2307.06334",
    "title": "Analysis of Half-Duplex Two-Node Slotted ALOHA Network With Asynchronous  Traffic",
    "abstract": "Despite the long history of research on slotted ALOHA, the exact analysis of the average delay is still in question as the performance of each node is coupled with the activity of other nodes. In this paper, we consider a network comprised of two half-duplex transmitter nodes with asynchronous arrival traffic that follow the slotted ALOHA protocol. We propose a new queueing theoretic model based on the state-dependent queues to analyze the network. In addition, we derive the exact values of delay and stability region for each node. The numerical results demonstrate the accuracy of our proposed model. ",
    "url": "https://arxiv.org/abs/2307.06334",
    "authors": [
      "Seyed Ali Hashemian",
      "Farid Ashtiani"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.06335",
    "title": "Neural Free-Viewpoint Relighting for Glossy Indirect Illumination",
    "abstract": "Precomputed Radiance Transfer (PRT) remains an attractive solution for real-time rendering of complex light transport effects such as glossy global illumination. After precomputation, we can relight the scene with new environment maps while changing viewpoint in real-time. However, practical PRT methods are usually limited to low-frequency spherical harmonic lighting. All-frequency techniques using wavelets are promising but have so far had little practical impact. The curse of dimensionality and much higher data requirements have typically limited them to relighting with fixed view or only direct lighting with triple product integrals. In this paper, we demonstrate a hybrid neural-wavelet PRT solution to high-frequency indirect illumination, including glossy reflection, for relighting with changing view. Specifically, we seek to represent the light transport function in the Haar wavelet basis. For global illumination, we learn the wavelet transport using a small multi-layer perceptron (MLP) applied to a feature field as a function of spatial location and wavelet index, with reflected direction and material parameters being other MLP inputs. We optimize/learn the feature field (compactly represented by a tensor decomposition) and MLP parameters from multiple images of the scene under different lighting and viewing conditions. We demonstrate real-time (512 x 512 at 24 FPS, 800 x 600 at 13 FPS) precomputed rendering of challenging scenes involving view-dependent reflections and even caustics. ",
    "url": "https://arxiv.org/abs/2307.06335",
    "authors": [
      "Nithin Raghavan",
      "Yan Xiao",
      "Kai-En Lin",
      "Tiancheng Sun",
      "Sai Bi",
      "Zexiang Xu",
      "Tzu-Mao Li",
      "Ravi Ramamoorthi"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05519",
    "title": "Physical Color Calibration of Digital Pathology Scanners for Robust  Artificial Intelligence Assisted Cancer Diagnosis",
    "abstract": "The potential of artificial intelligence (AI) in digital pathology is limited by technical inconsistencies in the production of whole slide images (WSIs), leading to degraded AI performance and posing a challenge for widespread clinical application as fine-tuning algorithms for each new site is impractical. Changes in the imaging workflow can also lead to compromised diagnoses and patient safety risks. We evaluated whether physical color calibration of scanners can standardize WSI appearance and enable robust AI performance. We employed a color calibration slide in four different laboratories and evaluated its impact on the performance of an AI system for prostate cancer diagnosis on 1,161 WSIs. Color standardization resulted in consistently improved AI model calibration and significant improvements in Gleason grading performance. The study demonstrates that physical color calibration provides a potential solution to the variation introduced by different scanners, making AI-based cancer diagnostics more reliable and applicable in clinical settings. ",
    "url": "https://arxiv.org/abs/2307.05519",
    "authors": [
      "Xiaoyi Ji",
      "Richard Salmon",
      "Nita Mulliqi",
      "Umair Khan",
      "Yinxi Wang",
      "Anders Blilie",
      "Henrik Olsson",
      "Bodil Ginnerup Pedersen",
      "Karina Dalsgaard Sørensen",
      "Benedicte Parm Ulhøi",
      "Svein R Kjosavik",
      "Emilius AM Janssen",
      "Mattias Rantalainen",
      "Lars Egevad",
      "Pekka Ruusuvuori",
      "Martin Eklund",
      "Kimmo Kartasalo"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2307.05592",
    "title": "Functional PCA and Deep Neural Networks-based Bayesian Inverse  Uncertainty Quantification with Transient Experimental Data",
    "abstract": "Inverse UQ is the process to inversely quantify the model input uncertainties based on experimental data. This work focuses on developing an inverse UQ process for time-dependent responses, using dimensionality reduction by functional principal component analysis (PCA) and deep neural network (DNN)-based surrogate models. The demonstration is based on the inverse UQ of TRACE physical model parameters using the FEBA transient experimental data. The measurement data is time-dependent peak cladding temperature (PCT). Since the quantity-of-interest (QoI) is time-dependent that corresponds to infinite-dimensional responses, PCA is used to reduce the QoI dimension while preserving the transient profile of the PCT, in order to make the inverse UQ process more efficient. However, conventional PCA applied directly to the PCT time series profiles can hardly represent the data precisely due to the sudden temperature drop at the time of quenching. As a result, a functional alignment method is used to separate the phase and amplitude information of the transient PCT profiles before dimensionality reduction. DNNs are then trained using PC scores from functional PCA to build surrogate models of TRACE in order to reduce the computational cost in Markov Chain Monte Carlo sampling. Bayesian neural networks are used to estimate the uncertainties of DNN surrogate model predictions. In this study, we compared four different inverse UQ processes with different dimensionality reduction methods and surrogate models. The proposed approach shows an improvement in reducing the dimension of the TRACE transient simulations, and the forward propagation of inverse UQ results has a better agreement with the experimental data. ",
    "url": "https://arxiv.org/abs/2307.05592",
    "authors": [
      "Ziyu Xie",
      "Mahmoud Yaseen",
      "Xu Wu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05701",
    "title": "Computing Subset Vertex Covers in $H$-Free Graphs",
    "abstract": "We consider a natural generalization of Vertex Cover: the Subset Vertex Cover problem, which is to decide for a graph $G=(V,E)$, a subset $T \\subseteq V$ and integer $k$, if $V$ has a subset $S$ of size at most $k$, such that $S$ contains at least one end-vertex of every edge incident to a vertex of $T$. A graph is $H$-free if it does not contain $H$ as an induced subgraph. We solve two open problems from the literature by proving that Subset Vertex Cover is NP-complete on subcubic (claw,diamond)-free planar graphs and on $2$-unipolar graphs, a subclass of $2P_3$-free weakly chordal graphs. Our results show for the first time that Subset Vertex Cover is computationally harder than Vertex Cover (under P $\\neq$ NP). We also prove new polynomial time results. We first give a dichotomy on graphs where $G[T]$ is $H$-free. Namely, we show that Subset Vertex Cover is polynomial-time solvable on graphs $G$, for which $G[T]$ is $H$-free, if $H = sP_1 + tP_2$ and NP-complete otherwise. Moreover, we prove that Subset Vertex Cover is polynomial-time solvable for $(sP_1 + P_2 + P_3)$-free graphs and bounded mim-width graphs. By combining our new results with known results we obtain a partial complexity classification for Subset Vertex Cover on $H$-free graphs. ",
    "url": "https://arxiv.org/abs/2307.05701",
    "authors": [
      "Nick Brettell",
      "Jelle J. Oostveen",
      "Sukanya Pandey",
      "Daniël Paulusma",
      "Erik Jan van Leeuwen"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2307.05794",
    "title": "Machine Learning Study of the Extended Drug-target Interaction Network  informed by Pain Related Voltage-Gated Sodium Channels",
    "abstract": "Pain is a significant global health issue, and the current treatment options for pain management have limitations in terms of effectiveness, side effects, and potential for addiction. There is a pressing need for improved pain treatments and the development of new drugs. Voltage-gated sodium channels, particularly Nav1.3, Nav1.7, Nav1.8, and Nav1.9, play a crucial role in neuronal excitability and are predominantly expressed in the peripheral nervous system. Targeting these channels may provide a means to treat pain while minimizing central and cardiac adverse effects. In this study, we construct protein-protein interaction (PPI) networks based on pain-related sodium channels and develop a corresponding drug-target interaction (DTI) network to identify potential lead compounds for pain management. To ensure reliable machine learning predictions, we carefully select 111 inhibitor datasets from a pool of over 1,000 targets in the PPI network. We employ three distinct machine learning algorithms combined with advanced natural language processing (NLP)-based embeddings, specifically pre-trained transformer and autoencoder representations. Through a systematic screening process, we evaluate the side effects and repurposing potential of over 150,000 drug candidates targeting Nav1.7 and Nav1.8 sodium channels. Additionally, we assess the ADMET (absorption, distribution, metabolism, excretion, and toxicity) properties of these candidates to identify leads with near-optimal characteristics. Our strategy provides an innovative platform for the pharmacological development of pain treatments, offering the potential for improved efficacy and reduced side effects. ",
    "url": "https://arxiv.org/abs/2307.05794",
    "authors": [
      "Long Chen",
      "Jian Jiang",
      "Bozheng Dou",
      "Hongsong Feng",
      "Jie Liu",
      "Yueying Zhu",
      "Bengong Zhang",
      "Tianshou Zhou",
      "Guo-Wei Wei"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05804",
    "title": "Improving Segmentation and Detection of Lesions in CT Scans Using  Intensity Distribution Supervision",
    "abstract": "We propose a method to incorporate the intensity information of a target lesion on CT scans in training segmentation and detection networks. We first build an intensity-based lesion probability (ILP) function from an intensity histogram of the target lesion. It is used to compute the probability of being the lesion for each voxel based on its intensity. Finally, the computed ILP map of each input CT scan is provided as additional supervision for network training, which aims to inform the network about possible lesion locations in terms of intensity values at no additional labeling cost. The method was applied to improve the segmentation of three different lesion types, namely, small bowel carcinoid tumor, kidney tumor, and lung nodule. The effectiveness of the proposed method on a detection task was also investigated. We observed improvements of 41.3% -> 47.8%, 74.2% -> 76.0%, and 26.4% -> 32.7% in segmenting small bowel carcinoid tumor, kidney tumor, and lung nodule, respectively, in terms of per case Dice scores. An improvement of 64.6% -> 75.5% was achieved in detecting kidney tumors in terms of average precision. The results of different usages of the ILP map and the effect of varied amount of training data are also presented. ",
    "url": "https://arxiv.org/abs/2307.05804",
    "authors": [
      "Seung Yeon Shin",
      "Thomas C. Shen",
      "Ronald M. Summers"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05811",
    "title": "Twin-width of graphs on surfaces",
    "abstract": "Twin-width is a width parameter introduced by Bonnet, Kim, Thomass\\'e and Watrigant [FOCS'20, JACM'22], which has many structural and algorithmic applications. We prove that the twin-width of every graph embeddable in a surface of Euler genus $g$ is $18\\sqrt{47g}+O(1)$, which is asymptotically best possible as it asymptotically differs from the lower bound by a constant multiplicative factor. Our proof also yields a quadratic time algorithm to find a corresponding contraction sequence. To prove the upper bound on twin-width of graphs embeddable in surfaces, we provide a stronger version of the Product Structure Theorem for graphs of Euler genus $g$ that asserts that every such graph is a subgraph of the strong product of a path and a graph with a tree-decomposition with all bags of size at most eight with a single exceptional bag of size $\\max\\{8,32g-27\\}$. ",
    "url": "https://arxiv.org/abs/2307.05811",
    "authors": [
      "Daniel Kráľ",
      "Kristýna Pekárková",
      "Kenny Štorgel"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2307.05854",
    "title": "On the Characterization of Quantum Flip Stars with Quantum Network  Tomography",
    "abstract": "The experimental realization of quantum information systems will be difficult due to how sensitive quantum information is to noise. Overcoming this sensitivity is central to designing quantum networks capable of transmitting quantum information reliably over large distances. Moreover, the ability to characterize communication noise in quantum networks is crucial in developing network protocols capable of overcoming the effects of noise in quantum networks. In this context, quantum network tomography refers to the characterization of channel noise in a quantum network through end-to-end measurements. In this work, we propose network tomography protocols for quantum star networks formed by quantum channels characterized by a single, non-trivial Pauli operator. Our results further the end-to-end characterization of quantum bit-flip star networks by introducing tomography protocols where state distribution and measurements are designed separately. We build upon previously proposed quantum network tomography protocols, as well as provide novel methods for the unique characterization of bit-flip probabilities in stars. We introduce a theoretical benchmark based on the Quantum Fisher Information matrix to compare the efficiency of quantum network protocols. We apply our techniques to the protocols proposed, and provide an initial analysis on the potential benefits of entanglement for Quantum Network Tomography. Furthermore, we simulate the proposed protocols using NetSquid to assess the convergence properties of the estimators obtained for particular parameter regimes. Our findings show that the efficiency of protocols depend on parameter values and motivate the search for adaptive quantum network tomography protocols. ",
    "url": "https://arxiv.org/abs/2307.05854",
    "authors": [
      "Matheus Guedes de Andrade",
      "Jake Navas",
      "Inès Montaño",
      "Don Towsley"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.05881",
    "title": "Dynamic Prediction using Time-Dependent Cox Survival Neural Network",
    "abstract": "The target of dynamic prediction is to provide individualized risk predictions over time which can be updated as new data become available. Motivated by establishing a dynamic prediction model for the progressive eye disease, age-related macular degeneration (AMD), we proposed a time-dependent Cox model-based survival neural network (tdCoxSNN) to predict its progression on a continuous time scale using longitudinal fundus images. tdCoxSNN extends the time-dependent Cox model by utilizing a neural network to model the non-linear effect of the time-dependent covariates on the survival outcome. Additionally, by incorporating the convolutional neural network (CNN), tdCoxSNN can take the longitudinal raw images as input. We evaluate and compare our proposed method with joint modeling and landmarking approaches through comprehensive simulations using two time-dependent accuracy metrics, the Brier Score and dynamic AUC. We applied the proposed approach to two real datasets. One is a large AMD study, the Age-Related Eye Disease Study (AREDS), in which more than 50,000 fundus images were captured over a period of 12 years for more than 4,000 participants. Another is a public dataset of the primary biliary cirrhosis (PBC) disease, in which multiple lab tests were longitudinally collected to predict the time-to-liver transplant. Our approach achieves satisfactory prediction performance in both simulation studies and the two real data analyses. tdCoxSNN was implemented in PyTorch, Tensorflow, and R-Tensorflow. ",
    "url": "https://arxiv.org/abs/2307.05881",
    "authors": [
      "Lang Zeng",
      "Jipeng Zhang",
      "Wei Chen",
      "Ying Ding"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05890",
    "title": "FreeSeed: Frequency-band-aware and Self-guided Network for Sparse-view  CT Reconstruction",
    "abstract": "Sparse-view computed tomography (CT) is a promising solution for expediting the scanning process and mitigating radiation exposure to patients, the reconstructed images, however, contain severe streak artifacts, compromising subsequent screening and diagnosis. Recently, deep learning-based image post-processing methods along with their dual-domain counterparts have shown promising results. However, existing methods usually produce over-smoothed images with loss of details due to (1) the difficulty in accurately modeling the artifact patterns in the image domain, and (2) the equal treatment of each pixel in the loss function. To address these issues, we concentrate on the image post-processing and propose a simple yet effective FREquency-band-awarE and SElf-guidED network, termed FreeSeed, which can effectively remove artifact and recover missing detail from the contaminated sparse-view CT images. Specifically, we first propose a frequency-band-aware artifact modeling network (FreeNet), which learns artifact-related frequency-band attention in Fourier domain for better modeling the globally distributed streak artifact on the sparse-view CT images. We then introduce a self-guided artifact refinement network (SeedNet), which leverages the predicted artifact to assist FreeNet in continuing to refine the severely corrupted details. Extensive experiments demonstrate the superior performance of FreeSeed and its dual-domain counterpart over the state-of-the-art sparse-view CT reconstruction methods. Source code is made available at https://github.com/Masaaki-75/freeseed. ",
    "url": "https://arxiv.org/abs/2307.05890",
    "authors": [
      "Chenglong Ma",
      "Zilong Li",
      "Junping Zhang",
      "Yi Zhang",
      "Hongming Shan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.05893",
    "title": "Deep Unrolling for Nonconvex Robust Principal Component Analysis",
    "abstract": "We design algorithms for Robust Principal Component Analysis (RPCA) which consists in decomposing a matrix into the sum of a low rank matrix and a sparse matrix. We propose a deep unrolled algorithm based on an accelerated alternating projection algorithm which aims to solve RPCA in its nonconvex form. The proposed procedure combines benefits of deep neural networks and the interpretability of the original algorithm and it automatically learns hyperparameters. We demonstrate the unrolled algorithm's effectiveness on synthetic datasets and also on a face modeling problem, where it leads to both better numerical and visual performances. ",
    "url": "https://arxiv.org/abs/2307.05893",
    "authors": [
      "Elizabeth Z. C. Tan",
      "Caroline Chaux",
      "Emmanuel Soubies",
      "Vincent Y. F. Tan"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05975",
    "title": "Outlier detection in regression: conic quadratic formulations",
    "abstract": "In many applications, when building linear regression models, it is important to account for the presence of outliers, i.e., corrupted input data points. Such problems can be formulated as mixed-integer optimization problems involving cubic terms, each given by the product of a binary variable and a quadratic term of the continuous variables. Existing approaches in the literature, typically relying on the linearization of the cubic terms using big-M constraints, suffer from weak relaxation and poor performance in practice. In this work we derive stronger second-order conic relaxations that do not involve big-M constraints. Our computational experiments indicate that the proposed formulations are several orders-of-magnitude faster than existing big-M formulations in the literature for this problem. ",
    "url": "https://arxiv.org/abs/2307.05975",
    "authors": [
      "Andrés Gómez",
      "José Neto"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.06009",
    "title": "A Linear Algebraic Framework for Dynamic Scheduling Over Memory-Equipped  Quantum Networks",
    "abstract": "Quantum Internetworking is a recent field that promises numerous interesting applications, many of which require the distribution of entanglement between arbitrary pairs of users. This work deals with the problem of scheduling in an arbitrary entanglement swapping quantum network - often called first generation quantum network - in its general topology, multicommodity, loss-aware formulation. We introduce a linear algebraic framework that exploits quantum memory through the creation of intermediate entangled links. The framework is then employed to mathematically derive a natural class of quadratic scheduling policies for quantum networks by applying Lyapunov Drift Minimization, a standard technique in classical network science. Moreover, an additional class of Max-Weight inspired policies is proposed and benchmarked, reducing significantly the computation cost, at the price of a slight performance degradation. The policies are compared in terms of information availability, localization and overall network performance through an ad-hoc simulator that admits user-provided network topologies and scheduling policies in order to showcase the potential application of the provided tools to quantum network design. ",
    "url": "https://arxiv.org/abs/2307.06009",
    "authors": [
      "Paolo Fittipaldi",
      "Anastasios Giovanidis",
      "Frédéric Grosshans"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.06250",
    "title": "Identifiability Guarantees for Causal Disentanglement from Soft  Interventions",
    "abstract": "Causal disentanglement aims to uncover a representation of data using latent variables that are interrelated through a causal model. Such a representation is identifiable if the latent model that explains the data is unique. In this paper, we focus on the scenario where unpaired observational and interventional data are available, with each intervention changing the mechanism of a latent variable. When the causal variables are fully observed, statistically consistent algorithms have been developed to identify the causal model under faithfulness assumptions. We here show that identifiability can still be achieved with unobserved causal variables, given a generalized notion of faithfulness. Our results guarantee that we can recover the latent causal model up to an equivalence class and predict the effect of unseen combinations of interventions, in the limit of infinite data. We implement our causal disentanglement framework by developing an autoencoding variational Bayes algorithm and apply it to the problem of predicting combinatorial perturbation effects in genomics. ",
    "url": "https://arxiv.org/abs/2307.06250",
    "authors": [
      "Jiaqi Zhang",
      "Chandler Squires",
      "Kristjan Greenewald",
      "Akash Srivastava",
      "Karthikeyan Shanmugam",
      "Caroline Uhler"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2104.05942",
    "title": "Recurrent Equilibrium Networks: Flexible Dynamic Models with Guaranteed  Stability and Robustness",
    "abstract": " Comments: To appear in IEEE Transactions on Automatic Control ",
    "url": "https://arxiv.org/abs/2104.05942",
    "authors": [
      "Max Revay",
      "Ruigang Wang",
      "Ian R. Manchester"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2106.09035",
    "title": "Regularization of Mixture Models for Robust Principal Graph Learning",
    "abstract": " Comments: 12 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2106.09035",
    "authors": [
      "Tony Bonnaire",
      "Aurélien Decelle",
      "Nabila Aghanim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.11337",
    "title": "Empowering General-purpose User Representation with Full-life Cycle  Behavior Modeling",
    "abstract": " Comments: Accepted by KDD 2023 ",
    "url": "https://arxiv.org/abs/2110.11337",
    "authors": [
      "Bei Yang",
      "Jie Gu",
      "Ke Liu",
      "Xiaoxiao Xu",
      "Renjun Xu",
      "Qinghui Sun",
      "Hong Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.10062",
    "title": "A sine transform based preconditioned MINRES method for all-at-once  systems from constant and variable-coefficient evolutionary PDEs",
    "abstract": " Title: A sine transform based preconditioned MINRES method for all-at-once  systems from constant and variable-coefficient evolutionary PDEs ",
    "url": "https://arxiv.org/abs/2201.10062",
    "authors": [
      "Sean Hon",
      "Po Yin Fung",
      "Jiamei Dong",
      "Stefano Serra-Capizzano"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2203.01429",
    "title": "SMTNet: Hierarchical cavitation intensity recognition based on sub-main  transfer network",
    "abstract": " Comments: we need update this paper ",
    "url": "https://arxiv.org/abs/2203.01429",
    "authors": [
      "Yu Sha",
      "Johannes Faber",
      "Shuiping Gou",
      "Bo Liu",
      "Wei Li",
      "Stefan Schramm",
      "Horst Stoecker",
      "Thomas Steckenreiter",
      "Domagoj Vnucec",
      "Nadine Wetzstein",
      "Andreas Widl",
      "Kai Zhou"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.10494",
    "title": "Lengths of Cycles in Generalized Pancake Graphs",
    "abstract": " Comments: Corrected typos. Final version to appear in Discrete Mathematics ",
    "url": "https://arxiv.org/abs/2204.10494",
    "authors": [
      "Saúl A. Blanco",
      "Charles Buehrle"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2205.01179",
    "title": "VAE-Loco: Versatile Quadruped Locomotion by Learning a Disentangled Gait  Representation",
    "abstract": " Comments: 16 pages, 13 figures, 1 table, accepted by IEEE Transactions on Robotics (T-RO) as an extended paper. arXiv admin note: substantial text overlap with arXiv:2112.04809 ",
    "url": "https://arxiv.org/abs/2205.01179",
    "authors": [
      "Alexander L. Mitchell",
      "Wolfgang Merkt",
      "Mathieu Geisert",
      "Siddhant Gangapurwala",
      "Martin Engelcke",
      "Oiwi Parker Jones",
      "Ioannis Havoutis",
      "Ingmar Posner"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.05173",
    "title": "Self-Supervised Anomaly Detection: A Survey and Outlook",
    "abstract": " Comments: 18 pages, 4 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2205.05173",
    "authors": [
      "Hadi Hojjati",
      "Thi Kieu Khanh Ho",
      "Narges Armanfard"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.08533",
    "title": "BrainCog: A Spiking Neural Network based Brain-inspired Cognitive  Intelligence Engine for Brain-inspired AI and Brain Simulation",
    "abstract": " Comments: This paper was accepted by Patterns. The accepted version can be seen at this https URL)00144-7 ",
    "url": "https://arxiv.org/abs/2207.08533",
    "authors": [
      "Yi Zeng",
      "Dongcheng Zhao",
      "Feifei Zhao",
      "Guobin Shen",
      "Yiting Dong",
      "Enmeng Lu",
      "Qian Zhang",
      "Yinqian Sun",
      "Qian Liang",
      "Yuxuan Zhao",
      "Zhuoya Zhao",
      "Hongjian Fang",
      "Yuwei Wang",
      "Yang Li",
      "Xin Liu",
      "Chengcheng Du",
      "Qingqun Kong",
      "Zizhe Ruan",
      "Weida Bi"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2208.09137",
    "title": "GreenKGC: A Lightweight Knowledge Graph Completion Method",
    "abstract": " Comments: Accepted to ACL2023 ",
    "url": "https://arxiv.org/abs/2208.09137",
    "authors": [
      "Yun-Cheng Wang",
      "Xiou Ge",
      "Bin Wang",
      "C.-C. Jay Kuo"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.10841",
    "title": "Network Slicing for eMBB, URLLC, and mMTC: An Uplink Rate-Splitting  Multiple Access Approach",
    "abstract": " Title: Network Slicing for eMBB, URLLC, and mMTC: An Uplink Rate-Splitting  Multiple Access Approach ",
    "url": "https://arxiv.org/abs/2208.10841",
    "authors": [
      "Yuanwen Liu",
      "Bruno Clerckx",
      "Petar Popovski"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2209.04129",
    "title": "A Worldwide Look Into Mobile Access Networks Through the Eyes of AmiGos",
    "abstract": " Comments: 11 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2209.04129",
    "authors": [
      "Matteo Varvello",
      "Yasir Zaki"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2210.01346",
    "title": "ImmFusion: Robust mmWave-RGB Fusion for 3D Human Body Reconstruction in  All Weather Conditions",
    "abstract": " Comments: Accepted to ICRA2023, Project Page: this https URL ",
    "url": "https://arxiv.org/abs/2210.01346",
    "authors": [
      "Anjun Chen",
      "Xiangyu Wang",
      "Kun Shi",
      "Shaohao Zhu",
      "Bin Fang",
      "Yingfeng Chen",
      "Jiming Chen",
      "Yuchi Huo",
      "Qi Ye"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.01892",
    "title": "Polysemanticity and Capacity in Neural Networks",
    "abstract": " Comments: 22 pages, 7 figures. Corrected typos in Figure 7, improved notation to distinguish column and row vectors, corrected proof in Appendix A, and other misc changes ",
    "url": "https://arxiv.org/abs/2210.01892",
    "authors": [
      "Adam Scherlis",
      "Kshitij Sachan",
      "Adam S. Jermyn",
      "Joe Benton",
      "Buck Shlegeris"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.00923",
    "title": "SpeechBlender: Speech Augmentation Framework for Mispronunciation Data  Generation",
    "abstract": " Comments: 5 pages ",
    "url": "https://arxiv.org/abs/2211.00923",
    "authors": [
      "Yassine El Kheir",
      "Shammur Absar Chowdhury",
      "Ahmed Ali",
      "Hamdy Mubarak",
      "Shazia Afzal"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2211.01753",
    "title": "Looking Beyond IoCs: Automatically Extracting Attack Patterns from  External CTI",
    "abstract": " Title: Looking Beyond IoCs: Automatically Extracting Attack Patterns from  External CTI ",
    "url": "https://arxiv.org/abs/2211.01753",
    "authors": [
      "Md Tanvirul Alam",
      "Dipkamal Bhusal",
      "Youngja Park",
      "Nidhi Rastogi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.08120",
    "title": "On the trace ratio method and Fisher's discriminant analysis for robust  multigroup classification",
    "abstract": " Title: On the trace ratio method and Fisher's discriminant analysis for robust  multigroup classification ",
    "url": "https://arxiv.org/abs/2211.08120",
    "authors": [
      "Giulia Ferrandi",
      "Igor V. Kravchenko",
      "Michiel E. Hochstenbach",
      "M. Rosário Oliveira"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2211.10962",
    "title": "PG-Schema: Schemas for Property Graphs",
    "abstract": " Comments: 26 pages ",
    "url": "https://arxiv.org/abs/2211.10962",
    "authors": [
      "Renzo Angles",
      "Angela Bonifati",
      "Stefania Dumbrava",
      "George Fletcher",
      "Alastair Green",
      "Jan Hidders",
      "Bei Li",
      "Leonid Libkin",
      "Victor Marsault",
      "Wim Martens",
      "Filip Murlak",
      "Stefan Plantikow",
      "Ognjen Savković",
      "Michael Schmidt",
      "Juan Sequeda",
      "Sławek Staworko",
      "Dominik Tomaszuk",
      "Hannes Voigt",
      "Domagoj Vrgoč",
      "Mingxi Wu",
      "Dušan Živković"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2211.11220",
    "title": "STGlow: A Flow-based Generative Framework with Dual Graphormer for  Pedestrian Trajectory Prediction",
    "abstract": " Comments: 14 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2211.11220",
    "authors": [
      "Rongqin Liang",
      "Yuanman Li",
      "Jiantao Zhou",
      "Xia Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.10258",
    "title": "In and Out-of-Domain Text Adversarial Robustness via Label Smoothing",
    "abstract": " Title: In and Out-of-Domain Text Adversarial Robustness via Label Smoothing ",
    "url": "https://arxiv.org/abs/2212.10258",
    "authors": [
      "Yahan Yang",
      "Soham Dan",
      "Dan Roth",
      "Insup Lee"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.12386",
    "title": "Plugin estimators for selective classification with out-of-distribution  detection",
    "abstract": " Title: Plugin estimators for selective classification with out-of-distribution  detection ",
    "url": "https://arxiv.org/abs/2301.12386",
    "authors": [
      "Harikrishna Narasimhan",
      "Aditya Krishna Menon",
      "Wittawat Jitkrittum",
      "Sanjiv Kumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.00559",
    "title": "Structured mutation inspired by evolutionary theory enriches population  performance and diversity",
    "abstract": " Title: Structured mutation inspired by evolutionary theory enriches population  performance and diversity ",
    "url": "https://arxiv.org/abs/2302.00559",
    "authors": [
      "Stefano Tiso",
      "Pedro Carvalho",
      "Nuno Lourenço",
      "Penousal Machado"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2302.00766",
    "title": "Privacy Risk for anisotropic Langevin dynamics using relative entropy  bounds",
    "abstract": " Title: Privacy Risk for anisotropic Langevin dynamics using relative entropy  bounds ",
    "url": "https://arxiv.org/abs/2302.00766",
    "authors": [
      "Anastasia Borovykh",
      "Nikolas Kantas",
      "Panos Parpas",
      "Greg Pavliotis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06375",
    "title": "One Transformer for All Time Series: Representing and Training with  Time-Dependent Heterogeneous Tabular Data",
    "abstract": " Comments: 9 pages, 2 figures, 7 tables ",
    "url": "https://arxiv.org/abs/2302.06375",
    "authors": [
      "Simone Luetto",
      "Fabrizio Garuti",
      "Enver Sangineto",
      "Lorenzo Forni",
      "Rita Cucchiara"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.08992",
    "title": "Beware of Pickpockets: A Practical Attack against Blocking Cards",
    "abstract": " Title: Beware of Pickpockets: A Practical Attack against Blocking Cards ",
    "url": "https://arxiv.org/abs/2302.08992",
    "authors": [
      "Marco Alecci",
      "Luca Attanasio",
      "Alessandro Brighente",
      "Mauro Conti",
      "Eleonora Losiouk",
      "Hideki Ochiai",
      "Federico Turrin"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.09582",
    "title": "Language-Specific Representation of Emotion-Concept Knowledge Causally  Supports Emotion Inference",
    "abstract": " Comments: 39 pages, 13 figures, 2 tables, major revisions over previous versions ",
    "url": "https://arxiv.org/abs/2302.09582",
    "authors": [
      "Ming Li",
      "Yusheng Su",
      "Hsiu-Yuan Huang",
      "Jiali Cheng",
      "Xin Hu",
      "Xinmiao Zhang",
      "Huadong Wang",
      "Yujia Qin",
      "Xiaozhi Wang",
      "Zhiyuan Liu",
      "Dan Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.10873",
    "title": "Context-Aware Timewise VAEs for Real-Time Vehicle Trajectory Prediction",
    "abstract": " Title: Context-Aware Timewise VAEs for Real-Time Vehicle Trajectory Prediction ",
    "url": "https://arxiv.org/abs/2302.10873",
    "authors": [
      "Pei Xu",
      "Jean-Bernard Hayet",
      "Ioannis Karamouzas"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.10975",
    "title": "Improved uncertainty quantification for neural networks with Bayesian  last layer",
    "abstract": " Comments: 10 pages, 4 figures, 1 table. This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2302.10975",
    "authors": [
      "Felix Fiedler",
      "Sergio Lucia"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2303.01350",
    "title": "Securing Verified IO Programs Against Unverified Code in F*",
    "abstract": " Comments: POPL'24 submission ",
    "url": "https://arxiv.org/abs/2303.01350",
    "authors": [
      "Cezar-Constantin Andrici",
      "Stefan Ciobaca",
      "Catalin Hritcu",
      "Guido Martínez",
      "Exequiel Rivas",
      "Éric Tanter",
      "Théo Winterhalter"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2303.04878",
    "title": "DeepGD: A Multi-Objective Black-Box Test Selection Approach for Deep  Neural Networks",
    "abstract": " Title: DeepGD: A Multi-Objective Black-Box Test Selection Approach for Deep  Neural Networks ",
    "url": "https://arxiv.org/abs/2303.04878",
    "authors": [
      "Zohreh Aghababaeyan",
      "Manel Abdellatif",
      "Mahboubeh Dadkhah",
      "Lionel Briand"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Performance (cs.PF)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2303.10703",
    "title": "CCTV-Gun: Benchmarking Handgun Detection in CCTV Images",
    "abstract": " Title: CCTV-Gun: Benchmarking Handgun Detection in CCTV Images ",
    "url": "https://arxiv.org/abs/2303.10703",
    "authors": [
      "Srikar Yellapragada",
      "Zhenghong Li",
      "Kevin Bhadresh Doshi",
      "Purva Makarand Mhasakar",
      "Heng Fan",
      "Jie Wei",
      "Erik Blasch",
      "Bin Zhang",
      "Haibin Ling"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.11615",
    "title": "Robust Table Structure Recognition with Dynamic Queries Enhanced  Detection Transformer",
    "abstract": " Comments: 18 pages, 11 figures, PR2023. arXiv admin note: substantial text overlap with arXiv:2208.04921 ",
    "url": "https://arxiv.org/abs/2303.11615",
    "authors": [
      "Jiawei Wang",
      "Weihong Lin",
      "Chixiang Ma",
      "Mingze Li",
      "Zheng Sun",
      "Lei Sun",
      "Qiang Huo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.08172",
    "title": "Pointwise convergence theorem of gradient descent in sparse deep neural  network",
    "abstract": " Title: Pointwise convergence theorem of gradient descent in sparse deep neural  network ",
    "url": "https://arxiv.org/abs/2304.08172",
    "authors": [
      "Tsuyoshi Yoneda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)",
      "Analysis of PDEs (math.AP)"
    ]
  },
  {
    "id": "arXiv:2304.08615",
    "title": "Revisiting Block-Diagonal SDP Relaxations for the Clique Number of the  Paley Graphs",
    "abstract": " Comments: To appear in SampTA 2023 ",
    "url": "https://arxiv.org/abs/2304.08615",
    "authors": [
      "Vladimir A. Kobzar",
      "Krishnan Mody"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)",
      "Combinatorics (math.CO)",
      "Number Theory (math.NT)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.08697",
    "title": "Performance Analysis and Comparison of Non-ideal Wireless PBFT and RAFT  Consensus Networks in 6G Communications",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2303.15759 ",
    "url": "https://arxiv.org/abs/2304.08697",
    "authors": [
      "Haoxiang Luo",
      "Xiangyue Yang",
      "Hongfang Yu",
      "Gang Sun",
      "Bo Lei",
      "Mohsen Guizani"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Performance (cs.PF)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.09540",
    "title": "Learning Hierarchically-Structured Concepts II: Overlapping Concepts,  and Networks With Feedback",
    "abstract": " Title: Learning Hierarchically-Structured Concepts II: Overlapping Concepts,  and Networks With Feedback ",
    "url": "https://arxiv.org/abs/2304.09540",
    "authors": [
      "Nancy Lynch",
      "Frederik Mallmann-Trenn"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2304.11574",
    "title": "Meta-multigraph Search: Rethinking Meta-structure on Heterogeneous  Information Networks",
    "abstract": " Comments: 17 pages, 10 figures. arXiv admin note: text overlap with arXiv:2211.14752 ",
    "url": "https://arxiv.org/abs/2304.11574",
    "authors": [
      "Chao Li",
      "Hao Xu",
      "Kun He"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.14455",
    "title": "Bearing-Based Network Localization Under Randomized Gossip Protocol",
    "abstract": " Comments: preprint, 6 pages, 2 figures. arXiv admin note: text overlap with arXiv:2303.14733 ",
    "url": "https://arxiv.org/abs/2304.14455",
    "authors": [
      "Nhat-Minh Le-Phan",
      "Minh Hoang Trinh",
      "Phuoc Doan Nguyen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.00429",
    "title": "A Dynamic Obstacle Tracking Strategy for Proactive Handoffs in  Millimeter-wave Networks",
    "abstract": " Title: A Dynamic Obstacle Tracking Strategy for Proactive Handoffs in  Millimeter-wave Networks ",
    "url": "https://arxiv.org/abs/2305.00429",
    "authors": [
      "Rathindra Nath Dutta",
      "Subhojit Sarkar",
      "Sasthi C. Ghosh"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.06802",
    "title": "Physics-Informed Neural Networks for Discovering Localised Eigenstates  in Disordered Media",
    "abstract": " Title: Physics-Informed Neural Networks for Discovering Localised Eigenstates  in Disordered Media ",
    "url": "https://arxiv.org/abs/2305.06802",
    "authors": [
      "Liam Harcombe",
      "Quanling Deng"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2305.12286",
    "title": "Low-Earth Satellite Orbit Determination Using Deep Convolutional  Networks with Satellite Imagery",
    "abstract": " Title: Low-Earth Satellite Orbit Determination Using Deep Convolutional  Networks with Satellite Imagery ",
    "url": "https://arxiv.org/abs/2305.12286",
    "authors": [
      "Rohit Khorana"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2305.12493",
    "title": "Contextualized End-to-End Speech Recognition with Contextual Phrase  Prediction Network",
    "abstract": " Comments: Accepted by interspeech2023 ",
    "url": "https://arxiv.org/abs/2305.12493",
    "authors": [
      "Kaixun Huang",
      "Ao Zhang",
      "Zhanheng Yang",
      "Pengcheng Guo",
      "Bingshen Mu",
      "Tianyi Xu",
      "Lei Xie"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2305.12529",
    "title": "DreamWaltz: Make a Scene with Complex 3D Animatable Avatars",
    "abstract": " Comments: project page at this https URL ",
    "url": "https://arxiv.org/abs/2305.12529",
    "authors": [
      "Yukun Huang",
      "Jianan Wang",
      "Ailing Zeng",
      "He Cao",
      "Xianbiao Qi",
      "Yukai Shi",
      "Zheng-Jun Zha",
      "Lei Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.00001",
    "title": "TinyissimoYOLO: A Quantized, Low-Memory Footprint, TinyML Object  Detection Network for Low Power Microcontrollers",
    "abstract": " Comments: Published In: 2023 IEEE 5th International Conference on Artificial Intelligence Circuits and Systems (AICAS) ",
    "url": "https://arxiv.org/abs/2306.00001",
    "authors": [
      "Julian Moosmann",
      "Marco Giordano",
      "Christian Vogt",
      "Michele Magno"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Hardware Architecture (cs.AR)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2306.04670",
    "title": "Object Detection with Transformers: A Review",
    "abstract": " Title: Object Detection with Transformers: A Review ",
    "url": "https://arxiv.org/abs/2306.04670",
    "authors": [
      "Tahira Shehzadi",
      "Khurram Azeem Hashmi",
      "Didier Stricker",
      "Muhammad Zeshan Afzal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.04934",
    "title": "On the Effectiveness of Out-of-Distribution Data in Self-Supervised  Long-Tail Learning",
    "abstract": " Title: On the Effectiveness of Out-of-Distribution Data in Self-Supervised  Long-Tail Learning ",
    "url": "https://arxiv.org/abs/2306.04934",
    "authors": [
      "Jianhong Bai",
      "Zuozhu Liu",
      "Hualiang Wang",
      "Jin Hao",
      "Yang Feng",
      "Huanpeng Chu",
      "Haoji Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.07591",
    "title": "I See Dead People: Gray-Box Adversarial Attack on Image-To-Text Models",
    "abstract": " Title: I See Dead People: Gray-Box Adversarial Attack on Image-To-Text Models ",
    "url": "https://arxiv.org/abs/2306.07591",
    "authors": [
      "Raz Lapid",
      "Moshe Sipper"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2306.07615",
    "title": "UOD: Universal One-shot Detection of Anatomical Landmarks",
    "abstract": " Comments: Eealy accepted by MICCAI 2023. 11pages, 4 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2306.07615",
    "authors": [
      "Heqin Zhu",
      "Quan Quan",
      "Qingsong Yao",
      "Zaiyi Liu",
      "S. kevin Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.10453",
    "title": "Evaluating Graph Neural Networks for Link Prediction: Current Pitfalls  and New Benchmarking",
    "abstract": " Title: Evaluating Graph Neural Networks for Link Prediction: Current Pitfalls  and New Benchmarking ",
    "url": "https://arxiv.org/abs/2306.10453",
    "authors": [
      "Juanhui Li",
      "Harry Shomer",
      "Haitao Mao",
      "Shenglai Zeng",
      "Yao Ma",
      "Neil Shah",
      "Jiliang Tang",
      "Dawei Yin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2306.10548",
    "title": "MARBLE: Music Audio Representation Benchmark for Universal Evaluation",
    "abstract": " Title: MARBLE: Music Audio Representation Benchmark for Universal Evaluation ",
    "url": "https://arxiv.org/abs/2306.10548",
    "authors": [
      "Ruibin Yuan",
      "Yinghao Ma",
      "Yizhi Li",
      "Ge Zhang",
      "Xingran Chen",
      "Hanzhi Yin",
      "Le Zhuo",
      "Yiqi Liu",
      "Jiawen Huang",
      "Zeyue Tian",
      "Binyue Deng",
      "Ningzhi Wang",
      "Chenghua Lin",
      "Emmanouil Benetos",
      "Anton Ragni",
      "Norbert Gyenge",
      "Roger Dannenberg",
      "Wenhu Chen",
      "Gus Xia",
      "Wei Xue",
      "Si Liu",
      "Shi Wang",
      "Ruibo Liu",
      "Yike Guo",
      "Jie Fu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.11270",
    "title": "Evaluating the Zero-shot Robustness of Instruction-tuned Language Models",
    "abstract": " Title: Evaluating the Zero-shot Robustness of Instruction-tuned Language Models ",
    "url": "https://arxiv.org/abs/2306.11270",
    "authors": [
      "Jiuding Sun",
      "Chantal Shaib",
      "Byron C. Wallace"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.11380",
    "title": "A Bayesian Take on Gaussian Process Networks",
    "abstract": " Title: A Bayesian Take on Gaussian Process Networks ",
    "url": "https://arxiv.org/abs/2306.11380",
    "authors": [
      "Enrico Giudice",
      "Jack Kuipers",
      "Giusi Moffa"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.13319",
    "title": "A SAT Solver and Computer Algebra Attack on the Minimum Kochen-Specker  Problem",
    "abstract": " Title: A SAT Solver and Computer Algebra Attack on the Minimum Kochen-Specker  Problem ",
    "url": "https://arxiv.org/abs/2306.13319",
    "authors": [
      "Zhengyu Li",
      "Curtis Bright",
      "Vijay Ganesh"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Computational Complexity (cs.CC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2306.15951",
    "title": "Reduce Computational Complexity for Convolutional Layers by Skipping  Zeros",
    "abstract": " Comments: To download the code of Dragon-Alpha and experimental datas, please go to this https URL ",
    "url": "https://arxiv.org/abs/2306.15951",
    "authors": [
      "Zhiyi Zhang",
      "Pengfei Zhang",
      "Zhuopin Xu",
      "Qi Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.00721",
    "title": "Neural Polytopes",
    "abstract": " Comments: 5 pages, 9 figures. v2: References added. Accepted at the 1st Workshop on the Synergy of Scientific and Machine Learning Modeling at International Conference on Machine Learning (ICML), Honolulu, Hawaii, USA. 2023 ",
    "url": "https://arxiv.org/abs/2307.00721",
    "authors": [
      "Koji Hashimoto",
      "Tomoya Naito",
      "Hisashi Naito"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Graphics (cs.GR)",
      "High Energy Physics - Theory (hep-th)",
      "Geometric Topology (math.GT)"
    ]
  },
  {
    "id": "arXiv:2307.01227",
    "title": "ESGCN: Edge Squeeze Attention Graph Convolutional Network for Traffic  Flow Forecasting",
    "abstract": " Comments: 7 Pages, 3 figures ",
    "url": "https://arxiv.org/abs/2307.01227",
    "authors": [
      "Sangrok Lee",
      "Ha Young Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.02273",
    "title": "Joint Hierarchical Priors and Adaptive Spatial Resolution for Efficient  Neural Image Compression",
    "abstract": " Title: Joint Hierarchical Priors and Adaptive Spatial Resolution for Efficient  Neural Image Compression ",
    "url": "https://arxiv.org/abs/2307.02273",
    "authors": [
      "Ahmed Ghorbel",
      "Wassim Hamidouche",
      "Luce Morin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2307.03008",
    "title": "Self-supervised learning via inter-modal reconstruction and feature  projection networks for label-efficient 3D-to-2D segmentation",
    "abstract": " Comments: To appear in MICCAI 2023. Code: this https URL ",
    "url": "https://arxiv.org/abs/2307.03008",
    "authors": [
      "José Morano",
      "Guilherme Aresta",
      "Dmitrii Lachinov",
      "Julia Mai",
      "Ursula Schmidt-Erfurth",
      "Hrvoje Bogunović"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.03544",
    "title": "Roman Numeral Analysis with Graph Neural Networks: Onset-wise  Predictions from Note-wise Features",
    "abstract": " Comments: In Proceedings of the 24th Conference of the International Society for Music Information Retrieval (ISMIR 2023), Milan, Italy ",
    "url": "https://arxiv.org/abs/2307.03544",
    "authors": [
      "Emmanouil Karystinaios",
      "Gerhard Widmer"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.04106",
    "title": "Parametric Depth Based Feature Representation Learning for Object  Detection and Segmentation in Bird's Eye View",
    "abstract": " Title: Parametric Depth Based Feature Representation Learning for Object  Detection and Segmentation in Bird's Eye View ",
    "url": "https://arxiv.org/abs/2307.04106",
    "authors": [
      "Jiayu Yang",
      "Enze Xie",
      "Miaomiao Liu",
      "Jose M. Alvarez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.04149",
    "title": "Latent Graph Attention for Enhanced Spatial Context",
    "abstract": " Comments: 20 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2307.04149",
    "authors": [
      "Ayush Singh",
      "Yash Bhambhu",
      "Himanshu Buckchash",
      "Deepak K. Gupta",
      "Dilip K. Prasad"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05034",
    "title": "Synthetic Dataset for Evaluating Complex Compositional Knowledge for  Natural Language Inference",
    "abstract": " Comments: Accepted to Natural Language Reasoning and Structured Explanations (NLRSE) Workshop, ACL 2023. For dataset, please refer this https URL and this https URL ",
    "url": "https://arxiv.org/abs/2307.05034",
    "authors": [
      "Sushma Anand Akoju",
      "Robert Vacareanu",
      "Haris Riaz",
      "Eduardo Blanco",
      "Mihai Surdeanu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.05136",
    "title": "Unveiling the Invisible: Enhanced Detection and Analysis of Deteriorated  Areas in Solar PV Modules Using Unsupervised Sensing Algorithms and 3D  Augmented Reality",
    "abstract": " Comments: 13 pages, 8 figures, 1 table ",
    "url": "https://arxiv.org/abs/2307.05136",
    "authors": [
      "Adel Oulefki",
      "Yassine Himeur",
      "Thaweesak Trongtiraku",
      "Kahina Amara",
      "Sos Agaian",
      "Samir Benbelkacem",
      "Mohamed Amine Guerroudji",
      "Mohamed Zemmouri",
      "Sahla Ferhat",
      "Nadia Zenati",
      "Shadi Atalla",
      "Wathiq Mansoor"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2307.05280",
    "title": "A Mixed Reality System for Interaction with Heterogeneous Robotic  Systems",
    "abstract": " Comments: Proceedings of the IEEE International Conference on Systems Man and Cybernetics 2023 ",
    "url": "https://arxiv.org/abs/2307.05280",
    "authors": [
      "Valeria Villani",
      "Beatrice Capelli",
      "Lorenzo Sabattini"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2307.05288",
    "title": "Navigating Uncertainty: The Role of Short-Term Trajectory Prediction in  Autonomous Vehicle Safety",
    "abstract": " Title: Navigating Uncertainty: The Role of Short-Term Trajectory Prediction in  Autonomous Vehicle Safety ",
    "url": "https://arxiv.org/abs/2307.05288",
    "authors": [
      "Sushil Sharma",
      "Ganesh Sistu",
      "Lucie Yahiaoui",
      "Arindam Das",
      "Mark Halton",
      "Ciarán Eising"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]