[
  {
    "id": "arXiv:2305.11178",
    "title": "Vanishing Activations: A Symptom of Deep Capsule Networks",
    "abstract": "Capsule Networks, an extension to Neural Networks utilizing vector or matrix representations instead of scalars, were initially developed to create a dynamic parse tree where visual concepts evolve from parts to complete objects. Early implementations of Capsule Networks achieved and maintain state-of-the-art results on various datasets. However, recent studies have revealed shortcomings in the original Capsule Network architecture, notably its failure to construct a parse tree and its susceptibility to vanishing gradients when deployed in deeper networks. This paper extends the investigation to a range of leading Capsule Network architectures, demonstrating that these issues are not confined to the original design. We argue that the majority of Capsule Network research has produced architectures that, while modestly divergent from the original Capsule Network, still retain a fundamentally similar structure. We posit that this inherent design similarity might be impeding the scalability of Capsule Networks. Our study contributes to the broader discussion on improving the robustness and scalability of Capsule Networks. ",
    "url": "https://arxiv.org/abs/2305.11178",
    "authors": [
      "Miles Everett",
      "Mingjun Zhong",
      "Georgios Leontidis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11182",
    "title": "Scalable Algorithmic Infrastructure for Computation of Social Crowding  and Viral Disease Encounters -- mContain Case Study",
    "abstract": "mContain was developed (and sparsely deployed) by MD2K center at University of Memphis in the early stages of COVID-19 pandemic to help reduce community transmission in Shelby County and Memphis metropolitan area. The application counts and displays the number of daily proximity encounters with other app users. To reduce the chances of entering crowded places, users can see the level of crowding at busy places on a map. If a user and their COVID-19 test provider both agree to share the results of their test, the app can notify other users about possible exposures to COVID-19. The smartphone application collects location and Bluetooth data and sends it to cloud for near real time processing and decisions to be sent back for visualization and interface with the user. The backend algorithmic infrastructure responsible for real time crowd estimation and contact tracing from streaming batch data use open-source cloud analytics platform Cerebral-Cortex. This project concerns about presenting the authors contributions in the algorithmic development, design and implementation of mContain application as part of the entire collaborative project. We describe the mcontain algorithmic infrastructure and major computational challenges encountered when developing and deploying this application for real-life usage. Details of the app can be found in https://mcontain.md2k.org/ ",
    "url": "https://arxiv.org/abs/2305.11182",
    "authors": [
      "Md Azim Ullah"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.11192",
    "title": "TPMDP: Threshold Personalized Multi-party Differential Privacy via  Optimal Gaussian Mechanism",
    "abstract": "In modern distributed computing applications, such as federated learning and AIoT systems, protecting privacy is crucial to prevent misbehaving parties from colluding to steal others' private information. However, guaranteeing the utility of computation outcomes while protecting all parties' privacy can be challenging, particularly when the parties' privacy requirements are highly heterogeneous. In this paper, we propose a novel privacy framework for multi-party computation called Threshold Personalized Multi-party Differential Privacy (TPMDP), which addresses a limited number of semi-honest colluding adversaries. Our framework enables each party to have a personalized privacy budget. We design a multi-party Gaussian mechanism that is easy to implement and satisfies TPMDP, wherein each party perturbs the computation outcome in a secure multi-party computation protocol using Gaussian noise. To optimize the utility of the mechanism, we cast the utility loss minimization problem into a linear programming (LP) problem. We exploit the specific structure of this LP problem to compute the optimal solution after O(n) computations, where n is the number of parties, while a generic solver may require exponentially many computations. Extensive experiments demonstrate the benefits of our approach in terms of low utility loss and high efficiency compared to existing private mechanisms that do not consider personalized privacy requirements or collusion thresholds. ",
    "url": "https://arxiv.org/abs/2305.11192",
    "authors": [
      "Jiandong Liu",
      "Lan Zhang",
      "Chaojie Lv",
      "Ting Yu",
      "Nikolaos M. Freris",
      "Xiang-Yang Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2305.11196",
    "title": "Non-volatile Reconfigurable Digital Optical Diffractive Neural Network  Based on Phase Change Material",
    "abstract": "Optical diffractive neural networks have triggered extensive research with their low power consumption and high speed in image processing. In this work, we propose a reconfigurable digital all-optical diffractive neural network (R-ODNN) structure. The optical neurons are built with Sb2Se3 phase-change material, making our network reconfigurable, digital, and non-volatile. Using three digital diffractive layers with 14,400 neurons on each and 10 photodetectors connected to a resistor network, our model achieves 94.46% accuracy for handwritten digit recognition. We also performed full-vector simulations and discussed the impact of errors to demonstrate the feasibility and robustness of the R-ODNN. ",
    "url": "https://arxiv.org/abs/2305.11196",
    "authors": [
      "Chu Wu",
      "Jingyu Zhao",
      "Qiaomu Hu",
      "Rui Zeng",
      "Minming Zhang"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Signal Processing (eess.SP)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2305.11197",
    "title": "Prediction with Incomplete Data under Agnostic Mask Distribution Shift",
    "abstract": "Data with missing values is ubiquitous in many applications. Recent years have witnessed increasing attention on prediction with only incomplete data consisting of observed features and a mask that indicates the missing pattern. Existing methods assume that the training and testing distributions are the same, which may be violated in real-world scenarios. In this paper, we consider prediction with incomplete data in the presence of distribution shift. We focus on the case where the underlying joint distribution of complete features and label is invariant, but the missing pattern, i.e., mask distribution may shift agnostically between training and testing. To achieve generalization, we leverage the observation that for each mask, there is an invariant optimal predictor. To avoid the exponential explosion when learning them separately, we approximate the optimal predictors jointly using a double parameterization technique. This has the undesirable side effect of allowing the learned predictors to rely on the intra-mask correlation and that between features and mask. We perform decorrelation to minimize this effect. Combining the techniques above, we propose a novel prediction method called StableMiss. Extensive experiments on both synthetic and real-world datasets show that StableMiss is robust and outperforms state-of-the-art methods under agnostic mask distribution shift. ",
    "url": "https://arxiv.org/abs/2305.11197",
    "authors": [
      "Yichen Zhu",
      "Jian Yuan",
      "Bo Jiang",
      "Tao Lin",
      "Haiming Jin",
      "Xinbing Wang",
      "Chenghu Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.11241",
    "title": "Evidence Networks: simple losses for fast, amortized, neural Bayesian  model comparison",
    "abstract": "Evidence Networks can enable Bayesian model comparison when state-of-the-art methods (e.g. nested sampling) fail and even when likelihoods or priors are intractable or unknown. Bayesian model comparison, i.e. the computation of Bayes factors or evidence ratios, can be cast as an optimization problem. Though the Bayesian interpretation of optimal classification is well-known, here we change perspective and present classes of loss functions that result in fast, amortized neural estimators that directly estimate convenient functions of the Bayes factor. This mitigates numerical inaccuracies associated with estimating individual model probabilities. We introduce the leaky parity-odd power (l-POP) transform, leading to the novel ``l-POP-Exponential'' loss function. We explore neural density estimation for data probability in different models, showing it to be less accurate and scalable than Evidence Networks. Multiple real-world and synthetic examples illustrate that Evidence Networks are explicitly independent of dimensionality of the parameter space and scale mildly with the complexity of the posterior probability density function. This simple yet powerful approach has broad implications for model inference tasks. As an application of Evidence Networks to real-world data we compute the Bayes factor for two models with gravitational lensing data of the Dark Energy Survey. We briefly discuss applications of our methods to other, related problems of model comparison and evaluation in implicit inference settings. ",
    "url": "https://arxiv.org/abs/2305.11241",
    "authors": [
      "Niall Jeffrey",
      "Benjamin D. Wandelt"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cosmology and Nongalactic Astrophysics (astro-ph.CO)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.11248",
    "title": "Investigating and Designing for Trust in AI-powered Code Generation  Tools",
    "abstract": "As AI-powered code generation tools such as GitHub Copilot become popular, it is crucial to understand software developers' trust in AI tools -- a key factor for tool adoption and responsible usage. However, we know little about how developers build trust with AI, nor do we understand how to design the interface of generative AI systems to facilitate their appropriate levels of trust. In this paper, we describe findings from a two-stage qualitative investigation. We first interviewed 17 developers to contextualize their notions of trust and understand their challenges in building appropriate trust in AI code generation tools. We surfaced three main challenges -- including building appropriate expectations, configuring AI tools, and validating AI suggestions. To address these challenges, we conducted a design probe study in the second stage to explore design concepts that support developers' trust-building process by 1) communicating AI performance to help users set proper expectations, 2) allowing users to configure AI by setting and adjusting preferences, and 3) offering indicators of model mechanism to support evaluation of AI suggestions. We gathered developers' feedback on how these design concepts can help them build appropriate trust in AI-powered code generation tools, as well as potential risks in design. These findings inform our proposed design recommendations on how to design for trust in AI-powered code generation tools. ",
    "url": "https://arxiv.org/abs/2305.11248",
    "authors": [
      "Ruotong Wang",
      "Ruijia Cheng",
      "Denae Ford",
      "Thomas Zimmermann"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2305.11252",
    "title": "Brain-inspired learning in artificial neural networks: a review",
    "abstract": "Artificial neural networks (ANNs) have emerged as an essential tool in machine learning, achieving remarkable success across diverse domains, including image and speech generation, game playing, and robotics. However, there exist fundamental differences between ANNs' operating mechanisms and those of the biological brain, particularly concerning learning processes. This paper presents a comprehensive review of current brain-inspired learning representations in artificial neural networks. We investigate the integration of more biologically plausible mechanisms, such as synaptic plasticity, to enhance these networks' capabilities. Moreover, we delve into the potential advantages and challenges accompanying this approach. Ultimately, we pinpoint promising avenues for future research in this rapidly advancing field, which could bring us closer to understanding the essence of intelligence. ",
    "url": "https://arxiv.org/abs/2305.11252",
    "authors": [
      "Samuel Schmidgall",
      "Jascha Achterberg",
      "Thomas Miconi",
      "Louis Kirsch",
      "Rojin Ziaei",
      "S. Pardis Hajiseyedrazi",
      "Jason Eshraghian"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2305.11288",
    "title": "Riemannian Multiclass Logistics Regression for SPD Neural Networks",
    "abstract": "Deep neural networks for learning symmetric positive definite (SPD) matrices are gaining increasing attention in machine learning. Despite the significant progress, most existing SPD networks use traditional Euclidean classifiers on approximated spaces rather than intrinsic classifiers that accurately capture the geometry of SPD manifolds. Inspired by the success of hyperbolic neural networks (HNNs), we propose Riemannian multiclass logistics regression (RMLR) for SPD networks. We introduce a general unified framework for a family of Riemannian metrics on SPD manifolds and showcase the specific $\\orth{n}$-invariant Log-Euclidean Metrics for SPD networks. Moreover, we encompass the most popular classifier in existing SPD networks as a special case of our framework. Extensive experiments on popular SPD learning benchmarks demonstrate the superiority of our classifiers. ",
    "url": "https://arxiv.org/abs/2305.11288",
    "authors": [
      "Ziheng Chen",
      "Yue Song",
      "Gaowen Liu",
      "Ramana Rao Kompella",
      "Xiaojun Wu",
      "Nicu Sebe"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11301",
    "title": "NeuSTIP: A Novel Neuro-Symbolic Model for Link and Time Prediction in  Temporal Knowledge Graphs",
    "abstract": "While Knowledge Graph Completion (KGC) on static facts is a matured field, Temporal Knowledge Graph Completion (TKGC), that incorporates validity time into static facts is still in its nascent stage. The KGC methods fall into multiple categories including embedding-based, rule-based, GNN-based, pretrained Language Model based approaches. However, such dimensions have not been explored in TKG. To that end, we propose a novel temporal neuro-symbolic model, NeuSTIP, that performs link prediction and time interval prediction in a TKG. NeuSTIP learns temporal rules in the presence of the Allen predicates that ensure the temporal consistency between neighboring predicates in a given rule. We further design a unique scoring function that evaluates the confidence of the candidate answers while performing link prediction and time interval prediction by utilizing the learned rules. Our empirical evaluation on two time interval based TKGC datasets suggests that our model outperforms state-of-the-art models for both link prediction and the time interval prediction task. ",
    "url": "https://arxiv.org/abs/2305.11301",
    "authors": [
      "Ishaan Singh",
      "Navdeep Kaur",
      "Garima Gaur",
      "Mausam"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.11307",
    "title": "Semantic Anomaly Detection with Large Language Models",
    "abstract": "As robots acquire increasingly sophisticated skills and see increasingly complex and varied environments, the threat of an edge case or anomalous failure is ever present. For example, Tesla cars have seen interesting failure modes ranging from autopilot disengagements due to inactive traffic lights carried by trucks to phantom braking caused by images of stop signs on roadside billboards. These system-level failures are not due to failures of any individual component of the autonomy stack but rather system-level deficiencies in semantic reasoning. Such edge cases, which we call \\textit{semantic anomalies}, are simple for a human to disentangle yet require insightful reasoning. To this end, we study the application of large language models (LLMs), endowed with broad contextual understanding and reasoning capabilities, to recognize these edge semantic cases. We introduce a monitoring framework for semantic anomaly detection in vision-based policies to do so. Our experiments evaluate this framework in monitoring a learned policy for object manipulation and a finite state machine policy for autonomous driving and demonstrate that an LLM-based monitor can serve as a proxy for human reasoning. Finally, we provide an extended discussion on the strengths and weaknesses of this approach and motivate a research outlook on how we can further use foundation models for semantic anomaly detection. ",
    "url": "https://arxiv.org/abs/2305.11307",
    "authors": [
      "Amine Elhafsi",
      "Rohan Sinha",
      "Christopher Agia",
      "Edward Schmerling",
      "Issa Nesnas",
      "Marco Pavone"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.11312",
    "title": "Engineering an algorithm for constructing low-stretch geometric graphs  with near-greedy average-degrees",
    "abstract": "We design and engineer Fast-Sparse-Spanner, a simple and practical (fast and memory-efficient) algorithm for constructing sparse low stretch-factor geometric graphs on large pointsets in the plane. To our knowledge, this is the first practical algorithm to construct fast low stretch-factor graphs on large pointsets with average-degrees (hence, the number of edges) competitive with that of greedy-spanners, the sparsest known class of Euclidean geometric spanners. To evaluate our implementation in terms of computation speed, memory usage, and quality of output, we performed extensive experiments with synthetic and real-world pointsets, and by comparing it to our closest competitor Bucketing, the fastest known greedy-spanner algorithm for pointsets in the plane, devised by Alewijnse et al. (Algorithmica, 2017). We always found that Fast-Sparse-Spanner generated near-greedy t-spanners while being fast and memory-efficient. Our experiment with constructing a 1.1-spanner on a large synthetic pointset with 128K points uniformly distributed within a square shows more than a 41-fold speedup with roughly a third of the memory usage of that of Bucketing, but with only a 3% increase in the average-degree of the resulting graph. In terms of diameter, the graphs generated by Fast-Sparse-Spanner beat greedy-spanners in most cases (have substantially lower diameter) while maintaining near-greedy average-degree. As a byproduct of our research, we design and engineer Fast-Stretch-Factor, a practical parallelizable algorithm that can measure the stretch-factor of any graph generated by Fast-Sparse-Spanner. Our experiments show that it is much faster than the naive Dijkstra-based stretch-factor measurement algorithm. ",
    "url": "https://arxiv.org/abs/2305.11312",
    "authors": [
      "FNU Shariful",
      "Justin Weathers",
      "Anirban Ghosh",
      "Giri Narasimhan"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2305.11322",
    "title": "SpikeCP: Delay-Adaptive Reliable Spiking Neural Networks via Conformal  Prediction",
    "abstract": "Spiking neural networks (SNNs) process time-series data via internal event-driven neural dynamics whose energy consumption depends on the number of spikes exchanged between neurons over the course of the input presentation. In typical implementations of an SNN classifier, decisions are produced after the entire input sequence has been processed, resulting in latency and energy consumption levels that are fairly uniform across inputs. Recently introduced delay-adaptive SNNs tailor the inference latency -- and, with it, the energy consumption -- to the difficulty of each example, by producing an early decision when the SNN model is sufficiently ``confident''. In this paper, we start by observing that, as an SNN processes input samples, its classification decisions tend to be first under-confident and then over-confident with respect to the decision's ground-truth, unknown, test accuracy. This makes it difficult to determine a stopping time that ensures a desired level of accuracy. To address this problem, we introduce a novel delay-adaptive SNN-based inference methodology that, wrapping around any pre-trained SNN classifier, provides guaranteed reliability for the decisions produced at input-dependent stopping times. The approach entails minimal added complexity as compared to the underlying SNN, requiring only thresholding and counting operations at run time, and it leverages tools from conformal prediction (CP). ",
    "url": "https://arxiv.org/abs/2305.11322",
    "authors": [
      "Jiechen Chen",
      "Sangwoo Park",
      "Osvaldo Simeone"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11327",
    "title": "MALM: Mask Augmentation based Local Matching for Food-Recipe Retrieval",
    "abstract": "Image-to-recipe retrieval is a challenging vision-to-language task of significant practical value. The main challenge of the task lies in the ultra-high redundancy in the long recipe and the large variation reflected in both food item combination and food item appearance. A de-facto idea to address this task is to learn a shared feature embedding space in which a food image is aligned better to its paired recipe than other recipes. However, such supervised global matching is prone to supervision collapse, i.e., only partial information that is necessary for distinguishing training pairs can be identified, while other information that is potentially useful in generalization could be lost. To mitigate such a problem, we propose a mask-augmentation-based local matching network (MALM), where an image-text matching module and a masked self-distillation module benefit each other mutually to learn generalizable cross-modality representations. On one hand, we perform local matching between the tokenized representations of image and text to locate fine-grained cross-modality correspondence explicitly. We involve representations of masked image patches in this process to alleviate overfitting resulting from local matching especially when some food items are underrepresented. On the other hand, predicting the hidden representations of the masked patches through self-distillation helps to learn general-purpose image representations that are expected to generalize better. And the multi-task nature of the model enables the representations of masked patches to be text-aware and thus facilitates the lost information reconstruction. Experimental results on Recipe1M dataset show our method can clearly outperform state-of-the-art (SOTA) methods. Our code will be available at https://github.com/MyFoodChoice/MALM_Mask_Augmentation_based_Local_Matching-_for-_Food_Recipe_Retrieval ",
    "url": "https://arxiv.org/abs/2305.11327",
    "authors": [
      "Bhanu Prakash Voutharoja",
      "Peng Wang",
      "Lei Wang",
      "Vivienne Guan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2305.11334",
    "title": "Writing your own book: A method for going from closed to open book QA to  improve robustness and performance of smaller LLMs",
    "abstract": "We introduce two novel methods, Tree-Search and Self-contextualizing QA, designed to enhance the performance of large language models (LLMs) in question-answering tasks. Tree-Search is a sampling technique specifically created to extract diverse information from an LLM for a given prompt. Self-contextualizing QA leverages Tree-Search to enable the model to create its own context using a wide range of information relevant to the prompt, evaluate it explicitly and return a open book answer to the initial prompt . We demonstrate that the quality of generated answers improves according to various metrics, including accuracy, informativeness, coherence, and consistency, as evaluated by GPT3.5(text-davinci-003). Furthermore, we show that our methods result in increased robustness and that performance is positively correlated with tree size, benefiting both answer quality and robustness. Finally, we discuss other promising applications of Tree-Search, highlighting its potential to enhance a broad range of tasks beyond question-answering. \\noindent We also discuss several areas for future work, including refining the Tree-Search and Self-Contextualizing QA methods, improving the coherence of the generated context, and investigating the impact of bootstrapping on model robustness ",
    "url": "https://arxiv.org/abs/2305.11334",
    "authors": [
      "Giorgi Kokaia",
      "Pratyush Sinha",
      "Yutong Jiang",
      "Nozha Boujemaa"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.11338",
    "title": "Coordinated Transformer with Position \\& Sample-aware Central Loss for  Anatomical Landmark Detection",
    "abstract": "Heatmap-based anatomical landmark detection is still facing two unresolved challenges: 1) inability to accurately evaluate the distribution of heatmap; 2) inability to effectively exploit global spatial structure information. To address the computational inability challenge, we propose a novel position-aware and sample-aware central loss. Specifically, our central loss can absorb position information, enabling accurate evaluation of the heatmap distribution. More advanced is that our central loss is sample-aware, which can adaptively distinguish easy and hard samples and make the model more focused on hard samples while solving the challenge of extreme imbalance between landmarks and non-landmarks. To address the challenge of ignoring structure information, a Coordinated Transformer, called CoorTransformer, is proposed, which establishes long-range dependencies under the guidance of landmark coordination information, making the attention more focused on the sparse landmarks while taking advantage of global spatial structure. Furthermore, CoorTransformer can speed up convergence, effectively avoiding the defect that Transformers have difficulty converging in sparse representation learning. Using the advanced CoorTransformer and central loss, we propose a generalized detection model that can handle various scenarios, inherently exploiting the underlying relationship between landmarks and incorporating rich structural knowledge around the target landmarks. We analyzed and evaluated CoorTransformer and central loss on three challenging landmark detection tasks. The experimental results show that our CoorTransformer outperforms state-of-the-art methods, and the central loss significantly improves the performance of the model with p-values< 0.05. ",
    "url": "https://arxiv.org/abs/2305.11338",
    "authors": [
      "Qikui Zhu",
      "Yihui Bi",
      "Danxin Wang",
      "Xiangpeng Chu",
      "Jie Chen",
      "Yanqing Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.11347",
    "title": "Quantifying the robustness of deep multispectral segmentation models  against natural perturbations and data poisoning",
    "abstract": "In overhead image segmentation tasks, including additional spectral bands beyond the traditional RGB channels can improve model performance. However, it is still unclear how incorporating this additional data impacts model robustness to adversarial attacks and natural perturbations. For adversarial robustness, the additional information could improve the model's ability to distinguish malicious inputs, or simply provide new attack avenues and vulnerabilities. For natural perturbations, the additional information could better inform model decisions and weaken perturbation effects or have no significant influence at all. In this work, we seek to characterize the performance and robustness of a multispectral (RGB and near infrared) image segmentation model subjected to adversarial attacks and natural perturbations. While existing adversarial and natural robustness research has focused primarily on digital perturbations, we prioritize on creating realistic perturbations designed with physical world conditions in mind. For adversarial robustness, we focus on data poisoning attacks whereas for natural robustness, we focus on extending ImageNet-C common corruptions for fog and snow that coherently and self-consistently perturbs the input data. Overall, we find both RGB and multispectral models are vulnerable to data poisoning attacks regardless of input or fusion architectures and that while physically realizable natural perturbations still degrade model performance, the impact differs based on fusion architecture and input data. ",
    "url": "https://arxiv.org/abs/2305.11347",
    "authors": [
      "Elise Bishoff",
      "Charles Godfrey",
      "Myles McKay",
      "Eleanor Byler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11349",
    "title": "Unsupervised Domain-agnostic Fake News Detection using Multi-modal Weak  Signals",
    "abstract": "The emergence of social media as one of the main platforms for people to access news has enabled the wide dissemination of fake news. This has motivated numerous studies on automating fake news detection. Although there have been limited attempts at unsupervised fake news detection, their performance suffers due to not exploiting the knowledge from various modalities related to news records and due to the presence of various latent biases in the existing news datasets. To address these limitations, this work proposes an effective framework for unsupervised fake news detection, which first embeds the knowledge available in four modalities in news records and then proposes a novel noise-robust self-supervised learning technique to identify the veracity of news records from the multi-modal embeddings. Also, we propose a novel technique to construct news datasets minimizing the latent biases in existing news datasets. Following the proposed approach for dataset construction, we produce a Large-scale Unlabelled News Dataset consisting 419,351 news articles related to COVID-19, acronymed as LUND-COVID. We trained the proposed unsupervised framework using LUND-COVID to exploit the potential of large datasets, and evaluate it using a set of existing labelled datasets. Our results show that the proposed unsupervised framework largely outperforms existing unsupervised baselines for different tasks such as multi-modal fake news detection, fake news early detection and few-shot fake news detection, while yielding notable improvements for unseen domains during training. ",
    "url": "https://arxiv.org/abs/2305.11349",
    "authors": [
      "Amila Silva",
      "Ling Luo",
      "Shanika Karunasekera",
      "Christopher Leckie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.11358",
    "title": "Understanding the World to Solve Social Dilemmas Using Multi-Agent  Reinforcement Learning",
    "abstract": "Social dilemmas are situations where groups of individuals can benefit from mutual cooperation but conflicting interests impede them from doing so. This type of situations resembles many of humanity's most critical challenges, and discovering mechanisms that facilitate the emergence of cooperative behaviors is still an open problem. In this paper, we study the behavior of self-interested rational agents that learn world models in a multi-agent reinforcement learning (RL) setting and that coexist in environments where social dilemmas can arise. Our simulation results show that groups of agents endowed with world models outperform all the other tested ones when dealing with scenarios where social dilemmas can arise. We exploit the world model architecture to qualitatively assess the learnt dynamics and confirm that each agent's world model is capable to encode information of the behavior of the changing environment and the other agent's actions. This is the first work that shows that world models facilitate the emergence of complex coordinated behaviors that enable interacting agents to ``understand'' both environmental and social dynamics. ",
    "url": "https://arxiv.org/abs/2305.11358",
    "authors": [
      "Manuel Rios",
      "Nicanor Quijano",
      "Luis Felipe Giraldo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2305.11361",
    "title": "Group fairness without demographics using social networks",
    "abstract": "Group fairness is a popular approach to prevent unfavorable treatment of individuals based on sensitive attributes such as race, gender, and disability. However, the reliance of group fairness on access to discrete group information raises several limitations and concerns, especially with regard to privacy, intersectionality, and unforeseen biases. In this work, we propose a \"group-free\" measure of fairness that does not rely on sensitive attributes and, instead, is based on homophily in social networks, i.e., the common property that individuals sharing similar attributes are more likely to be connected. Our measure is group-free as it avoids recovering any form of group memberships and uses only pairwise similarities between individuals to define inequality in outcomes relative to the homophily structure in the network. We theoretically justify our measure by showing it is commensurate with the notion of additive decomposability in the economic inequality literature and also bound the impact of non-sensitive confounding attributes. Furthermore, we apply our measure to develop fair algorithms for classification, maximizing information access, and recommender systems. Our experimental results show that the proposed approach can reduce inequality among protected classes without knowledge of sensitive attribute labels. We conclude with a discussion of the limitations of our approach when applied in real-world settings. ",
    "url": "https://arxiv.org/abs/2305.11361",
    "authors": [
      "David Liu",
      "Virginie Do",
      "Nicolas Usunier",
      "Maximilian Nickel"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.11377",
    "title": "GraphFC: Customs Fraud Detection with Label Scarcity",
    "abstract": "Custom officials across the world encounter huge volumes of transactions. With increased connectivity and globalization, the customs transactions continue to grow every year. Associated with customs transactions is the customs fraud - the intentional manipulation of goods declarations to avoid the taxes and duties. With limited manpower, the custom offices can only undertake manual inspection of a limited number of declarations. This necessitates the need for automating the customs fraud detection by machine learning (ML) techniques. Due the limited manual inspection for labeling the new-incoming declarations, the ML approach should have robust performance subject to the scarcity of labeled data. However, current approaches for customs fraud detection are not well suited and designed for this real-world setting. In this work, we propose $\\textbf{GraphFC}$ ($\\textbf{Graph}$ neural networks for $\\textbf{C}$ustoms $\\textbf{F}$raud), a model-agnostic, domain-specific, semi-supervised graph neural network based customs fraud detection algorithm that has strong semi-supervised and inductive capabilities. With upto 252% relative increase in recall over the present state-of-the-art, extensive experimentation on real customs data from customs administrations of three different countries demonstrate that GraphFC consistently outperforms various baselines and the present state-of-art by a large margin. ",
    "url": "https://arxiv.org/abs/2305.11377",
    "authors": [
      "Karandeep Singh",
      "Yu-Che Tsai",
      "Cheng-Te Li",
      "Meeyoug Cha",
      "Shou-De Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2305.11379",
    "title": "Generalized Precision Matrix for Scalable Estimation of Nonparametric  Markov Networks",
    "abstract": "A Markov network characterizes the conditional independence structure, or Markov property, among a set of random variables. Existing work focuses on specific families of distributions (e.g., exponential families) and/or certain structures of graphs, and most of them can only handle variables of a single data type (continuous or discrete). In this work, we characterize the conditional independence structure in general distributions for all data types (i.e., continuous, discrete, and mixed-type) with a Generalized Precision Matrix (GPM). Besides, we also allow general functional relations among variables, thus giving rise to a Markov network structure learning algorithm in one of the most general settings. To deal with the computational challenge of the problem, especially for large graphs, we unify all cases under the same umbrella of a regularized score matching framework. We validate the theoretical results and demonstrate the scalability empirically in various settings. ",
    "url": "https://arxiv.org/abs/2305.11379",
    "authors": [
      "Yujia Zheng",
      "Ignavier Ng",
      "Yewen Fan",
      "Kun Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.11385",
    "title": "Robust MPC with Zone Tracking",
    "abstract": "We propose a robust nonlinear model predictive control design with generalized zone tracking (ZMPC) in this work. The proposed ZMPC has guaranteed convergence into the target zone in the presence of bounded disturbance. The proposed approach achieves this by modifying the actual target zone such that the effect of disturbances is rejected. A control invariant set (CIS) inside the modified target zone is used as the terminal set, which ensures the closed-loop stability of the proposed controller. Detailed closed-loop stability analysis is presented. Simulation studies based on a continuous stirred tank reactor (CSTR) are performed to validate the effectiveness of the proposed ZMPC. ",
    "url": "https://arxiv.org/abs/2305.11385",
    "authors": [
      "Zhiyinan Huang",
      "Jinfeng Liu",
      "Biao Huang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2305.11389",
    "title": "Domain Generalization Deep Graph Transformation",
    "abstract": "Graph transformation that predicts graph transition from one mode to another is an important and common problem. Despite much progress in developing advanced graph transformation techniques in recent years, the fundamental assumption typically required in machine-learning models that the testing and training data preserve the same distribution does not always hold. As a result, domain generalization graph transformation that predicts graphs not available in the training data is under-explored, with multiple key challenges to be addressed including (1) the extreme space complexity when training on all input-output mode combinations, (2) difference of graph topologies between the input and the output modes, and (3) how to generalize the model to (unseen) target domains that are not in the training data. To fill the gap, we propose a multi-input, multi-output, hypernetwork-based graph neural network (MultiHyperGNN) that employs a encoder and a decoder to encode topologies of both input and output modes and semi-supervised link prediction to enhance the graph transformation task. Instead of training on all mode combinations, MultiHyperGNN preserves a constant space complexity with the encoder and the decoder produced by two novel hypernetworks. Comprehensive experiments show that MultiHyperGNN has a superior performance than competing models in both prediction and domain generalization tasks. ",
    "url": "https://arxiv.org/abs/2305.11389",
    "authors": [
      "Shiyu Wang",
      "Guangji Bai",
      "Qingyang Zhu",
      "Zhaohui Qin",
      "Liang Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.11394",
    "title": "Remembering What Is Important: A Factorised Multi-Head Retrieval and  Auxiliary Memory Stabilisation Scheme for Human Motion Prediction",
    "abstract": "Humans exhibit complex motions that vary depending on the task that they are performing, the interactions they engage in, as well as subject-specific preferences. Therefore, forecasting future poses based on the history of the previous motions is a challenging task. This paper presents an innovative auxiliary-memory-powered deep neural network framework for the improved modelling of historical knowledge. Specifically, we disentangle subject-specific, task-specific, and other auxiliary information from the observed pose sequences and utilise these factorised features to query the memory. A novel Multi-Head knowledge retrieval scheme leverages these factorised feature embeddings to perform multiple querying operations over the historical observations captured within the auxiliary memory. Moreover, our proposed dynamic masking strategy makes this feature disentanglement process dynamic. Two novel loss functions are introduced to encourage diversity within the auxiliary memory while ensuring the stability of the memory contents, such that it can locate and store salient information that can aid the long-term prediction of future motion, irrespective of data imbalances or the diversity of the input data distribution. With extensive experiments conducted on two public benchmarks, Human3.6M and CMU-Mocap, we demonstrate that these design choices collectively allow the proposed approach to outperform the current state-of-the-art methods by significant margins: $>$ 17\\% on the Human3.6M dataset and $>$ 9\\% on the CMU-Mocap dataset. ",
    "url": "https://arxiv.org/abs/2305.11394",
    "authors": [
      "Tharindu Fernando",
      "Harshala Gammulle",
      "Sridha Sridharan",
      "Simon Denman",
      "Clinton Fookes"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.11398",
    "title": "Comfort Foods and Community Connectedness: Investigating Diet Change  during COVID-19 Using YouTube Videos on Twitter",
    "abstract": "Unprecedented lockdowns at the start of the COVID-19 pandemic have drastically changed the routines of millions of people, potentially impacting important health-related behaviors. In this study, we use YouTube videos embedded in tweets about diet, exercise and fitness posted before and during COVID-19 to investigate the influence of the pandemic lockdowns on diet and nutrition. In particular, we examine the nutritional profile of the foods mentioned in the transcript, description and title of each video in terms of six macronutrients (protein, energy, fat, sodium, sugar, and saturated fat). These macronutrient values were further linked to demographics to assess if there are specific effects on those potentially having insufficient access to healthy sources of food. Interrupted time series analysis revealed a considerable shift in the aggregated macronutrient scores before and during COVID-19. In particular, whereas areas with lower incomes showed decrease in energy, fat, and saturated fat, those with higher percentage of African Americans showed an elevation in sodium. Word2Vec word similarities and odds ratio analysis suggested a shift from popular diets and lifestyle bloggers before the lockdowns to the interest in a variety of healthy foods, communal sharing of quick and easy recipes, as well as a new emphasis on comfort foods. To the best of our knowledge, this work is novel in terms of linking attention signals in tweets, content of videos, their nutrients profile, and aggregate demographics of the users. The insights made possible by this combination of resources are important for monitoring the secondary health effects of social distancing, and informing social programs designed to alleviate these effects. ",
    "url": "https://arxiv.org/abs/2305.11398",
    "authors": [
      "Yelena Mejova",
      "Lydia Manikonda"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.11400",
    "title": "Few-Shot Continual Learning for Conditional Generative Adversarial  Networks",
    "abstract": "In few-shot continual learning for generative models, a target mode must be learned with limited samples without adversely affecting the previously learned modes. In this paper, we propose a new continual learning approach for conditional generative adversarial networks (cGAN) based on a new mode-affinity measure for generative modeling. Our measure is entirely based on the cGAN's discriminator and can identify the existing modes that are most similar to the target. Subsequently, we expand the continual learning model by including the target mode using a weighted label derived from those of the closest modes. To prevent catastrophic forgetting, we first generate labeled data samples using the cGAN's generator, and then train the cGAN model for the target mode while memory replaying with the generated data. Our experimental results demonstrate the efficacy of our approach in improving the generation performance over the baselines and the state-of-the-art approaches for various standard datasets while utilizing fewer training samples. ",
    "url": "https://arxiv.org/abs/2305.11400",
    "authors": [
      "Cat P. Le",
      "Juncheng Dong",
      "Ahmed Aloui",
      "Vahid Tarokh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.11417",
    "title": "Complexity of Feed-Forward Neural Networks from the Perspective of  Functional Equivalence",
    "abstract": "In this paper, we investigate the complexity of feed-forward neural networks by examining the concept of functional equivalence, which suggests that different network parameterizations can lead to the same function. We utilize the permutation invariance property to derive a novel covering number bound for the class of feedforward neural networks, which reveals that the complexity of a neural network can be reduced by exploiting this property. Furthermore, based on the symmetric structure of parameter space, we demonstrate that an appropriate strategy of random parameter initialization can increase the probability of convergence for optimization. We found that overparameterized networks tend to be easier to train in the sense that increasing the width of neural networks leads to a vanishing volume of the effective parameter space. Our findings offer new insights into overparameterization and have significant implications for understanding generalization and optimization in deep learning. ",
    "url": "https://arxiv.org/abs/2305.11417",
    "authors": [
      "Guohao Shen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2305.11421",
    "title": "PastNet: Introducing Physical Inductive Biases for Spatio-temporal Video  Prediction",
    "abstract": "In this paper, we investigate the challenge of spatio-temporal video prediction, which involves generating future videos based on historical data streams. Existing approaches typically utilize external information such as semantic maps to enhance video prediction, which often neglect the inherent physical knowledge embedded within videos. Furthermore, their high computational demands could impede their applications for high-resolution videos. To address these constraints, we introduce a novel approach called Physics-assisted Spatio-temporal Network (PastNet) for generating high-quality video predictions. The core of our PastNet lies in incorporating a spectral convolution operator in the Fourier domain, which efficiently introduces inductive biases from the underlying physical laws. Additionally, we employ a memory bank with the estimated intrinsic dimensionality to discretize local features during the processing of complex spatio-temporal signals, thereby reducing computational costs and facilitating efficient high-resolution video prediction. Extensive experiments on various widely-used datasets demonstrate the effectiveness and efficiency of the proposed PastNet compared with state-of-the-art methods, particularly in high-resolution scenarios. ",
    "url": "https://arxiv.org/abs/2305.11421",
    "authors": [
      "Hao Wu",
      "Wei Xion",
      "Fan Xu",
      "Xiao Luo",
      "Chong Chen",
      "Xian-Sheng Hua",
      "Haixin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.11424",
    "title": "Graph Propagation Transformer for Graph Representation Learning",
    "abstract": "This paper presents a novel transformer architecture for graph representation learning. The core insight of our method is to fully consider the information propagation among nodes and edges in a graph when building the attention module in the transformer blocks. Specifically, we propose a new attention mechanism called Graph Propagation Attention (GPA). It explicitly passes the information among nodes and edges in three ways, i.e. node-to-node, node-to-edge, and edge-to-node, which is essential for learning graph-structured data. On this basis, we design an effective transformer architecture named Graph Propagation Transformer (GPTrans) to further help learn graph data. We verify the performance of GPTrans in a wide range of graph learning experiments on several benchmark datasets. These results show that our method outperforms many state-of-the-art transformer-based graph models with better performance. The code will be released at https://github.com/czczup/GPTrans. ",
    "url": "https://arxiv.org/abs/2305.11424",
    "authors": [
      "Zhe Chen",
      "Hao Tan",
      "Tao Wang",
      "Tianrun Shen",
      "Tong Lu",
      "Qiuying Peng",
      "Cheng Cheng",
      "Yue Qi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.11428",
    "title": "Must the Communication Graph of MPC Protocols be an Expander?",
    "abstract": "Secure multiparty computation (MPC) on incomplete communication networks has been studied within two primary models: (1) Where a partial network is fixed a priori, and thus corruptions can occur dependent on its structure, and (2) Where edges in the communication graph are determined dynamically as part of the protocol. Whereas a rich literature has succeeded in mapping out the feasibility and limitations of graph structures supporting secure computation in the fixed-graph model (including strong classical lower bounds), these bounds do not apply in the latter dynamic-graph setting, which has recently seen exciting new results, but remains relatively unexplored. In this work, we initiate a similar foundational study of MPC within the dynamic-graph model. As a first step, we investigate the property of graph expansion. All existing protocols (implicitly or explicitly) yield communication graphs which are expanders, but it is not clear whether this is inherent. Our results consist of two types (for constant fraction of corruptions): * Upper bounds: We demonstrate secure protocols whose induced communication graphs are not expander graphs, within a wide range of settings (computational, information theoretic, with low locality, even with low locality and adaptive security), each assuming some form of input-independent setup. * Lower bounds: In the plain model (no setup) with adaptive corruptions, we demonstrate that for certain functionalities, no protocol can maintain a non-expanding communication graph against all adversarial strategies. Our lower bound relies only on protocol correctness (not privacy), and requires a surprisingly delicate argument. More generally, we provide a formal framework for analyzing the evolving communication graph of MPC protocols, giving a starting point for studying the relation between secure computation and further, more general graph properties. ",
    "url": "https://arxiv.org/abs/2305.11428",
    "authors": [
      "Elette Boyle",
      "Ran Cohen",
      "Deepesh Data",
      "Pavel Hubáček"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.11430",
    "title": "TELeR: A General Taxonomy of LLM Prompts for Benchmarking Complex Tasks",
    "abstract": "While LLMs have shown great success in understanding and generating text in traditional conversational settings, their potential for performing ill-defined complex tasks is largely under-studied. Indeed, we are yet to conduct comprehensive benchmarking studies with multiple LLMs that are exclusively focused on a complex task. However, conducting such benchmarking studies is challenging because of the large variations in LLMs' performance when different prompt types/styles are used and different degrees of detail are provided in the prompts. To address this issue, the paper proposes a general taxonomy that can be used to design prompts with specific properties in order to perform a wide range of complex tasks. This taxonomy will allow future benchmarking studies to report the specific categories of prompts used as part of the study, enabling meaningful comparisons across different studies. Also, by establishing a common standard through this taxonomy, researchers will be able to draw more accurate conclusions about LLMs' performance on a specific complex task. ",
    "url": "https://arxiv.org/abs/2305.11430",
    "authors": [
      "Shubhra Kanti Karmaker Santu",
      "Dongji Feng"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11437",
    "title": "PS-FedGAN: An Efficient Federated Learning Framework Based on Partially  Shared Generative Adversarial Networks For Data Privacy",
    "abstract": "Federated Learning (FL) has emerged as an effective learning paradigm for distributed computation owing to its strong potential in capturing underlying data statistics while preserving data privacy. However, in cases of practical data heterogeneity among FL clients, existing FL frameworks still exhibit deficiency in capturing the overall feature properties of local client data that exhibit disparate distributions. In response, generative adversarial networks (GANs) have recently been exploited in FL to address data heterogeneity since GANs can be integrated for data regeneration without exposing original raw data. Despite some successes, existing GAN-related FL frameworks often incur heavy communication cost and also elicit other privacy concerns, which limit their applications in real scenarios. To this end, this work proposes a novel FL framework that requires only partial GAN model sharing. Named as PS-FedGAN, this new framework enhances the GAN releasing and training mechanism to address heterogeneous data distributions across clients and to strengthen privacy preservation at reduced communication cost, especially over wireless networks. Our analysis demonstrates the convergence and privacy benefits of the proposed PS-FEdGAN framework. Through experimental results based on several well-known benchmark datasets, our proposed PS-FedGAN shows great promise to tackle FL under non-IID client data distributions, while securing data privacy and lowering communication overhead. ",
    "url": "https://arxiv.org/abs/2305.11437",
    "authors": [
      "Achintha Wijesinghe",
      "Songyang Zhang",
      "Zhi Ding"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.11438",
    "title": "Phonetic and Prosody-aware Self-supervised Learning Approach for  Non-native Fluency Scoring",
    "abstract": "Speech fluency/disfluency can be evaluated by analyzing a range of phonetic and prosodic features. Deep neural networks are commonly trained to map fluency-related features into the human scores. However, the effectiveness of deep learning-based models is constrained by the limited amount of labeled training samples. To address this, we introduce a self-supervised learning (SSL) approach that takes into account phonetic and prosody awareness for fluency scoring. Specifically, we first pre-train the model using a reconstruction loss function, by masking phones and their durations jointly on a large amount of unlabeled speech and text prompts. We then fine-tune the pre-trained model using human-annotated scoring data. Our experimental results, conducted on datasets such as Speechocean762 and our non-native datasets, show that our proposed method outperforms the baseline systems in terms of Pearson correlation coefficients (PCC). Moreover, we also conduct an ablation study to better understand the contribution of phonetic and prosody factors during the pre-training stage. ",
    "url": "https://arxiv.org/abs/2305.11438",
    "authors": [
      "Kaiqi Fu",
      "Shaojun Gao",
      "Shuju Shi",
      "Xiaohai Tian",
      "Wei Li",
      "Zejun Ma"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2305.11442",
    "title": "Zero-Shot Text Classification via Self-Supervised Tuning",
    "abstract": "Existing solutions to zero-shot text classification either conduct prompting with pre-trained language models, which is sensitive to the choices of templates, or rely on large-scale annotated data of relevant tasks for meta-tuning. In this work, we propose a new paradigm based on self-supervised learning to solve zero-shot text classification tasks by tuning the language models with unlabeled data, called self-supervised tuning. By exploring the inherent structure of free texts, we propose a new learning objective called first sentence prediction to bridge the gap between unlabeled data and text classification tasks. After tuning the model to learn to predict the first sentence in a paragraph based on the rest, the model is able to conduct zero-shot inference on unseen tasks such as topic classification and sentiment analysis. Experimental results show that our model outperforms the state-of-the-art baselines on 7 out of 10 tasks. Moreover, the analysis reveals that our model is less sensitive to the prompt design. Our code and pre-trained models are publicly available at https://github.com/DAMO-NLP-SG/SSTuning . ",
    "url": "https://arxiv.org/abs/2305.11442",
    "authors": [
      "Chaoqun Liu",
      "Wenxuan Zhang",
      "Guizhen Chen",
      "Xiaobao Wu",
      "Anh Tuan Luu",
      "Chip Hong Chang",
      "Lidong Bing"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11457",
    "title": "Evolutionary Diversity Optimisation in Constructing Satisfying  Assignments",
    "abstract": "Computing diverse solutions for a given problem, in particular evolutionary diversity optimisation (EDO), is a hot research topic in the evolutionary computation community. This paper studies the Boolean satisfiability problem (SAT) in the context of EDO. SAT is of great importance in computer science and differs from the other problems studied in EDO literature, such as KP and TSP. SAT is heavily constrained, and the conventional evolutionary operators are inefficient in generating SAT solutions. Our approach avails of the following characteristics of SAT: 1) the possibility of adding more constraints (clauses) to the problem to forbid solutions or to fix variables, and 2) powerful solvers in the literature, such as minisat. We utilise such a solver to construct a diverse set of solutions. Moreover, maximising diversity provides us with invaluable information about the solution space of a given SAT problem, such as how large the feasible region is. In this study, we introduce evolutionary algorithms (EAs) employing a well-known SAT solver to maximise diversity among a set of SAT solutions explicitly. The experimental investigations indicate the introduced algorithms' capability to maximise diversity among the SAT solutions. ",
    "url": "https://arxiv.org/abs/2305.11457",
    "authors": [
      "Adel Nikfarjam",
      "Ralf Rothenberger",
      "Frank Neumann",
      "Tobias Friedrich"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2305.11458",
    "title": "A Novel Tensor Factorization-Based Method with Robustness to Inaccurate  Rank Estimation",
    "abstract": "This study aims to solve the over-reliance on the rank estimation strategy in the standard tensor factorization-based tensor recovery and the problem of a large computational cost in the standard t-SVD-based tensor recovery. To this end, we proposes a new tensor norm with a dual low-rank constraint, which utilizes the low-rank prior and rank information at the same time. In the proposed tensor norm, a series of surrogate functions of the tensor tubal rank can be used to achieve better performance in harness low-rankness within tensor data. It is proven theoretically that the resulting tensor completion model can effectively avoid performance degradation caused by inaccurate rank estimation. Meanwhile, attributed to the proposed dual low-rank constraint, the t-SVD of a smaller tensor instead of the original big one is computed by using a sample trick. Based on this, the total cost at each iteration of the optimization algorithm is reduced to $\\mathcal{O}(n^3\\log n +kn^3)$ from $\\mathcal{O}(n^4)$ achieved with standard methods, where $k$ is the estimation of the true tensor rank and far less than $n$. Our method was evaluated on synthetic and real-world data, and it demonstrated superior performance and efficiency over several existing state-of-the-art tensor completion methods. ",
    "url": "https://arxiv.org/abs/2305.11458",
    "authors": [
      "Jingjing Zheng",
      "Wenzhe Wang",
      "Xiaoqin Zhang",
      "Xianta Jiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11495",
    "title": "Nonconvex Robust High-Order Tensor Completion Using Randomized Low-Rank  Approximation",
    "abstract": "Within the tensor singular value decomposition (T-SVD) framework, existing robust low-rank tensor completion approaches have made great achievements in various areas of science and engineering. Nevertheless, these methods involve the T-SVD based low-rank approximation, which suffers from high computational costs when dealing with large-scale tensor data. Moreover, most of them are only applicable to third-order tensors. Against these issues, in this article, two efficient low-rank tensor approximation approaches fusing randomized techniques are first devised under the order-d (d >= 3) T-SVD framework. On this basis, we then further investigate the robust high-order tensor completion (RHTC) problem, in which a double nonconvex model along with its corresponding fast optimization algorithms with convergence guarantees are developed. To the best of our knowledge, this is the first study to incorporate the randomized low-rank approximation into the RHTC problem. Empirical studies on large-scale synthetic and real tensor data illustrate that the proposed method outperforms other state-of-the-art approaches in terms of both computational efficiency and estimated precision. ",
    "url": "https://arxiv.org/abs/2305.11495",
    "authors": [
      "Wenjin Qin",
      "Hailin Wang",
      "Feng Zhang",
      "Weijun Ma",
      "Jianjun Wang",
      "Tingwen Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11513",
    "title": "When SAM Meets Shadow Detection",
    "abstract": "As a promptable generic object segmentation model, segment anything model (SAM) has recently attracted significant attention, and also demonstrates its powerful performance. Nevertheless, it still meets its Waterloo when encountering several tasks, e.g., medical image segmentation, camouflaged object detection, etc. In this report, we try SAM on an unexplored popular task: shadow detection. Specifically, four benchmarks were chosen and evaluated with widely used metrics. The experimental results show that the performance for shadow detection using SAM is not satisfactory, especially when comparing with the elaborate models. Code is available at https://github.com/LeipingJie/SAMSh. ",
    "url": "https://arxiv.org/abs/2305.11513",
    "authors": [
      "Leiping Jie",
      "Hui Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.11522",
    "title": "DSFNet: Dual Space Fusion Network for Occlusion-Robust 3D Dense Face  Alignment",
    "abstract": "Sensitivity to severe occlusion and large view angles limits the usage scenarios of the existing monocular 3D dense face alignment methods. The state-of-the-art 3DMM-based method, directly regresses the model's coefficients, underutilizing the low-level 2D spatial and semantic information, which can actually offer cues for face shape and orientation. In this work, we demonstrate how modeling 3D facial geometry in image and model space jointly can solve the occlusion and view angle problems. Instead of predicting the whole face directly, we regress image space features in the visible facial region by dense prediction first. Subsequently, we predict our model's coefficients based on the regressed feature of the visible regions, leveraging the prior knowledge of whole face geometry from the morphable models to complete the invisible regions. We further propose a fusion network that combines the advantages of both the image and model space predictions to achieve high robustness and accuracy in unconstrained scenarios. Thanks to the proposed fusion module, our method is robust not only to occlusion and large pitch and roll view angles, which is the benefit of our image space approach, but also to noise and large yaw angles, which is the benefit of our model space method. Comprehensive evaluations demonstrate the superior performance of our method compared with the state-of-the-art methods. On the 3D dense face alignment task, we achieve 3.80% NME on the AFLW2000-3D dataset, which outperforms the state-of-the-art method by 5.5%. Code is available at https://github.com/lhyfst/DSFNet. ",
    "url": "https://arxiv.org/abs/2305.11522",
    "authors": [
      "Heyuan Li",
      "Bo Wang",
      "Yu Cheng",
      "Mohan Kankanhalli",
      "Robby T. Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.11526",
    "title": "Enhancing Short-Term Wind Speed Forecasting using Graph Attention and  Frequency-Enhanced Mechanisms",
    "abstract": "The safe and stable operation of power systems is greatly challenged by the high variability and randomness of wind power in large-scale wind-power-integrated grids. Wind power forecasting is an effective solution to tackle this issue, with wind speed forecasting being an essential aspect. In this paper, a Graph-attentive Frequency-enhanced Spatial-Temporal Wind Speed Forecasting model based on graph attention and frequency-enhanced mechanisms, i.e., GFST-WSF, is proposed to improve the accuracy of short-term wind speed forecasting. The GFST-WSF comprises a Transformer architecture for temporal feature extraction and a Graph Attention Network (GAT) for spatial feature extraction. The GAT is specifically designed to capture the complex spatial dependencies among wind speed stations to effectively aggregate information from neighboring nodes in the graph, thus enhancing the spatial representation of the data. To model the time lag in wind speed correlation between adjacent wind farms caused by geographical factors, a dynamic complex adjacency matrix is formulated and utilized by the GAT. Benefiting from the effective spatio-temporal feature extraction and the deep architecture of the Transformer, the GFST-WSF outperforms other baselines in wind speed forecasting for the 6-24 hours ahead forecast horizon in case studies. ",
    "url": "https://arxiv.org/abs/2305.11526",
    "authors": [
      "Hao Liu",
      "Tianyu Hu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11588",
    "title": "Text2NeRF: Text-Driven 3D Scene Generation with Neural Radiance Fields",
    "abstract": "Text-driven 3D scene generation is widely applicable to video gaming, film industry, and metaverse applications that have a large demand for 3D scenes. However, existing text-to-3D generation methods are limited to producing 3D objects with simple geometries and dreamlike styles that lack realism. In this work, we present Text2NeRF, which is able to generate a wide range of 3D scenes with complicated geometric structures and high-fidelity textures purely from a text prompt. To this end, we adopt NeRF as the 3D representation and leverage a pre-trained text-to-image diffusion model to constrain the 3D reconstruction of the NeRF to reflect the scene description. Specifically, we employ the diffusion model to infer the text-related image as the content prior and use a monocular depth estimation method to offer the geometric prior. Both content and geometric priors are utilized to update the NeRF model. To guarantee textured and geometric consistency between different views, we introduce a progressive scene inpainting and updating strategy for novel view synthesis of the scene. Our method requires no additional training data but only a natural language description of the scene as the input. Extensive experiments demonstrate that our Text2NeRF outperforms existing methods in producing photo-realistic, multi-view consistent, and diverse 3D scenes from a variety of natural language prompts. ",
    "url": "https://arxiv.org/abs/2305.11588",
    "authors": [
      "Jingbo Zhang",
      "Xiaoyu Li",
      "Ziyu Wan",
      "Can Wang",
      "Jing Liao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2305.11596",
    "title": "Mitigating Backdoor Poisoning Attacks through the Lens of Spurious  Correlation",
    "abstract": "Modern NLP models are often trained over large untrusted datasets, raising the potential for a malicious adversary to compromise model behaviour. For instance, backdoors can be implanted through crafting training instances with a specific textual trigger and a target label. This paper posits that backdoor poisoning attacks exhibit spurious correlation between simple text features and classification labels, and accordingly, proposes methods for mitigating spurious correlation as means of defence. Our empirical study reveals that the malicious triggers are highly correlated to their target labels; therefore such correlations are extremely distinguishable compared to those scores of benign features, and can be used to filter out potentially problematic instances. Compared with several existing defences, our defence method significantly reduces attack success rates across backdoor attacks, and in the case of insertion based attacks, our method provides a near-perfect defence. ",
    "url": "https://arxiv.org/abs/2305.11596",
    "authors": [
      "Xuanli He",
      "Qiongkai Xu",
      "Jun Wang",
      "Benjamin Rubinstein",
      "Trevor Cohn"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.11597",
    "title": "Flexible and Inherently Comprehensible Knowledge Representation for  Data-Efficient Learning and Trustworthy Human-Machine Teaming in  Manufacturing Environments",
    "abstract": "Trustworthiness of artificially intelligent agents is vital for the acceptance of human-machine teaming in industrial manufacturing environments. Predictable behaviours and explainable (and understandable) rationale allow humans collaborating with (and building) these agents to understand their motivations and therefore validate decisions that are made. To that aim, we make use of G\\\"ardenfors's cognitively inspired Conceptual Space framework to represent the agent's knowledge using concepts as convex regions in a space spanned by inherently comprehensible quality dimensions. A simple typicality quantification model is built on top of it to determine fuzzy category membership and classify instances interpretably. We apply it on a use case from the manufacturing domain, using objects' physical properties obtained from cobots' onboard sensors and utilisation properties from crowdsourced commonsense knowledge available at public knowledge bases. Such flexible knowledge representation based on property decomposition allows for data-efficient representation learning of typically highly specialist or specific manufacturing artefacts. In such a setting, traditional data-driven (e.g., computer vision-based) classification approaches would struggle due to training data scarcity. This allows for comprehensibility of an AI agent's acquired knowledge by the human collaborator thus contributing to trustworthiness. We situate our approach within an existing explainability framework specifying explanation desiderata. We provide arguments for our system's applicability and appropriateness for different roles of human agents collaborating with the AI system throughout its design, validation, and operation. ",
    "url": "https://arxiv.org/abs/2305.11597",
    "authors": [
      "Vedran Galetić",
      "Alistair Nottle"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.11601",
    "title": "Towards Better Gradient Consistency for Neural Signed Distance Functions  via Level Set Alignment",
    "abstract": "Neural signed distance functions (SDFs) have shown remarkable capability in representing geometry with details. However, without signed distance supervision, it is still a challenge to infer SDFs from point clouds or multi-view images using neural networks. In this paper, we claim that gradient consistency in the field, indicated by the parallelism of level sets, is the key factor affecting the inference accuracy. Hence, we propose a level set alignment loss to evaluate the parallelism of level sets, which can be minimized to achieve better gradient consistency. Our novelty lies in that we can align all level sets to the zero level set by constraining gradients at queries and their projections on the zero level set in an adaptive way. Our insight is to propagate the zero level set to everywhere in the field through consistent gradients to eliminate uncertainty in the field that is caused by the discreteness of 3D point clouds or the lack of observations from multi-view images. Our proposed loss is a general term which can be used upon different methods to infer SDFs from 3D point clouds and multi-view images. Our numerical and visual comparisons demonstrate that our loss can significantly improve the accuracy of SDFs inferred from point clouds or multi-view images under various benchmarks. Code and data are available at https://github.com/mabaorui/TowardsBetterGradient . ",
    "url": "https://arxiv.org/abs/2305.11601",
    "authors": [
      "Baorui Ma",
      "Junsheng Zhou",
      "Yu-Shen Liu",
      "Zhizhong Han"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.11618",
    "title": "DAP: A Dynamic Adversarial Patch for Evading Person Detectors",
    "abstract": "In this paper, we present a novel approach for generating naturalistic adversarial patches without using GANs. Our proposed approach generates a Dynamic Adversarial Patch (DAP) that looks naturalistic while maintaining high attack efficiency and robustness in real-world scenarios. To achieve this, we redefine the optimization problem by introducing a new objective function, where a similarity metric is used to construct a similarity loss. This guides the patch to follow predefined patterns while maximizing the victim model's loss function. Our technique is based on directly modifying the pixel values in the patch which gives higher flexibility and larger space to incorporate multiple transformations compared to the GAN-based techniques. Furthermore, most clothing-based physical attacks assume static objects and ignore the possible transformations caused by non-rigid deformation due to changes in a person's pose. To address this limitation, we incorporate a ``Creases Transformation'' (CT) block, i.e., a preprocessing block following an Expectation Over Transformation (EOT) block used to generate a large variation of transformed patches incorporated in the training process to increase its robustness to different possible real-world distortions (e.g., creases in the clothing, rotation, re-scaling, random noise, brightness and contrast variations, etc.). We demonstrate that the presence of different real-world variations in clothing and object poses (i.e., above-mentioned distortions) lead to a drop in the performance of state-of-the-art attacks. For instance, these techniques can merely achieve 20\\% in the physical world and 30.8\\% in the digital world while our attack provides superior success rate of up to 65\\% and 84.56\\%, respectively when attacking the YOLOv3tiny detector deployed in smart cameras at the edge. ",
    "url": "https://arxiv.org/abs/2305.11618",
    "authors": [
      "Amira Guesmi",
      "Ruitian Ding",
      "Muhammad Abdullah Hanif",
      "Ihsen Alouani",
      "Muhammad Shafique"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.11619",
    "title": "Towards Code Generation from BDD Test Case Specifications: A Vision",
    "abstract": "Automatic code generation has recently attracted large attention and is becoming more significant to the software development process. Solutions based on Machine Learning and Artificial Intelligence are being used to increase human and software efficiency in potent and innovative ways. In this paper, we aim to leverage these developments and introduce a novel approach to generating frontend component code for the popular Angular framework. We propose to do this using behavior-driven development test specifications as input to a transformer-based machine learning model. Our approach aims to drastically reduce the development time needed for web applications while potentially increasing software quality and introducing new research ideas toward automatic code generation. ",
    "url": "https://arxiv.org/abs/2305.11619",
    "authors": [
      "Leon Chemnitz",
      "David Reichenbach",
      "Hani Aldebes",
      "Mariam Naveed",
      "Krishna Narasimhan",
      "Mira Mezini"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.11625",
    "title": "Searching by Code: a New SearchBySnippet Dataset and SnippeR Retrieval  Model for Searching by Code Snippets",
    "abstract": "Code search is an important task that has seen many developments in recent years. However, previous attempts have mostly considered the problem of searching for code by a text query. We argue that using a code snippet (and possibly an associated traceback) as a query and looking for answers with bugfixing instructions and code samples is a natural use case that is not covered by existing approaches. Moreover, existing datasets use comments extracted from code rather than full-text descriptions as text, making them unsuitable for this use case. We present a new SearchBySnippet dataset implementing the search-by-code use case based on StackOverflow data; it turns out that in this setting, existing architectures fall short of the simplest BM25 baseline even after fine-tuning. We present a new single encoder model SnippeR that outperforms several strong baselines on the SearchBySnippet dataset with a result of 0.451 Recall@10; we propose the SearchBySnippet dataset and SnippeR as a new important benchmark for code search evaluation. ",
    "url": "https://arxiv.org/abs/2305.11625",
    "authors": [
      "Ivan Sedykh",
      "Dmitry Abulkhanov",
      "Nikita Sorokin",
      "Sergey Nikolenko",
      "Valentin Malykh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2305.11626",
    "title": "CCT-Code: Cross-Consistency Training for Multilingual Clone Detection  and Code Search",
    "abstract": "We consider the clone detection and information retrieval problems for source code, well-known tasks important for any programming language. Although it is also an important and interesting problem to find code snippets that operate identically but are written in different programming languages, to the best of our knowledge multilingual clone detection has not been studied in literature. In this work, we formulate the multilingual clone detection problem and present XCD, a new benchmark dataset produced from the CodeForces submissions dataset. Moreover, we present a novel training procedure, called cross-consistency training (CCT), that we apply to train language models on source code in different programming languages. The resulting CCT-LM model, initialized with GraphCodeBERT and fine-tuned with CCT, achieves new state of the art, outperforming existing approaches on the POJ-104 clone detection benchmark with 95.67\\% MAP and AdvTest code search benchmark with 47.18\\% MRR; it also shows the best results on the newly created multilingual clone detection benchmark XCD across all programming languages. ",
    "url": "https://arxiv.org/abs/2305.11626",
    "authors": [
      "Nikita Sorokin",
      "Dmitry Abulkhanov",
      "Sergey Nikolenko",
      "Valentin Malykh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2305.11638",
    "title": "A Path to Holistic Privacy in Stream Processing Systems",
    "abstract": "The massive streams of Internet of Things (IoT) data require a timely analysis to retain data usefulness. Stream processing systems (SPSs) enable this task, deriving knowledge from the IoT data in real-time. Such real-time analytics benefits many applications but can also be used to violate user privacy, as the IoT data collected from users or their vicinity is inherently sensitive. In this paper, we present our systematic look into privacy issues arising from the intersection of SPSs and IoT, identifying key research challenges towards achieving holistic privacy protection in SPSs and proposing the solutions. ",
    "url": "https://arxiv.org/abs/2305.11638",
    "authors": [
      "Mikhail Fomichev"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11640",
    "title": "Distribution-Free Matrix Prediction Under Arbitrary Missing Pattern",
    "abstract": "This paper studies the open problem of conformalized entry prediction in a row/column-exchangeable matrix. The matrix setting presents novel and unique challenges, but there exists little work on this interesting topic. We meticulously define the problem, differentiate it from closely related problems, and rigorously delineate the boundary between achievable and impossible goals. We then propose two practical algorithms. The first method provides a fast emulation of the full conformal prediction, while the second method leverages the technique of algorithmic stability for acceleration. Both methods are computationally efficient and can effectively safeguard coverage validity in presence of arbitrary missing pattern. Further, we quantify the impact of missingness on prediction accuracy and establish fundamental limit results. Empirical evidence from synthetic and real-world data sets corroborates the superior performance of our proposed methods. ",
    "url": "https://arxiv.org/abs/2305.11640",
    "authors": [
      "Meijia Shao",
      "Yuan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.11692",
    "title": "Surgical-VQLA: Transformer with Gated Vision-Language Embedding for  Visual Question Localized-Answering in Robotic Surgery",
    "abstract": "Despite the availability of computer-aided simulators and recorded videos of surgical procedures, junior residents still heavily rely on experts to answer their queries. However, expert surgeons are often overloaded with clinical and academic workloads and limit their time in answering. For this purpose, we develop a surgical question-answering system to facilitate robot-assisted surgical scene and activity understanding from recorded videos. Most of the existing VQA methods require an object detector and regions based feature extractor to extract visual features and fuse them with the embedded text of the question for answer generation. However, (1) surgical object detection model is scarce due to smaller datasets and lack of bounding box annotation; (2) current fusion strategy of heterogeneous modalities like text and image is naive; (3) the localized answering is missing, which is crucial in complex surgical scenarios. In this paper, we propose Visual Question Localized-Answering in Robotic Surgery (Surgical-VQLA) to localize the specific surgical area during the answer prediction. To deal with the fusion of the heterogeneous modalities, we design gated vision-language embedding (GVLE) to build input patches for the Language Vision Transformer (LViT) to predict the answer. To get localization, we add the detection head in parallel with the prediction head of the LViT. We also integrate GIoU loss to boost localization performance by preserving the accuracy of the question-answering model. We annotate two datasets of VQLA by utilizing publicly available surgical videos from MICCAI challenges EndoVis-17 and 18. Our validation results suggest that Surgical-VQLA can better understand the surgical scene and localize the specific area related to the question-answering. GVLE presents an efficient language-vision embedding technique by showing superior performance over the existing benchmarks. ",
    "url": "https://arxiv.org/abs/2305.11692",
    "authors": [
      "Long Bai",
      "Mobarakol Islam",
      "Lalithkumar Seenivasan",
      "Hongliang Ren"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.11699",
    "title": "RGCVAE: Relational Graph Conditioned Variational Autoencoder for  Molecule Design",
    "abstract": "Identifying molecules that exhibit some pre-specified properties is a difficult problem to solve. In the last few years, deep generative models have been used for molecule generation. Deep Graph Variational Autoencoders are among the most powerful machine learning tools with which it is possible to address this problem. However, existing methods struggle in capturing the true data distribution and tend to be computationally expensive. In this work, we propose RGCVAE, an efficient and effective Graph Variational Autoencoder based on: (i) an encoding network exploiting a new powerful Relational Graph Isomorphism Network; (ii) a novel probabilistic decoding component. Compared to several state-of-the-art VAE methods on two widely adopted datasets, RGCVAE shows state-of-the-art molecule generation performance while being significantly faster to train. ",
    "url": "https://arxiv.org/abs/2305.11699",
    "authors": [
      "Davide Rigoni",
      "Nicolò Navarin",
      "Alessandro Sperduti"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2305.11701",
    "title": "S-JEA: Stacked Joint Embedding Architectures for Self-Supervised Visual  Representation Learning",
    "abstract": "The recent emergence of Self-Supervised Learning (SSL) as a fundamental paradigm for learning image representations has, and continues to, demonstrate high empirical success in a variety of tasks. However, most SSL approaches fail to learn embeddings that capture hierarchical semantic concepts that are separable and interpretable. In this work, we aim to learn highly separable semantic hierarchical representations by stacking Joint Embedding Architectures (JEA) where higher-level JEAs are input with representations of lower-level JEA. This results in a representation space that exhibits distinct sub-categories of semantic concepts (e.g., model and colour of vehicles) in higher-level JEAs. We empirically show that representations from stacked JEA perform on a similar level as traditional JEA with comparative parameter counts and visualise the representation spaces to validate the semantic hierarchies. ",
    "url": "https://arxiv.org/abs/2305.11701",
    "authors": [
      "Alžběta Manová",
      "Aiden Durrant",
      "Georgios Leontidis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11707",
    "title": "What Comes Next? Evaluating Uncertainty in Neural Text Generators  Against Human Production Variability",
    "abstract": "In Natural Language Generation (NLG) tasks, for any input, multiple communicative goals are plausible, and any goal can be put into words, or produced, in multiple ways. We characterise the extent to which human production varies lexically, syntactically, and semantically across four NLG tasks, connecting human production variability to aleatoric or data uncertainty. We then inspect the space of output strings shaped by a generation system's predicted probability distribution and decoding algorithm to probe its uncertainty. For each test input, we measure the generator's calibration to human production variability. Following this instance-level approach, we analyse NLG models and decoding strategies, demonstrating that probing a generator with multiple samples and, when possible, multiple references, provides the level of detail necessary to gain understanding of a model's representation of uncertainty. ",
    "url": "https://arxiv.org/abs/2305.11707",
    "authors": [
      "Mario Giulianelli",
      "Joris Baan",
      "Wilker Aziz",
      "Raquel Fernández",
      "Barbara Plank"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11729",
    "title": "ViDaS Video Depth-aware Saliency Network",
    "abstract": "We introduce ViDaS, a two-stream, fully convolutional Video, Depth-Aware Saliency network to address the problem of attention modeling ``in-the-wild\", via saliency prediction in videos. Contrary to existing visual saliency approaches using only RGB frames as input, our network employs also depth as an additional modality. The network consists of two visual streams, one for the RGB frames, and one for the depth frames. Both streams follow an encoder-decoder approach and are fused to obtain a final saliency map. The network is trained end-to-end and is evaluated in a variety of different databases with eye-tracking data, containing a wide range of video content. Although the publicly available datasets do not contain depth, we estimate it using three different state-of-the-art methods, to enable comparisons and a deeper insight. Our method outperforms in most cases state-of-the-art models and our RGB-only variant, which indicates that depth can be beneficial to accurately estimating saliency in videos displayed on a 2D screen. Depth has been widely used to assist salient object detection problems, where it has been proven to be very beneficial. Our problem though differs significantly from salient object detection, since it is not restricted to specific salient objects, but predicts human attention in a more general aspect. These two problems not only have different objectives, but also different ground truth data and evaluation metrics. To our best knowledge, this is the first competitive deep learning video saliency estimation approach that combines both RGB and Depth features to address the general problem of saliency estimation ``in-the-wild\". The code will be publicly released. ",
    "url": "https://arxiv.org/abs/2305.11729",
    "authors": [
      "Ioanna Diamanti",
      "Antigoni Tsiami",
      "Petros Koutras",
      "Petros Maragos"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.11731",
    "title": "Persian Typographical Error Type Detection using Many-to-Many Deep  Neural Networks on Algorithmically-Generated Misspellings",
    "abstract": "Digital technologies have led to an influx of text created daily in a variety of languages, styles, and formats. A great deal of the popularity of spell-checking systems can be attributed to this phenomenon since they are crucial to polishing the digitally conceived text. In this study, we tackle Typographical Error Type Detection in Persian, which has been relatively understudied. In this paper, we present a public dataset named FarsTypo, containing 3.4 million chronologically ordered and part-of-speech tagged words of diverse topics and linguistic styles. An algorithm for applying Persian-specific errors is developed and applied to a scalable size of these words, forming a parallel dataset of correct and incorrect words. Using FarsTypo, we establish a firm baseline and compare different methodologies using various architectures. In addition, we present a novel Many-to-Many Deep Sequential Neural Network to perform token classification using both word and character embeddings in combination with bidirectional LSTM layers to detect typographical errors across 51 classes. We compare our approach with highly-advanced industrial systems that, unlike this study, have been developed utilizing a variety of resources. The results of our final method were competitive in that we achieved an accuracy of 97.62%, a precision of 98.83%, a recall of 98.61%, and outperformed the rest in terms of speed. ",
    "url": "https://arxiv.org/abs/2305.11731",
    "authors": [
      "Mohammad Dehghani",
      "Heshaam Faili"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.11742",
    "title": "MedLens: Improve mortality prediction via medical signs selecting and  regression interpolation",
    "abstract": "Monitoring the health status of patients and predicting mortality in advance is vital for providing patients with timely care and treatment. Massive medical signs in electronic health records (EHR) are fitted into advanced machine learning models to make predictions. However, the data-quality problem of original clinical signs is less discussed in the literature. Based on an in-depth measurement of the missing rate and correlation score across various medical signs and a large amount of patient hospital admission records, we discovered the comprehensive missing rate is extremely high, and a large number of useless signs could hurt the performance of prediction models. Then we concluded that only improving data-quality could improve the baseline accuracy of different prediction algorithms. We designed MEDLENS, with an automatic vital medical signs selection approach via statistics and a flexible interpolation approach for high missing rate time series. After augmenting the data-quality of original medical signs, MEDLENS applies ensemble classifiers to boost the accuracy and reduce the computation overhead at the same time. It achieves a very high accuracy performance of 0.96% AUC-ROC and 0.81% AUC-PR, which exceeds the previous benchmark. ",
    "url": "https://arxiv.org/abs/2305.11742",
    "authors": [
      "Xuesong Ye",
      "Jun Wu",
      "Chengjie Mou",
      "Weinan Dai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.11744",
    "title": "Inference-time Re-ranker Relevance Feedback for Neural Information  Retrieval",
    "abstract": "Neural information retrieval often adopts a retrieve-and-rerank framework: a bi-encoder network first retrieves K (e.g., 100) candidates that are then re-ranked using a more powerful cross-encoder model to rank the better candidates higher. The re-ranker generally produces better candidate scores than the retriever, but is limited to seeing only the top K retrieved candidates, thus providing no improvements in retrieval performance as measured by Recall@K. In this work, we leverage the re-ranker to also improve retrieval by providing inference-time relevance feedback to the retriever. Concretely, we update the retriever's query representation for a test instance using a lightweight inference-time distillation of the re-ranker's prediction for that instance. The distillation loss is designed to bring the retriever's candidate scores closer to those of the re-ranker. A second retrieval step is then performed with the updated query vector. We empirically show that our approach, which can serve arbitrary retrieve-and-rerank pipelines, significantly improves retrieval recall in multiple domains, languages, and modalities. ",
    "url": "https://arxiv.org/abs/2305.11744",
    "authors": [
      "Revanth Gangi Reddy",
      "Pradeep Dasigi",
      "Md Arafat Sultan",
      "Arman Cohan",
      "Avirup Sil",
      "Heng Ji",
      "Hannaneh Hajishirzi"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.11746",
    "title": "HalOmi: A Manually Annotated Benchmark for Multilingual Hallucination  and Omission Detection in Machine Translation",
    "abstract": "Hallucinations in machine translation are translations that contain information completely unrelated to the input. Omissions are translations that do not include some of the input information. While both cases tend to be catastrophic errors undermining user trust, annotated data with these types of pathologies is extremely scarce and is limited to a few high-resource languages. In this work, we release an annotated dataset for the hallucination and omission phenomena covering 18 translation directions with varying resource levels and scripts. Our annotation covers different levels of partial and full hallucinations as well as omissions both at the sentence and at the word level. Additionally, we revisit previous methods for hallucination and omission detection, show that conclusions made based on a single language pair largely do not hold for a large-scale evaluation, and establish new solid baselines. ",
    "url": "https://arxiv.org/abs/2305.11746",
    "authors": [
      "David Dale",
      "Elena Voita",
      "Janice Lam",
      "Prangthip Hansanti",
      "Christophe Ropers",
      "Elahe Kalbassi",
      "Cynthia Gao",
      "Loïc Barrault",
      "Marta R. Costa-jussà"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.11772",
    "title": "Neural Foundations of Mental Simulation: Future Prediction of Latent  Representations on Dynamic Scenes",
    "abstract": "Humans and animals have a rich and flexible understanding of the physical world, which enables them to infer the underlying dynamical trajectories of objects and events, plausible future states, and use that to plan and anticipate the consequences of actions. However, the neural mechanisms underlying these computations are unclear. We combine a goal-driven modeling approach with dense neurophysiological data and high-throughput human behavioral readouts to directly impinge on this question. Specifically, we construct and evaluate several classes of sensory-cognitive networks to predict the future state of rich, ethologically-relevant environments, ranging from self-supervised end-to-end models with pixel-wise or object-centric objectives, to models that future predict in the latent space of purely static image-based or dynamic video-based pretrained foundation models. We find strong differentiation across these model classes in their ability to predict neural and behavioral data both within and across diverse environments. In particular, we find that neural responses are currently best predicted by models trained to predict the future state of their environment in the latent space of pretrained foundation models optimized for dynamic scenes in a self-supervised manner. Notably, models that future predict in the latent space of video foundation models that are optimized to support a diverse range of sensorimotor tasks, reasonably match both human behavioral error patterns and neural dynamics across all environmental scenarios that we were able to test. Overall, these findings suggest that the neural mechanisms and behaviors of primate mental simulation are thus far most consistent with being optimized to future predict on dynamic, reusable visual representations that are useful for embodied AI more generally. ",
    "url": "https://arxiv.org/abs/2305.11772",
    "authors": [
      "Aran Nayebi",
      "Rishi Rajalingham",
      "Mehrdad Jazayeri",
      "Guangyu Robert Yang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2305.11779",
    "title": "DMDD: A Large-Scale Dataset for Dataset Mentions Detection",
    "abstract": "The recognition of dataset names is a critical task for automatic information extraction in scientific literature, enabling researchers to understand and identify research opportunities. However, existing corpora for dataset mention detection are limited in size and naming diversity. In this paper, we introduce the Dataset Mentions Detection Dataset (DMDD), the largest publicly available corpus for this task. DMDD consists of the DMDD main corpus, comprising 31,219 scientific articles with over 449,000 dataset mentions weakly annotated in the format of in-text spans, and an evaluation set, which comprises of 450 scientific articles manually annotated for evaluation purposes. We use DMDD to establish baseline performance for dataset mention detection and linking. By analyzing the performance of various models on DMDD, we are able to identify open problems in dataset mention detection. We invite the community to use our dataset as a challenge to develop novel dataset mention detection models. ",
    "url": "https://arxiv.org/abs/2305.11779",
    "authors": [
      "Huitong Pan",
      "Qi Zhang",
      "Eduard Dragut",
      "Cornelia Caragea",
      "Longin Jan Latecki"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.11781",
    "title": "Lifting Network Protocol Implementation to Precise Format Specification  with Security Applications",
    "abstract": "Inferring protocol formats is critical for many security applications. However, existing format-inference techniques often miss many formats, because almost all of them are in a fashion of dynamic analysis and rely on a limited number of network packets to drive their analysis. If a feature is not present in the input packets, the feature will be missed in the resulting formats. We develop a novel static program analysis for format inference. It is well-known that static analysis does not rely on any input packets and can achieve high coverage by scanning every piece of code. However, for efficiency and precision, we have to address two challenges, namely path explosion and disordered path constraints. To this end, our approach uses abstract interpretation to produce a novel data structure called the abstract format graph. It delimits precise but costly operations to only small regions, thus ensuring precision and efficiency at the same time. Our inferred formats are of high coverage and precisely specify both field boundaries and semantic constraints among packet fields. Our evaluation shows that we can infer formats for a protocol in one minute with >95% precision and recall, much better than four baseline techniques. Our inferred formats can substantially enhance existing protocol fuzzers, improving the coverage by 20% to 260% and discovering 53 zero-days with 47 assigned CVEs. We also provide case studies of adopting our inferred formats in other security applications including traffic auditing and intrusion detection. ",
    "url": "https://arxiv.org/abs/2305.11781",
    "authors": [
      "Qingkai Shi",
      "Junyang Shao",
      "Yapeng Ye",
      "Mingwei Zheng",
      "Xiangyu Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2305.11782",
    "title": "Real-time and Robust Feature Detection of Continuous Marker Pattern for  Dense 3-D Deformation Measurement",
    "abstract": "Visuotactile sensing technology has received much attention in recent years. This article proposes a feature detection method applicable to visuotactile sensors based on continuous marker patterns (CMP) to measure 3-d deformation. First, we construct the feature model of checkerboard-like corners under contact deformation, and design a novel double-layer circular sampler. Then, we propose the judging criteria and response function of corner features by analyzing sampling signals' amplitude-frequency characteristics and circular cross-correlation behavior. The proposed feature detection algorithm fully considers the boundary characteristics retained by the corners with geometric distortion, thus enabling reliable detection at a low calculation cost. The experimental results show that the proposed method has significant advantages in terms of real-time and robustness. Finally, we have achieved the high-density 3-d contact deformation visualization based on this detection method. This technique is able to clearly record the process of contact deformation, thus enabling inverse sensing of dynamic contact processes. ",
    "url": "https://arxiv.org/abs/2305.11782",
    "authors": [
      "Mingxuan Li",
      "Yen Hang Zhou",
      "Liemin Li",
      "Yao Jiang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.11791",
    "title": "Enhancing Few-shot NER with Prompt Ordering based Data Augmentation",
    "abstract": "Recently, data augmentation (DA) methods have been proven to be effective for pre-trained language models (PLMs) in low-resource settings, including few-shot named entity recognition (NER). However, conventional NER DA methods are mostly aimed at sequence labeling models, i.e., token-level classification, and few are compatible with unified autoregressive generation frameworks, which can handle a wider range of NER tasks, such as nested NER. Furthermore, these generation frameworks have a strong assumption that the entities will appear in the target sequence with the same left-to-right order as the source sequence. In this paper, we claim that there is no need to keep this strict order, and more diversified but reasonable target entity sequences can be provided during the training stage as a novel DA method. Nevertheless, a naive mixture of augmented data can confuse the model since one source sequence will then be paired with different target sequences. Therefore, we propose a simple but effective Prompt Ordering based Data Augmentation (PODA) method to improve the training of unified autoregressive generation frameworks under few-shot NER scenarios. Experimental results on three public NER datasets and further analyses demonstrate the effectiveness of our approach. ",
    "url": "https://arxiv.org/abs/2305.11791",
    "authors": [
      "Huiming Wang",
      "Liying Cheng",
      "Wenxuan Zhang",
      "De Wen Soh",
      "Lidong Bing"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.11795",
    "title": "A One-Class Classifier for the Detection of GAN Manipulated  Multi-Spectral Satellite Images",
    "abstract": "The highly realistic image quality achieved by current image generative models has many academic and industrial applications. To limit the use of such models to benign applications, though, it is necessary that tools to conclusively detect whether an image has been generated synthetically or not are developed. For this reason, several detectors have been developed providing excellent performance in computer vision applications, however, they can not be applied as they are to multispectral satellite images, and hence new models must be trained. In general, two-class classifiers can achieve very good detection accuracies, however they are not able to generalise to image domains and generative models architectures different than those used during training. For this reason, in this paper, we propose a one-class classifier based on Vector Quantized Variational Autoencoder 2 (VQ-VAE 2) features to overcome the limitations of two-class classifiers. First, we emphasize the generalization problem that binary classifiers suffer from by training and testing an EfficientNet-B4 architecture on multiple multispectral datasets. Then we show that, since the VQ-VAE 2 based classifier is trained only on pristine images, it is able to detect images belonging to different domains and generated by architectures that have not been used during training. Last, we compare the two classifiers head-to-head on the same generated datasets, highlighting the superiori generalization capabilities of the VQ-VAE 2-based detector. ",
    "url": "https://arxiv.org/abs/2305.11795",
    "authors": [
      "Lydia Abady",
      "Giovanna Maria Dimitri",
      "Mauro Barni"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2305.11806",
    "title": "The Inside Story: Towards Better Understanding of Machine Translation  Neural Evaluation Metrics",
    "abstract": "Neural metrics for machine translation evaluation, such as COMET, exhibit significant improvements in their correlation with human judgments, as compared to traditional metrics based on lexical overlap, such as BLEU. Yet, neural metrics are, to a great extent, \"black boxes\" returning a single sentence-level score without transparency about the decision-making process. In this work, we develop and compare several neural explainability methods and demonstrate their effectiveness for interpreting state-of-the-art fine-tuned neural metrics. Our study reveals that these metrics leverage token-level information that can be directly attributed to translation errors, as assessed through comparison of token-level neural saliency maps with Multidimensional Quality Metrics (MQM) annotations and with synthetically-generated critical translation errors. To ease future research, we release our code at: https://github.com/Unbabel/COMET/tree/explainable-metrics. ",
    "url": "https://arxiv.org/abs/2305.11806",
    "authors": [
      "Ricardo Rei",
      "Nuno M. Guerreiro",
      "Marcos Treviso",
      "Luisa Coheur",
      "Alon Lavie",
      "André F.T. Martins"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.11808",
    "title": "Pseudo-Label Training and Model Inertia in Neural Machine Translation",
    "abstract": "Like many other machine learning applications, neural machine translation (NMT) benefits from over-parameterized deep neural models. However, these models have been observed to be brittle: NMT model predictions are sensitive to small input changes and can show significant variation across re-training or incremental model updates. This work studies a frequently used method in NMT, pseudo-label training (PLT), which is common to the related techniques of forward-translation (or self-training) and sequence-level knowledge distillation. While the effect of PLT on quality is well-documented, we highlight a lesser-known effect: PLT can enhance a model's stability to model updates and input perturbations, a set of properties we call model inertia. We study inertia effects under different training settings and we identify distribution simplification as a mechanism behind the observed results. ",
    "url": "https://arxiv.org/abs/2305.11808",
    "authors": [
      "Benjamin Hsu",
      "Anna Currey",
      "Xing Niu",
      "Maria Nădejde",
      "Georgiana Dinu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.11833",
    "title": "Complexity of Neural Network Training and ETR: Extensions with  Effectively Continuous Functions",
    "abstract": "We study the complexity of the problem of training neural networks defined via various activation functions. The training problem is known to be existsR-complete with respect to linear activation functions and the ReLU activation function. We consider the complexity of the problem with respect to the sigmoid activation function and other effectively continuous functions. We show that these training problems are polynomial-time many-one bireducible to the existential theory of the reals extended with the corresponding activation functions. In particular, we establish that the sigmoid activation function leads to the existential theory of the reals with the exponential function. It is thus open, and equivalent with the decidability of the existential theory of the reals with the exponential function, whether training neural networks using the sigmoid activation function is algorithmically solvable. In contrast, we obtain that the training problem is undecidable if sinusoidal activation functions are considered. Finally, we obtain general upper bounds for the complexity of the training problem in the form of low levels of the arithmetical hierarchy. ",
    "url": "https://arxiv.org/abs/2305.11833",
    "authors": [
      "Teemu Hankala",
      "Miika Hannula",
      "Juha Kontinen",
      "Jonni Virtema"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Artificial Intelligence (cs.AI)",
      "Computational Complexity (cs.CC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11859",
    "title": "Complex Claim Verification with Evidence Retrieved in the Wild",
    "abstract": "Evidence retrieval is a core part of automatic fact-checking. Prior work makes simplifying assumptions in retrieval that depart from real-world use cases: either no access to evidence, access to evidence curated by a human fact-checker, or access to evidence available long after the claim has been made. In this work, we present the first fully automated pipeline to check real-world claims by retrieving raw evidence from the web. We restrict our retriever to only search documents available prior to the claim's making, modeling the realistic scenario where an emerging claim needs to be checked. Our pipeline includes five components: claim decomposition, raw document retrieval, fine-grained evidence retrieval, claim-focused summarization, and veracity judgment. We conduct experiments on complex political claims in the ClaimDecomp dataset and show that the aggregated evidence produced by our pipeline improves veracity judgments. Human evaluation finds the evidence summary produced by our system is reliable (it does not hallucinate information) and relevant to answering key questions about a claim, suggesting that it can assist fact-checkers even when it cannot surface a complete evidence set. ",
    "url": "https://arxiv.org/abs/2305.11859",
    "authors": [
      "Jifan Chen",
      "Grace Kim",
      "Aniruddh Sriram",
      "Greg Durrett",
      "Eunsol Choi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.11199",
    "title": "At-Admission Prediction of Mortality and Pulmonary Embolism in COVID-19  Patients Using Statistical and Machine Learning Methods: An International  Cohort Study",
    "abstract": "By September, 2022, more than 600 million cases of SARS-CoV-2 infection have been reported globally, resulting in over 6.5 million deaths. COVID-19 mortality risk estimators are often, however, developed with small unrepresentative samples and with methodological limitations. It is highly important to develop predictive tools for pulmonary embolism (PE) in COVID-19 patients as one of the most severe preventable complications of COVID-19. Using a dataset of more than 800,000 COVID-19 patients from an international cohort, we propose a cost-sensitive gradient-boosted machine learning model that predicts occurrence of PE and death at admission. Logistic regression, Cox proportional hazards models, and Shapley values were used to identify key predictors for PE and death. Our prediction model had a test AUROC of 75.9% and 74.2%, and sensitivities of 67.5% and 72.7% for PE and all-cause mortality respectively on a highly diverse and held-out test set. The PE prediction model was also evaluated on patients in UK and Spain separately with test results of 74.5% AUROC, 63.5% sensitivity and 78.9% AUROC, 95.7% sensitivity. Age, sex, region of admission, comorbidities (chronic cardiac and pulmonary disease, dementia, diabetes, hypertension, cancer, obesity, smoking), and symptoms (any, confusion, chest pain, fatigue, headache, fever, muscle or joint pain, shortness of breath) were the most important clinical predictors at admission. Our machine learning model developed from an international cohort can serve to better regulate hospital risk prioritisation of at-risk patients. ",
    "url": "https://arxiv.org/abs/2305.11199",
    "authors": [
      "Munib Mesinovic",
      "Xin Ci Wong",
      "Giri Shan Rajahram",
      "Barbara Wanjiru Citarella",
      "Kalaiarasu M. Peariasamy",
      "Frank van Someren Greve",
      "Piero Olliaro",
      "Laura Merson",
      "Lei Clifton",
      "Christiana Kartsonaki",
      "ISARIC Characterisation Group"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11254",
    "title": "Robust Quantum Controllers: Quantum Information -- Thermodynamic Hidden  Force Control in Intelligent Robotics based on Quantum Soft Computing",
    "abstract": "A generalized strategy for the design of intelligent robust control systems based on quantum / soft computing technologies is described. The reliability of hybrid intelligent controllers increase by providing the ability to self-organize of imperfect knowledge bases. The main attention is paid to increasing the level of robustness of intelligent control systems in unpredictable control situations with the demonstration by illustrative examples. A SW & HW platform and support tools for a supercomputer accelerator for modeling quantum algorithms on a classical computer are described. ",
    "url": "https://arxiv.org/abs/2305.11254",
    "authors": [
      "Sergey V. Ulyanov",
      "Viktor S. Ulyanov",
      "Takakhide Hagiwara"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.11278",
    "title": "Real-Time Variational Method for Learning Neural Trajectory and its  Dynamics",
    "abstract": "Latent variable models have become instrumental in computational neuroscience for reasoning about neural computation. This has fostered the development of powerful offline algorithms for extracting latent neural trajectories from neural recordings. However, despite the potential of real time alternatives to give immediate feedback to experimentalists, and enhance experimental design, they have received markedly less attention. In this work, we introduce the exponential family variational Kalman filter (eVKF), an online recursive Bayesian method aimed at inferring latent trajectories while simultaneously learning the dynamical system generating them. eVKF works for arbitrary likelihoods and utilizes the constant base measure exponential family to model the latent state stochasticity. We derive a closed-form variational analogue to the predict step of the Kalman filter which leads to a provably tighter bound on the ELBO compared to another online variational method. We validate our method on synthetic and real-world data, and, notably, show that it achieves competitive performance ",
    "url": "https://arxiv.org/abs/2305.11278",
    "authors": [
      "Matthew Dowling",
      "Yuan Zhao",
      "Il Memming Park"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2305.11284",
    "title": "Federated learning for secure development of AI models for Parkinson's  disease detection using speech from different languages",
    "abstract": "Parkinson's disease (PD) is a neurological disorder impacting a person's speech. Among automatic PD assessment methods, deep learning models have gained particular interest. Recently, the community has explored cross-pathology and cross-language models which can improve diagnostic accuracy even further. However, strict patient data privacy regulations largely prevent institutions from sharing patient speech data with each other. In this paper, we employ federated learning (FL) for PD detection using speech signals from 3 real-world language corpora of German, Spanish, and Czech, each from a separate institution. Our results indicate that the FL model outperforms all the local models in terms of diagnostic accuracy, while not performing very differently from the model based on centrally combined training sets, with the advantage of not requiring any data sharing among collaborators. This will simplify inter-institutional collaborations, resulting in enhancement of patient outcomes. ",
    "url": "https://arxiv.org/abs/2305.11284",
    "authors": [
      "Soroosh Tayebi Arasteh",
      "Cristian David Rios-Urrego",
      "Elmar Noeth",
      "Andreas Maier",
      "Seung Hee Yang",
      "Jan Rusz",
      "Juan Rafael Orozco-Arroyave"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11353",
    "title": "Meta-learning for heterogeneous treatment effect estimation with  closed-form solvers",
    "abstract": "This article proposes a meta-learning method for estimating the conditional average treatment effect (CATE) from a few observational data. The proposed method learns how to estimate CATEs from multiple tasks and uses the knowledge for unseen tasks. In the proposed method, based on the meta-learner framework, we decompose the CATE estimation problem into sub-problems. For each sub-problem, we formulate our estimation models using neural networks with task-shared and task-specific parameters. With our formulation, we can obtain optimal task-specific parameters in a closed form that are differentiable with respect to task-shared parameters, making it possible to perform effective meta-learning. The task-shared parameters are trained such that the expected CATE estimation performance in few-shot settings is improved by minimizing the difference between a CATE estimated with a large amount of data and one estimated with just a few data. Our experimental results demonstrate that our method outperforms the existing meta-learning approaches and CATE estimation methods. ",
    "url": "https://arxiv.org/abs/2305.11353",
    "authors": [
      "Tomoharu Iwata",
      "Yoichi Chikahara"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11435",
    "title": "Syllable Discovery and Cross-Lingual Generalization in a Visually  Grounded, Self-Supervised Speech Mode",
    "abstract": "In this paper, we show that representations capturing syllabic units emerge when training a self-supervised speech model with a visually-grounded training objective. We demonstrate that a nearly identical model architecture (HuBERT) trained with a masked language modeling loss does not exhibit this same ability, suggesting that the visual grounding objective is responsible for the emergence of this phenomenon. We propose the use of a minimum cut algorithm to automatically predict syllable boundaries in speech, followed by a 2-stage clustering method to group identical syllables together. We show that our model not only outperforms a state-of-the-art syllabic segmentation method on the language it was trained on (English), but also generalizes in a zero-shot fashion to Estonian. Finally, we show that the same model is capable of zero-shot generalization for a word segmentation task on 4 other languages from the Zerospeech Challenge, in some cases beating the previous state-of-the-art. ",
    "url": "https://arxiv.org/abs/2305.11435",
    "authors": [
      "Puyuan Peng",
      "Shang-Wen Li",
      "Okko Räsänen",
      "Abdelrahman Mohamed",
      "David Harwath"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2305.11469",
    "title": "The Barzilai-Borwein Method for Distributed Optimization over Unbalanced  Directed Networks",
    "abstract": "This paper studies optimization problems over multi-agent systems, in which all agents cooperatively minimize a global objective function expressed as a sum of local cost functions. Each agent in the systems uses only local computation and communication in the overall process without leaking their private information. Based on the Barzilai-Borwein (BB) method and multi-consensus inner loops, a distributed algorithm with the availability of larger stepsizes and accelerated convergence, namely ADBB, is proposed. Moreover, owing to employing only row-stochastic weight matrices, ADBB can resolve the optimization problems over unbalanced directed networks without requiring the knowledge of neighbors' out-degree for each agent. Via establishing contraction relationships between the consensus error, the optimality gap, and the gradient tracking error, ADBB is theoretically proved to converge linearly to the globally optimal solution. A real-world data set is used in simulations to validate the correctness of the theoretical analysis. ",
    "url": "https://arxiv.org/abs/2305.11469",
    "authors": [
      "Jinhui Hu",
      "Xin Chen",
      "Lifeng Zheng",
      "Ling Zhang",
      "Huaqing Li"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.11504",
    "title": "JOINEDTrans: Prior Guided Multi-task Transformer for Joint Optic  Disc/Cup Segmentation and Fovea Detection",
    "abstract": "Deep learning-based image segmentation and detection models have largely improved the efficiency of analyzing retinal landmarks such as optic disc (OD), optic cup (OC), and fovea. However, factors including ophthalmic disease-related lesions and low image quality issues may severely complicate automatic OD/OC segmentation and fovea detection. Most existing works treat the identification of each landmark as a single task, and take into account no prior information. To address these issues, we propose a prior guided multi-task transformer framework for joint OD/OC segmentation and fovea detection, named JOINEDTrans. JOINEDTrans effectively combines various spatial features of the fundus images, relieving the structural distortions induced by lesions and other imaging issues. It contains a segmentation branch and a detection branch. To be noted, we employ an encoder pretrained in a vessel segmentation task to effectively exploit the positional relationship among vessel, OD/OC, and fovea, successfully incorporating spatial prior into the proposed JOINEDTrans framework. There are a coarse stage and a fine stage in JOINEDTrans. In the coarse stage, OD/OC coarse segmentation and fovea heatmap localization are obtained through a joint segmentation and detection module. In the fine stage, we crop regions of interest for subsequent refinement and use predictions obtained in the coarse stage to provide additional information for better performance and faster convergence. Experimental results demonstrate that JOINEDTrans outperforms existing state-of-the-art methods on the publicly available GAMMA, REFUGE, and PALM fundus image datasets. We make our code available at https://github.com/HuaqingHe/JOINEDTrans ",
    "url": "https://arxiv.org/abs/2305.11504",
    "authors": [
      "Huaqing He",
      "Li Lin",
      "Zhiyuan Cai",
      "Pujin Cheng",
      "Xiaoying Tang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.11558",
    "title": "Blank-regularized CTC for Frame Skipping in Neural Transducer",
    "abstract": "Neural Transducer and connectionist temporal classification (CTC) are popular end-to-end automatic speech recognition systems. Due to their frame-synchronous design, blank symbols are introduced to address the length mismatch between acoustic frames and output tokens, which might bring redundant computation. Previous studies managed to accelerate the training and inference of neural Transducers by discarding frames based on the blank symbols predicted by a co-trained CTC. However, there is no guarantee that the co-trained CTC can maximize the ratio of blank symbols. This paper proposes two novel regularization methods to explicitly encourage more blanks by constraining the self-loop of non-blank symbols in the CTC. It is interesting to find that the frame reduction ratio of the neural Transducer can approach the theoretical boundary. Experiments on LibriSpeech corpus show that our proposed method accelerates the inference of neural Transducer by 4 times without sacrificing performance. Our work is open-sourced and publicly available https://github.com/k2-fsa/icefall. ",
    "url": "https://arxiv.org/abs/2305.11558",
    "authors": [
      "Yifan Yang",
      "Xiaoyu Yang",
      "Liyong Guo",
      "Zengwei Yao",
      "Wei Kang",
      "Fangjun Kuang",
      "Long Lin",
      "Xie Chen",
      "Daniel Povey"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.11569",
    "title": "Language-Universal Phonetic Representation in Multilingual Speech  Pretraining for Low-Resource Speech Recognition",
    "abstract": "We improve low-resource ASR by integrating the ideas of multilingual training and self-supervised learning. Concretely, we leverage an International Phonetic Alphabet (IPA) multilingual model to create frame-level pseudo labels for unlabeled speech, and use these pseudo labels to guide hidden-unit BERT (HuBERT) based speech pretraining in a phonetically-informed manner. The experiments on the Multilingual Speech (MLS) Corpus show that the proposed approach consistently outperforms the standard HuBERT on all the target languages. Moreover, on 3 of the 4 languages, comparing to the standard HuBERT, the approach performs better, meanwhile is able to save supervised training data by 1.5k hours (75%) at most. Our approach outperforms most of the state of the arts, with much less pretraining data in terms of hours and language diversity. Compared to XLSR-53 and a retraining based multilingual method, our approach performs better with full and limited finetuning data scenarios. ",
    "url": "https://arxiv.org/abs/2305.11569",
    "authors": [
      "Siyuan Feng",
      "Ming Tu",
      "Rui Xia",
      "Chuanzeng Huang",
      "Yuxuan Wang"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2305.11623",
    "title": "Colorings of some Cayley graphs",
    "abstract": "Cayley graphs are graphs on algebraic structures, typically groups or group-like structures. In this paper, we have obtained a few results on Cayley graphs on Cyclic groups, typically powers of cycles, some colorings of powers of cycles, Cayley graphs on some non-abelian groups, and Cayley graphs on gyrogroups. ",
    "url": "https://arxiv.org/abs/2305.11623",
    "authors": [
      "Prajnanaswaroop S"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2305.11805",
    "title": "PANNA 2.0: Efficient neural network interatomic potentials and new  architectures",
    "abstract": "We present the latest release of PANNA 2.0 (Properties from Artificial Neural Network Architectures), a code for the generation of neural network interatomic potentials based on local atomic descriptors and multilayer perceptrons. Built on a new back end, this new release of PANNA features improved tools for customizing and monitoring network training, better GPU support including a fast descriptor calculator, new plugins for external codes and a new architecture for the inclusion of long-range electrostatic interactions through a variational charge equilibration scheme. We present an overview of the main features of the new code, and several benchmarks comparing the accuracy of PANNA models to the state of the art, on commonly used benchmarks as well as richer datasets. ",
    "url": "https://arxiv.org/abs/2305.11805",
    "authors": [
      "Franco Pellegrini",
      "Ruggero Lot",
      "Yusuf Shaidu",
      "Emine Küçükbenli"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2305.11864",
    "title": "North Sámi Dialect Identification with Self-supervised Speech Models",
    "abstract": "The North S\\'{a}mi (NS) language encapsulates four primary dialectal variants that are related but that also have differences in their phonology, morphology, and vocabulary. The unique geopolitical location of NS speakers means that in many cases they are bilingual in S\\'{a}mi as well as in the dominant state language: Norwegian, Swedish, or Finnish. This enables us to study the NS variants both with respect to the spoken state language and their acoustic characteristics. In this paper, we investigate an extensive set of acoustic features, including MFCCs and prosodic features, as well as state-of-the-art self-supervised representations, namely, XLS-R, WavLM, and HuBERT, for the automatic detection of the four NS variants. In addition, we examine how the majority state language is reflected in the dialects. Our results show that NS dialects are influenced by the state language and that the four dialects are separable, reaching high classification accuracy, especially with the XLS-R model. ",
    "url": "https://arxiv.org/abs/2305.11864",
    "authors": [
      "Sofoklis Kakouros",
      "Katri Hiovain-Asikainen"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2005.06356",
    "title": "Impact of Geo-distribution and Mining Pools on Blockchains: A Study of  Ethereum",
    "abstract": " Title: Impact of Geo-distribution and Mining Pools on Blockchains: A Study of  Ethereum ",
    "url": "https://arxiv.org/abs/2005.06356",
    "authors": [
      "Paulo Silva",
      "David Vavřička",
      "João Barreto",
      "Miguel Matos"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2106.04463",
    "title": "A multi-centre polyp detection and segmentation dataset for  generalisability assessment",
    "abstract": " Comments: 19 pages ",
    "url": "https://arxiv.org/abs/2106.04463",
    "authors": [
      "Sharib Ali",
      "Debesh Jha",
      "Noha Ghatwary",
      "Stefano Realdon",
      "Renato Cannizzaro",
      "Osama E. Salem",
      "Dominique Lamarque",
      "Christian Daul",
      "Michael A. Riegler",
      "Kim V. Anonsen",
      "Andreas Petlund",
      "Pål Halvorsen",
      "Jens Rittscher",
      "Thomas de Lange",
      "James E. East"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.09060",
    "title": "On the Noise Stability and Robustness of Adversarially Trained Networks  on NVM Crossbars",
    "abstract": " Comments: 13 pages, 14 figures ",
    "url": "https://arxiv.org/abs/2109.09060",
    "authors": [
      "Chun Tao",
      "Deboleena Roy",
      "Indranil Chakraborty",
      "Kaushik Roy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.13756",
    "title": "Secondary Use of Clinical Problem List Entries for Neural Network-Based  Disease Code Assignment",
    "abstract": " Comments: 5 pages, 1 figure ",
    "url": "https://arxiv.org/abs/2112.13756",
    "authors": [
      "Markus Kreuzthaler",
      "Bastian Pfeifer",
      "Diether Kramer",
      "Stefan Schulz"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2201.10145",
    "title": "Riemannian Local Mechanism for SPD Neural Networks",
    "abstract": " Title: Riemannian Local Mechanism for SPD Neural Networks ",
    "url": "https://arxiv.org/abs/2201.10145",
    "authors": [
      "Ziheng Chen",
      "Tianyang Xu",
      "Xiao-Jun Wu",
      "Rui Wang",
      "Zhiwu Huang",
      "Josef Kittler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.12649",
    "title": "Transfer Learning for Estimation of Pendubot Angular Position Using Deep  Neural Networks",
    "abstract": " Title: Transfer Learning for Estimation of Pendubot Angular Position Using Deep  Neural Networks ",
    "url": "https://arxiv.org/abs/2201.12649",
    "authors": [
      "Sina Khanagha"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2202.03932",
    "title": "Are Transformers More Robust? Towards Exact Robustness Verification for  Transformers",
    "abstract": " Comments: Accepted at SafeComp 2023, 14 pages (Springer LNCS format), 3 figures, 2 tables, 2 algorithms ",
    "url": "https://arxiv.org/abs/2202.03932",
    "authors": [
      "Brian Hsuan-Cheng Liao",
      "Chih-Hong Cheng",
      "Hasan Esen",
      "Alois Knoll"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.09635",
    "title": "Deep Single Image Deraining using An Asymetric Cycle Generative and  Adversarial Framework",
    "abstract": " Title: Deep Single Image Deraining using An Asymetric Cycle Generative and  Adversarial Framework ",
    "url": "https://arxiv.org/abs/2202.09635",
    "authors": [
      "Wei Liu",
      "Rui Jiang",
      "Cheng Chen",
      "Tao Lu",
      "Zixiang Xiong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.02128",
    "title": "Distributionally Robust Bayesian Optimization with $φ$-divergences",
    "abstract": " Comments: 21 pages ",
    "url": "https://arxiv.org/abs/2203.02128",
    "authors": [
      "Hisham Husain",
      "Vu Nguyen",
      "Anton van den Hengel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.03677",
    "title": "Object-centric and memory-guided normality reconstruction for video  anomaly detection",
    "abstract": " Comments: Accepted at ICIP 2022 ",
    "url": "https://arxiv.org/abs/2203.03677",
    "authors": [
      "Khalil Bergaoui",
      "Yassine Naji",
      "Aleksandr Setkov",
      "Angélique Loesch",
      "Michèle Gouiffès",
      "Romaric Audigier"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.13510",
    "title": "Joint Distribution of Distance and Angles in Finite Wireless Networks",
    "abstract": " Comments: 16 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2203.13510",
    "authors": [
      "Francisco J. Martín-Vega",
      "Gerardo Gómez",
      "David Morales-Jiménez",
      "F. Javier López-Martínez",
      "Mari Carmen Aguayo-Torres"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.00381",
    "title": "The statistical nature of h-index of a network node",
    "abstract": " Title: The statistical nature of h-index of a network node ",
    "url": "https://arxiv.org/abs/2206.00381",
    "authors": [
      "Yan Liu",
      "Mudi Jiang",
      "Lianyu Hu",
      "Zengyou He"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2206.04426",
    "title": "Biologically Inspired Dynamic Thresholds for Spiking Neural Networks",
    "abstract": " Title: Biologically Inspired Dynamic Thresholds for Spiking Neural Networks ",
    "url": "https://arxiv.org/abs/2206.04426",
    "authors": [
      "Jianchuan Ding",
      "Bo Dong",
      "Felix Heide",
      "Yufei Ding",
      "Yunduo Zhou",
      "Baocai Yin",
      "Xin Yang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2207.06874",
    "title": "Kernelization for Graph Packing Problems via Rainbow Matching",
    "abstract": " Comments: Accepted to SODA 2023 ",
    "url": "https://arxiv.org/abs/2207.06874",
    "authors": [
      "Stéphane Bessy",
      "Marin Bougeret",
      "Dimitrios M. Thilikos",
      "Sebastian Wiederrecht"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2209.00507",
    "title": "Environmental Claim Detection",
    "abstract": " Title: Environmental Claim Detection ",
    "url": "https://arxiv.org/abs/2209.00507",
    "authors": [
      "Dominik Stammbach",
      "Nicolas Webersinke",
      "Julia Anna Bingler",
      "Mathias Kraus",
      "Markus Leippold"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.15190",
    "title": "Neural Integral Equations",
    "abstract": " Comments: 19 + 20 pages, 18 figures and 11 tables. Comments are welcome! v4: Article expanded to include theoretical guarantees for convergence of the integral equations solver and further experiments on brain data and interpretability of dynamics ",
    "url": "https://arxiv.org/abs/2209.15190",
    "authors": [
      "Emanuele Zappala",
      "Antonio Henrique de Oliveira Fonseca",
      "Josue Ortega Caro",
      "David van Dijk"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2210.06012",
    "title": "Phantom -- A RL-driven multi-agent framework to model complex systems",
    "abstract": " Comments: 2022 ACM International Conference on Artificial Intelligence in Finance - Benchmarks for AI in Finance Workshop 2023 Autonomous Agents and Multiagent Systems - Extended Abstract ",
    "url": "https://arxiv.org/abs/2210.06012",
    "authors": [
      "Leo Ardon",
      "Jared Vann",
      "Deepeka Garg",
      "Tom Spooner",
      "Sumitra Ganesh"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2210.16611",
    "title": "Application of Knowledge Distillation to Multi-task Speech  Representation Learning",
    "abstract": " Comments: Speech representation learning, multi-task training, wav2vec, HuBERT, knowledge distillation ",
    "url": "https://arxiv.org/abs/2210.16611",
    "authors": [
      "Mine Kerpicci",
      "Van Nguyen",
      "Shuhua Zhang",
      "Erik Visser"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2211.11275",
    "title": "VATLM: Visual-Audio-Text Pre-Training with Unified Masked Prediction for  Speech Representation Learning",
    "abstract": " Comments: 11 pages, Accepted by IEEE Transactions on Multimedia ",
    "url": "https://arxiv.org/abs/2211.11275",
    "authors": [
      "Qiushi Zhu",
      "Long Zhou",
      "Ziqiang Zhang",
      "Shujie Liu",
      "Binxing Jiao",
      "Jie Zhang",
      "Lirong Dai",
      "Daxin Jiang",
      "Jinyu Li",
      "Furu Wei"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2212.01554",
    "title": "Distributionally Robust Lyapunov Function Search Under Uncertainty",
    "abstract": " Comments: 5th Annual Learning for Dynamics & Control Conference ",
    "url": "https://arxiv.org/abs/2212.01554",
    "authors": [
      "Kehan Long",
      "Yinzhuang Yi",
      "Jorge Cortes",
      "Nikolay Atanasov"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2212.03000",
    "title": "SODA: A Natural Language Processing Package to Extract Social  Determinants of Health for Cancer Studies",
    "abstract": " Title: SODA: A Natural Language Processing Package to Extract Social  Determinants of Health for Cancer Studies ",
    "url": "https://arxiv.org/abs/2212.03000",
    "authors": [
      "Zehao Yu",
      "Xi Yang",
      "Chong Dang",
      "Prakash Adekkanattu",
      "Braja Gopal Patra",
      "Yifan Peng",
      "Jyotishman Pathak",
      "Debbie L. Wilson",
      "Ching-Yuan Chang",
      "Wei-Hsuan Lo-Ciganic",
      "Thomas J. George",
      "William R. Hogan",
      "Yi Guo",
      "Jiang Bian",
      "Yonghui Wu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.03281",
    "title": "Copula Conformal Prediction for Multi-step Time Series Forecasting",
    "abstract": " Title: Copula Conformal Prediction for Multi-step Time Series Forecasting ",
    "url": "https://arxiv.org/abs/2212.03281",
    "authors": [
      "Sophia Sun",
      "Rose Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2212.09631",
    "title": "Optimal Transport for Unsupervised Hallucination Detection in Neural  Machine Translation",
    "abstract": " Comments: Accepted at ACL 2023 ",
    "url": "https://arxiv.org/abs/2212.09631",
    "authors": [
      "Nuno M. Guerreiro",
      "Pierre Colombo",
      "Pablo Piantanida",
      "André F. T. Martins"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.10481",
    "title": "Execution-Based Evaluation for Open-Domain Code Generation",
    "abstract": " Title: Execution-Based Evaluation for Open-Domain Code Generation ",
    "url": "https://arxiv.org/abs/2212.10481",
    "authors": [
      "Zhiruo Wang",
      "Shuyan Zhou",
      "Daniel Fried",
      "Graham Neubig"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.07939",
    "title": "THLNet: two-stage heterogeneous lightweight network for monaural speech  enhancement",
    "abstract": " Title: THLNet: two-stage heterogeneous lightweight network for monaural speech  enhancement ",
    "url": "https://arxiv.org/abs/2301.07939",
    "authors": [
      "Feng Dang",
      "Qi Hu",
      "Pengyuan Zhang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2301.11849",
    "title": "Complexity of equilibria in binary public goods games on undirected  graphs",
    "abstract": " Comments: To appear in the Proceedings of the 24th ACM Conference on Economics and Computation (EC 2023) ",
    "url": "https://arxiv.org/abs/2301.11849",
    "authors": [
      "Max Klimm",
      "Maximilian J. Stahlberg"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2301.12292",
    "title": "Zero-shot causal learning",
    "abstract": " Title: Zero-shot causal learning ",
    "url": "https://arxiv.org/abs/2301.12292",
    "authors": [
      "Hamed Nilforoshan",
      "Michael Moor",
      "Yusuf Roohani",
      "Yining Chen",
      "Anja Šurina",
      "Michihiro Yasunaga",
      "Sara Oblak",
      "Jure Leskovec"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2301.13862",
    "title": "Salient Conditional Diffusion for Defending Against Backdoor Attacks",
    "abstract": " Comments: 14 pages, 5 figures. Edit: Added new baselines ",
    "url": "https://arxiv.org/abs/2301.13862",
    "authors": [
      "Brandon B. May",
      "N. Joseph Tatro",
      "Dylan Walker",
      "Piyush Kumar",
      "Nathan Shnidman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.02231",
    "title": "PubGraph: A Large-Scale Scientific Knowledge Graph",
    "abstract": " Comments: 17 Pages, 6 Figures, 9 Tables ",
    "url": "https://arxiv.org/abs/2302.02231",
    "authors": [
      "Kian Ahrabian",
      "Xinwei Du",
      "Richard Delwin Myloth",
      "Arun Baalaaji Sankar Ananthan",
      "Jay Pujara"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.05134",
    "title": "Neural Capacitated Clustering",
    "abstract": " Comments: Accepted at the 32nd International Joint Conference on Artificial Intelligence (IJCAI) 2023 ",
    "url": "https://arxiv.org/abs/2302.05134",
    "authors": [
      "Jonas K. Falkner",
      "Lars Schmidt-Thieme"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07384",
    "title": "The Geometry of Neural Nets' Parameter Spaces Under Reparametrization",
    "abstract": " Title: The Geometry of Neural Nets' Parameter Spaces Under Reparametrization ",
    "url": "https://arxiv.org/abs/2302.07384",
    "authors": [
      "Agustinus Kristiadi",
      "Felix Dangel",
      "Philipp Hennig"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.07849",
    "title": "Zero-Shot Batch-Level Anomaly Detection",
    "abstract": " Title: Zero-Shot Batch-Level Anomaly Detection ",
    "url": "https://arxiv.org/abs/2302.07849",
    "authors": [
      "Aodong Li",
      "Chen Qiu",
      "Marius Kloft",
      "Padhraic Smyth",
      "Maja Rudolph",
      "Stephan Mandt"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.13925",
    "title": "Epicurus at SemEval-2023 Task 4: Improving Prediction of Human Values  behind Arguments by Leveraging Their Definitions",
    "abstract": " Comments: Accepted to appear at the SemEval-2023 workshop, co-located with ACL 2023 ",
    "url": "https://arxiv.org/abs/2302.13925",
    "authors": [
      "Christian Fang",
      "Qixiang Fang",
      "Dong Nguyen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2304.01762",
    "title": "Incorporating Unlabelled Data into Bayesian Neural Networks",
    "abstract": " Title: Incorporating Unlabelled Data into Bayesian Neural Networks ",
    "url": "https://arxiv.org/abs/2304.01762",
    "authors": [
      "Mrinank Sharma",
      "Tom Rainforth",
      "Yee Whye Teh",
      "Vincent Fortuin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.10783",
    "title": "Denial-of-Service or Fine-Grained Control: Towards Flexible Model  Poisoning Attacks on Federated Learning",
    "abstract": " Title: Denial-of-Service or Fine-Grained Control: Towards Flexible Model  Poisoning Attacks on Federated Learning ",
    "url": "https://arxiv.org/abs/2304.10783",
    "authors": [
      "Hangtao Zhang",
      "Zeming Yao",
      "Leo Yu Zhang",
      "Shengshan Hu",
      "Chao Chen",
      "Alan Liew",
      "Zhetao Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2304.11954",
    "title": "Spikingformer: Spike-driven Residual Learning for Transformer-based  Spiking Neural Network",
    "abstract": " Comments: 16 pages ",
    "url": "https://arxiv.org/abs/2304.11954",
    "authors": [
      "Chenlin Zhou",
      "Liutao Yu",
      "Zhaokun Zhou",
      "Zhengyu Ma",
      "Han Zhang",
      "Huihui Zhou",
      "Yonghong Tian"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02749",
    "title": "Explainable Reinforcement Learning via a Causal World Model",
    "abstract": " Comments: Accepted by IJCAI 2023 ",
    "url": "https://arxiv.org/abs/2305.02749",
    "authors": [
      "Zhongwei Yu",
      "Jingqing Ruan",
      "Dengpeng Xing"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.03701",
    "title": "LMEye: An Interactive Perception Network for Large Language Models",
    "abstract": " Comments: working in progress ",
    "url": "https://arxiv.org/abs/2305.03701",
    "authors": [
      "Yunxin Li",
      "Baotian Hu",
      "Xinyu Chen",
      "Lin Ma",
      "Min Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.04402",
    "title": "TaLU: A Hybrid Activation Function Combining Tanh and Rectified Linear  Unit to Enhance Neural Networks",
    "abstract": " Title: TaLU: A Hybrid Activation Function Combining Tanh and Rectified Linear  Unit to Enhance Neural Networks ",
    "url": "https://arxiv.org/abs/2305.04402",
    "authors": [
      "Md. Mehedi Hasan",
      "Md. Ali Hossain",
      "Azmain Yakin Srizon",
      "Abu Sayeed"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.05954",
    "title": "Enhancing the Performance of Transformer-based Spiking Neural Networks  by SNN-optimized Downsampling with Precise Gradient Backpropagation",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2305.05954",
    "authors": [
      "Chenlin Zhou",
      "Han Zhang",
      "Zhaokun Zhou",
      "Liutao Yu",
      "Zhengyu Ma",
      "Huihui Zhou",
      "Xiaopeng Fan",
      "Yonghong Tian"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06590",
    "title": "FactKG: Fact Verification via Reasoning on Knowledge Graphs",
    "abstract": " Comments: Accepted to ACL 2023 ",
    "url": "https://arxiv.org/abs/2305.06590",
    "authors": [
      "Jiho Kim",
      "Sungjin Park",
      "Yeonsu Kwon",
      "Yohan Jo",
      "James Thorne",
      "Edward Choi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07889",
    "title": "Neural operator for structural simulation and bridge health monitoring",
    "abstract": " Comments: 20 pages, 10 figures, uses NJDapacite.sty ",
    "url": "https://arxiv.org/abs/2305.07889",
    "authors": [
      "Chawit Kaewnuratchadasorn",
      "Jiaji Wang",
      "Chul-Woo Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07945",
    "title": "Deep Learning-based Data-aided Activity Detection with Extraction  Network in Grant-free Sparse Code Multiple Access Systems",
    "abstract": " Title: Deep Learning-based Data-aided Activity Detection with Extraction  Network in Grant-free Sparse Code Multiple Access Systems ",
    "url": "https://arxiv.org/abs/2305.07945",
    "authors": [
      "Minsig Han",
      "Ameha T. Abebe",
      "Chung G. Kang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.08703",
    "title": "Schema-adaptable Knowledge Graph Construction",
    "abstract": " Comments: Work in progress ",
    "url": "https://arxiv.org/abs/2305.08703",
    "authors": [
      "Hongbin Ye",
      "Honghao Gui",
      "Xin Xu",
      "Huajun Chen",
      "Ningyu Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09846",
    "title": "CPL-NoViD: Context-Aware Prompt-based Learning for Norm Violation  Detection in Online Communities",
    "abstract": " Title: CPL-NoViD: Context-Aware Prompt-based Learning for Norm Violation  Detection in Online Communities ",
    "url": "https://arxiv.org/abs/2305.09846",
    "authors": [
      "Zihao He",
      "Jonathan May",
      "Kristina Lerman"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.10246",
    "title": "Spiking Generative Adversarial Network with Attention Scoring Decoding",
    "abstract": " Title: Spiking Generative Adversarial Network with Attention Scoring Decoding ",
    "url": "https://arxiv.org/abs/2305.10246",
    "authors": [
      "Linghao Feng",
      "Dongcheng Zhao",
      "Yi Zeng"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2305.10625",
    "title": "Measuring and Mitigating Local Instability in Deep Neural Networks",
    "abstract": " Comments: To be published in Findings of the Association for Computational Linguistics (ACL), 2023 ",
    "url": "https://arxiv.org/abs/2305.10625",
    "authors": [
      "Arghya Datta",
      "Subhrangshu Nandi",
      "Jingcheng Xu",
      "Greg Ver Steeg",
      "He Xie",
      "Anoop Kumar",
      "Aram Galstyan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.10631",
    "title": "A Subabdominal MRI Image Segmentation Algorithm Based on Multi-Scale  Feature Pyramid Network and Dual Attention Mechanism",
    "abstract": " Comments: 19 pages,9 figures ",
    "url": "https://arxiv.org/abs/2305.10631",
    "authors": [
      "Yu Xiao",
      "Xin Yang",
      "Sijuan Huang",
      "Yongkai Liu",
      "Shuqin Chen",
      "Lihua Guo"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.10847",
    "title": "Large Language Models can be Guided to Evade AI-Generated Text Detection",
    "abstract": " Title: Large Language Models can be Guided to Evade AI-Generated Text Detection ",
    "url": "https://arxiv.org/abs/2305.10847",
    "authors": [
      "Ning Lu",
      "Shengcai Liu",
      "Rui He",
      "Qi Wang",
      "Ke Tang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.10869",
    "title": "Free Lunch for Privacy Preserving Distributed Graph Learning",
    "abstract": " Title: Free Lunch for Privacy Preserving Distributed Graph Learning ",
    "url": "https://arxiv.org/abs/2305.10869",
    "authors": [
      "Nimesh Agrawal",
      "Nikita Malik",
      "Sandeep Kumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.10927",
    "title": "Causal Document-Grounded Dialogue Pre-training",
    "abstract": " Comments: Work in progress ",
    "url": "https://arxiv.org/abs/2305.10927",
    "authors": [
      "Yingxiu Zhao",
      "Bowen Yu",
      "Haiyang Yu",
      "Bowen Li",
      "Jinyang Li",
      "Chao Wang",
      "Fei Huang",
      "Yongbin Li",
      "Nevin L. Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.10951",
    "title": "Making More of Little Data: Improving Low-Resource Automatic Speech  Recognition Using Data Augmentation",
    "abstract": " Comments: Accepted at ACL 2023 ",
    "url": "https://arxiv.org/abs/2305.10951",
    "authors": [
      "Martijn Bartelds",
      "Nay San",
      "Bradley McDonnell",
      "Dan Jurafsky",
      "Martijn Wieling"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2305.11004",
    "title": "Taxonomy Completion with Probabilistic Scorer via Box Embedding",
    "abstract": " Title: Taxonomy Completion with Probabilistic Scorer via Box Embedding ",
    "url": "https://arxiv.org/abs/2305.11004",
    "authors": [
      "Wei Xue",
      "Yongliang Shen",
      "Wenqi Ren",
      "Jietian Guo",
      "Shiliang Pu",
      "Weiming Lu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.11120",
    "title": "A Compound Gaussian Network for Solving Linear Inverse Problems",
    "abstract": " Comments: 13 pages, 7 figures, 5 tables; references updated ",
    "url": "https://arxiv.org/abs/2305.11120",
    "authors": [
      "Carter Lyons",
      "Raghu G. Raj",
      "Margaret Cheney"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Numerical Analysis (math.NA)"
    ]
  }
]