[
  {
    "id": "arXiv:2106.03853",
    "title": "DisTop: Discovering a Topological representation to learn diverse and  rewarding skills",
    "abstract": "The optimal way for a deep reinforcement learning (DRL) agent to explore is to learn a set of skills that achieves a uniform distribution of states. Following this,we introduce DisTop, a new model that simultaneously learns diverse skills and focuses on improving rewarding skills. DisTop progressively builds a discrete topology of the environment using an unsupervised contrastive loss, a growing network and a goal-conditioned policy. Using this topology, a state-independent hierarchical policy can select where the agent has to keep discovering skills in the state space. In turn, the newly visited states allows an improved learnt representation and the learning loop continues. Our experiments emphasize that DisTop is agnostic to the ground state representation and that the agent can discover the topology of its environment whether the states are high-dimensional binary data, images, or proprioceptive inputs. We demonstrate that this paradigm is competitiveon MuJoCo benchmarks with state-of-the-art algorithms on both single-task dense rewards and diverse skill discovery. By combining these two aspects, we showthat DisTop achieves state-of-the-art performance in comparison with hierarchical reinforcement learning (HRL) when rewards are sparse. We believe DisTop opens new perspectives by showing that bottom-up skill discovery combined with representation learning can unlock the exploration challenge in DRL. ",
    "url": "https://arxiv.org/abs/2106.03853",
    "authors": [
      "Arthur Aubret",
      "Laetitia matignon",
      "Salima Hassas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.03924",
    "title": "News consumption and social media regulations policy",
    "abstract": "Users online tend to consume information adhering to their system of beliefs and to ignore dissenting information. During the COVID-19 pandemic, users get exposed to a massive amount of information about a new topic having a high level of uncertainty. In this paper, we analyze two social media that enforced opposite moderation methods, Twitter and Gab, to assess the interplay between news consumption and content regulation concerning COVID-19. We compare the two platforms on about three million pieces of content analyzing user interaction with respect to news articles. We first describe users' consumption patterns on the two platforms focusing on the political leaning of news outlets. Finally, we characterize the echo chamber effect by modeling the dynamics of users' interaction networks. Our results show that the presence of moderation pursued by Twitter produces a significant reduction of questionable content, with a consequent affiliation towards reliable sources in terms of engagement and comments. Conversely, the lack of clear regulation on Gab results in the tendency of the user to engage with both types of content, showing a slight preference for the questionable ones which may account for a dissing/endorsement behavior. Twitter users show segregation towards reliable content with a uniform narrative. Gab, instead, offers a more heterogeneous structure where users, independently of their leaning, follow people who are slightly polarized towards questionable news. ",
    "url": "https://arxiv.org/abs/2106.03924",
    "authors": [
      "Gabriele Etta",
      "Matteo Cinelli",
      "Alessandro Galeazzi",
      "Carlo Michele Valensise",
      "Mauro Conti",
      "Walter Quattrociocchi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2106.03937",
    "title": "Byakto Speech: Real-time long speech synthesis with convolutional neural  network: Transfer learning from English to Bangla",
    "abstract": "Speech synthesis is one of the challenging tasks to automate by deep learning, also being a low-resource language there are very few attempts at Bangla speech synthesis. Most of the existing works can't work with anything other than simple Bangla characters script, very short sentences, etc. This work attempts to solve these problems by introducing Byakta, the first-ever open-source deep learning-based bilingual (Bangla and English) text to a speech synthesis system. A speech recognition model-based automated scoring metric was also proposed to evaluate the performance of a TTS model. We also introduce a test benchmark dataset for Bangla speech synthesis models for evaluating speech quality. The TTS is available at https://github.com/zabir-nabil/bangla-tts ",
    "url": "https://arxiv.org/abs/2106.03937",
    "authors": [
      "Zabir Al Nazi",
      "Sayed Mohammed Tasmimul Huda"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2106.04009",
    "title": "Rotating spiders and reflecting dogs: a class conditional approach to  learning data augmentation distributions",
    "abstract": "Building invariance to non-meaningful transformations is essential to building efficient and generalizable machine learning models. In practice, the most common way to learn invariance is through data augmentation. There has been recent interest in the development of methods that learn distributions on augmentation transformations from the training data itself. While such approaches are beneficial since they are responsive to the data, they ignore the fact that in many situations the range of transformations to which a model needs to be invariant changes depending on the particular class input belongs to. For example, if a model needs to be able to predict whether an image contains a starfish or a dog, we may want to apply random rotations to starfish images during training (since these do not have a preferred orientation), but we would not want to do this to images of dogs. In this work we introduce a method by which we can learn class conditional distributions on augmentation transformations. We give a number of examples where our methods learn different non-meaningful transformations depending on class and further show how our method can be used as a tool to probe the symmetries intrinsic to a potentially complex dataset. ",
    "url": "https://arxiv.org/abs/2106.04009",
    "authors": [
      "Scott Mahan",
      "Henry Kvinge",
      "Tim Doster"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.04086",
    "title": "Complexity classification of counting graph homomorphisms modulo a prime  number",
    "abstract": "Counting graph homomorphisms and its generalizations such as the Counting Constraint Satisfaction Problem (CSP), its variations, and counting problems in general have been intensively studied since the pioneering work of Valiant. While the complexity of exact counting of graph homomorphisms (Dyer and Greenhill, 2000) and the counting CSP (Bulatov, 2013, and Dyer and Richerby, 2013) is well understood, counting modulo some natural number has attracted considerable interest as well. In their 2015 paper Faben and Jerrum suggested a conjecture stating that counting homomorphisms to a fixed graph H modulo a prime number is hard whenever it is hard to count exactly, unless H has automorphisms of certain kind. In this paper we confirm this conjecture. As a part of this investigation we develop techniques that widen the spectrum of reductions available for modular counting and apply to the general CSP rather than being limited to graph homomorphisms. ",
    "url": "https://arxiv.org/abs/2106.04086",
    "authors": [
      "Andrei A.Bulatov",
      "Amirhossein Kazeminia"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2106.04117",
    "title": "The best of both worlds: stochastic and adversarial episodic MDPs with  unknown transition",
    "abstract": "We consider the best-of-both-worlds problem for learning an episodic Markov Decision Process through $T$ episodes, with the goal of achieving $\\widetilde{\\mathcal{O}}(\\sqrt{T})$ regret when the losses are adversarial and simultaneously $\\mathcal{O}(\\text{polylog}(T))$ regret when the losses are (almost) stochastic. Recent work by [Jin and Luo, 2020] achieves this goal when the fixed transition is known, and leaves the case of unknown transition as a major open question. In this work, we resolve this open problem by using the same Follow-the-Regularized-Leader ($\\text{FTRL}$) framework together with a set of new techniques. Specifically, we first propose a loss-shifting trick in the $\\text{FTRL}$ analysis, which greatly simplifies the approach of [Jin and Luo, 2020] and already improves their results for the known transition case. Then, we extend this idea to the unknown transition case and develop a novel analysis which upper bounds the transition estimation error by (a fraction of) the regret itself in the stochastic setting, a key property to ensure $\\mathcal{O}(\\text{polylog}(T))$ regret. ",
    "url": "https://arxiv.org/abs/2106.04117",
    "authors": [
      "Tiancheng Jin",
      "Longbo Huang",
      "Haipeng Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.04186",
    "title": "What training reveals about neural network complexity",
    "abstract": "This work explores the hypothesis that the complexity of the function a deep neural network (NN) is learning can be deduced by how fast its weights change during training. Our analysis provides evidence for this supposition by relating the network's distribution of Lipschitz constants (i.e., the norm of the gradient at different regions of the input space) during different training intervals with the behavior of the stochastic training procedure. We first observe that the average Lipschitz constant close to the training data affects various aspects of the parameter trajectory, with more complex networks having a longer trajectory, bigger variance, and often veering further from their initialization. We then show that NNs whose biases are trained more steadily have bounded complexity even in regions of the input space that are far from any training point. Finally, we find that steady training with Dropout implies a training- and data-dependent generalization bound that grows poly-logarithmically with the number of parameters. Overall, our results support the hypothesis that good training behavior can be a useful bias towards good generalization. ",
    "url": "https://arxiv.org/abs/2106.04186",
    "authors": [
      "Andreas Loukas",
      "Marinos Poiitis",
      "Stefanie Jegelka"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.04210",
    "title": "Defining definition: a Text mining Approach to Define Innovative  Technological Fields",
    "abstract": "One of the first task of an innovative project is delineating the scope of the project itself or of the product/service to be developed. A wrong scope definition can determine (in the worst case) project failure. A good scope definition become even more relevant in technological intensive innovation projects, nowadays characterized by a highly dynamic multidisciplinary, turbulent and uncertain environment. In these cases, the boundaries of the project are not easily detectable and it is difficult to decide what it is in-scope and out-of-scope. The present work proposes a tool for the scope delineation process, that automatically define an innovative technological field or a new technology. The tool is based on Text Mining algorithm that exploits Elsevier's Scopus abstracts in order to the extract relevant data to define a technological scope. The automatic definition tool is then applied on four case studies: Artificial Intelligence and Data Science. The results show how the tool can provide many crucial information in the definition process of a technological field. In particular for the target technological field (or technology), it provides the definition and other elements related to the target. ",
    "url": "https://arxiv.org/abs/2106.04210",
    "authors": [
      "Vito Giordano",
      "Filippo Chiarello",
      "Elena Cervelli"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.04283",
    "title": "NWT: Towards natural audio-to-video generation with representation  learning",
    "abstract": "In this work we introduce NWT, an expressive speech-to-video model. Unlike approaches that use domain-specific intermediate representations such as pose keypoints, NWT learns its own latent representations, with minimal assumptions about the audio and video content. To this end, we propose a novel discrete variational autoencoder with adversarial loss, dVAE-Adv, which learns a new discrete latent representation we call Memcodes. Memcodes are straightforward to implement, require no additional loss terms, are stable to train compared with other approaches, and show evidence of interpretability. To predict on the Memcode space, we use an autoregressive encoder-decoder model conditioned on audio. Additionally, our model can control latent attributes in the generated video that are not annotated in the data. We train NWT on clips from HBO's Last Week Tonight with John Oliver. NWT consistently scores above other approaches in Mean Opinion Score (MOS) on tests of overall video naturalness, facial naturalness and expressiveness, and lipsync quality. This work sets a strong baseline for generalized audio-to-video synthesis. Samples are available at https://next-week-tonight.github.io/NWT/. ",
    "url": "https://arxiv.org/abs/2106.04283",
    "authors": [
      "Rayhane Mama",
      "Marc S. Tyndel",
      "Hashiam Kadhim",
      "Cole Clifford",
      "Ragavan Thurairatnam"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2106.04351",
    "title": "Si microring resonator crossbar array for on-chip inference and training  of optical neural network",
    "abstract": "Deep learning is one of the most advancing technologies in various fields. Facing the limits of the current electronics platform, optical neural networks (ONNs) based on Si programmable photonic integrated circuits (PICs) have attracted considerable attention as a novel deep learning scheme with optical-domain matrix-vector multiplication (MVM). However, most of the proposed Si programmable PICs for ONNs have several drawbacks such as low scalability, high power consumption, and lack of frameworks for training. To address these issues, we have proposed a microring resonator (MRR) crossbar array as a Si programmable PIC for an ONN. In this article, we present a prototype of a fully integrated 4 ${\\rm \\times}$ 4 MRR crossbar array and demonstrated a simple MVM and classification task. Moreover, we propose on-chip backpropagation using the transpose matrix operation of the MRR crossbar array, enabling the on-chip training of the ONN. The proposed ONN scheme can establish a scalable, power-efficient deep learning accelerator for applications in both inference and training tasks. ",
    "url": "https://arxiv.org/abs/2106.04351",
    "authors": [
      "Shuhei Ohno",
      "Kasidit Toprasertpong",
      "Shinichi Takagi",
      "Mitsuru Takenaka"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2106.04382",
    "title": "Proof methods for robust low-rank matrix recovery",
    "abstract": "Low-rank matrix recovery problems arise naturally as mathematical formulations of various inverse problems, such as matrix completion, blind deconvolution, and phase retrieval. Over the last two decades, a number of works have rigorously analyzed the reconstruction performance for such scenarios, giving rise to a rather general understanding of the potential and the limitations of low-rank matrix models in sensing problems. In this article, we compare the two main proof techniques that have been paving the way to a rigorous analysis, discuss their potential and limitations, and survey their successful applications. On the one hand, we review approaches based on descent cone analysis, showing that they often lead to strong guarantees even in the presence of adversarial noise, but face limitations when it comes to structured observations. On the other hand, we discuss techniques using approximate dual certificates and the golfing scheme, which are often better suited to deal with practical measurement structures, but sometimes lead to weaker guarantees. Lastly, we review recent progress towards analyzing descent cones also for structured scenarios -- exploiting the idea of splitting the cones into multiple parts that are analyzed via different techniques. ",
    "url": "https://arxiv.org/abs/2106.04382",
    "authors": [
      "Tim Fuchs",
      "David Gross",
      "Peter Jung",
      "Felix Krahmer",
      "Richard Kueng",
      "Dominik Stöger"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2106.04398",
    "title": "Learning compositional structures for semantic graph parsing",
    "abstract": "AM dependency parsing is a method for neural semantic graph parsing that exploits the principle of compositionality. While AM dependency parsers have been shown to be fast and accurate across several graphbanks, they require explicit annotations of the compositional tree structures for training. In the past, these were obtained using complex graphbank-specific heuristics written by experts. Here we show how they can instead be trained directly on the graphs with a neural latent-variable model, drastically reducing the amount and complexity of manual heuristics. We demonstrate that our model picks up on several linguistic phenomena on its own and achieves comparable accuracy to supervised training, greatly facilitating the use of AM dependency parsing for new sembanks. ",
    "url": "https://arxiv.org/abs/2106.04398",
    "authors": [
      "Jonas Groschwitz",
      "Meaghan Fowlie",
      "Alexander Koller"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2106.04281",
    "title": "Generative adversarial network with object detector discriminator for  enhanced defect detection on ultrasonic B-scans",
    "abstract": "Non-destructive testing is a set of techniques for defect detection in materials. While the set of imaging techniques are manifold, ultrasonic imaging is the one used the most. The analysis is mainly performed by human inspectors manually analyzing recorded images. The low number of defects in real ultrasonic inspections and legal issues considering data from such inspections make it difficult to obtain proper results from automatic ultrasonic image (B-scan) analysis. In this paper, we present a novel deep learning Generative Adversarial Network model for generating ultrasonic B-scans with defects in distinct locations. Furthermore, we show that generated B-scans can be used for synthetic data augmentation, and can improve the performance of deep convolutional neural object detection networks. Our novel method is demonstrated on a dataset of almost 4000 B-scans with more than 6000 annotated defects. Defect detection performance when training on real data yielded average precision of 71%. By training only on generated data the results increased to 72.1%, and by mixing generated and real data we achieve 75.7% average precision. We believe that synthetic data generation can generalize to other challenges with limited datasets and could be used for training human personnel. ",
    "url": "https://arxiv.org/abs/2106.04281",
    "authors": [
      "Luka Posilović",
      "Duje Medak",
      "Marko Subasic",
      "Marko Budimir",
      "Sven Loncaric"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.04436",
    "title": "Cooperation and competition between pair and multi-player social games  in spatial populations",
    "abstract": "The conflict between individual and collective interests is in the heart of every social dilemmas established by evolutionary game theory. We cannot avoid these conflicts but sometimes we may choose which interaction framework to use as a battlefield. For instance some people like to be part of a larger group while other persons prefer to interact in a more personalized, individual way. Both attitudes can be formulated via appropriately chosen traditional games. In particular, the prisoner's dilemma game is based on pair interaction while the public goods game represents multi-point interactions of group members. To reveal the possible advantage of a certain attitude we extend these models by allowing players not simply to change their strategies but also let them to vary their attitudes for a higher individual income. We show that both attitudes could be the winner at a specific parameter value. Interestingly, however, the subtle interplay between different states may result in a counterintuitive evolutionary outcome where the increase of the multiplication factor of public goods game drives the population to a fully defector state. We point out that the accompanying pattern formation can only be understood via the multipoint or multi-player interactions of different microscopic states where the vicinity of a particular state may influence the relation of two other competitors. ",
    "url": "https://arxiv.org/abs/2106.04436",
    "authors": [
      "Attila Szolnoki",
      "Xiaojie Chen"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Computer Science and Game Theory (cs.GT)",
      "Populations and Evolution (q-bio.PE)"
    ]
  },
  {
    "id": "arXiv:2106.04463",
    "title": "PolypGen: A multi-center polyp detection and segmentation dataset for  generalisability assessment",
    "abstract": "Polyps in the colon are widely known as cancer precursors identified by colonoscopy either related to diagnostic work-up for symptoms, colorectal cancer screening or systematic surveillance of certain diseases. Whilst most polyps are benign, the number, size and the surface structure of the polyp are tightly linked to the risk of colon cancer. There exists a high missed detection rate and incomplete removal of colon polyps due to the variable nature, difficulties to delineate the abnormality, high recurrence rates and the anatomical topography of the colon. In the past, several methods have been built to automate polyp detection and segmentation. However, the key issue of most methods is that they have not been tested rigorously on a large multi-center purpose-built dataset. Thus, these methods may not generalise to different population datasets as they overfit to a specific population and endoscopic surveillance. To this extent, we have curated a dataset from 6 different centers incorporating more than 300 patients. The dataset includes both single frame and sequence data with 3446 annotated polyp labels with precise delineation of polyp boundaries verified by six senior gastroenterologists. To our knowledge, this is the most comprehensive detection and pixel-level segmentation dataset curated by a team of computational scientists and expert gastroenterologists. This dataset has been originated as the part of the Endocv2021 challenge aimed at addressing generalisability in polyp detection and segmentation. In this paper, we provide comprehensive insight into data construction and annotation strategies, annotation quality assurance and technical validation for our extended EndoCV2021 dataset which we refer to as PolypGen. ",
    "url": "https://arxiv.org/abs/2106.04463",
    "authors": [
      "Sharib Ali",
      "Debesh Jha",
      "Noha Ghatwary",
      "Stefano Realdon",
      "Renato Cannizzaro",
      "Osama E. Salem",
      "Dominique Lamarque",
      "Christian Daul",
      "Kim V. Anonsen",
      "Michael A. Riegler",
      "Pål Halvorsen",
      "Jens Rittscher",
      "Thomas de Lange",
      "James E. East"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.04510",
    "title": "Random Forest classifier for EEG-based seizure prediction",
    "abstract": "Epileptic seizure prediction has gained considerable interest in the computational Epilepsy research community. This paper presents a Machine Learning based method for epileptic seizure prediction which outperforms state-of-the art methods. We compute a probability for a given epoch, of being pre-ictal against interictal using the Random Forest classifier and introduce new concepts to enhance the robustness of the algorithm to false alarms. We assessed our method on 20 patients of the benchmark scalp EEG CHB-MIT dataset for a seizure prediction horizon (SPH) of 5 minutes and a seizure occurrence period (SOP) of 30 minutes. Our approach achieves a sensitivity of 82.07 % and a low false positive rate (FPR) of 0.0799 /h. We also tested our approach on intracranial EEG recordings. ",
    "url": "https://arxiv.org/abs/2106.04510",
    "authors": [
      "Remy Ben Messaoud",
      "Mario Chavez"
    ],
    "subjectives": [
      "Medical Physics (physics.med-ph)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:1908.06656",
    "title": "On the edge-biclique graph and the iterated edge-biclique operator",
    "abstract": " Title: On the edge-biclique graph and the iterated edge-biclique operator ",
    "url": "https://arxiv.org/abs/1908.06656",
    "authors": [
      "Leandro Montero",
      "Sylvain Legay"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2010.04227",
    "title": "A low discrepancy sequence on graphs",
    "abstract": " Comments: Accepted for publication in Journal of Fourier Analysis and Applications ",
    "url": "https://arxiv.org/abs/2010.04227",
    "authors": [
      "A. Cloninger",
      "H. N. Mhaskar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2011.06806",
    "title": "On the stability properties of Gated Recurrent Units neural networks",
    "abstract": " Comments: Preprint submitted to the Elsevier Systems & Control Letters. Copyright may be transferred without notice ",
    "url": "https://arxiv.org/abs/2011.06806",
    "authors": [
      "Fabio Bonassi",
      "Marcello Farina",
      "Riccardo Scattolini"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2011.08225",
    "title": "Automatic selection of clustering algorithms using supervised graph  embedding",
    "abstract": " Title: Automatic selection of clustering algorithms using supervised graph  embedding ",
    "url": "https://arxiv.org/abs/2011.08225",
    "authors": [
      "Noy Cohen-Shapira",
      "Lior Rokach"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2012.12218",
    "title": "BKT-LSTM: Efficient Student Modeling for knowledge tracing and student  performance prediction",
    "abstract": " Title: BKT-LSTM: Efficient Student Modeling for knowledge tracing and student  performance prediction ",
    "url": "https://arxiv.org/abs/2012.12218",
    "authors": [
      "Sein Minn"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2102.00760",
    "title": "Fast rates in structured prediction",
    "abstract": " Comments: 14 main pages, 3 main figures, 43 pages, 4 figures (with appendix) ",
    "url": "https://arxiv.org/abs/2102.00760",
    "authors": [
      "Vivien Cabannes",
      "Alessandro Rudi",
      "Francis Bach"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2104.14007",
    "title": "Interaction-GCN: A Graph Convolutional Network based framework for  social interaction recognition in egocentric videos",
    "abstract": " Comments: Accepted to ICIP 2021 ",
    "url": "https://arxiv.org/abs/2104.14007",
    "authors": [
      "Simone Felicioni",
      "Mariella Dimiccoli"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.12980",
    "title": "Investigating label suggestions for opinion mining in German Covid-19  social media",
    "abstract": " Comments: To Appear at ACL 2021 ",
    "url": "https://arxiv.org/abs/2105.12980",
    "authors": [
      "Tilman Beck",
      "Ji-Ung Lee",
      "Christina Viehmann",
      "Marcus Maurer",
      "Oliver Quiring",
      "Iryna Gurevych"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2106.03502",
    "title": "Efficient training for future video generation based on hierarchical  disentangled representation of latent variables",
    "abstract": " Title: Efficient training for future video generation based on hierarchical  disentangled representation of latent variables ",
    "url": "https://arxiv.org/abs/2106.03502",
    "authors": [
      "Naoya Fushishita",
      "Antonio Tejero-de-Pablos",
      "Yusuke Mukuta",
      "Tatsuya Harada"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]