[
  {
    "id": "arXiv:2403.03962",
    "title": "Identify Critical Nodes in Complex Network with Large Language Models",
    "abstract": "Identifying critical nodes in networks is a classical decision-making task, and many methods struggle to strike a balance between adaptability and utility. Therefore, we propose an approach that empowers Evolutionary Algorithm (EA) with Large Language Models (LLMs), to generate a function called \"score\\_nodes\" which can further be used to identify crucial nodes based on their assigned scores. Our model consists of three main components: Manual Initialization, Population Management, and LLMs-based Evolution. It evolves from initial populations with a set of designed node scoring functions created manually. LLMs leverage their strong contextual understanding and rich programming skills to perform crossover and mutation operations on the individuals, generating excellent new functions. These functions are then categorized, ranked, and eliminated to ensure the stable development of the populations while preserving diversity. Extensive experiments demonstrate the excellent performance of our method, showcasing its strong generalization ability compared to other state-of-the-art algorithms. It can consistently and orderly generate diverse and efficient node scoring functions. All source codes and models that can reproduce all results in this work are publicly available at this link: \\url{https://anonymous.4open.science/r/LLM4CN-6520} ",
    "url": "https://arxiv.org/abs/2403.03962",
    "authors": [
      "Jinzhu Mao",
      "Dongyun Zou",
      "Li Sheng",
      "Siyi Liu",
      "Chen Gao",
      "Yue Wang",
      "Yong Li"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2403.03967",
    "title": "Effect of Ambient-Intrinsic Dimension Gap on Adversarial Vulnerability",
    "abstract": "The existence of adversarial attacks on machine learning models imperceptible to a human is still quite a mystery from a theoretical perspective. In this work, we introduce two notions of adversarial attacks: natural or on-manifold attacks, which are perceptible by a human/oracle, and unnatural or off-manifold attacks, which are not. We argue that the existence of the off-manifold attacks is a natural consequence of the dimension gap between the intrinsic and ambient dimensions of the data. For 2-layer ReLU networks, we prove that even though the dimension gap does not affect generalization performance on samples drawn from the observed data space, it makes the clean-trained model more vulnerable to adversarial perturbations in the off-manifold direction of the data space. Our main results provide an explicit relationship between the $\\ell_2,\\ell_{\\infty}$ attack strength of the on/off-manifold attack and the dimension gap. ",
    "url": "https://arxiv.org/abs/2403.03967",
    "authors": [
      "Rajdeep Haldar",
      "Yue Xing",
      "Qifan Song"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.03994",
    "title": "Video Relationship Detection Using Mixture of Experts",
    "abstract": "Machine comprehension of visual information from images and videos by neural networks faces two primary challenges. Firstly, there exists a computational and inference gap in connecting vision and language, making it difficult to accurately determine which object a given agent acts on and represent it through language. Secondly, classifiers trained by a single, monolithic neural network often lack stability and generalization. To overcome these challenges, we introduce MoE-VRD, a novel approach to visual relationship detection utilizing a mixture of experts. MoE-VRD identifies language triplets in the form of < subject, predicate, object> tuples to extract relationships from visual processing. Leveraging recent advancements in visual relationship detection, MoE-VRD addresses the requirement for action recognition in establishing relationships between subjects (acting) and objects (being acted upon). In contrast to single monolithic networks, MoE-VRD employs multiple small models as experts, whose outputs are aggregated. Each expert in MoE-VRD specializes in visual relationship learning and object tagging. By utilizing a sparsely-gated mixture of experts, MoE-VRD enables conditional computation and significantly enhances neural network capacity without increasing computational complexity. Our experimental results demonstrate that the conditional computation capabilities and scalability of the mixture-of-experts approach lead to superior performance in visual relationship detection compared to state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2403.03994",
    "authors": [
      "Ala Shaabana",
      "Zahra Gharaee",
      "Paul Fieguth"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04001",
    "title": "Bidirectional Progressive Neural Networks with Episodic Return Progress  for Emergent Task Sequencing and Robotic Skill Transfer",
    "abstract": "Human brain and behavior provide a rich venue that can inspire novel control and learning methods for robotics. In an attempt to exemplify such a development by inspiring how humans acquire knowledge and transfer skills among tasks, we introduce a novel multi-task reinforcement learning framework named Episodic Return Progress with Bidirectional Progressive Neural Networks (ERP-BPNN). The proposed ERP-BPNN model (1) learns in a human-like interleaved manner by (2) autonomous task switching based on a novel intrinsic motivation signal and, in contrast to existing methods, (3) allows bidirectional skill transfer among tasks. ERP-BPNN is a general architecture applicable to several multi-task learning settings; in this paper, we present the details of its neural architecture and show its ability to enable effective learning and skill transfer among morphologically different robots in a reaching task. The developed Bidirectional Progressive Neural Network (BPNN) architecture enables bidirectional skill transfer without requiring incremental training and seamlessly integrates with online task arbitration. The task arbitration mechanism developed is based on soft Episodic Return progress (ERP), a novel intrinsic motivation (IM) signal. To evaluate our method, we use quantifiable robotics metrics such as 'expected distance to goal' and 'path straightness' in addition to the usual reward-based measure of episodic return common in reinforcement learning. With simulation experiments, we show that ERP-BPNN achieves faster cumulative convergence and improves performance in all metrics considered among morphologically different robots compared to the baselines. ",
    "url": "https://arxiv.org/abs/2403.04001",
    "authors": [
      "Suzan Ece Ada",
      "Hanne Say",
      "Emre Ugur",
      "Erhan Oztop"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04009",
    "title": "Media Bias Matters: Understanding the Impact of Politically Biased News  on Vaccine Attitudes in Social Media",
    "abstract": "News media has been utilized as a political tool to stray from facts, presenting biased claims without evidence. Amid the COVID-19 pandemic, politically biased news (PBN) has significantly undermined public trust in vaccines, despite strong medical evidence supporting their efficacy. In this paper, we analyze: (i) how inherent vaccine stances subtly influence individuals' selection of news sources and participation in social media discussions; and (ii) the impact of exposure to PBN on users' attitudes toward vaccines. In doing so, we first curate a comprehensive dataset that connects PBN with related social media discourse. Utilizing advanced deep learning and causal inference techniques, we reveal distinct user behaviors between social media groups with various vaccine stances. Moreover, we observe that individuals with moderate stances, particularly the vaccine-hesitant majority, are more vulnerable to the influence of PBN compared to those with extreme views. Our findings provide critical insights to foster this line of research. ",
    "url": "https://arxiv.org/abs/2403.04009",
    "authors": [
      "Bohan Jiang",
      "Lu Cheng",
      "Zhen Tan",
      "Ruocheng Guo",
      "Huan Liu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2403.04010",
    "title": "Three Revisits to Node-Level Graph Anomaly Detection: Outliers, Message  Passing and Hyperbolic Neural Networks",
    "abstract": "Graph anomaly detection plays a vital role for identifying abnormal instances in complex networks. Despite advancements of methodology based on deep learning in recent years, existing benchmarking approaches exhibit limitations that hinder a comprehensive comparison. In this paper, we revisit datasets and approaches for unsupervised node-level graph anomaly detection tasks from three aspects. Firstly, we introduce outlier injection methods that create more diverse and graph-based anomalies in graph datasets. Secondly, we compare methods employing message passing against those without, uncovering the unexpected decline in performance associated with message passing. Thirdly, we explore the use of hyperbolic neural networks, specifying crucial architecture and loss design that contribute to enhanced performance. Through rigorous experiments and evaluations, our study sheds light on general strategies for improving node-level graph anomaly detection methods. ",
    "url": "https://arxiv.org/abs/2403.04010",
    "authors": [
      "Jing Gu",
      "Dongmian Zou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04012",
    "title": "Temporal Cross-Attention for Dynamic Embedding and Tokenization of  Multimodal Electronic Health Records",
    "abstract": "The breadth, scale, and temporal granularity of modern electronic health records (EHR) systems offers great potential for estimating personalized and contextual patient health trajectories using sequential deep learning. However, learning useful representations of EHR data is challenging due to its high dimensionality, sparsity, multimodality, irregular and variable-specific recording frequency, and timestamp duplication when multiple measurements are recorded simultaneously. Although recent efforts to fuse structured EHR and unstructured clinical notes suggest the potential for more accurate prediction of clinical outcomes, less focus has been placed on EHR embedding approaches that directly address temporal EHR challenges by learning time-aware representations from multimodal patient time series. In this paper, we introduce a dynamic embedding and tokenization framework for precise representation of multimodal clinical time series that combines novel methods for encoding time and sequential position with temporal cross-attention. Our embedding and tokenization framework, when integrated into a multitask transformer classifier with sliding window attention, outperformed baseline approaches on the exemplar task of predicting the occurrence of nine postoperative complications of more than 120,000 major inpatient surgeries using multimodal data from three hospitals and two academic health centers in the United States. ",
    "url": "https://arxiv.org/abs/2403.04012",
    "authors": [
      "Yingbo Ma",
      "Suraj Kolla",
      "Dhruv Kaliraman",
      "Victoria Nolan",
      "Zhenhong Hu",
      "Ziyuan Guan",
      "Yuanfang Ren",
      "Brooke Armfield",
      "Tezcan Ozrazgat-Baslanti",
      "Tyler J. Loftus",
      "Parisa Rashidi",
      "Azra Bihorac",
      "Benjamin Shickel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04013",
    "title": "Whodunit: Classifying Code as Human Authored or GPT-4 Generated -- A  case study on CodeChef problems",
    "abstract": "Artificial intelligence (AI) assistants such as GitHub Copilot and ChatGPT, built on large language models like GPT-4, are revolutionizing how programming tasks are performed, raising questions about whether code is authored by generative AI models. Such questions are of particular interest to educators, who worry that these tools enable a new form of academic dishonesty, in which students submit AI generated code as their own work. Our research explores the viability of using code stylometry and machine learning to distinguish between GPT-4 generated and human-authored code. Our dataset comprises human-authored solutions from CodeChef and AI-authored solutions generated by GPT-4. Our classifier outperforms baselines, with an F1-score and AUC-ROC score of 0.91. A variant of our classifier that excludes gameable features (e.g., empty lines, whitespace) still performs well with an F1-score and AUC-ROC score of 0.89. We also evaluated our classifier with respect to the difficulty of the programming problem and found that there was almost no difference between easier and intermediate problems, and the classifier performed only slightly worse on harder problems. Our study shows that code stylometry is a promising approach for distinguishing between GPT-4 generated code and human-authored code. ",
    "url": "https://arxiv.org/abs/2403.04013",
    "authors": [
      "Oseremen Joy Idialu",
      "Noble Saji Mathews",
      "Rungroj Maipradit",
      "Joanne M. Atlee",
      "Mei Nagappan"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.04028",
    "title": "RISnet: A Domain-Knowledge Driven Neural Network Architecture for RIS  Optimization with Mutual Coupling and Partial CSI",
    "abstract": "Multiple access techniques are cornerstones of wireless communications. Their performance depends on the channel properties, which can be improved by reconfigurable intelligent surfaces (RISs). In this work, we jointly optimize MA precoding at the base station (BS) and RIS configuration. We tackle difficulties of mutual coupling between RIS elements, scalability to more than 1000 RIS elements, and channel estimation. We first derive an RIS-assisted channel model considering mutual coupling, then propose an unsupervised machine learning (ML) approach to optimize the RIS. In particular, we design a dedicated neural network (NN) architecture RISnet with good scalability and desired symmetry. Moreover, we combine ML-enabled RIS configuration and analytical precoding at BS since there exist analytical precoding schemes. Furthermore, we propose another variant of RISnet, which requires the channel state information (CSI) of a small portion of RIS elements (in this work, 16 out of 1296 elements) if the channel comprises a few specular propagation paths. More generally, this work is an early contribution to combine ML technique and domain knowledge in communication for NN architecture design. Compared to generic ML, the problem-specific ML can achieve higher performance, lower complexity and symmetry. ",
    "url": "https://arxiv.org/abs/2403.04028",
    "authors": [
      "Bile Peng",
      "Karl-Ludwig Besser",
      "Shanpu Shen",
      "Finn Siegismund-Poschmann",
      "Ramprasad Raghunath",
      "Daniel Mittleman",
      "Vahid Jamali",
      "Eduard A. Jorswieck"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.04036",
    "title": "Unsupervised Contrastive Learning for Robust RF Device Fingerprinting  Under Time-Domain Shift",
    "abstract": "Radio Frequency (RF) device fingerprinting has been recognized as a potential technology for enabling automated wireless device identification and classification. However, it faces a key challenge due to the domain shift that could arise from variations in the channel conditions and environmental settings, potentially degrading the accuracy of RF-based device classification when testing and training data is collected in different domains. This paper introduces a novel solution that leverages contrastive learning to mitigate this domain shift problem. Contrastive learning, a state-of-the-art self-supervised learning approach from deep learning, learns a distance metric such that positive pairs are closer (i.e. more similar) in the learned metric space than negative pairs. When applied to RF fingerprinting, our model treats RF signals from the same transmission as positive pairs and those from different transmissions as negative pairs. Through experiments on wireless and wired RF datasets collected over several days, we demonstrate that our contrastive learning approach captures domain-invariant features, diminishing the effects of domain-specific variations. Our results show large and consistent improvements in accuracy (10.8\\% to 27.8\\%) over baseline models, thus underscoring the effectiveness of contrastive learning in improving device classification under domain shift. ",
    "url": "https://arxiv.org/abs/2403.04036",
    "authors": [
      "Jun Chen",
      "Weng-Keen Wong",
      "Bechir Hamdaoui"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.04050",
    "title": "Belief-Enriched Pessimistic Q-Learning against Adversarial State  Perturbations",
    "abstract": "Reinforcement learning (RL) has achieved phenomenal success in various domains. However, its data-driven nature also introduces new vulnerabilities that can be exploited by malicious opponents. Recent work shows that a well-trained RL agent can be easily manipulated by strategically perturbing its state observations at the test stage. Existing solutions either introduce a regularization term to improve the smoothness of the trained policy against perturbations or alternatively train the agent's policy and the attacker's policy. However, the former does not provide sufficient protection against strong attacks, while the latter is computationally prohibitive for large environments. In this work, we propose a new robust RL algorithm for deriving a pessimistic policy to safeguard against an agent's uncertainty about true states. This approach is further enhanced with belief state inference and diffusion-based state purification to reduce uncertainty. Empirical results show that our approach obtains superb performance under strong attacks and has a comparable training overhead with regularization-based methods. Our code is available at https://github.com/SliencerX/Belief-enriched-robust-Q-learning. ",
    "url": "https://arxiv.org/abs/2403.04050",
    "authors": [
      "Xiaolin Sun",
      "Zizhan Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04066",
    "title": "LoDisc: Learning Global-Local Discriminative Features for  Self-Supervised Fine-Grained Visual Recognition",
    "abstract": "Self-supervised contrastive learning strategy has attracted remarkable attention due to its exceptional ability in representation learning. However, current contrastive learning tends to learn global coarse-grained representations of the image that benefit generic object recognition, whereas such coarse-grained features are insufficient for fine-grained visual recognition. In this paper, we present to incorporate the subtle local fine-grained feature learning into global self-supervised contrastive learning through a pure self-supervised global-local fine-grained contrastive learning framework. Specifically, a novel pretext task called Local Discrimination (LoDisc) is proposed to explicitly supervise self-supervised model's focus towards local pivotal regions which are captured by a simple-but-effective location-wise mask sampling strategy. We show that Local Discrimination pretext task can effectively enhance fine-grained clues in important local regions, and the global-local framework further refines the fine-grained feature representations of images. Extensive experimental results on different fine-grained object recognition tasks demonstrate that the proposed method can lead to a decent improvement in different evaluation settings. Meanwhile, the proposed method is also effective in general object recognition tasks. ",
    "url": "https://arxiv.org/abs/2403.04066",
    "authors": [
      "Jialu Shi",
      "Zhiqiang Wei",
      "Jie Nie",
      "Lei Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04067",
    "title": "Feel the Bite: Robot-Assisted Inside-Mouth Bite Transfer using Robust  Mouth Perception and Physical Interaction-Aware Control",
    "abstract": "Robot-assisted feeding can greatly enhance the lives of those with mobility limitations. Modern feeding systems can pick up and position food in front of a care recipient's mouth for a bite. However, many with severe mobility constraints cannot lean forward and need direct inside-mouth food placement. This demands precision, especially for those with restricted mouth openings, and appropriately reacting to various physical interactions - incidental contacts as the utensil moves inside, impulsive contacts due to sudden muscle spasms, deliberate tongue maneuvers by the person being fed to guide the utensil, and intentional bites. In this paper, we propose an inside-mouth bite transfer system that addresses these challenges with two key components: a multi-view mouth perception pipeline robust to tool occlusion, and a control mechanism that employs multimodal time-series classification to discern and react to different physical interactions. We demonstrate the efficacy of these individual components through two ablation studies. In a full system evaluation, our system successfully fed 13 care recipients with diverse mobility challenges. Participants consistently emphasized the comfort and safety of our inside-mouth bite transfer system, and gave it high technology acceptance ratings - underscoring its transformative potential in real-world scenarios. Supplementary materials and videos can be found at this http URL . ",
    "url": "https://arxiv.org/abs/2403.04067",
    "authors": [
      "Rajat Kumar Jenamani",
      "Daniel Stabile",
      "Ziang Liu",
      "Abrar Anwar",
      "Katherine Dimitropoulou",
      "Tapomayukh Bhattacharjee"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.04070",
    "title": "Improving Adversarial Training using Vulnerability-Aware Perturbation  Budget",
    "abstract": "Adversarial Training (AT) effectively improves the robustness of Deep Neural Networks (DNNs) to adversarial attacks. Generally, AT involves training DNN models with adversarial examples obtained within a pre-defined, fixed perturbation bound. Notably, individual natural examples from which these adversarial examples are crafted exhibit varying degrees of intrinsic vulnerabilities, and as such, crafting adversarial examples with fixed perturbation radius for all instances may not sufficiently unleash the potency of AT. Motivated by this observation, we propose two simple, computationally cheap vulnerability-aware reweighting functions for assigning perturbation bounds to adversarial examples used for AT, named Margin-Weighted Perturbation Budget (MWPB) and Standard-Deviation-Weighted Perturbation Budget (SDWPB). The proposed methods assign perturbation radii to individual adversarial samples based on the vulnerability of their corresponding natural examples. Experimental results show that the proposed methods yield genuine improvements in the robustness of AT algorithms against various adversarial attacks. ",
    "url": "https://arxiv.org/abs/2403.04070",
    "authors": [
      "Olukorede Fakorede",
      "Modeste Atsague",
      "Jin Tian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04071",
    "title": "On-device Self-supervised Learning of Visual Perception Tasks aboard  Hardware-limited Nano-quadrotors",
    "abstract": "Sub-\\SI{50}{\\gram} nano-drones are gaining momentum in both academia and industry. Their most compelling applications rely on onboard deep learning models for perception despite severe hardware constraints (\\ie sub-\\SI{100}{\\milli\\watt} processor). When deployed in unknown environments not represented in the training data, these models often underperform due to domain shift. To cope with this fundamental problem, we propose, for the first time, on-device learning aboard nano-drones, where the first part of the in-field mission is dedicated to self-supervised fine-tuning of a pre-trained convolutional neural network (CNN). Leveraging a real-world vision-based regression task, we thoroughly explore performance-cost trade-offs of the fine-tuning phase along three axes: \\textit{i}) dataset size (more data increases the regression performance but requires more memory and longer computation); \\textit{ii}) methodologies (\\eg fine-tuning all model parameters vs. only a subset); and \\textit{iii}) self-supervision strategy. Our approach demonstrates an improvement in mean absolute error up to 30\\% compared to the pre-trained baseline, requiring only \\SI{22}{\\second} fine-tuning on an ultra-low-power GWT GAP9 System-on-Chip. Addressing the domain shift problem via on-device learning aboard nano-drones not only marks a novel result for hardware-limited robots but lays the ground for more general advancements for the entire robotics community. ",
    "url": "https://arxiv.org/abs/2403.04071",
    "authors": [
      "Elia Cereda",
      "Manuele Rusci",
      "Alessandro Giusti",
      "Daniele Palossi"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04086",
    "title": "Automated Multi-Task Learning for Joint Disease Prediction on Electronic  Health Records",
    "abstract": "In the realm of big data and digital healthcare, Electronic Health Records (EHR) have become a rich source of information with the potential to improve patient care and medical research. In recent years, machine learning models have proliferated for analyzing EHR data to predict patients future health conditions. Among them, some studies advocate for multi-task learning (MTL) to jointly predict multiple target diseases for improving the prediction performance over single task learning. Nevertheless, current MTL frameworks for EHR data have significant limitations due to their heavy reliance on human experts to identify task groups for joint training and design model architectures. To reduce human intervention and improve the framework design, we propose an automated approach named AutoDP, which can search for the optimal configuration of task grouping and architectures simultaneously. To tackle the vast joint search space encompassing task combinations and architectures, we employ surrogate model-based optimization, enabling us to efficiently discover the optimal solution. Experimental results on real-world EHR data demonstrate the efficacy of the proposed AutoDP framework. It achieves significant performance improvements over both hand-crafted and automated state-of-the-art methods, also maintains a feasible search cost at the same time. ",
    "url": "https://arxiv.org/abs/2403.04086",
    "authors": [
      "Suhan Cui",
      "Prasenjit Mitra"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04109",
    "title": "Using Causal Trees to Estimate Personalized Task Difficulty in  Post-Stroke Individuals",
    "abstract": "Adaptive training programs are crucial for recovery post stroke. However, developing programs that automatically adapt depends on quantifying how difficult a task is for a specific individual at a particular stage of their recovery. In this work, we propose a method that automatically generates regions of different task difficulty levels based on an individual's performance. We show that this technique explains the variance in user performance for a reaching task better than previous approaches to estimating task difficulty. ",
    "url": "https://arxiv.org/abs/2403.04109",
    "authors": [
      "Nathaniel Dennler",
      "Stefanos Nikolaidis",
      "Maja Matarić"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04113",
    "title": "ZTRAN: Prototyping Zero Trust Security xApps for Open Radio Access  Network Deployments",
    "abstract": "The open radio access network (O-RAN) offers new degrees of freedom for building and operating advanced cellular networks. Emphasizing on RAN disaggregation, open interfaces, multi-vendor support, and RAN intelligent controllers (RICs), O-RAN facilitates adaptation to new applications and technology trends. Yet, this architecture introduces new security challenges. This paper proposes leveraging zero trust principles for O-RAN security. We introduce zero trust RAN (ZTRAN), which embeds service authentication, intrusion detection, and secure slicing subsystems that are encapsulated as xApps. We implement ZTRAN on the open artificial intelligence cellular (OAIC) research platform and demonstrate its feasibility and effectiveness in terms of legitimate user throughput and latency figures. Our experimental analysis illustrates how ZTRAN's intrusion detection and secure slicing microservices operate effectively and in concert as part of O-RAN Alliance's containerized near-real time RIC. Research directions include exploring machine learning and additional threat intelligence feeds for improving the performance and extending the scope of ZTRAN. ",
    "url": "https://arxiv.org/abs/2403.04113",
    "authors": [
      "Aly S. Abdalla",
      "Joshua Moore",
      "Nisha Adhikari",
      "Vuk Marojevic"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Emerging Technologies (cs.ET)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.04118",
    "title": "Globally Stable Neural Imitation Policies",
    "abstract": "Imitation learning presents an effective approach to alleviate the resource-intensive and time-consuming nature of policy learning from scratch in the solution space. Even though the resulting policy can mimic expert demonstrations reliably, it often lacks predictability in unexplored regions of the state-space, giving rise to significant safety concerns in the face of perturbations. To address these challenges, we introduce the Stable Neural Dynamical System (SNDS), an imitation learning regime which produces a policy with formal stability guarantees. We deploy a neural policy architecture that facilitates the representation of stability based on Lyapunov theorem, and jointly train the policy and its corresponding Lyapunov candidate to ensure global stability. We validate our approach by conducting extensive experiments in simulation and successfully deploying the trained policies on a real-world manipulator arm. The experimental results demonstrate that our method overcomes the instability, accuracy, and computational intensity problems associated with previous imitation learning methods, making our method a promising solution for stable policy learning in complex planning scenarios. ",
    "url": "https://arxiv.org/abs/2403.04118",
    "authors": [
      "Amin Abyaneh",
      "Mariana Sosa Guzmán",
      "Hsiu-Chin Lin"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04120",
    "title": "A data-centric approach to class-specific bias in image data  augmentation",
    "abstract": "Data augmentation (DA) enhances model generalization in computer vision but may introduce biases, impacting class accuracy unevenly. Our study extends this inquiry, examining DA's class-specific bias across various datasets, including those distinct from ImageNet, through random cropping. We evaluated this phenomenon with ResNet50, EfficientNetV2S, and SWIN ViT, discovering that while residual models showed similar bias effects, Vision Transformers exhibited greater robustness or altered dynamics. This suggests a nuanced approach to model selection, emphasizing bias mitigation. We also refined a \"data augmentation robustness scouting\" method to manage DA-induced biases more efficiently, reducing computational demands significantly (training 112 models instead of 1860; a reduction of factor 16.2) while still capturing essential bias trends. ",
    "url": "https://arxiv.org/abs/2403.04120",
    "authors": [
      "Athanasios Angelakis",
      "Andrey Rass"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04125",
    "title": "Scalable and Robust Transformer Decoders for Interpretable Image  Classification with Foundation Models",
    "abstract": "Interpretable computer vision models can produce transparent predictions, where the features of an image are compared with prototypes from a training dataset and the similarity between them forms a basis for classification. Nevertheless these methods are computationally expensive to train, introduce additional complexity and may require domain knowledge to adapt hyper-parameters to a new dataset. Inspired by developments in object detection, segmentation and large-scale self-supervised foundation vision models, we introduce Component Features (ComFe), a novel explainable-by-design image classification approach using a transformer-decoder head and hierarchical mixture-modelling. With only global image labels and no segmentation or part annotations, ComFe can identify consistent image components, such as the head, body, wings and tail of a bird, and the image background, and determine which of these features are informative in making a prediction. We demonstrate that ComFe obtains higher accuracy compared to previous interpretable models across a range of fine-grained vision benchmarks, without the need to individually tune hyper-parameters for each dataset. We also show that ComFe outperforms a non-interpretable linear head across a range of datasets, including ImageNet, and improves performance on generalisation and robustness benchmarks. ",
    "url": "https://arxiv.org/abs/2403.04125",
    "authors": [
      "Evelyn Mannix",
      "Howard Bondell"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04135",
    "title": "Unsupervised Learning of Harmonic Analysis Based on Neural HSMM with  Code Quality Templates",
    "abstract": "This paper presents a method of unsupervised learning of harmonic analysis based on a hidden semi-Markov model (HSMM). We introduce the chord quality templates, which specify the probability of pitch class emissions given a root note and a chord quality. Other probability distributions that comprise the HSMM are automatically learned via unsupervised learning, which has been a challenge in existing research. The results of the harmonic analysis of the proposed model were evaluated using existing labeled data. While our proposed method has yet to perform as well as existing models that used supervised learning and complex rule design, it has the advantage of not requiring expensive labeled data or rule elaboration. Furthermore, we also show how to recognize the tonic without prior knowledge, based on the transition probabilities of the Markov model. ",
    "url": "https://arxiv.org/abs/2403.04135",
    "authors": [
      "Yui Uehara"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04145",
    "title": "A Crosstalk-Aware Timing Prediction Method in Routing",
    "abstract": "With shrinking interconnect spacing in advanced technology nodes, existing timing predictions become less precise due to the challenging quantification of crosstalk-induced delay. During the routing, the crosstalk effect is typically modeled by predicting coupling capacitance with congestion information. However, the timing estimation tends to be overly pessimistic, as the crosstalk-induced delay depends not only on the coupling capacitance but also on the signal arrival time. This work presents a crosstalk-aware timing estimation method using a two-step machine learning approach. Interconnects that are physically adjacent and overlap in signal timing windows are filtered first. Crosstalk delay is predicted by integrating physical topology and timing features without relying on post-routing results and the parasitic extraction. Experimental results show a match rate of over 99% for identifying crosstalk nets compared to the commercial tool on the OpenCores benchmarks, with prediction results being more accurate than those of other state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2403.04145",
    "authors": [
      "Leilei Jin",
      "Jiajie Xu",
      "Wenjie Fu",
      "Hao Yan",
      "Longxing Shi"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.04146",
    "title": "FL-GUARD: A Holistic Framework for Run-Time Detection and Recovery of  Negative Federated Learning",
    "abstract": "Federated learning (FL) is a promising approach for learning a model from data distributed on massive clients without exposing data privacy. It works effectively in the ideal federation where clients share homogeneous data distribution and learning behavior. However, FL may fail to function appropriately when the federation is not ideal, amid an unhealthy state called Negative Federated Learning (NFL), in which most clients gain no benefit from participating in FL. Many studies have tried to address NFL. However, their solutions either (1) predetermine to prevent NFL in the entire learning life-cycle or (2) tackle NFL in the aftermath of numerous learning rounds. Thus, they either (1) indiscriminately incur extra costs even if FL can perform well without such costs or (2) waste numerous learning rounds. Additionally, none of the previous work takes into account the clients who may be unwilling/unable to follow the proposed NFL solutions when using those solutions to upgrade an FL system in use. This paper introduces FL-GUARD, a holistic framework that can be employed on any FL system for tackling NFL in a run-time paradigm. That is, to dynamically detect NFL at the early stage (tens of rounds) of learning and then to activate recovery measures when necessary. Specifically, we devise a cost-effective NFL detection mechanism, which relies on an estimation of performance gain on clients. Only when NFL is detected, we activate the NFL recovery process, in which each client learns in parallel an adapted model when training the global model. Extensive experiment results confirm the effectiveness of FL-GUARD in detecting NFL and recovering from NFL to a healthy learning state. We also show that FL-GUARD is compatible with previous NFL solutions and robust against clients unwilling/unable to take any recovery measures. ",
    "url": "https://arxiv.org/abs/2403.04146",
    "authors": [
      "Hong Lin",
      "Lidan Shou",
      "Ke Chen",
      "Gang Chen",
      "Sai Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2403.04151",
    "title": "Dual-path Frequency Discriminators for Few-shot Anomaly Detection",
    "abstract": "Few-shot anomaly detection (FSAD) is essential in industrial manufacturing. However, existing FSAD methods struggle to effectively leverage a limited number of normal samples, and they may fail to detect and locate inconspicuous anomalies in the spatial domain. We further discover that these subtle anomalies would be more noticeable in the frequency domain. In this paper, we propose a Dual-Path Frequency Discriminators (DFD) network from a frequency perspective to tackle these issues. Specifically, we generate anomalies at both image-level and feature-level. Differential frequency components are extracted by the multi-frequency information construction module and supplied into the fine-grained feature construction module to provide adapted features. We consider anomaly detection as a discriminative classification problem, wherefore the dual-path feature discrimination module is employed to detect and locate the image-level and feature-level anomalies in the feature space. The discriminators aim to learn a joint representation of anomalous features and normal features in the latent space. Extensive experiments conducted on MVTec AD and VisA benchmarks demonstrate that our DFD surpasses current state-of-the-art methods. Source code will be available. ",
    "url": "https://arxiv.org/abs/2403.04151",
    "authors": [
      "Yuhu Bai",
      "Jiangning Zhang",
      "Yuhang Dong",
      "Guanzhong Tian",
      "Yunkang Cao",
      "Yabiao Wang",
      "Chengjie Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04153",
    "title": "Designing Social Robots that Engage Older Adults in Exercise: A Case  Study",
    "abstract": "We present and evaluate a prototype social robot to encourage daily exercise among older adults in a home setting. Our prototype system, designed to lead users through exercise sessions with motivational feedback, was assessed through a case study with a 78-year-old participant for one week. Our case study highlighted preferences for greater user control over exercise choices and questioned the necessity of precise motion tracking. Feedback also indicated a desire for more varied exercises and suggested improvements in user engagement techniques. The insights suggest that further research is needed to enhance system adaptability and effectiveness to better promote daily exercise. Future efforts will aim to refine the prototype based on participant feedback and extend the evaluation to broader in-home deployments. ",
    "url": "https://arxiv.org/abs/2403.04153",
    "authors": [
      "Victor Nikhil Antony",
      "Chien-Ming Huang"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.04158",
    "title": "DA-Net: A Disentangled and Adaptive Network for Multi-Source  Cross-Lingual Transfer Learning",
    "abstract": "Multi-Source cross-lingual transfer learning deals with the transfer of task knowledge from multiple labelled source languages to an unlabeled target language under the language shift. Existing methods typically focus on weighting the predictions produced by language-specific classifiers of different sources that follow a shared encoder. However, all source languages share the same encoder, which is updated by all these languages. The extracted representations inevitably contain different source languages' information, which may disturb the learning of the language-specific classifiers. Additionally, due to the language gap, language-specific classifiers trained with source labels are unable to make accurate predictions for the target language. Both facts impair the model's performance. To address these challenges, we propose a Disentangled and Adaptive Network (DA-Net). Firstly, we devise a feedback-guided collaborative disentanglement method that seeks to purify input representations of classifiers, thereby mitigating mutual interference from multiple sources. Secondly, we propose a class-aware parallel adaptation method that aligns class-level distributions for each source-target language pair, thereby alleviating the language pairs' language gap. Experimental results on three different tasks involving 38 languages validate the effectiveness of our approach. ",
    "url": "https://arxiv.org/abs/2403.04158",
    "authors": [
      "Ling Ge",
      "Chunming Hu",
      "Guanghui Ma",
      "Jihong Liu",
      "Hong Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04162",
    "title": "Noisy Spiking Actor Network for Exploration",
    "abstract": "As a general method for exploration in deep reinforcement learning (RL), NoisyNet can produce problem-specific exploration strategies. Spiking neural networks (SNNs), due to their binary firing mechanism, have strong robustness to noise, making it difficult to realize efficient exploration with local disturbances. To solve this exploration problem, we propose a noisy spiking actor network (NoisySAN) that introduces time-correlated noise during charging and transmission. Moreover, a noise reduction method is proposed to find a stable policy for the agent. Extensive experimental results demonstrate that our method outperforms the state-of-the-art performance on a wide range of continuous control tasks from OpenAI gym. ",
    "url": "https://arxiv.org/abs/2403.04162",
    "authors": [
      "Ding Chen",
      "Peixi Peng",
      "Tiejun Huang",
      "Yonghong Tian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2403.04165",
    "title": "Super-resolution on network telemetry time series",
    "abstract": "Fine-grained monitoring is crucial for multiple data-driven tasks such as debugging, provisioning, and securing networks. Yet, practical constraints in collecting, extracting, and storing data often force operators to use coarse-grained sampled monitoring, degrading the performance of the various tasks. In this work, we explore the feasibility of leveraging the correlations among coarse-grained time series to impute their fine-grained counterparts in software. We present Zoom2Net, a transformer-based model for network imputation that incorporates domain knowledge through operational and measurement constraints, ensuring that the imputed network telemetry time series are not only realistic but also align with existing measurements and are plausible. This approach enhances the capabilities of current monitoring infrastructures, allowing operators to gain more insights into system behaviors without the need for hardware upgrades. We evaluate Zoom2Net on four diverse datasets (e.g. cloud telemetry and Internet data transfer) and use cases (such as bursts analysis and traffic classification). We demonstrate that Zoom2Net consistently achieves high imputation accuracy with a zoom-in factor of up to 100 and performs better on downstream tasks compared to baselines by an average of 38%. ",
    "url": "https://arxiv.org/abs/2403.04165",
    "authors": [
      "Fengchen Gong",
      "Divya Raghunathan",
      "Aarti Gupta",
      "Maria Apostolaki"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2403.04169",
    "title": "Social Robots for Sleep Health: A Scoping Review",
    "abstract": "Poor sleep health is an increasingly concerning public healthcare crisis, especially when coupled with a dwindling number of health professionals qualified to combat it. However, there is a growing body of scientific literature on the use of digital technologies in supporting and sustaining individuals' healthy sleep habits. Social robots are a relatively recent technology that has been used to facilitate health care interventions and may have potential in improving sleep health outcomes, as well. Social robots' unique characteristics -- such as anthropomorphic physical embodiment or effective communication methods -- help to engage users and motivate them to comply with specific interventions, thus improving the interventions' outcomes. This scoping review aims to evaluate current scientific evidence for employing social robots in sleep health interventions, identify critical research gaps, and suggest future directions for developing and using social robots to improve people's sleep health. Our analysis of the reviewed studies found them limited due to a singular focus on the older adult population, use of small sample sizes, limited intervention durations, and other compounding factors. Nevertheless, the reviewed studies reported several positive outcomes, highlighting the potential social robots hold in this field. Although our review found limited clinical evidence for the efficacy of social robots as purveyors of sleep health interventions, it did elucidate the potential for a successful future in this domain if current limitations are addressed and more research is conducted. ",
    "url": "https://arxiv.org/abs/2403.04169",
    "authors": [
      "Victor Nikhil Antony",
      "Mengchi Li",
      "Shu-Han Lin",
      "Junxin Li",
      "Chein-Ming Huang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2403.04179",
    "title": "Mining Transactional Data To Produce Extended Association Rules Using  Collaborative Apriori, Fsa-Red And M5p Predictive Algorithm As A Basis Of  Business Actions",
    "abstract": "There are large amounts of transactional data which showed consumer shopping cart at a store that sells more than 150 types of products. In this case, the company is utilizing these data in making business action. In previous studies, the data that has a lot of attributes and record data reduction algorithms handled by the FSA Red (Feature Selection for Association Rules)are then mined using Apriori algorithm. The resulting association rules have high levels of accuracy and excellent test results, which rely more than 90%. In this study, the association rules generated in previous research will be updated by using prediction algorithms M5P, so that the association rules can be used within a period of several months in the future. Furthermore, some data mining technique such as: clustering and time series pattern will be implemented to examine the truth and extend the validity of association rules which were built. It can be concluded that the association rules were established after will generate strong association rules with confidence equal or higher than 70% and the rules established truth can be seen from the time series pattern on each group of goods which are then used as the basis of business actions. ",
    "url": "https://arxiv.org/abs/2403.04179",
    "authors": [
      "Feri Sulianta",
      "Laksana Eka Angga",
      "Thee Houw Liong"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2403.04189",
    "title": "Silicon Photonic 2.5D Interposer Networks for Overcoming Communication  Bottlenecks in Scale-out Machine Learning Hardware Accelerators",
    "abstract": "Modern machine learning (ML) applications are becoming increasingly complex and monolithic (single chip) accelerator architectures cannot keep up with their energy efficiency and throughput demands. Even though modern digital electronic accelerators are gradually adopting 2.5D architectures with multiple smaller chiplets to improve scalability, they face fundamental limitations due to a reliance on slow metallic interconnects. This paper outlines how optical communication and computation can be leveraged in 2.5D platforms to realize energy-efficient and high throughput 2.5D ML accelerator architectures. ",
    "url": "https://arxiv.org/abs/2403.04189",
    "authors": [
      "Febin Sunny",
      "Ebadollah Taheri",
      "Mahdi Nikdast",
      "Sudeep Pasricha"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.04193",
    "title": "VAEMax: Open-Set Intrusion Detection based on OpenMax and Variational  Autoencoder",
    "abstract": "Promptly discovering unknown network attacks is critical for reducing the risk of major loss imposed on system or equipment. This paper aims to develop an open-set intrusion detection model to classify known attacks as well as inferring unknown ones. To achieve this, we employ OpenMax and variational autoencoder to propose a dual detection model, VAEMax. First, we extract flow payload feature based on one-dimensional convolutional neural network. Then, the OpenMax is used to classify flows, during which some unknown attacks can be detected, while the rest are misclassified into a certain class of known flows. Finally, use VAE to perform secondary detection on each class of flows, and determine whether the flow is an unknown attack based on the reconstruction loss. Experiments performed on dataset CIC-IDS2017 and CSE-CIC-IDS2018 show our approach is better than baseline models and can be effectively applied to realistic network environments. ",
    "url": "https://arxiv.org/abs/2403.04193",
    "authors": [
      "Zhiyin Qiu",
      "Ding Zhou",
      "Yahui Zhai",
      "Bo Liu",
      "Lei He",
      "Jiuxin Cao"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.04198",
    "title": "CN-RMA: Combined Network with Ray Marching Aggregation for 3D Indoors  Object Detection from Multi-view Images",
    "abstract": "This paper introduces CN-RMA, a novel approach for 3D indoor object detection from multi-view images. We observe the key challenge as the ambiguity of image and 3D correspondence without explicit geometry to provide occlusion information. To address this issue, CN-RMA leverages the synergy of 3D reconstruction networks and 3D object detection networks, where the reconstruction network provides a rough Truncated Signed Distance Function (TSDF) and guides image features to vote to 3D space correctly in an end-to-end manner. Specifically, we associate weights to sampled points of each ray through ray marching, representing the contribution of a pixel in an image to corresponding 3D locations. Such weights are determined by the predicted signed distances so that image features vote only to regions near the reconstructed surface. Our method achieves state-of-the-art performance in 3D object detection from multi-view images, as measured by mAP@0.25 and mAP@0.5 on the ScanNet and ARKitScenes datasets. The code and models are released at https://github.com/SerCharles/CN-RMA. ",
    "url": "https://arxiv.org/abs/2403.04198",
    "authors": [
      "Guanlin Shen",
      "Jingwei Huang",
      "Zhihua Hu",
      "Bin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04202",
    "title": "Dynamics of Moral Behavior in Heterogeneous Populations of Learning  Agents",
    "abstract": "Growing concerns about safety and alignment of AI systems highlight the importance of embedding moral capabilities in artificial agents. A promising solution is the use of learning from experience, i.e., Reinforcement Learning. In multi-agent (social) environments, complex population-level phenomena may emerge from interactions between individual learning agents. Many of the existing studies rely on simulated social dilemma environments to study the interactions of independent learning agents. However, they tend to ignore the moral heterogeneity that is likely to be present in societies of agents in practice. For example, at different points in time a single learning agent may face opponents who are consequentialist (i.e., caring about maximizing some outcome over time) or norm-based (i.e., focusing on conforming to a specific norm here and now). The extent to which agents' co-development may be impacted by such moral heterogeneity in populations is not well understood. In this paper, we present a study of the learning dynamics of morally heterogeneous populations interacting in a social dilemma setting. Using a Prisoner's Dilemma environment with a partner selection mechanism, we investigate the extent to which the prevalence of diverse moral agents in populations affects individual agents' learning behaviors and emergent population-level outcomes. We observe several types of non-trivial interactions between pro-social and anti-social agents, and find that certain classes of moral agents are able to steer selfish agents towards more cooperative behavior. ",
    "url": "https://arxiv.org/abs/2403.04202",
    "authors": [
      "Elizaveta Tennant",
      "Stephen Hailes",
      "Mirco Musolesi"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04221",
    "title": "Why Online Reinforcement Learning is Causal",
    "abstract": "Reinforcement learning (RL) and causal modelling naturally complement each other. The goal of causal modelling is to predict the effects of interventions in an environment, while the goal of reinforcement learning is to select interventions that maximize the rewards the agent receives from the environment. Reinforcement learning includes the two most powerful sources of information for estimating causal relationships: temporal ordering and the ability to act on an environment. This paper examines which reinforcement learning settings we can expect to benefit from causal modelling, and how. In online learning, the agent has the ability to interact directly with their environment, and learn from exploring it. Our main argument is that in online learning, conditional probabilities are causal, and therefore offline RL is the setting where causal learning has the most potential to make a difference. Essentially, the reason is that when an agent learns from their {\\em own} experience, there are no unobserved confounders that influence both the agent's own exploratory actions and the rewards they receive. Our paper formalizes this argument. For offline RL, where an agent may and typically does learn from the experience of {\\em others}, we describe previous and new methods for leveraging a causal model, including support for counterfactual queries. ",
    "url": "https://arxiv.org/abs/2403.04221",
    "authors": [
      "Oliver Schulte",
      "Pascal Poupart"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04228",
    "title": "Single-Image HDR Reconstruction Assisted Ghost Suppression and Detail  Preservation Network for Multi-Exposure HDR Imaging",
    "abstract": "The reconstruction of high dynamic range (HDR) images from multi-exposure low dynamic range (LDR) images in dynamic scenes presents significant challenges, especially in preserving and restoring information in oversaturated regions and avoiding ghosting artifacts. While current methods often struggle to address these challenges, our work aims to bridge this gap by developing a multi-exposure HDR image reconstruction network for dynamic scenes, complemented by single-frame HDR image reconstruction. This network, comprising single-frame HDR reconstruction with enhanced stop image (SHDR-ESI) and SHDR-ESI-assisted multi-exposure HDR reconstruction (SHDRA-MHDR), effectively leverages the ghost-free characteristic of single-frame HDR reconstruction and the detail-enhancing capability of ESI in oversaturated areas. Specifically, SHDR-ESI innovatively integrates single-frame HDR reconstruction with the utilization of ESI. This integration not only optimizes the single image HDR reconstruction process but also effectively guides the synthesis of multi-exposure HDR images in SHDR-AMHDR. In this method, the single-frame HDR reconstruction is specifically applied to reduce potential ghosting effects in multiexposure HDR synthesis, while the use of ESI images assists in enhancing the detail information in the HDR synthesis process. Technically, SHDR-ESI incorporates a detail enhancement mechanism, which includes a self-representation module and a mutual-representation module, designed to aggregate crucial information from both reference image and ESI. To fully leverage the complementary information from non-reference images, a feature interaction fusion module is integrated within SHDRA-MHDR. Additionally, a ghost suppression module, guided by the ghost-free results of SHDR-ESI, is employed to suppress the ghosting artifacts. ",
    "url": "https://arxiv.org/abs/2403.04228",
    "authors": [
      "Huafeng Li",
      "Zhenmei Yang",
      "Yafei Zhang",
      "Dapeng Tao",
      "Zhengtao Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2403.04245",
    "title": "A Study of Dropout-Induced Modality Bias on Robustness to Missing Video  Frames for Audio-Visual Speech Recognition",
    "abstract": "Advanced Audio-Visual Speech Recognition (AVSR) systems have been observed to be sensitive to missing video frames, performing even worse than single-modality models. While applying the dropout technique to the video modality enhances robustness to missing frames, it simultaneously results in a performance loss when dealing with complete data input. In this paper, we investigate this contrasting phenomenon from the perspective of modality bias and reveal that an excessive modality bias on the audio caused by dropout is the underlying reason. Moreover, we present the Modality Bias Hypothesis (MBH) to systematically describe the relationship between modality bias and robustness against missing modality in multimodal systems. Building on these findings, we propose a novel Multimodal Distribution Approximation with Knowledge Distillation (MDA-KD) framework to reduce over-reliance on the audio modality and to maintain performance and robustness simultaneously. Finally, to address an entirely missing modality, we adopt adapters to dynamically switch decision strategies. The effectiveness of our proposed approach is evaluated and validated through a series of comprehensive experiments using the MISP2021 and MISP2022 datasets. Our code is available at https://github.com/dalision/ModalBiasAVSR ",
    "url": "https://arxiv.org/abs/2403.04245",
    "authors": [
      "Yusheng Dai",
      "Hang Chen",
      "Jun Du",
      "Ruoyu Wang",
      "Shihao Chen",
      "Jiefeng Ma",
      "Haotian Wang",
      "Chin-Hui Lee"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2403.04257",
    "title": "Towards Robustness Analysis of E-Commerce Ranking System",
    "abstract": "Information retrieval (IR) is a pivotal component in various applications. Recent advances in machine learning (ML) have enabled the integration of ML algorithms into IR, particularly in ranking systems. While there is a plethora of research on the robustness of ML-based ranking systems, these studies largely neglect commercial e-commerce systems and fail to establish a connection between real-world and manipulated query relevance. In this paper, we present the first systematic measurement study on the robustness of e-commerce ranking systems. We define robustness as the consistency of ranking outcomes for semantically identical queries. To quantitatively analyze robustness, we propose a novel metric that considers both ranking position and item-specific information that are absent in existing metrics. Our large-scale measurement study with real-world data from e-commerce retailers reveals an open opportunity to measure and improve robustness since semantically identical queries often yield inconsistent ranking results. Based on our observations, we propose several solution directions to enhance robustness, such as the use of Large Language Models. Note that the issue of robustness discussed herein does not constitute an error or oversight. Rather, in scenarios where there exists a vast array of choices, it is feasible to present a multitude of products in various permutations, all of which could be equally appealing. However, this extensive selection may lead to customer confusion. As e-commerce retailers use various techniques to improve the quality of search results, we hope that this research offers valuable guidance for measuring the robustness of the ranking systems. ",
    "url": "https://arxiv.org/abs/2403.04257",
    "authors": [
      "Ningfei Wang",
      "Yupin Huang",
      "Han Cheng",
      "Jiri Gesi",
      "Xiaojie Wang",
      "Vivek Mittal"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2403.04261",
    "title": "Advancing Biomedical Text Mining with Community Challenges",
    "abstract": "The field of biomedical research has witnessed a significant increase in the accumulation of vast amounts of textual data from various sources such as scientific literatures, electronic health records, clinical trial reports, and social media. However, manually processing and analyzing these extensive and complex resources is time-consuming and inefficient. To address this challenge, biomedical text mining, also known as biomedical natural language processing, has garnered great attention. Community challenge evaluation competitions have played an important role in promoting technology innovation and interdisciplinary collaboration in biomedical text mining research. These challenges provide platforms for researchers to develop state-of-the-art solutions for data mining and information processing in biomedical research. In this article, we review the recent advances in community challenges specific to Chinese biomedical text mining. Firstly, we collect the information of these evaluation tasks, such as data sources and task types. Secondly, we conduct systematic summary and comparative analysis, including named entity recognition, entity normalization, attribute extraction, relation extraction, event extraction, text classification, text similarity, knowledge graph construction, question answering, text generation, and large language model evaluation. Then, we summarize the potential clinical applications of these community challenge tasks from translational informatics perspective. Finally, we discuss the contributions and limitations of these community challenges, while highlighting future directions in the era of large language models. ",
    "url": "https://arxiv.org/abs/2403.04261",
    "authors": [
      "Hui Zong",
      "Rongrong Wu",
      "Jiaxue Cha",
      "Erman Wu",
      "Jiakun Li",
      "Liang Tao",
      "Zuofeng Li",
      "Buzhou Tang",
      "Bairong Shen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.04282",
    "title": "Improving link prediction accuracy of network embedding algorithms via  rich node attribute information",
    "abstract": "Complex networks are widely used to represent an abundance of real-world relations ranging from social networks to brain networks. Inferring missing links or predicting future ones based on the currently observed network is known as the link prediction task.Recent network embedding based link prediction algorithms have demonstrated ground-breaking performance on link prediction accuracy. Those algorithms usually apply node attributes as the initial feature input to accelerate the convergence speed during the training process. However, they do not take full advantage of node feature information. In this paper,besides applying feature attributes as the initial input, we make better utilization of node attribute information by building attributable networks and plugging attributable networks into some typical link prediction algorithms and naming this algorithm Attributive Graph Enhanced Embedding (AGEE). AGEE is able to automatically learn the weighting trades-off between the structure and the attributive networks. Numerical experiments show that AGEE can improve the link prediction accuracy by around 3% compared with link prediction framework SEAL, Variational Graph AutoEncoder (VGAE), and Node2vec. ",
    "url": "https://arxiv.org/abs/2403.04282",
    "authors": [
      "Weiwei Gu",
      "Jinqiang Hou",
      "Weiyi Gu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.04287",
    "title": "DGR: A General Graph Desmoothing Framework for Recommendation via Global  and Local Perspectives",
    "abstract": "Graph Convolutional Networks (GCNs) have become pivotal in recommendation systems for learning user and item embeddings by leveraging the user-item interaction graph's node information and topology. However, these models often face the famous over-smoothing issue, leading to indistinct user and item embeddings and reduced personalization. Traditional desmoothing methods in GCN-based systems are model-specific, lacking a universal solution. This paper introduces a novel, model-agnostic approach named \\textbf{D}esmoothing Framework for \\textbf{G}CN-based \\textbf{R}ecommendation Systems (\\textbf{DGR}). It effectively addresses over-smoothing on general GCN-based recommendation models by considering both global and local perspectives. Specifically, we first introduce vector perturbations during each message passing layer to penalize the tendency of node embeddings approximating overly to be similar with the guidance of the global topological structure. Meanwhile, we further develop a tailored-design loss term for the readout embeddings to preserve the local collaborative relations between users and their neighboring items. In particular, items that exhibit a high correlation with neighboring items are also incorporated to enhance the local topological information. To validate our approach, we conduct extensive experiments on 5 benchmark datasets based on 5 well-known GCN-based recommendation models, demonstrating the effectiveness and generalization of our proposed framework. ",
    "url": "https://arxiv.org/abs/2403.04287",
    "authors": [
      "Leilei Ding",
      "Dazhong Shen",
      "Chao Wang",
      "Tianfu Wang",
      "Le Zhang",
      "Hui Xiong",
      "Yanyong Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2403.04293",
    "title": "MKF-ADS: A Multi-Knowledge Fused Anomaly Detection System for Automotive",
    "abstract": "With the requirements of Intelligent Transport Systems (ITSs) for extensive connectivity of Electronic Control Units (ECUs) to the outside world, safety and security have become stringent problems. Intrusion detection systems (IDSs) are a crucial safety component in remediating Controller Area Network (CAN) bus vulnerabilities. However, supervised-based IDSs fail to identify complexity attacks and anomaly-based IDSs have higher false alarms owing to capability bottleneck. In this paper, we propose a novel multi-knowledge fused anomaly detection model, called MKF-IDS. Specifically, the method designs an integration framework, including spatial-temporal correlation with an attention mechanism (STcAM) module and patch sparse-transformer module (PatchST). The STcAM with fine-pruning uses one-dimensional convolution (Conv1D) to extract spatial features and subsequently utilizes the Bidirectional Long Short Term Memory (Bi-LSTM) to extract the temporal features, where the attention mechanism will focus on the important time steps. Meanwhile, the PatchST captures the combined long-time historical features from independent univariate time series. Finally, the proposed method is based on knowledge distillation to STcAM as a student model for learning intrinsic knowledge and cross the ability to mimic PatchST. In the detection phase, the MKF-ADS only deploys STcAM to maintain efficiency in a resource-limited IVN environment. Moreover, the redundant noisy signal is reduced with bit flip rate and boundary decision estimation. We conduct extensive experiments on six simulation attack scenarios across various CAN IDs and time steps, and two real attack scenarios, which present a competitive prediction and detection performance. Compared with the baseline in the same paradigm, the error rate and FAR are 2.62% and 2.41% and achieve a promising F1-score of 97.3%. ",
    "url": "https://arxiv.org/abs/2403.04293",
    "authors": [
      "Pengzhou Cheng",
      "Zongru Wu",
      "Gongshen Liu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.04298",
    "title": "Understanding how social discussion platforms like Reddit are  influencing financial behavior",
    "abstract": "This study proposes content and interaction analysis techniques for a large repository created from social media content. Though we have presented our study for a large platform dedicated to discussions around financial topics, the proposed methods are generic and applicable to all platforms. Along with an extension of topic extraction method using Latent Dirichlet Allocation, we propose a few measures to assess user participation, influence and topic affinities specifically. Our study also maps user-generated content to components of behavioral finance. While these types of information are usually gathered through surveys, it is obvious that large scale data analysis from social media can reveal many potentially unknown or rare insights. Characterising users based on their platform behavior to provide critical insights about how communities are formed and trust is established in these platforms using graphical analysis is also studied. ",
    "url": "https://arxiv.org/abs/2403.04298",
    "authors": [
      "Sachin Thukral",
      "Suyash Sangwan",
      "Arnab Chatterjee",
      "Lipika Dey",
      "Aaditya Agrawal",
      "Pramit Kumar Chandra",
      "Animesh Mukherjee"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.04303",
    "title": "LORS: Low-rank Residual Structure for Parameter-Efficient Network  Stacking",
    "abstract": "Deep learning models, particularly those based on transformers, often employ numerous stacked structures, which possess identical architectures and perform similar functions. While effective, this stacking paradigm leads to a substantial increase in the number of parameters, posing challenges for practical applications. In today's landscape of increasingly large models, stacking depth can even reach dozens, further exacerbating this issue. To mitigate this problem, we introduce LORS (LOw-rank Residual Structure). LORS allows stacked modules to share the majority of parameters, requiring a much smaller number of unique ones per module to match or even surpass the performance of using entirely distinct ones, thereby significantly reducing parameter usage. We validate our method by applying it to the stacked decoders of a query-based object detector, and conduct extensive experiments on the widely used MS COCO dataset. Experimental results demonstrate the effectiveness of our method, as even with a 70\\% reduction in the parameters of the decoder, our method still enables the model to achieve comparable or ",
    "url": "https://arxiv.org/abs/2403.04303",
    "authors": [
      "Jialin Li",
      "Qiang Nie",
      "Weifu Fu",
      "Yuhuan Lin",
      "Guangpin Tao",
      "Yong Liu",
      "Chengjie Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04309",
    "title": "AO-DETR: Anti-Overlapping DETR for X-Ray Prohibited Items Detection",
    "abstract": "Prohibited item detection in X-ray images is one of the most essential and highly effective methods widely employed in various security inspection scenarios. Considering the significant overlapping phenomenon in X-ray prohibited item images, we propose an Anti-Overlapping DETR (AO-DETR) based on one of the state-of-the-art general object detectors, DINO. Specifically, to address the feature coupling issue caused by overlapping phenomena, we introduce the Category-Specific One-to-One Assignment (CSA) strategy to constrain category-specific object queries in predicting prohibited items of fixed categories, which can enhance their ability to extract features specific to prohibited items of a particular category from the overlapping foreground-background features. To address the edge blurring problem caused by overlapping phenomena, we propose the Look Forward Densely (LFD) scheme, which improves the localization accuracy of reference boxes in mid-to-high-level decoder layers and enhances the ability to locate blurry edges of the final layer. Similar to DINO, our AO-DETR provides two different versions with distinct backbones, tailored to meet diverse application requirements. Extensive experiments on the PIXray and OPIXray datasets demonstrate that the proposed method surpasses the state-of-the-art object detectors, indicating its potential applications in the field of prohibited item detection. The source code will be released at https://github.com/Limingyuan001/AO-DETR-test. ",
    "url": "https://arxiv.org/abs/2403.04309",
    "authors": [
      "Mingyuan Li",
      "Tong Jia",
      "Hao Wang",
      "Bowen Ma",
      "Shuyang Lin",
      "Da Cai",
      "Dongyue Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04311",
    "title": "ALTO: An Efficient Network Orchestrator for Compound AI Systems",
    "abstract": "We present ALTO, a network orchestrator for efficiently serving compound AI systems such as pipelines of language models. ALTO achieves high throughput and low latency by taking advantage of an optimization opportunity specific to generative language models: streaming intermediate outputs. As language models produce outputs token by token, ALTO exposes opportunities to stream intermediate outputs between stages when possible. We highlight two new challenges of correctness and load balancing which emerge when streaming intermediate data across distributed pipeline stage instances. We also motivate the need for an aggregation-aware routing interface and distributed prompt-aware scheduling to address these challenges. We demonstrate the impact of ALTO's partial output streaming on a complex chatbot verification pipeline, increasing throughput by up to 3x for a fixed latency target of 4 seconds / request while also reducing tail latency by 1.8x compared to a baseline serving approach. ",
    "url": "https://arxiv.org/abs/2403.04311",
    "authors": [
      "Keshav Santhanam",
      "Deepti Raghavan",
      "Muhammad Shahir Rahman",
      "Thejas Venkatesh",
      "Neha Kunjal",
      "Pratiksha Thaker",
      "Philip Levis",
      "Matei Zaharia"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2403.04313",
    "title": "A robust shifted proper orthogonal decomposition: Proximal methods for  decomposing flows with multiple transports",
    "abstract": "We present a new methodology for decomposing flows with multiple transports that further extends the shifted proper orthogonal decomposition (sPOD). The sPOD tries to approximate transport-dominated flows by a sum of co-moving data fields. The proposed methods stem from sPOD but optimize the co-moving fields directly and penalize their nuclear norm to promote low rank of the individual data in the decomposition. Furthermore, we add a robustness term to the decomposition that can deal with interpolation error and data noises. Leveraging tools from convex optimization, we derive three proximal algorithms to solve the decomposition problem. We report a numerical comparison with existing methods against synthetic data benchmarks and then show the separation ability of our methods on 1D and 2D incompressible and reactive flows. The resulting methodology is the basis of a new analysis paradigm that results in the same interpretability as the POD for the individual co-moving fields. ",
    "url": "https://arxiv.org/abs/2403.04313",
    "authors": [
      "Philipp Krah",
      "Arthur Marmin",
      "Beata Zorawski",
      "Julius Reiss",
      "Kai Schneider"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2403.04331",
    "title": "Control-Barrier-Aided Teleoperation with Visual-Inertial SLAM for Safe  MAV Navigation in Complex Environments",
    "abstract": "In this paper, we consider a Micro Aerial Vehicle (MAV) system teleoperated by a non-expert and introduce a perceptive safety filter that leverages Control Barrier Functions (CBFs) in conjunction with Visual-Inertial Simultaneous Localization and Mapping (VI-SLAM) and dense 3D occupancy mapping to guarantee safe navigation in complex and unstructured environments. Our system relies solely on onboard IMU measurements, stereo infrared images, and depth images and autonomously corrects teleoperated inputs when they are deemed unsafe. We define a point in 3D space as unsafe if it satisfies either of two conditions: (i) it is occupied by an obstacle, or (ii) it remains unmapped. At each time step, an occupancy map of the environment is updated by the VI-SLAM by fusing the onboard measurements, and a CBF is constructed to parameterize the (un)safe region in the 3D space. Given the CBF and state feedback from the VI-SLAM module, a safety filter computes a certified reference that best matches the teleoperation input while satisfying the safety constraint encoded by the CBF. In contrast to existing perception-based safe control frameworks, we directly close the perception-action loop and demonstrate the full capability of safe control in combination with real-time VI-SLAM without any external infrastructure or prior knowledge of the environment. We verify the efficacy of the perceptive safety filter in real-time MAV experiments using exclusively onboard sensing and computation and show that the teleoperated MAV is able to safely navigate through unknown environments despite arbitrary inputs sent by the teleoperator. ",
    "url": "https://arxiv.org/abs/2403.04331",
    "authors": [
      "Siqi Zhou",
      "Sotiris Papatheodorou",
      "Stefan Leutenegger",
      "Angela P. Schoellig"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.04337",
    "title": "Explainable AI for Embedded Systems Design: A Case Study of Static  Redundant NVM Memory Write Prediction",
    "abstract": "This paper investigates the application of eXplainable Artificial Intelligence (XAI) in the design of embedded systems using machine learning (ML). As a case study, it addresses the challenging problem of static silent store prediction. This involves identifying redundant memory writes based only on static program features. Eliminating such stores enhances performance and energy efficiency by reducing memory access and bus traffic, especially in the presence of emerging non-volatile memory technologies. To achieve this, we propose a methodology consisting of: 1) the development of relevant ML models for explaining silent store prediction, and 2) the application of XAI to explain these models. We employ two state-of-the-art model-agnostic XAI methods to analyze the causes of silent stores. Through the case study, we evaluate the effectiveness of the methods. We find that these methods provide explanations for silent store predictions, which are consistent with known causes of silent store occurrences from previous studies. Typically, this allows us to confirm the prevalence of silent stores in operations that write the zero constant into memory, or the absence of silent stores in operations involving loop induction variables. This suggests the potential relevance of XAI in analyzing ML models' decision in embedded system design. From the case study, we share some valuable insights and pitfalls we encountered. More generally, this study aims to lay the groundwork for future research in the emerging field of XAI for embedded system design. ",
    "url": "https://arxiv.org/abs/2403.04337",
    "authors": [
      "Abdoulaye Gamatié",
      "Yuyang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.04369",
    "title": "From Graph to Word Bag: Introducing Domain Knowledge to Confusing Charge  Prediction",
    "abstract": "Confusing charge prediction is a challenging task in legal AI, which involves predicting confusing charges based on fact descriptions. While existing charge prediction methods have shown impressive performance, they face significant challenges when dealing with confusing charges, such as Snatch and Robbery. In the legal domain, constituent elements play a pivotal role in distinguishing confusing charges. Constituent elements are fundamental behaviors underlying criminal punishment and have subtle distinctions among charges. In this paper, we introduce a novel From Graph to Word Bag (FWGB) approach, which introduces domain knowledge regarding constituent elements to guide the model in making judgments on confusing charges, much like a judge's reasoning process. Specifically, we first construct a legal knowledge graph containing constituent elements to help select keywords for each charge, forming a word bag. Subsequently, to guide the model's attention towards the differentiating information for each charge within the context, we expand the attention mechanism and introduce a new loss function with attention supervision through words in the word bag. We construct the confusing charges dataset from real-world judicial documents. Experiments demonstrate the effectiveness of our method, especially in maintaining exceptional performance in imbalanced label distributions. ",
    "url": "https://arxiv.org/abs/2403.04369",
    "authors": [
      "Ang Li",
      "Qiangchao Chen",
      "Yiquan Wu",
      "Ming Cai",
      "Xiang Zhou",
      "Fei Wu",
      "Kun Kuang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.04380",
    "title": "Video-Driven Animation of Neural Head Avatars",
    "abstract": "We present a new approach for video-driven animation of high-quality neural 3D head models, addressing the challenge of person-independent animation from video input. Typically, high-quality generative models are learned for specific individuals from multi-view video footage, resulting in person-specific latent representations that drive the generation process. In order to achieve person-independent animation from video input, we introduce an LSTM-based animation network capable of translating person-independent expression features into personalized animation parameters of person-specific 3D head models. Our approach combines the advantages of personalized head models (high quality and realism) with the convenience of video-driven animation employing multi-person facial performance capture. We demonstrate the effectiveness of our approach on synthesized animations with high quality based on different source videos as well as an ablation study. ",
    "url": "https://arxiv.org/abs/2403.04380",
    "authors": [
      "Wolfgang Paier",
      "Paul Hinzer",
      "Anna Hilsmann",
      "Peter Eisert"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04384",
    "title": "HeROS: a miniaturised platform for research and development on  Heterogeneous RObotic Systems",
    "abstract": "Tests and prototyping are vital in the research and development of robotic systems. Work with target hardware is problematic. Hence, in the article, a low-cost, miniaturised physical platform is presented to deal with experiments on heterogeneous robotic systems. The platform comprises a physical board with tiles of the standardised base, diverse mobile robots, and manipulation robots. The number of exemplary applications validates the usefulness of the solution. ",
    "url": "https://arxiv.org/abs/2403.04384",
    "authors": [
      "Tomasz Winiarski",
      "Daniel Giełdowski",
      "Jan Kaniuka",
      "Jakub Ostrysz",
      "Jakub Sadowski"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.04398",
    "title": "MAGR: Manifold-Aligned Graph Regularization for Continual Action Quality  Assessment",
    "abstract": "Action Quality Assessment (AQA) evaluates diverse skills but models struggle with non-stationary data. We propose Continual AQA (CAQA) to refine models using sparse new data. Feature replay preserves memory without storing raw inputs. However, the misalignment between static old features and the dynamically changing feature manifold causes severe catastrophic forgetting. To address this novel problem, we propose Manifold-Aligned Graph Regularization (MAGR), which first aligns deviated old features to the current feature manifold, ensuring representation consistency. It then constructs a graph jointly arranging old and new features aligned with quality scores. Experiments show MAGR outperforms recent strong baselines with up to 6.56%, 5.66%, 15.64%, and 9.05% correlation gains on the MTL-AQA, FineDiving, UNLV-Dive, and JDM-MSA split datasets, respectively. This validates MAGR for continual assessment challenges arising from non-stationary skill variations. ",
    "url": "https://arxiv.org/abs/2403.04398",
    "authors": [
      "Kanglei Zhou",
      "Liyuan Wang",
      "Xingxing Zhang",
      "Hubert P. H. Shum",
      "Frederick W. B. Li",
      "Jianguo Li",
      "Xiaohui Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04417",
    "title": "Promising and worth-to-try future directions for advancing  state-of-the-art surrogates methods of agent-based models in social and  health computational sciences",
    "abstract": "The execution and runtime performance of model-based analysis tools for realistic large-scale ABMs (Agent-Based Models) can be excessively long. This due to the computational demand exponentially proportional to the model size (e.g. Population size) and the number of model parameters. Even the runtime of a single simulation of a realistic ABM may demand huge computational resources when attempting to employ realistic population size. The main aim of this ad-hoc brief report is to highlight some of surrogate models that were adequate and computationally less demanding for nonlinear dynamical models in various modeling application areas.To the author knowledge, these methods have been not, at least extensively, employed for ABMs within the field of (SHCS) Social Health Computational Sciences, yet. Thus, they might be, but not necessarily, useful in progressing state of the art for establishing surrogate models for ABMs in the field of SHCS. ",
    "url": "https://arxiv.org/abs/2403.04417",
    "authors": [
      "Atiyah Elsheikh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2403.04427",
    "title": "Sentiment-driven prediction of financial returns: a Bayesian-enhanced  FinBERT approach",
    "abstract": "Predicting financial returns accurately poses a significant challenge due to the inherent uncertainty in financial time series data. Enhancing prediction models' performance hinges on effectively capturing both social and financial sentiment. In this study, we showcase the efficacy of leveraging sentiment information extracted from tweets using the FinBERT large language model. By meticulously curating an optimal feature set through correlation analysis and employing Bayesian-optimized Recursive Feature Elimination for automatic feature selection, we surpass existing methodologies, achieving an F1-score exceeding 70% on the test set. This success translates into demonstrably higher cumulative profits during backtested trading. Our investigation focuses on real-world SPY ETF data alongside corresponding tweets sourced from the StockTwits platform. ",
    "url": "https://arxiv.org/abs/2403.04427",
    "authors": [
      "Raffaele Giuseppe Cestari",
      "Simone Formentin"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04429",
    "title": "Exploring the Influence of Dimensionality Reduction on Anomaly Detection  Performance in Multivariate Time Series",
    "abstract": "This paper presents an extensive empirical study on the integration of dimensionality reduction techniques with advanced unsupervised time series anomaly detection models, focusing on the MUTANT and Anomaly-Transformer models. The study involves a comprehensive evaluation across three different datasets: MSL, SMAP, and SWaT. Each dataset poses unique challenges, allowing for a robust assessment of the models' capabilities in varied contexts. The dimensionality reduction techniques examined include PCA, UMAP, Random Projection, and t-SNE, each offering distinct advantages in simplifying high-dimensional data. Our findings reveal that dimensionality reduction not only aids in reducing computational complexity but also significantly enhances anomaly detection performance in certain scenarios. Moreover, a remarkable reduction in training times was observed, with reductions by approximately 300\\% and 650\\% when dimensionality was halved and minimized to the lowest dimensions, respectively. This efficiency gain underscores the dual benefit of dimensionality reduction in both performance enhancement and operational efficiency. The MUTANT model exhibits notable adaptability, especially with UMAP reduction, while the Anomaly-Transformer demonstrates versatility across various reduction techniques. These insights provide a deeper understanding of the synergistic effects of dimensionality reduction and anomaly detection, contributing valuable perspectives to the field of time series analysis. The study underscores the importance of selecting appropriate dimensionality reduction strategies based on specific model requirements and dataset characteristics, paving the way for more efficient, accurate, and scalable solutions in anomaly detection. ",
    "url": "https://arxiv.org/abs/2403.04429",
    "authors": [
      "Mahsun Altin",
      "Altan Cakir"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04430",
    "title": "On-demand Quantization for Green Federated Generative Diffusion in  Mobile Edge Networks",
    "abstract": "Generative Artificial Intelligence (GAI) shows remarkable productivity and creativity in Mobile Edge Networks, such as the metaverse and the Industrial Internet of Things. Federated learning is a promising technique for effectively training GAI models in mobile edge networks due to its data distribution. However, there is a notable issue with communication consumption when training large GAI models like generative diffusion models in mobile edge networks. Additionally, the substantial energy consumption associated with training diffusion-based models, along with the limited resources of edge devices and complexities of network environments, pose challenges for improving the training efficiency of GAI models. To address this challenge, we propose an on-demand quantized energy-efficient federated diffusion approach for mobile edge networks. Specifically, we first design a dynamic quantized federated diffusion training scheme considering various demands from the edge devices. Then, we study an energy efficiency problem based on specific quantization requirements. Numerical results show that our proposed method significantly reduces system energy consumption and transmitted model size compared to both baseline federated diffusion and fixed quantized federated diffusion methods while effectively maintaining reasonable quality and diversity of generated data. ",
    "url": "https://arxiv.org/abs/2403.04430",
    "authors": [
      "Bingkun Lai",
      "Jiayi He",
      "Jiawen Kang",
      "Gaolei Li",
      "Minrui Xu",
      "Tao zhang",
      "Shengli Xie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2403.04431",
    "title": "Boosting Fairness and Robustness in Over-the-Air Federated Learning",
    "abstract": "Over-the-Air Computation is a beyond-5G communication strategy that has recently been shown to be useful for the decentralized training of machine learning models due to its efficiency. In this paper, we propose an Over-the-Air federated learning algorithm that aims to provide fairness and robustness through minmax optimization. By using the epigraph form of the problem at hand, we show that the proposed algorithm converges to the optimal solution of the minmax problem. Moreover, the proposed approach does not require reconstructing channel coefficients by complex encoding-decoding schemes as opposed to state-of-the-art approaches. This improves both efficiency and privacy. ",
    "url": "https://arxiv.org/abs/2403.04431",
    "authors": [
      "Halil Yigit Oksuz",
      "Fabio Molinari",
      "Henning Sprekeler",
      "Joerg Raisch"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2403.04435",
    "title": "Pilot Spoofing Attack on the Downlink of Cell-Free Massive MIMO: From  the Perspective of Adversaries",
    "abstract": "The channel hardening effect is less pronounced in the cell-free massive multiple-input multiple-output (mMIMO) system compared to its cellular counterpart, making it necessary to estimate the downlink effective channel gains to ensure decent performance. However, the downlink training inadvertently creates an opportunity for adversarial nodes to launch pilot spoofing attacks (PSAs). First, we demonstrate that adversarial distributed access points (APs) can severely degrade the achievable downlink rate. They achieve this by estimating their channels to users in the uplink training phase and then precoding and sending the same pilot sequences as those used by legitimate APs during the downlink training phase. Then, the impact of the downlink PSA is investigated by rigorously deriving a closed-form expression of the per-user achievable downlink rate. By employing the min-max criterion to optimize the power allocation coefficients, the maximum per-user achievable rate of downlink transmission is minimized from the perspective of adversarial APs. As an alternative to the downlink PSA, adversarial APs may opt to precode random interference during the downlink data transmission phase in order to disrupt legitimate communications. In this scenario, the achievable downlink rate is derived, and then power optimization algorithms are also developed. We present numerical results to showcase the detrimental impact of the downlink PSA and compare the effects of these two types of attacks. ",
    "url": "https://arxiv.org/abs/2403.04435",
    "authors": [
      "Weiyang Xu",
      "Yuan Zhang",
      "Ruiguang Wang",
      "Hien Quoc Ngo",
      "Wei Xiang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2403.04443",
    "title": "FriendNet: Detection-Friendly Dehazing Network",
    "abstract": "Adverse weather conditions often impair the quality of captured images, inevitably inducing cutting-edge object detection models for advanced driver assistance systems (ADAS) and autonomous driving. In this paper, we raise an intriguing question: can the combination of image restoration and object detection enhance detection performance in adverse weather conditions? To answer it, we propose an effective architecture that bridges image dehazing and object detection together via guidance information and task-driven learning to achieve detection-friendly dehazing, termed FriendNet. FriendNet aims to deliver both high-quality perception and high detection capacity. Different from existing efforts that intuitively treat image dehazing as pre-processing, FriendNet establishes a positive correlation between these two tasks. Clean features generated by the dehazing network potentially contribute to improvements in object detection performance. Conversely, object detection crucially guides the learning process of the image dehazing network under the task-driven learning scheme. We shed light on how downstream tasks can guide upstream dehazing processes, considering both network architecture and learning objectives. We design Guidance Fusion Block (GFB) and Guidance Attention Block (GAB) to facilitate the integration of detection information into the network. Furthermore, the incorporation of the detection task loss aids in refining the optimization process. Additionally, we introduce a new Physics-aware Feature Enhancement Block (PFEB), which integrates physics-based priors to enhance the feature extraction and representation capabilities. Extensive experiments on synthetic and real-world datasets demonstrate the superiority of our method over state-of-the-art methods on both image quality and detection precision. Our source code is available at https://github.com/fanyihua0309/FriendNet. ",
    "url": "https://arxiv.org/abs/2403.04443",
    "authors": [
      "Yihua Fan",
      "Yongzhen Wang",
      "Mingqiang Wei",
      "Fu Lee Wang",
      "Haoran Xie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04445",
    "title": "Classist Tools: Social Class Correlates with Performance in NLP",
    "abstract": "Since the foundational work of William Labov on the social stratification of language (Labov, 1964), linguistics has made concentrated efforts to explore the links between sociodemographic characteristics and language production and perception. But while there is strong evidence for socio-demographic characteristics in language, they are infrequently used in Natural Language Processing (NLP). Age and gender are somewhat well represented, but Labov's original target, socioeconomic status, is noticeably absent. And yet it matters. We show empirically that NLP disadvantages less-privileged socioeconomic groups. We annotate a corpus of 95K utterances from movies with social class, ethnicity and geographical language variety and measure the performance of NLP systems on three tasks: language modelling, automatic speech recognition, and grammar error correction. We find significant performance disparities that can be attributed to socioeconomic status as well as ethnicity and geographical differences. With NLP technologies becoming ever more ubiquitous and quotidian, they must accommodate all language varieties to avoid disadvantaging already marginalised groups. We argue for the inclusion of socioeconomic class in future language technologies. ",
    "url": "https://arxiv.org/abs/2403.04445",
    "authors": [
      "Amanda Cercas Curry",
      "Giuseppe Attanasio",
      "Zeerak Talat",
      "Dirk Hovy"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.04451",
    "title": "Membership Inference Attacks and Privacy in Topic Modeling",
    "abstract": "Recent research shows that large language models are susceptible to privacy attacks that infer aspects of the training data. However, it is unclear if simpler generative models, like topic models, share similar vulnerabilities. In this work, we propose an attack against topic models that can confidently identify members of the training data in Latent Dirichlet Allocation. Our results suggest that the privacy risks associated with generative modeling are not restricted to large neural models. Additionally, to mitigate these vulnerabilities, we explore differentially private (DP) topic modeling. We propose a framework for private topic modeling that incorporates DP vocabulary selection as a pre-processing step, and show that it improves privacy while having limited effects on practical utility. ",
    "url": "https://arxiv.org/abs/2403.04451",
    "authors": [
      "Nico Manzonelli",
      "Wanrong Zhang",
      "Salil Vadhan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04468",
    "title": "A Survey of Graph Neural Networks in Real world: Imbalance, Noise,  Privacy and OOD Challenges",
    "abstract": "Graph-structured data exhibits universality and widespread applicability across diverse domains, such as social network analysis, biochemistry, financial fraud detection, and network security. Significant strides have been made in leveraging Graph Neural Networks (GNNs) to achieve remarkable success in these areas. However, in real-world scenarios, the training environment for models is often far from ideal, leading to substantial performance degradation of GNN models due to various unfavorable factors, including imbalance in data distribution, the presence of noise in erroneous data, privacy protection of sensitive information, and generalization capability for out-of-distribution (OOD) scenarios. To tackle these issues, substantial efforts have been devoted to improving the performance of GNN models in practical real-world scenarios, as well as enhancing their reliability and robustness. In this paper, we present a comprehensive survey that systematically reviews existing GNN models, focusing on solutions to the four mentioned real-world challenges including imbalance, noise, privacy, and OOD in practical scenarios that many existing reviews have not considered. Specifically, we first highlight the four key challenges faced by existing GNNs, paving the way for our exploration of real-world GNN models. Subsequently, we provide detailed discussions on these four aspects, dissecting how these solutions contribute to enhancing the reliability and robustness of GNN models. Last but not least, we outline promising directions and offer future perspectives in the field. ",
    "url": "https://arxiv.org/abs/2403.04468",
    "authors": [
      "Wei Ju",
      "Siyu Yi",
      "Yifan Wang",
      "Zhiping Xiao",
      "Zhengyang Mao",
      "Hourun Li",
      "Yiyang Gu",
      "Yifang Qin",
      "Nan Yin",
      "Senzhang Wang",
      "Xinwang Liu",
      "Xiao Luo",
      "Philip S. Yu",
      "Ming Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.04480",
    "title": "The role of conformity in opinion dynamics modelling with multiple  social circles",
    "abstract": "Interaction with others influences our opinions and behaviours. Our activities within various social circles lead to different opinions expressed in various situations, groups, and ways of communication. Earlier studies on agent-based modelling of conformism within networks were based on a single-layer approach. Contrary to that, in this work, we propose a model incorporating conformism in which a person can share different continuous opinions on different layers depending on the social circle. Afterwards, we extend the model with more components that are known to influence opinions, e.g. authority or openness to new views. These two models are then compared to show that only sole conformism leads to opinion convergence. ",
    "url": "https://arxiv.org/abs/2403.04480",
    "authors": [
      "Stanisław Stępień",
      "Jarosław Jankowski",
      "Piotr Bródka",
      "Radosław Michalski"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2403.04482",
    "title": "On the Topology Awareness and Generalization Performance of Graph Neural  Networks",
    "abstract": "Many computer vision and machine learning problems are modelled as learning tasks on graphs, where graph neural networks (GNNs) have emerged as a dominant tool for learning representations of graph-structured data. A key feature of GNNs is their use of graph structures as input, enabling them to exploit the graphs' inherent topological properties-known as the topology awareness of GNNs. Despite the empirical successes of GNNs, the influence of topology awareness on generalization performance remains unexplored, particularly for node-level tasks that diverge from the assumption of data being independent and identically distributed (I.I.D.). The precise definition and characterization of the topology awareness of GNNs, especially concerning different topological features, are still unclear. This paper introduces a comprehensive framework to characterize the topology awareness of GNNs across any topological feature. Using this framework, we investigate the effects of topology awareness on GNN generalization performance. Contrary to the prevailing belief that enhancing the topology awareness of GNNs is always advantageous, our analysis reveals a critical insight: improving the topology awareness of GNNs may inadvertently lead to unfair generalization across structural groups, which might not be desired in some scenarios. Additionally, we conduct a case study using the intrinsic graph metric, the shortest path distance, on various benchmark datasets. The empirical results of this case study confirm our theoretical insights. Moreover, we demonstrate the practical applicability of our framework by using it to tackle the cold start problem in graph active learning. ",
    "url": "https://arxiv.org/abs/2403.04482",
    "authors": [
      "Junwei Su",
      "Chuan Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04483",
    "title": "GraphInstruct: Empowering Large Language Models with Graph Understanding  and Reasoning Capability",
    "abstract": "Evaluating and enhancing the general capabilities of large language models (LLMs) has been an important research topic. Graph is a common data structure in the real world, and understanding graph data is a crucial part for advancing general intelligence. To evaluate and enhance the graph understanding abilities of LLMs, in this paper, we propose a benchmark named GraphInstruct, which comprehensively includes 21 classical graph reasoning tasks, providing diverse graph generation pipelines and detailed reasoning steps. Based on GraphInstruct, we further construct GraphLM through efficient instruction-tuning, which shows prominent graph understanding capability. In order to enhance the LLM with graph reasoning capability as well, we propose a step mask training strategy, and construct a model named GraphLM+. As one of the pioneering efforts to enhance the graph understanding and reasoning abilities of LLMs, extensive experiments have demonstrated the superiority of GraphLM and GraphLM+ over other LLMs. We look forward to more researchers exploring the potential of LLMs in the graph data mining domain through GraphInstruct. Our code for generating GraphInstruct is released publicly at: https://github.com/CGCL-codes/GraphInstruct. ",
    "url": "https://arxiv.org/abs/2403.04483",
    "authors": [
      "Zihan Luo",
      "Xiran Song",
      "Hong Huang",
      "Jianxun Lian",
      "Chenhao Zhang",
      "Jinqi Jiang",
      "Xing Xie",
      "Hai Jin"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.04484",
    "title": "Source Matters: Source Dataset Impact on Model Robustness in Medical  Imaging",
    "abstract": "Transfer learning has become an essential part of medical imaging classification algorithms, often leveraging ImageNet weights. However, the domain shift from natural to medical images has prompted alternatives such as RadImageNet, often demonstrating comparable classification performance. However, it remains unclear whether the performance gains from transfer learning stem from improved generalization or shortcut learning. To address this, we investigate potential confounders -- whether synthetic or sampled from the data -- across two publicly available chest X-ray and CT datasets. We show that ImageNet and RadImageNet achieve comparable classification performance, yet ImageNet is much more prone to overfitting to confounders. We recommend that researchers using ImageNet-pretrained models reexamine their model robustness by conducting similar experiments. Our code and experiments are available at https://github.com/DovileDo/source-matters. ",
    "url": "https://arxiv.org/abs/2403.04484",
    "authors": [
      "Dovile Juodelyte",
      "Yucheng Lu",
      "Amelia Jiménez-Sánchez",
      "Sabrina Bottazzi",
      "Enzo Ferrante",
      "Veronika Cheplygina"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04485",
    "title": "Privacy in Cloud Computing through Immersion-based Coding",
    "abstract": "Cloud computing enables users to process and store data remotely on high-performance computers and servers by sharing data over the Internet. However, transferring data to clouds causes unavoidable privacy concerns. Here, we present a synthesis framework to design coding mechanisms that allow sharing and processing data in a privacy-preserving manner without sacrificing data utility and algorithmic performance. We consider the setup where the user aims to run an algorithm in the cloud using private data. The cloud then returns some data utility back to the user (utility refers to the service that the algorithm provides, e.g., classification, prediction, AI models, etc.). To avoid privacy concerns, the proposed scheme provides tools to co-design: 1) coding mechanisms to distort the original data and guarantee a prescribed differential privacy level; 2) an equivalent-but-different algorithm (referred here to as the target algorithm) that runs on distorted data and produces distorted utility; and 3) a decoding function that extracts the true utility from the distorted one with a negligible error. Then, instead of sharing the original data and algorithm with the cloud, only the distorted data and target algorithm are disclosed, thereby avoiding privacy concerns. The proposed scheme is built on the synergy of differential privacy and system immersion tools from control theory. The key underlying idea is to design a higher-dimensional target algorithm that embeds all trajectories of the original algorithm and works on randomly encoded data to produce randomly encoded utility. We show that the proposed scheme can be designed to offer any level of differential privacy without degrading the algorithm's utility. We present two use cases to illustrate the performance of the developed tools: privacy in optimization/learning algorithms and a nonlinear networked control system. ",
    "url": "https://arxiv.org/abs/2403.04485",
    "authors": [
      "Haleh Hayati",
      "Nathan van de Wouw",
      "Carlos Murguia"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.04489",
    "title": "Optimal Denial-of-Service Attacks Against Status Updating",
    "abstract": "In this paper, we investigate denial-of-service attacks against status updating. The target system is modeled by a Markov chain and an unreliable wireless channel, and the performance of status updating in the target system is measured based on two metrics: age of information and age of incorrect information. Our objective is to devise optimal attack policies that strike a balance between the deterioration of the system's performance and the adversary's energy. We model the optimal problem as a Markov decision process and prove rigorously that the optimal jamming policy is a threshold-based policy under both metrics. In addition, we provide a low-complexity algorithm to obtain the optimal threshold value of the jamming policy. Our numerical results show that the networked system with the age-of-incorrect-information metric is less sensitive to jamming attacks than with the age-of-information metric. Index Terms-age of incorrect information, age of information, cyber-physical systems, status updating, remote monitoring. ",
    "url": "https://arxiv.org/abs/2403.04489",
    "authors": [
      "Saad Kriouile",
      "Mohamad Assaad",
      "Deniz Gündüz",
      "Touraj Soleymani"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2403.04504",
    "title": "Improving Matrix Completion by Exploiting Rating Ordinality in Graph  Neural Networks",
    "abstract": "Matrix completion is an important area of research in recommender systems. Recent methods view a rating matrix as a user-item bi-partite graph with labeled edges denoting observed ratings and predict the edges between the user and item nodes by using the graph neural network (GNN). Despite their effectiveness, they treat each rating type as an independent relation type and thus cannot sufficiently consider the ordinal nature of the ratings. In this paper, we explore a new approach to exploit rating ordinality for GNN, which has not been studied well in the literature. We introduce a new method, called ROGMC, to leverage Rating Ordinality in GNN-based Matrix Completion. It uses cumulative preference propagation to directly incorporate rating ordinality in GNN's message passing, allowing for users' stronger preferences to be more emphasized based on inherent orders of rating types. This process is complemented by interest regularization which facilitates preference learning using the underlying interest information. Our extensive experiments show that ROGMC consistently outperforms the existing strategies of using rating types for GNN. We expect that our attempt to explore the feasibility of utilizing rating ordinality for GNN may stimulate further research in this direction. ",
    "url": "https://arxiv.org/abs/2403.04504",
    "authors": [
      "Jaehyun Lee",
      "Seonku Kang",
      "Hwanjo Yu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04521",
    "title": "Uncertainty-Aware Relational Graph Neural Network for Few-Shot Knowledge  Graph Completion",
    "abstract": "Few-shot knowledge graph completion (FKGC) aims to query the unseen facts of a relation given its few-shot reference entity pairs. The side effect of noises due to the uncertainty of entities and triples may limit the few-shot learning, but existing FKGC works neglect such uncertainty, which leads them more susceptible to limited reference samples with noises. In this paper, we propose a novel uncertainty-aware few-shot KG completion framework (UFKGC) to model uncertainty for a better understanding of the limited data by learning representations under Gaussian distribution. Uncertainty representation is first designed for estimating the uncertainty scope of the entity pairs after transferring feature representations into a Gaussian distribution. Further, to better integrate the neighbors with uncertainty characteristics for entity features, we design an uncertainty-aware relational graph neural network (UR-GNN) to conduct convolution operations between the Gaussian distributions. Then, multiple random samplings are conducted for reference triples within the Gaussian distribution to generate smooth reference representations during the optimization. The final completion score for each query instance is measured by the designed uncertainty optimization to make our approach more robust to the noises in few-shot scenarios. Experimental results show that our approach achieves excellent performance on two benchmark datasets compared to its competitors. ",
    "url": "https://arxiv.org/abs/2403.04521",
    "authors": [
      "Qian Li",
      "Shu Guo",
      "Yingjia Chen",
      "Cheng Ji",
      "Jiawei Sheng",
      "Jianxin Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.04523",
    "title": "T-TAME: Trainable Attention Mechanism for Explaining Convolutional  Networks and Vision Transformers",
    "abstract": "The development and adoption of Vision Transformers and other deep-learning architectures for image classification tasks has been rapid. However, the \"black box\" nature of neural networks is a barrier to adoption in applications where explainability is essential. While some techniques for generating explanations have been proposed, primarily for Convolutional Neural Networks, adapting such techniques to the new paradigm of Vision Transformers is non-trivial. This paper presents T-TAME, Transformer-compatible Trainable Attention Mechanism for Explanations, a general methodology for explaining deep neural networks used in image classification tasks. The proposed architecture and training technique can be easily applied to any convolutional or Vision Transformer-like neural network, using a streamlined training approach. After training, explanation maps can be computed in a single forward pass; these explanation maps are comparable to or outperform the outputs of computationally expensive perturbation-based explainability techniques, achieving SOTA performance. We apply T-TAME to three popular deep learning classifier architectures, VGG-16, ResNet-50, and ViT-B-16, trained on the ImageNet dataset, and we demonstrate improvements over existing state-of-the-art explainability methods. A detailed analysis of the results and an ablation study provide insights into how the T-TAME design choices affect the quality of the generated explanation maps. ",
    "url": "https://arxiv.org/abs/2403.04523",
    "authors": [
      "Mariano V. Ntrougkas",
      "Nikolaos Gkalelis",
      "Vasileios Mezaris"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2403.04545",
    "title": "Improve Generalization Ability of Deep Wide Residual Network with A  Suitable Scaling Factor",
    "abstract": "Deep Residual Neural Networks (ResNets) have demonstrated remarkable success across a wide range of real-world applications. In this paper, we identify a suitable scaling factor (denoted by $\\alpha$) on the residual branch of deep wide ResNets to achieve good generalization ability. We show that if $\\alpha$ is a constant, the class of functions induced by Residual Neural Tangent Kernel (RNTK) is asymptotically not learnable, as the depth goes to infinity. We also highlight a surprising phenomenon: even if we allow $\\alpha$ to decrease with increasing depth $L$, the degeneration phenomenon may still occur. However, when $\\alpha$ decreases rapidly with $L$, the kernel regression with deep RNTK with early stopping can achieve the minimax rate provided that the target regression function falls in the reproducing kernel Hilbert space associated with the infinite-depth RNTK. Our simulation studies on synthetic data and real classification tasks such as MNIST, CIFAR10 and CIFAR100 support our theoretical criteria for choosing $\\alpha$. ",
    "url": "https://arxiv.org/abs/2403.04545",
    "authors": [
      "Songtao Tian",
      "Zixiong Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2403.04558",
    "title": "Reducing self-supervised learning complexity improves weakly-supervised  classification performance in computational pathology",
    "abstract": "Deep Learning models have been successfully utilized to extract clinically actionable insights from routinely available histology data. Generally, these models require annotations performed by clinicians, which are scarce and costly to generate. The emergence of self-supervised learning (SSL) methods remove this barrier, allowing for large-scale analyses on non-annotated data. However, recent SSL approaches apply increasingly expansive model architectures and larger datasets, causing the rapid escalation of data volumes, hardware prerequisites, and overall expenses, limiting access to these resources to few institutions. Therefore, we investigated the complexity of contrastive SSL in computational pathology in relation to classification performance with the utilization of consumer-grade hardware. Specifically, we analyzed the effects of adaptations in data volume, architecture, and algorithms on downstream classification tasks, emphasizing their impact on computational resources. We trained breast cancer foundation models on a large public patient cohort and validated them on various downstream classification tasks in a weakly supervised manner on two external public patient cohorts. Our experiments demonstrate that we can improve downstream classification performance whilst reducing SSL training duration by 90%. In summary, we propose a set of adaptations which enable the utilization of SSL in computational pathology in non-resource abundant environments. ",
    "url": "https://arxiv.org/abs/2403.04558",
    "authors": [
      "Tim Lenz",
      "Omar S. M. El Nahhas",
      "Marta Ligero",
      "Jakob Nikolas Kather"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04562",
    "title": "Out of the Room: Generalizing Event-Based Dynamic Motion Segmentation  for Complex Scenes",
    "abstract": "Rapid and reliable identification of dynamic scene parts, also known as motion segmentation, is a key challenge for mobile sensors. Contemporary RGB camera-based methods rely on modeling camera and scene properties however, are often under-constrained and fall short in unknown categories. Event cameras have the potential to overcome these limitations, but corresponding methods have only been demonstrated in smaller-scale indoor environments with simplified dynamic objects. This work presents an event-based method for class-agnostic motion segmentation that can successfully be deployed across complex large-scale outdoor environments too. To this end, we introduce a novel divide-and-conquer pipeline that combines: (a) ego-motion compensated events, computed via a scene understanding module that predicts monocular depth and camera pose as auxiliary tasks, and (b) optical flow from a dedicated optical flow module. These intermediate representations are then fed into a segmentation module that predicts motion segmentation masks. A novel transformer-based temporal attention module in the segmentation module builds correlations across adjacent 'frames' to get temporally consistent segmentation masks. Our method sets the new state-of-the-art on the classic EV-IMO benchmark (indoors), where we achieve improvements of 2.19 moving object IoU (2.22 mIoU) and 4.52 point IoU respectively, as well as on a newly-generated motion segmentation and tracking benchmark (outdoors) based on the DSEC event dataset, termed DSEC-MOTS, where we show improvement of 12.91 moving object IoU. ",
    "url": "https://arxiv.org/abs/2403.04562",
    "authors": [
      "Stamatios Georgoulis",
      "Weining Ren",
      "Alfredo Bochicchio",
      "Daniel Eckert",
      "Yuanyou Li",
      "Abel Gawel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04568",
    "title": "Improved Algorithm for Adversarial Linear Mixture MDPs with Bandit  Feedback and Unknown Transition",
    "abstract": "We study reinforcement learning with linear function approximation, unknown transition, and adversarial losses in the bandit feedback setting. Specifically, we focus on linear mixture MDPs whose transition kernel is a linear mixture model. We propose a new algorithm that attains an $\\widetilde{O}(d\\sqrt{HS^3K} + \\sqrt{HSAK})$ regret with high probability, where $d$ is the dimension of feature mappings, $S$ is the size of state space, $A$ is the size of action space, $H$ is the episode length and $K$ is the number of episodes. Our result strictly improves the previous best-known $\\widetilde{O}(dS^2 \\sqrt{K} + \\sqrt{HSAK})$ result in Zhao et al. (2023a) since $H \\leq S$ holds by the layered MDP structure. Our advancements are primarily attributed to (i) a new least square estimator for the transition parameter that leverages the visit information of all states, as opposed to only one state in prior work, and (ii) a new self-normalized concentration tailored specifically to handle non-independent noises, originally proposed in the dynamic assortment area and firstly applied in reinforcement learning to handle correlations between different states. ",
    "url": "https://arxiv.org/abs/2403.04568",
    "authors": [
      "Long-Fei Li",
      "Peng Zhao",
      "Zhi-Hua Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.04574",
    "title": "Children Age Group Detection based on Human-Computer Interaction and  Time Series Analysis",
    "abstract": "This article proposes a novel Children-Computer Interaction (CCI) approach for the task of age group detection. This approach focuses on the automatic analysis of the time series generated from the interaction of the children with mobile devices. In particular, we extract a set of 25 time series related to spatial, pressure, and kinematic information of the children interaction while colouring a tree through a pen stylus tablet, a specific test from the large-scale public ChildCIdb database. A complete analysis of the proposed approach is carried out using different time series selection techniques to choose the most discriminative ones for the age group detection task: i) a statistical analysis, and ii) an automatic algorithm called Sequential Forward Search (SFS). In addition, different classification algorithms such as Dynamic Time Warping Barycenter Averaging (DBA) and Hidden Markov Models (HMM) are studied. Accuracy results over 85% are achieved, outperforming previous approaches in the literature and in more challenging age group conditions. Finally, the approach presented in this study can benefit many children-related applications, for example, towards an age-appropriate environment with the technology. ",
    "url": "https://arxiv.org/abs/2403.04574",
    "authors": [
      "Juan Carlos Ruiz-Garcia",
      "Carlos Hojas",
      "Ruben Tolosana",
      "Ruben Vera-Rodriguez",
      "Aythami Morales",
      "Julian Fierrez",
      "Javier Ortega-Garcia",
      "Jaime Herreros-Rodriguez"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2403.04576",
    "title": "A Model Hierarchy for Predicting the Flow in Stirred Tanks with  Physics-Informed Neural Networks",
    "abstract": "This paper explores the potential of Physics-Informed Neural Networks (PINNs) to serve as Reduced Order Models (ROMs) for simulating the flow field within stirred tank reactors (STRs). We solve the two-dimensional stationary Navier-Stokes equations within a geometrically intricate domain and explore methodologies that allow us to integrate additional physical insights into the model. These approaches include imposing the Dirichlet boundary conditions (BCs) strongly and employing domain decomposition (DD), with both overlapping and non-overlapping subdomains. We adapt the Extended Physics-Informed Neural Network (XPINN) approach to solve different sets of equations in distinct subdomains based on the diverse flow characteristics present in each region. Our exploration results in a hierarchy of models spanning various levels of complexity, where the best models exhibit l1 prediction errors of less than 1% for both pressure and velocity. To illustrate the reproducibility of our approach, we track the errors over repeated independent training runs of the best identified model and show its reliability. Subsequently, by incorporating the stirring rate as a parametric input, we develop a fast-to-evaluate model of the flow capable of interpolating across a wide range of Reynolds numbers. Although we exclusively restrict ourselves to STRs in this work, we conclude that the steps taken to obtain the presented model hierarchy can be transferred to other applications. ",
    "url": "https://arxiv.org/abs/2403.04576",
    "authors": [
      "Veronika Trávníková",
      "Daniel Wolff",
      "Nico Dirkes",
      "Stefanie Elgeti",
      "Eric von Lieres",
      "Marek Behr"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2403.04605",
    "title": "In-n-Out: Calibrating Graph Neural Networks for Link Prediction",
    "abstract": "Deep neural networks are notoriously miscalibrated, i.e., their outputs do not reflect the true probability of the event we aim to predict. While networks for tabular or image data are usually overconfident, recent works have shown that graph neural networks (GNNs) show the opposite behavior for node-level classification. But what happens when we are predicting links? We show that, in this case, GNNs often exhibit a mixed behavior. More specifically, they may be overconfident in negative predictions while being underconfident in positive ones. Based on this observation, we propose IN-N-OUT, the first-ever method to calibrate GNNs for link prediction. IN-N-OUT is based on two simple intuitions: i) attributing true/false labels to an edge while respecting a GNNs prediction should cause but small fluctuations in that edge's embedding; and, conversely, ii) if we label that same edge contradicting our GNN, embeddings should change more substantially. An extensive experimental campaign shows that IN-N-OUT significantly improves the calibration of GNNs in link prediction, consistently outperforming the baselines available -- which are not designed for this specific task. ",
    "url": "https://arxiv.org/abs/2403.04605",
    "authors": [
      "Erik Nascimento",
      "Diego Mesquita",
      "Samuel Kaski",
      "Amauri H Souza"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04630",
    "title": "Time-Aware Projections: Truly Node-Private Graph Statistics under  Continual Observation",
    "abstract": "We describe the first algorithms that satisfy the standard notion of node-differential privacy in the continual release setting (i.e., without an assumed promise on input streams). Previous work addresses node-private continual release by assuming an unenforced promise on the maximum degree in a graph; indeed, the algorithms from these works exhibit blatant privacy violations when the degree bound is not met. Our algorithms are accurate on sparse graphs, for several fundamental graph problems: counting edges, triangles, other subgraphs, and connected components; and releasing degree histograms. Our unconditionally private algorithms generally have optimal error, up to polylogarithmic factors and lower-order terms. We provide general transformations that take a base algorithm for the continual release setting, which need only be private for streams satisfying a promised degree bound, and produce an algorithm that is unconditionally private yet mimics the base algorithm when the stream meets the degree bound (and adds only linear overhead to the time and space complexity of the base algorithm). To do so, we design new projection algorithms for graph streams, based on the batch-model techniques of Day et al. 2016 and Blocki et al. 2013, which modify the stream to limit its degree. Our main technical innovation is to show that the projections are stable -- meaning that similar input graphs have similar projections -- when the input stream satisfies a privately testable safety condition. Our transformation then follows a novel online variant of the Propose-Test-Release framework (Dwork and Lei, 2009), privately testing the safety condition before releasing output at each step. ",
    "url": "https://arxiv.org/abs/2403.04630",
    "authors": [
      "Palak Jain",
      "Adam Smith",
      "Connor Wagaman"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.04636",
    "title": "Entropy Aware Message Passing in Graph Neural Networks",
    "abstract": "Deep Graph Neural Networks struggle with oversmoothing. This paper introduces a novel, physics-inspired GNN model designed to mitigate this issue. Our approach integrates with existing GNN architectures, introducing an entropy-aware message passing term. This term performs gradient ascent on the entropy during node aggregation, thereby preserving a certain degree of entropy in the embeddings. We conduct a comparative analysis of our model against state-of-the-art GNNs across various common datasets. ",
    "url": "https://arxiv.org/abs/2403.04636",
    "authors": [
      "Philipp Nazari",
      "Oliver Lemke",
      "Davide Guidobene",
      "Artiom Gesp"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04655",
    "title": "Closed-loop Performance Optimization of Model Predictive Control with  Robustness Guarantees",
    "abstract": "Model mismatch and process noise are two frequently occurring phenomena that can drastically affect the performance of model predictive control (MPC) in practical applications. We propose a principled way to tune the cost function and the constraints of linear MPC schemes to achieve good performance and robust constraint satisfaction on uncertain nonlinear dynamics with additive noise. The tuning is performed using a novel MPC tuning algorithm based on backpropagation developed in our earlier work. Using the scenario approach, we provide probabilistic bounds on the likelihood of closed-loop constraint violation over a finite horizon. We showcase the effectiveness of the proposed method on linear and nonlinear simulation examples. ",
    "url": "https://arxiv.org/abs/2403.04655",
    "authors": [
      "Riccardo Zuliani",
      "Efe C. Balta",
      "John Lygeros"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2403.04667",
    "title": "The Social Impact of Generative AI: An Analysis on ChatGPT",
    "abstract": "In recent months, the social impact of Artificial Intelligence (AI) has gained considerable public interest, driven by the emergence of Generative AI models, ChatGPT in particular. The rapid development of these models has sparked heated discussions regarding their benefits, limitations, and associated risks. Generative models hold immense promise across multiple domains, such as healthcare, finance, and education, to cite a few, presenting diverse practical applications. Nevertheless, concerns about potential adverse effects have elicited divergent perspectives, ranging from privacy risks to escalating social inequality. This paper adopts a methodology to delve into the societal implications of Generative AI tools, focusing primarily on the case of ChatGPT. It evaluates the potential impact on several social sectors and illustrates the findings of a comprehensive literature review of both positive and negative effects, emerging trends, and areas of opportunity of Generative AI models. This analysis aims to facilitate an in-depth discussion by providing insights that can inspire policy, regulation, and responsible development practices to foster a human-centered AI. ",
    "url": "https://arxiv.org/abs/2403.04667",
    "authors": [
      "Maria T. Baldassarre",
      "Danilo Caivano",
      "Berenice Fernandez Nieto",
      "Domenico Gigante",
      "Azzurra Ragone"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2403.04670",
    "title": "End-to-end Conditional Robust Optimization",
    "abstract": "The field of Contextual Optimization (CO) integrates machine learning and optimization to solve decision making problems under uncertainty. Recently, a risk sensitive variant of CO, known as Conditional Robust Optimization (CRO), combines uncertainty quantification with robust optimization in order to promote safety and reliability in high stake applications. Exploiting modern differentiable optimization methods, we propose a novel end-to-end approach to train a CRO model in a way that accounts for both the empirical risk of the prescribed decisions and the quality of conditional coverage of the contextual uncertainty set that supports them. While guarantees of success for the latter objective are impossible to obtain from the point of view of conformal prediction theory, high quality conditional coverage is achieved empirically by ingeniously employing a logistic regression differentiable layer within the calculation of coverage quality in our training loss. We show that the proposed training algorithms produce decisions that outperform the traditional estimate then optimize approaches. ",
    "url": "https://arxiv.org/abs/2403.04670",
    "authors": [
      "Abhilash Chenreddy",
      "Erick Delage"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04694",
    "title": "On $[1,2]$-Domination in Interval and Circle Graphs",
    "abstract": "A subset $S$ of vertices in a graph $G=(V, E)$ is Dominating Set if each vertex in $V(G)\\setminus S$ is adjacent to at least one vertex in $S$. Chellali et al. in 2013, by restricting the number of neighbors in $S$ of a vertex outside $S$, introduced the concept of $[1,j]$-dominating set. A set $D \\subseteq V$ of a graph $G = (V, E)$ is called $[1,j]$-Dominating Set of $G$ if every vertex not in $D$ has at least one neighbor and at most $j$ neighbors in $D$. The Minimum $[1,j]$-Domination problem is the problem of finding the minimum set $D$. Given a positive integer $k$ and a graph $G = (V, E)$, the $[1,j]$-Domination Decision problem is to decide whether $G$ has $[1,j]$-dominating set of cardinality at most $k$. A polynomial-time algorithm was obtained in split graphs for a constant $j$ in contrast to the classic Dominating Set problem which is NP-hard in split graphs. This result motivates us to investigate the effect of restriction $j$ on the complexity of $[1,j]$-domination problem on various classes of graphs. Although for $j\\geq 3$, it has been proved that the minimum of classical domination is equal to minimum $[1,j]$-domination in interval graphs, the complexity of finding the minimum $[1,2]$-domination in interval graphs is still outstanding. In this paper, we propose a polynomial-time algorithm for computing a minimum $[1,2]$ on non-proper interval graphs by a dynamic programming technique. Next, on the negative side, we show that the minimum $[1,2]$-dominating set problem on circle graphs is $NP$-complete. ",
    "url": "https://arxiv.org/abs/2403.04694",
    "authors": [
      "Mohsen Alambardar Meybodi",
      "Abolfazl Poureidi"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2403.04703",
    "title": "mmPlace: Robust Place Recognition with Intermediate Frequency Signal of  Low-cost Single-chip Millimeter Wave Radar",
    "abstract": "Place recognition is crucial for tasks like loop-closure detection and re-localization. Single-chip millimeter wave radar (single-chip radar in short) emerges as a low-cost sensor option for place recognition, with the advantage of insensitivity to degraded visual environments. However, it encounters two challenges. Firstly, sparse point cloud from single-chip radar leads to poor performance when using current place recognition methods, which assume much denser data. Secondly, its performance significantly declines in scenarios involving rotational and lateral variations, due to limited overlap in its field of view (FOV). We propose mmPlace, a robust place recognition system to address these challenges. Specifically, mmPlace transforms intermediate frequency (IF) signal into range azimuth heatmap and employs a spatial encoder to extract features. Additionally, to improve the performance in scenarios involving rotational and lateral variations, mmPlace employs a rotating platform and concatenates heatmaps in a rotation cycle, effectively expanding the system's FOV. We evaluate mmPlace's performance on the milliSonic dataset, which is collected on the University of Science and Technology of China (USTC) campus, the city roads surrounding the campus, and an underground parking garage. The results demonstrate that mmPlace outperforms point cloud-based methods and achieves 87.37% recall@1 in scenarios involving rotational and lateral variations. ",
    "url": "https://arxiv.org/abs/2403.04703",
    "authors": [
      "Chengzhen Meng",
      "Yifan Duan",
      "Chenming He",
      "Dequan Wang",
      "Xiaoran Fan",
      "Yanyong Zhang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.04726",
    "title": "A Sub-Quadratic Time Algorithm for Robust Sparse Mean Estimation",
    "abstract": "We study the algorithmic problem of sparse mean estimation in the presence of adversarial outliers. Specifically, the algorithm observes a \\emph{corrupted} set of samples from $\\mathcal{N}(\\mu,\\mathbf{I}_d)$, where the unknown mean $\\mu \\in \\mathbb{R}^d$ is constrained to be $k$-sparse. A series of prior works has developed efficient algorithms for robust sparse mean estimation with sample complexity $\\mathrm{poly}(k,\\log d, 1/\\epsilon)$ and runtime $d^2 \\mathrm{poly}(k,\\log d,1/\\epsilon)$, where $\\epsilon$ is the fraction of contamination. In particular, the fastest runtime of existing algorithms is quadratic ($\\Omega(d^2)$), which can be prohibitive in high dimensions. This quadratic barrier in the runtime stems from the reliance of these algorithms on the sample covariance matrix, which is of size $d^2$. Our main contribution is an algorithm for robust sparse mean estimation which runs in \\emph{subquadratic} time using $\\mathrm{poly}(k,\\log d,1/\\epsilon)$ samples. We also provide analogous results for robust sparse PCA. Our results build on algorithmic advances in detecting weak correlations, a generalized version of the light-bulb problem by Valiant. ",
    "url": "https://arxiv.org/abs/2403.04726",
    "authors": [
      "Ankit Pensia"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.04747",
    "title": "GNN-VPA: A Variance-Preserving Aggregation Strategy for Graph Neural  Networks",
    "abstract": "Graph neural networks (GNNs), and especially message-passing neural networks, excel in various domains such as physics, drug discovery, and molecular modeling. The expressivity of GNNs with respect to their ability to discriminate non-isomorphic graphs critically depends on the functions employed for message aggregation and graph-level readout. By applying signal propagation theory, we propose a variance-preserving aggregation function (VPA) that maintains expressivity, but yields improved forward and backward dynamics. Experiments demonstrate that VPA leads to increased predictive performance for popular GNN architectures as well as improved learning dynamics. Our results could pave the way towards normalizer-free or self-normalizing GNNs. ",
    "url": "https://arxiv.org/abs/2403.04747",
    "authors": [
      "Lisa Schneckenreiter",
      "Richard Freinschlag",
      "Florian Sestak",
      "Johannes Brandstetter",
      "Günter Klambauer",
      "Andreas Mayr"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.04763",
    "title": "BloomGML: Graph Machine Learning through the Lens of Bilevel  Optimization",
    "abstract": "Bilevel optimization refers to scenarios whereby the optimal solution of a lower-level energy function serves as input features to an upper-level objective of interest. These optimal features typically depend on tunable parameters of the lower-level energy in such a way that the entire bilevel pipeline can be trained end-to-end. Although not generally presented as such, this paper demonstrates how a variety of graph learning techniques can be recast as special cases of bilevel optimization or simplifications thereof. In brief, building on prior work we first derive a more flexible class of energy functions that, when paired with various descent steps (e.g., gradient descent, proximal methods, momentum, etc.), form graph neural network (GNN) message-passing layers; critically, we also carefully unpack where any residual approximation error lies with respect to the underlying constituent message-passing functions. We then probe several simplifications of this framework to derive close connections with non-GNN-based graph learning approaches, including knowledge graph embeddings, various forms of label propagation, and efficient graph-regularized MLP models. And finally, we present supporting empirical results that demonstrate the versatility of the proposed bilevel lens, which we refer to as BloomGML, referencing that BiLevel Optimization Offers More Graph Machine Learning. Our code is available at https://github.com/amberyzheng/BloomGML. Let graph ML bloom. ",
    "url": "https://arxiv.org/abs/2403.04763",
    "authors": [
      "Amber Yijia Zheng",
      "Tong He",
      "Yixuan Qiu",
      "Minjie Wang",
      "David Wipf"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04084",
    "title": "Density and Affinity Dependent Social Segregation and Arbitrage  Equilibrium in a Multi-class Schelling Game",
    "abstract": "Contrary to the widely believed hypothesis that larger, denser cities promote socioeconomic mixing, a recent study (Nilforoshan et al. 2023) reports the opposite behavior, i.e. more segregation. Here, we present a game-theoretic model that predicts such a density-dependent segregation outcome in both one- and two-class systems. The model provides key insights into the analytical conditions that lead to such behavior. Furthermore, the arbitrage equilibrium outcome implies the equality of effective utilities among all agents. This could be interpreted as all agents being equally \"happy\" in their respective environments in our ideal society. We believe that our model contributes towards a deeper mathematical understanding of social dynamics and behavior, which is important as we strive to develop more harmonious societies. ",
    "url": "https://arxiv.org/abs/2403.04084",
    "authors": [
      "Venkat Venkatasubramanian",
      "Jessica Shi",
      "Leo Goldman",
      "Arun Sankar E.M.",
      "Abhishek Sivaram"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2403.04126",
    "title": "Optimal Scheduling of Graph States via Path Decompositions",
    "abstract": "We study the optimal scheduling of graph states in measurement-based quantum computation, establishing an equivalence between measurement schedules and path decompositions of graphs. We define the spatial cost of a measurement schedule based on the number of simultaneously active qubits and prove that an optimal measurement schedule corresponds to a path decomposition of minimal width. Our analysis shows that approximating the spatial cost of a graph is \\textsf{NP}-hard, while for graphs with bounded spatial cost, we establish an efficient algorithm for computing an optimal measurement schedule. ",
    "url": "https://arxiv.org/abs/2403.04126",
    "authors": [
      "Samuel J. Elman",
      "Jason Gavriel",
      "Ryan L. Mann"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Computational Complexity (cs.CC)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2403.04252",
    "title": "Portable GPU implementation of the WP-CCC ion-atom collisions code",
    "abstract": "We present our experience of porting the code used in the wave-packet convergent-close-coupling (WP-CCC) approach to run on NVIDIA V100 and AMD MI250X GPUs. The WP-CCC approach is a method used in the field of ion-atom collision physics to describe various processes such as elastic scattering, target excitation and electron-capture by the projectile. It has demonstrated its effectiveness in modelling collisions involving proton or bare ion projectiles with various atomic and molecular targets, especially those which can be considered as one or two-electron systems. Such calculations find their application in computational atomic physics as well as in the modelling of fusion plasmas and in hadron therapy for cancer treatment. The main computational cost of the method lies in the solution of an emerging set of coupled first-order differential equations. This involves implementing the standard Runge-Kutta method while varying the projectile position along multiple straight-line paths. At each projectile position several millions of matrix elements need to be calculated which is accomplished using the OpenACC programming model. Once these matrix elements are computed, the subsequent steps involve matrix inversion and multiplication with another matrix. To expedite these operations, a GPU-accelerated LAPACK routine, specialised for solving systems of linear equations, is employed. For AMD GPUs, this routine is accessible through the hipSOLVER library, while for NVIDIA GPUs, it can be obtained from the cuSOLVER library. The portability, performance and energy efficiency of the CPU-only code have been compared with the GPU-accelerated version running on AMD and NVIDIA GPUs. The implementation of GPU-accelerated WP-CCC code opens up avenues for exploring more sophisticated collision processes involving complex projectile and target structures, which were previously considered infeasible. ",
    "url": "https://arxiv.org/abs/2403.04252",
    "authors": [
      "I. B. Abdurakhmanov",
      "N. W. Antonio",
      "M. Cytowski",
      "A. S. Kadyrov"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2403.04395",
    "title": "SGNet: Folding Symmetrical Protein Complex with Deep Learning",
    "abstract": "Deep learning has made significant progress in protein structure prediction, advancing the development of computational biology. However, despite the high accuracy achieved in predicting single-chain structures, a significant number of large homo-oligomeric assemblies exhibit internal symmetry, posing a major challenge in structure determination. The performances of existing deep learning methods are limited since the symmetrical protein assembly usually has a long sequence, making structural computation infeasible. In addition, multiple identical subunits in symmetrical protein complex cause the issue of supervision ambiguity in label assignment, requiring a consistent structure modeling for the training. To tackle these problems, we propose a protein folding framework called SGNet to model protein-protein interactions in symmetrical assemblies. SGNet conducts feature extraction on a single subunit and generates the whole assembly using our proposed symmetry module, which largely mitigates computational problems caused by sequence length. Thanks to the elaborate design of modeling symmetry consistently, we can model all global symmetry types in quaternary protein structure prediction. Extensive experimental results on a benchmark of symmetrical protein complexes further demonstrate the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2403.04395",
    "authors": [
      "Zhaoqun Li",
      "Jingcheng Yu",
      "Qiwei Ye"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.04478",
    "title": "Improved Focus on Hard Samples for Lung Nodule Detection",
    "abstract": "Recently, lung nodule detection methods based on deep learning have shown excellent performance in the medical image processing field. Considering that only a few public lung datasets are available and lung nodules are more difficult to detect in CT images than in natural images, the existing methods face many bottlenecks when detecting lung nodules, especially hard ones in CT images. In order to solve these problems, we plan to enhance the focus of our network. In this work, we present an improved detection network that pays more attention to hard samples and datasets to deal with lung nodules by introducing deformable convolution and self-paced learning. Experiments on the LUNA16 dataset demonstrate the effectiveness of our proposed components and show that our method has reached competitive performance. ",
    "url": "https://arxiv.org/abs/2403.04478",
    "authors": [
      "Yujiang Chen",
      "Mei Xie"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04612",
    "title": "A Domain Translation Framework with an Adversarial Denoising Diffusion  Model to Generate Synthetic Datasets of Echocardiography Images",
    "abstract": "Currently, medical image domain translation operations show a high demand from researchers and clinicians. Amongst other capabilities, this task allows the generation of new medical images with sufficiently high image quality, making them clinically relevant. Deep Learning (DL) architectures, most specifically deep generative models, are widely used to generate and translate images from one domain to another. The proposed framework relies on an adversarial Denoising Diffusion Model (DDM) to synthesize echocardiography images and perform domain translation. Contrary to Generative Adversarial Networks (GANs), DDMs are able to generate high quality image samples with a large diversity. If a DDM is combined with a GAN, this ability to generate new data is completed at an even faster sampling time. In this work we trained an adversarial DDM combined with a GAN to learn the reverse denoising process, relying on a guide image, making sure relevant anatomical structures of each echocardiography image were kept and represented on the generated image samples. For several domain translation operations, the results verified that such generative model was able to synthesize high quality image samples: MSE: 11.50 +/- 3.69, PSNR (dB): 30.48 +/- 0.09, SSIM: 0.47 +/- 0.03. The proposed method showed high generalization ability, introducing a framework to create echocardiography images suitable to be used for clinical research purposes. ",
    "url": "https://arxiv.org/abs/2403.04612",
    "authors": [
      "Cristiana Tiago",
      "Sten Roar Snare",
      "Jurica Sprem",
      "Kristin McLeod"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04626",
    "title": "MedFLIP: Medical Vision-and-Language Self-supervised Fast Pre-Training  with Masked Autoencoder",
    "abstract": "Within the domain of medical analysis, extensive research has explored the potential of mutual learning between Masked Autoencoders(MAEs) and multimodal data. However, the impact of MAEs on intermodality remains a key challenge. We introduce MedFLIP, a Fast Language-Image Pre-training method for Medical analysis. We explore MAEs for zero-shot learning with crossed domains, which enhances the model ability to learn from limited data, a common scenario in medical diagnostics. We verify that masking an image does not affect intermodal learning. Furthermore, we propose the SVD loss to enhance the representation learning for characteristics of medical images, aiming to improve classification accuracy by leveraging the structural intricacies of such data. Lastly, we validate using language will improve the zero-shot performance for the medical image analysis. MedFLIP scaling of the masking process marks an advancement in the field, offering a pathway to rapid and precise medical image analysis without the traditional computational bottlenecks. Through experiments and validation, MedFLIP demonstrates efficient performance improvements, setting an explored standard for future research and application in medical diagnostics. ",
    "url": "https://arxiv.org/abs/2403.04626",
    "authors": [
      "Lei Li",
      "Tianfang Zhang",
      "Xinglin Zhang",
      "Jiaqi Liu",
      "Bingqi Ma",
      "Yan Luo",
      "Tao Chen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2008.10796",
    "title": "Deep Variational Network Toward Blind Image Restoration",
    "abstract": " Comments: Accepted by TPAMI@2024. Code: this https URL ",
    "url": "https://arxiv.org/abs/2008.10796",
    "authors": [
      "Zongsheng Yue",
      "Hongwei Yong",
      "Qian Zhao",
      "Lei Zhang",
      "Deyu Meng",
      "Kwan-Yen K. Wong"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2011.00264",
    "title": "Playing With Friends -- The Importance of Social Play During the  COVID-19 Pandemic",
    "abstract": " Title: Playing With Friends -- The Importance of Social Play During the  COVID-19 Pandemic ",
    "url": "https://arxiv.org/abs/2011.00264",
    "authors": [
      "Sebastian Cmentowski",
      "Jens Krüger"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2011.14730",
    "title": "Isomorphism Testing for Graphs Excluding Small Topological Subgraphs",
    "abstract": " Comments: 42 pages, 3 figures, full version of a paper accepted at SODA 2022; second and third version improve the presentation of the results. arXiv admin note: text overlap with arXiv:2004.07671 ",
    "url": "https://arxiv.org/abs/2011.14730",
    "authors": [
      "Daniel Neuen"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2208.07581",
    "title": "Regression modelling of spatiotemporal extreme U.S. wildfires via  partially-interpretable neural networks",
    "abstract": " Title: Regression modelling of spatiotemporal extreme U.S. wildfires via  partially-interpretable neural networks ",
    "url": "https://arxiv.org/abs/2208.07581",
    "authors": [
      "Jordan Richards",
      "Raphaël Huser"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2211.09510",
    "title": "Self-supervised Trajectory Representation Learning with Temporal  Regularities and Travel Semantics",
    "abstract": " Comments: 13 pages, 10 figures, Accepted by ICDE 2023 ",
    "url": "https://arxiv.org/abs/2211.09510",
    "authors": [
      "Jiawei Jiang",
      "Dayan Pan",
      "Houxing Ren",
      "Xiaohan Jiang",
      "Chao Li",
      "Jingyuan Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.01551",
    "title": "Quantify the Causes of Causal Emergence: Critical Conditions of  Uncertainty and Asymmetry in Causal Structure",
    "abstract": " Comments: 18 pages, 14 figures ",
    "url": "https://arxiv.org/abs/2212.01551",
    "authors": [
      "Liye Jia",
      "Fengyufan Yang",
      "Ka Lok Man",
      "Erick Purwanto",
      "Sheng-Uei Guan",
      "Jeremy Smith",
      "Yutao Yue"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2301.03196",
    "title": "Near-optimal stochastic MIMO signal detection with a mixture of  t-distribution prior",
    "abstract": " Comments: Published in the 2023 IEEE Global Communications Conference (GLOBECOM) ",
    "url": "https://arxiv.org/abs/2301.03196",
    "authors": [
      "Junichiro Hagiwara",
      "Kazushi Matsumura",
      "Hiroki Asumi",
      "Yukiko Kasuga",
      "Toshihiko Nishimura",
      "Takanori Sato",
      "Yasutaka Ogawa",
      "Takeo Ohgane"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2301.07945",
    "title": "PDFormer: Propagation Delay-Aware Dynamic Long-Range Transformer for  Traffic Flow Prediction",
    "abstract": " Comments: 9 pages, 5 figures, Accepted by AAAI2023 ",
    "url": "https://arxiv.org/abs/2301.07945",
    "authors": [
      "Jiawei Jiang",
      "Chengkai Han",
      "Wayne Xin Zhao",
      "Jingyuan Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.10774",
    "title": "RDesign: Hierarchical Data-efficient Representation Learning for  Tertiary Structure-based RNA Design",
    "abstract": " Comments: 30 pages, 28 figures, 16 tables ",
    "url": "https://arxiv.org/abs/2301.10774",
    "authors": [
      "Cheng Tan",
      "Yijie Zhang",
      "Zhangyang Gao",
      "Bozhen Hu",
      "Siyuan Li",
      "Zicheng Liu",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.13368",
    "title": "Misspecification-robust Sequential Neural Likelihood for  Simulation-based Inference",
    "abstract": " Title: Misspecification-robust Sequential Neural Likelihood for  Simulation-based Inference ",
    "url": "https://arxiv.org/abs/2301.13368",
    "authors": [
      "Ryan P. Kelly",
      "David J. Nott",
      "David T. Frazier",
      "David J. Warne",
      "Chris Drovandi"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2303.06321",
    "title": "Finding large counterexamples by selectively exploring the Pachner graph",
    "abstract": " Comments: 37 pages, 28 figures. A short version appeared in the proceedings for SoCG 2023; this full version contains some new results that do not appear in the SoCG version. v2: Minor corrections in sections 3.1 and 3.2, and updates to exposition ",
    "url": "https://arxiv.org/abs/2303.06321",
    "authors": [
      "Benjamin A. Burton",
      "Alexander He"
    ],
    "subjectives": [
      "Geometric Topology (math.GT)",
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2304.00742",
    "title": "Counting the minimum number of arcs in an oriented graph having weak  diameter 2",
    "abstract": " Title: Counting the minimum number of arcs in an oriented graph having weak  diameter 2 ",
    "url": "https://arxiv.org/abs/2304.00742",
    "authors": [
      "Sandip Das",
      "Koushik Kumar Dey",
      "Pavan P D",
      "Sagnik Sen"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2304.03501",
    "title": "Continuous Input Embedding Size Search For Recommender Systems",
    "abstract": " Comments: To appear in SIGIR'23 ",
    "url": "https://arxiv.org/abs/2304.03501",
    "authors": [
      "Yunke Qu",
      "Tong Chen",
      "Xiangyu Zhao",
      "Lizhen Cui",
      "Kai Zheng",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2305.05738",
    "title": "DOCTOR: A Multi-Disease Detection Continual Learning Framework Based on  Wearable Medical Sensors",
    "abstract": " Comments: 36 pages, 13 figures. This work has been submitted to the ACM for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2305.05738",
    "authors": [
      "Chia-Hao Li",
      "Niraj K. Jha"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Human-Computer Interaction (cs.HC)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.19523",
    "title": "Harnessing Explanations: LLM-to-LM Interpreter for Enhanced  Text-Attributed Graph Representation Learning",
    "abstract": " Comments: In Proceedings of ICLR 2024 ",
    "url": "https://arxiv.org/abs/2305.19523",
    "authors": [
      "Xiaoxin He",
      "Xavier Bresson",
      "Thomas Laurent",
      "Adam Perold",
      "Yann LeCun",
      "Bryan Hooi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.12679",
    "title": "Constructing Colloquial Dataset for Persian Sentiment Analysis of Social  Microblogs",
    "abstract": " Title: Constructing Colloquial Dataset for Persian Sentiment Analysis of Social  Microblogs ",
    "url": "https://arxiv.org/abs/2306.12679",
    "authors": [
      "Mojtaba Mazoochi",
      "Leila Rabiei",
      "Farzaneh Rahmani",
      "Zeinab Rajabi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.16384",
    "title": "Accelerating Sampling and Aggregation Operations in GNN Frameworks with  GPU Initiated Direct Storage Accesses",
    "abstract": " Comments: Under Submission. Source code: this https URL ",
    "url": "https://arxiv.org/abs/2306.16384",
    "authors": [
      "Jeongmin Brian Park",
      "Vikram Sharma Mailthody",
      "Zaid Qureshi",
      "Wen-mei Hwu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Artificial Intelligence (cs.AI)",
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.04001",
    "title": "Polynomial Width is Sufficient for Set Representation with  High-dimensional Features",
    "abstract": " Comments: ICLR 2024 ",
    "url": "https://arxiv.org/abs/2307.04001",
    "authors": [
      "Peihao Wang",
      "Shenghao Yang",
      "Shu Li",
      "Zhangyang Wang",
      "Pan Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.05318",
    "title": "Predicting small molecules solubilities on endpoint devices using deep  ensemble neural networks",
    "abstract": " Title: Predicting small molecules solubilities on endpoint devices using deep  ensemble neural networks ",
    "url": "https://arxiv.org/abs/2307.05318",
    "authors": [
      "Mayk Caldas Ramos",
      "Andrew D. White"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.02851",
    "title": "Generative Adversarial Networks for Stain Normalisation in  Histopathology",
    "abstract": " Comments: Updated to add link to full publication at this https URL ",
    "url": "https://arxiv.org/abs/2308.02851",
    "authors": [
      "Jack Breen",
      "Kieran Zucker",
      "Katie Allen",
      "Nishant Ravikumar",
      "Nicolas M. Orsi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.12899",
    "title": "Unified Data Management and Comprehensive Performance Evaluation for  Urban Spatial-Temporal Prediction [Experiment, Analysis & Benchmark]",
    "abstract": " Comments: 14 pages, 3 figures, VLDB under review ",
    "url": "https://arxiv.org/abs/2308.12899",
    "authors": [
      "Jiawei Jiang",
      "Chengkai Han",
      "Wayne Xin Zhao",
      "Jingyuan Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.13662",
    "title": "REFT: Resource-Efficient Federated Training Framework for Heterogeneous  and Resource-Constrained Environments",
    "abstract": " Comments: 10 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2308.13662",
    "authors": [
      "Humaid Ahmed Desai",
      "Amr Hilal",
      "Hoda Eldardiry"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2309.00513",
    "title": "A normative approach to radicalization in social networks",
    "abstract": " Comments: 22 pages, 8 figures, 1 supplementary material ",
    "url": "https://arxiv.org/abs/2309.00513",
    "authors": [
      "Vincent Bouttier",
      "Salomé Leclercq",
      "Renaud Jardri",
      "Sophie Deneve"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2309.04475",
    "title": "Crystal Structure Prediction by Joint Equivariant Diffusion",
    "abstract": " Comments: NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2309.04475",
    "authors": [
      "Rui Jiao",
      "Wenbing Huang",
      "Peijia Lin",
      "Jiaqi Han",
      "Pin Chen",
      "Yutong Lu",
      "Yang Liu"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.05955",
    "title": "Trust-Region Neural Moving Horizon Estimation for Robots",
    "abstract": " Comments: This paper (not the final version) has been accepted for presentation at the ICRA2024 ",
    "url": "https://arxiv.org/abs/2309.05955",
    "authors": [
      "Bingheng Wang",
      "Xuyang Chen",
      "Lin Zhao"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2309.06692",
    "title": "Tackling the Non-IID Issue in Heterogeneous Federated Learning by  Gradient Harmonization",
    "abstract": " Title: Tackling the Non-IID Issue in Heterogeneous Federated Learning by  Gradient Harmonization ",
    "url": "https://arxiv.org/abs/2309.06692",
    "authors": [
      "Xinyu Zhang",
      "Weiyu Sun",
      "Ying Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.07736",
    "title": "RIS-Assisted Wireless Link Signatures for Specific Emitter  Identification",
    "abstract": " Title: RIS-Assisted Wireless Link Signatures for Specific Emitter  Identification ",
    "url": "https://arxiv.org/abs/2309.07736",
    "authors": [
      "Ning Gao",
      "Shuchen Meng",
      "Cen Li",
      "Shengguo Meng",
      "Wankai Tang",
      "Shi Jin",
      "Michail Matthaiou"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2309.11143",
    "title": "CoT-BERT: Enhancing Unsupervised Sentence Representation through  Chain-of-Thought",
    "abstract": " Comments: Work in Progress ",
    "url": "https://arxiv.org/abs/2309.11143",
    "authors": [
      "Bowen Zhang",
      "Kehua Chang",
      "Chunping Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.14595",
    "title": "Neural Informed RRT*: Learning-based Path Planning with Point Cloud  State Representations under Admissible Ellipsoidal Constraints",
    "abstract": " Comments: 7 pages, 6 figures. Accepted by ICRA 2024 ",
    "url": "https://arxiv.org/abs/2309.14595",
    "authors": [
      "Zhe Huang",
      "Hongyu Chen",
      "John Pohovey",
      "Katherine Driggs-Campbell"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.16347",
    "title": "Intrinsic Language-Guided Exploration for Complex Long-Horizon Robotic  Manipulation Tasks",
    "abstract": " Comments: Accepted at the International Conference on Robotics and Automation (ICRA), 2024. The manuscript consists of 10 pages and 6 figures ",
    "url": "https://arxiv.org/abs/2309.16347",
    "authors": [
      "Eleftherios Triantafyllidis",
      "Filippos Christianos",
      "Zhibin Li"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.17182",
    "title": "RECOMBINER: Robust and Enhanced Compression with Bayesian Implicit  Neural Representations",
    "abstract": " Comments: ICLR 2024 camera-ready version; 27 pages, 17 figures ",
    "url": "https://arxiv.org/abs/2309.17182",
    "authors": [
      "Jiajun He",
      "Gergely Flamich",
      "Zongyu Guo",
      "José Miguel Hernández-Lobato"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.01046",
    "title": "Epistemic integration and social segregation of AI in neuroscience",
    "abstract": " Title: Epistemic integration and social segregation of AI in neuroscience ",
    "url": "https://arxiv.org/abs/2310.01046",
    "authors": [
      "Sylvain Fontaine",
      "Floriana Gargiulo",
      "Michel Dubois",
      "Paola Tubaro"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2310.02396",
    "title": "Implicit regularization of multi-task learning and finetuning in  overparameterized neural networks",
    "abstract": " Title: Implicit regularization of multi-task learning and finetuning in  overparameterized neural networks ",
    "url": "https://arxiv.org/abs/2310.02396",
    "authors": [
      "Jack W. Lindsey",
      "Samuel Lippl"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.02611",
    "title": "Analyzing and Improving Optimal-Transport-based Adversarial Networks",
    "abstract": " Comments: 27 pages, 17 figures ",
    "url": "https://arxiv.org/abs/2310.02611",
    "authors": [
      "Jaemoo Choi",
      "Jaewoong Choi",
      "Myungjoo Kang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.02612",
    "title": "Top-k contrast order-preserving pattern mining",
    "abstract": " Title: Top-k contrast order-preserving pattern mining ",
    "url": "https://arxiv.org/abs/2310.02612",
    "authors": [
      "Youxi Wu",
      "Yufei Meng",
      "Yan Li",
      "Lei Guo",
      "Xingquan Zhu",
      "Philippe Fournier-Viger",
      "Xindong Wu"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2310.02772",
    "title": "Spike Accumulation Forwarding for Effective Training of Spiking Neural  Networks",
    "abstract": " Comments: 12 pages, 5 figures, Appendix:8 pages, 2 figures, v5:We added experimental results and considered the situation the SNN have a feedforward or feedback connection ",
    "url": "https://arxiv.org/abs/2310.02772",
    "authors": [
      "Ryuji Saiin",
      "Tomoya Shirakawa",
      "Sota Yoshihara",
      "Yoshihide Sawada",
      "Hiroyuki Kusumoto"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.05483",
    "title": "Geometry-Guided Ray Augmentation for Neural Surface Reconstruction with  Sparse Views",
    "abstract": " Comments: This paper have some major revisions, will be resubmitted soon ",
    "url": "https://arxiv.org/abs/2310.05483",
    "authors": [
      "Jiawei Yao",
      "Chen Wang",
      "Tong Wu",
      "Chuming Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.07229",
    "title": "ProFSA: Self-supervised Pocket Pretraining via Protein  Fragment-Surroundings Alignment",
    "abstract": " Title: ProFSA: Self-supervised Pocket Pretraining via Protein  Fragment-Surroundings Alignment ",
    "url": "https://arxiv.org/abs/2310.07229",
    "authors": [
      "Bowen Gao",
      "Yinjun Jia",
      "Yuanle Mo",
      "Yuyan Ni",
      "Weiying Ma",
      "Zhiming Ma",
      "Yanyan Lan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.07504",
    "title": "PtychoDV: Vision Transformer-Based Deep Unrolling Network for  Ptychographic Image Reconstruction",
    "abstract": " Title: PtychoDV: Vision Transformer-Based Deep Unrolling Network for  Ptychographic Image Reconstruction ",
    "url": "https://arxiv.org/abs/2310.07504",
    "authors": [
      "Weijie Gan",
      "Qiuchen Zhai",
      "Michael Thompson McCann",
      "Cristina Garcia Cardona",
      "Ulugbek S. Kamilov",
      "Brendt Wohlberg"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.07793",
    "title": "GenTKG: Generative Forecasting on Temporal Knowledge Graph",
    "abstract": " Comments: 14 pages, Spotlight of Temporal Graph Learning @ NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2310.07793",
    "authors": [
      "Ruotong Liao",
      "Xu Jia",
      "Yunpu Ma",
      "Yangzhe Li",
      "Volker Tresp"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.10316",
    "title": "Spectral representation of two-sided signals from $\\ell_\\infty$ and  applications to signal processing",
    "abstract": " Title: Spectral representation of two-sided signals from $\\ell_\\infty$ and  applications to signal processing ",
    "url": "https://arxiv.org/abs/2310.10316",
    "authors": [
      "Nikolai Dokuchaev"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Functional Analysis (math.FA)"
    ]
  },
  {
    "id": "arXiv:2310.10374",
    "title": "Multi-Factor Spatio-Temporal Prediction based on Graph Decomposition  Learning",
    "abstract": " Title: Multi-Factor Spatio-Temporal Prediction based on Graph Decomposition  Learning ",
    "url": "https://arxiv.org/abs/2310.10374",
    "authors": [
      "Jiahao Ji",
      "Jingyuan Wang",
      "Yu Mou",
      "Cheng Long"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.14884",
    "title": "Budgeted Embedding Table For Recommender Systems",
    "abstract": " Comments: Accepted by WSDM 2024 ",
    "url": "https://arxiv.org/abs/2310.14884",
    "authors": [
      "Yunke Qu",
      "Tong Chen",
      "Quoc Viet Hung Nguyen",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2310.20091",
    "title": "Density-based User Representation using Gaussian Process Regression for  Multi-interest Personalized Retrieval",
    "abstract": " Comments: 15 pages ",
    "url": "https://arxiv.org/abs/2310.20091",
    "authors": [
      "Haolun Wu",
      "Ofer Meshi",
      "Masrour Zoghi",
      "Fernando Diaz",
      "Xue Liu",
      "Craig Boutilier",
      "Maryam Karimzadehgan"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2311.09939",
    "title": "RED-DOT: Multimodal Fact-checking via Relevant Evidence Detection",
    "abstract": " Title: RED-DOT: Multimodal Fact-checking via Relevant Evidence Detection ",
    "url": "https://arxiv.org/abs/2311.09939",
    "authors": [
      "Stefanos-Iordanis Papadopoulos",
      "Christos Koutlis",
      "Symeon Papadopoulos",
      "Panagiotis C. Petrantonakis"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.12397",
    "title": "PatchCraft: Exploring Texture Patch for Efficient AI-generated Image  Detection",
    "abstract": " Comments: Our project: this https URL ",
    "url": "https://arxiv.org/abs/2311.12397",
    "authors": [
      "Nan Zhong",
      "Yiran Xu",
      "Sheng Li",
      "Zhenxing Qian",
      "Xinpeng Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.12688",
    "title": "On the Out-of-Distribution Coverage of Combining Split Conformal  Prediction and Bayesian Deep Learning",
    "abstract": " Comments: 26 pages, 18 figures ",
    "url": "https://arxiv.org/abs/2311.12688",
    "authors": [
      "Paul Scemama",
      "Ariel Kapusta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.12943",
    "title": "InteRACT: Transformer Models for Human Intent Prediction Conditioned on  Robot Actions",
    "abstract": " Comments: We release our code and datasets at this https URL ",
    "url": "https://arxiv.org/abs/2311.12943",
    "authors": [
      "Kushal Kedia",
      "Atiksh Bhardwaj",
      "Prithwish Dan",
      "Sanjiban Choudhury"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2311.15783",
    "title": "Hypernetworks for Generalizable BRDF Representation",
    "abstract": " Title: Hypernetworks for Generalizable BRDF Representation ",
    "url": "https://arxiv.org/abs/2311.15783",
    "authors": [
      "Fazilet Gokbudak",
      "Alejandro Sztrajman",
      "Chenliang Zhou",
      "Fangcheng Zhong",
      "Rafal Mantiuk",
      "Cengiz Oztireli"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2311.17093",
    "title": "Efficient Out-of-Distribution Detection with Prototypical  Semi-Supervised Learning and Foundation Models",
    "abstract": " Title: Efficient Out-of-Distribution Detection with Prototypical  Semi-Supervised Learning and Foundation Models ",
    "url": "https://arxiv.org/abs/2311.17093",
    "authors": [
      "Evelyn Mannix",
      "Howard Bondell"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.02625",
    "title": "Diffusion Noise Feature: Accurate and Fast Generated Image Detection",
    "abstract": " Title: Diffusion Noise Feature: Accurate and Fast Generated Image Detection ",
    "url": "https://arxiv.org/abs/2312.02625",
    "authors": [
      "Yichi Zhang",
      "Xiaogang Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.03618",
    "title": "Beyond discounted returns: Robust Markov decision processes with average  and Blackwell optimality",
    "abstract": " Title: Beyond discounted returns: Robust Markov decision processes with average  and Blackwell optimality ",
    "url": "https://arxiv.org/abs/2312.03618",
    "authors": [
      "Julien Grand-Clement",
      "Marek Petrik",
      "Nicolas Vieille"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2312.08859",
    "title": "BVI-Artefact: An Artefact Detection Benchmark Dataset for Streamed  Videos",
    "abstract": " Comments: The paper has been accepted by Picture Coding Symposium (PCS) 2024 ",
    "url": "https://arxiv.org/abs/2312.08859",
    "authors": [
      "Chen Feng",
      "Duolikun Danier",
      "Fan Zhang",
      "Alex Mackin",
      "Andy Collins",
      "David Bull"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.11126",
    "title": "Harnessing Inherent Noises for Privacy Preservation in Quantum Machine  Learning",
    "abstract": " Comments: 6 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2312.11126",
    "authors": [
      "Keyi Ju",
      "Xiaoqi Qin",
      "Hui Zhong",
      "Xinyue Zhang",
      "Miao Pan",
      "Baoling Liu"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.14625",
    "title": "Multi-Agent Reinforcement Learning for Assessing False-Data Injection  Attacks on Transportation Networks",
    "abstract": " Title: Multi-Agent Reinforcement Learning for Assessing False-Data Injection  Attacks on Transportation Networks ",
    "url": "https://arxiv.org/abs/2312.14625",
    "authors": [
      "Taha Eghtesad",
      "Sirui Li",
      "Yevgeniy Vorobeychik",
      "Aron Laszka"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.15583",
    "title": "ITEACNet: Inverted Teacher-studEnt seArch Conversation Network",
    "abstract": " Title: ITEACNet: Inverted Teacher-studEnt seArch Conversation Network ",
    "url": "https://arxiv.org/abs/2312.15583",
    "authors": [
      "Haiyang Sun",
      "Zheng Lian",
      "Chenglong Wang",
      "Kang Chen",
      "Licai Sun",
      "Bin Liu",
      "Jianhua Tao"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2401.03003",
    "title": "AST-T5: Structure-Aware Pretraining for Code Generation and  Understanding",
    "abstract": " Title: AST-T5: Structure-Aware Pretraining for Code Generation and  Understanding ",
    "url": "https://arxiv.org/abs/2401.03003",
    "authors": [
      "Linyuan Gong",
      "Mostafa Elhoushi",
      "Alvin Cheung"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.08180",
    "title": "Control-free and efficient integrated photonic neural networks via  hardware-aware training and pruning",
    "abstract": " Comments: 21 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2401.08180",
    "authors": [
      "Tengji Xu",
      "Weipeng Zhang",
      "Jiawei Zhang",
      "Zeyu Luo",
      "Qiarong Xiao",
      "Benshan Wang",
      "Mingcheng Luo",
      "Xingyuan Xu",
      "Bhavin J. Shastri",
      "Paul R. Prucnal",
      "Chaoran Huang"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Emerging Technologies (cs.ET)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:2401.10220",
    "title": "AutoFT: Learning an Objective for Robust Fine-Tuning",
    "abstract": " Comments: 18 pages ",
    "url": "https://arxiv.org/abs/2401.10220",
    "authors": [
      "Caroline Choi",
      "Yoonho Lee",
      "Annie Chen",
      "Allan Zhou",
      "Aditi Raghunathan",
      "Chelsea Finn"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.10712",
    "title": "Q&A Prompts: Discovering Rich Visual Clues through Mining  Question-Answer Prompts for VQA requiring Diverse World Knowledge",
    "abstract": " Title: Q&A Prompts: Discovering Rich Visual Clues through Mining  Question-Answer Prompts for VQA requiring Diverse World Knowledge ",
    "url": "https://arxiv.org/abs/2401.10712",
    "authors": [
      "Haibi Wang",
      "Weifeng Ge"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.12564",
    "title": "Graph Contrastive Invariant Learning from the Causal Perspective",
    "abstract": " Title: Graph Contrastive Invariant Learning from the Causal Perspective ",
    "url": "https://arxiv.org/abs/2401.12564",
    "authors": [
      "Yanhu Mo",
      "Xiao Wang",
      "Shaohua Fan",
      "Chuan Shi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.16235",
    "title": "Player Pressure Map -- A Novel Representation of Pressure in Soccer for  Evaluating Player Performance in Different Game Contexts",
    "abstract": " Title: Player Pressure Map -- A Novel Representation of Pressure in Soccer for  Evaluating Player Performance in Different Game Contexts ",
    "url": "https://arxiv.org/abs/2401.16235",
    "authors": [
      "Chaoyi Gu",
      "Jiaming Na",
      "Yisheng Pei",
      "Varuna De Silva"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2401.17435",
    "title": "Can Large Language Models Replace Economic Choice Prediction Labs?",
    "abstract": " Title: Can Large Language Models Replace Economic Choice Prediction Labs? ",
    "url": "https://arxiv.org/abs/2401.17435",
    "authors": [
      "Eilam Shapira",
      "Omer Madmon",
      "Roi Reichart",
      "Moshe Tennenholtz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Science and Game Theory (cs.GT)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2402.09565",
    "title": "Graph-Skeleton: ~1% Nodes are Sufficient to Represent Billion-Scale  Graph",
    "abstract": " Comments: 21 pages, 11 figures, In Proceedings of the ACM Web Conference 2024 (WWW'24) ",
    "url": "https://arxiv.org/abs/2402.09565",
    "authors": [
      "Linfeng Cao",
      "Haoran Deng",
      "Yang Yang",
      "Chunping Wang",
      "Lei Chen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.09707",
    "title": "On the adversarial robustness of Locality-Sensitive Hashing in Hamming  space",
    "abstract": " Title: On the adversarial robustness of Locality-Sensitive Hashing in Hamming  space ",
    "url": "https://arxiv.org/abs/2402.09707",
    "authors": [
      "Michael Kapralov",
      "Mikhail Makarov",
      "Christian Sohler"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2402.16374",
    "title": "Graph Learning under Distribution Shifts: A Comprehensive Survey on  Domain Adaptation, Out-of-distribution, and Continual Learning",
    "abstract": " Title: Graph Learning under Distribution Shifts: A Comprehensive Survey on  Domain Adaptation, Out-of-distribution, and Continual Learning ",
    "url": "https://arxiv.org/abs/2402.16374",
    "authors": [
      "Man Wu",
      "Xin Zheng",
      "Qin Zhang",
      "Xiao Shen",
      "Xiong Luo",
      "Xingquan Zhu",
      "Shirui Pan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2402.16896",
    "title": "On Trojan Signatures in Large Language Models of Code",
    "abstract": " Comments: This work has been accepted at the International Conference on Learning Representations 2024 Workshop on Secure and Trustworthy Large Language Models, SeT LLM @ ICLR 2024 (Vienna, Austria) ",
    "url": "https://arxiv.org/abs/2402.16896",
    "authors": [
      "Aftab Hussain",
      "Md Rafiqul Islam Rabin",
      "Mohammad Amin Alipour"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2402.16899",
    "title": "A priori Estimates for Deep Residual Network in Continuous-time  Reinforcement Learning",
    "abstract": " Title: A priori Estimates for Deep Residual Network in Continuous-time  Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2402.16899",
    "authors": [
      "Shuyu Yin",
      "Qixuan Zhou",
      "Fei Wen",
      "Tao Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.18470",
    "title": "A Higher-Order Lens for Social Systems",
    "abstract": " Title: A Higher-Order Lens for Social Systems ",
    "url": "https://arxiv.org/abs/2402.18470",
    "authors": [
      "Giulia Preti",
      "Adriano Fazzone",
      "Giovanni Petri",
      "Gianmarco De Francisci Morales"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2403.00170",
    "title": "AlloyASG: Alloy Predicate Code Representation as a Compact Structurally  Balanced Graph",
    "abstract": " Title: AlloyASG: Alloy Predicate Code Representation as a Compact Structurally  Balanced Graph ",
    "url": "https://arxiv.org/abs/2403.00170",
    "authors": [
      "Guanxuan Wu",
      "Allison Sullivan"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2403.00326",
    "title": "DAMSDet: Dynamic Adaptive Multispectral Detection Transformer with  Competitive Query Selection and Adaptive Feature Fusion",
    "abstract": " Title: DAMSDet: Dynamic Adaptive Multispectral Detection Transformer with  Competitive Query Selection and Adaptive Feature Fusion ",
    "url": "https://arxiv.org/abs/2403.00326",
    "authors": [
      "Junjie Guo",
      "Chenqiang Gao",
      "Fangcen Liu",
      "Deyu Meng",
      "Xinbo Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.01795",
    "title": "RankED: Addressing Imbalance and Uncertainty in Edge Detection Using  Ranking-based Losses",
    "abstract": " Comments: accepted to CVPR 2024 ",
    "url": "https://arxiv.org/abs/2403.01795",
    "authors": [
      "Bedrettin Cetinkaya",
      "Sinan Kalkan",
      "Emre Akbas"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.02472",
    "title": "OffLanDat: A Community Based Implicit Offensive Language Dataset  Generated by Large Language Model Through Prompt Engineering",
    "abstract": " Title: OffLanDat: A Community Based Implicit Offensive Language Dataset  Generated by Large Language Model Through Prompt Engineering ",
    "url": "https://arxiv.org/abs/2403.02472",
    "authors": [
      "Amit Das",
      "Mostafa Rahgouy",
      "Dongji Feng",
      "Zheng Zhang",
      "Tathagata Bhattacharya",
      "Nilanjana Raychawdhary",
      "Mary Sandage",
      "Lauramarie Pope",
      "Gerry Dozier",
      "Cheryl Seals"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.02639",
    "title": "False Positive Sampling-based Data Augmentation for Enhanced 3D Object  Detection Accuracy",
    "abstract": " Comments: There was an error in the experiment settings ",
    "url": "https://arxiv.org/abs/2403.02639",
    "authors": [
      "Jiyong Oh",
      "Junhaeng Lee",
      "Woongchan Byun",
      "Minsang Kong",
      "Sang Hun Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03205",
    "title": "Finding Super-spreaders in Network Cascades",
    "abstract": " Comments: 31 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2403.03205",
    "authors": [
      "Elchanan Mossel",
      "Anirudh Sridhar"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Information Theory (cs.IT)",
      "Social and Information Networks (cs.SI)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2403.03223",
    "title": "Exact Enforcement of Temporal Continuity in Sequential Physics-Informed  Neural Networks",
    "abstract": " Comments: 30 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2403.03223",
    "authors": [
      "Pratanu Roy",
      "Stephen Castonguay"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2403.03456",
    "title": "DLP-GAN: learning to draw modern Chinese landscape photos with  generative adversarial network",
    "abstract": " Comments: Corrected typos ",
    "url": "https://arxiv.org/abs/2403.03456",
    "authors": [
      "Xiangquan Gui",
      "Binxuan Zhang",
      "Li Li",
      "Yi Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03576",
    "title": "Unsupervised Incremental Learning with Dual Concept Drift Detection for  Identifying Anomalous Sequences",
    "abstract": " Comments: submitted to IJCNN2024,under review ",
    "url": "https://arxiv.org/abs/2403.03576",
    "authors": [
      "Jin Li",
      "Kleanthis Malialis",
      "Marios M. Polycarpou"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2403.03721",
    "title": "CMDA: Cross-Modal and Domain Adversarial Adaptation for LiDAR-Based 3D  Object Detection",
    "abstract": " Comments: Accepted by AAAI 2024 ",
    "url": "https://arxiv.org/abs/2403.03721",
    "authors": [
      "Gyusam Chang",
      "Wonseok Roh",
      "Sujin Jang",
      "Dongwook Lee",
      "Daehyun Ji",
      "Gyeongrok Oh",
      "Jinsun Park",
      "Jinkyu Kim",
      "Sangpil Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]