[
  {
    "id": "arXiv:2304.08500",
    "title": "A comparison between Recurrent Neural Networks and classical machine  learning approaches In Laser induced breakdown spectroscopy",
    "abstract": "Recurrent Neural Networks are classes of Artificial Neural Networks that establish connections between different nodes form a directed or undirected graph for temporal dynamical analysis. In this research, the laser induced breakdown spectroscopy (LIBS) technique is used for quantitative analysis of aluminum alloys by different Recurrent Neural Network (RNN) architecture. The fundamental harmonic (1064 nm) of a nanosecond Nd:YAG laser pulse is employed to generate the LIBS plasma for the prediction of constituent concentrations of the aluminum standard samples. Here, Recurrent Neural Networks based on different networks, such as Long Short Term Memory (LSTM), Gated Recurrent Unit (GRU), Simple Recurrent Neural Network (Simple RNN), and as well as Recurrent Convolutional Networks comprising of Conv-SimpleRNN, Conv-LSTM and Conv-GRU are utilized for concentration prediction. Then a comparison is performed among prediction by classical machine learning methods of support vector regressor (SVR), the Multi Layer Perceptron (MLP), Decision Tree algorithm, Gradient Boosting Regression (GBR), Random Forest Regression (RFR), Linear Regression, and k-Nearest Neighbor (KNN) algorithm. Results showed that the machine learning tools based on Convolutional Recurrent Networks had the best efficiencies in prediction of the most of the elements among other multivariate methods. ",
    "url": "https://arxiv.org/abs/2304.08500",
    "authors": [
      "Fatemeh Rezaei",
      "Pouriya Khaliliyan",
      "Mohsen Rezaei",
      "Parvin Karimi",
      "Behnam Ashrafkhani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08502",
    "title": "CyFormer: Accurate State-of-Health Prediction of Lithium-Ion Batteries  via Cyclic Attention",
    "abstract": "Predicting the State-of-Health (SoH) of lithium-ion batteries is a fundamental task of battery management systems on electric vehicles. It aims at estimating future SoH based on historical aging data. Most existing deep learning methods rely on filter-based feature extractors (e.g., CNN or Kalman filters) and recurrent time sequence models. Though efficient, they generally ignore cyclic features and the domain gap between training and testing batteries. To address this problem, we present CyFormer, a transformer-based cyclic time sequence model for SoH prediction. Instead of the conventional CNN-RNN structure, we adopt an encoder-decoder architecture. In the encoder, row-wise and column-wise attention blocks effectively capture intra-cycle and inter-cycle connections and extract cyclic features. In the decoder, the SoH queries cross-attend to these features to form the final predictions. We further utilize a transfer learning strategy to narrow the domain gap between the training and testing set. To be specific, we use fine-tuning to shift the model to a target working condition. Finally, we made our model more efficient by pruning. The experiment shows that our method attains an MAE of 0.75\\% with only 10\\% data for fine-tuning on a testing battery, surpassing prior methods by a large margin. Effective and robust, our method provides a potential solution for all cyclic time sequence prediction tasks. ",
    "url": "https://arxiv.org/abs/2304.08502",
    "authors": [
      "Zhiqiang Nie",
      "Jiankun Zhao",
      "Qicheng Li",
      "Yong Qin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.08538",
    "title": "Robust Control Barrier Functions with Uncertainty Estimation",
    "abstract": "This paper proposes a safety controller for control-affine nonlinear systems with unmodelled dynamics and disturbances to improve closed-loop robustness. Uncertainty estimation-based control barrier functions (CBFs) are utilized to ensure robust safety in the presence of model uncertainties, which may depend on control input and states. We present a new uncertainty/disturbance estimator with theoretical upper bounds on estimation error and estimated outputs, which are used to ensure robust safety by formulating a convex optimization problem using a high-order CBF. The possibly unsafe nominal feedback controller is augmented with the proposed estimator in two frameworks (1) an uncertainty compensator and (2) a robustifying reformulation of CBF constraint with respect to the estimator outputs. The former scheme ensures safety with performance improvement by adaptively rejecting the matched uncertainty. The second method uses uncertainty estimation to robustify higher-order CBFs for safety-critical control. The proposed methods are demonstrated in simulations of an uncertain adaptive cruise control problem and a multirotor obstacle avoidance situation. ",
    "url": "https://arxiv.org/abs/2304.08538",
    "authors": [
      "Ersin Daş",
      "Skylar X. Wei",
      "Joel W. Burdick"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.08566",
    "title": "GrOVe: Ownership Verification of Graph Neural Networks using Embeddings",
    "abstract": "Graph neural networks (GNNs) have emerged as a state-of-the-art approach to model and draw inferences from large scale graph-structured data in various application settings such as social networking. The primary goal of a GNN is to learn an embedding for each graph node in a dataset that encodes both the node features and the local graph structure around the node. Embeddings generated by a GNN for a graph node are unique to that GNN. Prior work has shown that GNNs are prone to model extraction attacks. Model extraction attacks and defenses have been explored extensively in other non-graph settings. While detecting or preventing model extraction appears to be difficult, deterring them via effective ownership verification techniques offer a potential defense. In non-graph settings, fingerprinting models, or the data used to build them, have shown to be a promising approach toward ownership verification. We present GrOVe, a state-of-the-art GNN model fingerprinting scheme that, given a target model and a suspect model, can reliably determine if the suspect model was trained independently of the target model or if it is a surrogate of the target model obtained via model extraction. We show that GrOVe can distinguish between surrogate and independent models even when the independent model uses the same training dataset and architecture as the original target model. Using six benchmark datasets and three model architectures, we show that consistently achieves low false-positive and false-negative rates. We demonstrate that is robust against known fingerprint evasion techniques while remaining computationally efficient. ",
    "url": "https://arxiv.org/abs/2304.08566",
    "authors": [
      "Asim Waheed",
      "Vasisht Duddu",
      "N. Asokan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.08571",
    "title": "Optimal Robust Network Design: Formulations and Algorithms for  Maximizing Algebraic Connectivity",
    "abstract": "This paper focuses on the design of edge-weighted networks, whose robustness is characterized by maximizing algebraic connectivity, or the smallest non-zero eigenvalue of the Laplacian matrix. This problem is motivated by the application of cooperative localization for accurately estimating positions of autonomous vehicles by choosing a set of relative position measurements and establishing associated communication links. We also examine an associated problem where every robot is limited by payload, budget, and communication to pick no more than a specified number of relative position measurements. The basic underlying formulation for these problems is nonlinear and is known to be NP-hard. We solve this network design problem by formulating it as a mixed-integer semi-definite program (MISDP) and reformulating it into a mixed-integer linear program to obtain optimal solutions using cutting plane algorithms. We propose a novel upper-bounding algorithm based on the hierarchy of principal minor characterization of positive semi-definite matrices. We further discuss a degree-constrained lower bounding formulation, inspired by robust network structures. In addition, we propose a maximum-cost heuristic with low computational complexity to find high-quality feasible solutions. We show extensive computational results corroborating our proposed methods. ",
    "url": "https://arxiv.org/abs/2304.08571",
    "authors": [
      "Neelkamal Somisetty",
      "Harsha Nagarajan",
      "Swaroop Darbha"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.08581",
    "title": "Graph Sparsification by Approximate Matrix Multiplication",
    "abstract": "Graphs arising in statistical problems, signal processing, large networks, combinatorial optimization, and data analysis are often dense, which causes both computational and storage bottlenecks. One way of \\textit{sparsifying} a \\textit{weighted} graph, while sharing the same vertices as the original graph but reducing the number of edges, is through \\textit{spectral sparsification}. We study this problem through the perspective of RandNLA. Specifically, we utilize randomized matrix multiplication to give a clean and simple analysis of how sampling according to edge weights gives a spectral approximation to graph Laplacians. Through the $CR$-MM algorithm, we attain a simple and computationally efficient sparsifier whose resulting Laplacian estimate is unbiased and of minimum variance. Furthermore, we define a new notion of \\textit{additive spectral sparsifiers}, which has not been considered in the literature. ",
    "url": "https://arxiv.org/abs/2304.08581",
    "authors": [
      "Neophytos Charalambides",
      "Alfred O. Hero III"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)",
      "Signal Processing (eess.SP)",
      "Spectral Theory (math.SP)"
    ]
  },
  {
    "id": "arXiv:2304.08582",
    "title": "Researchers eye-view of sarcasm detection in social media textual  content",
    "abstract": "The enormous use of sarcastic text in all forms of communication in social media will have a physiological effect on target users. Each user has a different approach to misusing and recognising sarcasm. Sarcasm detection is difficult even for users, and this will depend on many things such as perspective, context, special symbols. So, that will be a challenging task for machines to differentiate sarcastic sentences from non-sarcastic sentences. There are no exact rules based on which model will accurately detect sarcasm from many text corpus in the current situation. So, one needs to focus on optimistic and forthcoming approaches in the sarcasm detection domain. This paper discusses various sarcasm detection techniques and concludes with some approaches, related datasets with optimal features, and the researcher's challenges. ",
    "url": "https://arxiv.org/abs/2304.08582",
    "authors": [
      "Swapnil Mane",
      "Vaibhav Khatavkar"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.08600",
    "title": "RS2G: Data-Driven Scene-Graph Extraction and Embedding for Robust  Autonomous Perception and Scenario Understanding",
    "abstract": "Human drivers naturally reason about interactions between road users to understand and safely navigate through traffic. Thus, developing autonomous vehicles necessitates the ability to mimic such knowledge and model interactions between road users to understand and navigate unpredictable, dynamic environments. However, since real-world scenarios often differ from training datasets, effectively modeling the behavior of various road users in an environment remains a significant research challenge. This reality necessitates models that generalize to a broad range of domains and explicitly model interactions between road users and the environment to improve scenario understanding. Graph learning methods address this problem by modeling interactions using graph representations of scenarios. However, existing methods cannot effectively transfer knowledge gained from the training domain to real-world scenarios. This constraint is caused by the domain-specific rules used for graph extraction that can vary in effectiveness across domains, limiting generalization ability. To address these limitations, we propose RoadScene2Graph (RS2G): a data-driven graph extraction and modeling approach that learns to extract the best graph representation of a road scene for solving autonomous scene understanding tasks. We show that RS2G enables better performance at subjective risk assessment than rule-based graph extraction methods and deep-learning-based models. RS2G also improves generalization and Sim2Real transfer learning, which denotes the ability to transfer knowledge gained from simulation datasets to unseen real-world scenarios. We also present ablation studies showing how RS2G produces a more useful graph representation for downstream classifiers. Finally, we show how RS2G can identify the relative importance of rule-based graph edges and enables intelligent graph sparsity tuning. ",
    "url": "https://arxiv.org/abs/2304.08600",
    "authors": [
      "Arnav Vaibhav Malawade",
      "Shih-Yuan Yu",
      "Junyao Wang",
      "Mohammad Abdullah Al Faruque"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08615",
    "title": "Revisiting Block-Diagonal SDP Relaxations for the Clique Number of the  Paley Graphs",
    "abstract": "This work addresses the block-diagonal semidefinite program (SDP) relaxations for the clique number of the Paley graphs. The size of the maximal clique (clique number) of a graph is a classic NP-complete problem; a Paley graph is a deterministic graph where two vertices are connected if their difference is a quadratic residue modulo certain prime powers. Improving the upper bound for the Paley graph clique number for odd prime powers is an open problem in combinatorics. Moreover, since quadratic residues exhibit pseudorandom properties, Paley graphs are related to the construction of deterministic restricted isometries, an open problem in compressed sensing and sparse recovery. Recent work provides evidence that the current upper bounds can be improved by the sum-of-squares (SOS) relaxations. In particular the bounds given by the SOS relaxations of degree 4 (SOS-4) are asymptotically growing at an order smaller than square root of the prime. However computations of SOS-4 become intractable with respect to large graphs. Gvozdenovic et al. introduced a more computationally efficient block-diagonal hierarchy of SDPs that refines the SOS hierarchy. They computed the values of these SDPs of degrees 2 and 3 (L2 and L3 respectively) for the Paley graph clique numbers associated with primes p less or equal to 809. These values bound from the above the values of the corresponding SOS-4 and SOS-6 relaxations respectively. We revisit these computations and determine the values of the L2 relaxation for larger p's. Our results provide additional numerical evidence that the L2 relaxations, and therefore also the SOS-4 relaxations, are asymptotically growing at an order smaller than the square root of p. ",
    "url": "https://arxiv.org/abs/2304.08615",
    "authors": [
      "Vladimir A. Kobzar",
      "Krishnan Mody"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)",
      "Combinatorics (math.CO)",
      "Number Theory (math.NT)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.08620",
    "title": "HAPS-Enabled Sustainability Provision in Cellular Networks through  Cell-Switching",
    "abstract": "There is a consensus in the literature that cell-switching is a viable solution to tackle the draconian increase in the energy consumption of cellular networks. Although the literature is full of works addressing the energy consumption problem via cell-switching, where small cells with low or no load are turned off and the traffic is offloaded to either adjacent base stations or macro cells, in terrestrial communication networks, they may not be feasible when there is either a lack of infrastructure or insufficient capacity due to high demand. The integration of non-terrestrial networks (NTN) into the cell-switching process can be considered as a visionary approach to handle this problem. In this regard, high altitude platform station (HAPS) draws considerable attention with its massive footprint, high capacity, and ubiquitous connectivity. The aim of this study is to show the potential benefits of using HAPS in cell-switching methods by being a bountiful host for offloaded users from cell-switching operations. More specifically, HAPS is included in the network so that it can increase the switching off opportunities by providing extra coverage and capacity. The simulation results demonstrate that a significant amount of reduction in energy consumption (as high as 16%) is obtained while ensuring quality-of-service (QoS) requirements. ",
    "url": "https://arxiv.org/abs/2304.08620",
    "authors": [
      "Görkem Berkay Koç",
      "Berk Çiloğlu",
      "Metin Öztürk",
      "Halim Yanikomeroglu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.08639",
    "title": "pgmpy: A Python Toolkit for Bayesian Networks",
    "abstract": "Bayesian Networks (BNs) are used in various fields for modeling, prediction, and decision making. pgmpy is a python package that provides a collection of algorithms and tools to work with BNs and related models. It implements algorithms for structure learning, parameter estimation, approximate and exact inference, causal inference, and simulations. These implementations focus on modularity and easy extensibility to allow users to quickly modify/add to existing algorithms, or to implement new algorithms for different use cases. pgmpy is released under the MIT License; the source code is available at: https://github.com/pgmpy/pgmpy, and the documentation at: https://pgmpy.org. ",
    "url": "https://arxiv.org/abs/2304.08639",
    "authors": [
      "Ankur Ankan",
      "Johannes Textor"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2304.08640",
    "title": "TAP: A Comprehensive Data Repository for Traffic Accident Prediction in  Road Networks",
    "abstract": "Road safety is a major global public health concern. Effective traffic crash prediction can play a critical role in reducing road traffic accidents. However, Existing machine learning approaches tend to focus on predicting traffic accidents in isolation, without considering the potential relationships between different accident locations within road networks. To incorporate graph structure information, graph-based approaches such as Graph Neural Networks (GNNs) can be naturally applied. However, applying GNNs to the accident prediction problem faces challenges due to the lack of suitable graph-structured traffic accident datasets. To bridge this gap, we have constructed a real-world graph-based Traffic Accident Prediction (TAP) data repository, along with two representative tasks: accident occurrence prediction and accident severity prediction. With nationwide coverage, real-world network topology, and rich geospatial features, this data repository can be used for a variety of traffic-related tasks. We further comprehensively evaluate eleven state-of-the-art GNN variants and two non-graph-based machine learning methods using the created datasets. Significantly facilitated by the proposed data, we develop a novel Traffic Accident Vulnerability Estimation via Linkage (TRAVEL) model, which is designed to capture angular and directional information from road networks. We demonstrate that the proposed model consistently outperforms the baselines. The data and code are available on GitHub (https://github.com/baixianghuang/travel). ",
    "url": "https://arxiv.org/abs/2304.08640",
    "authors": [
      "Baixiang Huang",
      "Bryan Hooi",
      "Kai Shu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.08650",
    "title": "UAV-based Maritime Communications: Relaying to Enhance the Link Quality",
    "abstract": "Providing a stable connectivity in maritime communications is of utmost importance to unleash the full potential of smart ports. Nonetheless, due to the crowded nature of harbor environments, it is likely that some ships are shadowed by others, resulting in reduced received power that subsequently diminishes their data rates-even threatens basic connectivity requirements. Given that UAVs have been regarded as an integral part of future generations of wireless communication networks, they can be employed in maritime communications as well. In this paper, we investigate the use of UAV-mounted relays in order to help mitigate the reduced data rates of blocked links in maritime communications. Various communication architectures are considered based on the positioning mechanism of the UAV; in this regard, fixed, k-means algorithm-based, and landing spot-based positioning approaches are examined. On the other hand, since UAVs are predominantly battery-operated, the energy consumption performances of these approaches are also measured. Results reveal that the landing spot-based UAV relay positioning approach finds the best trade-off between the data rate and energy consumption. ",
    "url": "https://arxiv.org/abs/2304.08650",
    "authors": [
      "Abdullah Taha Çağan",
      "Görkem Berkay Koç",
      "Handan Yakın",
      "Berk Çiloğlu",
      "Muhammad Zeeshan Ashgar",
      "Özgün Ersoy",
      "Jyri Hämäläinen",
      "Metin Öztürk"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.08653",
    "title": "On Uncertainty Calibration and Selective Generation in Probabilistic  Neural Summarization: A Benchmark Study",
    "abstract": "Modern deep models for summarization attains impressive benchmark performance, but they are prone to generating miscalibrated predictive uncertainty. This means that they assign high confidence to low-quality predictions, leading to compromised reliability and trustworthiness in real-world applications. Probabilistic deep learning methods are common solutions to the miscalibration problem. However, their relative effectiveness in complex autoregressive summarization tasks are not well-understood. In this work, we thoroughly investigate different state-of-the-art probabilistic methods' effectiveness in improving the uncertainty quality of the neural summarization models, across three large-scale benchmarks with varying difficulty. We show that the probabilistic methods consistently improve the model's generation and uncertainty quality, leading to improved selective generation performance (i.e., abstaining from low-quality summaries) in practice. We also reveal notable failure patterns of probabilistic methods widely-adopted in NLP community (e.g., Deep Ensemble and Monte Carlo Dropout), cautioning the importance of choosing appropriate method for the data setting. ",
    "url": "https://arxiv.org/abs/2304.08653",
    "authors": [
      "Polina Zablotskaia",
      "Du Phan",
      "Joshua Maynez",
      "Shashi Narayan",
      "Jie Ren",
      "Jeremiah Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08665",
    "title": "Insta(nt) Pet Therapy: GAN-generated Images for Therapeutic Social Media  Content",
    "abstract": "The positive therapeutic effect of viewing pet images online has been well-studied. However, it is difficult to obtain large-scale production of such content since it relies on pet owners to capture photographs and upload them. I use a Generative Adversarial Network-based framework for the creation of fake pet images at scale. These images are uploaded on an Instagram account where they drive user engagement at levels comparable to those seen with images from accounts with traditional pet photographs, underlining the applicability of the framework to be used for pet-therapy social media content. ",
    "url": "https://arxiv.org/abs/2304.08665",
    "authors": [
      "Tanish Jain"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.08687",
    "title": "GlobalMind: Global Multi-head Interactive Self-attention Network for  Hyperspectral Change Detection",
    "abstract": "High spectral resolution imagery of the Earth's surface enables users to monitor changes over time in fine-grained scale, playing an increasingly important role in agriculture, defense, and emergency response. However, most current algorithms are still confined to describing local features and fail to incorporate a global perspective, which limits their ability to capture interactions between global features, thus usually resulting in incomplete change regions. In this paper, we propose a Global Multi-head INteractive self-attention change Detection network (GlobalMind) to explore the implicit correlation between different surface objects and variant land cover transformations, acquiring a comprehensive understanding of the data and accurate change detection result. Firstly, a simple but effective Global Axial Segmentation (GAS) strategy is designed to expand the self-attention computation along the row space or column space of hyperspectral images, allowing the global connection with high efficiency. Secondly, with GAS, the global spatial multi-head interactive self-attention (Global-M) module is crafted to mine the abundant spatial-spectral feature involving potential correlations between the ground objects from the entire rich and complex hyperspectral space. Moreover, to acquire the accurate and complete cross-temporal changes, we devise a global temporal interactive multi-head self-attention (GlobalD) module which incorporates the relevance and variation of bi-temporal spatial-spectral features, deriving the integrate potential same kind of changes in the local and global range with the combination of GAS. We perform extensive experiments on five mostly used hyperspectral datasets, and our method outperforms the state-of-the-art algorithms with high accuracy and efficiency. ",
    "url": "https://arxiv.org/abs/2304.08687",
    "authors": [
      "Meiqi Hu",
      "Chen Wu",
      "Liangpei Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.08691",
    "title": "LTC-SE: Expanding the Potential of Liquid Time-Constant Neural Networks  for Scalable AI and Embedded Systems",
    "abstract": "We present LTC-SE, an improved version of the Liquid Time-Constant (LTC) neural network algorithm originally proposed by Hasani et al. in 2021. This algorithm unifies the Leaky-Integrate-and-Fire (LIF) spiking neural network model with Continuous-Time Recurrent Neural Networks (CTRNNs), Neural Ordinary Differential Equations (NODEs), and bespoke Gated Recurrent Units (GRUs). The enhancements in LTC-SE focus on augmenting flexibility, compatibility, and code organization, targeting the unique constraints of embedded systems with limited computational resources and strict performance requirements. The updated code serves as a consolidated class library compatible with TensorFlow 2.x, offering comprehensive configuration options for LTCCell, CTRNN, NODE, and CTGRU classes. We evaluate LTC-SE against its predecessors, showcasing the advantages of our optimizations in user experience, Keras function compatibility, and code clarity. These refinements expand the applicability of liquid neural networks in diverse machine learning tasks, such as robotics, causality analysis, and time-series prediction, and build on the foundational work of Hasani et al. ",
    "url": "https://arxiv.org/abs/2304.08691",
    "authors": [
      "Michael Bidollahkhani",
      "Ferhat Atasoy",
      "Hamdan Abdellatef"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.08697",
    "title": "Performance Analysis and Comparison of Non-ideal Wireless PBFT and RAFT  Consensus Networks in 6G Communications",
    "abstract": "Due to advantages in security and privacy, blockchain is considered a key enabling technology to support 6G communications. Practical Byzantine Fault Tolerance (PBFT) and RAFT are seen as the most applicable consensus mechanisms (CMs) in blockchain-enabled wireless networks. However, previous studies on PBFT and RAFT rarely consider the channel performance of the physical layer, such as path loss and channel fading, resulting in research results that are far from real networks. Additionally, 6G communications will widely deploy high-frequency signals such as terahertz (THz) and millimeter wave (mmWave), while performances of PBFT and RAFT are still unknown when these signals are transmitted in wireless PBFT or RAFT networks. Therefore, it is urgent to study the performance of non-ideal wireless PBFT and RAFT networks with THz and mmWave signals, to better make PBFT and RAFT play a role in the 6G era. In this paper, we study and compare the performance of THz and mmWave signals in non-ideal wireless PBFT and RAFT networks, considering Rayleigh Fading (RF) and close-in Free Space (FS) reference distance path loss. Performance is evaluated by five metrics: consensus success rate, latency, throughput, reliability gain, and energy consumption. Meanwhile, we find and derive that there is a maximum distance between two nodes that can make CMs inevitably successful, and it is named the active distance of CMs. The research results not only analyze the performance of non-ideal wireless PBFT and RAFT networks, but also provide important references for the future transmission of THz and mmWave signals in PBFT and RAFT networks. ",
    "url": "https://arxiv.org/abs/2304.08697",
    "authors": [
      "Haoxiang Luo",
      "Xiangyue Yang",
      "Hongfang Yu",
      "Gang Sun",
      "Shizhong Xu",
      "Bo Lei"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Performance (cs.PF)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.08706",
    "title": "Looking Through the Glass: Neural Surface Reconstruction Against High  Specular Reflections",
    "abstract": "Neural implicit methods have achieved high-quality 3D object surfaces under slight specular highlights. However, high specular reflections (HSR) often appear in front of target objects when we capture them through glasses. The complex ambiguity in these scenes violates the multi-view consistency, then makes it challenging for recent methods to reconstruct target objects correctly. To remedy this issue, we present a novel surface reconstruction framework, NeuS-HSR, based on implicit neural rendering. In NeuS-HSR, the object surface is parameterized as an implicit signed distance function (SDF). To reduce the interference of HSR, we propose decomposing the rendered image into two appearances: the target object and the auxiliary plane. We design a novel auxiliary plane module by combining physical assumptions and neural networks to generate the auxiliary plane appearance. Extensive experiments on synthetic and real-world datasets demonstrate that NeuS-HSR outperforms state-of-the-art approaches for accurate and robust target surface reconstruction against HSR. Code is available at https://github.com/JiaxiongQ/NeuS-HSR. ",
    "url": "https://arxiv.org/abs/2304.08706",
    "authors": [
      "Jiaxiong Qiu",
      "Peng-Tao Jiang",
      "Yifan Zhu",
      "Ze-Xin Yin",
      "Ming-Ming Cheng",
      "Bo Ren"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.08708",
    "title": "A Voice Disease Detection Method Based on MFCCs and Shallow CNN",
    "abstract": "The incidence rate of voice diseases is increasing year by year. The use of software for remote diagnosis is a technical development trend and has important practical value. Among voice diseases, common diseases that cause hoarseness include spasmodic dysphonia, vocal cord paralysis, vocal nodule, and vocal cord polyp. This paper presents a voice disease detection method that can be applied in a wide range of clinical. We cooperated with Xiangya Hospital of Central South University to collect voice samples from sixty-one different patients. The Mel Frequency Cepstrum Coefficient (MFCC) parameters are extracted as input features to describe the voice in the form of data. An innovative model combining MFCC parameters and single convolution layer CNN is proposed for fast calculation and classification. The highest accuracy we achieved was 92%, it is fully ahead of the original research results and internationally advanced. And we use Advanced Voice Function Assessment Databases (AVFAD) to evaluate the generalization ability of the method we proposed, which achieved an accuracy rate of 98%. Experiments on clinical and standard datasets show that for the pathological detection of voice diseases, our method has greatly improved in accuracy and computational efficiency. ",
    "url": "https://arxiv.org/abs/2304.08708",
    "authors": [
      "Xiaoping Xie",
      "Hao Cai",
      "Can Li",
      "Fei Ding"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2304.08713",
    "title": "FlexiChain 2.0: NodeChain Assisting Integrated Decentralized Vault for  Effective Data Authentication and Device Integrity in Complex Cyber-Physical  Systems",
    "abstract": "Distributed Ledger Technology (DLT) has been introduced using the most common consensus algorithm either for an electronic cash system or a decentralized programmable assets platform which provides general services. Most established reliable networks are unsuitable for all applications such as smart cities applications, and, in particular, Internet of Things (IoT) and Cyber Physical Systems (CPS) applications. The purpose of this paper is to provide a suitable DLT for IoT and CPS that could satisfy their requirements. The proposed work has been designed based on the requirements of Cyber Physical Systems. FlexiChain is proposed as a layer zero network that could be formed from independent blockchains. Also, NodeChain has been introduced to be a distributed (Unique ID) UID aggregation vault to secure all nodes' UIDs. Moreover, NodeChain is proposed to serve mainly FlexiChain for all node security requirements. NodeChain targets the security and integrity of each node. Also, the linked UIDs create a chain of narration that keeps track not merely for assets but also for who authenticated the assets. The security results present a higher resistance against four types of attacks. Furthermore, the strength of the network is presented from the early stages compared to blockchain and central authority. FlexiChain technology has been introduced to be a layer zero network for all CPS decentralized applications taking into accounts their requirements. FlexiChain relies on lightweight processing mechanisms and creates other methods to increase security. ",
    "url": "https://arxiv.org/abs/2304.08713",
    "authors": [
      "Ahmad J. Alkhodair",
      "Saraju P. Mohanty",
      "Elias Kougianos"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2304.08745",
    "title": "Super-Logarithmic Lower Bounds for Dynamic Graph Problems",
    "abstract": "In this work, we prove a $\\tilde{\\Omega}(\\lg^{3/2} n )$ unconditional lower bound on the maximum of the query time and update time for dynamic data structures supporting reachability queries in $n$-node directed acyclic graphs under edge insertions. This is the first super-logarithmic lower bound for any natural graph problem. In proving the lower bound, we also make novel contributions to the state-of-the-art data structure lower bound techniques that we hope may lead to further progress in proving lower bounds. ",
    "url": "https://arxiv.org/abs/2304.08745",
    "authors": [
      "Kasper Green Larsen",
      "Huacheng Yu"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2304.08757",
    "title": "NeAI: A Pre-convoluted Representation for Plug-and-Play Neural Ambient  Illumination",
    "abstract": "Recent advances in implicit neural representation have demonstrated the ability to recover detailed geometry and material from multi-view images. However, the use of simplified lighting models such as environment maps to represent non-distant illumination, or using a network to fit indirect light modeling without a solid basis, can lead to an undesirable decomposition between lighting and material. To address this, we propose a fully differentiable framework named neural ambient illumination (NeAI) that uses Neural Radiance Fields (NeRF) as a lighting model to handle complex lighting in a physically based way. Together with integral lobe encoding for roughness-adaptive specular lobe and leveraging the pre-convoluted background for accurate decomposition, the proposed method represents a significant step towards integrating physically based rendering into the NeRF representation. The experiments demonstrate the superior performance of novel-view rendering compared to previous works, and the capability to re-render objects under arbitrary NeRF-style environments opens up exciting possibilities for bridging the gap between virtual and real-world scenes. The project and supplementary materials are available at https://yiyuzhuang.github.io/NeAI/. ",
    "url": "https://arxiv.org/abs/2304.08757",
    "authors": [
      "Yiyu Zhuang",
      "Qi Zhang",
      "Xuan Wang",
      "Hao Zhu",
      "Ying Feng",
      "Xiaoyu Li",
      "Ying Shan",
      "Xun Cao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2304.08767",
    "title": "Masked Language Model Based Textual Adversarial Example Detection",
    "abstract": "Adversarial attacks are a serious threat to the reliable deployment of machine learning models in safety-critical applications. They can misguide current models to predict incorrectly by slightly modifying the inputs. Recently, substantial work has shown that adversarial examples tend to deviate from the underlying data manifold of normal examples, whereas pre-trained masked language models can fit the manifold of normal NLP data. To explore how to use the masked language model in adversarial detection, we propose a novel textual adversarial example detection method, namely Masked Language Model-based Detection (MLMD), which can produce clearly distinguishable signals between normal examples and adversarial examples by exploring the changes in manifolds induced by the masked language model. MLMD features a plug and play usage (i.e., no need to retrain the victim model) for adversarial defense and it is agnostic to classification tasks, victim model's architectures, and to-be-defended attack methods. We evaluate MLMD on various benchmark textual datasets, widely studied machine learning models, and state-of-the-art (SOTA) adversarial attacks (in total $3*4*4 = 48$ settings). Experimental results show that MLMD can achieve strong performance, with detection accuracy up to 0.984, 0.967, and 0.901 on AG-NEWS, IMDB, and SST-2 datasets, respectively. Additionally, MLMD is superior, or at least comparable to, the SOTA detection defenses in detection accuracy and F1 score. Among many defenses based on the off-manifold assumption of adversarial examples, this work offers a new angle for capturing the manifold change. The code for this work is openly accessible at \\url{https://github.com/mlmddetection/MLMDdetection}. ",
    "url": "https://arxiv.org/abs/2304.08767",
    "authors": [
      "Xiaomei Zhang",
      "Zhaoxi Zhang",
      "Qi Zhong",
      "Xufei Zheng",
      "Yanjun Zhang",
      "Shengshan Hu",
      "Leo Yu Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.08779",
    "title": "Error bounds for maxout neural network approximations of model  predictive control",
    "abstract": "Neural network (NN) approximations of model predictive control (MPC) are a versatile approach if the online solution of the underlying optimal control problem (OCP) is too demanding and if an exact computation of the explicit MPC law is intractable. The drawback of such approximations is that they typically do not preserve stability and performance guarantees of the original MPC. However, such guarantees can be recovered if the maximum error with respect to the optimal control law and the Lipschitz constant of that error are known. We show in this work how to compute both values exactly when the control law is approximated by a maxout NN. We build upon related results for ReLU NN approximations and derive mixed-integer (MI) linear constraints that allow a computation of the output and the local gain of a maxout NN by solving an MI feasibility problem. Furthermore, we show theoretically and experimentally that maxout NN exist for which the maximum error is zero. ",
    "url": "https://arxiv.org/abs/2304.08779",
    "authors": [
      "Dieter Teichrib",
      "Moritz Schulze Darup"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.08780",
    "title": "Revisiting the Design Agenda for Privacy Notices and Security Warnings",
    "abstract": "System-generated user-facing notices, dialogs, and warnings in privacy and security interventions present the opportunity to support users in making informed decisions about identified risks. However, too often, they are bypassed, ignored, and mindlessly clicked through, mainly in connection to the well-studied effect of user fatigue and habituation. The contribution of this position paper is to provide a summarized review of established and emergent design dimensions and principles to limit such risk-prone behavior, and to identify three emergent research and design directions for privacy-enhancing dialogs. ",
    "url": "https://arxiv.org/abs/2304.08780",
    "authors": [
      "Diana Korka",
      "Kavous Salehzadeh Niksirat",
      "Mauro Cherubini"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2304.08798",
    "title": "Large-scale Dynamic Network Representation via Tensor Ring Decomposition",
    "abstract": "Large-scale Dynamic Networks (LDNs) are becoming increasingly important in the Internet age, yet the dynamic nature of these networks captures the evolution of the network structure and how edge weights change over time, posing unique challenges for data analysis and modeling. A Latent Factorization of Tensors (LFT) model facilitates efficient representation learning for a LDN. But the existing LFT models are almost based on Canonical Polyadic Factorization (CPF). Therefore, this work proposes a model based on Tensor Ring (TR) decomposition for efficient representation learning for a LDN. Specifically, we incorporate the principle of single latent factor-dependent, non-negative, and multiplicative update (SLF-NMU) into the TR decomposition model, and analyze the particular bias form of TR decomposition. Experimental studies on two real LDNs demonstrate that the propose method achieves higher accuracy than existing models. ",
    "url": "https://arxiv.org/abs/2304.08798",
    "authors": [
      "Qu Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08799",
    "title": "Self-Supervised 3D Action Representation Learning with Skeleton Cloud  Colorization",
    "abstract": "3D Skeleton-based human action recognition has attracted increasing attention in recent years. Most of the existing work focuses on supervised learning which requires a large number of labeled action sequences that are often expensive and time-consuming to annotate. In this paper, we address self-supervised 3D action representation learning for skeleton-based action recognition. We investigate self-supervised representation learning and design a novel skeleton cloud colorization technique that is capable of learning spatial and temporal skeleton representations from unlabeled skeleton sequence data. We represent a skeleton action sequence as a 3D skeleton cloud and colorize each point in the cloud according to its temporal and spatial orders in the original (unannotated) skeleton sequence. Leveraging the colorized skeleton point cloud, we design an auto-encoder framework that can learn spatial-temporal features from the artificial color labels of skeleton joints effectively. Specifically, we design a two-steam pretraining network that leverages fine-grained and coarse-grained colorization to learn multi-scale spatial-temporal features.In addition, we design a Masked Skeleton Cloud Repainting task that can pretrain the designed auto-encoder framework to learn informative representations. We evaluate our skeleton cloud colorization approach with linear classifiers trained under different configurations, including unsupervised, semi-supervised, fully-supervised, and transfer learning settings. Extensive experiments on NTU RGB+D, NTU RGB+D 120, PKU-MMD, NW-UCLA, and UWA3D datasets show that the proposed method outperforms existing unsupervised and semi-supervised 3D action recognition methods by large margins and achieves competitive performance in supervised 3D action recognition as well. ",
    "url": "https://arxiv.org/abs/2304.08799",
    "authors": [
      "Siyuan Yang",
      "Jun Liu",
      "Shijian Lu",
      "Er Meng Hwa",
      "Yongjian Hu",
      "Alex C. Kot"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.08805",
    "title": "Implicit representation priors meet Riemannian geometry for Bayesian  robotic grasping",
    "abstract": "Robotic grasping in highly noisy environments presents complex challenges, especially with limited prior knowledge about the scene. In particular, identifying good grasping poses with Bayesian inference becomes difficult due to two reasons: i) generating data from uninformative priors proves to be inefficient, and ii) the posterior often entails a complex distribution defined on a Riemannian manifold. In this study, we explore the use of implicit representations to construct scene-dependent priors, thereby enabling the application of efficient simulation-based Bayesian inference algorithms for determining successful grasp poses in unstructured environments. Results from both simulation and physical benchmarks showcase the high success rate and promising potential of this approach. ",
    "url": "https://arxiv.org/abs/2304.08805",
    "authors": [
      "Norman Marlier",
      "Julien Gustin",
      "Gilles Louppe",
      "Olivier Brüls"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08811",
    "title": "Towards the Transferable Audio Adversarial Attack via Ensemble Methods",
    "abstract": "In recent years, deep learning (DL) models have achieved significant progress in many domains, such as autonomous driving, facial recognition, and speech recognition. However, the vulnerability of deep learning models to adversarial attacks has raised serious concerns in the community because of their insufficient robustness and generalization. Also, transferable attacks have become a prominent method for black-box attacks. In this work, we explore the potential factors that impact adversarial examples (AEs) transferability in DL-based speech recognition. We also discuss the vulnerability of different DL systems and the irregular nature of decision boundaries. Our results show a remarkable difference in the transferability of AEs between speech and images, with the data relevance being low in images but opposite in speech recognition. Motivated by dropout-based ensemble approaches, we propose random gradient ensembles and dynamic gradient-weighted ensembles, and we evaluate the impact of ensembles on the transferability of AEs. The results show that the AEs created by both approaches are valid for transfer to the black box API. ",
    "url": "https://arxiv.org/abs/2304.08811",
    "authors": [
      "Feng Guo",
      "Zheng Sun",
      "Yuxuan Chen",
      "Lei Ju"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2304.08821",
    "title": "TTIDA: Controllable Generative Data Augmentation via Text-to-Text and  Text-to-Image Models",
    "abstract": "Data augmentation has been established as an efficacious approach to supplement useful information for low-resource datasets. Traditional augmentation techniques such as noise injection and image transformations have been widely used. In addition, generative data augmentation (GDA) has been shown to produce more diverse and flexible data. While generative adversarial networks (GANs) have been frequently used for GDA, they lack diversity and controllability compared to text-to-image diffusion models. In this paper, we propose TTIDA (Text-to-Text-to-Image Data Augmentation) to leverage the capabilities of large-scale pre-trained Text-to-Text (T2T) and Text-to-Image (T2I) generative models for data augmentation. By conditioning the T2I model on detailed descriptions produced by T2T models, we are able to generate photo-realistic labeled images in a flexible and controllable manner. Experiments on in-domain classification, cross-domain classification, and image captioning tasks show consistent improvements over other data augmentation baselines. Analytical studies in varied settings, including few-shot, long-tail, and adversarial, further reinforce the effectiveness of TTIDA in enhancing performance and increasing robustness. ",
    "url": "https://arxiv.org/abs/2304.08821",
    "authors": [
      "Yuwei Yin",
      "Jean Kaddour",
      "Xiang Zhang",
      "Yixin Nie",
      "Zhenguang Liu",
      "Lingpeng Kong",
      "Qi Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08826",
    "title": "Perceive, Excavate and Purify: A Novel Object Mining Framework for  Instance Segmentation",
    "abstract": "Recently, instance segmentation has made great progress with the rapid development of deep neural networks. However, there still exist two main challenges including discovering indistinguishable objects and modeling the relationship between instances. To deal with these difficulties, we propose a novel object mining framework for instance segmentation. In this framework, we first introduce the semantics perceiving subnetwork to capture pixels that may belong to an obvious instance from the bottom up. Then, we propose an object excavating mechanism to discover indistinguishable objects. In the mechanism, preliminary perceived semantics are regarded as original instances with classifications and locations, and then indistinguishable objects around these original instances are mined, which ensures that hard objects are fully excavated. Next, an instance purifying strategy is put forward to model the relationship between instances, which pulls the similar instances close and pushes away different instances to keep intra-instance similarity and inter-instance discrimination. In this manner, the same objects are combined as the one instance and different objects are distinguished as independent instances. Extensive experiments on the COCO dataset show that the proposed approach outperforms state-of-the-art methods, which validates the effectiveness of the proposed object mining framework. ",
    "url": "https://arxiv.org/abs/2304.08826",
    "authors": [
      "Jinming Su",
      "Ruihong Yin",
      "Xingyue Chen",
      "Junfeng Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.08841",
    "title": "Two-stage Denoising Diffusion Model for Source Localization in Graph  Inverse Problems",
    "abstract": "Source localization is the inverse problem of graph information dissemination and has broad practical applications. However, the inherent intricacy and uncertainty in information dissemination pose significant challenges, and the ill-posed nature of the source localization problem further exacerbates these challenges. Recently, deep generative models, particularly diffusion models inspired by classical non-equilibrium thermodynamics, have made significant progress. While diffusion models have proven to be powerful in solving inverse problems and producing high-quality reconstructions, applying them directly to the source localization is infeasible for two reasons. Firstly, it is impossible to calculate the posterior disseminated results on a large-scale network for iterative denoising sampling, which would incur enormous computational costs. Secondly, in the existing methods for this field, the training data itself are ill-posed (many-to-one); thus simply transferring the diffusion model would only lead to local optima. To address these challenges, we propose a two-stage optimization framework, the source localization denoising diffusion model (SL-Diff). In the coarse stage, we devise the source proximity degrees as the supervised signals to generate coarse-grained source predictions. This aims to efficiently initialize the next stage, significantly reducing its convergence time and calibrating the convergence process. Furthermore, the introduction of cascade temporal information in this training method transforms the many-to-one mapping relationship into a one-to-one relationship, perfectly addressing the ill-posed problem. In the fine stage, we design a diffusion model for the graph inverse problem that can quantify the uncertainty in the dissemination. The proposed SL-Diff yields excellent prediction results within a reasonable sampling time at extensive experiments. ",
    "url": "https://arxiv.org/abs/2304.08841",
    "authors": [
      "Bosong Huang",
      "Weihao Yu",
      "Ruzhong Xie",
      "Jing Xiao",
      "Jin Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08842",
    "title": "UDTIRI: An Open-Source Road Pothole Detection Benchmark Suite",
    "abstract": "It is seen that there is enormous potential to leverage powerful deep learning methods in the emerging field of urban digital twins. It is particularly in the area of intelligent road inspection where there is currently limited research and data available. To facilitate progress in this field, we have developed a well-labeled road pothole dataset named Urban Digital Twins Intelligent Road Inspection (UDTIRI) dataset. We hope this dataset will enable the use of powerful deep learning methods in urban road inspection, providing algorithms with a more comprehensive understanding of the scene and maximizing their potential. Our dataset comprises 1000 images of potholes, captured in various scenarios with different lighting and humidity conditions. Our intention is to employ this dataset for object detection, semantic segmentation, and instance segmentation tasks. Our team has devoted significant effort to conducting a detailed statistical analysis, and benchmarking a selection of representative algorithms from recent years. We also provide a multi-task platform for researchers to fully exploit the performance of various algorithms with the support of UDTIRI dataset. ",
    "url": "https://arxiv.org/abs/2304.08842",
    "authors": [
      "Sicen Guo",
      "Jiahang Li",
      "Shuai Su",
      "Yi Feng",
      "Dacheng Zhou",
      "Chen Chen",
      "Denghuang Zhang",
      "Xingyi Zhu",
      "Qijun Chen",
      "Rui Fan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.08847",
    "title": "BadVFL: Backdoor Attacks in Vertical Federated Learning",
    "abstract": "Federated learning (FL) enables multiple parties to collaboratively train a machine learning model without sharing their data; rather, they train their own model locally and send updates to a central server for aggregation. Depending on how the data is distributed among the participants, FL can be classified into Horizontal (HFL) and Vertical (VFL). In VFL, the participants share the same set of training instances but only host a different and non-overlapping subset of the whole feature space. Whereas in HFL, each participant shares the same set of features while the training set is split into locally owned training data subsets. VFL is increasingly used in applications like financial fraud detection; nonetheless, very little work has analyzed its security. In this paper, we focus on robustness in VFL, in particular, on backdoor attacks, whereby an adversary attempts to manipulate the aggregate model during the training process to trigger misclassifications. Performing backdoor attacks in VFL is more challenging than in HFL, as the adversary i) does not have access to the labels during training and ii) cannot change the labels as she only has access to the feature embeddings. We present a first-of-its-kind clean-label backdoor attack in VFL, which consists of two phases: a label inference and a backdoor phase. We demonstrate the effectiveness of the attack on three different datasets, investigate the factors involved in its success, and discuss countermeasures to mitigate its impact. ",
    "url": "https://arxiv.org/abs/2304.08847",
    "authors": [
      "Mohammad Naseri",
      "Yufei Han",
      "Emiliano De Cristofaro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.08848",
    "title": "Proof-Producing Symbolic Execution for Binary Code Verification",
    "abstract": "We propose a proof-producing symbolic execution for verification of machine-level programs. The analysis is based on a set of core inference rules that are designed to give control over the tradeoff between preservation of precision and the introduction of overapproximation to make the application to real world code useful and tractable. We integrate our symbolic execution in a binary analysis platform that features a low-level intermediate language enabling the application of analyses to many different processor architectures. The overall framework is implemented in the theorem prover HOL4 to be able to obtain highly trustworthy verification results. We demonstrate our approach to establish sound execution time bounds for a control loop program implemented for an ARM Cortex-M0 processor. ",
    "url": "https://arxiv.org/abs/2304.08848",
    "authors": [
      "Andreas Lindner",
      "Roberto Guanciale",
      "Mads Dam"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Cryptography and Security (cs.CR)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2304.08855",
    "title": "A Domain-Region Based Evaluation of ML Performance Robustness to  Covariate Shift",
    "abstract": "Most machine learning methods assume that the input data distribution is the same in the training and testing phases. However, in practice, this stationarity is usually not met and the distribution of inputs differs, leading to unexpected performance of the learned model in deployment. The issue in which the training and test data inputs follow different probability distributions while the input-output relationship remains unchanged is referred to as covariate shift. In this paper, the performance of conventional machine learning models was experimentally evaluated in the presence of covariate shift. Furthermore, a region-based evaluation was performed by decomposing the domain of probability density function of the input data to assess the classifier's performance per domain region. Distributional changes were simulated in a two-dimensional classification problem. Subsequently, a higher four-dimensional experiments were conducted. Based on the experimental analysis, the Random Forests algorithm is the most robust classifier in the two-dimensional case, showing the lowest degradation rate for accuracy and F1-score metrics, with a range between 0.1% and 2.08%. Moreover, the results reveal that in higher-dimensional experiments, the performance of the models is predominantly influenced by the complexity of the classification function, leading to degradation rates exceeding 25% in most cases. It is also concluded that the models exhibit high bias towards the region with high density in the input space domain of the training samples. ",
    "url": "https://arxiv.org/abs/2304.08855",
    "authors": [
      "Firas Bayram",
      "Bestoun S. Ahmed"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.08862",
    "title": "Approximate Nearest Neighbour Phrase Mining for Contextual Speech  Recognition",
    "abstract": "This paper presents an extension to train end-to-end Context-Aware Transformer Transducer ( CATT ) models by using a simple, yet efficient method of mining hard negative phrases from the latent space of the context encoder. During training, given a reference query, we mine a number of similar phrases using approximate nearest neighbour search. These sampled phrases are then used as negative examples in the context list alongside random and ground truth contextual information. By including approximate nearest neighbour phrases (ANN-P) in the context list, we encourage the learned representation to disambiguate between similar, but not identical, biasing phrases. This improves biasing accuracy when there are several similar phrases in the biasing inventory. We carry out experiments in a large-scale data regime obtaining up to 7% relative word error rate reductions for the contextual portion of test data. We also extend and evaluate CATT approach in streaming applications. ",
    "url": "https://arxiv.org/abs/2304.08862",
    "authors": [
      "Maurits Bleeker",
      "Pawel Swietojanski",
      "Stefan Braun",
      "Xiaodan Zhuang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2304.08868",
    "title": "Soft-Output Deep Neural Network-Based Decoding",
    "abstract": "Deep neural network (DNN)-based channel decoding is widely considered in the literature. The existing solutions are investigated for the case of hard output, i.e. when the decoder returns the estimated information word. At the same time, soft-output decoding is of critical importance for iterative receivers and decoders. In this paper, we focus on the soft-output DNN-based decoding problem. We start with the syndrome-based approach proposed by Bennatan et al. (2018) and modify it to provide soft output in the AWGN channel. The new decoder can be considered as an approximation of the MAP decoder with smaller computation complexity. We discuss various regularization functions for joint DNN-MAP training and compare the resulting distributions for [64, 45] BCH code. Finally, to demonstrate the soft-output quality we consider the turbo-product code with [64, 45] BCH codes as row and column codes. We show that the resulting DNN-based scheme is very close to the MAP-based performance and significantly outperforms the solution based on the Chase decoder. We come to the conclusion that the new method is prospective for the challenging problem of DNN-based decoding of long codes consisting of short component codes. ",
    "url": "https://arxiv.org/abs/2304.08868",
    "authors": [
      "Dmitry Artemasov",
      "Kirill Andreev",
      "Pavel Rybin",
      "Alexey Frolov"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.08875",
    "title": "Secured and Cooperative Publish/Subscribe Scheme in Autonomous Vehicular  Networks",
    "abstract": "In order to save computing power yet enhance safety, there is a strong intention for autonomous vehicles (AVs) in future to drive collaboratively by sharing sensory data and computing results among neighbors. However, the intense collaborative computing and data transmissions among unknown others will inevitably introduce severe security concerns. Aiming at addressing security concerns in future AVs, in this paper, we develop SPAD, a secured framework to forbid free-riders and {promote trustworthy data dissemination} in collaborative autonomous driving. Specifically, we first introduce a publish/subscribe framework for inter-vehicle data transmissions{. To defend against free-riding attacks,} we formulate the interactions between publisher AVs and subscriber AVs as a vehicular publish/subscribe game, {and incentivize AVs to deliver high-quality data by analyzing the Stackelberg equilibrium of the game. We also design a reputation evaluation mechanism in the game} to identify malicious AVs {in disseminating fake information}. {Furthermore, for} lack of sufficient knowledge on parameters of {the} network model and user cost model {in dynamic game scenarios}, a two-tier reinforcement learning based algorithm with hotbooting is developed to obtain the optimal {strategies of subscriber AVs and publisher AVs with free-rider prevention}. Extensive simulations are conducted, and the results validate that our SPAD can effectively {prevent free-riders and enhance the dependability of disseminated contents,} compared with conventional schemes. ",
    "url": "https://arxiv.org/abs/2304.08875",
    "authors": [
      "Yuntao Wang",
      "Zhou Su",
      "Qichao Xu",
      "Tom H. Luan",
      "Rongxing Lu"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2304.08876",
    "title": "Dynamic Coarse-to-Fine Learning for Oriented Tiny Object Detection",
    "abstract": "Detecting arbitrarily oriented tiny objects poses intense challenges to existing detectors, especially for label assignment. Despite the exploration of adaptive label assignment in recent oriented object detectors, the extreme geometry shape and limited feature of oriented tiny objects still induce severe mismatch and imbalance issues. Specifically, the position prior, positive sample feature, and instance are mismatched, and the learning of extreme-shaped objects is biased and unbalanced due to little proper feature supervision. To tackle these issues, we propose a dynamic prior along with the coarse-to-fine assigner, dubbed DCFL. For one thing, we model the prior, label assignment, and object representation all in a dynamic manner to alleviate the mismatch issue. For another, we leverage the coarse prior matching and finer posterior constraint to dynamically assign labels, providing appropriate and relatively balanced supervision for diverse instances. Extensive experiments on six datasets show substantial improvements to the baseline. Notably, we obtain the state-of-the-art performance for one-stage detectors on the DOTA-v1.5, DOTA-v2.0, and DIOR-R datasets under single-scale training and testing. Codes are available at https://github.com/Chasel-Tsui/mmrotate-dcfl. ",
    "url": "https://arxiv.org/abs/2304.08876",
    "authors": [
      "Chang Xu",
      "Jian Ding",
      "Jinwang Wang",
      "Wen Yang",
      "Huai Yu",
      "Lei Yu",
      "Gui-Song Xia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.08880",
    "title": "NPS: A Framework for Accurate Program Sampling Using Graph Neural  Network",
    "abstract": "With the end of Moore's Law, there is a growing demand for rapid architectural innovations in modern processors, such as RISC-V custom extensions, to continue performance scaling. Program sampling is a crucial step in microprocessor design, as it selects representative simulation points for workload simulation. While SimPoint has been the de-facto approach for decades, its limited expressiveness with Basic Block Vector (BBV) requires time-consuming human tuning, often taking months, which impedes fast innovation and agile hardware development. This paper introduces Neural Program Sampling (NPS), a novel framework that learns execution embeddings using dynamic snapshots of a Graph Neural Network. NPS deploys AssemblyNet for embedding generation, leveraging an application's code structures and runtime states. AssemblyNet serves as NPS's graph model and neural architecture, capturing a program's behavior in aspects such as data computation, code path, and data flow. AssemblyNet is trained with a data prefetch task that predicts consecutive memory addresses. In the experiments, NPS outperforms SimPoint by up to 63%, reducing the average error by 38%. Additionally, NPS demonstrates strong robustness with increased accuracy, reducing the expensive accuracy tuning overhead. Furthermore, NPS shows higher accuracy and generality than the state-of-the-art GNN approach in code behavior learning, enabling the generation of high-quality execution embeddings. ",
    "url": "https://arxiv.org/abs/2304.08880",
    "authors": [
      "Yuanwei Fang",
      "Zihao Liu",
      "Yanheng Lu",
      "Jiawei Liu",
      "Jiajie Li",
      "Yi Jin",
      "Jian Chen",
      "Yenkuang Chen",
      "Hongzhong Zheng",
      "Yuan Xie"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2304.08882",
    "title": "Along the Margins: Marginalized Communities' Ethical Concerns about  Social Platforms",
    "abstract": "In this paper, we identified marginalized communities' ethical concerns about social platforms. We performed this identification because recent platform malfeasance indicates that software teams prioritize shareholder concerns over user concerns. Additionally, these platform shortcomings often have devastating effects on marginalized populations. We first scraped 586 marginalized communities' subreddits, aggregated a dataset of their social platform mentions and manually annotated mentions of ethical concerns in these data. We subsequently analyzed trends in the manually annotated data and tested the extent to which ethical concerns can be automatically classified by means of natural language processing (NLP). We found that marginalized communities' ethical concerns predominantly revolve around discrimination and misrepresentation, and reveal deficiencies in current software development practices. As such, researchers and developers could use our work to further investigate these concerns and rectify current software flaws. ",
    "url": "https://arxiv.org/abs/2304.08882",
    "authors": [
      "Lauren Olson",
      "Emitzá Guzmán",
      "Florian Kunneman"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2304.08901",
    "title": "Multimodal Group Activity Dataset for Classroom Engagement Level  Prediction",
    "abstract": "We collected a new dataset that includes approximately eight hours of audiovisual recordings of a group of students and their self-evaluation scores for classroom engagement. The dataset and data analysis scripts are available on our open-source repository. We developed baseline face-based and group-activity-based image and video recognition models. Our image models yield 45-85% test accuracy with face-area inputs on person-based classification task. Our video models achieved up to 71% test accuracy on group-level prediction using group activity video inputs. In this technical report, we shared the details of our end-to-end human-centered engagement analysis pipeline from data collection to model development. ",
    "url": "https://arxiv.org/abs/2304.08901",
    "authors": [
      "Alpay Sabuncuoglu",
      "T. Metin Sezgin"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2304.08912",
    "title": "Generalized Weak Supervision for Neural Information Retrieval",
    "abstract": "Neural ranking models (NRMs) have demonstrated effective performance in several information retrieval (IR) tasks. However, training NRMs often requires large-scale training data, which is difficult and expensive to obtain. To address this issue, one can train NRMs via weak supervision, where a large dataset is automatically generated using an existing ranking model (called the weak labeler) for training NRMs. Weakly supervised NRMs can generalize from the observed data and significantly outperform the weak labeler. This paper generalizes this idea through an iterative re-labeling process, demonstrating that weakly supervised models can iteratively play the role of weak labeler and significantly improve ranking performance without using manually labeled data. The proposed Generalized Weak Supervision (GWS) solution is generic and orthogonal to the ranking model architecture. This paper offers four implementations of GWS: self-labeling, cross-labeling, joint cross- and self-labeling, and greedy multi-labeling. GWS also benefits from a query importance weighting mechanism based on query performance prediction methods to reduce noise in the generated training data. We further draw a theoretical connection between self-labeling and Expectation-Maximization. Our experiments on two passage retrieval benchmarks suggest that all implementations of GWS lead to substantial improvements compared to weak supervision in all cases. ",
    "url": "https://arxiv.org/abs/2304.08912",
    "authors": [
      "Yen-Chieh Lien",
      "Hamed Zamani",
      "W. Bruce Croft"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2304.08914",
    "title": "A Study of Neural Collapse Phenomenon: Grassmannian Frame, Symmetry,  Generalization",
    "abstract": "In this paper, we extends original Neural Collapse Phenomenon by proving Generalized Neural Collapse hypothesis. We obtain Grassmannian Frame structure from the optimization and generalization of classification. This structure maximally separates features of every two classes on a sphere and does not require a larger feature dimension than the number of classes. Out of curiosity about the symmetry of Grassmannian Frame, we conduct experiments to explore if models with different Grassmannian Frames have different performance. As a result, we discover the Symmetric Generalization phenomenon. We provide a theorem to explain Symmetric Generalization of permutation. However, the question of why different directions of features can lead to such different generalization is still open for future investigation. ",
    "url": "https://arxiv.org/abs/2304.08914",
    "authors": [
      "Peifeng Gao",
      "Qianqian Xu",
      "Peisong Wen",
      "Huiyang Shao",
      "Zhiyong Yang",
      "Qingming Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.08916",
    "title": "Pose Constraints for Consistent Self-supervised Monocular Depth and  Ego-motion",
    "abstract": "Self-supervised monocular depth estimation approaches suffer not only from scale ambiguity but also infer temporally inconsistent depth maps w.r.t. scale. While disambiguating scale during training is not possible without some kind of ground truth supervision, having scale consistent depth predictions would make it possible to calculate scale once during inference as a post-processing step and use it over-time. With this as a goal, a set of temporal consistency losses that minimize pose inconsistencies over time are introduced. Evaluations show that introducing these constraints not only reduces depth inconsistencies but also improves the baseline performance of depth and ego-motion prediction. ",
    "url": "https://arxiv.org/abs/2304.08916",
    "authors": [
      "Zeeshan Khan Suri"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.08925",
    "title": "Understand Data Preprocessing for Effective End-to-End Training of Deep  Neural Networks",
    "abstract": "In this paper, we primarily focus on understanding the data preprocessing pipeline for DNN Training in the public cloud. First, we run experiments to test the performance implications of the two major data preprocessing methods using either raw data or record files. The preliminary results show that data preprocessing is a clear bottleneck, even with the most efficient software and hardware configuration enabled by NVIDIA DALI, a high-optimized data preprocessing library. Second, we identify the potential causes, exercise a variety of optimization methods, and present their pros and cons. We hope this work will shed light on the new co-design of ``data storage, loading pipeline'' and ``training framework'' and flexible resource configurations between them so that the resources can be fully exploited and performance can be maximized. ",
    "url": "https://arxiv.org/abs/2304.08925",
    "authors": [
      "Ping Gong",
      "Yuxin Ma",
      "Cheng Li",
      "Xiaosong Ma",
      "Sam H. Noh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2304.08928",
    "title": "ProGAP: Progressive Graph Neural Networks with Differential Privacy  Guarantees",
    "abstract": "Graph Neural Networks (GNNs) have become a popular tool for learning on graphs, but their widespread use raises privacy concerns as graph data can contain personal or sensitive information. Differentially private GNN models have been recently proposed to preserve privacy while still allowing for effective learning over graph-structured datasets. However, achieving an ideal balance between accuracy and privacy in GNNs remains challenging due to the intrinsic structural connectivity of graphs. In this paper, we propose a new differentially private GNN called ProGAP that uses a progressive training scheme to improve such accuracy-privacy trade-offs. Combined with the aggregation perturbation technique to ensure differential privacy, ProGAP splits a GNN into a sequence of overlapping submodels that are trained progressively, expanding from the first submodel to the complete model. Specifically, each submodel is trained over the privately aggregated node embeddings learned and cached by the previous submodels, leading to an increased expressive power compared to previous approaches while limiting the incurred privacy costs. We formally prove that ProGAP ensures edge-level and node-level privacy guarantees for both training and inference stages, and evaluate its performance on benchmark graph datasets. Experimental results demonstrate that ProGAP can achieve up to 5%-10% higher accuracy than existing state-of-the-art differentially private GNNs. ",
    "url": "https://arxiv.org/abs/2304.08928",
    "authors": [
      "Sina Sajadmanesh",
      "Daniel Gatica-Perez"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.08940",
    "title": "The ABC of Pair Programming: Gender-dependent Attitude, Behavior and  Code of Young Learners",
    "abstract": "Young learners are increasingly introduced to programming, and one of the main challenges for educators is to achieve learning success while also creating enthusiasm. As it is particularly difficult to achieve this enthusiasm initially in young females, prior work has identified gender-specific differences in the programming behavior of young learners. Since pair programming, which turns programming into a more sociable activity, has been proposed as an approach to support programming education, in this paper we aim to investigate whether similar gender-specific characteristics can also be observed during pair programming. Therefore, we designed a gender-neutral introductory SCRATCH programming course tailored for integrating pair programming principles, and conducted it with a total of 139 students aged between 8 and 14 years. To identify gender-dependent differences and similarities, we measure the attitude towards programming and the course setting, observe the behavior of the students while programming, and analyze the code of the programs for different gender-combinations. Overall, our study demonstrates that pair programming is well suited for young learners and results in a positive attitude. While the resulting programs are similar in quality and complexity independent of gender, differences are evident when it comes to the compliance to pair programming roles, the exploration of code, and the creative customization of programs. These findings contribute to an in-depth understanding of social and technical gender specifics of pair programming, and provide educators with resources and guidance for implementing gender-sensitive pair programming in the classroom. ",
    "url": "https://arxiv.org/abs/2304.08940",
    "authors": [
      "Isabella Graßl",
      "Gordon Fraser"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2304.08960",
    "title": "Generative modeling of living cells with SO(3)-equivariant implicit  neural representations",
    "abstract": "Data-driven cell tracking and segmentation methods in biomedical imaging require diverse and information-rich training data. In cases where the number of training samples is limited, synthetic computer-generated data sets can be used to improve these methods. This requires the synthesis of cell shapes as well as corresponding microscopy images using generative models. To synthesize realistic living cell shapes, the shape representation used by the generative model should be able to accurately represent fine details and changes in topology, which are common in cells. These requirements are not met by 3D voxel masks, which are restricted in resolution, and polygon meshes, which do not easily model processes like cell growth and mitosis. In this work, we propose to represent living cell shapes as level sets of signed distance functions (SDFs) which are estimated by neural networks. We optimize a fully-connected neural network to provide an implicit representation of the SDF value at any point in a 3D+time domain, conditioned on a learned latent code that is disentangled from the rotation of the cell shape. We demonstrate the effectiveness of this approach on cells that exhibit rapid deformations (Platynereis dumerilii), cells that grow and divide (C. elegans), and cells that have growing and branching filopodial protrusions (A549 human lung carcinoma cells). A quantitative evaluation using shape features, Hausdorff distance, and Dice similarity coefficients of real and synthetic cell shapes shows that our model can generate topologically plausible complex cell shapes in 3D+time with high similarity to real living cell shapes. Finally, we show how microscopy images of living cells that correspond to our generated cell shapes can be synthesized using an image-to-image model. ",
    "url": "https://arxiv.org/abs/2304.08960",
    "authors": [
      "David Wiesner",
      "Julian Suk",
      "Sven Dummer",
      "Tereza Nečasová",
      "Vladimír Ulman",
      "David Svoboda",
      "Jelmer M. Wolterink"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2304.08971",
    "title": "SurfelNeRF: Neural Surfel Radiance Fields for Online Photorealistic  Reconstruction of Indoor Scenes",
    "abstract": "Online reconstructing and rendering of large-scale indoor scenes is a long-standing challenge. SLAM-based methods can reconstruct 3D scene geometry progressively in real time but can not render photorealistic results. While NeRF-based methods produce promising novel view synthesis results, their long offline optimization time and lack of geometric constraints pose challenges to efficiently handling online input. Inspired by the complementary advantages of classical 3D reconstruction and NeRF, we thus investigate marrying explicit geometric representation with NeRF rendering to achieve efficient online reconstruction and high-quality rendering. We introduce SurfelNeRF, a variant of neural radiance field which employs a flexible and scalable neural surfel representation to store geometric attributes and extracted appearance features from input images. We further extend the conventional surfel-based fusion scheme to progressively integrate incoming input frames into the reconstructed global neural scene representation. In addition, we propose a highly-efficient differentiable rasterization scheme for rendering neural surfel radiance fields, which helps SurfelNeRF achieve $10\\times$ speedups in training and inference time, respectively. Experimental results show that our method achieves the state-of-the-art 23.82 PSNR and 29.58 PSNR on ScanNet in feedforward inference and per-scene optimization settings, respectively. ",
    "url": "https://arxiv.org/abs/2304.08971",
    "authors": [
      "Yiming Gao",
      "Yan-Pei Cao",
      "Ying Shan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.08975",
    "title": "Neural Architecture Search for Visual Anomaly Segmentation",
    "abstract": "This paper presents AutoPatch, the first application of neural architecture search to the complex task of segmenting visual anomalies. Measurement of anomaly segmentation quality is challenging due to imbalanced anomaly pixels, varying region areas, and various types of anomalies. First, the weighted average precision (wAP) metric is proposed as an alternative to AUROC and AUPRO, which does not need to be limited to a specific maximum FPR. Second, a novel neural architecture search method is proposed, which enables efficient segmentation of visual anomalies without any training. By leveraging a pre-trained supernet, a black-box optimization algorithm can directly minimize FLOPS and maximize wAP on a small validation set of anomalous examples. Finally, compelling results on the widely studied MVTec [3] dataset are presented, demonstrating that AutoPatch outperforms the current state-of-the-art method PatchCore [12] with more than 18x fewer FLOPS, using only one example per anomaly type. These results highlight the potential of automated machine learning to optimize throughput in industrial quality control. The code for AutoPatch is available at: https://github.com/tommiekerssies/AutoPatch ",
    "url": "https://arxiv.org/abs/2304.08975",
    "authors": [
      "Tommie Kerssies"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.08984",
    "title": "Robustness of Visual Explanations to Common Data Augmentation",
    "abstract": "As the use of deep neural networks continues to grow, understanding their behaviour has become more crucial than ever. Post-hoc explainability methods are a potential solution, but their reliability is being called into question. Our research investigates the response of post-hoc visual explanations to naturally occurring transformations, often referred to as augmentations. We anticipate explanations to be invariant under certain transformations, such as changes to the colour map while responding in an equivariant manner to transformations like translation, object scaling, and rotation. We have found remarkable differences in robustness depending on the type of transformation, with some explainability methods (such as LRP composites and Guided Backprop) being more stable than others. We also explore the role of training with data augmentation. We provide evidence that explanations are typically less robust to augmentation than classification performance, regardless of whether data augmentation is used in training or not. ",
    "url": "https://arxiv.org/abs/2304.08984",
    "authors": [
      "Lenka Tětková",
      "Lars Kai Hansen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08996",
    "title": "Joint Age-based Client Selection and Resource Allocation for  Communication-Efficient Federated Learning over NOMA Networks",
    "abstract": "Federated learning (FL) is a promising paradigm that enables distributed clients to collaboratively train a shared global model while keeping the training data locally. However, the performance of FL is often limited by poor communication links and slow convergence when FL is deployed over wireless networks. Besides, due to the limited radio resources, it is crucial to select clients and control resource allocation accurately for improved FL performance. Motivated by these challenges, a joint optimization problem of client selection and resource allocation is formulated in this paper, aiming to minimize the total time consumption of each round in FL over non-orthogonal multiple access (NOMA) enabled wireless network. Specifically, based on a metric termed the age of update (AoU), we first propose a novel client selection scheme by accounting for the staleness of the received local FL models. After that, the closed-form solutions of resource allocation are obtained by monotonicity analysis and dual decomposition method. Moreover, to further improve the performance of FL, the deployment of artificial neural network (ANN) at the server is proposed to predict the local FL models of the unselected clients at each round. Finally, extensive simulation results demonstrate the superior performance of the proposed schemes. ",
    "url": "https://arxiv.org/abs/2304.08996",
    "authors": [
      "Bibo Wu",
      "Fang Fang",
      "Xianbin Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.09010",
    "title": "CF-VAE: Causal Disentangled Representation Learning with VAE and Causal  Flows",
    "abstract": "Learning disentangled representations is important in representation learning, aiming to learn a low dimensional representation of data where each dimension corresponds to one underlying generative factor. Due to the possibility of causal relationships between generative factors, causal disentangled representation learning has received widespread attention. In this paper, we first propose a new flows that can incorporate causal structure information into the model, called causal flows. Based on the variational autoencoders(VAE) commonly used in disentangled representation learning, we design a new model, CF-VAE, which enhances the disentanglement ability of the VAE encoder by utilizing the causal flows. By further introducing the supervision of ground-truth factors, we demonstrate the disentanglement identifiability of our model. Experimental results on both synthetic and real datasets show that CF-VAE can achieve causal disentanglement and perform intervention experiments. Moreover, CF-VAE exhibits outstanding performance on downstream tasks and has the potential to learn causal structure among factors. ",
    "url": "https://arxiv.org/abs/2304.09010",
    "authors": [
      "Di Fan",
      "Yannian Hou",
      "Chuanhou Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2304.09015",
    "title": "PaTeCon: A Pattern-Based Temporal Constraint Mining Method for Conflict  Detection on Knowledge Graphs",
    "abstract": "Temporal facts, the facts for characterizing events that hold in specific time periods, are attracting rising attention in the knowledge graph (KG) research communities. In terms of quality management, the introduction of time restrictions brings new challenges to maintaining the temporal consistency of KGs and detecting potential temporal conflicts. Previous studies rely on manually enumerated temporal constraints to detect conflicts, which are labor-intensive and may have granularity issues. We start from the common pattern of temporal facts and constraints and propose a pattern-based temporal constraint mining method, PaTeCon. PaTeCon uses automatically determined graph patterns and their relevant statistical information over the given KG instead of human experts to generate time constraints. Specifically, PaTeCon dynamically attaches class restriction to candidate constraints according to their measuring scores.We evaluate PaTeCon on two large-scale datasets based on Wikidata and Freebase respectively. The experimental results show that pattern-based automatic constraint mining is powerful in generating valuable temporal constraints. ",
    "url": "https://arxiv.org/abs/2304.09015",
    "authors": [
      "Jianhao Chen",
      "Junyang Ren",
      "Wentao Ding",
      "Yuzhong Qu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.09029",
    "title": "Knowledge Graph Building Blocks: An easy-to-use Framework for developing  FAIREr Knowledge Graphs",
    "abstract": "Knowledge graphs and ontologies provide promising technical solutions for implementing the FAIR Principles for Findable, Accessible, Interoperable, and Reusable data and metadata. However, they also come with their own challenges. Nine such challenges are discussed and associated with the criterion of cognitive interoperability and specific FAIREr principles (FAIR + Explorability raised) that they fail to meet. We introduce an easy-to-use, open source knowledge graph framework that is based on knowledge graph building blocks (KGBBs). KGBBs are small information modules for knowledge-processing, each based on a specific type of semantic unit. By interrelating several KGBBs, one can specify a KGBB-driven FAIREr knowledge graph. Besides implementing semantic units, the KGBB Framework clearly distinguishes and decouples an internal in-memory data model from data storage, data display, and data access/export models. We argue that this decoupling is essential for solving many problems of knowledge management systems. We discuss the architecture of the KGBB Framework as we envision it, comprising (i) an openly accessible KGBB-Repository for different types of KGBBs, (ii) a KGBB-Engine for managing and operating FAIREr knowledge graphs (including automatic provenance tracking, editing changelog, and versioning of semantic units); (iii) a repository for KGBB-Functions; (iv) a low-code KGBB-Editor with which domain experts can create new KGBBs and specify their own FAIREr knowledge graph without having to think about semantic modelling. We conclude with discussing the nine challenges and how the KGBB Framework provides solutions for the issues they raise. While most of what we discuss here is entirely conceptual, we can point to two prototypes that demonstrate the principle feasibility of using semantic units and KGBBs to manage and structure knowledge graphs. ",
    "url": "https://arxiv.org/abs/2304.09029",
    "authors": [
      "Lars Vogt",
      "Marcel Konrad",
      "Manuel Prinz"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2304.09047",
    "title": "Neural Lumped Parameter Differential Equations with Application in  Friction-Stir Processing",
    "abstract": "Lumped parameter methods aim to simplify the evolution of spatially-extended or continuous physical systems to that of a \"lumped\" element representative of the physical scales of the modeled system. For systems where the definition of a lumped element or its associated physics may be unknown, modeling tasks may be restricted to full-fidelity simulations of the physics of a system. In this work, we consider data-driven modeling tasks with limited point-wise measurements of otherwise continuous systems. We build upon the notion of the Universal Differential Equation (UDE) to construct data-driven models for reducing dynamics to that of a lumped parameter and inferring its properties. The flexibility of UDEs allow for composing various known physical priors suitable for application-specific modeling tasks, including lumped parameter methods. The motivating example for this work is the plunge and dwell stages for friction-stir welding; specifically, (i) mapping power input into the tool to a point-measurement of temperature and (ii) using this learned mapping for process control. ",
    "url": "https://arxiv.org/abs/2304.09047",
    "authors": [
      "James Koch",
      "WoongJo Choi",
      "Ethan King",
      "David Garcia",
      "Hrishikesh Das",
      "Tianhao Wang",
      "Ken Ross",
      "Keerti Kappagantula"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2304.09048",
    "title": "CodeKGC: Code Language Model for Generative Knowledge Graph Construction",
    "abstract": "Current generative knowledge graph construction approaches usually fail to capture structural knowledge by simply flattening natural language into serialized texts or a specification language. However, large generative language model trained on structured data such as code has demonstrated impressive capability in understanding natural language for structural prediction and reasoning tasks. Intuitively, we address the task of generative knowledge graph construction with code language model: given a code-format natural language input, the target is to generate triples which can be represented as code completion tasks. Specifically, we develop schema-aware prompts that effectively utilize the semantic structure within the knowledge graph. As code inherently possesses structure, such as class and function definitions, it serves as a useful model for prior semantic structural knowledge. Furthermore, we employ a rationale-enhanced generation method to boost the performance. Rationales provide intermediate steps, thereby improving knowledge extraction abilities. Experimental results indicate that the proposed approach can obtain better performance on benchmark datasets compared with baselines. Code and datasets are available in https://github.com/zjunlp/DeepKE/tree/main/example/llm. ",
    "url": "https://arxiv.org/abs/2304.09048",
    "authors": [
      "Zhen Bi",
      "Jing Chen",
      "Yinuo Jiang",
      "Feiyu Xiong",
      "Wei Guo",
      "Huajun Chen",
      "Ningyu Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2304.09062",
    "title": "Always Strengthen Your Strengths: A Drift-Aware Incremental Learning  Framework for CTR Prediction",
    "abstract": "Click-through rate (CTR) prediction is of great importance in recommendation systems and online advertising platforms. When served in industrial scenarios, the user-generated data observed by the CTR model typically arrives as a stream. Streaming data has the characteristic that the underlying distribution drifts over time and may recur. This can lead to catastrophic forgetting if the model simply adapts to new data distribution all the time. Also, it's inefficient to relearn distribution that has been occurred. Due to memory constraints and diversity of data distributions in large-scale industrial applications, conventional strategies for catastrophic forgetting such as replay, parameter isolation, and knowledge distillation are difficult to be deployed. In this work, we design a novel drift-aware incremental learning framework based on ensemble learning to address catastrophic forgetting in CTR prediction. With explicit error-based drift detection on streaming data, the framework further strengthens well-adapted ensembles and freezes ensembles that do not match the input distribution avoiding catastrophic interference. Both evaluations on offline experiments and A/B test shows that our method outperforms all baselines considered. ",
    "url": "https://arxiv.org/abs/2304.09062",
    "authors": [
      "Congcong Liu",
      "Fei Teng",
      "Xiwei Zhao",
      "Zhangang Lin",
      "Jinghe Hu",
      "Jingping Shao"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.09093",
    "title": "Improving Items and Contexts Understanding with Descriptive Graph for  Conversational Recommendation",
    "abstract": "State-of-the-art methods on conversational recommender systems (CRS) leverage external knowledge to enhance both items' and contextual words' representations to achieve high quality recommendations and responses generation. However, the representations of the items and words are usually modeled in two separated semantic spaces, which leads to misalignment issue between them. Consequently, this will cause the CRS to only achieve a sub-optimal ranking performance, especially when there is a lack of sufficient information from the user's input. To address limitations of previous works, we propose a new CRS framework KLEVER, which jointly models items and their associated contextual words in the same semantic space. Particularly, we construct an item descriptive graph from the rich items' textual features, such as item description and categories. Based on the constructed descriptive graph, KLEVER jointly learns the embeddings of the words and items, towards enhancing both recommender and dialog generation modules. Extensive experiments on benchmarking CRS dataset demonstrate that KLEVER achieves superior performance, especially when the information from the users' responses is lacking. ",
    "url": "https://arxiv.org/abs/2304.09093",
    "authors": [
      "Huy Dao",
      "Dung D. Le",
      "Cuong Chu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.09097",
    "title": "Sheaf Neural Networks for Graph-based Recommender Systems",
    "abstract": "Recent progress in Graph Neural Networks has resulted in wide adoption by many applications, including recommendation systems. The reason for Graph Neural Networks' superiority over other approaches is that many problems in recommendation systems can be naturally modeled as graphs, where nodes can be either users or items and edges represent preference relationships. In current Graph Neural Network approaches, nodes are represented with a static vector learned at training time. This static vector might only be suitable to capture some of the nuances of users or items they define. To overcome this limitation, we propose using a recently proposed model inspired by category theory: Sheaf Neural Networks. Sheaf Neural Networks, and its connected Laplacian, can address the previous problem by associating every node (and edge) with a vector space instead than a single vector. The vector space representation is richer and allows picking the proper representation at inference time. This approach can be generalized for different related tasks on graphs and achieves state-of-the-art performance in terms of F1-Score@N in collaborative filtering and Hits@20 in link prediction. For collaborative filtering, the approach is evaluated on the MovieLens 100K with a 5.1% improvement, on MovieLens 1M with a 5.4% improvement and on Book-Crossing with a 2.8% improvement, while for link prediction on the ogbl-ddi dataset with a 1.6% refinement with respect to the respective baselines. ",
    "url": "https://arxiv.org/abs/2304.09097",
    "authors": [
      "Antonio Purificato",
      "Giulia Cassarà",
      "Pietro Liò",
      "Fabrizio Silvestri"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.09100",
    "title": "Real Time Bearing Fault Diagnosis Based on Convolutional Neural Network  and STM32 Microcontroller",
    "abstract": "With the rapid development of big data and edge computing, many researchers focus on improving the accuracy of bearing fault classification using deep learning models, and implementing the deep learning classification model on limited resource platforms such as STM32. To this end, this paper realizes the identification of bearing fault vibration signal based on convolutional neural network, the fault identification accuracy of the optimised model can reach 98.9%. In addition, this paper successfully applies the convolutional neural network model to STM32H743VI microcontroller, the running time of each diagnosis is 19ms. Finally, a complete real-time communication framework between the host computer and the STM32 is designed, which can perfectly complete the data transmission through the serial port and display the diagnosis results on the TFT-LCD screen. ",
    "url": "https://arxiv.org/abs/2304.09100",
    "authors": [
      "Wenhao Liao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.09101",
    "title": "LaSNN: Layer-wise ANN-to-SNN Distillation for Effective and Efficient  Training in Deep Spiking Neural Networks",
    "abstract": "Spiking Neural Networks (SNNs) are biologically realistic and practically promising in low-power computation because of their event-driven mechanism. Usually, the training of SNNs suffers accuracy loss on various tasks, yielding an inferior performance compared with ANNs. A conversion scheme is proposed to obtain competitive accuracy by mapping trained ANNs' parameters to SNNs with the same structures. However, an enormous number of time steps are required for these converted SNNs, thus losing the energy-efficient benefit. Utilizing both the accuracy advantages of ANNs and the computing efficiency of SNNs, a novel SNN training framework is proposed, namely layer-wise ANN-to-SNN knowledge distillation (LaSNN). In order to achieve competitive accuracy and reduced inference latency, LaSNN transfers the learning from a well-trained ANN to a small SNN by distilling the knowledge other than converting the parameters of ANN. The information gap between heterogeneous ANN and SNN is bridged by introducing the attention scheme, the knowledge in an ANN is effectively compressed and then efficiently transferred by utilizing our layer-wise distillation paradigm. We conduct detailed experiments to demonstrate the effectiveness, efficacy, and scalability of LaSNN on three benchmark data sets (CIFAR-10, CIFAR-100, and Tiny ImageNet). We achieve competitive top-1 accuracy compared to ANNs and 20x faster inference than converted SNNs with similar performance. More importantly, LaSNN is dexterous and extensible that can be effortlessly developed for SNNs with different architectures/depths and input encoding methods, contributing to their potential development. ",
    "url": "https://arxiv.org/abs/2304.09101",
    "authors": [
      "Di Hong",
      "Jiangrong Shen",
      "Yu Qi",
      "Yueming Wang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.09115",
    "title": "CDFI: Cross Domain Feature Interaction for Robust Bronchi Lumen  Detection",
    "abstract": "Endobronchial intervention is increasingly used as a minimally invasive means for the treatment of pulmonary diseases. In order to reduce the difficulty of manipulation in complex airway networks, robust lumen detection is essential for intraoperative guidance. However, these methods are sensitive to visual artifacts which are inevitable during the surgery. In this work, a cross domain feature interaction (CDFI) network is proposed to extract the structural features of lumens, as well as to provide artifact cues to characterize the visual features. To effectively extract the structural and artifact features, the Quadruple Feature Constraints (QFC) module is designed to constrain the intrinsic connections of samples with various imaging-quality. Furthermore, we design a Guided Feature Fusion (GFF) module to supervise the model for adaptive feature fusion based on different types of artifacts. Results show that the features extracted by the proposed method can preserve the structural information of lumen in the presence of large visual variations, bringing much-improved lumen detection accuracy. ",
    "url": "https://arxiv.org/abs/2304.09115",
    "authors": [
      "Jiasheng Xu",
      "Tianyi Zhang",
      "Yangqian Wu",
      "Jie Yang",
      "Guang-Zhong Yang",
      "Yun Gu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.09121",
    "title": "Fast Neural Scene Flow",
    "abstract": "Scene flow is an important problem as it provides low-level motion cues for many downstream tasks. State-of-the-art learning methods are usually fast and can achieve impressive performance on in-domain data, but usually fail to generalize to out-of-the-distribution (OOD) data or handle dense point clouds. In this paper, we focus on a runtime optimization-based neural scene flow pipeline. In (a) one can see its application in the densification of lidar. However, in (c) one sees that the major drawback is the extensive computation time. We identify that the common speedup strategy in network architectures for coordinate networks has little effect on scene flow acceleration [see green (b)] unlike image reconstruction [see pink (b)]. With the dominant computational burden stemming instead from the Chamfer loss function, we propose to use a distance transform-based loss function to accelerate [see purple (b)], which achieves up to 30x speedup and on-par estimation performance compared to NSFP [see (c)]. When tested on 8k points, it is as efficient [see (c)] as leading learning methods, achieving real-time performance. ",
    "url": "https://arxiv.org/abs/2304.09121",
    "authors": [
      "Xueqian Li",
      "Jianqiao Zheng",
      "Francesco Ferroni",
      "Jhony Kaesemodel Pontes",
      "Simon Lucey"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.09131",
    "title": "Variational Relational Point Completion Network for Robust 3D  Classification",
    "abstract": "Real-scanned point clouds are often incomplete due to viewpoint, occlusion, and noise, which hampers 3D geometric modeling and perception. Existing point cloud completion methods tend to generate global shape skeletons and hence lack fine local details. Furthermore, they mostly learn a deterministic partial-to-complete mapping, but overlook structural relations in man-made objects. To tackle these challenges, this paper proposes a variational framework, Variational Relational point Completion Network (VRCNet) with two appealing properties: 1) Probabilistic Modeling. In particular, we propose a dual-path architecture to enable principled probabilistic modeling across partial and complete clouds. One path consumes complete point clouds for reconstruction by learning a point VAE. The other path generates complete shapes for partial point clouds, whose embedded distribution is guided by distribution obtained from the reconstruction path during training. 2) Relational Enhancement. Specifically, we carefully design point self-attention kernel and point selective kernel module to exploit relational point features, which refines local shape details conditioned on the coarse completion. In addition, we contribute multi-view partial point cloud datasets (MVP and MVP-40 dataset) containing over 200,000 high-quality scans, which render partial 3D shapes from 26 uniformly distributed camera poses for each 3D CAD model. Extensive experiments demonstrate that VRCNet outperforms state-of-the-art methods on all standard point cloud completion benchmarks. Notably, VRCNet shows great generalizability and robustness on real-world point cloud scans. Moreover, we can achieve robust 3D classification for partial point clouds with the help of VRCNet, which can highly increase classification accuracy. ",
    "url": "https://arxiv.org/abs/2304.09131",
    "authors": [
      "Liang Pan",
      "Xinyi Chen",
      "Zhongang Cai",
      "Junzhe Zhang",
      "Haiyu Zhao",
      "Shuai Yi",
      "Ziwei Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.09162",
    "title": "Robust Calibrate Proxy Loss for Deep Metric Learning",
    "abstract": "The mainstream researche in deep metric learning can be divided into two genres: proxy-based and pair-based methods. Proxy-based methods have attracted extensive attention due to the lower training complexity and fast network convergence. However, these methods have limitations as the poxy optimization is done by network, which makes it challenging for the proxy to accurately represent the feature distrubtion of the real class of data. In this paper, we propose a Calibrate Proxy (CP) structure, which uses the real sample information to improve the similarity calculation in proxy-based loss and introduces a calibration loss to constraint the proxy optimization towards the center of the class features. At the same time, we set a small number of proxies for each class to alleviate the impact of intra-class differences on retrieval performance. The effectiveness of our method is evaluated by extensive experiments on three public datasets and multiple synthetic label-noise datasets. The results show that our approach can effectively improve the performance of commonly used proxy-based losses on both regular and noisy datasets. ",
    "url": "https://arxiv.org/abs/2304.09162",
    "authors": [
      "Xinyue Li",
      "Jian Wang",
      "Wei Song",
      "Yanling Du",
      "Zhixiang Liu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.11138",
    "title": "Fault Detection via Occupation Kernel Principal Component Analysis",
    "abstract": "The reliable operation of automatic systems is heavily dependent on the ability to detect faults in the underlying dynamical system. While traditional model-based methods have been widely used for fault detection, data-driven approaches have garnered increasing attention due to their ease of deployment and minimal need for expert knowledge. In this paper, we present a novel principal component analysis (PCA) method that uses occupation kernels. Occupation kernels result in feature maps that are tailored to the measured data, have inherent noise-robustness due to the use of integration, and can utilize irregularly sampled system trajectories of variable lengths for PCA. The occupation kernel PCA method is used to develop a reconstruction error approach to fault detection and its efficacy is validated using numerical simulations. ",
    "url": "https://arxiv.org/abs/2303.11138",
    "authors": [
      "Zachary Morrison",
      "Benjamin P. Russo",
      "Yingzhao Lian",
      "Rushikesh Kamalapurkar"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.08658",
    "title": "In-situ surface porosity prediction in DED (directed energy deposition)  printed SS316L parts using multimodal sensor fusion",
    "abstract": "This study aims to relate the time-frequency patterns of acoustic emission (AE) and other multi-modal sensor data collected in a hybrid directed energy deposition (DED) process to the pore formations at high spatial (0.5 mm) and time (< 1ms) resolutions. Adapting an explainable AI method in LIME (Local Interpretable Model-Agnostic Explanations), certain high-frequency waveform signatures of AE are to be attributed to two major pathways for pore formation in a DED process, namely, spatter events and insufficient fusion between adjacent printing tracks from low heat input. This approach opens an exciting possibility to predict, in real-time, the presence of a pore in every voxel (0.5 mm in size) as they are printed, a major leap forward compared to prior efforts. Synchronized multimodal sensor data including force, AE, vibration and temperature were gathered while an SS316L material sample was printed and subsequently machined. A deep convolution neural network classifier was used to identify the presence of pores on a voxel surface based on time-frequency patterns (spectrograms) of the sensor data collected during the process chain. The results suggest signals collected during DED were more sensitive compared to those from machining for detecting porosity in voxels (classification test accuracy of 87%). The underlying explanations drawn from LIME analysis suggests that energy captured in high frequency AE waveforms are 33% lower for porous voxels indicating a relatively lower laser-material interaction in the melt pool, and hence insufficient fusion and poor overlap between adjacent printing tracks. The porous voxels for which spatter events were prevalent during printing had about 27% higher energy contents in the high frequency AE band compared to other porous voxels. These signatures from AE signal can further the understanding of pore formation from spatter and insufficient fusion. ",
    "url": "https://arxiv.org/abs/2304.08658",
    "authors": [
      "Adithyaa Karthikeyan",
      "Himanshu Balhara",
      "Andreas K Lianos",
      "Abhishek Hanchate",
      "Satish TS Bukkapatnam"
    ],
    "subjectives": [
      "Applied Physics (physics.app-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08707",
    "title": "Neural Speech Enhancement with Very Low Algorithmic Latency and  Complexity via Integrated Full- and Sub-Band Modeling",
    "abstract": "We propose FSB-LSTM, a novel long short-term memory (LSTM) based architecture that integrates full- and sub-band (FSB) modeling, for single- and multi-channel speech enhancement in the short-time Fourier transform (STFT) domain. The model maintains an information highway to flow an over-complete input representation through multiple FSB-LSTM modules. Each FSB-LSTM module consists of a full-band block to model spectro-temporal patterns at all frequencies and a sub-band block to model patterns within each sub-band, where each of the two blocks takes a down-sampled representation as input and returns an up-sampled discriminative representation to be added to the block input via a residual connection. The model is designed to have a low algorithmic complexity, a small run-time buffer and a very low algorithmic latency, at the same time producing a strong enhancement performance on a noisy-reverberant speech enhancement task even if the hop size is as low as $2$ ms. ",
    "url": "https://arxiv.org/abs/2304.08707",
    "authors": [
      "Zhong-Qiu Wang",
      "Samuele Cornell",
      "Shukjae Choi",
      "Younglo Lee",
      "Byeong-Yeol Kim",
      "Shinji Watanabe"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2304.08837",
    "title": "Sensor Fault Detection and Isolation in Autonomous Nonlinear Systems  Using Neural Network-Based Observers",
    "abstract": "This paper presents a new observer-based approach to detect and isolate faulty sensors in industrial systems. Two types of sensor faults are considered: complete failure and sensor deterioration. The proposed method is applicable to general autonomous nonlinear systems without making any assumptions about its triangular and/or normal form, which is usually considered in the observer design literature. The key aspect of our approach is a learning-based design of the Luenberger observer, which involves using a neural network to approximate the injective map that transforms the nonlinear system into a stable linear system with output injection. This learning-based Luenberger observer accurately estimates the system's state, allowing for the detection of sensor faults through residual generation. The residual is computed as the norm of the difference between the system's measured output and the observer's predicted output vectors. Fault isolation is achieved by comparing each sensor's measurement with its corresponding predicted value. We demonstrate the effectiveness of our approach in capturing and isolating sensor faults while remaining robust in the presence of measurement noise and system uncertainty. We validate our method through numerical simulations of sensor faults in a network of Kuramoto oscillators. ",
    "url": "https://arxiv.org/abs/2304.08837",
    "authors": [
      "John Cao",
      "Muhammad Umar B. Niazi",
      "Karl Henrik Johansson"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2304.08881",
    "title": "Segmentation of glioblastomas in early post-operative multi-modal MRI  with deep neural networks",
    "abstract": "Extent of resection after surgery is one of the main prognostic factors for patients diagnosed with glioblastoma. To achieve this, accurate segmentation and classification of residual tumor from post-operative MR images is essential. The current standard method for estimating it is subject to high inter- and intra-rater variability, and an automated method for segmentation of residual tumor in early post-operative MRI could lead to a more accurate estimation of extent of resection. In this study, two state-of-the-art neural network architectures for pre-operative segmentation were trained for the task. The models were extensively validated on a multicenter dataset with nearly 1000 patients, from 12 hospitals in Europe and the United States. The best performance achieved was a 61\\% Dice score, and the best classification performance was about 80\\% balanced accuracy, with a demonstrated ability to generalize across hospitals. In addition, the segmentation performance of the best models was on par with human expert raters. The predicted segmentations can be used to accurately classify the patients into those with residual tumor, and those with gross total resection. ",
    "url": "https://arxiv.org/abs/2304.08881",
    "authors": [
      "Ragnhild Holden Helland",
      "Alexandros Ferles",
      "André Pedersen",
      "Ivar Kommers",
      "Hilko Ardon",
      "Frederik Barkhof",
      "Lorenzo Bello",
      "Mitchel S. Berger",
      "Tora Dunås",
      "Marco Conti Nibali",
      "Julia Furtner",
      "Shawn Hervey-Jumper",
      "Albert J. S. Idema",
      "Barbara Kiesel",
      "Rishi Nandoe Tewari",
      "Emmanuel Mandonnet",
      "Domenique M.J. Müller",
      "Pierre A. Robe",
      "Marco Rossi",
      "Lisa M. Sagberg",
      "Tommaso Sciortino",
      "Tom Aalders",
      "Michiel Wagemakers",
      "Georg Widhalm",
      "Marnix G. Witte",
      "Aeilko H. Zwinderman",
      "Paulina L. Majewska",
      "Asgeir S. Jakola",
      "Ole Solheim",
      "Philip C. De Witt Hamer",
      "Ingerid Reinertsen",
      "Roelant S. Eijgelaar",
      "David Bouget"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08883",
    "title": "Parameterized Neural Networks for Finance",
    "abstract": "We discuss and analyze a neural network architecture, that enables learning a model class for a set of different data samples rather than just learning a single model for a specific data sample. In this sense, it may help to reduce the overfitting problem, since, after learning the model class over a larger data sample consisting of such different data sets, just a few parameters need to be adjusted for modeling a new, specific problem. After analyzing the method theoretically and by regression examples for different one-dimensional problems, we finally apply the approach to one of the standard problems asset managers and banks are facing: the calibration of spread curves. The presented results clearly show the potential that lies within this method. Furthermore, this application is of particular interest to financial practitioners, since nearly all asset managers and banks which are having solutions in place may need to adapt or even change their current methodologies when ESG ratings additionally affect the bond spreads. ",
    "url": "https://arxiv.org/abs/2304.08883",
    "authors": [
      "Daniel Oeltz",
      "Jan Hamaekers",
      "Kay F. Pilz"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.09050",
    "title": "Decoding Neural Activity to Assess Individual Latent State in  Ecologically Valid Contexts",
    "abstract": "There exist very few ways to isolate cognitive processes, historically defined via highly controlled laboratory studies, in more ecologically valid contexts. Specifically, it remains unclear as to what extent patterns of neural activity observed under such constraints actually manifest outside the laboratory in a manner that can be used to make an accurate inference about the latent state, associated cognitive process, or proximal behavior of the individual. Improving our understanding of when and how specific patterns of neural activity manifest in ecologically valid scenarios would provide validation for laboratory-based approaches that study similar neural phenomena in isolation and meaningful insight into the latent states that occur during complex tasks. We argue that domain generalization methods from the brain-computer interface community have the potential to address this challenge. We previously used such an approach to decode phasic neural responses associated with visual target discrimination. Here, we extend that work to more tonic phenomena such as internal latent states. We use data from two highly controlled laboratory paradigms to train two separate domain-generalized models. We apply the trained models to an ecologically valid paradigm in which participants performed multiple, concurrent driving-related tasks. Using the pretrained models, we derive estimates of the underlying latent state and associated patterns of neural activity. Importantly, as the patterns of neural activity change along the axis defined by the original training data, we find changes in behavior and task performance consistent with the observations from the original, laboratory paradigms. We argue that these results lend ecological validity to those experimental designs and provide a methodology for understanding the relationship between observed neural activity and behavior during complex tasks. ",
    "url": "https://arxiv.org/abs/2304.09050",
    "authors": [
      "Stephen M. Gordon",
      "Jonathan R. McDaniel",
      "Kevin W. King",
      "Vernon J. Lawhern",
      "Jonathan Touryan"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.09067",
    "title": "Performance of GAN-based augmentation for deep learning COVID-19 image  classification",
    "abstract": "The biggest challenge in the application of deep learning to the medical domain is the availability of training data. Data augmentation is a typical methodology used in machine learning when confronted with a limited data set. In a classical approach image transformations i.e. rotations, cropping and brightness changes are used. In this work, a StyleGAN2-ADA model of Generative Adversarial Networks is trained on the limited COVID-19 chest X-ray image set. After assessing the quality of generated images they are used to increase the training data set improving its balance between classes. We consider the multi-class classification problem of chest X-ray images including the COVID-19 positive class that hasn't been yet thoroughly explored in the literature. Results of transfer learning-based classification of COVID-19 chest X-ray images are presented. The performance of several deep convolutional neural network models is compared. The impact on the detection performance of classical image augmentations i.e. rotations, cropping, and brightness changes are studied. Furthermore, classical image augmentation is compared with GAN-based augmentation. The most accurate model is an EfficientNet-B0 with an accuracy of 90.2 percent, trained on a dataset with a simple class balancing. The GAN augmentation approach is found to be subpar to classical methods for the considered dataset. ",
    "url": "https://arxiv.org/abs/2304.09067",
    "authors": [
      "Oleksandr Fedoruk",
      "Konrad Klimaszewski",
      "Aleksander Ogonowski",
      "Rafał Możdżonek"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2304.09133",
    "title": "Detection and Classification of Glioblastoma Brain Tumor",
    "abstract": "Glioblastoma brain tumors are highly malignant and often require early detection and accurate segmentation for effective treatment. We are proposing two deep learning models in this paper, namely UNet and Deeplabv3, for the detection and segmentation of glioblastoma brain tumors using preprocessed brain MRI images. The performance evaluation is done for these models in terms of accuracy and computational efficiency. Our experimental results demonstrate that both UNet and Deeplabv3 models achieve accurate detection and segmentation of glioblastoma brain tumors. However, Deeplabv3 outperforms UNet in terms of accuracy, albeit at the cost of requiring more computational resources. Our proposed models offer a promising approach for the early detection and segmentation of glioblastoma brain tumors, which can aid in effective treatment strategies. Further research can focus on optimizing the computational efficiency of the Deeplabv3 model while maintaining its high accuracy for real-world clinical applications. Overall, our approach works and contributes to the field of medical image analysis and deep learning-based approaches for brain tumor detection and segmentation. Our suggested models can have a major influence on the prognosis and treatment of people with glioblastoma, a fatal form of brain cancer. It is necessary to conduct more research to examine the practical use of these models in real-life healthcare settings. ",
    "url": "https://arxiv.org/abs/2304.09133",
    "authors": [
      "Utkarsh Maurya",
      "Appisetty Krishna Kalyan",
      "Swapnil Bohidar",
      "Dr. S. Sivakumar"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.09157",
    "title": "Neural networks for geospatial data",
    "abstract": "Analysis of geospatial data has traditionally been model-based, with a mean model, customarily specified as a linear regression on the covariates, and a covariance model, encoding the spatial dependence. We relax the strong assumption of linearity and propose embedding neural networks directly within the traditional geostatistical models to accommodate non-linear mean functions while retaining all other advantages including use of Gaussian Processes to explicitly model the spatial covariance, enabling inference on the covariate effect through the mean and on the spatial dependence through the covariance, and offering predictions at new locations via kriging. We propose NN-GLS, a new neural network estimation algorithm for the non-linear mean in GP models that explicitly accounts for the spatial covariance through generalized least squares (GLS), the same loss used in the linear case. We show that NN-GLS admits a representation as a special type of graph neural network (GNN). This connection facilitates use of standard neural network computational techniques for irregular geospatial data, enabling novel and scalable mini-batching, backpropagation, and kriging schemes. Theoretically, we show that NN-GLS will be consistent for irregularly observed spatially correlated data processes. To our knowledge this is the first asymptotic consistency result for any neural network algorithm for spatial data. We demonstrate the methodology through simulated and real datasets. ",
    "url": "https://arxiv.org/abs/2304.09157",
    "authors": [
      "Wentao Zhan",
      "Abhirup Datta"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:1904.02345",
    "title": "Preference Neural Network",
    "abstract": " Comments: Accepted for publication ",
    "url": "https://arxiv.org/abs/1904.02345",
    "authors": [
      "Ayman Elgharabawy",
      "Mukesh Prasad",
      "Chin-Teng Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:1907.02677",
    "title": "Interpretable Learning in Multivariate Big Data Analysis for Network  Monitoring",
    "abstract": " Title: Interpretable Learning in Multivariate Big Data Analysis for Network  Monitoring ",
    "url": "https://arxiv.org/abs/1907.02677",
    "authors": [
      "José Camacho",
      "Katarzyna Wasielewska",
      "Rasmus Bro",
      "David Kotz"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2104.14654",
    "title": "Adversarial Inverse Reinforcement Learning for Mean Field Games",
    "abstract": " Comments: Accepted to AAMAS 2023 ",
    "url": "https://arxiv.org/abs/2104.14654",
    "authors": [
      "Yang Chen",
      "Libo Zhang",
      "Jiamou Liu",
      "Michael Witbrock"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.08574",
    "title": "A Modulation Layer to Increase Neural Network Robustness Against Data  Quality Issues",
    "abstract": " Title: A Modulation Layer to Increase Neural Network Robustness Against Data  Quality Issues ",
    "url": "https://arxiv.org/abs/2107.08574",
    "authors": [
      "Mohamed Abdelhack",
      "Jiaming Zhang",
      "Sandhya Tripathi",
      "Bradley A Fritz",
      "Daniel Felsky",
      "Michael S Avidan",
      "Yixin Chen",
      "Christopher R King"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2110.01086",
    "title": "Assessing Distribution Network Flexibility via Reliability-based P-Q  Area Segmentation",
    "abstract": " Comments: Submitted to PSCC 2022, then resubmitted to IEEE PowerTech 2023 conference ",
    "url": "https://arxiv.org/abs/2110.01086",
    "authors": [
      "Andrey Churkin",
      "Wangwei Kong",
      "Jose N. Melchor Gutierrez",
      "Pierluigi Mancarella",
      "Eduardo A. Martinez Cesena"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2110.14357",
    "title": "Binarized ResNet: Enabling Robust Automatic Modulation Classification at  the resource-constrained Edge",
    "abstract": " Comments: This version has a total of 8 figures and 3 tables. It has extra content on the adversarial robustness of the proposed method that was not present in the previous submission. Also one more ensemble method called RBLResNet-MCK is proposed to improve the performance further ",
    "url": "https://arxiv.org/abs/2110.14357",
    "authors": [
      "Deepsayan Sadhukhan",
      "Nitin Priyadarshini Shankar",
      "Nancy Nayak",
      "Thulasi Tholeti",
      "Sheetal Kalyani"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2111.13621",
    "title": "An Optimal Algorithm for Finding Champions in Tournament Graphs",
    "abstract": " Title: An Optimal Algorithm for Finding Champions in Tournament Graphs ",
    "url": "https://arxiv.org/abs/2111.13621",
    "authors": [
      "Lorenzo Beretta",
      "Franco Maria Nardini",
      "Roberto Trani",
      "Rossano Venturini"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2111.14712",
    "title": "Prediction of Large Magnetic Moment Materials With Graph Neural Networks  and Random Forests",
    "abstract": " Title: Prediction of Large Magnetic Moment Materials With Graph Neural Networks  and Random Forests ",
    "url": "https://arxiv.org/abs/2111.14712",
    "authors": [
      "Sékou-Oumar Kaba",
      "Benjamin Groleau-Paré",
      "Marc-Antoine Gauthier",
      "André-Marie Tremblay",
      "Simon Verret",
      "Chloé Gauvin-Ndiaye"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.05848",
    "title": "Faster Deep Reinforcement Learning with Slower Online Network",
    "abstract": " Comments: Published at the Thirty-sixth Conference on Neural Information Processing Systems (NeurIPS 2022) ",
    "url": "https://arxiv.org/abs/2112.05848",
    "authors": [
      "Kavosh Asadi",
      "Rasool Fakoor",
      "Omer Gottesman",
      "Taesup Kim",
      "Michael L. Littman",
      "Alexander J. Smola"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.07646",
    "title": "A Survey on Training Challenges in Generative Adversarial Networks for  Biomedical Image Analysis",
    "abstract": " Comments: Submitted to the AI Review Journal ",
    "url": "https://arxiv.org/abs/2201.07646",
    "authors": [
      "Muhammad Muneeb Saad",
      "Ruairi O'Reilly",
      "Mubashir Husain Rehmani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.11799",
    "title": "Graph-based Algorithm Unfolding for Energy-aware Power Allocation in  Wireless Networks",
    "abstract": " Comments: Published in IEEE Transactions on Wireless Communications ",
    "url": "https://arxiv.org/abs/2201.11799",
    "authors": [
      "Boning Li",
      "Gunjan Verma",
      "Santiago Segarra"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.06414",
    "title": "A Survey of Adversarial Defences and Robustness in NLP",
    "abstract": " Comments: Accepted for publication at ACM Computing Surveys ",
    "url": "https://arxiv.org/abs/2203.06414",
    "authors": [
      "Shreya Goyal",
      "Sumanth Doddapaneni",
      "Mitesh M.Khapra",
      "Balaraman Ravindran"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.10609",
    "title": "A Novel Transparency Strategy-based Data Augmentation Approach for  BI-RADS Classification of Mammograms",
    "abstract": " Comments: Accepted for presentation at the 22nd IEEE Statistical Signal Processing (SSP) workshop ",
    "url": "https://arxiv.org/abs/2203.10609",
    "authors": [
      "Sam B. Tran",
      "Huyen T. X. Nguyen",
      "Chi Phan",
      "Hieu H. Pham",
      "Ha Q. Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.12777",
    "title": "Kernel Robust Hypothesis Testing",
    "abstract": " Title: Kernel Robust Hypothesis Testing ",
    "url": "https://arxiv.org/abs/2203.12777",
    "authors": [
      "Zhongchang Sun",
      "Shaofeng Zou"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2205.08464",
    "title": "Robust Losses for Learning Value Functions",
    "abstract": " Comments: IEEE Transactions on Pattern Analysis and Machine Intelligence (2022) ",
    "url": "https://arxiv.org/abs/2205.08464",
    "authors": [
      "Andrew Patterson",
      "Victor Liao",
      "Martha White"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.12747",
    "title": "HyGNN: Drug-Drug Interaction Prediction via Hypergraph Neural Network",
    "abstract": " Comments: Some new experiments have been added. One more dataset has been considered. Theoretical part has been updated too ",
    "url": "https://arxiv.org/abs/2206.12747",
    "authors": [
      "Khaled Mohammed Saifuddin",
      "Briana Bumgardner",
      "Farhan Tanvir",
      "Esra Akbas"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.14738",
    "title": "Finding $k$-community structures in special graph classes",
    "abstract": " Comments: 14 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2206.14738",
    "authors": [
      "Narmina Baghirova",
      "Clément Dallard",
      "Bernard Ries",
      "David Schindl"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2207.02715",
    "title": "Open- and Closed-Loop Neural Network Verification using Polynomial  Zonotopes",
    "abstract": " Title: Open- and Closed-Loop Neural Network Verification using Polynomial  Zonotopes ",
    "url": "https://arxiv.org/abs/2207.02715",
    "authors": [
      "Niklas Kochdumper",
      "Christian Schilling",
      "Matthias Althoff",
      "Stanley Bak"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.12647",
    "title": "Cross-Modal Causal Relational Reasoning for Event-Level Visual Question  Answering",
    "abstract": " Comments: 17 pages, 9 figures. This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible. The datasets, code and models are available at this https URL ",
    "url": "https://arxiv.org/abs/2207.12647",
    "authors": [
      "Yang Liu",
      "Guanbin Li",
      "Liang Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.03403",
    "title": "Slice-level Detection of Intracranial Hemorrhage on CT Using Deep  Descriptors of Adjacent Slices",
    "abstract": " Comments: Accepted for presentation at the 22nd IEEE Statistical Signal Processing (SSP) workshop ",
    "url": "https://arxiv.org/abs/2208.03403",
    "authors": [
      "Dat T. Ngo",
      "Thao T.B. Nguyen",
      "Hieu T. Nguyen",
      "Dung B. Nguyen",
      "Ha Q. Nguyen",
      "Hieu H. Pham"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04321",
    "title": "Neural Architecture Search as Multiobjective Optimization Benchmarks:  Problem Formulation and Performance Assessment",
    "abstract": " Title: Neural Architecture Search as Multiobjective Optimization Benchmarks:  Problem Formulation and Performance Assessment ",
    "url": "https://arxiv.org/abs/2208.04321",
    "authors": [
      "Zhichao Lu",
      "Ran Cheng",
      "Yaochu Jin",
      "Kay Chen Tan",
      "Kalyanmoy Deb"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.07649",
    "title": "American cultural regions mapped through the lexical analysis of social  media",
    "abstract": " Comments: 13 pages, 5 figures; contains Supplementary Information ",
    "url": "https://arxiv.org/abs/2208.07649",
    "authors": [
      "Thomas Louf",
      "Bruno Gonçalves",
      "Jose J. Ramasco",
      "David Sanchez",
      "Jack Grieve"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2209.06506",
    "title": "Order-Disorder: Imitation Adversarial Attacks for Black-box Neural  Ranking Models",
    "abstract": " Comments: 15 pages, 4 figures, accepted by ACM CCS 2022, Best Paper Nomination ",
    "url": "https://arxiv.org/abs/2209.06506",
    "authors": [
      "Jiawei Liu",
      "Yangyang Kang",
      "Di Tang",
      "Kaisong Song",
      "Changlong Sun",
      "Xiaofeng Wang",
      "Wei Lu",
      "Xiaozhong Liu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.07778",
    "title": "Spatial-then-Temporal Self-Supervised Learning for Video Correspondence",
    "abstract": " Comments: CVPR 2023 Camera Ready ",
    "url": "https://arxiv.org/abs/2209.07778",
    "authors": [
      "Rui Li",
      "Dong Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.09021",
    "title": "Histopathological Image Classification based on Self-Supervised Vision  Transformer and Weak Labels",
    "abstract": " Title: Histopathological Image Classification based on Self-Supervised Vision  Transformer and Weak Labels ",
    "url": "https://arxiv.org/abs/2210.09021",
    "authors": [
      "Ahmet Gokberk Gul",
      "Oezdemir Cetin",
      "Christoph Reich",
      "Tim Prangemeier",
      "Nadine Flinner",
      "Heinz Koeppl"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.03046",
    "title": "Knowledge is Power: Understanding Causality Makes Legal judgment  Prediction Models More Generalizable and Robust",
    "abstract": " Title: Knowledge is Power: Understanding Causality Makes Legal judgment  Prediction Models More Generalizable and Robust ",
    "url": "https://arxiv.org/abs/2211.03046",
    "authors": [
      "Haotian Chen",
      "Lingwei Zhang",
      "Yiran Liu",
      "Fanchao Chen",
      "Yang Yu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.06134",
    "title": "Active Task Randomization: Learning Robust Skills via Unsupervised  Generation of Diverse and Feasible Tasks",
    "abstract": " Comments: 9 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2211.06134",
    "authors": [
      "Kuan Fang",
      "Toki Migimatsu",
      "Ajay Mandlekar",
      "Li Fei-Fei",
      "Jeannette Bohg"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.10962",
    "title": "PG-Schema: Schemas for Property Graphs",
    "abstract": " Comments: 25 pages ",
    "url": "https://arxiv.org/abs/2211.10962",
    "authors": [
      "Renzo Angles",
      "Angela Bonifati",
      "Stefania Dumbrava",
      "George Fletcher",
      "Alastair Green",
      "Jan Hidders",
      "Bei Li",
      "Leonid Libkin",
      "Victor Marsault",
      "Wim Martens",
      "Filip Murlak",
      "Stefan Plantikow",
      "Ognjen Savković",
      "Michael Schmidt",
      "Juan Sequeda",
      "Sławek Staworko",
      "Dominik Tomaszuk",
      "Hannes Voigt",
      "Domagoj Vrgoč",
      "Mingxi Wu",
      "Dušan Živković"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2212.01108",
    "title": "Multi-scale Transformer Network with Edge-aware Pre-training for  Cross-Modality MR Image Synthesis",
    "abstract": " Comments: 13 pages, 15 figures ",
    "url": "https://arxiv.org/abs/2212.01108",
    "authors": [
      "Yonghao Li",
      "Tao Zhou",
      "Kelei He",
      "Yi Zhou",
      "Dinggang Shen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.02031",
    "title": "Prototypical Residual Networks for Anomaly Detection and Localization",
    "abstract": " Comments: Accepted by CVPR 2023 ",
    "url": "https://arxiv.org/abs/2212.02031",
    "authors": [
      "Hui Zhang",
      "Zuxuan Wu",
      "Zheng Wang",
      "Zhineng Chen",
      "Yu-Gang Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.04690",
    "title": "Benchmarking Self-Supervised Learning on Diverse Pathology Datasets",
    "abstract": " Comments: Accepted to CVPR 2023 ",
    "url": "https://arxiv.org/abs/2212.04690",
    "authors": [
      "Mingu Kang",
      "Heon Song",
      "Seonwook Park",
      "Donggeun Yoo",
      "Sérgio Pereira"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.05245",
    "title": "Joint Spatio-Temporal Modeling for the Semantic Change Detection in  Remote Sensing Images",
    "abstract": " Title: Joint Spatio-Temporal Modeling for the Semantic Change Detection in  Remote Sensing Images ",
    "url": "https://arxiv.org/abs/2212.05245",
    "authors": [
      "Lei Ding",
      "Jing Zhang",
      "Kai Zhang",
      "Haitao Guo",
      "Bing Liu",
      "Lorenzo Bruzzone"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.00752",
    "title": "Point Cloud-based Proactive Link Quality Prediction for Millimeter-wave  Communications",
    "abstract": " Comments: Submitted to IEEE Transactions on Machine Learning in Communications and Networking ",
    "url": "https://arxiv.org/abs/2301.00752",
    "authors": [
      "Shoki Ohta",
      "Takayuki Nishio",
      "Riichi Kudo",
      "Kahoko Takahashi",
      "Hisashi Nagata"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2302.00735",
    "title": "MTP-GO: Graph-Based Probabilistic Multi-Agent Trajectory Prediction with  Neural ODEs",
    "abstract": " Comments: Code: this https URL ",
    "url": "https://arxiv.org/abs/2302.00735",
    "authors": [
      "Theodor Westny",
      "Joel Oskarsson",
      "Björn Olofsson",
      "Erik Frisk"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.00890",
    "title": "Neural Common Neighbor with Completion for Link Prediction",
    "abstract": " Title: Neural Common Neighbor with Completion for Link Prediction ",
    "url": "https://arxiv.org/abs/2302.00890",
    "authors": [
      "Xiyuan Wang",
      "Haotong Yang",
      "Muhan Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.02997",
    "title": "Erasure of Unaligned Attributes from Neural Representations",
    "abstract": " Comments: Accepted to Transactions of the Association for Computational Linguistics, 22 pages (pre-MIT Press publication version) ",
    "url": "https://arxiv.org/abs/2302.02997",
    "authors": [
      "Shun Shao",
      "Yftah Ziser",
      "Shay Cohen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2303.00943",
    "title": "Evolutionary Computation in Action: Feature Selection for Deep Embedding  Spaces of Gigapixel Pathology Images",
    "abstract": " Title: Evolutionary Computation in Action: Feature Selection for Deep Embedding  Spaces of Gigapixel Pathology Images ",
    "url": "https://arxiv.org/abs/2303.00943",
    "authors": [
      "Azam Asilian Bidgoli",
      "Shahryar Rahnamayan",
      "Taher Dehkharghanian",
      "Abtin Riasatian",
      "H.R. Tizhoosh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2303.07771",
    "title": "Imbalanced Domain Generalization for Robust Single Cell Classification  in Hematological Cytomorphology",
    "abstract": " Comments: Published at ICLR 2023 Workshop on Domain Generalization ",
    "url": "https://arxiv.org/abs/2303.07771",
    "authors": [
      "Rao Muhammad Umer",
      "Armin Gruber",
      "Sayedali Shetab Boushehri",
      "Christian Metak",
      "Carsten Marr"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.08366",
    "title": "VENUS: A Geometrical Representation for Quantum State Visualization",
    "abstract": " Title: VENUS: A Geometrical Representation for Quantum State Visualization ",
    "url": "https://arxiv.org/abs/2303.08366",
    "authors": [
      "Shaolun Ruan",
      "Ribo Yuan",
      "Yong Wang",
      "Yanna Lin",
      "Ying Mao",
      "Weiwen Jiang",
      "Zhepeng Wang",
      "Wei Xu",
      "Qiang Guan"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2303.08818",
    "title": "Boosting Convolutional Neural Networks' Protein Binding Site Prediction  Capacity Using SE(3)-invariant transformers, Transfer Learning and  Homology-based Augmentation",
    "abstract": " Comments: Updates in version 2: author order change (making it clear that Bonggun Shin is the corresponding author) ",
    "url": "https://arxiv.org/abs/2303.08818",
    "authors": [
      "Daeseok Lee",
      "Jeunghyun Byun",
      "Bonggun Shin"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2303.10214",
    "title": "BotShape: A Novel Social Bots Detection Approach via Behavioral Patterns",
    "abstract": " Comments: CDKP 2023 ",
    "url": "https://arxiv.org/abs/2303.10214",
    "authors": [
      "Jun Wu",
      "Xuesong Ye",
      "Chengjie Mou"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.10590",
    "title": "Multi-modal Facial Action Unit Detection with Large Pre-trained Models  for the 5th Competition on Affective Behavior Analysis in-the-wild",
    "abstract": " Comments: 8 pages, 7 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2303.10590",
    "authors": [
      "Yufeng Yin",
      "Minh Tran",
      "Di Chang",
      "Xinrui Wang",
      "Mohammad Soleymani"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.11020",
    "title": "Dual-stream Time-Delay Neural Network with Dynamic Global Filter for  Speaker Verification",
    "abstract": " Comments: 13 pages 4 figures ",
    "url": "https://arxiv.org/abs/2303.11020",
    "authors": [
      "Yangfu Li",
      "Xiaodan Lin"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2303.12320",
    "title": "GrapeQA: GRaph Augmentation and Pruning to Enhance Question-Answering",
    "abstract": " Title: GrapeQA: GRaph Augmentation and Pruning to Enhance Question-Answering ",
    "url": "https://arxiv.org/abs/2303.12320",
    "authors": [
      "Dhaval Taunk",
      "Lakshya Khanna",
      "Pavan Kandru",
      "Vasudeva Varma",
      "Charu Sharma",
      "Makarand Tapaswi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2303.13709",
    "title": "Isolation of regular graphs, stars and $k$-chromatic graphs",
    "abstract": " Comments: 10 pages, title slightly modified, more context provided. arXiv admin note: text overlap with arXiv:2110.03773 ",
    "url": "https://arxiv.org/abs/2303.13709",
    "authors": [
      "Peter Borg"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2303.14357",
    "title": "Dealing With Heterogeneous 3D MR Knee Images: A Federated Few-Shot  Learning Method With Dual Knowledge Distillation",
    "abstract": " Title: Dealing With Heterogeneous 3D MR Knee Images: A Federated Few-Shot  Learning Method With Dual Knowledge Distillation ",
    "url": "https://arxiv.org/abs/2303.14357",
    "authors": [
      "Xiaoxiao He",
      "Chaowei Tan",
      "Bo Liu",
      "Liping Si",
      "Weiwu Yao",
      "Liang Zhao",
      "Di Liu",
      "Qilong Zhangli",
      "Qi Chang",
      "Kang Li",
      "Dimitris N. Metaxas"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.15216",
    "title": "Robust Risk-Aware Option Hedging",
    "abstract": " Comments: 16 pages, 14 figures, 1 table ",
    "url": "https://arxiv.org/abs/2303.15216",
    "authors": [
      "David Wu",
      "Sebastian Jaimungal"
    ],
    "subjectives": [
      "Computational Finance (q-fin.CP)",
      "Machine Learning (cs.LG)",
      "Risk Management (q-fin.RM)"
    ]
  },
  {
    "id": "arXiv:2303.16361",
    "title": "Dynamical Modularity in Automata Models of Biochemical Networks",
    "abstract": " Comments: 42 pages, 7 figures; updated author information ",
    "url": "https://arxiv.org/abs/2303.16361",
    "authors": [
      "Thomas Parmer",
      "Luis M. Rocha"
    ],
    "subjectives": [
      "Molecular Networks (q-bio.MN)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2303.17895",
    "title": "EA-BEV: Edge-aware Bird' s-Eye-View Projector for 3D Object Detection",
    "abstract": " Title: EA-BEV: Edge-aware Bird' s-Eye-View Projector for 3D Object Detection ",
    "url": "https://arxiv.org/abs/2303.17895",
    "authors": [
      "Haotian Hu",
      "Fanyi Wang",
      "Jingwen Su",
      "Laifeng Hu",
      "Tianpeng Feng",
      "Zhaokai Zhang",
      "Wangzhi Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.18164",
    "title": "Single Image Depth Prediction Made Better: A Multivariate Gaussian Take",
    "abstract": " Comments: Accepted to IEEE/CVF CVPR 2023. Draft info: 17 pages, 13 Figures, 9 Tables ",
    "url": "https://arxiv.org/abs/2303.18164",
    "authors": [
      "Ce Liu",
      "Suryansh Kumar",
      "Shuhang Gu",
      "Radu Timofte",
      "Luc Van Gool"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01335",
    "title": "Charting the Topography of the Neural Network Landscape with  Thermal-Like Noise",
    "abstract": " Comments: 7 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2304.01335",
    "authors": [
      "Theo Jules",
      "Gal Brener",
      "Tal Kachman",
      "Noam Levi",
      "Yohai Bar-Sinai"
    ],
    "subjectives": [
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02277",
    "title": "Rethinking the Trigger-injecting Position in Graph Backdoor Attack",
    "abstract": " Title: Rethinking the Trigger-injecting Position in Graph Backdoor Attack ",
    "url": "https://arxiv.org/abs/2304.02277",
    "authors": [
      "Jing Xu",
      "Gorka Abad",
      "Stjepan Picek"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.03144",
    "title": "BotTriNet: A Unified and Efficient Embedding for Social Bots Detection  via Metric Learning",
    "abstract": " Title: BotTriNet: A Unified and Efficient Embedding for Social Bots Detection  via Metric Learning ",
    "url": "https://arxiv.org/abs/2304.03144",
    "authors": [
      "Jun Wu",
      "Xuesong Ye",
      "Yanyuet Man"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.03198",
    "title": "RFAConv: Innovating Spatial Attention and Standard Convolutional  Operation",
    "abstract": " Comments: 12 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2304.03198",
    "authors": [
      "Xin Zhang",
      "Chen Liu",
      "Degang Yang",
      "Tingting Song",
      "Yichen Ye",
      "Ke Li",
      "Yingze Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.04163",
    "title": "Energy-Efficient URLLC Service Provision via a Near-Space Information  Network",
    "abstract": " Title: Energy-Efficient URLLC Service Provision via a Near-Space Information  Network ",
    "url": "https://arxiv.org/abs/2304.04163",
    "authors": [
      "Puguang An",
      "Xianbin Cao",
      "Peng Yang",
      "Kun Guo",
      "Yue Gao",
      "Tony Q. S. Quek"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.04589",
    "title": "Hyperspectral Image Super-Resolution via Dual-domain Network Based on  Hybrid Convolution",
    "abstract": " Title: Hyperspectral Image Super-Resolution via Dual-domain Network Based on  Hybrid Convolution ",
    "url": "https://arxiv.org/abs/2304.04589",
    "authors": [
      "Tingting Liu",
      "Yuan Liu",
      "Chuncheng Zhang",
      "Yuan Liyin",
      "Xiubao Sui",
      "Qian Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.05007",
    "title": "Privacy Amplification via Shuffling: Unified, Simplified, and Tightened",
    "abstract": " Comments: This version fixes some typos. Code available at this https URL ",
    "url": "https://arxiv.org/abs/2304.05007",
    "authors": [
      "Shaowei Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.05133",
    "title": "Lecture Notes: Neural Network Architectures",
    "abstract": " Comments: added more references ",
    "url": "https://arxiv.org/abs/2304.05133",
    "authors": [
      "Evelyn Herberg"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.05949",
    "title": "CMOS + stochastic nanomagnets: heterogeneous computers for probabilistic  inference and learning",
    "abstract": " Title: CMOS + stochastic nanomagnets: heterogeneous computers for probabilistic  inference and learning ",
    "url": "https://arxiv.org/abs/2304.05949",
    "authors": [
      "Keito Kobayashi",
      "Nihal Singh",
      "Qixuan Cao",
      "Kemal Selcuk",
      "Tianrui Hu",
      "Shaila Niazi",
      "Navid Anjum Aadit",
      "Shun Kanai",
      "Hideo Ohno",
      "Shunsuke Fukami",
      "Kerem Y. Camsari"
    ],
    "subjectives": [
      "Mesoscale and Nanoscale Physics (cond-mat.mes-hall)",
      "Artificial Intelligence (cs.AI)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06336",
    "title": "Attributed Multi-order Graph Convolutional Network for Heterogeneous  Graphs",
    "abstract": " Title: Attributed Multi-order Graph Convolutional Network for Heterogeneous  Graphs ",
    "url": "https://arxiv.org/abs/2304.06336",
    "authors": [
      "Zhaoliang Chen",
      "Zhihao Wu",
      "Luying Zhong",
      "Claudia Plant",
      "Shiping Wang",
      "Wenzhong Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.06970",
    "title": "H2TNE: Temporal Heterogeneous Information Network Embedding in  Hyperbolic Spaces",
    "abstract": " Title: H2TNE: Temporal Heterogeneous Information Network Embedding in  Hyperbolic Spaces ",
    "url": "https://arxiv.org/abs/2304.06970",
    "authors": [
      "Qijie Bai",
      "Jiawen Guo",
      "Haiwei Zhang",
      "Changli Nie",
      "Lin Zhang",
      "Xiaojie Yuan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.07689",
    "title": "Learning Empirical Bregman Divergence for Uncertain Distance  Representation",
    "abstract": " Comments: Accepted by IEEE FUSION 2023 ",
    "url": "https://arxiv.org/abs/2304.07689",
    "authors": [
      "Zhiyuan Li",
      "Ziru Liu",
      "Anna Zou",
      "Anca L. Ralescu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.07741",
    "title": "Canvas: End-to-End Kernel Architecture Search in Neural Networks",
    "abstract": " Title: Canvas: End-to-End Kernel Architecture Search in Neural Networks ",
    "url": "https://arxiv.org/abs/2304.07741",
    "authors": [
      "Chenggang Zhao",
      "Genghan Zhang",
      "Mingyu Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2304.07869",
    "title": "Neural Machine Translation For Low Resource Languages",
    "abstract": " Title: Neural Machine Translation For Low Resource Languages ",
    "url": "https://arxiv.org/abs/2304.07869",
    "authors": [
      "Vakul Goyle",
      "Parvathy Krishnaswamy",
      "Kannan Girija Ravikumar",
      "Utsa Chattopadhyay",
      "Kartikay Goyle"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.08297",
    "title": "Comments on 'Fast and scalable search of whole-slide images via  self-supervised deep learning'",
    "abstract": " Title: Comments on 'Fast and scalable search of whole-slide images via  self-supervised deep learning' ",
    "url": "https://arxiv.org/abs/2304.08297",
    "authors": [
      "Milad Sikaroudi",
      "Mehdi Afshari",
      "Abubakr Shafique",
      "Shivam Kalra",
      "H.R. Tizhoosh"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08401",
    "title": "Multimodal Short Video Rumor Detection System Based on Contrastive  Learning",
    "abstract": " Title: Multimodal Short Video Rumor Detection System Based on Contrastive  Learning ",
    "url": "https://arxiv.org/abs/2304.08401",
    "authors": [
      "Yuxing Yang",
      "Junhao Zhao",
      "Siyi Wang",
      "Xiangyu Min",
      "Pengchao Wang",
      "Haizhou Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.08458",
    "title": "Secrecy Design of Indoor Visible Light Communication Network under  Downlink NOMA Transmission",
    "abstract": " Comments: 30 pages, 13 figures. This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2304.08458",
    "authors": [
      "Tianji Shen",
      "Vamoua Yachongka",
      "Yuto Hama",
      "Hideki Ochiai"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  }
]