[
  {
    "id": "arXiv:2308.04438",
    "title": "Digital Healthcare in The Metaverse: Insights into Privacy and Security",
    "abstract": "In this article, we study the privacy and security aspects of the metaverse in the context of digital healthcare. Our studies include the security aspects of data collection and communications for access to the metaverse, the privacy and security threats of employing Machine Learning and Artificial Intelligence (AI/ML) algorithms for metaverse healthcare, and the privacy of social interactions among patients in the metaverse from a human-centric perspective. In this article, we aim to provide new perspectives and less-investigated solutions, which are shown to be promising mechanisms in the context of wireless communications and computer science and can be considered novel solutions to be applied to healthcare metaverse services. Topics include physical layer security (PHYSec), Semantic Metaverse Communications (SMC), Differential Privacy (DP), and Adversarial Machine Learning (AML). As a case study, we propose distributed differential privacy for the metaverse healthcare systems, where each virtual clinic perturbs its medical model vector to enhance privacy against malicious actors and curious servers. Through our experiments on the Breast Cancer Wisconsin Dataset (BCWD), we highlight the privacy-utility trade-off for different adjustable levels of privacy. ",
    "url": "https://arxiv.org/abs/2308.04438",
    "authors": [
      "Mehdi Letafati",
      "Safa Otoum"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.04439",
    "title": "Global Differential Privacy for Distributed Metaverse Healthcare Systems",
    "abstract": "Metaverse-enabled digital healthcare systems are expected to exploit an unprecedented amount of personal health data, while ensuring that sensitive or private information of individuals are not disclosed. Machine learning and artificial intelligence (ML/AI) techniques can be widely utilized in metaverse healthcare systems, such as virtual clinics and intelligent consultations. In such scenarios, the key challenge is that data privacy laws might not allow virtual clinics to share their medical data with other parties. Moreover, clinical AI/ML models themselves carry extensive information about the medical datasets, such that private attributes can be easily inferred by malicious actors in the metaverse (if not rigorously privatized). In this paper, inspired by the idea of \"incognito mode\", which has recently been developed as a promising solution to safeguard metaverse users' privacy, we propose global differential privacy for the distributed metaverse healthcare systems. In our scheme, a randomized mechanism in the format of artificial \"mix-up\" noise is applied to the federated clinical ML/AI models before sharing with other peers. This way, we provide an adjustable level of distributed privacy against both the malicious actors and honest-but curious metaverse servers. Our evaluations on breast cancer Wisconsin dataset (BCWD) highlight the privacy-utility trade-off (PUT) in terms of diagnosis accuracy and loss function for different levels of privacy. We also compare our private scheme with the non-private centralized setup in terms of diagnosis accuracy. ",
    "url": "https://arxiv.org/abs/2308.04439",
    "authors": [
      "Mehdi Letafati",
      "Safa Otoum"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.04442",
    "title": "Blockchain-based Optimized Client Selection and Privacy Preserved  Framework for Federated Learning",
    "abstract": "Federated learning is a distributed mechanism that trained large-scale neural network models with the participation of multiple clients and data remains on their devices, only sharing the local model updates. With this feature, federated learning is considered a secure solution for data privacy issues. However, the typical FL structure relies on the client-server, which leads to the single-point-of-failure (SPoF) attack, and the random selection of clients for model training compromised the model accuracy. Furthermore, adversaries try for inference attacks i.e., attack on privacy leads to gradient leakage attacks. We proposed the blockchain-based optimized client selection and privacy-preserved framework in this context. We designed the three kinds of smart contracts such as 1) registration of clients 2) forward bidding to select optimized clients for FL model training 3) payment settlement and reward smart contracts. Moreover, fully homomorphic encryption with Cheon, Kim, Kim, and Song (CKKS) method is implemented before transmitting the local model updates to the server. Finally, we evaluated our proposed method on the benchmark dataset and compared it with state-of-the-art studies. Consequently, we achieved a higher accuracy rate and privacy-preserved FL framework with decentralized nature. ",
    "url": "https://arxiv.org/abs/2308.04442",
    "authors": [
      "Attia Qammar",
      "Abdenacer Naouri",
      "Jianguo Ding",
      "Huansheng Ning"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04446",
    "title": "Simulative Performance Analysis of an AD Function with Road Network  Variation",
    "abstract": "Automated driving functions (ADFs) have become increasingly popular in recent years. However, their safety must be assured. Thus, the verification and validation of these functions is still an important open issue in research and development. To achieve this efficiently, scenario-based testing has been established as a valuable methodology among researchers, industry, as well as authorities. Simulations are a powerful way to test those scenarios reproducibly. In this paper, we propose a method to automatically test a set of scenarios in many variations. In contrast to related approaches, those variations are not applied to traffic participants around the ADF, but to the road network to show that parameters regarding the road topology also influence the performance of such an ADF. We present a continuous tool chain to set up scenarios, variate them, run simulations and finally, evaluate the performance with a set of key performance indicators (KPIs). ",
    "url": "https://arxiv.org/abs/2308.04446",
    "authors": [
      "Daniel Becker",
      "Guido Küppers",
      "Lutz Eckstein"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.04450",
    "title": "High-Accuracy Prediction of Metal-Insulator-Metal Metasurface with Deep  Learning",
    "abstract": "Deep learning prediction of electromagnetic software calculation results has been a widely discussed issue in recent years. But the prediction accuracy was still one of the challenges to be solved. In this work, we proposed that the ResNets-10 model was used for predicting plasmonic metasurface S11 parameters. The two-stage training was performed by the k-fold cross-validation and small learning rate. After the training was completed, the prediction loss for aluminum, gold, and silver metal-insulator-metal metasurfaces was -48.45, -46.47, and -35.54, respectively. Due to the ultralow error value, the proposed network can replace the traditional electromagnetic computing method for calculation within a certain structural range. Besides, this network can finish the training process less than 1,100 epochs. This means that the network training process can effectively lower the design process time. The ResNets-10 model we proposed can also be used to design meta-diffractive devices and biosensors, thereby reducing the time required for the calculation process. The ultralow error of the network indicates that this work contributes to the development of future artificial intelligence electromagnetic computing software. ",
    "url": "https://arxiv.org/abs/2308.04450",
    "authors": [
      "Kaizhu Liu",
      "Hsiang-Chen Chui",
      "Changsen Sun",
      "Xue Han"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2308.04451",
    "title": "Vulnerabilities in AI Code Generators: Exploring Targeted Data Poisoning  Attacks",
    "abstract": "In this work, we assess the security of AI code generators via data poisoning, i.e., an attack that injects malicious samples into the training data to generate vulnerable code. We poison the training data by injecting increasing amounts of code containing security vulnerabilities and assess the attack's success on different state-of-the-art models for code generation. Our analysis shows that AI code generators are vulnerable to even a small amount of data poisoning. Moreover, the attack does not impact the correctness of code generated by pre-trained models, making it hard to detect. ",
    "url": "https://arxiv.org/abs/2308.04451",
    "authors": [
      "Domenico Cotroneo",
      "Cristina Improta",
      "Pietro Liguori",
      "Roberto Natella"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04452",
    "title": "Quarks: A Secure and Decentralized Blockchain-Based Messaging Network",
    "abstract": "In last two decades, messaging systems have gained widespread popularity both in the enterprise and consumer sectors. Many of these systems used secure protocols like end-to-end encryption to ensure strong security in one-to-one communication. However, the majority of them rely on centralized servers, which allows them to use their users' personal data. Also, it allows the government to track and regulate their citizens' activities, which poses significant threats to \"digital freedom\". Also, these systems have failed to achieve security attributes like confidentiality, integrity, and privacy for group communications. In this paper, we present a novel blockchain-based secure messaging system named Quarks that overcomes the security pitfalls of the existing systems and eliminates centralized control. We have analyzed our architecture with security models to demonstrate the system's reliability and usability. We have developed a Proof of Concept (PoC) of the Quarks system leveraging Distributed Ledger Technology (DLT) and conducted load testing on that. We noticed that our PoC system achieves all the desired attributes that are prevalent in a traditional centralized messaging scheme despite the limited capacity of the development and testing environment. Therefore, this assures us of the applicability of such systems in the near future if scaled up properly. ",
    "url": "https://arxiv.org/abs/2308.04452",
    "authors": [
      "Mirza Kamrul Bashar Shuhan",
      "Tariqul Islam",
      "Enam Ahmed Shuvo",
      "Faisal Haque Bappy",
      "Kamrul Hasan",
      "Carlos Caicedo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.04459",
    "title": "MCTS guided Genetic Algorithm for optimization of neural network weights",
    "abstract": "In this research, we investigate the possibility of applying a search strategy to genetic algorithms to explore the entire genetic tree structure. Several methods aid in performing tree searches; however, simpler algorithms such as breadth-first, depth-first, and iterative techniques are computation-heavy and often result in a long execution time. Adversarial techniques are often the preferred mechanism when performing a probabilistic search, yielding optimal results more quickly. The problem we are trying to tackle in this paper is the optimization of neural networks using genetic algorithms. Genetic algorithms (GA) form a tree of possible states and provide a mechanism for rewards via the fitness function. Monte Carlo Tree Search (MCTS) has proven to be an effective tree search strategy given states and rewards; therefore, we will combine these approaches to optimally search for the best result generated with genetic algorithms. ",
    "url": "https://arxiv.org/abs/2308.04459",
    "authors": [
      "Akshay Hebbar"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04466",
    "title": "Backdoor Federated Learning by Poisoning Backdoor-Critical Layers",
    "abstract": "Federated learning (FL) has been widely deployed to enable machine learning training on sensitive data across distributed devices. However, the decentralized learning paradigm and heterogeneity of FL further extend the attack surface for backdoor attacks. Existing FL attack and defense methodologies typically focus on the whole model. None of them recognizes the existence of backdoor-critical (BC) layers-a small subset of layers that dominate the model vulnerabilities. Attacking the BC layers achieves equivalent effects as attacking the whole model but at a far smaller chance of being detected by state-of-the-art (SOTA) defenses. This paper proposes a general in-situ approach that identifies and verifies BC layers from the perspective of attackers. Based on the identified BC layers, we carefully craft a new backdoor attack methodology that adaptively seeks a fundamental balance between attacking effects and stealthiness under various defense strategies. Extensive experiments show that our BC layer-aware backdoor attacks can successfully backdoor FL under seven SOTA defenses with only 10% malicious clients and outperform the latest backdoor attack methods. ",
    "url": "https://arxiv.org/abs/2308.04466",
    "authors": [
      "Haomin Zhuang",
      "Mingxian Yu",
      "Hao Wang",
      "Yang Hua",
      "Jian Li",
      "Xu Yuan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04467",
    "title": "EPS: Distinguishable IQ Data Representation for Domain-Adaptation  Learning of Device Fingerprints",
    "abstract": "Deep learning (DL)-based RF fingerprinting (RFFP) technology has emerged as a powerful physical-layer security mechanism, enabling device identification and authentication based on unique device-specific signatures that can be extracted from the received RF signals. However, DL-based RFFP methods face major challenges concerning their ability to adapt to domain (e.g., day/time, location, channel, etc.) changes and variability. This work proposes a novel IQ data representation and feature design, termed Double-Sided Envelope Power Spectrum or EPS, that is proven to overcome the domain adaptation problems significantly. By accurately capturing device hardware impairments while suppressing irrelevant domain information, EPS offers improved feature selection for DL models in RFFP. Experimental evaluations demonstrate its effectiveness, achieving over 99% testing accuracy in same-day/channel/location evaluations and 93% accuracy in cross-day evaluations, outperforming the traditional IQ representation. Additionally, EPS excels in cross-location evaluations, achieving a 95% accuracy. The proposed representation significantly enhances the robustness and generalizability of DL-based RFFP methods, thereby presenting a transformative solution to IQ data-based device fingerprinting. ",
    "url": "https://arxiv.org/abs/2308.04467",
    "authors": [
      "Abdurrahman Elmaghbub",
      "Bechir Hamdaoui"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.04468",
    "title": "3D Scene Diffusion Guidance using Scene Graphs",
    "abstract": "Guided synthesis of high-quality 3D scenes is a challenging task. Diffusion models have shown promise in generating diverse data, including 3D scenes. However, current methods rely directly on text embeddings for controlling the generation, limiting the incorporation of complex spatial relationships between objects. We propose a novel approach for 3D scene diffusion guidance using scene graphs. To leverage the relative spatial information the scene graphs provide, we make use of relational graph convolutional blocks within our denoising network. We show that our approach significantly improves the alignment between scene description and generated scene. ",
    "url": "https://arxiv.org/abs/2308.04468",
    "authors": [
      "Mohammad Naanaa",
      "Katharina Schmid",
      "Yinyu Nie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04469",
    "title": "Correlating Medi- Claim Service by Deep Learning Neural Networks",
    "abstract": "Medical insurance claims are of organized crimes related to patients, physicians, diagnostic centers, and insurance providers, forming a chain reaction that must be monitored constantly. These kinds of frauds affect the financial growth of both insured people and health insurance companies. The Convolution Neural Network architecture is used to detect fraudulent claims through a correlation study of regression models, which helps to detect money laundering on different claims given by different providers. Supervised and unsupervised classifiers are used to detect fraud and non-fraud claims. ",
    "url": "https://arxiv.org/abs/2308.04469",
    "authors": [
      "Jayanthi Vajiram",
      "Negha Senthil",
      "Nean Adhith.P"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04473",
    "title": "Opponents and proponents of the war in Ukraine in Russian social media:  who are they?",
    "abstract": "Understanding the personality of Russians who support the war in Ukraine is one of the key steps to understanding how this war became possible. However, during the war, traditional sociological methods are not always applicable. Social media provides an alternative source of what is inside people's heads. In this paper, I compare the political identities, values, and interests of social media users in Russia who hold a strong position for or against the war in Ukraine. I collect data from VK, the most popular Russian social media platform, and analyze self-filled profile information as well as the groups that the users subscribed to. I found that proponents of the war tend to have a weaker political identity (self-identified as \"moderate\") compared to opponents, who specify it more precisely (often, but not limited to, \"liberal\"). Additionally, the values of the proponents more frequently align with those promoted by the Russian government, such as orthodoxy and family. Despite these differences, pro-war and anti-war users share many common interests, as evidenced by their subscriptions to the same groups focused on music, history, and sport. When asked to state the most important trait in people (a field users can fill in VK), the most frequent answer for both groups is \"kindness and honesty\". The analysis results, in addition to contributing to the understanding of public opinion in Russia, can be utilized for predicting one's position on the war based on their social media profile. ",
    "url": "https://arxiv.org/abs/2308.04473",
    "authors": [
      "Alesya Sokolova"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2308.04477",
    "title": "A Comparative Study of Code Generation using ChatGPT 3.5 across 10  Programming Languages",
    "abstract": "Large Language Models (LLMs) are advanced Artificial Intelligence (AI) systems that have undergone extensive training using large datasets in order to understand and produce language that closely resembles that of humans. These models have reached a level of proficiency where they are capable of successfully completing university exams across several disciplines and generating functional code to handle novel problems. This research investigates the coding proficiency of ChatGPT 3.5, a LLM released by OpenAI in November 2022, which has gained significant recognition for its impressive text generating and code creation capabilities. The skill of the model in creating code snippets is evaluated across 10 various programming languages and 4 different software domains. Based on the findings derived from this research, major unexpected behaviors and limitations of the model have been identified. This study aims to identify potential areas for development and examine the ramifications of automated code generation on the evolution of programming languages and on the tech industry. ",
    "url": "https://arxiv.org/abs/2308.04477",
    "authors": [
      "Alessio Buscemi"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04501",
    "title": "Investigation of compressor cascade flow based on physics-informed  neural networks",
    "abstract": "In this study, we utilize the emerging Physics Informed Neural Networks (PINNs) approach for the first time to predict the flow field of a compressor cascade. The approach is demonstrated on a two-dimensional problem, incorporating Navier-Stokes equations in both the forward and inverse problems. In the forward problem, PINNs effectively predict the flow field of the compressor. The key advantage over Deep Neural Networks (DNNs) is that the PINNs model incorporates a physical relationship between the relevant quantities, resulting in more precise predictions. PINNs show obvious advantages over the traditional CFD approaches when dealing with inverse problems in the absence of partial boundary conditions. PINNs successfully reconstruct the flow field of the compressor cascade solely based on partial velocity vectors and wall pressure information. This research provides compelling evidence that PINNs offer turbomachinery designers a promising alternative to the current dominant CFD methods, delivering higher accuracy compared to DNNs. ",
    "url": "https://arxiv.org/abs/2308.04501",
    "authors": [
      "Zhihui Li",
      "Francesco Montomoli",
      "Sanjiv Sharma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2308.04515",
    "title": "Toward unlabeled multi-view 3D pedestrian detection by generalizable AI:  techniques and performance analysis",
    "abstract": "We unveil how generalizable AI can be used to improve multi-view 3D pedestrian detection in unlabeled target scenes. One way to increase generalization to new scenes is to automatically label target data, which can then be used for training a detector model. In this context, we investigate two approaches for automatically labeling target data: pseudo-labeling using a supervised detector and automatic labeling using an untrained detector (that can be applied out of the box without any training). We adopt a training framework for optimizing detector models using automatic labeling procedures. This framework encompasses different training sets/modes and multi-round automatic labeling strategies. We conduct our analyses on the publicly-available WILDTRACK and MultiviewX datasets. We show that, by using the automatic labeling approach based on an untrained detector, we can obtain superior results than directly using the untrained detector or a detector trained with an existing labeled source dataset. It achieved a MODA about 4% and 1% better than the best existing unlabeled method when using WILDTRACK and MultiviewX as target datasets, respectively. ",
    "url": "https://arxiv.org/abs/2308.04515",
    "authors": [
      "João Paulo Lima",
      "Diego Thomas",
      "Hideaki Uchiyama",
      "Veronica Teichrieb"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04537",
    "title": "Community Detection in Hypergraphs via Mutual Information Maximization",
    "abstract": "The hypergraph community detection problem seeks to identify groups of related nodes in hypergraph data. We propose an information-theoretic hypergraph community detection algorithm which compresses the observed data in terms of community labels and community-edge intersections. This algorithm can also be viewed as maximum-likelihood inference in a degree-corrected microcanonical stochastic blockmodel. We perform the inference/compression step via simulated annealing. Unlike several recent algorithms based on canonical models, our microcanonical algorithm does not require inference of statistical parameters such as node degrees or pairwise group connection rates. Through synthetic experiments, we find that our algorithm succeeds down to recently-conjectured thresholds for sparse random hypergraphs. We also find competitive performance in cluster recovery tasks on several hypergraph data sets. ",
    "url": "https://arxiv.org/abs/2308.04537",
    "authors": [
      "Jurgen Kritschgau",
      "Daniel Kaiser",
      "Oliver Alvarado Rodriguez",
      "Ilya Amburg",
      "Jessalyn Bolkema",
      "Thomas Grubb",
      "Fangfei Lan",
      "Sepideh Maleki",
      "Phil Chodrow",
      "Bill Kay"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Social and Information Networks (cs.SI)",
      "Combinatorics (math.CO)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2308.04542",
    "title": "YUDO: YOLO for Uniform Directed Object Detection",
    "abstract": "This paper presents an efficient way of detecting directed objects by predicting their center coordinates and direction angle. Since the objects are of uniform size, the proposed model works without predicting the object's width and height. The dataset used for this problem is presented in Honeybee Segmentation and Tracking Datasets project. One of the contributions of this work is an examination of the ability of the standard real-time object detection architecture like YoloV7 to be customized for position and direction detection. A very efficient, tiny version of the architecture is used in this approach. Moreover, only one of three detection heads without anchors is sufficient for this task. We also introduce the extended Skew Intersection over Union (SkewIoU) calculation for rotated boxes - directed IoU (DirIoU), which includes an absolute angle difference. DirIoU is used both in the matching procedure of target and predicted bounding boxes for mAP calculation, and in the NMS filtering procedure. The code and models are available at https://github.com/djordjened92/yudo. ",
    "url": "https://arxiv.org/abs/2308.04542",
    "authors": [
      "Đorđe Nedeljković"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04548",
    "title": "Spartan Bipartite Graphs are Essentially Elementary",
    "abstract": "We study a two-player game on a graph between an attacker and a defender. To begin with, the defender places guards on a subset of vertices. In each move, the attacker attacks an edge. The defender must move at least one guard across the attacked edge to defend the attack. The defender wins if and only if the defender can defend an infinite sequence of attacks. The smallest number of guards with which the defender has a winning strategy is called the eternal vertex cover number of a graph $G$ and is denoted by $evc(G)$. It is clear that $evc(G)$ is at least $mvc(G)$, the size of a minimum vertex cover of $G$. We say that $G$ is Spartan if $evc(G) = mvc(G)$. The characterization of Spartan graphs has been largely open. In the setting of bipartite graphs on $2n$ vertices where every edge belongs to a perfect matching, an easy strategy is to have $n$ guards that always move along perfect matchings in response to attacks. We show that these are essentially the only Spartan bipartite graphs. ",
    "url": "https://arxiv.org/abs/2308.04548",
    "authors": [
      "Neeldhara Misra",
      "Saraswati Girish Nanoti"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2308.04556",
    "title": "FocalFormer3D : Focusing on Hard Instance for 3D Object Detection",
    "abstract": "False negatives (FN) in 3D object detection, {\\em e.g.}, missing predictions of pedestrians, vehicles, or other obstacles, can lead to potentially dangerous situations in autonomous driving. While being fatal, this issue is understudied in many current 3D detection methods. In this work, we propose Hard Instance Probing (HIP), a general pipeline that identifies \\textit{FN} in a multi-stage manner and guides the models to focus on excavating difficult instances. For 3D object detection, we instantiate this method as FocalFormer3D, a simple yet effective detector that excels at excavating difficult objects and improving prediction recall. FocalFormer3D features a multi-stage query generation to discover hard objects and a box-level transformer decoder to efficiently distinguish objects from massive object candidates. Experimental results on the nuScenes and Waymo datasets validate the superior performance of FocalFormer3D. The advantage leads to strong performance on both detection and tracking, in both LiDAR and multi-modal settings. Notably, FocalFormer3D achieves a 70.5 mAP and 73.9 NDS on nuScenes detection benchmark, while the nuScenes tracking benchmark shows 72.1 AMOTA, both ranking 1st place on the nuScenes LiDAR leaderboard. Our code is available at \\url{https://github.com/NVlabs/FocalFormer3D}. ",
    "url": "https://arxiv.org/abs/2308.04556",
    "authors": [
      "Yilun Chen",
      "Zhiding Yu",
      "Yukang Chen",
      "Shiyi Lan",
      "Animashree Anandkumar",
      "Jiaya Jia",
      "Jose Alvarez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04564",
    "title": "Resource Cooperation in MEC and SDN based Vehicular Networks",
    "abstract": "Internet of Things (IoT) systems require highly scalable infrastructure to adaptively provide services to meet various performance requirements. Combining Software-Defined Networking (SDN) with Mobile Edge Cloud (MEC) technology brings more flexibility for IoT systems. We present a four-tier task processing architecture for MEC and vehicular networks, which includes processing tasks locally within a vehicle, on neighboring vehicles, on an edge cloud, and on a remote cloud. The flexible network connection is controlled by SDN. We propose a CPU resource allocation algorithm, called Partial Idle Resource Strategy (PIRS) with Vehicle to Vehicle (V2V) communications, based on Asymmetric Nash Bargaining Solution (ANBS) in Game Theory. PIRS encourages vehicles in the same location to cooperate by sharing part of their spare CPU resources. In our simulations, we adopt four applications running on the vehicles to generate workload. We compare the proposed algorithm with Non-Cooperation Strategy (NCS) and All Idle Resource Strategy (AIRS). In NCS, the vehicles execute tasks generated by the applications in their own On-Board Units (OBU), while in AIRS vehicles provide all their CPU resources to help other vehicles offloading requests. Our simulation results show that our PIRS strategy can execute more tasks on the V2V layer and lead to fewer number of task (and their length) to be offloaded to the cloud, reaching up to 28% improvement compared to NCS and up to 10% improvement compared to AIRS. ",
    "url": "https://arxiv.org/abs/2308.04564",
    "authors": [
      "Beiran Chen",
      "Marco Ruffini"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2308.04579",
    "title": "RECipe: Does a Multi-Modal Recipe Knowledge Graph Fit a Multi-Purpose  Recommendation System?",
    "abstract": "Over the past two decades, recommendation systems (RSs) have used machine learning (ML) solutions to recommend items, e.g., movies, books, and restaurants, to clients of a business or an online platform. Recipe recommendation, however, has not yet received much attention compared to those applications. We introduce RECipe as a multi-purpose recipe recommendation framework with a multi-modal knowledge graph (MMKG) backbone. The motivation behind RECipe is to go beyond (deep) neural collaborative filtering (NCF) by recommending recipes to users when they query in natural language or by providing an image. RECipe consists of 3 subsystems: (1) behavior-based recommender, (2) review-based recommender, and (3) image-based recommender. Each subsystem relies on the embedding representations of entities and relations in the graph. We first obtain (pre-trained) embedding representations of textual entities, such as reviews or ingredients, from a fine-tuned model of Microsoft's MPNet. We initialize the weights of the entities with these embeddings to train our knowledge graph embedding (KGE) model. For the visual component, i.e., recipe images, we develop a KGE-Guided variational autoencoder (KG-VAE) to learn the distribution of images and their latent representations. Once KGE and KG-VAE models are fully trained, we use them as a multi-purpose recommendation framework. For benchmarking, we created two knowledge graphs (KGs) from public datasets on Kaggle for recipe recommendation. Our experiments show that the KGE models have comparable performance to the neural solutions. We also present pre-trained NLP embeddings to address important applications such as zero-shot inference for new users (or the cold start problem) and conditional recommendation with respect to recipe categories. We eventually demonstrate the application of RECipe in a multi-purpose recommendation setting. ",
    "url": "https://arxiv.org/abs/2308.04579",
    "authors": [
      "Ali Pesaranghader",
      "Touqir Sajed"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04581",
    "title": "The Social Triad model of Human-Robot Interaction",
    "abstract": "Despite the increasing interest in trust in human-robot interaction (HRI), there is still relatively little exploration of trust as a social construct in HRI. We propose that integration of useful models of human-human trust from psychology, highlight a potentially overlooked aspect of trust in HRI: a robot's apparent trustworthiness may indirectly relate to the user's relationship with, and opinion of, the individual or organisation deploying the robot. Our Social Triad for HRI model (User, Robot, Deployer), identifies areas for consideration in co-creating trustworthy robotics. ",
    "url": "https://arxiv.org/abs/2308.04581",
    "authors": [
      "David Cameron",
      "Emily Collins",
      "Stevienna de Saille",
      "James Law"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.04583",
    "title": "LATR: 3D Lane Detection from Monocular Images with Transformer",
    "abstract": "3D lane detection from monocular images is a fundamental yet challenging task in autonomous driving. Recent advances primarily rely on structural 3D surrogates (e.g., bird's eye view) that are built from front-view image features and camera parameters. However, the depth ambiguity in monocular images inevitably causes misalignment between the constructed surrogate feature map and the original image, posing a great challenge for accurate lane detection. To address the above issue, we present a novel LATR model, an end-to-end 3D lane detector that uses 3D-aware front-view features without transformed view representation. Specifically, LATR detects 3D lanes via cross-attention based on query and key-value pairs, constructed using our lane-aware query generator and dynamic 3D ground positional embedding. On the one hand, each query is generated based on 2D lane-aware features and adopts a hybrid embedding to enhance the lane information. On the other hand, 3D space information is injected as positional embedding from an iteratively-updated 3D ground plane. LATR outperforms previous state-of-the-art methods on both synthetic Apollo and realistic OpenLane by large margins (e.g., 11.4 gains in terms of F1 score on OpenLane). Code will be released at https://github.com/JMoonr/LATR. ",
    "url": "https://arxiv.org/abs/2308.04583",
    "authors": [
      "Yueru Luo",
      "Chaoda Zheng",
      "Xu Yan",
      "Tang Kun",
      "Chao Zheng",
      "Shuguang Cui",
      "Zhen Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04589",
    "title": "Temporal DINO: A Self-supervised Video Strategy to Enhance Action  Prediction",
    "abstract": "The emerging field of action prediction plays a vital role in various computer vision applications such as autonomous driving, activity analysis and human-computer interaction. Despite significant advancements, accurately predicting future actions remains a challenging problem due to high dimensionality, complex dynamics and uncertainties inherent in video data. Traditional supervised approaches require large amounts of labelled data, which is expensive and time-consuming to obtain. This paper introduces a novel self-supervised video strategy for enhancing action prediction inspired by DINO (self-distillation with no labels). The Temporal-DINO approach employs two models; a 'student' processing past frames; and a 'teacher' processing both past and future frames, enabling a broader temporal context. During training, the teacher guides the student to learn future context by only observing past frames. The strategy is evaluated on ROAD dataset for the action prediction downstream task using 3D-ResNet, Transformer, and LSTM architectures. The experimental results showcase significant improvements in prediction performance across these architectures, with our method achieving an average enhancement of 9.9% Precision Points (PP), highlighting its effectiveness in enhancing the backbones' capabilities of capturing long-term dependencies. Furthermore, our approach demonstrates efficiency regarding the pretraining dataset size and the number of epochs required. This method overcomes limitations present in other approaches, including considering various backbone architectures, addressing multiple prediction horizons, reducing reliance on hand-crafted augmentations, and streamlining the pretraining process into a single stage. These findings highlight the potential of our approach in diverse video-based tasks such as activity recognition, motion planning, and scene understanding. ",
    "url": "https://arxiv.org/abs/2308.04589",
    "authors": [
      "Izzeddin Teeti",
      "Rongali Sai Bhargav",
      "Vivek Singh",
      "Andrew Bradley",
      "Biplab Banerjee",
      "Fabio Cuzzolin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04595",
    "title": "Quantization Aware Factorization for Deep Neural Network Compression",
    "abstract": "Tensor decomposition of convolutional and fully-connected layers is an effective way to reduce parameters and FLOP in neural networks. Due to memory and power consumption limitations of mobile or embedded devices, the quantization step is usually necessary when pre-trained models are deployed. A conventional post-training quantization approach applied to networks with decomposed weights yields a drop in accuracy. This motivated us to develop an algorithm that finds tensor approximation directly with quantized factors and thus benefit from both compression techniques while keeping the prediction quality of the model. Namely, we propose to use Alternating Direction Method of Multipliers (ADMM) for Canonical Polyadic (CP) decomposition with factors whose elements lie on a specified quantization grid. We compress neural network weights with a devised algorithm and evaluate it's prediction quality and performance. We compare our approach to state-of-the-art post-training quantization methods and demonstrate competitive results and high flexibility in achiving a desirable quality-performance tradeoff. ",
    "url": "https://arxiv.org/abs/2308.04595",
    "authors": [
      "Daria Cherniuk",
      "Stanislav Abukhovich",
      "Anh-Huy Phan",
      "Ivan Oseledets",
      "Andrzej Cichocki",
      "Julia Gusak"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04606",
    "title": "Generalized Power Iteration with Application to Distributed Connectivity  Estimation of Asymmetric Networks",
    "abstract": "The problem of connectivity assessment in an asymmetric network represented by a weighted directed graph is investigated in this article. A power iteration algorithm in a centralized implementation is developed first to compute the generalized algebraic connectivity of asymmetric networks. After properly transforming the Laplacian matrix of the network, two sequences of one-dimensional and two-dimensional subspaces are generated iteratively, one of which converges to the desired subspace spanned by the eigenvector(s) associated with the eigenvalue(s) representing the network's generalized algebraic connectivity. A distributed implementation of the proposed power iteration algorithm is then developed to compute the generalized algebraic connectivity from the viewpoint of each node, which is scalable to any asymmetric network of any size with a fixed message length per node. The convergence analysis of these algorithms is subsequently provided under some weak assumptions. The efficiency of the developed algorithms in computing the network connectivity is then demonstrated by simulations. ",
    "url": "https://arxiv.org/abs/2308.04606",
    "authors": [
      "M. Mehdi Asadi",
      "Mohammad Khosravi",
      "Hesam Mosalli",
      "Stephane Blouin",
      "Amir G. Aghdam"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.04607",
    "title": "Different Mechanisms of Machine Learning and Optimization Algorithms  Utilized in Intrusion Detection Systems",
    "abstract": "Malicious software is an integral part of cybercrime defense. Due to the growing number of malicious attacks and their target sources, detecting and preventing the attack becomes more challenging due to the assault's changing behavior. The bulk of classic malware detection systems is based on statistics, analytic techniques, or machine learning. Virus signature methods are widely used to identify malware. The bulk of anti-malware systems categorizes malware using regular expressions and patterns. While antivirus software is less likely to update its databases to identify and block malware, file features must be updated to detect and prevent newly generated malware. Creating attack signatures requires practically all of a human being's work. The purpose of this study is to undertake a review of the current research on intrusion detection models and the datasets that support them. In this article, we discuss the state-of-the-art, focusing on the strategy that was devised and executed, the dataset that was utilized, the findings, and the assessment that was undertaken. Additionally, the surveyed articles undergo critical analysis and statements in order to give a thorough comparative review. Machine learning and deep learning methods, as well as new classification and feature selection methodologies, are studied and researched. Thus far, each technique has proved the capability of constructing very accurate intrusion detection models. The survey findings reveal that Clearly, the MultiTree and adaptive voting algorithms surpassed all other models in terms of persistency and performance, averaging 99.98 percent accuracy on average. ",
    "url": "https://arxiv.org/abs/2308.04607",
    "authors": [
      "Mohammad Aziz",
      "Ali Saeed Alfoudi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.04611",
    "title": "Deep Learning Driven Detection of Tsunami Related Internal GravityWaves:  a path towards open-ocean natural hazards detection",
    "abstract": "Tsunamis can trigger internal gravity waves (IGWs) in the ionosphere, perturbing the Total Electron Content (TEC) - referred to as Traveling Ionospheric Disturbances (TIDs) that are detectable through the Global Navigation Satellite System (GNSS). The GNSS are constellations of satellites providing signals from Earth orbit - Europe's Galileo, the United States' Global Positioning System (GPS), Russia's Global'naya Navigatsionnaya Sputnikovaya Sistema (GLONASS) and China's BeiDou. The real-time detection of TIDs provides an approach for tsunami detection, enhancing early warning systems by providing open-ocean coverage in geographic areas not serviceable by buoy-based warning systems. Large volumes of the GNSS data is leveraged by deep learning, which effectively handles complex non-linear relationships across thousands of data streams. We describe a framework leveraging slant total electron content (sTEC) from the VARION (Variometric Approach for Real-Time Ionosphere Observation) algorithm by Gramian Angular Difference Fields (from Computer Vision) and Convolutional Neural Networks (CNNs) to detect TIDs in near-real-time. Historical data from the 2010 Maule, 2011 Tohoku and the 2012 Haida-Gwaii earthquakes and tsunamis are used in model training, and the later-occurring 2015 Illapel earthquake and tsunami in Chile for out-of-sample model validation. Using the experimental framework described in the paper, we achieved a 91.7% F1 score. Source code is available at: https://github.com/vc1492a/tidd. Our work represents a new frontier in detecting tsunami-driven IGWs in open-ocean, dramatically improving the potential for natural hazards detection for coastal communities. ",
    "url": "https://arxiv.org/abs/2308.04611",
    "authors": [
      "Valentino Constantinou",
      "Michela Ravanelli",
      "Hamlin Liu",
      "Jacob Bortnik"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)"
    ]
  },
  {
    "id": "arXiv:2308.04617",
    "title": "Improved Activation Clipping for Universal Backdoor Mitigation and  Test-Time Detection",
    "abstract": "Deep neural networks are vulnerable to backdoor attacks (Trojans), where an attacker poisons the training set with backdoor triggers so that the neural network learns to classify test-time triggers to the attacker's designated target class. Recent work shows that backdoor poisoning induces over-fitting (abnormally large activations) in the attacked model, which motivates a general, post-training clipping method for backdoor mitigation, i.e., with bounds on internal-layer activations learned using a small set of clean samples. We devise a new such approach, choosing the activation bounds to explicitly limit classification margins. This method gives superior performance against peer methods for CIFAR-10 image classification. We also show that this method has strong robustness against adaptive attacks, X2X attacks, and on different datasets. Finally, we demonstrate a method extension for test-time detection and correction based on the output differences between the original and activation-bounded networks. The code of our method is online available. ",
    "url": "https://arxiv.org/abs/2308.04617",
    "authors": [
      "Hang Wang",
      "Zhen Xiang",
      "David J. Miller",
      "George Kesidis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.04625",
    "title": "A Comparative Study of Sentence Embedding Models for Assessing Semantic  Variation",
    "abstract": "Analyzing the pattern of semantic variation in long real-world texts such as books or transcripts is interesting from the stylistic, cognitive, and linguistic perspectives. It is also useful for applications such as text segmentation, document summarization, and detection of semantic novelty. The recent emergence of several vector-space methods for sentence embedding has made such analysis feasible. However, this raises the issue of how consistent and meaningful the semantic representations produced by various methods are in themselves. In this paper, we compare several recent sentence embedding methods via time-series of semantic similarity between successive sentences and matrices of pairwise sentence similarity for multiple books of literature. In contrast to previous work using target tasks and curated datasets to compare sentence embedding methods, our approach provides an evaluation of the methods 'in the wild'. We find that most of the sentence embedding methods considered do infer highly correlated patterns of semantic similarity in a given document, but show interesting differences. ",
    "url": "https://arxiv.org/abs/2308.04625",
    "authors": [
      "Deven M. Mistry",
      "Ali A. Minai"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04638",
    "title": "GeoAdapt: Self-Supervised Test-Time Adaption in LiDAR Place Recognition  Using Geometric Priors",
    "abstract": "LiDAR place recognition approaches based on deep learning suffer a significant degradation in performance when there is a shift between the distribution of the training and testing datasets, with re-training often required to achieve top performance. However, obtaining accurate ground truth on new environments can be prohibitively expensive, especially in complex or GPS-deprived environments. To address this issue we propose GeoAdapt, which introduces a novel auxiliary classification head to generate pseudo-labels for re-training on unseen environments in a self-supervised manner. GeoAdapt uses geometric consistency as a prior to improve the robustness of our generated pseudo-labels against domain shift, improving the performance and reliability of our Test-Time Adaptation approach. Comprehensive experiments show that GeoAdapt significantly boosts place recognition performance across moderate to severe domain shifts, and is competitive with fully supervised test-time adaptation approaches. Our code will be available at https://github.com/csiro-robotics/GeoAdapt. ",
    "url": "https://arxiv.org/abs/2308.04638",
    "authors": [
      "Joshua Knights",
      "Stephen Hausler",
      "Sridha Sridharan",
      "Clinton Fookes",
      "Peyman Moghadam"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04641",
    "title": "IS2N: Intent-Driven Security Software-Defined Network with Blockchain",
    "abstract": "Software-defined network (SDN) is characterized by its programmability, flexibility, and the separation of control and data planes. However, SDN still have many challenges, particularly concerning the security of network information synchronization and network element registration. Blockchain and intent-driven networks are recent technologies to establish secure and intelligent SDN. This article investigates the blockchain-based architecture and intent-driven mechanisms to implement intent-driven security software-defined networks (IS2N). Specifically, we propose a novel four-layer architecture of the IS2N with security capabilities. We integrate an intent-driven security management mechanism in the IS2N to achieve automate network security management. Finally, we develop an IS2N platform with blockchain middle-layer to achieve security capabilities and security store network-level snapshots, such as device registration and OpenFlow messages. Our simulations show that IS2N is more flexible than conventional strategies at resolving problems during network operations and has a minimal effect on the SDN. ",
    "url": "https://arxiv.org/abs/2308.04641",
    "authors": [
      "Yanbo Song",
      "Tao Feng",
      "Chungang Yang",
      "Xinru Mi",
      "Shanqing Jiang",
      "Mohsen Guizani"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2308.04643",
    "title": "Long-Distance Gesture Recognition using Dynamic Neural Networks",
    "abstract": "Gestures form an important medium of communication between humans and machines. An overwhelming majority of existing gesture recognition methods are tailored to a scenario where humans and machines are located very close to each other. This short-distance assumption does not hold true for several types of interactions, for example gesture-based interactions with a floor cleaning robot or with a drone. Methods made for short-distance recognition are unable to perform well on long-distance recognition due to gestures occupying only a small portion of the input data. Their performance is especially worse in resource constrained settings where they are not able to effectively focus their limited compute on the gesturing subject. We propose a novel, accurate and efficient method for the recognition of gestures from longer distances. It uses a dynamic neural network to select features from gesture-containing spatial regions of the input sensor data for further processing. This helps the network focus on features important for gesture recognition while discarding background features early on, thus making it more compute efficient compared to other techniques. We demonstrate the performance of our method on the LD-ConGR long-distance dataset where it outperforms previous state-of-the-art methods on recognition accuracy and compute efficiency. ",
    "url": "https://arxiv.org/abs/2308.04643",
    "authors": [
      "Shubhang Bhatnagar",
      "Sharath Gopal",
      "Narendra Ahuja",
      "Liu Ren"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)",
      "Robotics (cs.RO)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.04660",
    "title": "Efficient Bayesian Optimization with Deep Kernel Learning and  Transformer Pre-trained on Multiple Heterogeneous Datasets",
    "abstract": "Bayesian optimization (BO) is widely adopted in black-box optimization problems and it relies on a surrogate model to approximate the black-box response function. With the increasing number of black-box optimization tasks solved and even more to solve, the ability to learn from multiple prior tasks to jointly pre-train a surrogate model is long-awaited to further boost optimization efficiency. In this paper, we propose a simple approach to pre-train a surrogate, which is a Gaussian process (GP) with a kernel defined on deep features learned from a Transformer-based encoder, using datasets from prior tasks with possibly heterogeneous input spaces. In addition, we provide a simple yet effective mix-up initialization strategy for input tokens corresponding to unseen input variables and therefore accelerate new tasks' convergence. Experiments on both synthetic and real benchmark problems demonstrate the effectiveness of our proposed pre-training and transfer BO strategy over existing methods. ",
    "url": "https://arxiv.org/abs/2308.04660",
    "authors": [
      "Wenlong Lyu",
      "Shoubo Hu",
      "Jie Chuai",
      "Zhitang Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04666",
    "title": "Speaker Recognition Using Isomorphic Graph Attention Network Based  Pooling on Self-Supervised Representation",
    "abstract": "The emergence of self-supervised representation (i.e., wav2vec 2.0) allows speaker-recognition approaches to process spoken signals through foundation models built on speech data. Nevertheless, effective fusion on the representation requires further investigating, due to the inclusion of fixed or sub-optimal temporal pooling strategies. Despite of improved strategies considering graph learning and graph attention factors, non-injective aggregation still exists in the approaches, which may influence the performance for speaker recognition. In this regard, we propose a speaker recognition approach using Isomorphic Graph ATtention network (IsoGAT) on self-supervised representation. The proposed approach contains three modules of representation learning, graph attention, and aggregation, jointly considering learning on the self-supervised representation and the IsoGAT. Then, we perform experiments for speaker recognition tasks on VoxCeleb1\\&2 datasets, with the corresponding experimental results demonstrating the recognition performance for the proposed approach, compared with existing pooling approaches on the self-supervised representation. ",
    "url": "https://arxiv.org/abs/2308.04666",
    "authors": [
      "Zirui Ge",
      "Xinzhou Xu",
      "Haiyan Guo",
      "Tingting Wang",
      "Zhen Yang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.04672",
    "title": "Resource Constrained Model Compression via Minimax Optimization for  Spiking Neural Networks",
    "abstract": "Brain-inspired Spiking Neural Networks (SNNs) have the characteristics of event-driven and high energy-efficient, which are different from traditional Artificial Neural Networks (ANNs) when deployed on edge devices such as neuromorphic chips. Most previous work focuses on SNNs training strategies to improve model performance and brings larger and deeper network architectures. It is difficult to deploy these complex networks on resource-limited edge devices directly. To meet such demand, people compress SNNs very cautiously to balance the performance and the computation efficiency. Existing compression methods either iteratively pruned SNNs using weights norm magnitude or formulated the problem as a sparse learning optimization. We propose an improved end-to-end Minimax optimization method for this sparse learning problem to better balance the model performance and the computation efficiency. We also demonstrate that jointly applying compression and finetuning on SNNs is better than sequentially, especially for extreme compression ratios. The compressed SNN models achieved state-of-the-art (SOTA) performance on various benchmark datasets and architectures. Our code is available at https://github.com/chenjallen/Resource-Constrained-Compression-on-SNN. ",
    "url": "https://arxiv.org/abs/2308.04672",
    "authors": [
      "Jue Chen",
      "Huan Yuan",
      "Jianchao Tan",
      "Bin Chen",
      "Chengru Song",
      "Di Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2308.04673",
    "title": "SSL-Auth: An Authentication Framework by Fragile Watermarking for  Pre-trained Encoders in Self-supervised Learning",
    "abstract": "Self-supervised learning (SSL) which leverages unlabeled datasets for pre-training powerful encoders has achieved significant success in recent years. These encoders are commonly used as feature extractors for various downstream tasks, requiring substantial data and computing resources for their training process. With the deployment of pre-trained encoders in commercial use, protecting the intellectual property of model owners and ensuring the trustworthiness of the models becomes crucial. Recent research has shown that encoders are threatened by backdoor attacks, adversarial attacks, etc. Therefore, a scheme to verify the integrity of pre-trained encoders is needed to protect users. In this paper, we propose SSL-Auth, the first fragile watermarking scheme for verifying the integrity of encoders without compromising model performance. Our method utilizes selected key samples as watermark information and trains a verification network to reconstruct the watermark information, thereby verifying the integrity of the encoder. By comparing the reconstruction results of the key samples, malicious modifications can be effectively detected, as altered models should not exhibit similar reconstruction performance as the original models. Extensive evaluations on various models and diverse datasets demonstrate the effectiveness and fragility of our proposed SSL-Auth. ",
    "url": "https://arxiv.org/abs/2308.04673",
    "authors": [
      "Xiaobei Li",
      "Changchun Yin",
      "Liming Fang",
      "Run Wang",
      "Chenhao Lin"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04675",
    "title": "Maximizing Network Connectivity for UAV Communications via  Reconfigurable Intelligent Surfaces",
    "abstract": "It is anticipated that integrating unmanned aerial vehicles (UAVs) with reconfigurable intelligent surfaces (RISs), resulting in RIS-assisted UAV networks, will offer improved network connectivity against node failures for the beyond 5G networks. In this context, we utilize a RIS to provide path diversity and alternative connectivity options for information flow from user equipment (UE) to UAVs by adding more links to the network, thereby maximizing its connectivity. This paper employs the algebraic connectivity metric, which is adjusted by the reflected links of the RIS, to formulate the problem of maximizing the network connectivity in two cases. First, we consider formulating the problem for one UE, which is solved optimally using a linear search. Then, we consider the problem of a more general case of multiple UEs, which has high computational complexity. To tackle this problem, we formulate the problem of maximizing the network connectivity as a semi-definite programming (SDP) optimization problem that can be solved efficiently in polynomial time. In both cases, our proposed solutions find the best combination between UE(s) and UAVs through the RIS. As a result, it tunes the phase shifts of the RIS to direct the signals of the UEs to the appropriate UAVs, thus maximizing the network connectivity. Simulation results are conducted to assess the performance of the proposed solutions compared to the existing solutions. ",
    "url": "https://arxiv.org/abs/2308.04675",
    "authors": [
      "Mohammed S. Al-Abiad",
      "Mohammad Javad-Kalbasi",
      "Shahrokh Valaee"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2308.04676",
    "title": "New Constructions of Mutually Orthogonal Complementary Sets and  Z-Complementary Code Sets Based on Extended Boolean Functions",
    "abstract": "Mutually orthogonal complementary sets (MOCSs) and Z-complementary code sets (ZCCSs) have many applications in practical scenarios such as synthetic aperture imaging systems and multi-carrier code division multiple access (MC-CDMA) systems. With the aid of extended Boolean functions (EBFs), in this paper, we first propose a direct construction of MOCSs with flexible lengths, and then propose a new construction of ZCCSs. The proposed MOCSs cover many existing lengths and have non-power-of-two lengths when q = 2. Our presented second construction can generate optimal ZCCSs meeting the set size upper bound. Note that the proposed two constructions are direct without the aid of any special sequence, which is suitable for rapid hardware generation. ",
    "url": "https://arxiv.org/abs/2308.04676",
    "authors": [
      "Hongyang Xiao",
      "Xiwang Cao"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2308.04690",
    "title": "Finite Element Operator Network for Solving Parametric PDEs",
    "abstract": "Partial differential equations (PDEs) underlie our understanding and prediction of natural phenomena across numerous fields, including physics, engineering, and finance. However, solving parametric PDEs is a complex task that necessitates efficient numerical methods. In this paper, we propose a novel approach for solving parametric PDEs using a Finite Element Operator Network (FEONet). Our proposed method leverages the power of deep learning in conjunction with traditional numerical methods, specifically the finite element method, to solve parametric PDEs in the absence of any paired input-output training data. We demonstrate the effectiveness of our approach on several benchmark problems and show that it outperforms existing state-of-the-art methods in terms of accuracy, generalization, and computational flexibility. Our FEONet framework shows potential for application in various fields where PDEs play a crucial role in modeling complex domains with diverse boundary conditions and singular behavior. Furthermore, we provide theoretical convergence analysis to support our approach, utilizing finite element approximation in numerical analysis. ",
    "url": "https://arxiv.org/abs/2308.04690",
    "authors": [
      "Jae Yong Lee",
      "Seungchan Ko",
      "Youngjoon Hong"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2308.04693",
    "title": "Evaluating and Optimizing the Effectiveness of Neural Machine  Translation in Supporting Code Retrieval Models: A Study on the CAT Benchmark",
    "abstract": "Neural Machine Translation (NMT) is widely applied in software engineering tasks. The effectiveness of NMT for code retrieval relies on the ability to learn from the sequence of tokens in the source language to the sequence of tokens in the target language. While NMT performs well in pseudocode-to-code translation, it might have challenges in learning to translate from natural language query to source code in newly curated real-world code documentation/ implementation datasets. In this work, we analyze the performance of NMT in natural language-to-code translation in the newly curated CAT benchmark that includes the optimized versions of three Java datasets TLCodeSum, CodeSearchNet, Funcom, and a Python dataset PCSD. Our evaluation shows that NMT has low accuracy, measured by CrystalBLEU and Meteor metrics in this task. To alleviate the duty of NMT in learning complex representation of source code, we propose ASTTrans Representation, a tailored representation of an Abstract Syntax Tree (AST) using a subset of non-terminal nodes. We show that the classical approach NMT performs significantly better in learning ASTTrans Representation over code tokens with up to 36% improvement on Meteor score. Moreover, we leverage ASTTrans Representation to conduct combined code search processes from the state-of-the-art code search processes using GraphCodeBERT and UniXcoder. Our NMT models of learning ASTTrans Representation can boost the Mean Reciprocal Rank of these state-of-the-art code search processes by up to 3.08% and improve 23.08% of queries' results over the CAT benchmark. ",
    "url": "https://arxiv.org/abs/2308.04693",
    "authors": [
      "Hung Phan",
      "Ali Jannesari"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2308.04700",
    "title": "BOPIM: Bayesian Optimization for influence maximization on temporal  networks",
    "abstract": "The goal of influence maximization (IM) is to select a small set of seed nodes which maximize the spread of influence on a network. In this work, we propose BOPIM, a Bayesian Optimization (BO) algorithm for IM on temporal networks. The IM task is well-suited for a BO solution due to its expensive and complicated objective function. We propose a simple surrogate function to model the objective function and leverage Gaussian Process regression with shrinkage priors to fit the model. An acquisition function based on the median of the posterior distribution leads to a straightforward procedure to select the next sampling point. In numerical experiments on real-world networks, we find that, on average, the surrogate function estimates the true influence spread within a few nodes. Additionally, we show that BOPIM yields comparable influence spreads to a gold-standard greedy algorithm while being as much as seventeen times faster. We also use these experiments to demonstrate the proposed method's ability to quantify uncertainty in optimal seed sets. To the knowledge of the author, this is the first attempt to look at uncertainty in the seed sets for IM, as well as the first application of BO to a constrained, combinatorial optimization problem. ",
    "url": "https://arxiv.org/abs/2308.04700",
    "authors": [
      "Eric Yanchenko"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2308.04702",
    "title": "Continual Road-Scene Semantic Segmentation via Feature-Aligned Symmetric  Multi-Modal Network",
    "abstract": "State-of-the-art multimodal semantic segmentation approaches combining LiDAR and color data are usually designed on top of asymmetric information-sharing schemes and assume that both modalities are always available. Regrettably, this strong assumption may not hold in real-world scenarios, where sensors are prone to failure or can face adverse conditions (night-time, rain, fog, etc.) that make the acquired information unreliable. Moreover, these architectures tend to fail in continual learning scenarios. In this work, we re-frame the task of multimodal semantic segmentation by enforcing a tightly-coupled feature representation and a symmetric information-sharing scheme, which allows our approach to work even when one of the input modalities is missing. This makes our model reliable even in safety-critical settings, as is the case of autonomous driving. We evaluate our approach on the SemanticKITTI dataset, comparing it with our closest competitor. We also introduce an ad-hoc continual learning scheme and show results in a class-incremental continual learning scenario that prove the effectiveness of the approach also in this setting. ",
    "url": "https://arxiv.org/abs/2308.04702",
    "authors": [
      "Francesco Barbato",
      "Elena Camuffo",
      "Simone Milani",
      "Pietro Zanuttigh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04704",
    "title": "A Feature Set of Small Size for the PDF Malware Detection",
    "abstract": "Machine learning (ML)-based malware detection systems are becoming increasingly important as malware threats increase and get more sophisticated. PDF files are often used as vectors for phishing attacks because they are widely regarded as trustworthy data resources, and are accessible across different platforms. Therefore, researchers have developed many different PDF malware detection methods. Performance in detecting PDF malware is greatly influenced by feature selection. In this research, we propose a small features set that don't require too much domain knowledge of the PDF file. We evaluate proposed features with six different machine learning models. We report the best accuracy of 99.75% when using Random Forest model. Our proposed feature set, which consists of just 12 features, is one of the most conciseness in the field of PDF malware detection. Despite its modest size, we obtain comparable results to state-of-the-art that employ a much larger set of features. ",
    "url": "https://arxiv.org/abs/2308.04704",
    "authors": [
      "Ran Liu",
      "Charles Nicholas"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04706",
    "title": "Pareto Invariant Representation Learning for Multimedia Recommendation",
    "abstract": "Multimedia recommendation involves personalized ranking tasks, where multimedia content is usually represented using a generic encoder. However, these generic representations introduce spurious correlations that fail to reveal users' true preferences. Existing works attempt to alleviate this problem by learning invariant representations, but overlook the balance between independent and identically distributed (IID) and out-of-distribution (OOD) generalization. In this paper, we propose a framework called Pareto Invariant Representation Learning (PaInvRL) to mitigate the impact of spurious correlations from an IID-OOD multi-objective optimization perspective, by learning invariant representations (intrinsic factors that attract user attention) and variant representations (other factors) simultaneously. Specifically, PaInvRL includes three iteratively executed modules: (i) heterogeneous identification module, which identifies the heterogeneous environments to reflect distributional shifts for user-item interactions; (ii) invariant mask generation module, which learns invariant masks based on the Pareto-optimal solutions that minimize the adaptive weighted Invariant Risk Minimization (IRM) and Empirical Risk (ERM) losses; (iii) convert module, which generates both variant representations and item-invariant representations for training a multi-modal recommendation model that mitigates spurious correlations and balances the generalization performance within and cross the environmental distributions. We compare the proposed PaInvRL with state-of-the-art recommendation models on three public multimedia recommendation datasets (Movielens, Tiktok, and Kwai), and the experimental results validate the effectiveness of PaInvRL for both within- and cross-environmental learning. ",
    "url": "https://arxiv.org/abs/2308.04706",
    "authors": [
      "Shanshan Huang",
      "Haoxuan Li",
      "Qingsong Li",
      "Chunyuan Zheng",
      "Li Liu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04714",
    "title": "A Computational Design Process to Fabricate Sensing Network  Physicalizations",
    "abstract": "Interaction is critical for data analysis and sensemaking. However, designing interactive physicalizations is challenging as it requires cross-disciplinary knowledge in visualization, fabrication, and electronics. Interactive physicalizations are typically produced in an unstructured manner, resulting in unique solutions for a specific dataset, problem, or interaction that cannot be easily extended or adapted to new scenarios or future physicalizations. To mitigate these challenges, we introduce a computational design pipeline to 3D print network physicalizations with integrated sensing capabilities. Networks are ubiquitous, yet their complex geometry also requires significant engineering considerations to provide intuitive, effective interactions for exploration. Using our pipeline, designers can readily produce network physicalizations supporting selection-the most critical atomic operation for interaction-by touch through capacitive sensing and computational inference. Our computational design pipeline introduces a new design paradigm by concurrently considering the form and interactivity of a physicalization into one cohesive fabrication workflow. We evaluate our approach using (i) computational evaluations, (ii) three usage scenarios focusing on general visualization tasks, and (iii) expert interviews. The design paradigm introduced by our pipeline can lower barriers to physicalization research, creation, and adoption. ",
    "url": "https://arxiv.org/abs/2308.04714",
    "authors": [
      "S. Sandra Bae",
      "Takanori Fujiwara",
      "Anders Ynnerman",
      "Ellen Yi-Luen Do",
      "Michael L. Rivera",
      "Danielle Albers Szafir"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.04717",
    "title": "Fully Decentralized Peer-to-Peer Community Grid with Dynamic and  Congestion Pricing",
    "abstract": "Peer-to-peer (P2P) electricity markets enable prosumers to minimize their costs, which has been extensively studied in recent research. However, there are several challenges with P2P trading when physical network constraints are also included. Moreover, most studies use fixed prices for grid power prices without considering dynamic grid pricing, and equity for all participants. This policy may negatively affect the long-term development of the market if prosumers with low demand are not treated fairly. An initial step towards addressing these problems is the design of a new decentralized P2P electricity market with two dynamic grid pricing schemes that are determined by consumer demand. Futhermore, we consider a decentralized system with physical constraints for optimizing power flow in networks without compromising privacy. We propose a dynamic congestion price to effectively address congestion and then prove the convergence and global optimality of the proposed method. Our experiments show that P2P energy trade decreases generation cost of main grid by 56.9% compared with previous works. Consumers reduce grid trading by 57.3% while the social welfare of consumers is barely affected by the increase of grid price. ",
    "url": "https://arxiv.org/abs/2308.04717",
    "authors": [
      "Hien Thanh Doan",
      "Truong Hoang Bao Huy",
      "Daehee Kim",
      "Hongseok Kim"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.04725",
    "title": "Self-supervised Learning of Rotation-invariant 3D Point Set Features  using Transformer and its Self-distillation",
    "abstract": "Invariance against rotations of 3D objects is an important property in analyzing 3D point set data. Conventional 3D point set DNNs having rotation invariance typically obtain accurate 3D shape features via supervised learning by using labeled 3D point sets as training samples. However, due to the rapid increase in 3D point set data and the high cost of labeling, a framework to learn rotation-invariant 3D shape features from numerous unlabeled 3D point sets is required. This paper proposes a novel self-supervised learning framework for acquiring accurate and rotation-invariant 3D point set features at object-level. Our proposed lightweight DNN architecture decomposes an input 3D point set into multiple global-scale regions, called tokens, that preserve the spatial layout of partial shapes composing the 3D object. We employ a self-attention mechanism to refine the tokens and aggregate them into an expressive rotation-invariant feature per 3D point set. Our DNN is effectively trained by using pseudo-labels generated by a self-distillation framework. To facilitate the learning of accurate features, we propose to combine multi-crop and cut-mix data augmentation techniques to diversify 3D point sets for training. Through a comprehensive evaluation, we empirically demonstrate that, (1) existing rotation-invariant DNN architectures designed for supervised learning do not necessarily learn accurate 3D shape features under a self-supervised learning scenario, and (2) our proposed algorithm learns rotation-invariant 3D point set features that are more accurate than those learned by existing algorithms. Code will be available at https://github.com/takahikof/RIPT_SDMM ",
    "url": "https://arxiv.org/abs/2308.04725",
    "authors": [
      "Takahiko Furuya",
      "Zhoujie Chen",
      "Ryutarou Ohbuchi",
      "Zhenzhong Kuang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2308.04736",
    "title": "Case Study: Using AI-Assisted Code Generation In Mobile Teams",
    "abstract": "The aim of this study is to evaluate the performance of AI-assisted programming in actual mobile development teams that are focused on native mobile languages like Kotlin and Swift. The extensive case study involves 16 participants and 2 technical reviewers, from a software development department designed to understand the impact of using LLMs trained for code generation in specific phases of the team, more specifically, technical onboarding and technical stack switch. The study uses technical problems dedicated to each phase and requests solutions from the participants with and without using AI-Code generators. It measures time, correctness, and technical integration using ReviewerScore, a metric specific to the paper and extracted from actual industry standards, the code reviewers of merge requests. The output is converted and analyzed together with feedback from the participants in an attempt to determine if using AI-assisted programming tools will have an impact on getting developers onboard in a project or helping them with a smooth transition between the two native development environments of mobile development, Android and iOS. The study was performed between May and June 2023 with members of the mobile department of a software development company based in Cluj-Napoca, with Romanian ownership and management. ",
    "url": "https://arxiv.org/abs/2308.04736",
    "authors": [
      "Mircea-Serban Vasiliniuc",
      "Adrian Groza"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04749",
    "title": "Enhancing Efficient Continual Learning with Dynamic Structure  Development of Spiking Neural Networks",
    "abstract": "Children possess the ability to learn multiple cognitive tasks sequentially, which is a major challenge toward the long-term goal of artificial general intelligence. Existing continual learning frameworks are usually applicable to Deep Neural Networks (DNNs) and lack the exploration on more brain-inspired, energy-efficient Spiking Neural Networks (SNNs). Drawing on continual learning mechanisms during child growth and development, we propose Dynamic Structure Development of Spiking Neural Networks (DSD-SNN) for efficient and adaptive continual learning. When learning a sequence of tasks, the DSD-SNN dynamically assigns and grows new neurons to new tasks and prunes redundant neurons, thereby increasing memory capacity and reducing computational overhead. In addition, the overlapping shared structure helps to quickly leverage all acquired knowledge to new tasks, empowering a single network capable of supporting multiple incremental tasks (without the separate sub-network mask for each task). We validate the effectiveness of the proposed model on multiple class incremental learning and task incremental learning benchmarks. Extensive experiments demonstrated that our model could significantly improve performance, learning speed and memory capacity, and reduce computational overhead. Besides, our DSD-SNN model achieves comparable performance with the DNNs-based methods, and significantly outperforms the state-of-the-art (SOTA) performance for existing SNNs-based continual learning methods. ",
    "url": "https://arxiv.org/abs/2308.04749",
    "authors": [
      "Bing Han",
      "Feifei Zhao",
      "Yi Zeng",
      "Wenxuan Pan",
      "Guobin Shen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04753",
    "title": "SAfER: Layer-Level Sensitivity Assessment for Efficient and Robust  Neural Network Inference",
    "abstract": "Deep neural networks (DNNs) demonstrate outstanding performance across most computer vision tasks. Some critical applications, such as autonomous driving or medical imaging, also require investigation into their behavior and the reasons behind the decisions they make. In this vein, DNN attribution consists in studying the relationship between the predictions of a DNN and its inputs. Attribution methods have been adapted to highlight the most relevant weights or neurons in a DNN, allowing to more efficiently select which weights or neurons can be pruned. However, a limitation of these approaches is that weights are typically compared within each layer separately, while some layers might appear as more critical than others. In this work, we propose to investigate DNN layer importance, i.e. to estimate the sensitivity of the accuracy w.r.t. perturbations applied at the layer level. To do so, we propose a novel dataset to evaluate our method as well as future works. We benchmark a number of criteria and draw conclusions regarding how to assess DNN layer importance and, consequently, how to budgetize layers for increased DNN efficiency (with applications for DNN pruning and quantization), as well as robustness to hardware failure (e.g. bit swaps). ",
    "url": "https://arxiv.org/abs/2308.04753",
    "authors": [
      "Edouard Yvinec",
      "Arnaud Dapogny",
      "Kevin Bailly"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04758",
    "title": "Bird's-Eye-View Scene Graph for Vision-Language Navigation",
    "abstract": "Vision-language navigation (VLN), which entails an agent to navigate 3D environments following human instructions, has shown great advances. However, current agents are built upon panoramic observations, which hinders their ability to perceive 3D scene geometry and easily leads to ambiguous selection of panoramic view. To address these limitations, we present a BEV Scene Graph (BSG), which leverages multi-step BEV representations to encode scene layouts and geometric cues of indoor environment under the supervision of 3D detection. During navigation, BSG builds a local BEV representation at each step and maintains a BEV-based global scene map, which stores and organizes all the online collected local BEV representations according to their topological relations. Based on BSG, the agent predicts a local BEV grid-level decision score and a global graph-level decision score, combined with a sub-view selection score on panoramic views, for more accurate action prediction. Our approach significantly outperforms state-of-the-art methods on REVERIE, R2R, and R4R, showing the potential of BEV perception in VLN. ",
    "url": "https://arxiv.org/abs/2308.04758",
    "authors": [
      "Rui Liu",
      "Xiaohan Wang",
      "Wenguan Wang",
      "Yi Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04765",
    "title": "FaceSkin: A Privacy Preserving Facial skin patch Dataset for multi  Attributes classification",
    "abstract": "Human facial skin images contain abundant textural information that can serve as valuable features for attribute classification, such as age, race, and gender. Additionally, facial skin images offer the advantages of easy collection and minimal privacy concerns. However, the availability of well-labeled human skin datasets with a sufficient number of images is limited. To address this issue, we introduce a dataset called FaceSkin, which encompasses a diverse range of ages and races. Furthermore, to broaden the application scenarios, we incorporate synthetic skin-patches obtained from 2D and 3D attack images, including printed paper, replays, and 3D masks. We evaluate the FaceSkin dataset across distinct categories and present experimental results demonstrating its effectiveness in attribute classification, as well as its potential for various downstream tasks, such as Face anti-spoofing and Age estimation. ",
    "url": "https://arxiv.org/abs/2308.04765",
    "authors": [
      "Qiushi Guo",
      "Shisha Liao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04767",
    "title": "Induction Network: Audio-Visual Modality Gap-Bridging for  Self-Supervised Sound Source Localization",
    "abstract": "Self-supervised sound source localization is usually challenged by the modality inconsistency. In recent studies, contrastive learning based strategies have shown promising to establish such a consistent correspondence between audio and sound sources in visual scenarios. Unfortunately, the insufficient attention to the heterogeneity influence in the different modality features still limits this scheme to be further improved, which also becomes the motivation of our work. In this study, an Induction Network is proposed to bridge the modality gap more effectively. By decoupling the gradients of visual and audio modalities, the discriminative visual representations of sound sources can be learned with the designed Induction Vector in a bootstrap manner, which also enables the audio modality to be aligned with the visual modality consistently. In addition to a visual weighted contrastive loss, an adaptive threshold selection strategy is introduced to enhance the robustness of the Induction Network. Substantial experiments conducted on SoundNet-Flickr and VGG-Sound Source datasets have demonstrated a superior performance compared to other state-of-the-art works in different challenging scenarios. The code is available at https://github.com/Tahy1/AVIN ",
    "url": "https://arxiv.org/abs/2308.04767",
    "authors": [
      "Tianyu Liu",
      "Peng Zhang",
      "Wei Huang",
      "Yufei Zha",
      "Tao You",
      "Yanning Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.04768",
    "title": "Entire Space Cascade Delayed Feedback Modeling for Effective Conversion  Rate Prediction",
    "abstract": "Conversion rate (CVR) prediction is an essential task for large-scale e-commerce platforms. However, refund behaviors frequently occur after conversion in online shopping systems, which drives us to pay attention to effective conversion for building healthier shopping services. This paper defines the probability of item purchasing without any subsequent refund as an effective conversion rate (ECVR). A simple paradigm for ECVR prediction is to decompose it into two sub-tasks: CVR prediction and post-conversion refund rate (RFR) prediction. However, RFR prediction suffers from data sparsity (DS) and sample selection bias (SSB) issues, as the refund behaviors are only available after user purchase. Furthermore, there is delayed feedback in both conversion and refund events and they are sequentially dependent, named cascade delayed feedback (CDF), which significantly harms data freshness for model training. Previous studies mainly focus on tackling DS and SSB or delayed feedback for a single event. To jointly tackle these issues in ECVR prediction, we propose an Entire space CAscade Delayed feedback modeling (ECAD) method. Specifically, ECAD deals with DS and SSB by constructing two tasks including CVR prediction and conversion \\& refund rate (CVRFR) prediction using the entire space modeling framework. In addition, it carefully schedules auxiliary tasks to leverage both conversion and refund time within data to alleviate CDF. Experimental results on the offline industrial dataset and online A/B testing demonstrate the effectiveness of ECAD. In addition, ECAD has been deployed in one of the recommender systems in Alibaba, contributing to a significant improvement of ECVR. ",
    "url": "https://arxiv.org/abs/2308.04768",
    "authors": [
      "Yunfeng Zhao",
      "Xu Yan",
      "Xiaoqiang Gui",
      "Shuguang Han",
      "Xiang-Rong Sheng",
      "Guoxian Yu",
      "Jufeng Chen",
      "Zhao Xu",
      "Bo Zheng"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2308.04769",
    "title": "Correlation-diversified portfolio construction by finding maximum  independent set in large-scale market graph",
    "abstract": "Correlation-diversified portfolios can be constructed by finding the maximum independent sets (MISs) in market graphs with edges corresponding to correlations between two stocks. The computational complexity to find the MIS increases exponentially as the size of the market graph increases, making the MIS selection in a large-scale market graph difficult. Here we construct a diversified portfolio by solving the MIS problem for a large-scale market graph with a combinatorial optimization solver (an Ising machine) based on a quantum-inspired algorithm called simulated bifurcation (SB) and investigate the investment performance of the constructed portfolio using long-term historical market data. Comparisons using stock universes of various sizes [TOPIX 100, Nikkei 225, TOPIX 1000, and TOPIX (including approximately 2,000 constituents)] show that the SB-based solver outperforms conventional MIS solvers in terms of computation-time and solution-accuracy. By using the SB-based solver, we optimized the parameters of a MIS portfolio strategy through iteration of the backcast simulation that calculates the performance of the MIS portfolio strategy based on a large-scale universe covering more than 1,700 Japanese stocks for a long period of 10 years. It has been found that the best MIS portfolio strategy (Sharpe ratio = 1.16, annualized return/risk = 16.3%/14.0%) outperforms the major indices such as TOPIX (0.66, 10.0%/15.2%) and MSCI Japan Minimum Volatility Index (0.64, 7.7%/12.1%) for the period from 2013 to 2023. ",
    "url": "https://arxiv.org/abs/2308.04769",
    "authors": [
      "Ryo Hidaka",
      "Yohei Hamakawa",
      "Jun Nakayama",
      "Kosuke Tatsumura"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Portfolio Management (q-fin.PM)"
    ]
  },
  {
    "id": "arXiv:2308.04770",
    "title": "Objects do not disappear: Video object detection by single-frame object  location anticipation",
    "abstract": "Objects in videos are typically characterized by continuous smooth motion. We exploit continuous smooth motion in three ways. 1) Improved accuracy by using object motion as an additional source of supervision, which we obtain by anticipating object locations from a static keyframe. 2) Improved efficiency by only doing the expensive feature computations on a small subset of all frames. Because neighboring video frames are often redundant, we only compute features for a single static keyframe and predict object locations in subsequent frames. 3) Reduced annotation cost, where we only annotate the keyframe and use smooth pseudo-motion between keyframes. We demonstrate computational efficiency, annotation efficiency, and improved mean average precision compared to the state-of-the-art on four datasets: ImageNet VID, EPIC KITCHENS-55, YouTube-BoundingBoxes, and Waymo Open dataset. Our source code is available at https://github.com/L-KID/Videoobject-detection-by-location-anticipation. ",
    "url": "https://arxiv.org/abs/2308.04770",
    "authors": [
      "Xin Liu",
      "Fatemeh Karimi Nejadasl",
      "Jan C. van Gemert",
      "Olaf Booij",
      "Silvia L. Pintea"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04774",
    "title": "E3-UAV: An Edge-based Energy-Efficient Object Detection System for  Unmanned Aerial Vehicles",
    "abstract": "Motivated by the advances in deep learning techniques, the application of Unmanned Aerial Vehicle (UAV)-based object detection has proliferated across a range of fields, including vehicle counting, fire detection, and city monitoring. While most existing research studies only a subset of the challenges inherent to UAV-based object detection, there are few studies that balance various aspects to design a practical system for energy consumption reduction. In response, we present the E3-UAV, an edge-based energy-efficient object detection system for UAVs. The system is designed to dynamically support various UAV devices, edge devices, and detection algorithms, with the aim of minimizing energy consumption by deciding the most energy-efficient flight parameters (including flight altitude, flight speed, detection algorithm, and sampling rate) required to fulfill the detection requirements of the task. We first present an effective evaluation metric for actual tasks and construct a transparent energy consumption model based on hundreds of actual flight data to formalize the relationship between energy consumption and flight parameters. Then we present a lightweight energy-efficient priority decision algorithm based on a large quantity of actual flight data to assist the system in deciding flight parameters. Finally, we evaluate the performance of the system, and our experimental results demonstrate that it can significantly decrease energy consumption in real-world scenarios. Additionally, we provide four insights that can assist researchers and engineers in their efforts to study UAV-based object detection further. ",
    "url": "https://arxiv.org/abs/2308.04774",
    "authors": [
      "Jiashun Suo",
      "Xingzhou Zhang",
      "Weisong Shi",
      "Wei Zhou"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.04779",
    "title": "Multi-View Fusion and Distillation for Subgrade Distresses Detection  based on 3D-GPR",
    "abstract": "The application of 3D ground-penetrating radar (3D-GPR) for subgrade distress detection has gained widespread popularity. To enhance the efficiency and accuracy of detection, pioneering studies have attempted to adopt automatic detection techniques, particularly deep learning. However, existing works typically rely on traditional 1D A-scan, 2D B-scan or 3D C-scan data of the GPR, resulting in either insufficient spatial information or high computational complexity. To address these challenges, we introduce a novel methodology for the subgrade distress detection task by leveraging the multi-view information from 3D-GPR data. Moreover, we construct a real multi-view image dataset derived from the original 3D-GPR data for the detection task, which provides richer spatial information compared to A-scan and B-scan data, while reducing computational complexity compared to C-scan data. Subsequently, we develop a novel \\textbf{M}ulti-\\textbf{V}iew \\textbf{V}usion and \\textbf{D}istillation framework, \\textbf{GPR-MVFD}, specifically designed to optimally utilize the multi-view GPR dataset. This framework ingeniously incorporates multi-view distillation and attention-based fusion to facilitate significant feature extraction for subgrade distresses. In addition, a self-adaptive learning mechanism is adopted to stabilize the model training and prevent performance degeneration in each branch. Extensive experiments conducted on this new GPR benchmark demonstrate the effectiveness and efficiency of our proposed framework. Our framework outperforms not only the existing GPR baselines, but also the state-of-the-art methods in the fields of multi-view learning, multi-modal learning, and knowledge distillation. We will release the constructed multi-view GPR dataset with expert-annotated labels and the source codes of the proposed framework. ",
    "url": "https://arxiv.org/abs/2308.04779",
    "authors": [
      "Chunpeng Zhou",
      "Kangjie Ning",
      "Haishuai Wang",
      "Zhi Yu",
      "Sheng Zhou",
      "Jiajun Bu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04782",
    "title": "PointMBF: A Multi-scale Bidirectional Fusion Network for Unsupervised  RGB-D Point Cloud Registration",
    "abstract": "Point cloud registration is a task to estimate the rigid transformation between two unaligned scans, which plays an important role in many computer vision applications. Previous learning-based works commonly focus on supervised registration, which have limitations in practice. Recently, with the advance of inexpensive RGB-D sensors, several learning-based works utilize RGB-D data to achieve unsupervised registration. However, most of existing unsupervised methods follow a cascaded design or fuse RGB-D data in a unidirectional manner, which do not fully exploit the complementary information in the RGB-D data. To leverage the complementary information more effectively, we propose a network implementing multi-scale bidirectional fusion between RGB images and point clouds generated from depth images. By bidirectionally fusing visual and geometric features in multi-scales, more distinctive deep features for correspondence estimation can be obtained, making our registration more accurate. Extensive experiments on ScanNet and 3DMatch demonstrate that our method achieves new state-of-the-art performance. Code will be released at https://github.com/phdymz/PointMBF ",
    "url": "https://arxiv.org/abs/2308.04782",
    "authors": [
      "Mingzhi Yuan",
      "Kexue Fu",
      "Zhihao Li",
      "Yucong Meng",
      "Manning Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04789",
    "title": "Multi-Scale Memory Comparison for Zero-/Few-Shot Anomaly Detection",
    "abstract": "Anomaly detection has gained considerable attention due to its broad range of applications, particularly in industrial defect detection. To address the challenges of data collection, researchers have introduced zero-/few-shot anomaly detection techniques that require minimal normal images for each category. However, complex industrial scenarios often involve multiple objects, presenting a significant challenge. In light of this, we propose a straightforward yet powerful multi-scale memory comparison framework for zero-/few-shot anomaly detection. Our approach employs a global memory bank to capture features across the entire image, while an individual memory bank focuses on simplified scenes containing a single object. The efficacy of our method is validated by its remarkable achievement of 4th place in the zero-shot track and 2nd place in the few-shot track of the Visual Anomaly and Novelty Detection (VAND) competition. ",
    "url": "https://arxiv.org/abs/2308.04789",
    "authors": [
      "Chaoqin Huang",
      "Aofan Jiang",
      "Ya Zhang",
      "Yanfeng Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04797",
    "title": "A Novel Approach for Establishing Connectivity in Partitioned Mobile  Sensor Networks Using Beamforming Techniques",
    "abstract": "Network connectivity is one of the major design issues in the context of mobile sensor networks. Due to diverse communication patterns, some nodes lying in high-traffic zones may consume more energy and eventually die out resulting in network partitioning. This phenomenon may deprive a large number of alive nodes of sending their important time critical data to the sink. The application of data caching in mobile sensor networks is exponentially increasing as a high-speed data storage layer. This paper presents a deep learning-based beamforming approach to find the optimal transmission strategies for cache-enabled backhaul networks. In the proposed scheme, the sensor nodes in isolated partitions work together to form a directional beam which significantly increases their overall communication range to reach out a distant relay node connected to the main part of the network. The proposed methodology of cooperative beamforming-based partition connectivity works efficiently if an isolated cluster gets partitioned with a favorably large number of nodes. We also present a new cross-layer method for link cost that makes a balance between the energy used by the relay. By directly adding the accessible auxiliary nodes to the set of routing links, the algorithm chooses paths which provide maximum dynamic beamforming usage for the intermediate nodes. The proposed approach is then evaluated through simulation results. The simulation results show that the proposed mechanism achieves up to 30% energy consumption reduction through beamforming as partition healing in addition to guarantee user throughput. ",
    "url": "https://arxiv.org/abs/2308.04797",
    "authors": [
      "Abbas Mirzaei",
      "Shahram Zandiyan"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.04798",
    "title": "Enhancing Mobile Privacy and Security: A Face Skin Patch-Based  Anti-Spoofing Approach",
    "abstract": "As Facial Recognition System(FRS) is widely applied in areas such as access control and mobile payments due to its convenience and high accuracy. The security of facial recognition is also highly regarded. The Face anti-spoofing system(FAS) for face recognition is an important component used to enhance the security of face recognition systems. Traditional FAS used images containing identity information to detect spoofing traces, however there is a risk of privacy leakage during the transmission and storage of these images. Besides, the encryption and decryption of these privacy-sensitive data takes too long compared to inference time by FAS model. To address the above issues, we propose a face anti-spoofing algorithm based on facial skin patches leveraging pure facial skin patch images as input, which contain no privacy information, no encryption or decryption is needed for these images. We conduct experiments on several public datasets, the results prove that our algorithm has demonstrated superiority in both accuracy and speed. ",
    "url": "https://arxiv.org/abs/2308.04798",
    "authors": [
      "Qiushi Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04802",
    "title": "Generalized Unbiased Scene Graph Generation",
    "abstract": "Existing Unbiased Scene Graph Generation (USGG) methods only focus on addressing the predicate-level imbalance that high-frequency classes dominate predictions of rare ones, while overlooking the concept-level imbalance. Actually, even if predicates themselves are balanced, there is still a significant concept-imbalance within them due to the long-tailed distribution of contexts (i.e., subject-object combinations). This concept-level imbalance poses a more pervasive and challenging issue compared to the predicate-level imbalance since subject-object pairs are inherently complex in combinations. Hence, we introduce a novel research problem: Generalized Unbiased Scene Graph Generation (G-USGG), which takes into account both predicate-level and concept-level imbalance. To the end, we propose the Multi-Concept Learning (MCL) framework, which ensures a balanced learning process across rare/ uncommon/ common concepts. MCL first quantifies the concept-level imbalance across predicates in terms of different amounts of concepts, representing as multiple concept-prototypes within the same class. It then effectively learns concept-prototypes by applying the Concept Regularization (CR) technique. Furthermore, to achieve balanced learning over different concepts, we introduce the Balanced Prototypical Memory (BPM), which guides SGG models to generate balanced representations for concept-prototypes. Extensive experiments demonstrate the remarkable efficacy of our model-agnostic strategy in enhancing the performance of benchmark models on both VG-SGG and OI-SGG datasets, leading to new state-of-the-art achievements in two key aspects: predicate-level unbiased relation recognition and concept-level compositional generability. ",
    "url": "https://arxiv.org/abs/2308.04802",
    "authors": [
      "Xinyu Lyu",
      "Lianli Gao",
      "Junlin Xie",
      "Pengpeng Zeng",
      "Yulu Tian",
      "Jie Shao",
      "Heng Tao Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04803",
    "title": "Extreme Value Theory-based Robust Minimum-Power Precoding for URLLC",
    "abstract": "Channel state information (CSI) is crucial for achieving ultra-reliable low-latency communication (URLLC) in wireless networks. The main associated problems are the CSI acquisition time, which impacts the delay requirements of time-critical applications, and the estimation accuracy, which degrades the signal-to-interference-plus-noise ratio (SINR), thus, reducing reliability. In this work, we formulate and solve a minimum-power precoding design problem simultaneously serving multiple URLLC users in the downlink with imperfect CSI availability. Specifically, we develop an algorithm that exploits state-of-the-art precoding schemes such as the maximal ratio transmission (MRT) and zero-forcing (ZF), and adjust the power of the precoders to compensate for the channel estimation error uncertainty based on the extreme value theory (EVT) framework. Finally, we evaluate the performance of our method and show its superiority concerning worst-case robust precoding, which is used as a benchmark. ",
    "url": "https://arxiv.org/abs/2308.04803",
    "authors": [
      "Dian Echevarría Pérez",
      "Onel L. Alcaraz López",
      "Hirley Alves"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2308.04808",
    "title": "Joint-Relation Transformer for Multi-Person Motion Prediction",
    "abstract": "Multi-person motion prediction is a challenging problem due to the dependency of motion on both individual past movements and interactions with other people. Transformer-based methods have shown promising results on this task, but they miss the explicit relation representation between joints, such as skeleton structure and pairwise distance, which is crucial for accurate interaction modeling. In this paper, we propose the Joint-Relation Transformer, which utilizes relation information to enhance interaction modeling and improve future motion prediction. Our relation information contains the relative distance and the intra-/inter-person physical constraints. To fuse relation and joint information, we design a novel joint-relation fusion layer with relation-aware attention to update both features. Additionally, we supervise the relation information by forecasting future distance. Experiments show that our method achieves a 13.4% improvement of 900ms VIM on 3DPW-SoMoF/RC and 17.8%/12.0% improvement of 3s MPJPE on CMU-Mpcap/MuPoTS-3D dataset. ",
    "url": "https://arxiv.org/abs/2308.04808",
    "authors": [
      "Qingyao Xu",
      "Weibo Mao",
      "Jingze Gong",
      "Chenxin Xu",
      "Siheng Chen",
      "Weidi Xie",
      "Ya Zhang",
      "Yanfeng Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04811",
    "title": "A Bipartite Graph is All We Need for Enhancing Emotional Reasoning with  Commonsense Knowledge",
    "abstract": "The context-aware emotional reasoning ability of AI systems, especially in conversations, is of vital importance in applications such as online opinion mining from social media and empathetic dialogue systems. Due to the implicit nature of conveying emotions in many scenarios, commonsense knowledge is widely utilized to enrich utterance semantics and enhance conversation modeling. However, most previous knowledge infusion methods perform empirical knowledge filtering and design highly customized architectures for knowledge interaction with the utterances, which can discard useful knowledge aspects and limit their generalizability to different knowledge sources. Based on these observations, we propose a Bipartite Heterogeneous Graph (BHG) method for enhancing emotional reasoning with commonsense knowledge. In BHG, the extracted context-aware utterance representations and knowledge representations are modeled as heterogeneous nodes. Two more knowledge aggregation node types are proposed to perform automatic knowledge filtering and interaction. BHG-based knowledge infusion can be directly generalized to multi-type and multi-grained knowledge sources. In addition, we propose a Multi-dimensional Heterogeneous Graph Transformer (MHGT) to perform graph reasoning, which can retain unchanged feature spaces and unequal dimensions for heterogeneous node types during inference to prevent unnecessary loss of information. Experiments show that BHG-based methods significantly outperform state-of-the-art knowledge infusion methods and show generalized knowledge infusion ability with higher efficiency. Further analysis proves that previous empirical knowledge filtering methods do not guarantee to provide the most useful knowledge information. Our code is available at: https://github.com/SteveKGYang/BHG. ",
    "url": "https://arxiv.org/abs/2308.04811",
    "authors": [
      "Kailai Yang",
      "Tianlin Zhang",
      "Shaoxiong Ji",
      "Sophia Ananiadou"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.04818",
    "title": "Enhancement of Satellite-to-Phone Link Budget by Using Distributed  Beamforming",
    "abstract": "Small satellites in Low Earth Orbit (LEO) attract much attention from both industry and academia. The latest production and launch technologies constantly drive the development of LEO constellations. However, the wideband signal, except text messages, cannot be transmitted directly from an LEO satellite to a standard mobile cellular phone due to the insufficient link budget. The current LEO constellation network has to use an extra ground device to receive the signal from the satellite first and then forward the signal to the User Equipment (UE). To achieve direct network communications between LEO satellites and UE, we propose a novel distributed beamforming technology based on the superposition of electromagnetic (EM) waves radiated from multiple satellites that can significantly enhance the link budget in this paper. EM full-wave simulation and Monte Carlo simulation results are provided to verify the effectiveness of the proposed method. The simulation results show a nearly 6 dB enhancement using two radiation sources and an almost 12 dB enhancement using four sources. The received power enhancement could be doubled compared to the diversity gain in Multiple-Input and Single-Output (MISO). Furthermore, other practical application challenges, such as the synchronization and Doppler effect, are also presented. ",
    "url": "https://arxiv.org/abs/2308.04818",
    "authors": [
      "Zhuoao Xu",
      "Yue Gao",
      "Gaojie Chen",
      "Ryan Fernandez",
      "Vedaprabhu Basavarajappa",
      "Rahim Tafazolli"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2308.04826",
    "title": "WaveNeRF: Wavelet-based Generalizable Neural Radiance Fields",
    "abstract": "Neural Radiance Field (NeRF) has shown impressive performance in novel view synthesis via implicit scene representation. However, it usually suffers from poor scalability as requiring densely sampled images for each new scene. Several studies have attempted to mitigate this problem by integrating Multi-View Stereo (MVS) technique into NeRF while they still entail a cumbersome fine-tuning process for new scenes. Notably, the rendering quality will drop severely without this fine-tuning process and the errors mainly appear around the high-frequency features. In the light of this observation, we design WaveNeRF, which integrates wavelet frequency decomposition into MVS and NeRF to achieve generalizable yet high-quality synthesis without any per-scene optimization. To preserve high-frequency information when generating 3D feature volumes, WaveNeRF builds Multi-View Stereo in the Wavelet domain by integrating the discrete wavelet transform into the classical cascade MVS, which disentangles high-frequency information explicitly. With that, disentangled frequency features can be injected into classic NeRF via a novel hybrid neural renderer to yield faithful high-frequency details, and an intuitive frequency-guided sampling strategy can be designed to suppress artifacts around high-frequency regions. Extensive experiments over three widely studied benchmarks show that WaveNeRF achieves superior generalizable radiance field modeling when only given three images as input. ",
    "url": "https://arxiv.org/abs/2308.04826",
    "authors": [
      "Muyu Xu",
      "Fangneng Zhan",
      "Jiahui Zhang",
      "Yingchen Yu",
      "Xiaoqin Zhang",
      "Christian Theobalt",
      "Ling Shao",
      "Shijian Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04832",
    "title": "TSSR: A Truncated and Signed Square Root Activation Function for Neural  Networks",
    "abstract": "Activation functions are essential components of neural networks. In this paper, we introduce a new activation function called the Truncated and Signed Square Root (TSSR) function. This function is distinctive because it is odd, nonlinear, monotone and differentiable. Its gradient is continuous and always positive. Thanks to these properties, it has the potential to improve the numerical stability of neural networks. Several experiments confirm that the proposed TSSR has better performance than other stat-of-the-art activation functions. The proposed function has significant implications for the development of neural network models and can be applied to a wide range of applications in fields such as computer vision, natural language processing, and speech recognition. ",
    "url": "https://arxiv.org/abs/2308.04832",
    "authors": [
      "Yuanhao Gong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2308.04838",
    "title": "No Need to Lift a Finger Anymore? Assessing the Quality of Code  Generation by ChatGPT",
    "abstract": "Large language models (LLMs) have demonstrated impressive capabilities across various natural language processing (NLP) tasks, such as machine translation, question answering, summarization, and so on. Additionally, LLMs are also highly valuable in supporting software engineering tasks, particularly in the field of code generation. Automatic code generation is a process of automatically generating source code or executable code based on given specifications or requirements, improving developer productivity. In this study, we perform a systematic empirical assessment of code generation using ChatGPT, a recent and popular LLM. Our evaluation encompasses a comprehensive analysis of code snippets generated by ChatGPT, focusing on three critical aspects: correctness, understandability, and security. We also specifically investigate ChatGPT's ability to engage in multi-round process (i.e., ChatGPT's dialog ability) of facilitating code generation. By delving into the generated code and examining the experimental results, this work provides valuable insights into the performance of ChatGPT in tackling code generation tasks. Overall, our findings uncover potential issues and limitations that arise in the ChatGPT-based code generation and lay the groundwork for improving AI and LLM-based code generation techniques. ",
    "url": "https://arxiv.org/abs/2308.04838",
    "authors": [
      "Zhijie Liu",
      "Yutian Tang",
      "Xiapu Luo",
      "Yuming Zhou",
      "Liang Feng Zhang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.04853",
    "title": "Aggregated demand flexibility prediction of residential thermostatically  controlled loads and participation in electricity balance markets",
    "abstract": "The aggregate demand flexibility of a set of thermostatically controlled residential loads (TCLs) can be represented by a virtual battery (VB) in order to manage their participation in the electricity markets. For this purpose, it is necessary to know in advance and with a high level of reliability the maximum power that can be supplied by the aggregation of TCLs. A probability function of the power that can be supplied by a VB is introduced. This probability function is used to predict the demand flexibility using a new experimental probabilistic method based on a combination of Monte Carlo simulation and extremum search by bisection algorithm (MC\\&ESB). As a result, the maximum flexibility power that a VB can provide with a certain guaranteed probability is obtained. The performance and validity of the proposed method are demonstrated in three different case studies where a VB bids its aggregate power in the Spanish electricity balancing markets (SEBM). ",
    "url": "https://arxiv.org/abs/2308.04853",
    "authors": [
      "Alejandro Martín-Crespo",
      "Enrique Baeyens",
      "Sergio Saludes-Rodil",
      "Fernando Frechoso-Escudero"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.04879",
    "title": "Comparing How a Chatbot References User Utterances from Previous  Chatting Sessions: An Investigation of Users' Privacy Concerns and  Perceptions",
    "abstract": "Chatbots are capable of remembering and referencing previous conversations, but does this enhance user engagement or infringe on privacy? To explore this trade-off, we investigated the format of how a chatbot references previous conversations with a user and its effects on a user's perceptions and privacy concerns. In a three-week longitudinal between-subjects study, 169 participants talked about their dental flossing habits to a chatbot that either, (1-None): did not explicitly reference previous user utterances, (2-Verbatim): referenced previous utterances verbatim, or (3-Paraphrase): used paraphrases to reference previous utterances. Participants perceived Verbatim and Paraphrase chatbots as more intelligent and engaging. However, the Verbatim chatbot also raised privacy concerns with participants. To gain insights as to why people prefer certain conditions or had privacy concerns, we conducted semi-structured interviews with 15 participants. We discuss implications from our findings that can help designers choose an appropriate format to reference previous user utterances and inform in the design of longitudinal dialogue scripting. ",
    "url": "https://arxiv.org/abs/2308.04879",
    "authors": [
      "Samuel Rhys Cox",
      "Yi-Chieh Lee",
      "Wei Tsang Ooi"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.04886",
    "title": "Unsupervised Out-of-Distribution Dialect Detection with Mahalanobis  Distance",
    "abstract": "Dialect classification is used in a variety of applications, such as machine translation and speech recognition, to improve the overall performance of the system. In a real-world scenario, a deployed dialect classification model can encounter anomalous inputs that differ from the training data distribution, also called out-of-distribution (OOD) samples. Those OOD samples can lead to unexpected outputs, as dialects of those samples are unseen during model training. Out-of-distribution detection is a new research area that has received little attention in the context of dialect classification. Towards this, we proposed a simple yet effective unsupervised Mahalanobis distance feature-based method to detect out-of-distribution samples. We utilize the latent embeddings from all intermediate layers of a wav2vec 2.0 transformer-based dialect classifier model for multi-task learning. Our proposed approach outperforms other state-of-the-art OOD detection methods significantly. ",
    "url": "https://arxiv.org/abs/2308.04886",
    "authors": [
      "Sourya Dipta Das",
      "Yash Vadi",
      "Abhishek Unnam",
      "Kuldeep Yadav"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.04892",
    "title": "Transmission and Color-guided Network for Underwater Image Enhancement",
    "abstract": "In recent years, with the continuous development of the marine industry, underwater image enhancement has attracted plenty of attention. Unfortunately, the propagation of light in water will be absorbed by water bodies and scattered by suspended particles, resulting in color deviation and low contrast. To solve these two problems, we propose an Adaptive Transmission and Dynamic Color guided network (named ATDCnet) for underwater image enhancement. In particular, to exploit the knowledge of physics, we design an Adaptive Transmission-directed Module (ATM) to better guide the network. To deal with the color deviation problem, we design a Dynamic Color-guided Module (DCM) to post-process the enhanced image color. Further, we design an Encoder-Decoder-based Compensation (EDC) structure with attention and a multi-stage feature fusion mechanism to perform color restoration and contrast enhancement simultaneously. Extensive experiments demonstrate the state-of-the-art performance of the ATDCnet on multiple benchmark datasets. ",
    "url": "https://arxiv.org/abs/2308.04892",
    "authors": [
      "Pan Mu",
      "Jing Fang",
      "Haotian Qian",
      "Cong Bai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.04905",
    "title": "GraphCC: A Practical Graph Learning-based Approach to Congestion Control  in Datacenters",
    "abstract": "Congestion Control (CC) plays a fundamental role in optimizing traffic in Data Center Networks (DCN). Currently, DCNs mainly implement two main CC protocols: DCTCP and DCQCN. Both protocols -- and their main variants -- are based on Explicit Congestion Notification (ECN), where intermediate switches mark packets when they detect congestion. The ECN configuration is thus a crucial aspect on the performance of CC protocols. Nowadays, network experts set static ECN parameters carefully selected to optimize the average network performance. However, today's high-speed DCNs experience quick and abrupt changes that severely change the network state (e.g., dynamic traffic workloads, incast events, failures). This leads to under-utilization and sub-optimal performance. This paper presents GraphCC, a novel Machine Learning-based framework for in-network CC optimization. Our distributed solution relies on a novel combination of Multi-agent Reinforcement Learning (MARL) and Graph Neural Networks (GNN), and it is compatible with widely deployed ECN-based CC protocols. GraphCC deploys distributed agents on switches that communicate with their neighbors to cooperate and optimize the global ECN configuration. In our evaluation, we test the performance of GraphCC under a wide variety of scenarios, focusing on the capability of this solution to adapt to new scenarios unseen during training (e.g., new traffic workloads, failures, upgrades). We compare GraphCC with a state-of-the-art MARL-based solution for ECN tuning -- ACC -- and observe that our proposed solution outperforms the state-of-the-art baseline in all of the evaluation scenarios, showing improvements up to $20\\%$ in Flow Completion Time as well as significant reductions in buffer occupancy ($38.0-85.7\\%$). ",
    "url": "https://arxiv.org/abs/2308.04905",
    "authors": [
      "Guillermo Bernárdez",
      "José Suárez-Varela",
      "Xiang Shi",
      "Shihan Xiao",
      "Xiangle Cheng",
      "Pere Barlet-Ros",
      "Albert Cabellos-Aparicio"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2308.04909",
    "title": "Adversarial Deep Reinforcement Learning for Cyber Security in Software  Defined Networks",
    "abstract": "This paper focuses on the impact of leveraging autonomous offensive approaches in Deep Reinforcement Learning (DRL) to train more robust agents by exploring the impact of applying adversarial learning to DRL for autonomous security in Software Defined Networks (SDN). Two algorithms, Double Deep Q-Networks (DDQN) and Neural Episodic Control to Deep Q-Network (NEC2DQN or N2D), are compared. NEC2DQN was proposed in 2018 and is a new member of the deep q-network (DQN) family of algorithms. The attacker has full observability of the environment and access to a causative attack that uses state manipulation in an attempt to poison the learning process. The implementation of the attack is done under a white-box setting, in which the attacker has access to the defender's model and experiences. Two games are played; in the first game, DDQN is a defender and N2D is an attacker, and in second game, the roles are reversed. The games are played twice; first, without an active causative attack and secondly, with an active causative attack. For execution, three sets of game results are recorded in which a single set consists of 10 game runs. The before and after results are then compared in order to see if there was actually an improvement or degradation. The results show that with minute parameter changes made to the algorithms, there was growth in the attacker's role, since it is able to win games. Implementation of the adversarial learning by the introduction of the causative attack showed the algorithms are still able to defend the network according to their strengths. ",
    "url": "https://arxiv.org/abs/2308.04909",
    "authors": [
      "Luke Borchjes",
      "Clement Nyirenda",
      "Louise Leenen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04933",
    "title": "You Are How You Walk: Quantifying Privacy Risks in Step Count Data",
    "abstract": "Wearable devices have gained huge popularity in today's world. These devices collect large-scale health data from their users, such as heart rate and step count data, that is privacy sensitive, however it has not yet received the necessary attention in the academia. In this paper, we perform the first systematic study on quantifying privacy risks stemming from step count data. In particular, we propose two attacks including attribute inference for gender, age and education and temporal linkability. We demonstrate the severity of the privacy attacks by performing extensive evaluation on a real life dataset and derive key insights. We believe our results can serve as a step stone for deriving a privacy-preserving ecosystem for wearable devices in the future. ",
    "url": "https://arxiv.org/abs/2308.04933",
    "authors": [
      "Bartlomiej Surma",
      "Tahleen Rahman",
      "Monique Breteler",
      "Michael Backes",
      "Yang Zhang"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2308.04943",
    "title": "Differentially Private Graph Neural Network with Importance-Grained  Noise Adaption",
    "abstract": "Graph Neural Networks (GNNs) with differential privacy have been proposed to preserve graph privacy when nodes represent personal and sensitive information. However, the existing methods ignore that nodes with different importance may yield diverse privacy demands, which may lead to over-protect some nodes and decrease model utility. In this paper, we study the problem of importance-grained privacy, where nodes contain personal data that need to be kept private but are critical for training a GNN. We propose NAP-GNN, a node-importance-grained privacy-preserving GNN algorithm with privacy guarantees based on adaptive differential privacy to safeguard node information. First, we propose a Topology-based Node Importance Estimation (TNIE) method to infer unknown node importance with neighborhood and centrality awareness. Second, an adaptive private aggregation method is proposed to perturb neighborhood aggregation from node-importance-grain. Third, we propose to privately train a graph learning algorithm on perturbed aggregations in adaptive residual connection mode over multi-layers convolution for node-wise tasks. Theoretically analysis shows that NAP-GNN satisfies privacy guarantees. Empirical experiments over real-world graph datasets show that NAP-GNN achieves a better trade-off between privacy and accuracy. ",
    "url": "https://arxiv.org/abs/2308.04943",
    "authors": [
      "Yuxin Qi",
      "Xi Lin",
      "Jun Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.04944",
    "title": "Gaussian Image Anomaly Detection with Greedy Eigencomponent Selection",
    "abstract": "Anomaly detection (AD) in images, identifying significant deviations from normality, is a critical issue in computer vision. This paper introduces a novel approach to dimensionality reduction for AD using pre-trained convolutional neural network (CNN) that incorporate EfficientNet models. We investigate the importance of component selection and propose two types of tree search approaches, both employing a greedy strategy, for optimal eigencomponent selection. Our study conducts three main experiments to evaluate the effectiveness of our approach. The first experiment explores the influence of test set performance on component choice, the second experiment examines the performance when we train on one anomaly type and evaluate on all other types, and the third experiment investigates the impact of using a minimum number of images for training and selecting them based on anomaly types. Our approach aims to find the optimal subset of components that deliver the highest performance score, instead of focusing solely on the proportion of variance explained by each component and also understand the components behaviour in different settings. Our results indicate that the proposed method surpasses both Principal Component Analysis (PCA) and Negated Principal Component Analysis (NPCA) in terms of detection accuracy, even when using fewer components. Thus, our approach provides a promising alternative to conventional dimensionality reduction techniques in AD, and holds potential to enhance the efficiency and effectiveness of AD systems. ",
    "url": "https://arxiv.org/abs/2308.04944",
    "authors": [
      "Tetiana Gula",
      "João P C Bertoldo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04950",
    "title": "Performance Analysis of Transformer Based Models (BERT, ALBERT and  RoBERTa) in Fake News Detection",
    "abstract": "Fake news is fake material in a news media format but is not processed properly by news agencies. The fake material can provoke or defame significant entities or individuals or potentially even for the personal interests of the creators, causing problems for society. Distinguishing fake news and real news is challenging due to limited of domain knowledge and time constraints. According to the survey, the top three areas most exposed to hoaxes and misinformation by residents are in Banten, DKI Jakarta and West Java. The model of transformers is referring to an approach in the field of artificial intelligence (AI) in natural language processing utilizing the deep learning architectures. Transformers exercise a powerful attention mechanism to process text in parallel and produce rich and contextual word representations. A previous study indicates a superior performance of a transformer model known as BERT over and above non transformer approach. However, some studies suggest the performance can be improved with the use of improved BERT models known as ALBERT and RoBERTa. However, the modified BERT models are not well explored for detecting fake news in Bahasa Indonesia. In this research, we explore those transformer models and found that ALBERT outperformed other models with 87.6% accuracy, 86.9% precision, 86.9% F1-score, and 174.5 run-time (s/epoch) respectively. Source code available at: https://github.com/Shafna81/fakenewsdetection.git ",
    "url": "https://arxiv.org/abs/2308.04950",
    "authors": [
      "Shafna Fitria Nur Azizah",
      "Hasan Dwi Cahyono",
      "Sari Widya Sihwi",
      "Wisnu Widiarto"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04958",
    "title": "Improving Autonomous Separation Assurance through Distributed  Reinforcement Learning with Attention Networks",
    "abstract": "Advanced Air Mobility (AAM) introduces a new, efficient mode of transportation with the use of vehicle autonomy and electrified aircraft to provide increasingly autonomous transportation between previously underserved markets. Safe and efficient navigation of low altitude aircraft through highly dense environments requires the integration of a multitude of complex observations, such as surveillance, knowledge of vehicle dynamics, and weather. The processing and reasoning on these observations pose challenges due to the various sources of uncertainty in the information while ensuring cooperation with a variable number of aircraft in the airspace. These challenges coupled with the requirement to make safety-critical decisions in real-time rule out the use of conventional separation assurance techniques. We present a decentralized reinforcement learning framework to provide autonomous self-separation capabilities within AAM corridors with the use of speed and vertical maneuvers. The problem is formulated as a Markov Decision Process and solved by developing a novel extension to the sample-efficient, off-policy soft actor-critic (SAC) algorithm. We introduce the use of attention networks for variable-length observation processing and a distributed computing architecture to achieve high training sample throughput as compared to existing approaches. A comprehensive numerical study shows that the proposed framework can ensure safe and efficient separation of aircraft in high density, dynamic environments with various sources of uncertainty. ",
    "url": "https://arxiv.org/abs/2308.04958",
    "authors": [
      "Marc W. Brittain",
      "Luis E. Alvarez",
      "Kara Breeden"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04960",
    "title": "Representation Learning for Audio Privacy Preservation using Source  Separation and Robust Adversarial Learning",
    "abstract": "Privacy preservation has long been a concern in smart acoustic monitoring systems, where speech can be passively recorded along with a target signal in the system's operating environment. In this study, we propose the integration of two commonly used approaches in privacy preservation: source separation and adversarial representation learning. The proposed system learns the latent representation of audio recordings such that it prevents differentiating between speech and non-speech recordings. Initially, the source separation network filters out some of the privacy-sensitive data, and during the adversarial learning process, the system will learn privacy-preserving representation on the filtered signal. We demonstrate the effectiveness of our proposed method by comparing our method against systems without source separation, without adversarial learning, and without both. Overall, our results suggest that the proposed system can significantly improve speech privacy preservation compared to that of using source separation or adversarial learning solely while maintaining good performance in the acoustic monitoring task. ",
    "url": "https://arxiv.org/abs/2308.04960",
    "authors": [
      "Diep Luong",
      "Minh Tran",
      "Shayan Gharib",
      "Konstantinos Drossos",
      "Tuomas Virtanen"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2308.04961",
    "title": "CasCIFF: A Cross-Domain Information Fusion Framework Tailored for  Cascade Prediction in Social Networks",
    "abstract": "Existing approaches for information cascade prediction fall into three main categories: feature-driven methods, point process-based methods, and deep learning-based methods. Among them, deep learning-based methods, characterized by its superior learning and representation capabilities, mitigates the shortcomings inherent of the other methods. However, current deep learning methods still face several persistent challenges. In particular, accurate representation of user attributes remains problematic due to factors such as fake followers and complex network configurations. Previous algorithms that focus on the sequential order of user activations often neglect the rich insights offered by activation timing. Furthermore, these techniques often fail to holistically integrate temporal and structural aspects, thus missing the nuanced propagation trends inherent in information cascades.To address these issues, we propose the Cross-Domain Information Fusion Framework (CasCIFF), which is tailored for information cascade prediction. This framework exploits multi-hop neighborhood information to make user embeddings robust. When embedding cascades, the framework intentionally incorporates timestamps, endowing it with the ability to capture evolving patterns of information diffusion. In particular, the CasCIFF seamlessly integrates the tasks of user classification and cascade prediction into a consolidated framework, thereby allowing the extraction of common features that prove useful for all tasks, a strategy anchored in the principles of multi-task learning. ",
    "url": "https://arxiv.org/abs/2308.04961",
    "authors": [
      "Hongjun Zhu",
      "Shun Yuan",
      "Xin Liu",
      "Kuo Chen",
      "Chaolong Jia",
      "Ying Qian"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04964",
    "title": "Adversarial ModSecurity: Countering Adversarial SQL Injections with  Robust Machine Learning",
    "abstract": "ModSecurity is widely recognized as the standard open-source Web Application Firewall (WAF), maintained by the OWASP Foundation. It detects malicious requests by matching them against the Core Rule Set, identifying well-known attack patterns. Each rule in the CRS is manually assigned a weight, based on the severity of the corresponding attack, and a request is detected as malicious if the sum of the weights of the firing rules exceeds a given threshold. In this work, we show that this simple strategy is largely ineffective for detecting SQL injection (SQLi) attacks, as it tends to block many legitimate requests, while also being vulnerable to adversarial SQLi attacks, i.e., attacks intentionally manipulated to evade detection. To overcome these issues, we design a robust machine learning model, named AdvModSec, which uses the CRS rules as input features, and it is trained to detect adversarial SQLi attacks. Our experiments show that AdvModSec, being trained on the traffic directed towards the protected web services, achieves a better trade-off between detection and false positive rates, improving the detection rate of the vanilla version of ModSecurity with CRS by 21%. Moreover, our approach is able to improve its adversarial robustness against adversarial SQLi attacks by 42%, thereby taking a step forward towards building more robust and trustworthy WAFs. ",
    "url": "https://arxiv.org/abs/2308.04964",
    "authors": [
      "Biagio Montaruli",
      "Luca Demetrio",
      "Andrea Valenza",
      "Battista Biggio",
      "Luca Compagna",
      "Davide Balzarotti",
      "Davide Ariu",
      "Luca Piras"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.04972",
    "title": "can-train-and-test: A Curated CAN Dataset for Automotive Intrusion  Detection",
    "abstract": "When it comes to in-vehicle networks (IVNs), the controller area network -- CAN -- bus dominates the market; automobiles manufactured and sold around the world depend on the CAN bus for safety-critical communications between various components of the vehicle (e.g., the engine, the transmission, the steering column). Unfortunately, the CAN bus is inherently insecure; in fact, it completely lacks controls such as authentication, authorization, and confidentiality (i.e., encryption). Therefore, researchers have travailed to develop automotive security enhancements. The automotive intrusion detection system (IDS) is especially popular in the literature -- due to its relatively low cost in terms of money, resource utilization, and implementation effort. That said, developing and evaluating an automotive IDS is often challenging; if researchers do not have access to a test vehicle, then they are forced to depend on publicly available CAN data -- which is not without limitations. Lack of access to adequate CAN data, then, becomes a barrier to entry into automotive security research. We seek to lower that barrier to entry by introducing a new CAN dataset to facilitate the development and evaluation of automotive IDSs. Our dataset, dubbed can-train-and-test, provides CAN data from four different vehicles produced by two different manufacturers. The attack captures for each vehicle model are equivalent, enabling researchers to assess the ability of a given IDS to generalize to different vehicle models and even different vehicle manufacturers. Our dataset contains replayable .log files as well as labeled and unlabeled .csv files, thereby meeting a variety of development and evaluation needs. Furthermore, can-train-and-test offers nine unique attacks, ranging from denial of service (DoS) to gear spoofing to standstill... ",
    "url": "https://arxiv.org/abs/2308.04972",
    "authors": [
      "Brooke Lampe",
      "Weizhi Meng"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.04987",
    "title": "Self-supervised Landmark Learning with Deformation Reconstruction and  Cross-subject Consistency Objectives",
    "abstract": "A Point Distribution Model (PDM) is the basis of a Statistical Shape Model (SSM) that relies on a set of landmark points to represent a shape and characterize the shape variation. In this work, we present a self-supervised approach to extract landmark points from a given registration model for the PDMs. Based on the assumption that the landmarks are the points that have the most influence on registration, existing works learn a point-based registration model with a small number of points to estimate the landmark points that influence the deformation the most. However, such approaches assume that the deformation can be captured by point-based registration and quality landmarks can be learned solely with the deformation capturing objective. We argue that data with complicated deformations can not easily be modeled with point-based registration when only a limited number of points is used to extract influential landmark points. Further, landmark consistency is not assured in existing approaches In contrast, we propose to extract landmarks based on a given registration model, which is tailored for the target data, so we can obtain more accurate correspondences. Secondly, to establish the anatomical consistency of the predicted landmarks, we introduce a landmark discovery loss to explicitly encourage the model to predict the landmarks that are anatomically consistent across subjects. We conduct experiments on an osteoarthritis progression prediction task and show our method outperforms existing image-based and point-based approaches. ",
    "url": "https://arxiv.org/abs/2308.04987",
    "authors": [
      "Chun-Hung Chao",
      "Marc Niethammer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04992",
    "title": "AspectMMKG: A Multi-modal Knowledge Graph with Aspect-aware Entities",
    "abstract": "Multi-modal knowledge graphs (MMKGs) combine different modal data (e.g., text and image) for a comprehensive understanding of entities. Despite the recent progress of large-scale MMKGs, existing MMKGs neglect the multi-aspect nature of entities, limiting the ability to comprehend entities from various perspectives. In this paper, we construct AspectMMKG, the first MMKG with aspect-related images by matching images to different entity aspects. Specifically, we collect aspect-related images from a knowledge base, and further extract aspect-related sentences from the knowledge base as queries to retrieve a large number of aspect-related images via an online image search engine. Finally, AspectMMKG contains 2,380 entities, 18,139 entity aspects, and 645,383 aspect-related images. We demonstrate the usability of AspectMMKG in entity aspect linking (EAL) downstream task and show that previous EAL models achieve a new state-of-the-art performance with the help of AspectMMKG. To facilitate the research on aspect-related MMKG, we further propose an aspect-related image retrieval (AIR) model, that aims to correct and expand aspect-related images in AspectMMKG. We train an AIR model to learn the relationship between entity image and entity aspect-related images by incorporating entity image, aspect, and aspect image information. Experimental results indicate that the AIR model could retrieve suitable images for a given entity w.r.t different aspects. ",
    "url": "https://arxiv.org/abs/2308.04992",
    "authors": [
      "Jingdan Zhang",
      "Jiaan Wang",
      "Xiaodan Wang",
      "Zhixu Li",
      "Yanghua Xiao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.05007",
    "title": "Random-Walk Metaball-Imaging Discrete Element Lattice Boltzmann Method  for 3D Solute Transport in Fluid-Particle Systems with Complex Granular  Morphologies",
    "abstract": "Solute transport in fluid-particle systems is a fundamental process in numerous scientific and engineering disciplines. The simulation of it necessitates the consideration of solid particles with intricate shapes and sizes. To address this challenge, this study proposes the Random-Walk Metaball-Imaging Discrete Element Lattice Boltzmann Method (RW-MI-DELBM). In this model, we reconstruct particle geometries with the Metaball-Imaging algorithm, capture the particle behavior using the Discrete Element Method (DEM), simulate fluid behavior by the Lattice Boltzmann Method (LBM), and represent solute behavior through the Random Walk Method (RWM). Through the integration of these techniques with specially designed boundary conditions, we achieve to simulate the solute transport in fluid-particle systems comprising complex particle morphologies. Thorough validations, including analytical soluutions and experiments, are performed to assess the robustness and accuracy of this framework. The results demonstrate that the proposed framework can accurately capture the complex dynamics of solute transport under strict mass conservation. In particular, an investigation is carried out to assess the influence of particle morphologies on solute transport in a 3D oscillator, with a focus on identifying correlations between shape features and dispersion coefficients. Notably, all selected shape features exhibited strong correlations with the dispersion coefficient, indicating the significant influence of particle shapes on transport phenomena. However, due to the complexity of the relationship and the limited number of simulations, no clear patterns could be observed. Further comprehensive analyses incorporating a broader range of shape features and varying conditions are necessary to fully comprehend their collective influence on the dispersion coefficient. ",
    "url": "https://arxiv.org/abs/2308.05007",
    "authors": [
      "Yifeng Zhao",
      "Pei Zhang",
      "Stan Z. Li",
      "S.A. Galindo-Torres"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2308.05011",
    "title": "Multi-Class Deep SVDD: Anomaly Detection Approach in Astronomy with  Distinct Inlier Categories",
    "abstract": "With the increasing volume of astronomical data generated by modern survey telescopes, automated pipelines and machine learning techniques have become crucial for analyzing and extracting knowledge from these datasets. Anomaly detection, i.e. the task of identifying irregular or unexpected patterns in the data, is a complex challenge in astronomy. In this paper, we propose Multi-Class Deep Support Vector Data Description (MCDSVDD), an extension of the state-of-the-art anomaly detection algorithm One-Class Deep SVDD, specifically designed to handle different inlier categories with distinct data distributions. MCDSVDD uses a neural network to map the data into hyperspheres, where each hypersphere represents a specific inlier category. The distance of each sample from the centers of these hyperspheres determines the anomaly score. We evaluate the effectiveness of MCDSVDD by comparing its performance with several anomaly detection algorithms on a large dataset of astronomical light-curves obtained from the Zwicky Transient Facility. Our results demonstrate the efficacy of MCDSVDD in detecting anomalous sources while leveraging the presence of different inlier categories. The code and the data needed to reproduce our results are publicly available at https://github.com/mperezcarrasco/AnomalyALeRCE. ",
    "url": "https://arxiv.org/abs/2308.05011",
    "authors": [
      "Pérez-Carrasco Manuel",
      "Cabrera-Vives Guillermo",
      "Hernández-García Lorena",
      "Forster Francisco",
      "Sánchez-Sáez Paula",
      "Muñoz Arancibia Alejandra",
      "Astorga Nicolás",
      "Bauer Franz",
      "Bayo Amelia",
      "Cádiz-Leyton Martina",
      "Catelan Marcio"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)"
    ]
  },
  {
    "id": "arXiv:2308.05013",
    "title": "Dual Intents Graph Modeling for User-centric Group Discovery",
    "abstract": "Online groups have become increasingly prevalent, providing users with space to share experiences and explore interests. Therefore, user-centric group discovery task, i.e., recommending groups to users can help both users' online experiences and platforms' long-term developments. Existing recommender methods can not deal with this task as modeling user-group participation into a bipartite graph overlooks their item-side interests. Although there exist a few works attempting to address this task, they still fall short in fully preserving the social context and ensuring effective interest representation learning. In this paper, we focus on exploring the intents that motivate users to participate in groups, which can be categorized into different types, like the social-intent and the personal interest-intent. The former refers to users joining a group affected by their social links, while the latter relates to users joining groups with like-minded people for self-enjoyment. To comprehend different intents, we propose a novel model, DiRec, that first models each intent separately and then fuses them together for predictions. Specifically, for social-intent, we introduce the hypergraph structure to model the relationship between groups and members, leading to a richer understanding of the social context. As for interest-intent, we employ novel structural refinement on the interactive graph to uncover more intricate user behaviors and group interests, realizing better representation learning of interests. Furthermore, we also observe the intent overlapping in real-world scenarios and devise a novel self-supervised learning loss that encourages such alignment for final recommendations. Extensive experiments on three public datasets show the significant improvement of DiRec over the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2308.05013",
    "authors": [
      "Xixi Wu",
      "Yun Xiong",
      "Yao Zhang",
      "Yizhu Jiao",
      "Jiawei Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2308.05022",
    "title": "Feature Modulation Transformer: Cross-Refinement of Global  Representation via High-Frequency Prior for Image Super-Resolution",
    "abstract": "Transformer-based methods have exhibited remarkable potential in single image super-resolution (SISR) by effectively extracting long-range dependencies. However, most of the current research in this area has prioritized the design of transformer blocks to capture global information, while overlooking the importance of incorporating high-frequency priors, which we believe could be beneficial. In our study, we conducted a series of experiments and found that transformer structures are more adept at capturing low-frequency information, but have limited capacity in constructing high-frequency representations when compared to their convolutional counterparts. Our proposed solution, the cross-refinement adaptive feature modulation transformer (CRAFT), integrates the strengths of both convolutional and transformer structures. It comprises three key components: the high-frequency enhancement residual block (HFERB) for extracting high-frequency information, the shift rectangle window attention block (SRWAB) for capturing global information, and the hybrid fusion block (HFB) for refining the global representation. Our experiments on multiple datasets demonstrate that CRAFT outperforms state-of-the-art methods by up to 0.29dB while using fewer parameters. The source code will be made available at: https://github.com/AVC2-UESTC/CRAFT-SR.git. ",
    "url": "https://arxiv.org/abs/2308.05022",
    "authors": [
      "Ao Li",
      "Le Zhang",
      "Yun Liu",
      "Ce Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.05026",
    "title": "An End-to-End Framework of Road User Detection, Tracking, and Prediction  from Monocular Images",
    "abstract": "Perception that involves multi-object detection and tracking, and trajectory prediction are two major tasks of autonomous driving. However, they are currently mostly studied separately, which results in most trajectory prediction modules being developed based on ground truth trajectories without taking into account that trajectories extracted from the detection and tracking modules in real-world scenarios are noisy. These noisy trajectories can have a significant impact on the performance of the trajectory predictor and can lead to serious prediction errors. In this paper, we build an end-to-end framework for detection, tracking, and trajectory prediction called ODTP (Online Detection, Tracking and Prediction). It adopts the state-of-the-art online multi-object tracking model, QD-3DT, for perception and trains the trajectory predictor, DCENet++, directly based on the detection results without purely relying on ground truth trajectories. We evaluate the performance of ODTP on the widely used nuScenes dataset for autonomous driving. Extensive experiments show that ODPT achieves high performance end-to-end trajectory prediction. DCENet++, with the enhanced dynamic maps, predicts more accurate trajectories than its base model. It is also more robust when compared with other generative and deterministic trajectory prediction models trained on noisy detection results. ",
    "url": "https://arxiv.org/abs/2308.05026",
    "authors": [
      "Hao Cheng",
      "Mengmeng liu",
      "Lin Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.05032",
    "title": "Density Crop-guided Semi-supervised Object Detection in Aerial Images",
    "abstract": "One of the important bottlenecks in training modern object detectors is the need for labeled images where bounding box annotations have to be produced for each object present in the image. This bottleneck is further exacerbated in aerial images where the annotators have to label small objects often distributed in clusters on high-resolution images. In recent days, the mean-teacher approach trained with pseudo-labels and weak-strong augmentation consistency is gaining popularity for semi-supervised object detection. However, a direct adaptation of such semi-supervised detectors for aerial images where small clustered objects are often present, might not lead to optimal results. In this paper, we propose a density crop-guided semi-supervised detector that identifies the cluster of small objects during training and also exploits them to improve performance at inference. During training, image crops of clusters identified from labeled and unlabeled images are used to augment the training set, which in turn increases the chance of detecting small objects and creating good pseudo-labels for small objects on the unlabeled images. During inference, the detector is not only able to detect the objects of interest but also regions with a high density of small objects (density crops) so that detections from the input image and detections from image crops are combined, resulting in an overall more accurate object prediction, especially for small objects. Empirical studies on the popular benchmarks of VisDrone and DOTA datasets show the effectiveness of our density crop-guided semi-supervised detector with an average improvement of more than 2\\% over the basic mean-teacher method in COCO style AP. Our code is available at: https://github.com/akhilpm/DroneSSOD. ",
    "url": "https://arxiv.org/abs/2308.05032",
    "authors": [
      "Akhil Meethal",
      "Eric Granger",
      "Marco Pedersoli"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.05034",
    "title": "Kairos: : Practical Intrusion Detection and Investigation using  Whole-system Provenance",
    "abstract": "Provenance graphs are structured audit logs that describe the history of a system's execution. Recent studies have explored a variety of techniques to analyze provenance graphs for automated host intrusion detection, focusing particularly on advanced persistent threats. Sifting through their design documents, we identify four common dimensions that drive the development of provenance-based intrusion detection systems (PIDSes): scope (can PIDSes detect modern attacks that infiltrate across application boundaries?), attack agnosticity (can PIDSes detect novel attacks without a priori knowledge of attack characteristics?), timeliness (can PIDSes efficiently monitor host systems as they run?), and attack reconstruction (can PIDSes distill attack activity from large provenance graphs so that sysadmins can easily understand and quickly respond to system intrusion?). We present KAIROS, the first PIDS that simultaneously satisfies the desiderata in all four dimensions, whereas existing approaches sacrifice at least one and struggle to achieve comparable detection performance. Kairos leverages a novel graph neural network-based encoder-decoder architecture that learns the temporal evolution of a provenance graph's structural changes to quantify the degree of anomalousness for each system event. Then, based on this fine-grained information, Kairos reconstructs attack footprints, generating compact summary graphs that accurately describe malicious activity over a stream of system audit logs. Using state-of-the-art benchmark datasets, we demonstrate that Kairos outperforms previous approaches. ",
    "url": "https://arxiv.org/abs/2308.05034",
    "authors": [
      "Zijun Cheng",
      "Qiujian Lv",
      "Jinyuan Liang",
      "Yan Wang",
      "Degang Sun",
      "Thomas Pasquier",
      "Xueyuan Han"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.05035",
    "title": "Expert load matters: operating networks at high accuracy and low manual  effort",
    "abstract": "In human-AI collaboration systems for critical applications, in order to ensure minimal error, users should set an operating point based on model confidence to determine when the decision should be delegated to human experts. Samples for which model confidence is lower than the operating point would be manually analysed by experts to avoid mistakes. Such systems can become truly useful only if they consider two aspects: models should be confident only for samples for which they are accurate, and the number of samples delegated to experts should be minimized. The latter aspect is especially crucial for applications where available expert time is limited and expensive, such as healthcare. The trade-off between the model accuracy and the number of samples delegated to experts can be represented by a curve that is similar to an ROC curve, which we refer to as confidence operating characteristic (COC) curve. In this paper, we argue that deep neural networks should be trained by taking into account both accuracy and expert load and, to that end, propose a new complementary loss function for classification that maximizes the area under this COC curve. This promotes simultaneously the increase in network accuracy and the reduction in number of samples delegated to humans. We perform experiments on multiple computer vision and medical image datasets for classification. Our results demonstrate that the proposed loss improves classification accuracy and delegates less number of decisions to experts, achieves better out-of-distribution samples detection and on par calibration performance compared to existing loss functions. ",
    "url": "https://arxiv.org/abs/2308.05035",
    "authors": [
      "Sara Sangalli",
      "Ertunc Erdil",
      "Ender Konukoglu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.05040",
    "title": "Neural Field Movement Primitives for Joint Modelling of Scenes and  Motions",
    "abstract": "This paper presents a novel Learning from Demonstration (LfD) method that uses neural fields to learn new skills efficiently and accurately. It achieves this by utilizing a shared embedding to learn both scene and motion representations in a generative way. Our method smoothly maps each expert demonstration to a scene-motion embedding and learns to model them without requiring hand-crafted task parameters or large datasets. It achieves data efficiency by enforcing scene and motion generation to be smooth with respect to changes in the embedding space. At inference time, our method can retrieve scene-motion embeddings using test time optimization, and generate precise motion trajectories for novel scenes. The proposed method is versatile and can employ images, 3D shapes, and any other scene representations that can be modeled using neural fields. Additionally, it can generate both end-effector positions and joint angle-based trajectories. Our method is evaluated on tasks that require accurate motion trajectory generation, where the underlying task parametrization is based on object positions and geometric scene changes. Experimental results demonstrate that the proposed method outperforms the baseline approaches and generalizes to novel scenes. Furthermore, in real-world experiments, we show that our method can successfully model multi-valued trajectories, it is robust to the distractor objects introduced at inference time, and it can generate 6D motions. ",
    "url": "https://arxiv.org/abs/2308.05040",
    "authors": [
      "Ahmet Tekden",
      "Marc Peter Deisenroth",
      "Yasemin Bekiroglu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.05051",
    "title": "PAT: Position-Aware Transformer for Dense Multi-Label Action Detection",
    "abstract": "We present PAT, a transformer-based network that learns complex temporal co-occurrence action dependencies in a video by exploiting multi-scale temporal features. In existing methods, the self-attention mechanism in transformers loses the temporal positional information, which is essential for robust action detection. To address this issue, we (i) embed relative positional encoding in the self-attention mechanism and (ii) exploit multi-scale temporal relationships by designing a novel non hierarchical network, in contrast to the recent transformer-based approaches that use a hierarchical structure. We argue that joining the self-attention mechanism with multiple sub-sampling processes in the hierarchical approaches results in increased loss of positional information. We evaluate the performance of our proposed approach on two challenging dense multi-label benchmark datasets, and show that PAT improves the current state-of-the-art result by 1.1% and 0.6% mAP on the Charades and MultiTHUMOS datasets, respectively, thereby achieving the new state-of-the-art mAP at 26.5% and 44.6%, respectively. We also perform extensive ablation studies to examine the impact of the different components of our proposed network. ",
    "url": "https://arxiv.org/abs/2308.05051",
    "authors": [
      "Faegheh Sardari",
      "Armin Mustafa",
      "Philip J. B. Jackson",
      "Adrian Hilton"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.05052",
    "title": "Designing Cellular Networks for UAV Corridors via Bayesian Optimization",
    "abstract": "As traditional cellular base stations (BSs) are optimized for 2D ground service, providing 3D connectivity to uncrewed aerial vehicles (UAVs) requires re-engineering of the existing infrastructure. In this paper, we propose a new methodology for designing cellular networks that cater for both ground users and UAV corridors based on Bayesian optimization. We present a case study in which we maximize the signal-to-interference-plus-noise ratio (SINR) for both populations of users by optimizing the electrical antenna tilts and the transmit power employed at each BS. Our proposed optimized network significantly boosts the UAV performance, with a 23.4dB gain in mean SINR compared to an all-downtilt, full-power baseline. At the same time, this optimal tradeoff nearly preserves the performance on the ground, even attaining a gain of 1.3dB in mean SINR with respect to said baseline. Thanks to its ability to optimize black-box stochastic functions, the proposed framework is amenable to maximize any desired function of the SINR or even the capacity per area. ",
    "url": "https://arxiv.org/abs/2308.05052",
    "authors": [
      "Mohamed Benzaghta",
      "Giovanni Geraci",
      "David Lopez-Perez",
      "Alvaro Valcarce"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.05059",
    "title": "A Novel Method for improving accuracy in neural network by reinstating  traditional back propagation technique",
    "abstract": "Deep learning has revolutionized industries like computer vision, natural language processing, and speech recognition. However, back propagation, the main method for training deep neural networks, faces challenges like computational overhead and vanishing gradients. In this paper, we propose a novel instant parameter update methodology that eliminates the need for computing gradients at each layer. Our approach accelerates learning, avoids the vanishing gradient problem, and outperforms state-of-the-art methods on benchmark data sets. This research presents a promising direction for efficient and effective deep neural network training. ",
    "url": "https://arxiv.org/abs/2308.05059",
    "authors": [
      "Gokulprasath R"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.05081",
    "title": "Constructing Holistic Spatio-Temporal Scene Graph for Video Semantic  Role Labeling",
    "abstract": "Video Semantic Role Labeling (VidSRL) aims to detect the salient events from given videos, by recognizing the predict-argument event structures and the interrelationships between events. While recent endeavors have put forth methods for VidSRL, they can be mostly subject to two key drawbacks, including the lack of fine-grained spatial scene perception and the insufficiently modeling of video temporality. Towards this end, this work explores a novel holistic spatio-temporal scene graph (namely HostSG) representation based on the existing dynamic scene graph structures, which well model both the fine-grained spatial semantics and temporal dynamics of videos for VidSRL. Built upon the HostSG, we present a nichetargeting VidSRL framework. A scene-event mapping mechanism is first designed to bridge the gap between the underlying scene structure and the high-level event semantic structure, resulting in an overall hierarchical scene-event (termed ICE) graph structure. We further perform iterative structure refinement to optimize the ICE graph, such that the overall structure representation can best coincide with end task demand. Finally, three subtask predictions of VidSRL are jointly decoded, where the end-to-end paradigm effectively avoids error propagation. On the benchmark dataset, our framework boosts significantly over the current best-performing model. Further analyses are shown for a better understanding of the advances of our methods. ",
    "url": "https://arxiv.org/abs/2308.05081",
    "authors": [
      "Yu Zhao",
      "Hao Fei",
      "Yixin Cao",
      "Bobo Li",
      "Meishan Zhang",
      "Jianguo Wei",
      "Min Zhang",
      "Tat-Seng Chua"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.05101",
    "title": "DOST -- Domain Obedient Self-supervised Training for Multi Label  Classification with Noisy Labels",
    "abstract": "The enormous demand for annotated data brought forth by deep learning techniques has been accompanied by the problem of annotation noise. Although this issue has been widely discussed in machine learning literature, it has been relatively unexplored in the context of \"multi-label classification\" (MLC) tasks which feature more complicated kinds of noise. Additionally, when the domain in question has certain logical constraints, noisy annotations often exacerbate their violations, making such a system unacceptable to an expert. This paper studies the effect of label noise on domain rule violation incidents in the MLC task, and incorporates domain rules into our learning algorithm to mitigate the effect of noise. We propose the Domain Obedient Self-supervised Training (DOST) paradigm which not only makes deep learning models more aligned to domain rules, but also improves learning performance in key metrics and minimizes the effect of annotation noise. This novel approach uses domain guidance to detect offending annotations and deter rule-violating predictions in a self-supervised manner, thus making it more \"data efficient\" and domain compliant. Empirical studies, performed over two large scale multi-label classification datasets, demonstrate that our method results in improvement across the board, and often entirely counteracts the effect of noise. ",
    "url": "https://arxiv.org/abs/2308.05101",
    "authors": [
      "Soumadeep Saha",
      "Utpal Garain",
      "Arijit Ukil",
      "Arpan Pal",
      "Sundeep Khandelwal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.04464",
    "title": "Analysis of Insect-Plant Interactions Affected by Mining Operations, A  Graph Mining Approach",
    "abstract": "The decline in ecological connections signifies the potential extinction of species, which can be attributed to disruptions and alterations. The decrease in interconnections among species reflects their susceptibility to changes. For example, certain insects and plants that rely on exclusive interactions with a limited number of species, or even a specific species, face the risk of extinction if they lose these crucial connections. Currently, mining activities pose significant harm to natural ecosystems, resulting in various adverse environmental impacts. In this study, we utilized network science techniques to analyze the ecosystem in a graph-based structure, aiming to conserve the ecosystem affected by mining operations in the northern region of Scotland. The research encompasses identifying the most vital members of the network, establishing criteria for identifying communities within the network, comparing, and evaluating them, using models to predict secondary extinctions that occur when a species is removed from the network, and assessing the extent of network damage. Our study's novelty is utilizing network science approaches to investigate the biological data related to interactions between insects and plants. ",
    "url": "https://arxiv.org/abs/2308.04464",
    "authors": [
      "Ali Bayat",
      "Mohammad Heydari",
      "Amir Albadvi"
    ],
    "subjectives": [
      "Populations and Evolution (q-bio.PE)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2308.04493",
    "title": "Efficient option pricing with unary-based photonic computing chip and  generative adversarial learning",
    "abstract": "In the modern financial industry system, the structure of products has become more and more complex, and the bottleneck constraint of classical computing power has already restricted the development of the financial industry. Here, we present a photonic chip that implements the unary approach to European option pricing, in combination with the quantum amplitude estimation algorithm, to achieve a quadratic speedup compared to classical Monte Carlo methods. The circuit consists of three modules: a module loading the distribution of asset prices, a module computing the expected payoff, and a module performing the quantum amplitude estimation algorithm to introduce speed-ups. In the distribution module, a generative adversarial network is embedded for efficient learning and loading of asset distributions, which precisely capture the market trends. This work is a step forward in the development of specialized photonic processors for applications in finance, with the potential to improve the efficiency and quality of financial services. ",
    "url": "https://arxiv.org/abs/2308.04493",
    "authors": [
      "Hui Zhang",
      "Lingxiao Wan",
      "Sergi Ramos-Calderer",
      "Yuancheng Zhan",
      "Wai-Keong Mok",
      "Hong Cai",
      "Feng Gao",
      "Xianshu Luo",
      "Guo-Qiang Lo",
      "Leong Chuan Kwek",
      "José Ignacio Latorre",
      "Ai Qun Liu"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Computational Finance (q-fin.CP)"
    ]
  },
  {
    "id": "arXiv:2308.04551",
    "title": "Improving Medical Image Classification in Noisy Labels Using Only  Self-supervised Pretraining",
    "abstract": "Noisy labels hurt deep learning-based supervised image classification performance as the models may overfit the noise and learn corrupted feature extractors. For natural image classification training with noisy labeled data, model initialization with contrastive self-supervised pretrained weights has shown to reduce feature corruption and improve classification performance. However, no works have explored: i) how other self-supervised approaches, such as pretext task-based pretraining, impact the learning with noisy label, and ii) any self-supervised pretraining methods alone for medical images in noisy label settings. Medical images often feature smaller datasets and subtle inter class variations, requiring human expertise to ensure correct classification. Thus, it is not clear if the methods improving learning with noisy labels in natural image datasets such as CIFAR would also help with medical images. In this work, we explore contrastive and pretext task-based self-supervised pretraining to initialize the weights of a deep learning classification model for two medical datasets with self-induced noisy labels -- NCT-CRC-HE-100K tissue histological images and COVID-QU-Ex chest X-ray images. Our results show that models initialized with pretrained weights obtained from self-supervised learning can effectively learn better features and improve robustness against noisy labels. ",
    "url": "https://arxiv.org/abs/2308.04551",
    "authors": [
      "Bidur Khanal",
      "Binod Bhattarai",
      "Bishesh Khanal",
      "Cristian A. Linte"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04739",
    "title": "Optimizing a Transformer-based network for a deep learning seismic  processing workflow",
    "abstract": "StorSeismic is a recently introduced model based on the Transformer to adapt to various seismic processing tasks through its pretraining and fine-tuning training strategy. In the original implementation, StorSeismic utilized a sinusoidal positional encoding and a conventional self-attention mechanism, both borrowed from the natural language processing (NLP) applications. For seismic processing they admitted good results, but also hinted to limitations in efficiency and expressiveness. We propose modifications to these two key components, by utilizing relative positional encoding and low-rank attention matrices as replacements to the vanilla ones. The proposed changes are tested on processing tasks applied to a realistic Marmousi and offshore field data as a sequential strategy, starting from denoising, direct arrival removal, multiple attenuation, and finally root-mean-squared velocity ($V_{RMS}$) prediction for normal moveout (NMO) correction. We observe faster pretraining and competitive results on the fine-tuning tasks and, additionally, fewer parameters to train compared to the vanilla model. ",
    "url": "https://arxiv.org/abs/2308.04739",
    "authors": [
      "Randy Harsuko",
      "Tariq Alkhalifah"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04821",
    "title": "HyperCoil-Recon: A Hypernetwork-based Adaptive Coil Configuration Task  Switching Network for MRI Reconstruction",
    "abstract": "Parallel imaging, a fast MRI technique, involves dynamic adjustments based on the configuration i.e. number, positioning, and sensitivity of the coils with respect to the anatomy under study. Conventional deep learning-based image reconstruction models have to be trained or fine-tuned for each configuration, posing a barrier to clinical translation, given the lack of computational resources and machine learning expertise for clinicians to train models at deployment. Joint training on diverse datasets learns a single weight set that might underfit to deviated configurations. We propose, HyperCoil-Recon, a hypernetwork-based coil configuration task-switching network for multi-coil MRI reconstruction that encodes varying configurations of the numbers of coils in a multi-tasking perspective, posing each configuration as a task. The hypernetworks infer and embed task-specific weights into the reconstruction network, 1) effectively utilizing the contextual knowledge of common and varying image features among the various fields-of-view of the coils, and 2) enabling generality to unseen configurations at test time. Experiments reveal that our approach 1) adapts on the fly to various unseen configurations up to 32 coils when trained on lower numbers (i.e. 7 to 11) of randomly varying coils, and to 120 deviated unseen configurations when trained on 18 configurations in a single model, 2) matches the performance of coil configuration-specific models, and 3) outperforms configuration-invariant models with improvement margins of around 1 dB / 0.03 and 0.3 dB / 0.02 in PSNR / SSIM for knee and brain data. Our code is available at https://github.com/sriprabhar/HyperCoil-Recon ",
    "url": "https://arxiv.org/abs/2308.04821",
    "authors": [
      "Sriprabha Ramanarayanan",
      "Mohammad Al Fahim",
      "Rahul G.S.",
      "Amrit Kumar Jethi",
      "Keerthi Ram",
      "Mohanasankar Sivaprakasam"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04883",
    "title": "Deep Generative Networks for Heterogeneous Augmentation of Cranial  Defects",
    "abstract": "The design of personalized cranial implants is a challenging and tremendous task that has become a hot topic in terms of process automation with the use of deep learning techniques. The main challenge is associated with the high diversity of possible cranial defects. The lack of appropriate data sources negatively influences the data-driven nature of deep learning algorithms. Hence, one of the possible solutions to overcome this problem is to rely on synthetic data. In this work, we propose three volumetric variations of deep generative models to augment the dataset by generating synthetic skulls, i.e. Wasserstein Generative Adversarial Network with Gradient Penalty (WGAN-GP), WGAN-GP hybrid with Variational Autoencoder pretraining (VAE/WGAN-GP) and Introspective Variational Autoencoder (IntroVAE). We show that it is possible to generate dozens of thousands of defective skulls with compatible defects that achieve a trade-off between defect heterogeneity and the realistic shape of the skull. We evaluate obtained synthetic data quantitatively by defect segmentation with the use of V-Net and qualitatively by their latent space exploration. We show that the synthetically generated skulls highly improve the segmentation process compared to using only the original unaugmented data. The generated skulls may improve the automatic design of personalized cranial implants for real medical cases. ",
    "url": "https://arxiv.org/abs/2308.04883",
    "authors": [
      "Kamil Kwarciak",
      "Marek Wodzinski"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.04923",
    "title": "Deep Learning-Based Prediction of Fractional Flow Reserve along the  Coronary Artery",
    "abstract": "Functionally significant coronary artery disease (CAD) is caused by plaque buildup in the coronary arteries, potentially leading to narrowing of the arterial lumen, i.e. coronary stenosis, that significantly obstructs blood flow to the myocardium. The current reference for establishing the presence of a functionally significant stenosis is invasive fractional flow reserve (FFR) measurement. To avoid invasive measurements, non-invasive prediction of FFR from coronary CT angiography (CCTA) has emerged. For this, machine learning approaches, characterized by fast inference, are increasingly developed. However, these methods predict a single FFR value per artery i.e. they don't provide information about the stenosis location or treatment strategy. We propose a deep learning-based method to predict the FFR along the artery from CCTA scans. This study includes CCTA images of 110 patients who underwent invasive FFR pullback measurement in 112 arteries. First, a multi planar reconstruction (MPR) of the artery is fed to a variational autoencoder to characterize the artery, i.e. through the lumen area and unsupervised artery encodings. Thereafter, a convolutional neural network (CNN) predicts the FFR along the artery. The CNN is supervised by multiple loss functions, notably a loss function inspired by the Earth Mover's Distance (EMD) to predict the correct location of FFR drops and a histogram-based loss to explicitly supervise the slope of the FFR curve. To train and evaluate our model, eight-fold cross-validation was performed. The resulting FFR curves show good agreement with the reference allowing the distinction between diffuse and focal CAD distributions in most cases. Quantitative evaluation yielded a mean absolute difference in the area under the FFR pullback curve (AUPC) of 1.7. The method may pave the way towards fast, accurate, automatic prediction of FFR along the artery from CCTA. ",
    "url": "https://arxiv.org/abs/2308.04923",
    "authors": [
      "Nils Hampe",
      "Sanne G. M. van Velzen",
      "Jean-Paul Aben",
      "Carlos Collet",
      "Ivana Išgum"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2308.05068",
    "title": "Geometric Learning-Based Transformer Network for Estimation of  Segmentation Errors",
    "abstract": "Many segmentation networks have been proposed for 3D volumetric segmentation of tumors and organs at risk. Hospitals and clinical institutions seek to accelerate and minimize the efforts of specialists in image segmentation. Still, in case of errors generated by these networks, clinicians would have to manually edit the generated segmentation maps. Given a 3D volume and its putative segmentation map, we propose an approach to identify and measure erroneous regions in the segmentation map. Our method can estimate error at any point or node in a 3D mesh generated from a possibly erroneous volumetric segmentation map, serving as a Quality Assurance tool. We propose a graph neural network-based transformer based on the Nodeformer architecture to measure and classify the segmentation errors at any point. We have evaluated our network on a high-resolution micro-CT dataset of the human inner-ear bony labyrinth structure by simulating erroneous 3D segmentation maps. Our network incorporates a convolutional encoder to compute node-centric features from the input micro-CT data, the Nodeformer to learn the latent graph embeddings, and a Multi-Layer Perceptron (MLP) to compute and classify the node-wise errors. Our network achieves a mean absolute error of ~0.042 over other Graph Neural Networks (GNN) and an accuracy of 79.53% over other GNNs in estimating and classifying the node-wise errors, respectively. We also put forth vertex-normal prediction as a custom pretext task for pre-training the CNN encoder to improve the network's overall performance. Qualitative analysis shows the efficiency of our network in correctly classifying errors and reducing misclassifications. ",
    "url": "https://arxiv.org/abs/2308.05068",
    "authors": [
      "Sneha Sree C",
      "Mohammad Al Fahim",
      "Keerthi Ram",
      "Mohanasankar Sivaprakasam"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.05103",
    "title": "Improved Multi-Shot Diffusion-Weighted MRI with Zero-Shot  Self-Supervised Learning Reconstruction",
    "abstract": "Diffusion MRI is commonly performed using echo-planar imaging (EPI) due to its rapid acquisition time. However, the resolution of diffusion-weighted images is often limited by magnetic field inhomogeneity-related artifacts and blurring induced by T2- and T2*-relaxation effects. To address these limitations, multi-shot EPI (msEPI) combined with parallel imaging techniques is frequently employed. Nevertheless, reconstructing msEPI can be challenging due to phase variation between multiple shots. In this study, we introduce a novel msEPI reconstruction approach called zero-MIRID (zero-shot self-supervised learning of Multi-shot Image Reconstruction for Improved Diffusion MRI). This method jointly reconstructs msEPI data by incorporating deep learning-based image regularization techniques. The network incorporates CNN denoisers in both k- and image-spaces, while leveraging virtual coils to enhance image reconstruction conditioning. By employing a self-supervised learning technique and dividing sampled data into three groups, the proposed approach achieves superior results compared to the state-of-the-art parallel imaging method, as demonstrated in an in-vivo experiment. ",
    "url": "https://arxiv.org/abs/2308.05103",
    "authors": [
      "Jaejin Cho",
      "Yohan Jun",
      "Xiaoqing Wang",
      "Caique Kobayashi",
      "Berkin Bilgic"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2002.03729",
    "title": "A lightweight target detection algorithm based on Mobilenet Convolution",
    "abstract": " Title: A lightweight target detection algorithm based on Mobilenet Convolution ",
    "url": "https://arxiv.org/abs/2002.03729",
    "authors": [
      "Nina Kuchuk",
      "Shengquan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2003.08513",
    "title": "Virtual Control Contraction Metrics: Convex Nonlinear Feedback Design  via Behavioral Embedding",
    "abstract": " Title: Virtual Control Contraction Metrics: Convex Nonlinear Feedback Design  via Behavioral Embedding ",
    "url": "https://arxiv.org/abs/2003.08513",
    "authors": [
      "Ruigang Wang",
      "Roland Tóth",
      "Patrick J. W. Koelwijn",
      "Ian R. Manchester"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2104.05477",
    "title": "Stochastic Stability of Discrete-time Phase-coupled Oscillators over  Uncertain and Random Networks",
    "abstract": " Title: Stochastic Stability of Discrete-time Phase-coupled Oscillators over  Uncertain and Random Networks ",
    "url": "https://arxiv.org/abs/2104.05477",
    "authors": [
      "Matin Jafarian",
      "Mohammad H. Mamduhi",
      "Karl H. Johansson"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2108.13672",
    "title": "SANSformers: Self-Supervised Forecasting in Electronic Health Records  with Attention-Free Models",
    "abstract": " Comments: 25 pages, 8 figures, 5 tables, Submitted to a journal ",
    "url": "https://arxiv.org/abs/2108.13672",
    "authors": [
      "Yogesh Kumar",
      "Alexander Ilin",
      "Henri Salo",
      "Sangita Kulathinal",
      "Maarit K. Leinonen",
      "Pekka Marttinen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.00407",
    "title": "Inverse problem for parameters identification in a modified SIRD  epidemic model using ensemble neural networks",
    "abstract": " Comments: This is the final version of this paper ",
    "url": "https://arxiv.org/abs/2203.00407",
    "authors": [
      "Marian Petrica",
      "Ionel Popescu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Populations and Evolution (q-bio.PE)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2203.05119",
    "title": "MetAug: Contrastive Learning via Meta Feature Augmentation",
    "abstract": " Comments: Accepted by ICML 2022 ",
    "url": "https://arxiv.org/abs/2203.05119",
    "authors": [
      "Jiangmeng Li",
      "Wenwen Qiang",
      "Changwen Zheng",
      "Bing Su",
      "Hui Xiong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.05885",
    "title": "A Hierarchical Block Distance Model for Ultra Low-Dimensional Graph  Representations",
    "abstract": " Comments: Preprint Version ",
    "url": "https://arxiv.org/abs/2204.05885",
    "authors": [
      "Nikolaos Nakis",
      "Abdulkadir Çelikkanat",
      "Sune Lehmann Jørgensen",
      "Morten Mørup"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.11378",
    "title": "Do Perceptually Aligned Gradients Imply Adversarial Robustness?",
    "abstract": " Title: Do Perceptually Aligned Gradients Imply Adversarial Robustness? ",
    "url": "https://arxiv.org/abs/2207.11378",
    "authors": [
      "Roy Ganz",
      "Bahjat Kawar",
      "Michael Elad"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.00128",
    "title": "Archangel: A Hybrid UAV-based Human Detection Benchmark with Position  and Pose Metadata",
    "abstract": " Comments: IEEE Access ",
    "url": "https://arxiv.org/abs/2209.00128",
    "authors": [
      "Yi-Ting Shen",
      "Yaesop Lee",
      "Heesung Kwon",
      "Damon M. Conover",
      "Shuvra S. Bhattacharyya",
      "Nikolas Vale",
      "Joshua D. Gray",
      "G. Jeremy Leong",
      "Kenneth Evensen",
      "Frank Skirlo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.05996",
    "title": "M$^2$-3DLaneNet: Exploring Multi-Modal 3D Lane Detection",
    "abstract": " Comments: update ",
    "url": "https://arxiv.org/abs/2209.05996",
    "authors": [
      "Yueru Luo",
      "Xu Yan",
      "Chaoda Zheng",
      "Chao Zheng",
      "Shuqi Mei",
      "Tang Kun",
      "Shuguang Cui",
      "Zhen Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07970",
    "title": "Causal Fourier Analysis on Directed Acyclic Graphs and Posets",
    "abstract": " Comments: 13 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2209.07970",
    "authors": [
      "Bastian Seifert",
      "Chris Wendler",
      "Markus Püschel"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Discrete Mathematics (cs.DM)",
      "Machine Learning (cs.LG)",
      "Combinatorics (math.CO)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2210.10780",
    "title": "An out-of-distribution discriminator based on Bayesian neural network  epistemic uncertainty",
    "abstract": " Comments: 26 pages, 25 figures ",
    "url": "https://arxiv.org/abs/2210.10780",
    "authors": [
      "Ethan Ancell",
      "Christopher Bennett",
      "Bert Debusschere",
      "Sapan Agarwal",
      "Park Hays",
      "T. Patrick Xiao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.12126",
    "title": "One-Shot Neural Fields for 3D Object Understanding",
    "abstract": " Comments: IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshop (CVPRW) on XRNeRF: Advances in NeRF for the Metaverse 2023 ",
    "url": "https://arxiv.org/abs/2210.12126",
    "authors": [
      "Valts Blukis",
      "Taeyeop Lee",
      "Jonathan Tremblay",
      "Bowen Wen",
      "In So Kweon",
      "Kuk-Jin Yoon",
      "Dieter Fox",
      "Stan Birchfield"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.06108",
    "title": "RaLiBEV: Radar and LiDAR BEV Fusion Learning for Anchor Box Free Object  Detection System",
    "abstract": " Comments: 12 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2211.06108",
    "authors": [
      "Yanlong Yang",
      "Jianan Liu",
      "Tao Huang",
      "Qing-Long Han",
      "Gang Ma",
      "Bing Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.14603",
    "title": "Analysis of Molecule Harvesting by Heterogeneous Receptors on MC  Transmitters",
    "abstract": " Comments: 7 pages, 4 figures, submitted to IEEE conferences for potential publication ",
    "url": "https://arxiv.org/abs/2211.14603",
    "authors": [
      "Xinyu Huang",
      "Yu Huang",
      "Miaowen Wen",
      "Nan Yang",
      "Robert Schober"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2212.01331",
    "title": "Surface Normal Clustering for Implicit Representation of Manhattan  Scenes",
    "abstract": " Comments: Paper accepted to ICCV23 ",
    "url": "https://arxiv.org/abs/2212.01331",
    "authors": [
      "Nikola Popovic",
      "Danda Pani Paudel",
      "Luc Van Gool"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.05116",
    "title": "Leveraging Contextual Data Augmentation for Generalizable Melanoma  Detection",
    "abstract": " Comments: 6 pages, 3 figures, 4 tables ",
    "url": "https://arxiv.org/abs/2212.05116",
    "authors": [
      "Nick DiSanto",
      "Gavin Harding",
      "Ethan Martinez",
      "Benjamin Sanders"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06436",
    "title": "Geometric Constraints Enable Self-Supervised Sinogram Inpainting in  Sparse-View Tomography",
    "abstract": " Title: Geometric Constraints Enable Self-Supervised Sinogram Inpainting in  Sparse-View Tomography ",
    "url": "https://arxiv.org/abs/2302.06436",
    "authors": [
      "Fabian Wagner",
      "Mareike Thies",
      "Noah Maul",
      "Laura Pfaff",
      "Oliver Aust",
      "Sabrina Pechmann",
      "Christopher Syben",
      "Andreas Maier"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.14102",
    "title": "Connectivity Optimized Nested Graph Networks for Crystal Structures",
    "abstract": " Comments: 19 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2302.14102",
    "authors": [
      "Robin Ruff",
      "Patrick Reiser",
      "Jan Stühmer",
      "Pascal Friederich"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2303.00595",
    "title": "A Universal Question-Answering Platform for Knowledge Graphs",
    "abstract": " Comments: The paper is accepted to SIGMOD 2023 ",
    "url": "https://arxiv.org/abs/2303.00595",
    "authors": [
      "Reham Omar",
      "Ishika Dhall",
      "Panos Kalnis",
      "Essam Mansour"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2303.05689",
    "title": "Inducing Neural Collapse to a Fixed Hierarchy-Aware Frame for Reducing  Mistake Severity",
    "abstract": " Comments: ICCV 2023 ",
    "url": "https://arxiv.org/abs/2303.05689",
    "authors": [
      "Tong Liang",
      "Jim Davis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.07122",
    "title": "Quantifying Causes of Arctic Amplification via Deep Learning based  Time-series Causal Inference",
    "abstract": " Comments: In review at IEEE ICMLA 2023 ",
    "url": "https://arxiv.org/abs/2303.07122",
    "authors": [
      "Sahara Ali",
      "Omar Faruque",
      "Yiyi Huang",
      "Md. Osman Gani",
      "Aneesh Subramanian",
      "Nicole-Jienne Shchlegel",
      "Jianwu Wang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2303.14880",
    "title": "Toward Human-Like Social Robot Navigation: A Large-Scale, Multi-Modal,  Social Human Navigation Dataset",
    "abstract": " Comments: Accepted by 2023 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2023) ",
    "url": "https://arxiv.org/abs/2303.14880",
    "authors": [
      "Duc M. Nguyen",
      "Mohammad Nazeri",
      "Amirreza Payandeh",
      "Aniket Datar",
      "Xuesu Xiao"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.17805",
    "title": "On the Effect of Initialization: The Scaling Path of 2-Layer Neural  Networks",
    "abstract": " Title: On the Effect of Initialization: The Scaling Path of 2-Layer Neural  Networks ",
    "url": "https://arxiv.org/abs/2303.17805",
    "authors": [
      "Sebastian Neumayer",
      "Lénaïc Chizat",
      "Michael Unser"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.00409",
    "title": "DiverseVul: A New Vulnerable Source Code Dataset for Deep Learning Based  Vulnerability Detection",
    "abstract": " Comments: Published at RAID 2023 ",
    "url": "https://arxiv.org/abs/2304.00409",
    "authors": [
      "Yizheng Chen",
      "Zhoujie Ding",
      "Lamya Alowain",
      "Xinyun Chen",
      "David Wagner"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2304.02055",
    "title": "Risk-based Security Measure Allocation Against Injection Attacks on  Actuators",
    "abstract": " Comments: Accepted to IEEE Open Journal of Control Systems (OJ-CSYS) ",
    "url": "https://arxiv.org/abs/2304.02055",
    "authors": [
      "Sribalaji C. Anand",
      "André M. H. Teixeira"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.04963",
    "title": "PlantDet: A benchmark for Plant Detection in the Three-Rivers-Source  Region",
    "abstract": " Comments: Accepted by ICANN 2023 ",
    "url": "https://arxiv.org/abs/2304.04963",
    "authors": [
      "Huanhuan Li",
      "Xuechao Zou",
      "Yu-an Zhang",
      "Jiangcai Zhaba",
      "Guomei Li",
      "Lamao Yongga"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.07989",
    "title": "IMCDCF: An Incremental Malware Detection Approach Using Hidden Markov  Models",
    "abstract": " Comments: Malware Technical Exchange Meeting 2021 (MTEM'21) ",
    "url": "https://arxiv.org/abs/2304.07989",
    "authors": [
      "Ran Liu",
      "Charles Nicholas"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.08975",
    "title": "Neural Architecture Search for Visual Anomaly Segmentation",
    "abstract": " Comments: Main track paper for the International Conference on Automated Machine Learning (AutoML Conference), published in Proceedings of Machine Learning Research (PMLR), 2023 ",
    "url": "https://arxiv.org/abs/2304.08975",
    "authors": [
      "Tommie Kerssies",
      "Joaquin Vanschoren"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.10140",
    "title": "FTMRate: Collision-Immune Distance-based Data Rate Selection for IEEE  802.11 Networks",
    "abstract": " Comments: 11 pages, 8 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2304.10140",
    "authors": [
      "Wojciech Ciezobka",
      "Maksymilian Wojnar",
      "Katarzyna Kosek-Szott",
      "Szymon Szott",
      "Krzysztof Rusek"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2305.05738",
    "title": "DOCTOR: A Multi-Disease Detection Continual Learning Framework Based on  Wearable Medical Sensors",
    "abstract": " Comments: 29 pages, 7 figures. This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2305.05738",
    "authors": [
      "Chia-Hao Li",
      "Niraj K. Jha"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Human-Computer Interaction (cs.HC)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.09287",
    "title": "Adversarial Word Dilution as Text Data Augmentation in Low-Resource  Regime",
    "abstract": " Comments: Preprint, Accepted by AAAI 2023 ",
    "url": "https://arxiv.org/abs/2305.09287",
    "authors": [
      "Junfan Chen",
      "Richong Zhang",
      "Zheyan Luo",
      "Chunming Hu",
      "Yongyi Mao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.01951",
    "title": "GAD-NR: Graph Anomaly Detection via Neighborhood Reconstruction",
    "abstract": " Comments: Under Review ",
    "url": "https://arxiv.org/abs/2306.01951",
    "authors": [
      "Amit Roy",
      "Juan Shu",
      "Jia Li",
      "Carl Yang",
      "Olivier Elshocht",
      "Jeroen Smeets",
      "Pan Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.03759",
    "title": "A Survey on Graph Neural Networks for Time Series: Forecasting,  Classification, Imputation, and Anomaly Detection",
    "abstract": " Comments: Ongoing work; 27 pages, 6 figures, 5 tables; Github page: this https URL ",
    "url": "https://arxiv.org/abs/2307.03759",
    "authors": [
      "Ming Jin",
      "Huan Yee Koh",
      "Qingsong Wen",
      "Daniele Zambon",
      "Cesare Alippi",
      "Geoffrey I. Webb",
      "Irwin King",
      "Shirui Pan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.06775",
    "title": "A Novel Site-Agnostic Multimodal Deep Learning Model to Identify  Pro-Eating Disorder Content on Social Media",
    "abstract": " Title: A Novel Site-Agnostic Multimodal Deep Learning Model to Identify  Pro-Eating Disorder Content on Social Media ",
    "url": "https://arxiv.org/abs/2307.06775",
    "authors": [
      "Jonathan Feldman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2307.08131",
    "title": "INFLECT-DGNN: Influencer Prediction with Dynamic Graph Neural Networks",
    "abstract": " Comments: 26 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2307.08131",
    "authors": [
      "Elena Tiukhova",
      "Emiliano Penaloza",
      "María Óskarsdóttir",
      "Bart Baesens",
      "Monique Snoeck",
      "Cristián Bravo"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08209",
    "title": "Ada3D : Exploiting the Spatial Redundancy with Adaptive Inference for  Efficient 3D Object Detection",
    "abstract": " Comments: Accepted at ICCV2023 ",
    "url": "https://arxiv.org/abs/2307.08209",
    "authors": [
      "Tianchen Zhao",
      "Xuefei Ning",
      "Ke Hong",
      "Zhongyuan Qiu",
      "Pu Lu",
      "Yali Zhao",
      "Linfeng Zhang",
      "Lipu Zhou",
      "Guohao Dai",
      "Huazhong Yang",
      "Yu Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.12082",
    "title": "A Quantitative Analysis of Open Source Software Code Quality: Insights  from Metric Distributions",
    "abstract": " Title: A Quantitative Analysis of Open Source Software Code Quality: Insights  from Metric Distributions ",
    "url": "https://arxiv.org/abs/2307.12082",
    "authors": [
      "Siyuan Jin",
      "Mianmian Zhang",
      "Yekai Guo",
      "Yuejiang He",
      "Ziyuan Li",
      "Bichao Chen",
      "Bing Zhu",
      "Yong Xia"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2307.12267",
    "title": "Towards Automatic Boundary Detection for Human-AI Collaborative Hybrid  Essay in Education",
    "abstract": " Comments: 9 pages including references, 2 figures ",
    "url": "https://arxiv.org/abs/2307.12267",
    "authors": [
      "Zijie Zeng",
      "Lele Sha",
      "Yuheng Li",
      "Kaixun Yang",
      "Dragan Gašević",
      "Guanliang Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.12306",
    "title": "Tackling the Curse of Dimensionality with Physics-Informed Neural  Networks",
    "abstract": " Comments: 37 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2307.12306",
    "authors": [
      "Zheyuan Hu",
      "Khemraj Shukla",
      "George Em Karniadakis",
      "Kenji Kawaguchi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Dynamical Systems (math.DS)",
      "Numerical Analysis (math.NA)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.12449",
    "title": "WEPRO: Weight Prediction for Efficient Optimization of Hybrid  Quantum-Classical Algorithms",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2307.12449",
    "authors": [
      "Satwik Kundu",
      "Debarshi Kundu",
      "Swaroop Ghosh"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.00247",
    "title": "Unleashing the Power of Self-Supervised Image Denoising: A Comprehensive  Review",
    "abstract": " Comments: 23 pages ",
    "url": "https://arxiv.org/abs/2308.00247",
    "authors": [
      "Dan Zhang",
      "Fangfang Zhou",
      "Yuanzhou Wei",
      "Xiao Yang",
      "Yuan Gu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.01011",
    "title": "Enhancing Representation Learning for Periodic Time Series with Floss: A  Frequency Domain Regularization Approach",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2308.01011",
    "authors": [
      "Chunwei Yang",
      "Xiaoxu Chen",
      "Lijun Sun",
      "Hongyu Yang",
      "Yuankai Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.01097",
    "title": "Spatio-Temporal Branching for Motion Prediction using Motion Increments",
    "abstract": " Title: Spatio-Temporal Branching for Motion Prediction using Motion Increments ",
    "url": "https://arxiv.org/abs/2308.01097",
    "authors": [
      "Jiexin Wang",
      "Yujie Zhou",
      "Wenwen Qiang",
      "Ying Ba",
      "Bing Su",
      "Ji-Rong Wen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.01621",
    "title": "A Novel Convolutional Neural Network Architecture with a Continuous  Symmetry",
    "abstract": " Comments: Accepted by the 3rd CAAI International Conference on Artificial Intelligence (CICAI), 2023 ",
    "url": "https://arxiv.org/abs/2308.01621",
    "authors": [
      "Yao Liu",
      "Hang Shao",
      "Bing Bai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2308.02182",
    "title": "AutoML4ETC: Automated Neural Architecture Search for Real-World  Encrypted Traffic Classification",
    "abstract": " Comments: A slightly different version is under review for possible publication in IEEE TNSM journal ",
    "url": "https://arxiv.org/abs/2308.02182",
    "authors": [
      "Navid Malekghaini",
      "Elham Akbari",
      "Mohammad A. Salahuddin",
      "Noura Limam",
      "Raouf Boutaba",
      "Bertrand Mathieu",
      "Stephanie Moteau",
      "Stephane Tuffin"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.02914",
    "title": "Anomaly Detection in Global Financial Markets with Graph Neural Networks  and Nonextensive Entropy",
    "abstract": " Title: Anomaly Detection in Global Financial Markets with Graph Neural Networks  and Nonextensive Entropy ",
    "url": "https://arxiv.org/abs/2308.02914",
    "authors": [
      "Kleyton da Costa"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "General Finance (q-fin.GN)"
    ]
  },
  {
    "id": "arXiv:2308.03210",
    "title": "Time-Parameterized Convolutional Neural Networks for Irregularly Sampled  Time Series",
    "abstract": " Title: Time-Parameterized Convolutional Neural Networks for Irregularly Sampled  Time Series ",
    "url": "https://arxiv.org/abs/2308.03210",
    "authors": [
      "Chrysoula Kosma",
      "Giannis Nikolentzos",
      "Michalis Vazirgiannis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.03443",
    "title": "Doubly Robust Estimator for Off-Policy Evaluation with Large Action  Spaces",
    "abstract": " Comments: 6 pages, 1 figure ",
    "url": "https://arxiv.org/abs/2308.03443",
    "authors": [
      "Tatsuhiro Shimizu",
      "Laura Forastiere"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04123",
    "title": "Twinning Commercial Radio Waveforms in the Colosseum Wireless Network  Emulator",
    "abstract": " Comments: 8 pages, 13 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2308.04123",
    "authors": [
      "Davide Villa",
      "Daniel Uvaydov",
      "Leonardo Bonati",
      "Pedram Johari",
      "Josep Miquel Jornet",
      "Tommaso Melodia"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2308.04170",
    "title": "DroidDissector: A Static and Dynamic Analysis Tool for Android Malware  Detection",
    "abstract": " Title: DroidDissector: A Static and Dynamic Analysis Tool for Android Malware  Detection ",
    "url": "https://arxiv.org/abs/2308.04170",
    "authors": [
      "Ali Muzaffar",
      "Hani Ragab Hassen",
      "Hind Zantout",
      "Michael A Lones"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.04365",
    "title": "SLEM: Machine Learning for Path Modeling and Causal Inference with Super  Learner Equation Modeling",
    "abstract": " Title: SLEM: Machine Learning for Path Modeling and Causal Inference with Super  Learner Equation Modeling ",
    "url": "https://arxiv.org/abs/2308.04365",
    "authors": [
      "Matthew J. Vowels"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2308.04396",
    "title": "Event Abstraction for Enterprise Collaboration Systems to Support Social  Process Mining",
    "abstract": " Comments: 8 pages, 1 figure, 3 tables ",
    "url": "https://arxiv.org/abs/2308.04396",
    "authors": [
      "Jonas Blatt",
      "Patrick Delfmann",
      "Petra Schubert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  }
]