[
  {
    "id": "arXiv:2209.07534",
    "title": "Improving Robust Fairness via Balance Adversarial Training",
    "abstract": "Adversarial training (AT) methods are effective against adversarial attacks, yet they introduce severe disparity of accuracy and robustness between different classes, known as the robust fairness problem. Previously proposed Fair Robust Learning (FRL) adaptively reweights different classes to improve fairness. However, the performance of the better-performed classes decreases, leading to a strong performance drop. In this paper, we observed two unfair phenomena during adversarial training: different difficulties in generating adversarial examples from each class (source-class fairness) and disparate target class tendencies when generating adversarial examples (target-class fairness). From the observations, we propose Balance Adversarial Training (BAT) to address the robust fairness problem. Regarding source-class fairness, we adjust the attack strength and difficulties of each class to generate samples near the decision boundary for easier and fairer model learning; considering target-class fairness, by introducing a uniform distribution constraint, we encourage the adversarial example generation process for each class with a fair tendency. Extensive experiments conducted on multiple datasets (CIFAR-10, CIFAR-100, and ImageNette) demonstrate that our method can significantly outperform other baselines in mitigating the robust fairness problem (+5-10\\% on the worst class accuracy) ",
    "url": "https://arxiv.org/abs/2209.07534",
    "authors": [
      "Chunyu Sun",
      "Chenye Xu",
      "Chengyuan Yao",
      "Siyuan Liang",
      "Yichao Wu",
      "Ding Liang",
      "XiangLong Liu",
      "Aishan Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.07577",
    "title": "Experimental verification of the quantum nature of a neural network",
    "abstract": "In my previous article I mentioned for the first time that a classical neural network may have quantum properties as its own structure may be entangled. The question one may ask now is whether such a quantum property can be used to entangle other systems? The answer should be yes, as shown in what follows. ",
    "url": "https://arxiv.org/abs/2209.07577",
    "authors": [
      "Andrei T. Patrascu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2209.07592",
    "title": "Explicit Tradeoffs between Adversarial and Natural Distributional  Robustness",
    "abstract": "Several existing works study either adversarial or natural distributional robustness of deep neural networks separately. In practice, however, models need to enjoy both types of robustness to ensure reliability. In this work, we bridge this gap and show that in fact, explicit tradeoffs exist between adversarial and natural distributional robustness. We first consider a simple linear regression setting on Gaussian data with disjoint sets of core and spurious features. In this setting, through theoretical and empirical analysis, we show that (i) adversarial training with $\\ell_1$ and $\\ell_2$ norms increases the model reliance on spurious features; (ii) For $\\ell_\\infty$ adversarial training, spurious reliance only occurs when the scale of the spurious features is larger than that of the core features; (iii) adversarial training can have an unintended consequence in reducing distributional robustness, specifically when spurious correlations are changed in the new test domain. Next, we present extensive empirical evidence, using a test suite of twenty adversarially trained models evaluated on five benchmark datasets (ObjectNet, RIVAL10, Salient ImageNet-1M, ImageNet-9, Waterbirds), that adversarially trained classifiers rely on backgrounds more than their standardly trained counterparts, validating our theoretical results. We also show that spurious correlations in training data (when preserved in the test domain) can improve adversarial robustness, revealing that previous claims that adversarial vulnerability is rooted in spurious correlations are incomplete. ",
    "url": "https://arxiv.org/abs/2209.07592",
    "authors": [
      "Mazda Moayeri",
      "Kiarash Banihashem",
      "Soheil Feizi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07600",
    "title": "STPOTR: Simultaneous Human Trajectory and Pose Prediction Using a  Non-Autoregressive Transformer for Robot Following Ahead",
    "abstract": "In this paper, we develop a neural network model to predict future human motion from an observed human motion history. We propose a non-autoregressive transformer architecture to leverage its parallel nature for easier training and fast, accurate predictions at test time. The proposed architecture divides human motion prediction into two parts: 1) the human trajectory, which is the hip joint 3D position over time and 2) the human pose which is the all other joints 3D positions over time with respect to a fixed hip joint. We propose to make the two predictions simultaneously, as the shared representation can improve the model performance. Therefore, the model consists of two sets of encoders and decoders. First, a multi-head attention module applied to encoder outputs improves human trajectory. Second, another multi-head self-attention module applied to encoder outputs concatenated with decoder outputs facilitates learning of temporal dependencies. Our model is well-suited for robotic applications in terms of test accuracy and speed, and compares favorably with respect to state-of-the-art methods. We demonstrate the real-world applicability of our work via the Robot Follow-Ahead task, a challenging yet practical case study for our proposed model. ",
    "url": "https://arxiv.org/abs/2209.07600",
    "authors": [
      "Mohammad Mahdavian",
      "Payam Nikdel",
      "Mahdi TaherAhmadi",
      "Mo Chen"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07601",
    "title": "Towards Improving Calibration in Object Detection Under Domain Shift",
    "abstract": "The increasing use of deep neural networks in safety-critical applications requires the trained models to be well-calibrated. Most current calibration techniques address classification problems while focusing on improving calibration on in-domain predictions. Little to no attention is paid towards addressing calibration of visual object detectors which occupy similar space and importance in many decision making systems. In this paper, we study the calibration of current object detection models, particularly under domain shift. To this end, we first introduce a plug-and-play train-time calibration loss for object detection. It can be used as an auxiliary loss function to improve detector's calibration. Second, we devise a new uncertainty quantification mechanism for object detection which can implicitly calibrate the commonly used self-training based domain adaptive detectors. We include in our study both single-stage and two-stage object detectors. We demonstrate that our loss improves calibration for both in-domain and out-of-domain detections with notable margins. Finally, we show the utility of our techniques in calibrating the domain adaptive object detectors in diverse domain shift scenarios. ",
    "url": "https://arxiv.org/abs/2209.07601",
    "authors": [
      "Muhammad Akhtar Munir",
      "Muhammad Haris Khan",
      "M. Saquib Sarfraz",
      "Mohsen Ali"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07603",
    "title": "Hub-aware Random Walk Graph Embedding Methods for Classification",
    "abstract": "In the last two decades we are witnessing a huge increase of valuable big data structured in the form of graphs or networks. To apply traditional machine learning and data analytic techniques to such data it is necessary to transform graphs into vector-based representations that preserve the most essential structural properties of graphs. For this purpose, a large number of graph embedding methods have been proposed in the literature. Most of them produce general-purpose embeddings suitable for a variety of applications such as node clustering, node classification, graph visualisation and link prediction. In this paper, we propose two novel graph embedding algorithms based on random walks that are specifically designed for the node classification problem. Random walk sampling strategies of the proposed algorithms have been designed to pay special attention to hubs -- high-degree nodes that have the most critical role for the overall connectedness in large-scale graphs. The proposed methods are experimentally evaluated by analyzing the classification performance of three classification algorithms trained on embeddings of real-world networks. The obtained results indicate that our methods considerably improve the predictive power of examined classifiers compared to currently the most popular random walk method for generating general-purpose graph embeddings (node2vec). ",
    "url": "https://arxiv.org/abs/2209.07603",
    "authors": [
      "Aleksandar Tomčić",
      "Miloš Savić",
      "Miloš Radovanović"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.07611",
    "title": "Corpus-Guided Contrast Sets for Morphosyntactic Feature Detection in  Low-Resource English Varieties",
    "abstract": "The study of language variation examines how language varies between and within different groups of speakers, shedding light on how we use language to construct identities and how social contexts affect language use. A common method is to identify instances of a certain linguistic feature - say, the zero copula construction - in a corpus, and analyze the feature's distribution across speakers, topics, and other variables, to either gain a qualitative understanding of the feature's function or systematically measure variation. In this paper, we explore the challenging task of automatic morphosyntactic feature detection in low-resource English varieties. We present a human-in-the-loop approach to generate and filter effective contrast sets via corpus-guided edits. We show that our approach improves feature detection for both Indian English and African American English, demonstrate how it can assist linguistic research, and release our fine-tuned models for use by other researchers. ",
    "url": "https://arxiv.org/abs/2209.07611",
    "authors": [
      "Tessa Masis",
      "Anissa Neal",
      "Lisa Green",
      "Brendan O'Connor"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.07616",
    "title": "Reducing Access Disparities in Networks using Edge Augmentation",
    "abstract": "In social networks, a node's position is a form of \\it{social capital}. Better-positioned members not only benefit from (faster) access to diverse information, but innately have more potential influence on information spread. Structural biases often arise from network formation, and can lead to significant disparities in information access based on position. Further, processes such as link recommendation can exacerbate this inequality by relying on network structure to augment connectivity. We argue that one can understand and quantify this social capital through the lens of information flow in the network. We consider the setting where all nodes may be sources of distinct information, and a node's (dis)advantage deems its ability to access all information available on the network. We introduce three new measures of advantage (broadcast, influence, and control), which are quantified in terms of position in the network using \\it{access signatures} -- vectors that represent a node's ability to share information. We then consider the problem of improving equity by making interventions to increase the access of the least-advantaged nodes. We argue that edge augmentation is most appropriate for mitigating bias in the network structure, and frame a budgeted intervention problem for maximizing minimum pairwise access. Finally, we propose heuristic strategies for selecting edge augmentations and empirically evaluate their performance on a corpus of real-world social networks. We demonstrate that a small number of interventions significantly increase the broadcast measure of access for the least-advantaged nodes (over 5 times more than random), and also improve the minimum influence. Additional analysis shows that these interventions can also dramatically shrink the gap in advantage between nodes (over \\%82) and reduce disparities between their access signatures. ",
    "url": "https://arxiv.org/abs/2209.07616",
    "authors": [
      "Ashkan Bashardoust",
      "Sorelle A. Friedler",
      "Carlos E. Scheidegger",
      "Blair D. Sullivan",
      "Suresh Venkatasubramanian"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.07620",
    "title": "Fuzzy-based forest fire prevention and detection by wireless sensor  networks",
    "abstract": "Forest fires may cause considerable damages both in ecosystems and lives. This proposal describes the application of Internet of Things and wireless sensor networks jointly with multi-hop routing through a real time and dynamic monitoring system for forest fire prevention. It is based on gathering and analyzing information related to meteorological conditions, concentrations of polluting gases and oxygen level around particular interesting forest areas. Unusual measurements of these environmental variables may help to prevent wildfire incidents and make their detection more efficient. A forest fire risk controller based on fuzzy logic has been implemented in order to activate environmental risk alerts through a Web service and a mobile application. For this purpose, security mechanisms have been proposed for ensuring integrity and confidentiality in the transmission of measured environmental information. Lamport's signature and a block cipher algorithm are used to achieve this objective. ",
    "url": "https://arxiv.org/abs/2209.07620",
    "authors": [
      "J Toledo-Castro",
      "I Santos-González",
      "P Caballero-Gil",
      "C Hernández-Goya",
      "N Rodríguez-Pérez",
      "R Aguasca-Colomo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.07623",
    "title": "Studying the explanations for the automated prediction of bug and  non-bug issues using LIME and SHAP",
    "abstract": "Context: The identification of bugs within the reported issues in an issue tracker is crucial for the triage of issues. Machine learning models have shown promising results regarding the performance of automated issue type prediction. However, we have only limited knowledge beyond our assumptions how such models identify bugs. LIME and SHAP are popular technique to explain the predictions of classifiers. Objective: We want to understand if machine learning models provide explanations for the classification that are reasonable to us as humans and align with our assumptions of what the models should learn. We also want to know if the prediction quality is correlated with the quality of explanations. Method: We conduct a study where we rate LIME and SHAP explanations based on their quality of explaining the outcome of an issue type prediction model. For this, we rate the quality of the explanations themselves, i.e., if they align with our expectations and if they help us to understand the underlying machine learning model. ",
    "url": "https://arxiv.org/abs/2209.07623",
    "authors": [
      "Benjamin Ledel",
      "Steffen Herbold"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07626",
    "title": "Incremental cycle bases for cycle-based pose graph optimization",
    "abstract": "Pose graph optimization is a special case of the simultaneous localization and mapping problem where the only variables to be estimated are pose variables and the only measurements are inter-pose constraints. The vast majority of PGO techniques are vertex based (variables are robot poses), but recent work has parameterized the pose graph optimization problem in a relative fashion (variables are the transformations between poses) that utilizes a minimum cycle basis to maximize the sparsity of the problem. We explore the construction of a cycle basis in an incremental manner while maximizing the sparsity. We validate an algorithm that constructs a sparse cycle basis incrementally and compare its performance with a minimum cycle basis. Additionally, we present an algorithm to approximate the minimum cycle basis of two graphs that are sparsely connected as is common in multi-agent scenarios. Lastly, the relative parameterization of pose graph optimization has been limited to using rigid body transforms on SE(2) or SE(3) as the constraints between poses. We introduce a methodology to allow for the use of lower-degree-of-freedom measurements in the relative pose graph optimization problem. We provide extensive validation of our algorithms on standard benchmarks, simulated datasets, and custom hardware. ",
    "url": "https://arxiv.org/abs/2209.07626",
    "authors": [
      "Brendon Forsgren",
      "Kevin Brink",
      "Prashant Ganesh",
      "Timothy McLain"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.07663",
    "title": "Monolith: Real Time Recommendation System With Collisionless Embedding  Table",
    "abstract": "Building a scalable and real-time recommendation system is vital for many businesses driven by time-sensitive customer feedback, such as short-videos ranking or online ads. Despite the ubiquitous adoption of production-scale deep learning frameworks like TensorFlow or PyTorch, these general-purpose frameworks fall short of business demands in recommendation scenarios for various reasons: on one hand, tweaking systems based on static parameters and dense computations for recommendation with dynamic and sparse features is detrimental to model quality; on the other hand, such frameworks are designed with batch-training stage and serving stage completely separated, preventing the model from interacting with customer feedback in real-time. These issues led us to reexamine traditional approaches and explore radically different design choices. In this paper, we present Monolith, a system tailored for online training. Our design has been driven by observations of our application workloads and production environment that reflects a marked departure from other recommendations systems. Our contributions are manifold: first, we crafted a collisionless embedding table with optimizations such as expirable embeddings and frequency filtering to reduce its memory footprint; second, we provide an production-ready online training architecture with high fault-tolerance; finally, we proved that system reliability could be traded-off for real-time learning. Monolith has successfully landed in the BytePlus Recommend product. ",
    "url": "https://arxiv.org/abs/2209.07663",
    "authors": [
      "Zhuoran Liu",
      "Leqi Zou",
      "Xuan Zou",
      "Caihua Wang",
      "Biao Zhang",
      "Da Tang",
      "Bolin Zhu",
      "Yijie Zhu",
      "Peng Wu",
      "Ke Wang",
      "Youlong Cheng"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2209.07670",
    "title": "Reducing Variance in Temporal-Difference Value Estimation via Ensemble  of Deep Networks",
    "abstract": "In temporal-difference reinforcement learning algorithms, variance in value estimation can cause instability and overestimation of the maximal target value. Many algorithms have been proposed to reduce overestimation, including several recent ensemble methods, however none have shown success in sample-efficient learning through addressing estimation variance as the root cause of overestimation. In this paper, we propose MeanQ, a simple ensemble method that estimates target values as ensemble means. Despite its simplicity, MeanQ shows remarkable sample efficiency in experiments on the Atari Learning Environment benchmark. Importantly, we find that an ensemble of size 5 sufficiently reduces estimation variance to obviate the lagging target network, eliminating it as a source of bias and further gaining sample efficiency. We justify intuitively and empirically the design choices in MeanQ, including the necessity of independent experience sampling. On a set of 26 benchmark Atari environments, MeanQ outperforms all tested baselines, including the best available baseline, SUNRISE, at 100K interaction steps in 16/26 environments, and by 68% on average. MeanQ also outperforms Rainbow DQN at 500K steps in 21/26 environments, and by 49% on average, and achieves average human-level performance using 200K ($\\pm$100K) interaction steps. Our implementation is available at https://github.com/indylab/MeanQ. ",
    "url": "https://arxiv.org/abs/2209.07670",
    "authors": [
      "Litian Liang",
      "Yaosheng Xu",
      "Stephen McAleer",
      "Dailin Hu",
      "Alexander Ihler",
      "Pieter Abbeel",
      "Roy Fox"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07683",
    "title": "SQ-Swin: a Pretrained Siamese Quadratic Swin Transformer for Lettuce  Browning Prediction",
    "abstract": "Packaged fresh-cut lettuce is widely consumed as a major component of vegetable salad owing to its high nutrition, freshness, and convenience. However, enzymatic browning discoloration on lettuce cut edges significantly reduces product quality and shelf life. While there are many research and breeding efforts underway to minimize browning, the progress is hindered by the lack of a rapid and reliable methodology to evaluate browning. Current methods to identify and quantify browning are either too subjective, labor intensive, or inaccurate. In this paper, we report a deep learning model for lettuce browning prediction. To the best of our knowledge, it is the first-of-its-kind on deep learning for lettuce browning prediction using a pretrained Siamese Quadratic Swin (SQ-Swin) transformer with several highlights. First, our model includes quadratic features in the transformer model which is more powerful to incorporate real-world representations than the linear transformer. Second, a multi-scale training strategy is proposed to augment the data and explore more of the inherent self-similarity of the lettuce images. Third, the proposed model uses a siamese architecture which learns the inter-relations among the limited training samples. Fourth, the model is pretrained on the ImageNet and then trained with the reptile meta-learning algorithm to learn higher-order gradients than a regular one. Experiment results on the fresh-cut lettuce datasets show that the proposed SQ-Swin outperforms the traditional methods and other deep learning-based backbones. ",
    "url": "https://arxiv.org/abs/2209.07683",
    "authors": [
      "Dayang Wang",
      "Boce Zhang",
      "Yongshun Xu",
      "Yaguang Luo",
      "Hengyong Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07685",
    "title": "Neural Koopman Control Barrier Functions for Safety-Critical Control of  Unknown Nonlinear Systems",
    "abstract": "We consider the problem of synthesis of safe controllers for nonlinear systems with unknown dynamics using Control Barrier Functions (CBF). We utilize Koopman operator theory (KOT) to associate the (unknown) nonlinear system with a higher dimensional bilinear system and propose a data-driven learning framework that uses a learner and a falsifier to simultaneously learn the Koopman operator based bilinear system and a corresponding CBF. We prove that the learned CBF for the latter bilinear system is also a valid CBF for the unknown nonlinear system by characterizing the $\\ell^2$-norm error bound between these two systems. We show that this error can be partially tuned by using the Lipschitz constant of the Koopman based observables. The CBF is then used to formulate a quadratic program to compute inputs that guarantee safety of the unknown nonlinear system. Numerical simulations are presented to validate our approach. ",
    "url": "https://arxiv.org/abs/2209.07685",
    "authors": [
      "Vrushabh Zinage",
      "Efstathios Bakolas"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2209.07696",
    "title": "Towards A Unified Policy Abstraction Theory and Representation Learning  Approach in Markov Decision Processes",
    "abstract": "Lying on the heart of intelligent decision-making systems, how policy is represented and optimized is a fundamental problem. The root challenge in this problem is the large scale and the high complexity of policy space, which exacerbates the difficulty of policy learning especially in real-world scenarios. Towards a desirable surrogate policy space, recently policy representation in a low-dimensional latent space has shown its potential in improving both the evaluation and optimization of policy. The key question involved in these studies is by what criterion we should abstract the policy space for desired compression and generalization. However, both the theory on policy abstraction and the methodology on policy representation learning are less studied in the literature. In this work, we make very first efforts to fill up the vacancy. First, we propose a unified policy abstraction theory, containing three types of policy abstraction associated to policy features at different levels. Then, we generalize them to three policy metrics that quantify the distance (i.e., similarity) of policies, for more convenient use in learning policy representation. Further, we propose a policy representation learning approach based on deep metric learning. For the empirical study, we investigate the efficacy of the proposed policy metrics and representations, in characterizing policy difference and conveying policy generalization respectively. Our experiments are conducted in both policy optimization and evaluation problems, containing trust-region policy optimization (TRPO), diversity-guided evolution strategy (DGES) and off-policy evaluation (OPE). Somewhat naturally, the experimental results indicate that there is no a universally optimal abstraction for all downstream learning problems; while the influence-irrelevance policy abstraction can be a generally preferred choice. ",
    "url": "https://arxiv.org/abs/2209.07696",
    "authors": [
      "Min Zhang",
      "Hongyao Tang",
      "Jianye Hao",
      "Yan Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2209.07699",
    "title": "Adversarial Cross-View Disentangled Graph Contrastive Learning",
    "abstract": "Graph contrastive learning (GCL) is prevalent to tackle the supervision shortage issue in graph learning tasks. Many recent GCL methods have been proposed with various manually designed augmentation techniques, aiming to implement challenging augmentations on the original graph to yield robust representation. Although many of them achieve remarkable performances, existing GCL methods still struggle to improve model robustness without risking losing task-relevant information because they ignore the fact the augmentation-induced latent factors could be highly entangled with the original graph, thus it is more difficult to discriminate the task-relevant information from irrelevant information. Consequently, the learned representation is either brittle or unilluminating. In light of this, we introduce the Adversarial Cross-View Disentangled Graph Contrastive Learning (ACDGCL), which follows the information bottleneck principle to learn minimal yet sufficient representations from graph data. To be specific, our proposed model elicits the augmentation-invariant and augmentation-dependent factors separately. Except for the conventional contrastive loss which guarantees the consistency and sufficiency of the representations across different contrastive views, we introduce a cross-view reconstruction mechanism to pursue the representation disentanglement. Besides, an adversarial view is added as the third view of contrastive loss to enhance model robustness. We empirically demonstrate that our proposed model outperforms the state-of-the-arts on graph classification task over multiple benchmark datasets. ",
    "url": "https://arxiv.org/abs/2209.07699",
    "authors": [
      "Qianlong Wen",
      "Zhongyu Ouyang",
      "Chunhui Zhang",
      "Yiyue Qian",
      "Yanfang Ye",
      "Chuxu Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07706",
    "title": "Understanding NFT Price Moves through Social Media Keywords Analysis",
    "abstract": "Non-Fungible Token (NFT) is evolving with the rise of the cryptocurrency market and the development of blockchain techniques, which leads to an emerging NFT market that has become prosperous rapidly. The overall rise procedure of the NFT market has not been well understood. To this end, we consider that social media communities evolving alongside the market growth, are worth exploring and reasoning about, as the mineable information might unveil the market behaviors. We explore the procedure from the perspective of NFT social media communities and its impact on the NFT price moves with two experiments. We perform a Granger causality test on the number of tweets and the NFT price time series and find that the number of tweets has a positive impact on (Granger-causes) the price or reversely for more than half of the 19 top authentic NFT projects but seldom copycat projects. Besides, to investigate the price moves predictability using social media features, we conduct an experiment of predicting Markov normalized NFT price (representing the direction and magnitude of price moves) given social-media-extracted word features and interpret the feature importance to find insights into the NFT communities. Our results show that social media words as the predictors result in all 19 top projects having a testing accuracy above the random baseline. Based on the feature importance analysis, we find that both general market-related words and NFT event-related words have a markedly positive contribution in predicting price moves. ",
    "url": "https://arxiv.org/abs/2209.07706",
    "authors": [
      "Junliang Luo",
      "Yongzheng Jia",
      "Xue Liu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.07709",
    "title": "LO-Det: Lightweight Oriented Object Detection in Remote Sensing Images",
    "abstract": "A few lightweight convolutional neural network (CNN) models have been recently designed for remote sensing object detection (RSOD). However, most of them simply replace vanilla convolutions with stacked separable convolutions, which may not be efficient due to a lot of precision losses and may not be able to detect oriented bounding boxes (OBB). Also, the existing OBB detection methods are difficult to constrain the shape of objects predicted by CNNs accurately. In this paper, we propose an effective lightweight oriented object detector (LO-Det). Specifically, a channel separation-aggregation (CSA) structure is designed to simplify the complexity of stacked separable convolutions, and a dynamic receptive field (DRF) mechanism is developed to maintain high accuracy by customizing the convolution kernel and its perception range dynamically when reducing the network complexity. The CSA-DRF component optimizes efficiency while maintaining high accuracy. Then, a diagonal support constraint head (DSC-Head) component is designed to detect OBBs and constrain their shapes more accurately and stably. Extensive experiments on public datasets demonstrate that the proposed LO-Det can run very fast even on embedded devices with the competitive accuracy of detecting oriented objects. ",
    "url": "https://arxiv.org/abs/2209.07709",
    "authors": [
      "Zhanchao Huang",
      "Wei Li",
      "Xiang-Gen Xia",
      "Hao Wang",
      "Feiran Jie",
      "Ran Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07716",
    "title": "Renyi Differential Privacy of Propose-Test-Release and Applications to  Private and Robust Machine Learning",
    "abstract": "Propose-Test-Release (PTR) is a differential privacy framework that works with local sensitivity of functions, instead of their global sensitivity. This framework is typically used for releasing robust statistics such as median or trimmed mean in a differentially private manner. While PTR is a common framework introduced over a decade ago, using it in applications such as robust SGD where we need many adaptive robust queries is challenging. This is mainly due to the lack of Renyi Differential Privacy (RDP) analysis, an essential ingredient underlying the moments accountant approach for differentially private deep learning. In this work, we generalize the standard PTR and derive the first RDP bound for it when the target function has bounded global sensitivity. We show that our RDP bound for PTR yields tighter DP guarantees than the directly analyzed $(\\eps, \\delta)$-DP. We also derive the algorithm-specific privacy amplification bound of PTR under subsampling. We show that our bound is much tighter than the general upper bound and close to the lower bound. Our RDP bounds enable tighter privacy loss calculation for the composition of many adaptive runs of PTR. As an application of our analysis, we show that PTR and our theoretical results can be used to design differentially private variants for byzantine robust training algorithms that use robust statistics for gradients aggregation. We conduct experiments on the settings of label, feature, and gradient corruption across different datasets and architectures. We show that PTR-based private and robust training algorithm significantly improves the utility compared with the baseline. ",
    "url": "https://arxiv.org/abs/2209.07716",
    "authors": [
      "Jiachen T. Wang",
      "Saeed Mahloujifar",
      "Shouda Wang",
      "Ruoxi Jia",
      "Prateek Mittal"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07729",
    "title": "On Weighted Graph Sparsification by Linear Sketching",
    "abstract": "A seminal work of [Ahn-Guha-McGregor, PODS'12] showed that one can compute a cut sparsifier of an unweighted undirected graph by taking a near-linear number of linear measurements on the graph. Subsequent works also studied computing other graph sparsifiers using linear sketching, and obtained near-linear upper bounds for spectral sparsifiers [Kapralov-Lee-Musco-Musco-Sidford, FOCS'14] and first non-trivial upper bounds for spanners [Filtser-Kapralov-Nouri, SODA'21]. All these linear sketching algorithms, however, only work on unweighted graphs. In this paper, we initiate the study of weighted graph sparsification by linear sketching by investigating a natural class of linear sketches that we call incidence sketches, in which each measurement is a linear combination of the weights of edges incident on a single vertex. Our results are: 1. Weighted cut sparsification: We give an algorithm that computes a $(1 + \\epsilon)$-cut sparsifier using $\\tilde{O}(n \\epsilon^{-3})$ linear measurements, which is nearly optimal. 2. Weighted spectral sparsification: We give an algorithm that computes a $(1 + \\epsilon)$-spectral sparsifier using $\\tilde{O}(n^{6/5} \\epsilon^{-4})$ linear measurements. Complementing our algorithm, we then prove a superlinear lower bound of $\\Omega(n^{21/20-o(1)})$ measurements for computing some $O(1)$-spectral sparsifier using incidence sketches. 3. Weighted spanner computation: We focus on graphs whose largest/smallest edge weights differ by an $O(1)$ factor, and prove that, for incidence sketches, the upper bounds obtained by~[Filtser-Kapralov-Nouri, SODA'21] are optimal up to an $n^{o(1)}$ factor. ",
    "url": "https://arxiv.org/abs/2209.07729",
    "authors": [
      "Yu Chen",
      "Sanjeev Khanna",
      "Huan Li"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2209.07734",
    "title": "CenterLineDet: Road Lane CenterLine Graph Detection With Vehicle-Mounted  Sensors by Transformer for High-definition Map Creation",
    "abstract": "With the rapid development of autonomous vehicles, there witnesses a booming demand for high-definition maps (HD maps) that provide reliable and robust prior information of static surroundings in autonomous driving scenarios. As one of the main high-level elements in the HD map, the road lane centerline is critical for downstream tasks, such as prediction and planning. Manually annotating lane centerline HD maps by human annotators is labor-intensive, expensive and inefficient, severely restricting the wide application and fast deployment of autonomous driving systems. Previous works seldom explore the centerline HD map mapping problem due to the complicated topology and severe overlapping issues of road centerlines. In this paper, we propose a novel method named CenterLineDet to create the lane centerline HD map automatically. CenterLineDet is trained by imitation learning and can effectively detect the graph of lane centerlines by iterations with vehicle-mounted sensors. Due to the application of the DETR-like transformer network, CenterLineDet can handle complicated graph topology, such as lane intersections. The proposed approach is evaluated on a large publicly available dataset Nuscenes, and the superiority of CenterLineDet is well demonstrated by the comparison results. This paper is accompanied by a demo video and a supplementary document that are available at \\url{https://tonyxuqaq.github.io/projects/CenterLineDet/}. ",
    "url": "https://arxiv.org/abs/2209.07734",
    "authors": [
      "Zhenhua Xu",
      "Yuxuan Liu",
      "Yuxiang Sun",
      "Ming Liu",
      "Lujia Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.07735",
    "title": "Enhance the Visual Representation via Discrete Adversarial Training",
    "abstract": "Adversarial Training (AT), which is commonly accepted as one of the most effective approaches defending against adversarial examples, can largely harm the standard performance, thus has limited usefulness on industrial-scale production and applications. Surprisingly, this phenomenon is totally opposite in Natural Language Processing (NLP) task, where AT can even benefit for generalization. We notice the merit of AT in NLP tasks could derive from the discrete and symbolic input space. For borrowing the advantage from NLP-style AT, we propose Discrete Adversarial Training (DAT). DAT leverages VQGAN to reform the image data to discrete text-like inputs, i.e. visual words. Then it minimizes the maximal risk on such discrete images with symbolic adversarial perturbations. We further give an explanation from the perspective of distribution to demonstrate the effectiveness of DAT. As a plug-and-play technique for enhancing the visual representation, DAT achieves significant improvement on multiple tasks including image classification, object detection and self-supervised learning. Especially, the model pre-trained with Masked Auto-Encoding (MAE) and fine-tuned by our DAT without extra data can get 31.40 mCE on ImageNet-C and 32.77% top-1 accuracy on Stylized-ImageNet, building the new state-of-the-art. The code will be available at https://github.com/alibaba/easyrobust. ",
    "url": "https://arxiv.org/abs/2209.07735",
    "authors": [
      "Xiaofeng Mao",
      "Yuefeng Chen",
      "Ranjie Duan",
      "Yao Zhu",
      "Gege Qi",
      "Shaokai Ye",
      "Xiaodan Li",
      "Rong Zhang",
      "Hui Xue"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07736",
    "title": "Extrapolation and Spectral Bias of Neural Nets with Hadamard Product: a  Polynomial Net Study",
    "abstract": "Neural tangent kernel (NTK) is a powerful tool to analyze training dynamics of neural networks and their generalization bounds. The study on NTK has been devoted to typical neural network architectures, but is incomplete for neural networks with Hadamard products (NNs-Hp), e.g., StyleGAN and polynomial neural networks. In this work, we derive the finite-width NTK formulation for a special class of NNs-Hp, i.e., polynomial neural networks. We prove their equivalence to the kernel regression predictor with the associated NTK, which expands the application scope of NTK. Based on our results, we elucidate the separation of PNNs over standard neural networks with respect to extrapolation and spectral bias. Our two key insights are that when compared to standard neural networks, PNNs are able to fit more complicated functions in the extrapolation regime and admit a slower eigenvalue decay of the respective NTK. Besides, our theoretical results can be extended to other types of NNs-Hp, which expand the scope of our work. Our empirical results validate the separations in broader classes of NNs-Hp, which provide a good justification for a deeper understanding of neural architectures. ",
    "url": "https://arxiv.org/abs/2209.07736",
    "authors": [
      "Yongtao Wu",
      "Zhenyu Zhu",
      "Fanghui Liu",
      "Grigorios G Chrysos",
      "Volkan Cevher"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.07753",
    "title": "Code as Policies: Language Model Programs for Embodied Control",
    "abstract": "Large language models (LLMs) trained on code completion have been shown to be capable of synthesizing simple Python programs from docstrings [1]. We find that these code-writing LLMs can be re-purposed to write robot policy code, given natural language commands. Specifically, policy code can express functions or feedback loops that process perception outputs (e.g.,from object detectors [2], [3]) and parameterize control primitive APIs. When provided as input several example language commands (formatted as comments) followed by corresponding policy code (via few-shot prompting), LLMs can take in new commands and autonomously re-compose API calls to generate new policy code respectively. By chaining classic logic structures and referencing third-party libraries (e.g., NumPy, Shapely) to perform arithmetic, LLMs used in this way can write robot policies that (i) exhibit spatial-geometric reasoning, (ii) generalize to new instructions, and (iii) prescribe precise values (e.g., velocities) to ambiguous descriptions (\"faster\") depending on context (i.e., behavioral commonsense). This paper presents code as policies: a robot-centric formalization of language model generated programs (LMPs) that can represent reactive policies (e.g., impedance controllers), as well as waypoint-based policies (vision-based pick and place, trajectory-based control), demonstrated across multiple real robot platforms. Central to our approach is prompting hierarchical code-gen (recursively defining undefined functions), which can write more complex code and also improves state-of-the-art to solve 39.8% of problems on the HumanEval [1] benchmark. Code and videos are available at https://code-as-policies.github.io ",
    "url": "https://arxiv.org/abs/2209.07753",
    "authors": [
      "Jacky Liang",
      "Wenlong Huang",
      "Fei Xia",
      "Peng Xu",
      "Karol Hausman",
      "Brian Ichter",
      "Pete Florence",
      "Andy Zeng"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.07754",
    "title": "On the Robustness of Graph Neural Diffusion to Topology Perturbations",
    "abstract": "Neural diffusion on graphs is a novel class of graph neural networks that has attracted increasing attention recently. The capability of graph neural partial differential equations (PDEs) in addressing common hurdles of graph neural networks (GNNs), such as the problems of over-smoothing and bottlenecks, has been investigated but not their robustness to adversarial attacks. In this work, we explore the robustness properties of graph neural PDEs. We empirically demonstrate that graph neural PDEs are intrinsically more robust against topology perturbation as compared to other GNNs. We provide insights into this phenomenon by exploiting the stability of the heat semigroup under graph topology perturbations. We discuss various graph diffusion operators and relate them to existing graph neural PDEs. Furthermore, we propose a general graph neural PDE framework based on which a new class of robust GNNs can be defined. We verify that the new model achieves comparable state-of-the-art performance on several benchmark datasets. ",
    "url": "https://arxiv.org/abs/2209.07754",
    "authors": [
      "Yang Song",
      "Qiyu Kang",
      "Sijie Wang",
      "Zhao Kai",
      "Wee Peng Tay"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07778",
    "title": "Spatial-then-Temporal Self-Supervised Learning for Video Correspondence",
    "abstract": "Learning temporal correspondence from unlabeled videos is of vital importance in computer vision, and has been tackled by different kinds of self-supervised pretext tasks. For the self-supervised learning, recent studies suggest using large-scale video datasets despite the training cost. We propose a spatial-then-temporal pretext task to address the training data cost problem. The task consists of two steps. First, we use contrastive learning from unlabeled still image data to obtain appearance-sensitive features. Then we switch to unlabeled video data and learn motion-sensitive features by reconstructing frames. In the second step, we propose a global correlation distillation loss to retain the appearance sensitivity learned in the first step, as well as a local correlation distillation loss in a pyramid structure to combat temporal discontinuity. Experimental results demonstrate that our method surpasses the state-of-the-art self-supervised methods on a series of correspondence-based tasks. The conducted ablation studies verify the effectiveness of the proposed two-step task and loss functions. ",
    "url": "https://arxiv.org/abs/2209.07778",
    "authors": [
      "Rui Li",
      "Dong Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07788",
    "title": "PointCAT: Contrastive Adversarial Training for Robust Point Cloud  Recognition",
    "abstract": "Notwithstanding the prominent performance achieved in various applications, point cloud recognition models have often suffered from natural corruptions and adversarial perturbations. In this paper, we delve into boosting the general robustness of point cloud recognition models and propose Point-Cloud Contrastive Adversarial Training (PointCAT). The main intuition of PointCAT is encouraging the target recognition model to narrow the decision gap between clean point clouds and corrupted point clouds. Specifically, we leverage a supervised contrastive loss to facilitate the alignment and uniformity of the hypersphere features extracted by the recognition model, and design a pair of centralizing losses with the dynamic prototype guidance to avoid these features deviating from their belonging category clusters. To provide the more challenging corrupted point clouds, we adversarially train a noise generator along with the recognition model from the scratch, instead of using gradient-based attack as the inner loop like previous adversarial training methods. Comprehensive experiments show that the proposed PointCAT outperforms the baseline methods and dramatically boosts the robustness of different point cloud recognition models, under a variety of corruptions including isotropic point noises, the LiDAR simulated noises, random point dropping and adversarial perturbations. ",
    "url": "https://arxiv.org/abs/2209.07788",
    "authors": [
      "Qidong Huang",
      "Xiaoyi Dong",
      "Dongdong Chen",
      "Hang Zhou",
      "Weiming Zhang",
      "Kui Zhang",
      "Gang Hua",
      "Nenghai Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07790",
    "title": "A Large-scale Multiple-objective Method for Black-box Attack against  Object Detection",
    "abstract": "Recent studies have shown that detectors based on deep models are vulnerable to adversarial examples, even in the black-box scenario where the attacker cannot access the model information. Most existing attack methods aim to minimize the true positive rate, which often shows poor attack performance, as another sub-optimal bounding box may be detected around the attacked bounding box to be the new true positive one. To settle this challenge, we propose to minimize the true positive rate and maximize the false positive rate, which can encourage more false positive objects to block the generation of new true positive bounding boxes. It is modeled as a multi-objective optimization (MOP) problem, of which the generic algorithm can search the Pareto-optimal. However, our task has more than two million decision variables, leading to low searching efficiency. Thus, we extend the standard Genetic Algorithm with Random Subset selection and Divide-and-Conquer, called GARSDC, which significantly improves the efficiency. Moreover, to alleviate the sensitivity to population quality in generic algorithms, we generate a gradient-prior initial population, utilizing the transferability between different detectors with similar backbones. Compared with the state-of-art attack methods, GARSDC decreases by an average 12.0 in the mAP and queries by about 1000 times in extensive experiments. Our codes can be found at https://github.com/LiangSiyuan21/ GARSDC. ",
    "url": "https://arxiv.org/abs/2209.07790",
    "authors": [
      "Siyuan Liang",
      "Longkang Li",
      "Yanbo Fan",
      "Xiaojun Jia",
      "Jingzhi Li",
      "Baoyuan Wu",
      "Xiaochun Cao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07802",
    "title": "Dynamics-informed deconvolutional neural networks for super-resolution  identification of regime changes in epidemiological time series",
    "abstract": "Inferring the timing and amplitude of perturbations in epidemiological systems from their stochastically spread low-resolution outcomes is as relevant as challenging. It is a requirement for current approaches to overcome the need to know the details of the perturbations to proceed with the analyses. However, the general problem of connecting epidemiological curves with the underlying incidence lacks the highly effective methodology present in other inverse problems, such as super-resolution and dehazing from computer vision. Here, we develop an unsupervised physics-informed convolutional neural network approach in reverse to connect death records with incidence that allows the identification of regime changes at single-day resolution. Applied to COVID-19 data with proper regularization and model-selection criteria, the approach can identify the implementation and removal of lockdowns and other nonpharmaceutical interventions with 0.93-day accuracy over the time span of a year. ",
    "url": "https://arxiv.org/abs/2209.07802",
    "authors": [
      "Jose M. G. Vilar",
      "Leonor Saiz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Populations and Evolution (q-bio.PE)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2209.07807",
    "title": "Model Inversion Attacks against Graph Neural Networks",
    "abstract": "Many data mining tasks rely on graphs to model relational structures among individuals (nodes). Since relational data are often sensitive, there is an urgent need to evaluate the privacy risks in graph data. One famous privacy attack against data analysis models is the model inversion attack, which aims to infer sensitive data in the training dataset and leads to great privacy concerns. Despite its success in grid-like domains, directly applying model inversion attacks on non-grid domains such as graph leads to poor attack performance. This is mainly due to the failure to consider the unique properties of graphs. To bridge this gap, we conduct a systematic study on model inversion attacks against Graph Neural Networks (GNNs), one of the state-of-the-art graph analysis tools in this paper. Firstly, in the white-box setting where the attacker has full access to the target GNN model, we present GraphMI to infer the private training graph data. Specifically, in GraphMI, a projected gradient module is proposed to tackle the discreteness of graph edges and preserve the sparsity and smoothness of graph features; a graph auto-encoder module is used to efficiently exploit graph topology, node attributes, and target model parameters for edge inference; a random sampling module can finally sample discrete edges. Furthermore, in the hard-label black-box setting where the attacker can only query the GNN API and receive the classification results, we propose two methods based on gradient estimation and reinforcement learning (RL-GraphMI). Our experimental results show that such defenses are not sufficiently effective and call for more advanced defenses against privacy attacks. ",
    "url": "https://arxiv.org/abs/2209.07807",
    "authors": [
      "Zaixi Zhang",
      "Qi Liu",
      "Zhenya Huang",
      "Hao Wang",
      "Chee-Kong Lee",
      "Enhong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.07808",
    "title": "Single Image Deraining via Rain-Steaks Aware Deep Convolutional Neural  Network",
    "abstract": "It is challenging to remove rain-steaks from a single rainy image because the rain steaks are spatially varying in the rainy image. This problem is studied in this paper by combining conventional image processing techniques and deep learning based techniques. An improved weighted guided image filter (iWGIF) is proposed to extract high frequency information from a rainy image. The high frequency information mainly includes rain steaks and noise, and it can guide the rain steaks aware deep convolutional neural network (RSADCNN) to pay more attention to rain steaks. The efficiency and explain-ability of RSADNN are improved. Experiments show that the proposed algorithm significantly outperforms state-of-the-art methods on both synthetic and real-world images in terms of both qualitative and quantitative measures. It is useful for autonomous navigation in raining conditions. ",
    "url": "https://arxiv.org/abs/2209.07808",
    "authors": [
      "Chaobing Zheng",
      "Yuwen Li",
      "Shiqian Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07809",
    "title": "M$^2$DQN: A Robust Method for Accelerating Deep Q-learning Network",
    "abstract": "Deep Q-learning Network (DQN) is a successful way which combines reinforcement learning with deep neural networks and leads to a widespread application of reinforcement learning. One challenging problem when applying DQN or other reinforcement learning algorithms to real world problem is data collection. Therefore, how to improve data efficiency is one of the most important problems in the research of reinforcement learning. In this paper, we propose a framework which uses the Max-Mean loss in Deep Q-Network (M$^2$DQN). Instead of sampling one batch of experiences in the training step, we sample several batches from the experience replay and update the parameters such that the maximum TD-error of these batches is minimized. The proposed method can be combined with most of existing techniques of DQN algorithm by replacing the loss function. We verify the effectiveness of this framework with one of the most widely used techniques, Double DQN (DDQN), in several gym games. The results show that our method leads to a substantial improvement in both the learning speed and performance. ",
    "url": "https://arxiv.org/abs/2209.07809",
    "authors": [
      "Zhe Zhang",
      "Yukun Zou",
      "Junjie Lai",
      "Qing Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.07817",
    "title": "SPGP: Structure Prototype Guided Graph Pooling",
    "abstract": "While graph neural networks (GNNs) have been successful for node classification tasks and link prediction tasks in graph, learning graph-level representations still remains a challenge. For the graph-level representation, it is important to learn both representation of neighboring nodes, i.e., aggregation, and graph structural information. A number of graph pooling methods have been developed for this goal. However, most of the existing pooling methods utilize k-hop neighborhood without considering explicit structural information in a graph. In this paper, we propose Structure Prototype Guided Pooling (SPGP) that utilizes prior graph structures to overcome the limitation. SPGP formulates graph structures as learnable prototype vectors and computes the affinity between nodes and prototype vectors. This leads to a novel node scoring scheme that prioritizes informative nodes while encapsulating the useful structures of the graph. Our experimental results show that SPGP outperforms state-of-the-art graph pooling methods on graph classification benchmark datasets in both accuracy and scalability. ",
    "url": "https://arxiv.org/abs/2209.07817",
    "authors": [
      "Sangseon Lee",
      "Dohoon Lee",
      "Yinhua Piao",
      "Sun Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.07819",
    "title": "Self-Supervised Learning of Phenotypic Representations from Cell Images  with Weak Labels",
    "abstract": "We propose WS-DINO as a novel framework to use weak label information in learning phenotypic representations from high-content fluorescent images of cells. Our model is based on a knowledge distillation approach with a vision transformer backbone (DINO), and we use this as a benchmark model for our study. Using WS-DINO, we fine-tuned with weak label information available in high-content microscopy screens (treatment and compound), and achieve state-of-the-art performance in not-same-compound mechanism of action prediction on the BBBC021 dataset (98%), and not-same-compound-and-batch performance (96%) using the compound as the weak label. Our method bypasses single cell cropping as a pre-processing step, and using self-attention maps we show that the model learns structurally meaningful phenotypic profiles. ",
    "url": "https://arxiv.org/abs/2209.07819",
    "authors": [
      "Jan Oscar Cross-Zamirski",
      "Guy Williams",
      "Elizabeth Mouchet",
      "Carola-Bibiane Schönlieb",
      "Riku Turkki",
      "Yinhai Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07834",
    "title": "Entity-based Claim Representation Improves Fact-Checking of Medical  Content in Tweets",
    "abstract": "False medical information on social media poses harm to people's health. While the need for biomedical fact-checking has been recognized in recent years, user-generated medical content has received comparably little attention. At the same time, models for other text genres might not be reusable, because the claims they have been trained with are substantially different. For instance, claims in the SciFact dataset are short and focused: \"Side effects associated with antidepressants increases risk of stroke\". In contrast, social media holds naturally-occurring claims, often embedded in additional context: \"`If you take antidepressants like SSRIs, you could be at risk of a condition called serotonin syndrome' Serotonin syndrome nearly killed me in 2010. Had symptoms of stroke and seizure.\" This showcases the mismatch between real-world medical claims and the input that existing fact-checking systems expect. To make user-generated content checkable by existing models, we propose to reformulate the social-media input in such a way that the resulting claim mimics the claim characteristics in established datasets. To accomplish this, our method condenses the claim with the help of relational entity information and either compiles the claim out of an entity-relation-entity triple or extracts the shortest phrase that contains these elements. We show that the reformulated input improves the performance of various fact-checking models as opposed to checking the tweet text in its entirety. ",
    "url": "https://arxiv.org/abs/2209.07834",
    "authors": [
      "Amelie Wührl",
      "Roman Klinger"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.07837",
    "title": "Topological Structure Learning for Weakly-Supervised Out-of-Distribution  Detection",
    "abstract": "Out-of-distribution (OOD) detection is the key to deploying models safely in the open world. For OOD detection, collecting sufficient in-distribution (ID) labeled data is usually more time-consuming and costly than unlabeled data. When ID labeled data is limited, the previous OOD detection methods are no longer superior due to their high dependence on the amount of ID labeled data. Based on limited ID labeled data and sufficient unlabeled data, we define a new setting called Weakly-Supervised Out-of-Distribution Detection (WSOOD). To solve the new problem, we propose an effective method called Topological Structure Learning (TSL). Firstly, TSL uses a contrastive learning method to build the initial topological structure space for ID and OOD data. Secondly, TSL mines effective topological connections in the initial topological space. Finally, based on limited ID labeled data and mined topological connections, TSL reconstructs the topological structure in a new topological space to increase the separability of ID and OOD instances. Extensive studies on several representative datasets show that TSL remarkably outperforms the state-of-the-art, verifying the validity and robustness of our method in the new setting of WSOOD. ",
    "url": "https://arxiv.org/abs/2209.07837",
    "authors": [
      "Rundong He",
      "Rongxue Li",
      "Zhongyi Han",
      "Yilong Yin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07842",
    "title": "An Overview of Cyber Security and Privacy on the Electric Vehicle  Charging Infrastructure",
    "abstract": "Electric vehicles (EVs) are key to alleviate our dependency on fossil fuels. The future smart grid is expected to be populated by millions of EVs equipped with high-demand batteries. To avoid an overload of the (current) electricity grid, expensive upgrades are required. Some of the upgrades can be averted if users of EVs participate to energy balancing mechanisms, for example through bidirectional EV charging. As the proliferation of consumer Internet-connected devices increases, including EV smart charging stations, their security against cyber-attacks and the protection of private data become a growing concern. We need to properly adapt and develop our current technology that must tackle the security challenges in the EV charging infrastructure, which go beyond the traditional technical applications in the domain of energy and transport networks. Security must balance with other desirable qualities such as interoperability, crypto-agility and energy efficiency. Evidence suggests a gap in the current awareness of cyber security in EV charging infrastructures. This paper fills this gap by providing the most comprehensive to date overview of privacy and security challenges To do so, we review communication protocols used in its ecosystem and provide a suggestion of security tools that might be used for future research. ",
    "url": "https://arxiv.org/abs/2209.07842",
    "authors": [
      "Roberto Metere",
      "Zoya Pourmirza",
      "Sara Walker",
      "Myriam Neaimeh"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.07857",
    "title": "GATraj: A Graph- and Attention-based Multi-Agent Trajectory Prediction  Model",
    "abstract": "Trajectory prediction has been a long-standing problem in intelligent systems such as autonomous driving and robot navigation. Recent state-of-the-art models trained on large-scale benchmarks have been pushing the limit of performance rapidly, mainly focusing on improving prediction accuracy. However, those models put less emphasis on efficiency, which is critical for real-time applications. This paper proposes an attention-based graph model named GATraj with a much higher prediction speed. Spatial-temporal dynamics of agents, e.g., pedestrians or vehicles, are modeled by attention mechanisms. Interactions among agents are modeled by a graph convolutional network. We also implement a Laplacian mixture decoder to mitigate mode collapse and generate diverse multimodal predictions for each agent. Our model achieves performance on par with the state-of-the-art models at a much higher prediction speed tested on multiple open datasets. ",
    "url": "https://arxiv.org/abs/2209.07857",
    "authors": [
      "Hao Cheng",
      "Mengmeng Liu",
      "Lin Chen",
      "Hellward Broszio",
      "Monika Sester",
      "Michael Ying Yang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07860",
    "title": "A $(1.5+ε)$-Approximation Algorithm for Weighted Connectivity  Augmentation",
    "abstract": "Connectivity augmentation problems are among the most elementary questions in Network Design. Many of these problems admit natural $2$-approximation algorithms, often through various classic techniques, whereas it remains open whether approximation factors below $2$ can be achieved. One of the most basic examples thereof is the Weighted Connectivity Augmentation Problem (WCAP). In WCAP, one is given an undirected graph together with a set of additional weighted candidate edges, and the task is to find a cheapest set of candidate edges whose addition to the graph increases its edge-connectivity. We present a $(1.5+\\varepsilon)$-approximation algorithm for WCAP, showing for the first time that factors below $2$ are achievable. On a high level, we design a well-chosen local search algorithm, inspired by recent advances for Weighted Tree Augmentation. To measure progress, we consider a directed weakening of WCAP and show that it has highly structured planar solutions. Interpreting a solution of the original problem as one of this directed weakening allows us to describe local exchange steps in a clean and algorithmically amenable way. Leveraging these insights, we show that we can efficiently search for good exchange steps within a component class for link sets that is closely related to bounded treewidth subgraphs of circle graphs. Moreover, we prove that an optimum solution can be decomposed into smaller components, at least one of which leads to a good local search step as long as we did not yet achieve the claimed approximation guarantee. ",
    "url": "https://arxiv.org/abs/2209.07860",
    "authors": [
      "Vera Traub",
      "Rico Zenklusen"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2209.07869",
    "title": "LogGD:Detecting Anomalies from System Logs by Graph Neural Networks",
    "abstract": "Log analysis is one of the main techniques engineers use to troubleshoot faults of large-scale software systems. During the past decades, many log analysis approaches have been proposed to detect system anomalies reflected by logs. They usually take log event counts or sequential log events as inputs and utilize machine learning algorithms including deep learning models to detect system anomalies. These anomalies are often identified as violations of quantitative relational patterns or sequential patterns of log events in log sequences. However, existing methods fail to leverage the spatial structural relationships among log events, resulting in potential false alarms and unstable performance. In this study, we propose a novel graph-based log anomaly detection method, LogGD, to effectively address the issue by transforming log sequences into graphs. We exploit the powerful capability of Graph Transformer Neural Network, which combines graph structure and node semantics for log-based anomaly detection. We evaluate the proposed method on four widely-used public log datasets. Experimental results show that LogGD can outperform state-of-the-art quantitative-based and sequence-based methods and achieve stable performance under different window size settings. The results confirm that LogGD is effective in log-based anomaly detection. ",
    "url": "https://arxiv.org/abs/2209.07869",
    "authors": [
      "Yongzheng Xie",
      "Hongyu Zhang",
      "Muhammad Ali Babar"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07881",
    "title": "Model Predictive Robustness of Signal Temporal Logic Predicates",
    "abstract": "The robustness of signal temporal logic not only assesses whether a signal adheres to a specification but also provides a measure of how much a formula is fulfilled or violated. The calculation of robustness is based on evaluating the robustness of underlying predicates. However, the robustness of predicates is usually defined in a model-free way, i.e., without including the system dynamics. Moreover, it is often nontrivial to define the robustness of complicated predicates precisely. To address these issues, we propose a notion of model predictive robustness, which provides a more systematic way of evaluating robustness compared to previous approaches by considering model-based predictions. In particular, we use Gaussian process regression to learn the robustness based on precomputed predictions so that robustness values can be efficiently computed online. We evaluate our approach for the use case of autonomous driving with predicates used in formalized traffic rules on a recorded dataset, which highlights the advantage of our approach compared to traditional approaches in terms of expressiveness. By incorporating our robustness definitions into a trajectory planner, autonomous vehicles obey traffic rules more robustly than human drivers in the dataset. ",
    "url": "https://arxiv.org/abs/2209.07881",
    "authors": [
      "Yuanfei Lin",
      "Haoxuan Li",
      "Matthias Althoff"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2209.07896",
    "title": "3D VSG: Long-term Semantic Scene Change Prediction through 3D Variable  Scene Graphs",
    "abstract": "Numerous applications require robots to operate in environments shared with other agents such as humans or other robots. However, such shared scenes are typically subject to different kinds of long-term semantic scene changes. The ability to model and predict such changes is thus crucial for robot autonomy. In this work, we formalize the task of semantic scene variability estimation and identify three main varieties of semantic scene change: changes in the position of an object, its semantic state, or the composition of a scene as a whole. To represent this variability, we propose the Variable Scene Graph (VSG), which augments existing 3D Scene Graph (SG) representations with the variability attribute, representing the likelihood of discrete long-term change events. We present a novel method, DeltaVSG, to estimate the variability of VSGs in a supervised fashion. We evaluate our method on the 3RScan long-term dataset, showing notable improvements in this novel task over existing approaches. Our method DeltaVSG achieves a precision of 72.2% and recall of 66.8%, often mimicking human intuition about how indoor scenes change over time. We further show the utility of VSG predictions in the task of active robotic change detection, speeding up task completion by 62.4% compared to a scene-change-unaware planner. We make our code available as open-source. ",
    "url": "https://arxiv.org/abs/2209.07896",
    "authors": [
      "Samuel Looper",
      "Javier Rodriguez-Puigvert",
      "Roland Siegwart",
      "Cesar Cadena",
      "Lukas Schmid"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07899",
    "title": "Versatile Skill Control via Self-supervised Adversarial Imitation of  Unlabeled Mixed Motions",
    "abstract": "Learning diverse skills is one of the main challenges in robotics. To this end, imitation learning approaches have achieved impressive results. These methods require explicitly labeled datasets or assume consistent skill execution to enable learning and active control of individual behaviors, which limits their applicability. In this work, we propose a cooperative adversarial method for obtaining single versatile policies with controllable skill sets from unlabeled datasets containing diverse state transition patterns by maximizing their discriminability. Moreover, we show that by utilizing unsupervised skill discovery in the generative adversarial imitation learning framework, novel and useful skills emerge with successful task fulfillment. Finally, the obtained versatile policies are tested on an agile quadruped robot called Solo 8 and present faithful replications of diverse skills encoded in the demonstrations. ",
    "url": "https://arxiv.org/abs/2209.07899",
    "authors": [
      "Chenhao Li",
      "Sebastian Blaes",
      "Pavel Kolev",
      "Marin Vlastelica",
      "Jonas Frey",
      "Georg Martius"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07902",
    "title": "MetaMask: Revisiting Dimensional Confounder for Self-Supervised Learning",
    "abstract": "As a successful approach to self-supervised learning, contrastive learning aims to learn invariant information shared among distortions of the input sample. While contrastive learning has yielded continuous advancements in sampling strategy and architecture design, it still remains two persistent defects: the interference of task-irrelevant information and sample inefficiency, which are related to the recurring existence of trivial constant solutions. From the perspective of dimensional analysis, we find out that the dimensional redundancy and dimensional confounder are the intrinsic issues behind the phenomena, and provide experimental evidence to support our viewpoint. We further propose a simple yet effective approach MetaMask, short for the dimensional Mask learned by Meta-learning, to learn representations against dimensional redundancy and confounder. MetaMask adopts the redundancy-reduction technique to tackle the dimensional redundancy issue and innovatively introduces a dimensional mask to reduce the gradient effects of specific dimensions containing the confounder, which is trained by employing a meta-learning paradigm with the objective of improving the performance of masked representations on a typical self-supervised task. We provide solid theoretical analyses to prove MetaMask can obtain tighter risk bounds for downstream classification compared to typical contrastive methods. Empirically, our method achieves state-of-the-art performance on various benchmarks. ",
    "url": "https://arxiv.org/abs/2209.07902",
    "authors": [
      "Jiangmeng Li",
      "Wenwen Qiang",
      "Yanan Zhang",
      "Wenyi Mo",
      "Changwen Zheng",
      "Bing Su",
      "Hui Xiong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07919",
    "title": "iDF-SLAM: End-to-End RGB-D SLAM with Neural Implicit Mapping and Deep  Feature Tracking",
    "abstract": "We propose a novel end-to-end RGB-D SLAM, iDF-SLAM, which adopts a feature-based deep neural tracker as the front-end and a NeRF-style neural implicit mapper as the back-end. The neural implicit mapper is trained on-the-fly, while though the neural tracker is pretrained on the ScanNet dataset, it is also finetuned along with the training of the neural implicit mapper. Under such a design, our iDF-SLAM is capable of learning to use scene-specific features for camera tracking, thus enabling lifelong learning of the SLAM system. Both the training for the tracker and the mapper are self-supervised without introducing ground truth poses. We test the performance of our iDF-SLAM on the Replica and ScanNet datasets and compare the results to the two recent NeRF-based neural SLAM systems. The proposed iDF-SLAM demonstrates state-of-the-art results in terms of scene reconstruction and competitive performance in camera tracking. ",
    "url": "https://arxiv.org/abs/2209.07919",
    "authors": [
      "Yuhang Ming",
      "Weicai Ye",
      "Andrew Calway"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07922",
    "title": "An Attention-guided Multistream Feature Fusion Network for Localization  of Risky Objects in Driving Videos",
    "abstract": "Detecting dangerous traffic agents in videos captured by vehicle-mounted dashboard cameras (dashcams) is essential to facilitate safe navigation in a complex environment. Accident-related videos are just a minor portion of the driving video big data, and the transient pre-accident processes are highly dynamic and complex. Besides, risky and non-risky traffic agents can be similar in their appearance. These make risky object localization in the driving video particularly challenging. To this end, this paper proposes an attention-guided multistream feature fusion network (AM-Net) to localize dangerous traffic agents from dashcam videos. Two Gated Recurrent Unit (GRU) networks use object bounding box and optical flow features extracted from consecutive video frames to capture spatio-temporal cues for distinguishing dangerous traffic agents. An attention module coupled with the GRUs learns to attend to the traffic agents relevant to an accident. Fusing the two streams of features, AM-Net predicts the riskiness scores of traffic agents in the video. In supporting this study, the paper also introduces a benchmark dataset called Risky Object Localization (ROL). The dataset contains spatial, temporal, and categorical annotations with the accident, object, and scene-level attributes. The proposed AM-Net achieves a promising performance of 85.73% AUC on the ROL dataset. Meanwhile, the AM-Net outperforms current state-of-the-art for video anomaly detection by 6.3% AUC on the DoTA dataset. A thorough ablation study further reveals AM-Net's merits by evaluating the contributions of its different components. ",
    "url": "https://arxiv.org/abs/2209.07922",
    "authors": [
      "Muhammad Monjurul Karim",
      "Ruwen Qin",
      "Zhaozheng Yin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07924",
    "title": "GNNInterpreter: A Probabilistic Generative Model-Level Explanation for  Graph Neural Networks",
    "abstract": "Recently, Graph Neural Networks (GNNs) have significantly advanced the performance of machine learning tasks on graphs. However, this technological breakthrough makes people wonder: how does a GNN make such decisions, and can we trust its prediction with high confidence? When it comes to some critical fields such as biomedicine, where making wrong decisions can have severe consequences, interpreting the inner working mechanisms of GNNs before applying them is crucial. In this paper, we propose a novel model-agnostic model-level explanation method for different GNNs that follow the message passing scheme, GNNInterpreter, to explain the high-level decision-making process of the GNN model. More specifically, with continuous relaxation of graphs and the reparameterization trick, GNNInterpreter learns a probabilistic generative graph distribution which produces the most representative graph for the target prediction in the eye of the GNN model. Compared with the only existing work, GNNInterpreter is more computationally efficient and more flexible in generating explanation graphs with different types of node features and edge features, without introducing another blackbox to explain the GNN and without requiring domain-specific knowledge. Additionally, the experimental studies conducted on four different datasets demonstrate that the explanation graph generated by GNNInterpreter can match the desired graph pattern when the model is ideal and reveal potential model pitfalls if there exist any. ",
    "url": "https://arxiv.org/abs/2209.07924",
    "authors": [
      "Xiaoqi Wang",
      "Han-Wei Shen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.07926",
    "title": "Explainability in subgraphs-enhanced Graph Neural Networks",
    "abstract": "Recently, subgraphs-enhanced Graph Neural Networks (SGNNs) have been introduced to enhance the expressive power of Graph Neural Networks (GNNs), which was proved to be not higher than the 1-dimensional Weisfeiler-Leman isomorphism test. The new paradigm suggests using subgraphs extracted from the input graph to improve the model's expressiveness, but the additional complexity exacerbates an already challenging problem in GNNs: explaining their predictions. In this work, we adapt PGExplainer, one of the most recent explainers for GNNs, to SGNNs. The proposed explainer accounts for the contribution of all the different subgraphs and can produce a meaningful explanation that humans can interpret. The experiments that we performed both on real and synthetic datasets show that our framework is successful in explaining the decision process of an SGNN on graph classification tasks. ",
    "url": "https://arxiv.org/abs/2209.07926",
    "authors": [
      "Michele Guerra",
      "Indro Spinelli",
      "Simone Scardapane",
      "Filippo Maria Bianchi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07929",
    "title": "Mining SoC Message Flows with Attention Model",
    "abstract": "High-quality system-level message flow specifications are necessary for comprehensive validation of system-on-chip (SoC) designs. However, manual development and maintenance of such specifications are daunting tasks. We propose a disruptive method that utilizes deep sequence modeling with the attention mechanism to infer accurate flow specifications from SoC communication traces. The proposed method can overcome the inherent complexity of SoC traces induced by the concurrent executions of SoC designs that existing mining tools often find extremely challenging. We conduct experiments on five highly concurrent traces and find that the proposed approach outperforms several existing state-of-the-art trace mining tools. ",
    "url": "https://arxiv.org/abs/2209.07929",
    "authors": [
      "Md Rubel Ahmed",
      "Bardia Nadimi",
      "Hao Zheng"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2209.07937",
    "title": "DPFNet: A Dual-branch Dilated Network with Phase-aware Fourier  Convolution for Low-light Image Enhancement",
    "abstract": "Low-light image enhancement is a classical computer vision problem aiming to recover normal-exposure images from low-light images. However, convolutional neural networks commonly used in this field are good at sampling low-frequency local structural features in the spatial domain, which leads to unclear texture details of the reconstructed images. To alleviate this problem, we propose a novel module using the Fourier coefficients, which can recover high-quality texture details under the constraint of semantics in the frequency phase and supplement the spatial domain. In addition, we design a simple and efficient module for the image spatial domain using dilated convolutions with different receptive fields to alleviate the loss of detail caused by frequent downsampling. We integrate the above parts into an end-to-end dual branch network and design a novel loss committee and an adaptive fusion module to guide the network to flexibly combine spatial and frequency domain features to generate more pleasing visual effects. Finally, we evaluate the proposed network on public benchmarks. Extensive experimental results show that our method outperforms many existing state-of-the-art ones, showing outstanding performance and potential. ",
    "url": "https://arxiv.org/abs/2209.07937",
    "authors": [
      "Yunliang Zhuang",
      "Zhuoran Zheng",
      "Chen Lyu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2209.07943",
    "title": "Traffic Congestion Prediction using Deep Convolutional Neural Networks:  A Color-coding Approach",
    "abstract": "The traffic video data has become a critical factor in confining the state of traffic congestion due to the recent advancements in computer vision. This work proposes a unique technique for traffic video classification using a color-coding scheme before training the traffic data in a Deep convolutional neural network. At first, the video data is transformed into an imagery data set; then, the vehicle detection is performed using the You Only Look Once algorithm. A color-coded scheme has been adopted to transform the imagery dataset into a binary image dataset. These binary images are fed to a Deep Convolutional Neural Network. Using the UCSD dataset, we have obtained a classification accuracy of 98.2%. ",
    "url": "https://arxiv.org/abs/2209.07943",
    "authors": [
      "Mirza Fuad Adnan",
      "Nadim Ahmed",
      "Imrez Ishraque",
      "Md. Sifath Al Amin",
      "Md. Sumit Hasan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.07951",
    "title": "SeqOT: A Spatial-Temporal Transformer Network for Place Recognition  Using Sequential LiDAR Data",
    "abstract": "Place recognition is an important component for autonomous vehicles to achieve loop closing or global localization. In this paper, we tackle the problem of place recognition based on sequential 3D LiDAR scans obtained by an onboard LiDAR sensor. We propose a transformer-based network named SeqOT to exploit the temporal and spatial information provided by sequential range images generated from the LiDAR data. It uses multi-scale transformers to generate a global descriptor for each sequence of LiDAR range images in an end-to-end fashion. During online operation, our SeqOT finds similar places by matching such descriptors between the current query sequence and those stored in the map. We evaluate our approach on four datasets collected with different types of LiDAR sensors in different environments. The experimental results show that our method outperforms the state-of-the-art LiDAR-based place recognition methods and generalizes well across different environments. Furthermore, our method operates online faster than the frame rate of the sensor. The implementation of our method is released as open source at: https://github.com/BIT-MJY/SeqOT. ",
    "url": "https://arxiv.org/abs/2209.07951",
    "authors": [
      "Junyi Ma",
      "Xieyuanli Chen",
      "Jingyi Xu",
      "Guangming Xiong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.07953",
    "title": "StyleGAN Encoder-Based Attack for Block Scrambled Face Images",
    "abstract": "In this paper, we propose an attack method to block scrambled face images, particularly Encryption-then-Compression (EtC) applied images by utilizing the existing powerful StyleGAN encoder and decoder for the first time. Instead of reconstructing identical images as plain ones from encrypted images, we focus on recovering styles that can reveal identifiable information from the encrypted images. The proposed method trains an encoder by using plain and encrypted image pairs with a particular training strategy. While state-of-the-art attack methods cannot recover any perceptual information from EtC images, the proposed method discloses personally identifiable information such as hair color, skin color, eyeglasses, gender, etc. Experiments were carried out on the CelebA dataset, and results show that reconstructed images have some perceptual similarities compared to plain images. ",
    "url": "https://arxiv.org/abs/2209.07953",
    "authors": [
      "AprilPyone MaungMaung",
      "Hitoshi Kiya"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07957",
    "title": "Malicious Source Code Detection Using Transformer",
    "abstract": "Open source code is considered a common practice in modern software development. However, reusing other code allows bad actors to access a wide developers' community, hence the products that rely on it. Those attacks are categorized as supply chain attacks. Recent years saw a growing number of supply chain attacks that leverage open source during software development, relaying the download and installation procedures, whether automatic or manual. Over the years, many approaches have been invented for detecting vulnerable packages. However, it is uncommon to detect malicious code within packages. Those detection approaches can be broadly categorized as analyzes that use (dynamic) and do not use (static) code execution. Here, we introduce Malicious Source code Detection using Transformers (MSDT) algorithm. MSDT is a novel static analysis based on a deep learning method that detects real-world code injection cases to source code packages. In this study, we used MSDT and a dataset with over 600,000 different functions to embed various functions and applied a clustering algorithm to the resulting vectors, detecting the malicious functions by detecting the outliers. We evaluated MSDT's performance by conducting extensive experiments and demonstrated that our algorithm is capable of detecting functions that were injected with malicious code with precision@k values of up to 0.909. ",
    "url": "https://arxiv.org/abs/2209.07957",
    "authors": [
      "Chen Tsfaty",
      "Michael Fire"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07989",
    "title": "CurveFormer: 3D Lane Detection by Curve Propagation with Curve Queries  and Attention",
    "abstract": "3D lane detection is an integral part of autonomous driving systems. Previous CNN and Transformer-based methods usually first generate a bird's-eye-view (BEV) feature map from the front view image, and then use a sub-network with BEV feature map as input to predict 3D lanes. Such approaches require an explicit view transformation between BEV and front view, which itself is still a challenging problem. In this paper, we propose CurveFormer, a single-stage Transformer-based method that directly calculates 3D lane parameters and can circumvent the difficult view transformation step. Specifically, we formulate 3D lane detection as a curve propagation problem by using curve queries. A 3D lane query is represented by a dynamic and ordered anchor point set. In this way, queries with curve representation in Transformer decoder iteratively refine the 3D lane detection results. Moreover, a curve cross-attention module is introduced to compute the similarities between curve queries and image features. Additionally, a context sampling module that can capture more relative image features of a curve query is provided to further boost the 3D lane detection performance. We evaluate our method for 3D lane detection on both synthetic and real-world datasets, and the experimental results show that our method achieves promising performance compared with the state-of-the-art approaches. The effectiveness of each component is validated via ablation studies as well. ",
    "url": "https://arxiv.org/abs/2209.07989",
    "authors": [
      "Yifeng Bai",
      "Zhirong Chen",
      "Zhangjie Fu",
      "Lang Peng",
      "Pengpeng Liang",
      "Erkang Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07999",
    "title": "Self-Supervised Learning with an Information Maximization Criterion",
    "abstract": "Self-supervised learning allows AI systems to learn effective representations from large amounts of data using tasks that do not require costly labeling. Mode collapse, i.e., the model producing identical representations for all inputs, is a central problem to many self-supervised learning approaches, making self-supervised tasks, such as matching distorted variants of the inputs, ineffective. In this article, we argue that a straightforward application of information maximization among alternative latent representations of the same input naturally solves the collapse problem and achieves competitive empirical results. We propose a self-supervised learning method, CorInfoMax, that uses a second-order statistics-based mutual information measure that reflects the level of correlation among its arguments. Maximizing this correlative information measure between alternative representations of the same input serves two purposes: (1) it avoids the collapse problem by generating feature vectors with non-degenerate covariances; (2) it establishes relevance among alternative representations by increasing the linear dependence among them. An approximation of the proposed information maximization objective simplifies to a Euclidean distance-based objective function regularized by the log-determinant of the feature covariance matrix. The regularization term acts as a natural barrier against feature space degeneracy. Consequently, beyond avoiding complete output collapse to a single point, the proposed approach also prevents dimensional collapse by encouraging the spread of information across the whole feature space. Numerical experiments demonstrate that CorInfoMax achieves better or competitive performance results relative to the state-of-the-art SSL approaches. ",
    "url": "https://arxiv.org/abs/2209.07999",
    "authors": [
      "Serdar Ozsoy",
      "Shadi Hamdan",
      "Sercan Ö. Arik",
      "Deniz Yuret",
      "Alper T. Erdogan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Theory (cs.IT)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2209.08000",
    "title": "TIMIT-TTS: a Text-to-Speech Dataset for Multimodal Synthetic Media  Detection",
    "abstract": "With the rapid development of deep learning techniques, the generation and counterfeiting of multimedia material are becoming increasingly straightforward to perform. At the same time, sharing fake content on the web has become so simple that malicious users can create unpleasant situations with minimal effort. Also, forged media are getting more and more complex, with manipulated videos that are taking the scene over still images. The multimedia forensic community has addressed the possible threats that this situation could imply by developing detectors that verify the authenticity of multimedia objects. However, the vast majority of these tools only analyze one modality at a time. This was not a problem as long as still images were considered the most widely edited media, but now, since manipulated videos are becoming customary, performing monomodal analyses could be reductive. Nonetheless, there is a lack in the literature regarding multimodal detectors, mainly due to the scarsity of datasets containing forged multimodal data to train and test the designed algorithms. In this paper we focus on the generation of an audio-visual deepfake dataset. First, we present a general pipeline for synthesizing speech deepfake content from a given real or fake video, facilitating the creation of counterfeit multimodal material. The proposed method uses Text-to-Speech (TTS) and Dynamic Time Warping techniques to achieve realistic speech tracks. Then, we use the pipeline to generate and release TIMIT-TTS, a synthetic speech dataset containing the most cutting-edge methods in the TTS field. This can be used as a standalone audio dataset, or combined with other state-of-the-art sets to perform multimodal research. Finally, we present numerous experiments to benchmark the proposed dataset in both mono and multimodal conditions, showing the need for multimodal forensic detectors and more suitable data. ",
    "url": "https://arxiv.org/abs/2209.08000",
    "authors": [
      "Davide Salvi",
      "Brian Hosler",
      "Paolo Bestagini",
      "Matthew C. Stamm",
      "Stefano Tubaro"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2209.08016",
    "title": "Transformer-based Detection of Multiword Expressions in Flower and Plant  Names",
    "abstract": "Multiword expression (MWE) is a sequence of words which collectively present a meaning which is not derived from its individual words. The task of processing MWEs is crucial in many natural language processing (NLP) applications, including machine translation and terminology extraction. Therefore, detecting MWEs in different domains is an important research topic. In this paper, we explore state-of-the-art neural transformers in the task of detecting MWEs in flower and plant names. We evaluate different transformer models on a dataset created from Encyclopedia of Plants and Flower. We empirically show that transformer models outperform the previous neural models based on long short-term memory (LSTM). ",
    "url": "https://arxiv.org/abs/2209.08016",
    "authors": [
      "Damith Premasiri",
      "Amal Haddad Haddad",
      "Tharindu Ranasinghe",
      "Ruslan Mitkov"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.08064",
    "title": "A Systematic Evaluation of Node Embedding Robustness",
    "abstract": "Node embedding methods map network nodes to low dimensional vectors that can be subsequently used in a variety of downstream prediction tasks. The popularity of these methods has significantly increased in recent years, yet, their robustness to perturbations of the input data is still poorly understood. In this paper, we assess the empirical robustness of node embedding models to random and adversarial poisoning attacks. Our systematic evaluation covers representative embedding methods based on Skip-Gram, matrix factorization, and deep neural networks. We compare edge addition, deletion and rewiring strategies computed using network properties as well as node labels. We also investigate the effect of label homophily and heterophily on robustness. We report qualitative results via embedding visualization and quantitative results in terms of downstream node classification and network reconstruction performances. We found that node classification suffers from higher performance degradation as opposed to network reconstruction, and that degree-based and label-based attacks are on average the most damaging. ",
    "url": "https://arxiv.org/abs/2209.08064",
    "authors": [
      "Alexandru Mara",
      "Jefrey Lijffijt",
      "Stephan Günnemann",
      "Tijl De Bie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.08067",
    "title": "Web Application Weakness Ontology Based on Vulnerability Data",
    "abstract": "Web applications are becoming more ubiquitous. All manner of physical devices are now connected and often have a variety of web applications and web-interfaces. This proliferation of web applications has been accompanied by an increase in reported software vulnerabilities. The objective of this analysis of vulnerability data is to understand the current landscape of reported web application flaws. Along those lines, this work reviews ten years (2011 - 2020) of vulnerability data in the National Vulnerability Database. Based on this data, most common web application weaknesses are identified and their profiles presented. A weakness ontology is developed to capture the attributes of these weaknesses. These include their attack method and attack vectors. Also described is the impact of the weaknesses to software quality attributes. Additionally, the technologies that are susceptible to each weakness are presented, they include programming languages, frameworks, communication protocols, and data formats. ",
    "url": "https://arxiv.org/abs/2209.08067",
    "authors": [
      "Onyeka Ezenwoye",
      "Yi Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Other Computer Science (cs.OH)"
    ]
  },
  {
    "id": "arXiv:2209.08075",
    "title": "Stable Dynamic Predictive Clustering (SDPC) Protocol for Vehicular Ad  hoc Network",
    "abstract": "Vehicular communication is an essential part of a smart city. Scalability is a major issue for vehicular communication, specially, when the number of vehicles increases at any given point. Vehicles also suffer some other problems such as broadcast problem. Clustering can solve the issues of vehicular ad hoc network (VANET); however, due to the high mobility of the vehicles, clustering in VANET suffers stability issue. Previously proposed clustering algorithms for VANET are optimized for either straight road or for intersection. Moreover, the absence of the intelligent use of a combination of the mobility parameters, such as direction, movement, position, velocity, degree of vehicle, movement at the intersection etc., results in cluster stability issues. A dynamic clustering algorithm considering the efficient use of all the mobility parameters can solve the stability problem in VANET. To achieve higher stability for VANET, a novel robust and dynamic clustering algorithm stable dynamic predictive clustering (SDPC) for VANET is proposed in this paper. In contrast to previous studies, vehicle relative velocity, vehicle position, vehicle distance, transmission range, and vehicle density are considered in the creation of a cluster, whereas relative distance, movement at the intersection, degree of vehicles are considered to select the cluster head. From the mobility parameters the future road scenario is constructed. The cluster is created, and the cluster head is selected based on the future construction of the road. The performance of SDPC is compared in terms of the average cluster head change rate, the average cluster head duration, the average cluster member duration, and the ratio of clustering overhead in terms of total packet transmission. The simulation result shows SDPC outperforms the existing algorithms and achieved better clustering stability. ",
    "url": "https://arxiv.org/abs/2209.08075",
    "authors": [
      "Mohammad Mukhtaruzzaman",
      "Mohammed Atiquzzaman"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2209.08086",
    "title": "Motion Detection in Diffraction Tomography by Common Circle Methods",
    "abstract": "The method of common lines is a well-established reconstruction technique in cryogenic electron microscopy (cryo-EM), which can be used to extract the relative orientations of an object in tomographic projection images from different directions. In this paper, we deal with an analogous problem in optical diffraction tomography. Based on the Fourier diffraction theorem, we show that rigid motions, i.e., a map composed of rotations and translations, can be determined by detecting common circles in the Fourier-transformed data. We introduce two methods based on the idea of identifying common circles to reconstruct the object motion: While the first one is motivated by the common line approach for projection images and detects the relative orientation by the shape of the common circles in the two images, the second one assumes a smooth motion over time and calculates the angular velocity of the rotational motion from an infinitesimal version of the common circle method. Interestingly, using the stereographic projection, both methods can be reformulated as common line methods, but these lines are, in contrast to those used in cryo-EM, not confined to pass through the origin and allow for a full reconstruction of the relative orientation. Numerical proof-of-the-concept examples demonstrate the performance of our reconstruction methods. ",
    "url": "https://arxiv.org/abs/2209.08086",
    "authors": [
      "Michael Quellmalz",
      "Peter Elbau",
      "Otmar Scherzer",
      "Gabriele Steidl"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2209.08091",
    "title": "ViWiD: Leveraging WiFi for Robust and Resource-Efficient SLAM",
    "abstract": "Recent interest towards autonomous navigation and exploration robots for indoor applications has spurred research into indoor Simultaneous Localization and Mapping (SLAM) robot systems. While most of these SLAM systems use Visual and LiDAR sensors in tandem with an odometry sensor, these odometry sensors drift over time. To combat this drift, Visual SLAM systems deploy compute and memory intensive search algorithms to detect `Loop Closures', which make the trajectory estimate globally consistent. To circumvent these resource (compute and memory) intensive algorithms, we present ViWiD, which integrates WiFi and Visual sensors in a dual-layered system. This dual-layered approach separates the tasks of local and global trajectory estimation making ViWiD resource efficient while achieving on-par or better performance to state-of-the-art Visual SLAM. We demonstrate ViWiD's performance on four datasets, covering over 1500 m of traversed path and show 4.3x and 4x reduction in compute and memory consumption respectively compared to state-of-the-art Visual and Lidar SLAM systems with on par SLAM performance. ",
    "url": "https://arxiv.org/abs/2209.08091",
    "authors": [
      "Aditya Arun",
      "William Hunter",
      "Roshan Ayyalasomayajula",
      "Dinesh Bharadia"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.07527",
    "title": "Improved proteasomal cleavage prediction with positive-unlabeled  learning",
    "abstract": "Accurate in silico modeling of the antigen processing pathway is crucial to enable personalized epitope vaccine design for cancer. An important step of such pathway is the degradation of the vaccine into smaller peptides by the proteasome, some of which are going to be presented to T cells by the MHC complex. While predicting MHC-peptide presentation has received a lot of attention recently, proteasomal cleavage prediction remains a relatively unexplored area in light of recent advances in high-throughput mass spectrometry-based MHC ligandomics. Moreover, as such experimental techniques do not allow to identify regions that cannot be cleaved, the latest predictors generate synthetic negative samples and treat them as true negatives when training, even though some of them could actually be positives. In this work, we thus present a new predictor trained with an expanded dataset and the solid theoretical underpinning of positive-unlabeled learning, achieving a new state-of-the-art in proteasomal cleavage prediction. The improved predictive capabilities will in turn enable more precise vaccine development improving the efficacy of epitope-based vaccines. Code and pretrained models are available at https://github.com/SchubertLab/proteasomal-cleavage-puupl. ",
    "url": "https://arxiv.org/abs/2209.07527",
    "authors": [
      "Emilio Dorigatti",
      "Bernd Bischl",
      "Benjamin Schubert"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07542",
    "title": "Toward an understanding of the properties of neural network approaches  for supernovae light curve approximation",
    "abstract": "The modern time-domain photometric surveys collect a lot of observations of various astronomical objects, and the coming era of large-scale surveys will provide even more information. Most of the objects have never received a spectroscopic follow-up, which is especially crucial for transients e.g. supernovae. In such cases, observed light curves could present an affordable alternative. Time series are actively used for photometric classification and characterization, such as peak and luminosity decline estimation. However, the collected time series are multidimensional, irregularly sampled, contain outliers, and do not have well-defined systematic uncertainties. Machine learning methods help extract useful information from available data in the most efficient way. We consider several light curve approximation methods based on neural networks: Multilayer Perceptrons, Bayesian Neural Networks, and Normalizing Flows, to approximate observations of a single light curve. Tests using both the simulated PLAsTiCC and real Zwicky Transient Facility data samples demonstrate that even few observations are enough to fit networks and achieve better approximation quality than other state-of-the-art methods. We show that the methods described in this work have better computational complexity and work faster than Gaussian Processes. We analyze the performance of the approximation techniques aiming to fill the gaps in the observations of the light curves, and show that the use of appropriate technique increases the accuracy of peak finding and supernova classification. In addition, the study results are organized in a Fulu Python library available on GitHub, which can be easily used by the community. ",
    "url": "https://arxiv.org/abs/2209.07542",
    "authors": [
      "Mariia Demianenko",
      "Konstantin Malanchev",
      "Ekaterina Samorodova",
      "Mikhail Sysak",
      "Aleksandr Shiriaev",
      "Denis Derkach",
      "Mikhail Hushchyn"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07567",
    "title": "Prediction of $\\textrm{CO}_2$ Adsorption in Nano-Pores with Graph Neural  Networks",
    "abstract": "We investigate the graph-based convolutional neural network approach for predicting and ranking gas adsorption properties of crystalline Metal-Organic Framework (MOF) adsorbents for application in post-combustion capture of $\\textrm{CO}_2$. Our model is based solely on standard structural input files containing atomistic descriptions of the adsorbent material candidates. We construct novel methodological extensions to match the prediction accuracy of classical machine learning models that were built with hundreds of features at much higher computational cost. Our approach can be more broadly applied to optimize gas capture processes at industrial scale. ",
    "url": "https://arxiv.org/abs/2209.07567",
    "authors": [
      "Guojing Cong",
      "Anshul Gupta",
      "Rodrigo Neumann",
      "Maira de Bayser",
      "Mathias Steiner",
      "Breanndán Ó Conchúir"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07568",
    "title": "Physically Constrained Generative Adversarial Networks for Improving  Precipitation Fields from Earth System Models",
    "abstract": "Precipitation results from complex processes across many scales, making its accurate simulation in Earth system models (ESMs) challenging. Existing post-processing methods can improve ESM simulations locally, but cannot correct errors in modelled spatial patterns. Here we propose a framework based on physically constrained generative adversarial networks (GANs) to improve local distributions and spatial structure simultaneously. We apply our approach to the computationally efficient ESM CM2Mc-LPJmL. Our method outperforms existing ones in correcting local distributions, and leads to strongly improved spatial patterns especially regarding the intermittency of daily precipitation. Notably, a double-peaked Intertropical Convergence Zone, a common problem in ESMs, is removed. Enforcing a physical constraint to preserve global precipitation sums, the GAN can generalize to future climate scenarios unseen during training. Feature attribution shows that the GAN identifies regions where the ESM exhibits strong biases. Our method constitutes a general framework for correcting ESM variables and enables realistic simulations at a fraction of the computational costs. ",
    "url": "https://arxiv.org/abs/2209.07568",
    "authors": [
      "Philipp Hess",
      "Markus Drüke",
      "Stefan Petri",
      "Felix M. Strnad",
      "Niklas Boers"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07590",
    "title": "Prediction of Gender from Longitudinal MRI data via Deep Learning on  Adolescent Data Reveals Unique Patterns Associated with Brain Structure and  Change over a Two-year Period",
    "abstract": "Deep learning algorithms for predicting neuroimaging data have shown considerable promise in various applications. Prior work has demonstrated that deep learning models that take advantage of the data's 3D structure can outperform standard machine learning on several learning tasks. However, most prior research in this area has focused on neuroimaging data from adults. Within the Adolescent Brain and Cognitive Development (ABCD) dataset, a large longitudinal development study, we examine structural MRI data to predict gender and identify gender-related changes in brain structure. Results demonstrate that gender prediction accuracy is exceptionally high (>97%) with training epochs >200 and that this accuracy increases with age. Brain regions identified as the most discriminative in the task under study include predominantly frontal areas and the temporal lobe. When evaluating gender predictive changes specific to a two-year increase in age, a broader set of visual, cingulate, and insular regions are revealed. Our findings show a robust gender-related structural brain change pattern, even over a small age range. This suggests that it might be possible to study how the brain changes during adolescence by looking at how these changes are related to different behavioral and environmental factors. ",
    "url": "https://arxiv.org/abs/2209.07590",
    "authors": [
      "Yuda Bi",
      "Anees Abrol",
      "Zening Fu",
      "Jiayu Chen",
      "Jingyu Liu",
      "Vince Calhoun"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2209.07705",
    "title": "Automatic Tumor Segmentation via False Positive Reduction Network for  Whole-Body Multi-Modal PET/CT Images",
    "abstract": "Multi-modality Fluorodeoxyglucose (FDG) positron emission tomography / computed tomography (PET/CT) has been routinely used in the assessment of common cancers, such as lung cancer, lymphoma, and melanoma. This is mainly attributed to the fact that PET/CT combines the high sensitivity for tumor detection of PET and anatomical information from CT. In PET/CT image assessment, automatic tumor segmentation is an important step, and in recent years, deep learning based methods have become the state-of-the-art. Unfortunately, existing methods tend to over-segment the tumor regions and include regions such as the normal high uptake organs, inflammation, and other infections. In this study, we introduce a false positive reduction network to overcome this limitation. We firstly introduced a self-supervised pre-trained global segmentation module to coarsely delineate the candidate tumor regions using a self-supervised pre-trained encoder. The candidate tumor regions were then refined by removing false positives via a local refinement module. Our experiments with the MICCAI 2022 Automated Lesion Segmentation in Whole-Body FDG-PET/CT (AutoPET) challenge dataset showed that our method achieved a dice score of 0.9324 with the preliminary testing data and was ranked 1st place in dice on the leaderboard. Our method was also ranked in the top 7 methods on the final testing data, the final ranking will be announced during the 2022 MICCAI AutoPET workshop. Our code is available at: https://github.com/YigePeng/AutoPET_False_Positive_Reduction. ",
    "url": "https://arxiv.org/abs/2209.07705",
    "authors": [
      "Yige Peng",
      "Jinman Kim",
      "Dagan Feng",
      "Lei Bi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07970",
    "title": "Causal Fourier Analysis on Directed Acyclic Graphs and Posets",
    "abstract": "We present a novel form of Fourier analysis, and associated signal processing concepts, for signals (or data) indexed by edge-weighted directed acyclic graphs (DAGs). This means that our Fourier basis yields an eigendecomposition of a suitable notion of shift and convolution operators that we define. DAGs are the common model to capture causal relationships between data and our framework is causal in that shift, convolution, and Fourier transform are computed only from predecessors in the DAG. The Fourier transform requires the transitive closure of the DAG for which several forms are possible depending on the interpretation of the edge weights. Examples include level of influence, distance, or pollution distribution. Our framework is different from prior GSP: it is specific to DAGs and leverages, and extends, the classical theory of Moebius inversion from combinatorics. For a prototypical application we consider DAGs modeling dynamic networks in which edges change over time. Specifically, we model the spread of an infection on such a DAG obtained from real-world contact tracing data and learn the infection signal from samples assuming sparsity in the Fourier domain. ",
    "url": "https://arxiv.org/abs/2209.07970",
    "authors": [
      "Bastian Seifert",
      "Chris Wendler",
      "Markus Püschel"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Discrete Mathematics (cs.DM)",
      "Machine Learning (cs.LG)",
      "Combinatorics (math.CO)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2209.08004",
    "title": "Robust Inference of Manifold Density and Geometry by Doubly Stochastic  Scaling",
    "abstract": "The Gaussian kernel and its traditional normalizations (e.g., row-stochastic) are popular approaches for assessing similarities between data points, commonly used for manifold learning and clustering, as well as supervised and semi-supervised learning on graphs. In many practical situations, the data can be corrupted by noise that prohibits traditional affinity matrices from correctly assessing similarities, especially if the noise magnitudes vary considerably across the data, e.g., under heteroskedasticity or outliers. An alternative approach that provides a more stable behavior under noise is the doubly stochastic normalization of the Gaussian kernel. In this work, we investigate this normalization in a setting where points are sampled from an unknown density on a low-dimensional manifold embedded in high-dimensional space and corrupted by possibly strong, non-identically distributed, sub-Gaussian noise. We establish the pointwise concentration of the doubly stochastic affinity matrix and its scaling factors around certain population forms. We then utilize these results to develop several tools for robust inference. First, we derive a robust density estimator that can substantially outperform the standard kernel density estimator under high-dimensional noise. Second, we provide estimators for the pointwise noise magnitudes, the pointwise signal magnitudes, and the pairwise Euclidean distances between clean data points. Lastly, we derive robust graph Laplacian normalizations that approximate popular manifold Laplacians, including the Laplace Beltrami operator, showing that the local geometry of the manifold can be recovered under high-dimensional noise. We exemplify our results in simulations and on real single-cell RNA-sequencing data. In the latter, we show that our proposed normalizations are robust to technical variability associated with different cell types. ",
    "url": "https://arxiv.org/abs/2209.08004",
    "authors": [
      "Boris Landa",
      "Xiuyuan Cheng"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.08030",
    "title": "Detection of Interacting Variables for Generalized Linear Models via  Neural Networks",
    "abstract": "The quality of generalized linear models (GLMs), frequently used by insurance companies, depends on the choice of interacting variables. The search for interactions is time-consuming, especially for data sets with a large number of variables, depends much on expert judgement of actuaries, and often relies on visual performance indicators. Therefore, we present an approach to automating the process of finding interactions that should be added to GLMs to improve their predictive power. Our approach relies on neural networks and a model-specific interaction detection method, which is computationally faster than the traditionally used methods like Friedman H-Statistic or SHAP values. In numerical studies, we provide the results of our approach on different data sets: open-source data, artificial data, and proprietary data. ",
    "url": "https://arxiv.org/abs/2209.08030",
    "authors": [
      "Yevhen Havrylenko",
      "Julia Heger"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:1808.00054",
    "title": "Modeling Task Effects in Human Reading with Neural Network-based  Attention",
    "abstract": " Comments: Accepted by Cognition ",
    "url": "https://arxiv.org/abs/1808.00054",
    "authors": [
      "Michael Hahn",
      "Frank Keller"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:1906.07430",
    "title": "Orienting undirected phylogenetic networks",
    "abstract": " Title: Orienting undirected phylogenetic networks ",
    "url": "https://arxiv.org/abs/1906.07430",
    "authors": [
      "Katharina T. Huber",
      "Leo van Iersel",
      "Remie Janssen",
      "Mark Jones",
      "Vincent Moulton",
      "Yukihiro Murakami",
      "Charles Semple"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)",
      "Populations and Evolution (q-bio.PE)"
    ]
  },
  {
    "id": "arXiv:1911.00569",
    "title": "Mitigating the Effects of Non-Identifiability on Inference for Bayesian  Neural Networks with Latent Variables",
    "abstract": " Comments: Accepted at JMLR 2022. Previously accepted at ICML's Uncertainty and Robustness in Deep Learning Workshop 2019 ",
    "url": "https://arxiv.org/abs/1911.00569",
    "authors": [
      "Yaniv Yacoby",
      "Weiwei Pan",
      "Finale Doshi-Velez"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2007.14672",
    "title": "Stylized Adversarial Defense",
    "abstract": " Comments: IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) ",
    "url": "https://arxiv.org/abs/2007.14672",
    "authors": [
      "Muzammal Naseer",
      "Salman Khan",
      "Munawar Hayat",
      "Fahad Shahbaz Khan",
      "Fatih Porikli"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2009.05679",
    "title": "Strengthening Order Preserving Encryption with Differential Privacy",
    "abstract": " Title: Strengthening Order Preserving Encryption with Differential Privacy ",
    "url": "https://arxiv.org/abs/2009.05679",
    "authors": [
      "Amrita Roy Chowdhury",
      "Bolin Ding",
      "Somesh Jha",
      "Weiran Liu",
      "Jingren Zhou"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2011.00753",
    "title": "BayesBeat: Reliable Atrial Fibrillation Detection from Noisy  Photoplethysmography Data",
    "abstract": " Comments: IMWUT March 2022, Vol 6 Article 8 (UbiComp 2022) ",
    "url": "https://arxiv.org/abs/2011.00753",
    "authors": [
      "Sarkar Snigdha Sarathi Das",
      "Subangkar Karmaker Shanto",
      "Masum Rahman",
      "Md. Saiful Islam",
      "Atif Rahman",
      "Mohammad Mehedy Masud",
      "Mohammed Eunus Ali"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2103.09151",
    "title": "Adversarial Driving: Attacking End-to-End Autonomous Driving",
    "abstract": " Comments: 7 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2103.09151",
    "authors": [
      "Han Wu",
      "Syed Yunas",
      "Sareh Rowlands",
      "Wenjie Ruan",
      "Johan Wahlstrom"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2104.00186",
    "title": "Sub-GMN: The Neural Subgraph Matching Network Model",
    "abstract": " Title: Sub-GMN: The Neural Subgraph Matching Network Model ",
    "url": "https://arxiv.org/abs/2104.00186",
    "authors": [
      "Zixun Lan",
      "Limin Yu",
      "Linglong Yuan",
      "Zili Wu",
      "Qiang Niu",
      "Fei Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2108.09033",
    "title": "UnSplit: Data-Oblivious Model Inversion, Model Stealing, and Label  Inference Attacks Against Split Learning",
    "abstract": " Comments: Proceedings of the 21st Workshop on Privacy in the Electronic Society (WPES '22), November 7, 2022, Los Angeles, CA, USA ",
    "url": "https://arxiv.org/abs/2108.09033",
    "authors": [
      "Ege Erdogan",
      "Alptekin Kupcu",
      "A. Ercument Cicek"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.09052",
    "title": "SplitGuard: Detecting and Mitigating Training-Hijacking Attacks in Split  Learning",
    "abstract": " Comments: Proceedings of the 21st Workshop on Privacy in the Electronic Society (WPES '22), November 7, 2022, Los Angeles, CA, USA ",
    "url": "https://arxiv.org/abs/2108.09052",
    "authors": [
      "Ege Erdogan",
      "Alptekin Kupcu",
      "A. Ercument Cicek"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.02970",
    "title": "Fast and Accurate End-to-End Span-based Semantic Role Labeling as  Word-based Graph Parsing",
    "abstract": " Comments: COLING 2022 ",
    "url": "https://arxiv.org/abs/2112.02970",
    "authors": [
      "Shilin Zhou",
      "Qingrong Xia",
      "Zhenghua Li",
      "Yu Zhang",
      "Yu Hong",
      "Min Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.04389",
    "title": "Modeling and estimating mixed memberships in weighted networks",
    "abstract": " Comments: 23 pages, 13 figures, 2 tabels, comments are welcome ",
    "url": "https://arxiv.org/abs/2112.04389",
    "authors": [
      "Huan Qing"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Physics and Society (physics.soc-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.09231",
    "title": "Two-view Graph Neural Networks for Knowledge Graph Completion",
    "abstract": " Comments: 13 pages; 3 tables; 3 figures ",
    "url": "https://arxiv.org/abs/2112.09231",
    "authors": [
      "Vinh Tong",
      "Dai Quoc Nguyen",
      "Dinh Phung",
      "Dat Quoc Nguyen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.11833",
    "title": "Deep learning for brain metastasis detection and segmentation in  longitudinal MRI data",
    "abstract": " Comments: Implementation is available to public at this https URL ",
    "url": "https://arxiv.org/abs/2112.11833",
    "authors": [
      "Yixing Huang",
      "Christoph Bert",
      "Philipp Sommer",
      "Benjamin Frey",
      "Udo Gaipl",
      "Luitpold V. Distel",
      "Thomas Weissmann",
      "Michael Uder",
      "Manuel A. Schmidt",
      "Arnd Dörfler",
      "Andreas Maier",
      "Rainer Fietkau",
      "Florian Putz"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.13199",
    "title": "A Spectral Method for Joint Community Detection and Orthogonal Group  Synchronization",
    "abstract": " Title: A Spectral Method for Joint Community Detection and Orthogonal Group  Synchronization ",
    "url": "https://arxiv.org/abs/2112.13199",
    "authors": [
      "Yifeng Fan",
      "Yuehaw Khoo",
      "Zhizhen Zhao"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2201.04286",
    "title": "Evolutionary Action Selection for Gradient-based Policy Learning",
    "abstract": " Title: Evolutionary Action Selection for Gradient-based Policy Learning ",
    "url": "https://arxiv.org/abs/2201.04286",
    "authors": [
      "Yan Ma",
      "Tianxing Liu",
      "Bingsheng Wei",
      "Yi Liu",
      "Kang Xu",
      "Wei Li"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.09694",
    "title": "Scaling Up Knowledge Graph Creation to Large and Heterogeneous Data  Sources",
    "abstract": " Title: Scaling Up Knowledge Graph Creation to Large and Heterogeneous Data  Sources ",
    "url": "https://arxiv.org/abs/2201.09694",
    "authors": [
      "Enrique Iglesias",
      "Samaneh Jozashoori",
      "Maria-Esther Vidal"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2201.12231",
    "title": "Overcoming Exploration: Deep Reinforcement Learning in Complex  Environments from Temporal Logic Specifications",
    "abstract": " Title: Overcoming Exploration: Deep Reinforcement Learning in Complex  Environments from Temporal Logic Specifications ",
    "url": "https://arxiv.org/abs/2201.12231",
    "authors": [
      "Mingyu Cai",
      "Erfan Aasi",
      "Calin Belta",
      "Cristian-Ioan Vasile"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04528",
    "title": "Multimodal Audio-Visual Information Fusion using Canonical-Correlated  Graph Neural Network for Energy-Efficient Speech Enhancement",
    "abstract": " Title: Multimodal Audio-Visual Information Fusion using Canonical-Correlated  Graph Neural Network for Energy-Efficient Speech Enhancement ",
    "url": "https://arxiv.org/abs/2202.04528",
    "authors": [
      "Leandro Aparecido Passos",
      "João Paulo Papa",
      "Javier Del Ser",
      "Amir Hussain",
      "Ahsan Adeel"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2202.05592",
    "title": "Video-driven Neural Physically-based Facial Asset for Production",
    "abstract": " Comments: For project page, see this https URL Notice: You may not copy, reproduce, distribute, publish, display, perform, modify, create derivative works, transmit, or in any way exploit any such content, nor may you distribute any part of this content over any network, including a local area network, sell or offer it for sale, or use such content to construct any kind of database ",
    "url": "https://arxiv.org/abs/2202.05592",
    "authors": [
      "Longwen Zhang",
      "Chuxiao Zeng",
      "Qixuan Zhang",
      "Hongyang Lin",
      "Ruixiang Cao",
      "Wei Yang",
      "Lan Xu",
      "Jingyi Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.09553",
    "title": "Holistic Attention-Fusion Adversarial Network for Single Image Defogging",
    "abstract": " Comments: 13 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2202.09553",
    "authors": [
      "Wei Liu",
      "Cheng Chen",
      "Rui Jiang",
      "Tao Lu",
      "Zixiang Xiong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.09056",
    "title": "Robust Table Detection and Structure Recognition from Heterogeneous  Document Images",
    "abstract": " Comments: Accepted by Pattern Recognition on 27 Aug. 2022 ",
    "url": "https://arxiv.org/abs/2203.09056",
    "authors": [
      "Chixiang Ma",
      "Weihong Lin",
      "Lei Sun",
      "Qiang Huo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.14899",
    "title": "Properties and Performance of the ABCDe Random Graph Model with  Community Structure",
    "abstract": " Comments: 15 pages, 10 figures, 1 table ",
    "url": "https://arxiv.org/abs/2203.14899",
    "authors": [
      "Bogumił Kamiński",
      "Tomasz Olczak",
      "Bartosz Pankratz",
      "Paweł Prałat",
      "François Théberge"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2204.05365",
    "title": "PolyARBerNN: A Neural Network Guided Solver and Optimizer for Bounded  Polynomial Inequalities",
    "abstract": " Title: PolyARBerNN: A Neural Network Guided Solver and Optimizer for Bounded  Polynomial Inequalities ",
    "url": "https://arxiv.org/abs/2204.05365",
    "authors": [
      "Wael Fatnassi",
      "Yasser shoukry"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.07275",
    "title": "Incremental Prompting: Episodic Memory Prompt for Lifelong Event  Detection",
    "abstract": " Comments: Accepted to COLING'22 Main Conference (Short paper). 9 pages, 2 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2204.07275",
    "authors": [
      "Minqian Liu",
      "Shiyu Chang",
      "Lifu Huang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10822",
    "title": "Robust and efficient primal-dual Newton-Krylov solvers for  viscous-plastic sea-ice models",
    "abstract": " Comments: 18 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2204.10822",
    "authors": [
      "Yu-hsuan Shih",
      "Carolin Mehlmann",
      "Martin Losch",
      "Georg Stadler"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2205.13705",
    "title": "Heterogeneous Collaborative Learning for Personalized Healthcare  Analytics via Messenger Distillation",
    "abstract": " Title: Heterogeneous Collaborative Learning for Personalized Healthcare  Analytics via Messenger Distillation ",
    "url": "https://arxiv.org/abs/2205.13705",
    "authors": [
      "Guanhua Ye",
      "Tong Chen",
      "Yawen Li",
      "Lizhen Cui",
      "Quoc Viet Hung Nguyen",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2206.05782",
    "title": "DSCA: A Dual-Stream Network with Cross-Attention on Whole-Slide Image  Pyramids for Cancer Prognosis",
    "abstract": " Comments: 12 pages, 6 figures, 7 tables ",
    "url": "https://arxiv.org/abs/2206.05782",
    "authors": [
      "Pei Liu",
      "Bo Fu",
      "Feng Ye",
      "Rui Yang",
      "Bin Xu",
      "Luping Ji"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13728",
    "title": "Boosting R-CNN: Reweighting R-CNN Samples by RPN's Error for Underwater  Object Detection",
    "abstract": " Comments: The data have some mistakes ",
    "url": "https://arxiv.org/abs/2206.13728",
    "authors": [
      "Pinhao Song",
      "Hong Liu",
      "Linhui Dai",
      "Tao Wang",
      "Zhan Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.14663",
    "title": "Going Off-Grid: Continuous Implicit Neural Representations for 3D  Vascular Modeling",
    "abstract": " Comments: MICCAI STACOM 2022 ",
    "url": "https://arxiv.org/abs/2207.14663",
    "authors": [
      "Dieuwertje Alblas",
      "Christoph Brune",
      "Kak Khee Yeung",
      "Jelmer M. Wolterink"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.01003",
    "title": "What can be learnt with wide convolutional networkds?",
    "abstract": " Title: What can be learnt with wide convolutional networkds? ",
    "url": "https://arxiv.org/abs/2208.01003",
    "authors": [
      "Francesco Cagnetta",
      "Alessandro Favero",
      "Matthieu Wyart"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03309",
    "title": "Lethal Dose Conjecture on Data Poisoning",
    "abstract": " Comments: 36th Conference on Neural Information Processing Systems (NeurIPS 2022) ",
    "url": "https://arxiv.org/abs/2208.03309",
    "authors": [
      "Wenxiao Wang",
      "Alexander Levine",
      "Soheil Feizi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.04580",
    "title": "More Interpretable Graph Similarity Computation via Maximum Common  Subgraph Inference",
    "abstract": " Title: More Interpretable Graph Similarity Computation via Maximum Common  Subgraph Inference ",
    "url": "https://arxiv.org/abs/2208.04580",
    "authors": [
      "Zixun Lan",
      "Binjie Hong",
      "Ye Ma",
      "Fei Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.07174",
    "title": "A Man-in-the-Middle Attack against Object Detection Systems",
    "abstract": " Comments: 7 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2208.07174",
    "authors": [
      "Han Wu",
      "Sareh Rowlands",
      "Johan Wahlstrom"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.08094",
    "title": "SelF-Eval: Self-supervised Fine-grained Dialogue Evaluation",
    "abstract": " Comments: 11 pages, 2 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2208.08094",
    "authors": [
      "Longxuan Ma",
      "Ziyu Zhuang",
      "Weinan Zhang",
      "Mingda Li",
      "Ting Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.13070",
    "title": "Self-Supervised Face Presentation Attack Detection with Dynamic  Grayscale Snippets",
    "abstract": " Title: Self-Supervised Face Presentation Attack Detection with Dynamic  Grayscale Snippets ",
    "url": "https://arxiv.org/abs/2208.13070",
    "authors": [
      "Usman Muhammad",
      "Mourad Oussalah"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.14845",
    "title": "Listen to your heart: A self-supervised approach for detecting murmur in  heart-beat sounds",
    "abstract": " Comments: To be published in the proceedings of CinC 2022 (this https URL). This is a preprint version of the final paper ",
    "url": "https://arxiv.org/abs/2208.14845",
    "authors": [
      "Aristotelis Ballas",
      "Vasileios Papapanagiotou",
      "Anastasios Delopoulos",
      "Christos Diou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2209.01205",
    "title": "Hierarchical Relational Learning for Few-Shot Knowledge Graph Completion",
    "abstract": " Comments: 10 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2209.01205",
    "authors": [
      "Han Wu",
      "Jie Yin",
      "Bala Rajaratnam",
      "Jianyuan Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.01765",
    "title": "Continuous Decomposition of Granularity for Neural Paraphrase Generation",
    "abstract": " Comments: Accepted to be published in COLING 2022 ",
    "url": "https://arxiv.org/abs/2209.01765",
    "authors": [
      "Xiaodong Gu",
      "Zhaowei Zhang",
      "Sang-Woo Lee",
      "Kang Min Yoo",
      "Jung-Woo Ha"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.01962",
    "title": "Adversarial Detection: Attacking Object Detection in Real Time",
    "abstract": " Comments: 7 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2209.01962",
    "authors": [
      "Han Wu",
      "Syed Yunas",
      "Sareh Rowlands",
      "Wenjie Ruan",
      "Johan Wahlstrom"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.02390",
    "title": "ProjB: An Improved Bilinear Biased ProjE model for Knowledge Graph  Completion",
    "abstract": " Title: ProjB: An Improved Bilinear Biased ProjE model for Knowledge Graph  Completion ",
    "url": "https://arxiv.org/abs/2209.02390",
    "authors": [
      "Mojtaba Moattari",
      "Sahar Vahdati",
      "Farhana Zulkernine"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.03151",
    "title": "MRF-PINN: A Multi-Receptive-Field convolutional physics-informed neural  network for solving partial differential equations",
    "abstract": " Title: MRF-PINN: A Multi-Receptive-Field convolutional physics-informed neural  network for solving partial differential equations ",
    "url": "https://arxiv.org/abs/2209.03151",
    "authors": [
      "Shihong Zhang",
      "Chi Zhang",
      "Bosen Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Analysis of PDEs (math.AP)",
      "Computational Physics (physics.comp-ph)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2209.05040",
    "title": "SANCL: Multimodal Review Helpfulness Prediction with Selective Attention  and Natural Contrastive Learning",
    "abstract": " Comments: Accepted as a long paper at COLING 2022 ",
    "url": "https://arxiv.org/abs/2209.05040",
    "authors": [
      "Wei Han",
      "Hui Chen",
      "Zhen Hai",
      "Soujanya Poria",
      "Lidong Bing"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.06152",
    "title": "Mandator and Sporades: Robust Wide-Area Consensus with Efficient Request  Dissemination",
    "abstract": " Title: Mandator and Sporades: Robust Wide-Area Consensus with Efficient Request  Dissemination ",
    "url": "https://arxiv.org/abs/2209.06152",
    "authors": [
      "Pasindu Tennage",
      "Antoine Desjardins",
      "Eleftherios Kokoris Kogias"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2209.06420",
    "title": "Robust ab initio solution of the cryo-EM reconstruction problem at low  resolution with small data sets",
    "abstract": " Comments: 39 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2209.06420",
    "authors": [
      "Aaditya V. Rangan",
      "Leslie Greengard"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2209.07067",
    "title": "Efficient learning of nonlinear prediction models with time-series  privileged information",
    "abstract": " Title: Efficient learning of nonlinear prediction models with time-series  privileged information ",
    "url": "https://arxiv.org/abs/2209.07067",
    "authors": [
      "Bastian Jung",
      "Fredrik D Johansson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.07211",
    "title": "On the acceptance by code reviewers of candidate security patches  suggested by Automated Program Repair tools",
    "abstract": " Title: On the acceptance by code reviewers of candidate security patches  suggested by Automated Program Repair tools ",
    "url": "https://arxiv.org/abs/2209.07211",
    "authors": [
      "Aurora Papotti",
      "Ranindya Paramitha",
      "Fabio Massacci"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2209.07216",
    "title": "TempoWiC: An Evaluation Benchmark for Detecting Meaning Shift in Social  Media",
    "abstract": " Comments: Accepted to COLING 2022. Used to create the TempoWiC Shared Task for EvoNLP ",
    "url": "https://arxiv.org/abs/2209.07216",
    "authors": [
      "Daniel Loureiro",
      "Aminette D'Souza",
      "Areej Nasser Muhajab",
      "Isabella A. White",
      "Gabriel Wong",
      "Luis Espinosa Anke",
      "Leonardo Neves",
      "Francesco Barbieri",
      "Jose Camacho-Collados"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.07299",
    "title": "Knowledge Is Flat: A Seq2Seq Generative Framework for Various Knowledge  Graph Completion",
    "abstract": " Comments: COLING 2022 Main Conference ",
    "url": "https://arxiv.org/abs/2209.07299",
    "authors": [
      "Chen Chen",
      "Yufei Wang",
      "Bing Li",
      "Kwok-Yan Lam"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.07459",
    "title": "A Robotic Visual Grasping Design: Rethinking Convolution Neural Network  with High-Resolutions",
    "abstract": " Title: A Robotic Visual Grasping Design: Rethinking Convolution Neural Network  with High-Resolutions ",
    "url": "https://arxiv.org/abs/2209.07459",
    "authors": [
      "Zhangli Zhou",
      "Shaochen Wang",
      "Ziyang Chen",
      "Mingyu Cai",
      "Zhen Kan"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07479",
    "title": "Gollum: A Gold Standard for Large Scale Multi Source Knowledge Graph  Matching",
    "abstract": " Comments: accepted at AKBC 2022 ",
    "url": "https://arxiv.org/abs/2209.07479",
    "authors": [
      "Sven Hertling",
      "Heiko Paulheim"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  }
]