[
  {
    "id": "arXiv:2212.14049",
    "title": "Differentiable Search of Accurate and Robust Architectures",
    "abstract": "Deep neural networks (DNNs) are found to be vulnerable to adversarial attacks, and various methods have been proposed for the defense. Among these methods, adversarial training has been drawing increasing attention because of its simplicity and effectiveness. However, the performance of the adversarial training is greatly limited by the architectures of target DNNs, which often makes the resulting DNNs with poor accuracy and unsatisfactory robustness. To address this problem, we propose DSARA to automatically search for the neural architectures that are accurate and robust after adversarial training. In particular, we design a novel cell-based search space specially for adversarial training, which improves the accuracy and the robustness upper bound of the searched architectures by carefully designing the placement of the cells and the proportional relationship of the filter numbers. Then we propose a two-stage search strategy to search for both accurate and robust neural architectures. At the first stage, the architecture parameters are optimized to minimize the adversarial loss, which makes full use of the effectiveness of the adversarial training in enhancing the robustness. At the second stage, the architecture parameters are optimized to minimize both the natural loss and the adversarial loss utilizing the proposed multi-objective adversarial training method, so that the searched neural architectures are both accurate and robust. We evaluate the proposed algorithm under natural data and various adversarial attacks, which reveals the superiority of the proposed method in terms of both accurate and robust architectures. We also conclude that accurate and robust neural architectures tend to deploy very different structures near the input and the output, which has great practical significance on both hand-crafting and automatically designing of accurate and robust neural architectures. ",
    "url": "https://arxiv.org/abs/2212.14049",
    "authors": [
      "Yuwei Ou",
      "Xiangning Xie",
      "Shangce Gao",
      "Yanan Sun",
      "Kay Chen Tan",
      "Jiancheng Lv"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2212.14071",
    "title": "Large-Scale Cell-Level Quality of Service Estimation on 5G Networks  Using Machine Learning Techniques",
    "abstract": "This study presents a general machine learning framework to estimate the traffic-measurement-level experience rate at given throughput values in the form of a Key Performance Indicator for the cells on base stations across various cities, using busy-hour counter data, and several technical parameters together with the network topology. Relying on feature engineering techniques, scores of additional predictors are proposed to enhance the effects of raw correlated counter values over the corresponding targets, and to represent the underlying interactions among groups of cells within nearby spatial locations effectively. An end-to-end regression modeling is applied on the transformed data, with results presented on unseen cities of varying sizes. ",
    "url": "https://arxiv.org/abs/2212.14071",
    "authors": [
      "M. Tuğberk İşyapar",
      "Ufuk Uyan",
      "Mahiye Uluyağmur Öztürk"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2212.14077",
    "title": "A Hypergraph Neural Network Framework for Learning Hyperedge-Dependent  Node Embeddings",
    "abstract": "In this work, we introduce a hypergraph representation learning framework called Hypergraph Neural Networks (HNN) that jointly learns hyperedge embeddings along with a set of hyperedge-dependent embeddings for each node in the hypergraph. HNN derives multiple embeddings per node in the hypergraph where each embedding for a node is dependent on a specific hyperedge of that node. Notably, HNN is accurate, data-efficient, flexible with many interchangeable components, and useful for a wide range of hypergraph learning tasks. We evaluate the effectiveness of the HNN framework for hyperedge prediction and hypergraph node classification. We find that HNN achieves an overall mean gain of 7.72% and 11.37% across all baseline models and graphs for hyperedge prediction and hypergraph node classification, respectively. ",
    "url": "https://arxiv.org/abs/2212.14077",
    "authors": [
      "Ryan Aponte",
      "Ryan A. Rossi",
      "Shunan Guo",
      "Jane Hoffswell",
      "Nedim Lipka",
      "Chang Xiao",
      "Gromit Chan",
      "Eunyee Koh",
      "Nesreen Ahmed"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Discrete Mathematics (cs.DM)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2212.14099",
    "title": "Curator: Creating Large-Scale Curated Labelled Datasets using  Self-Supervised Learning",
    "abstract": "Applying Machine learning to domains like Earth Sciences is impeded by the lack of labeled data, despite a large corpus of raw data available in such domains. For instance, training a wildfire classifier on satellite imagery requires curating a massive and diverse dataset, which is an expensive and time-consuming process that can span from weeks to months. Searching for relevant examples in over 40 petabytes of unlabelled data requires researchers to manually hunt for such images, much like finding a needle in a haystack. We present a no-code end-to-end pipeline, Curator, which dramatically minimizes the time taken to curate an exhaustive labeled dataset. Curator is able to search massive amounts of unlabelled data by combining self-supervision, scalable nearest neighbor search, and active learning to learn and differentiate image representations. The pipeline can also be readily applied to solve problems across different domains. Overall, the pipeline makes it practical for researchers to go from just one reference image to a comprehensive dataset in a diminutive span of time. ",
    "url": "https://arxiv.org/abs/2212.14099",
    "authors": [
      "Tarun Narayanan",
      "Ajay Krishnan",
      "Anirudh Koul",
      "Siddha Ganju"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14100",
    "title": "Leveraging World Knowledge in Implicit Hate Speech Detection",
    "abstract": "While much attention has been paid to identifying explicit hate speech, implicit hateful expressions that are disguised in coded or indirect language are pervasive and remain a major challenge for existing hate speech detection systems. This paper presents the first attempt to apply Entity Linking (EL) techniques to both explicit and implicit hate speech detection, where we show that such real world knowledge about entity mentions in a text does help models better detect hate speech, and the benefit of adding it into the model is more pronounced when explicit entity triggers (e.g., rally, KKK) are present. We also discuss cases where real world knowledge does not add value to hate speech detection, which provides more insights into understanding and modeling the subtleties of hate speech. ",
    "url": "https://arxiv.org/abs/2212.14100",
    "authors": [
      "Jessica Lin"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.14102",
    "title": "Customizing Knowledge Graph Embedding to Improve Clinical Study  Recommendation",
    "abstract": "Inferring knowledge from clinical trials using knowledge graph embedding is an emerging area. However, customizing graph embeddings for different use cases remains a significant challenge. We propose custom2vec, an algorithmic framework to customize graph embeddings by incorporating user preferences in training the embeddings. It captures user preferences by adding custom nodes and links derived from manually vetted results of a separate information retrieval method. We propose a joint learning objective to preserve the original network structure while incorporating the user's custom annotations. We hypothesize that the custom training improves user-expected predictions, for example, in link prediction tasks. We demonstrate the effectiveness of custom2vec for clinical trials related to non-small cell lung cancer (NSCLC) with two customization scenarios: recommending immuno-oncology trials evaluating PD-1 inhibitors and exploring similar trials that compare new therapies with a standard of care. The results show that custom2vec training achieves better performance than the conventional training methods. Our approach is a novel way to customize knowledge graph embeddings and enable more accurate recommendations and predictions. ",
    "url": "https://arxiv.org/abs/2212.14102",
    "authors": [
      "Xiong Liu",
      "Iya Khalil",
      "Murthy Devarakonda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2212.14106",
    "title": "Robust Ranking Explanations",
    "abstract": "Gradient-based explanation is the cornerstone of explainable deep networks, but it has been shown to be vulnerable to adversarial attacks. However, existing works measure the explanation robustness based on $\\ell_p$-norm, which can be counter-intuitive to humans, who only pay attention to the top few salient features. We propose explanation ranking thickness as a more suitable explanation robustness metric. We then present a new practical adversarial attacking goal for manipulating explanation rankings. To mitigate the ranking-based attacks while maintaining computational feasibility, we derive surrogate bounds of the thickness that involve expensive sampling and integration. We use a multi-objective approach to analyze the convergence of a gradient-based attack to confirm that the explanation robustness can be measured by the thickness metric. We conduct experiments on various network architectures and diverse datasets to prove the superiority of the proposed methods, while the widely accepted Hessian-based curvature smoothing approaches are not as robust as our method. ",
    "url": "https://arxiv.org/abs/2212.14106",
    "authors": [
      "Chao Chen",
      "Chenghua Guo",
      "Guixiang Ma",
      "Xi Zhang",
      "Sihong Xie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14107",
    "title": "Joint Discriminative and Metric Embedding Learning for Person  Re-Identification",
    "abstract": "Person re-identification is a challenging task because of the high intra-class variance induced by the unrestricted nuisance factors of variations such as pose, illumination, viewpoint, background, and sensor noise. Recent approaches postulate that powerful architectures have the capacity to learn feature representations invariant to nuisance factors, by training them with losses that minimize intra-class variance and maximize inter-class separation, without modeling nuisance factors explicitly. The dominant approaches use either a discriminative loss with margin, like the softmax loss with the additive angular margin, or a metric learning loss, like the triplet loss with batch hard mining of triplets. Since the softmax imposes feature normalization, it limits the gradient flow supervising the feature embedding. We address this by joining the losses and leveraging the triplet loss as a proxy for the missing gradients. We further improve invariance to nuisance factors by adding the discriminative task of predicting attributes. Our extensive evaluation highlights that when only a holistic representation is learned, we consistently outperform the state-of-the-art on the three most challenging datasets. Such representations are easier to deploy in practical systems. Finally, we found that joining the losses removes the requirement for having a margin in the softmax loss while increasing performance. ",
    "url": "https://arxiv.org/abs/2212.14107",
    "authors": [
      "Sinan Sabri",
      "Zaigham Randhawa",
      "Gianfranco Doretto"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14109",
    "title": "Synthesis of Adversarial DDOS Attacks Using Tabular Generative  Adversarial Networks",
    "abstract": "Network Intrusion Detection Systems (NIDS) are tools or software that are widely used to maintain the computer networks and information systems keeping them secure and preventing malicious traffics from penetrating into them, as they flag when somebody is trying to break into the system. Best effort has been set up on these systems, and the results achieved so far are quite satisfying, however, new types of attacks stand out as the technology of attacks keep evolving, one of these attacks are the attacks based on Generative Adversarial Networks (GAN) that can evade machine learning IDS leaving them vulnerable. This project investigates the impact of the Adversarial Attacks synthesized using real DDoS attacks generated using GANs on the IDS. The objective is to discover how will these systems react towards synthesized attacks. marking the vulnerability and weakness points of these systems so we could fix them. ",
    "url": "https://arxiv.org/abs/2212.14109",
    "authors": [
      "Abdelmageed Ahmed Hassan",
      "Mohamed Sayed Hussein",
      "Ahmed Shehata AboMoustafa",
      "Sarah Hossam Elmowafy"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14111",
    "title": "Are Deep Image Embedding Clustering Methods Effective for Heterogeneous  Tabular Data?",
    "abstract": "Deep learning methods in the literature are invariably benchmarked on image data sets and then assumed to work on all data problems. Unfortunately, architectures designed for image learning are often not ready or optimal for non-image data without considering data-specific learning requirements. In this paper, we take a data-centric view to argue that deep image embedding clustering methods are not equally effective on heterogeneous tabular data sets. This paper performs one of the first studies on deep embedding clustering of seven tabular data sets using six state-of-the-art baseline methods proposed for image data sets. Our results reveal that the traditional clustering of tabular data ranks second out of eight methods and is superior to most deep embedding clustering baselines. Our observation is in line with the recent literature that traditional machine learning of tabular data is still a competitive approach against deep learning. Although surprising to many deep learning researchers, traditional clustering methods can be competitive baselines for tabular data, and outperforming these baselines remains a challenge for deep embedding clustering. Therefore, deep learning methods for image learning may not be fair or suitable baselines for tabular data without considering data-specific contrasts and learning requirements. ",
    "url": "https://arxiv.org/abs/2212.14111",
    "authors": [
      "Sakib Abrar",
      "Manar D. Samad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2212.14115",
    "title": "Certifying Safety in Reinforcement Learning under Adversarial  Perturbation Attacks",
    "abstract": "Function approximation has enabled remarkable advances in applying reinforcement learning (RL) techniques in environments with high-dimensional inputs, such as images, in an end-to-end fashion, mapping such inputs directly to low-level control. Nevertheless, these have proved vulnerable to small adversarial input perturbations. A number of approaches for improving or certifying robustness of end-to-end RL to adversarial perturbations have emerged as a result, focusing on cumulative reward. However, what is often at stake in adversarial scenarios is the violation of fundamental properties, such as safety, rather than the overall reward that combines safety with efficiency. Moreover, properties such as safety can only be defined with respect to true state, rather than the high-dimensional raw inputs to end-to-end policies. To disentangle nominal efficiency and adversarial safety, we situate RL in deterministic partially-observable Markov decision processes (POMDPs) with the goal of maximizing cumulative reward subject to safety constraints. We then propose a partially-supervised reinforcement learning (PSRL) framework that takes advantage of an additional assumption that the true state of the POMDP is known at training time. We present the first approach for certifying safety of PSRL policies under adversarial input perturbations, and two adversarial training approaches that make direct use of PSRL. Our experiments demonstrate both the efficacy of the proposed approach for certifying safety in adversarial environments, and the value of the PSRL framework coupled with adversarial training in improving certified safety while preserving high nominal reward and high-quality predictions of true state. ",
    "url": "https://arxiv.org/abs/2212.14115",
    "authors": [
      "Junlin Wu",
      "Hussein Sibai",
      "Yevgeniy Vorobeychik"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14128",
    "title": "Joint Engagement Classification using Video Augmentation Techniques for  Multi-person Human-robot Interaction",
    "abstract": "Affect understanding capability is essential for social robots to autonomously interact with a group of users in an intuitive and reciprocal way. However, the challenge of multi-person affect understanding comes from not only the accurate perception of each user's affective state (e.g., engagement) but also the recognition of the affect interplay between the members (e.g., joint engagement) that presents as complex, but subtle, nonverbal exchanges between them. Here we present a novel hybrid framework for identifying a parent-child dyad's joint engagement by combining a deep learning framework with various video augmentation techniques. Using a dataset of parent-child dyads reading storybooks together with a social robot at home, we first train RGB frame- and skeleton-based joint engagement recognition models with four video augmentation techniques (General Aug, DeepFake, CutOut, and Mixed) applied datasets to improve joint engagement classification performance. Second, we demonstrate experimental results on the use of trained models in the robot-parent-child interaction context. Third, we introduce a behavior-based metric for evaluating the learned representation of the models to investigate the model interpretability when recognizing joint engagement. This work serves as the first step toward fully unlocking the potential of end-to-end video understanding models pre-trained on large public datasets and augmented with data augmentation and visualization techniques for affect recognition in the multi-person human-robot interaction in the wild. ",
    "url": "https://arxiv.org/abs/2212.14128",
    "authors": [
      "Yubin Kim",
      "Huili Chen",
      "Sharifa Alghowinem",
      "Cynthia Breazeal",
      "Hae Won Park"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14129",
    "title": "Matchertext: Towards Verbatim Interlanguage Embedding",
    "abstract": "Embedding text in one language within text of another is commonplace for numerous purposes, but usually requires tedious and error-prone \"escaping\" transformations on the embedded string. We propose a simple cross-language syntactic discipline, matchertext, which enables the safe embedding a string in any compliant language into a string in any other language via simple \"copy-and-paste\" - in particular with no escaping, obfuscation, or expansion of embedded strings. We apply this syntactic discipline to several common and frequently-embedded language syntaxes such as URIs, HTML, and JavaScript, exploring the benefits, costs, and compatibility issues in adopting the proposed matchertext discipline. One early matchertext-based language is MinML, a concise but general alternative syntax for writing HTML or XML. ",
    "url": "https://arxiv.org/abs/2212.14129",
    "authors": [
      "Bryan Ford"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2212.14132",
    "title": "Robust Bayesian Subspace Identification for Small Data Sets",
    "abstract": "Model estimates obtained from traditional subspace identification methods may be subject to significant variance. This elevated variance is aggravated in the cases of large models or of a limited sample size. Common solutions to reduce the effect of variance are regularized estimators, shrinkage estimators and Bayesian estimation. In the current work we investigate the latter two solutions, which have not yet been applied to subspace identification. Our experimental results show that our proposed estimators may reduce the estimation risk up to $40\\%$ of that of traditional subspace methods. ",
    "url": "https://arxiv.org/abs/2212.14132",
    "authors": [
      "Alexandre Rodrigues Mesquita"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.14133",
    "title": "Investigating Sindy As a Tool For Causal Discovery In Time Series  Signals",
    "abstract": "The SINDy algorithm has been successfully used to identify the governing equations of dynamical systems from time series data. In this paper, we argue that this makes SINDy a potentially useful tool for causal discovery and that existing tools for causal discovery can be used to dramatically improve the performance of SINDy as tool for robust sparse modeling and system identification. We then demonstrate empirically that augmenting the SINDy algorithm with tools from causal discovery can provides engineers with a tool for learning causally robust governing equations. ",
    "url": "https://arxiv.org/abs/2212.14133",
    "authors": [
      "Andrew O'Brien",
      "Rosina Weber",
      "Edward Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2212.14143",
    "title": "Multimodal Wildland Fire Smoke Detection",
    "abstract": "Research has shown that climate change creates warmer temperatures and drier conditions, leading to longer wildfire seasons and increased wildfire risks in the United States. These factors have in turn led to increases in the frequency, extent, and severity of wildfires in recent years. Given the danger posed by wildland fires to people, property, wildlife, and the environment, there is an urgency to provide tools for effective wildfire management. Early detection of wildfires is essential to minimizing potentially catastrophic destruction. In this paper, we present our work on integrating multiple data sources in SmokeyNet, a deep learning model using spatio-temporal information to detect smoke from wildland fires. Camera image data is integrated with weather sensor measurements and processed by SmokeyNet to create a multimodal wildland fire smoke detection system. We present our results comparing performance in terms of both accuracy and time-to-detection for multimodal data vs. a single data source. With a time-to-detection of only a few minutes, SmokeyNet can serve as an automated early notification system, providing a useful tool in the fight against destructive wildfires. ",
    "url": "https://arxiv.org/abs/2212.14143",
    "authors": [
      "Siddhant Baldota",
      "Shreyas Anantha Ramaprasad",
      "Jaspreet Kaur Bhamra",
      "Shane Luna",
      "Ravi Ramachandra",
      "Eugene Zen",
      "Harrison Kim",
      "Daniel Crawl",
      "Ismael Perez",
      "Ilkay Altintas",
      "Garrison W. Cottrell",
      "Mai H.Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14156",
    "title": "Decentralized Voltage Control with Peer-to-peer Energy Trading in a  Distribution Network",
    "abstract": "Utilizing distributed renewable and energy storage resources via peer-to-peer (P2P) energy trading has long been touted as a solution to improve energy system's resilience and sustainability. Consumers and prosumers (those who have energy generation resources), however, do not have expertise to engage in repeated P2P trading, and the zero-marginal costs of renewables present challenges in determining fair market prices. To address these issues, we propose a multi-agent reinforcement learning (MARL) framework to help automate consumers' bidding and management of their solar PV and energy storage resources, under a specific P2P clearing mechanism that utilizes the so-called supply-demand ratio. In addition, we show how the MARL framework can integrate physical network constraints to realize decentralized voltage control, hence ensuring physical feasibility of the P2P energy trading and paving ways for real-world implementations. ",
    "url": "https://arxiv.org/abs/2212.14156",
    "authors": [
      "Chen Feng",
      "Andrew L. Lu",
      "Yihsu Chen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2212.14181",
    "title": "Efficient Image Super-Resolution with Feature Interaction Weighted  Hybrid Network",
    "abstract": "Recently, great progress has been made in single-image super-resolution (SISR) based on deep learning technology. However, the existing methods usually require a large computational cost. Meanwhile, the activation function will cause some features of the intermediate layer to be lost. Therefore, it is a challenge to make the model lightweight while reducing the impact of intermediate feature loss on the reconstruction quality. In this paper, we propose a Feature Interaction Weighted Hybrid Network (FIWHN) to alleviate the above problem. Specifically, FIWHN consists of a series of novel Wide-residual Distillation Interaction Blocks (WDIB) as the backbone, where every third WDIBs form a Feature shuffle Weighted Group (FSWG) by mutual information mixing and fusion. In addition, to mitigate the adverse effects of intermediate feature loss on the reconstruction results, we introduced a well-designed Wide Convolutional Residual Weighting (WCRW) and Wide Identical Residual Weighting (WIRW) units in WDIB, and effectively cross-fused features of different finenesses through a Wide-residual Distillation Connection (WRDC) framework and a Self-Calibrating Fusion (SCF) unit. Finally, to complement the global features lacking in the CNN model, we introduced the Transformer into our model and explored a new way of combining the CNN and Transformer. Extensive quantitative and qualitative experiments on low-level and high-level tasks show that our proposed FIWHN can achieve a good balance between performance and efficiency, and is more conducive to downstream tasks to solve problems in low-pixel scenarios. ",
    "url": "https://arxiv.org/abs/2212.14181",
    "authors": [
      "Wenjie Li",
      "Juncheng Li",
      "Guangwei Gao",
      "Weihong Deng",
      "Jian Yang",
      "Guo-Jun Qi",
      "Chia-Wen Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14182",
    "title": "WL-Align: Weisfeiler-Lehman Relabeling for Aligning Users across  Networks via Regularized Representation Learning",
    "abstract": "Aligning users across networks using graph representation learning has been found effective where the alignment is accomplished in a low-dimensional embedding space. Yet, achieving highly precise alignment is still challenging, especially when nodes with long-range connectivity to the labeled anchors are encountered. To alleviate this limitation, we purposefully designed WL-Align which adopts a regularized representation learning framework to learn distinctive node representations. It extends the Weisfeiler-Lehman Isormorphism Test and learns the alignment in alternating phases of \"across-network Weisfeiler-Lehman relabeling\" and \"proximity-preserving representation learning\". The across-network Weisfeiler-Lehman relabeling is achieved through iterating the anchor-based label propagation and a similarity-based hashing to exploit the known anchors' connectivity to different nodes in an efficient and robust manner. The representation learning module preserves the second-order proximity within individual networks and is regularized by the across-network Weisfeiler-Lehman hash labels. Extensive experiments on real-world and synthetic datasets have demonstrated that our proposed WL-Align outperforms the state-of-the-art methods, achieving significant performance improvements in the \"exact matching\" scenario. Data and code of WL-Align are available at https://github.com/ChenPengGang/WLAlignCode. ",
    "url": "https://arxiv.org/abs/2212.14182",
    "authors": [
      "Li Liu",
      "Penggang Chen",
      "Xin Li",
      "William K. Cheung",
      "Youmin Zhang",
      "Qun Liu",
      "Guoyin Wang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14193",
    "title": "A Unified Object Counting Network with Object Occupation Prior",
    "abstract": "The counting task, which plays a fundamental rule in numerous applications (e.g., crowd counting, traffic statistics), aims to predict the number of objects with various densities. Existing object counting tasks are designed for a single object class. However, it is inevitable to encounter newly coming data with new classes in our real world. We name this scenario as \\textit{evolving object counting}. In this paper, we build the first evolving object counting dataset and propose a unified object counting network as the first attempt to address this task. The proposed model consists of two key components: a class-agnostic mask module and a class-increment module. The class-agnostic mask module learns generic object occupation prior via predicting a class-agnostic binary mask (e.g., 1 denotes there exists an object at the considering position in an image and 0 otherwise). The class-increment module is used to handle new coming classes and provides discriminative class guidance for density map prediction. The combined outputs of class-agnostic mask module and image feature extractor are used to predict the final density map. When new classes come, we first add new neural nodes into the last regression and classification layers of this module. Then, instead of retraining the model from scratch, we utilize knowledge distilling to help the model remember what have already learned about previous object classes. We also employ a support sample bank to store a small number of typical training samples of each class, which are used to prevent the model from forgetting key information of old data. With this design, our model can efficiently and effectively adapt to new coming classes while keeping good performance on already seen data without large-scale retraining. Extensive experiments on the collected dataset demonstrate the favorable performance. ",
    "url": "https://arxiv.org/abs/2212.14193",
    "authors": [
      "Shengqin Jiang",
      "Qing Wang",
      "Fengna Cheng",
      "Yuankai Qi",
      "Qingshan Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14197",
    "title": "Self-Supervised Pre-training for 3D Point Clouds via View-Specific  Point-to-Image Translation",
    "abstract": "The past few years have witnessed the prevalence of self-supervised representation learning within the language and 2D vision communities. However, such advancements have not been fully migrated to the community of 3D point cloud learning. Different from previous pre-training pipelines for 3D point clouds that generally fall into the scope of either generative modeling or contrastive learning, in this paper, we investigate a translative pre-training paradigm, namely PointVST, driven by a novel self-supervised pretext task of cross-modal translation from an input 3D object point cloud to its diverse forms of 2D rendered images (e.g., silhouette, depth, contour). Specifically, we begin with deducing view-conditioned point-wise embeddings via the insertion of the viewpoint indicator, and then adaptively aggregate a view-specific global codeword, which is further fed into the subsequent 2D convolutional translation heads for image generation. We conduct extensive experiments on common task scenarios of 3D shape analysis, where our PointVST shows consistent and prominent performance superiority over current state-of-the-art methods under diverse evaluation protocols. Our code will be made publicly available. ",
    "url": "https://arxiv.org/abs/2212.14197",
    "authors": [
      "Qijian Zhang",
      "Junhui Hou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14220",
    "title": "Graph Searching with Predictions",
    "abstract": "Consider an agent exploring an unknown graph in search of some goal state. As it walks around the graph, it learns the nodes and their neighbors. The agent only knows where the goal state is when it reaches it. How do we reach this goal while moving only a small distance? This problem seems hopeless, even on trees of bounded degree, unless we give the agent some help. This setting with ''help'' often arises in exploring large search spaces (e.g., huge game trees) where we assume access to some score/quality function for each node, which we use to guide us towards the goal. In our case, we assume the help comes in the form of distance predictions: each node $v$ provides a prediction $f(v)$ of its distance to the goal vertex. Naturally if these predictions are correct, we can reach the goal along a shortest path. What if the predictions are unreliable and some of them are erroneous? Can we get an algorithm whose performance relates to the error of the predictions? In this work, we consider the problem on trees and give deterministic algorithms whose total movement cost is only $O(OPT + \\Delta \\cdot ERR)$, where $OPT$ is the distance from the start to the goal vertex, $\\Delta$ the maximum degree, and the $ERR$ is the total number of vertices whose predictions are erroneous. We show this guarantee is optimal. We then consider a ''planning'' version of the problem where the graph and predictions are known at the beginning, so the agent can use this global information to devise a search strategy of low cost. For this planning version, we go beyond trees and give an algorithms which gets good performance on (weighted) graphs with bounded doubling dimension. ",
    "url": "https://arxiv.org/abs/2212.14220",
    "authors": [
      "Siddhartha Banerjee",
      "Vincent Cohen-Addad",
      "Anupam Gupta",
      "Zhouzi Li"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2212.14229",
    "title": "Condensed Representation of Machine Learning Data",
    "abstract": "Training of a Machine Learning model requires sufficient data. The sufficiency of the data is not always about the quantity, but about the relevancy and reduced redundancy. Data-generating processes create massive amounts of data. When used raw, such big data is causing much computational resource utilization. Instead of using the raw data, a proper Condensed Representation can be used instead. Combining K-means, a well-known clustering method, with some correction and refinement facilities a novel Condensed Representation method for Machine Learning applications is introduced. To present the novel method meaningfully and visually, synthetically generated data is employed. It has been shown that by using the condensed representation, instead of the raw data, acceptably accurate model training is possible. ",
    "url": "https://arxiv.org/abs/2212.14229",
    "authors": [
      "Rahman Salim Zengin",
      "Volkan Sezer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14230",
    "title": "Exploring Depth Information for Face Manipulation Detection",
    "abstract": "Face manipulation detection has been receiving a lot of attention for the reliability and security of the face images. Recent studies focus on using auxiliary information or prior knowledge to capture robust manipulation traces, which are shown to be promising. As one of the important face features, the face depth map, which has shown to be effective in other areas such as the face recognition or face detection, is unfortunately paid little attention to in literature for detecting the manipulated face images. In this paper, we explore the possibility of incorporating the face depth map as auxiliary information to tackle the problem of face manipulation detection in real world applications. To this end, we first propose a Face Depth Map Transformer (FDMT) to estimate the face depth map patch by patch from a RGB face image, which is able to capture the local depth anomaly created due to manipulation. The estimated face depth map is then considered as auxiliary information to be integrated with the backbone features using a Multi-head Depth Attention (MDA) mechanism that is newly designed. Various experiments demonstrate the advantage of our proposed method for face manipulation detection. ",
    "url": "https://arxiv.org/abs/2212.14230",
    "authors": [
      "Haoyue Wang",
      "Meiling Li",
      "Sheng Li",
      "Zhenxing Qian",
      "Xinpeng Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14232",
    "title": "GPTR: Gestalt-Perception Transformer for Diagram Object Detection",
    "abstract": "Diagram object detection is the key basis of practical applications such as textbook question answering. Because the diagram mainly consists of simple lines and color blocks, its visual features are sparser than those of natural images. In addition, diagrams usually express diverse knowledge, in which there are many low-frequency object categories in diagrams. These lead to the fact that traditional data-driven detection model is not suitable for diagrams. In this work, we propose a gestalt-perception transformer model for diagram object detection, which is based on an encoder-decoder architecture. Gestalt perception contains a series of laws to explain human perception, that the human visual system tends to perceive patches in an image that are similar, close or connected without abrupt directional changes as a perceptual whole object. Inspired by these thoughts, we build a gestalt-perception graph in transformer encoder, which is composed of diagram patches as nodes and the relationships between patches as edges. This graph aims to group these patches into objects via laws of similarity, proximity, and smoothness implied in these edges, so that the meaningful objects can be effectively detected. The experimental results demonstrate that the proposed GPTR achieves the best results in the diagram object detection task. Our model also obtains comparable results over the competitors in natural image object detection. ",
    "url": "https://arxiv.org/abs/2212.14232",
    "authors": [
      "Xin Hu",
      "Lingling Zhang",
      "Jun Liu",
      "Jinfu Fan",
      "Yang You",
      "Yaqiang Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14234",
    "title": "Multi-Agent Deep Reinforcement Learning Based Resource Management in  SWIPT Enabled Cellular Networks with H2H/M2M Co-Existence",
    "abstract": "Machine-to-Machine (M2M) communication is crucial in developing Internet of Things (IoT). As it is well known that cellular networks have been considered as the primary infrastructure for M2M communications, there are several key issues to be addressed in order to deploy M2M communications over cellular networks. Notably, the rapid growth of M2M traffic dramatically increases energy consumption, as well as degrades the performance of existing Human-to-Human (H2H) traffic. Sustainable operation technology and resource management are efficacious ways for solving these issues. In this paper, we investigate a resource management problem in cellular networks with H2H/M2M coexistence. First, considering the energy-constrained nature of machine type communication devices (MTCDs), we propose a novel network model enabled by simultaneous wireless information and power transfer (SWIPT), which empowers MTCDs with the ability to simultaneously perform energy harvesting (EH) and information decoding. Given the diverse characteristics of IoT devices, we subdivide MTCDs into critical and tolerable types, further formulating the resource management problem as an energy efficiency (EE) maximization problem under divers Quality-of-Service (QoS) constraints. Then, we develop a multi-agent deep reinforcement learning (DRL) based scheme to solve this problem. It provides optimal spectrum, transmit power and power splitting (PS) ratio allocation policies, along with efficient model training under designed behaviour-tracking based state space and common reward function. Finally, we verify that with a reasonable training mechanism, multiple M2M agents successfully work cooperatively in a distributed way, resulting in network performance that outperforms other intelligence approaches in terms of convergence speed and meeting the EE and QoS requirements. ",
    "url": "https://arxiv.org/abs/2212.14234",
    "authors": [
      "Xuehua Li",
      "Xing Wei",
      "Shuo Chen",
      "Lixin Sun"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2212.14252",
    "title": "A fast and convergent combined Newton and gradient descent method for  computing steady states of chemical reaction networks",
    "abstract": "In this work we present a fast, globally convergent, iterative algorithm for computing the asymptotically stable states of nonlinear large--scale systems of quadratic autonomous Ordinary Differential Equations (ODEs) modeling, e.g., the dynamic of complex chemical reaction networks. Towards this aim, we reformulate the problem as a box--constrained optimization problem where the roots of a set of nonlinear equations need to be determined. Then, we propose to use a projected Newton's approach combined with a gradient descent algorithm so that every limit point of the sequence generated by the overall algorithm is a stationary point. More importantly, we suggest replacing the standard orthogonal projector with a novel operator that ensures the final solution to satisfy the box constraints while lowering the probability that the intermediate points reached at each iteration belong to the boundary of the box where the Jacobian of the objective function may be singular. The effectiveness of the proposed approach is shown in a practical scenario concerning a chemical reaction network modeling the signaling network of colorectal cancer cells. Specifically, in this scenario the proposed algorithm is proven to be faster and more accurate than a classical dynamical approach where the asymptotically stable states are computed as the limit points of the flux of the Cauchy problem associated with the ODEs system. ",
    "url": "https://arxiv.org/abs/2212.14252",
    "authors": [
      "Silvia Berra",
      "Alessandro La Torraca",
      "Federico Benvenuto",
      "Sara Sommariva"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2212.14255",
    "title": "HUSP-SP: Faster Utility Mining on Sequence Data",
    "abstract": "High-utility sequential pattern mining (HUSPM) has emerged as an important topic due to its wide application and considerable popularity. However, due to the combinatorial explosion of the search space when the HUSPM problem encounters a low utility threshold or large-scale data, it may be time-consuming and memory-costly to address the HUSPM problem. Several algorithms have been proposed for addressing this problem, but they still cost a lot in terms of running time and memory usage. In this paper, to further solve this problem efficiently, we design a compact structure called sequence projection (seqPro) and propose an efficient algorithm, namely discovering high-utility sequential patterns with the seqPro structure (HUSP-SP). HUSP-SP utilizes the compact seq-array to store the necessary information in a sequence database. The seqPro structure is designed to efficiently calculate candidate patterns' utilities and upper bound values. Furthermore, a new upper bound on utility, namely tighter reduced sequence utility (TRSU) and two pruning strategies in search space, are utilized to improve the mining performance of HUSP-SP. Experimental results on both synthetic and real-life datasets show that HUSP-SP can significantly outperform the state-of-the-art algorithms in terms of running time, memory usage, search space pruning efficiency, and scalability. ",
    "url": "https://arxiv.org/abs/2212.14255",
    "authors": [
      "Chunkai Zhang",
      "Yuting Yang",
      "Zilin Du",
      "Wensheng Gan",
      "Philip S. Yu"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14260",
    "title": "Distributionally Robust Strategy Synthesis for Switched Stochastic  Systems",
    "abstract": "We present a novel framework for formal control of uncertain discrete-time switched stochastic systems against probabilistic reach-avoid specifications, defined as the probability of reaching a goal region while being safe. In particular, we consider stochastic systems with additive noise, whose distribution lies in an ambiguity set of distributions that are $\\varepsilon-$close to a nominal one according to the Wasserstein distance. For this class of systems, we derive control synthesis algorithms that are robust against all these distributions and maximize the probability of satisfying a reach-avoid specification. The framework we present first learns an abstraction of a switched stochastic system as a robust Markov decision process (robust MDP) by accounting for both the stochasticity of the system and the uncertainty in the noise distribution. Then, it synthesizes a strategy on the resulting robust MDP that maximizes the probability of satisfying the property and is robust to all uncertainty in the system. This strategy is then refined into a switching strategy for the original stochastic system. By exploiting tools from optimal transport and stochastic programming, we show that synthesizing such a strategy reduces to solving a set of linear programs, thus guaranteeing efficiency. We experimentally validate the efficacy of our framework on various case studies, including both linear and non-linear switched stochastic systems. ",
    "url": "https://arxiv.org/abs/2212.14260",
    "authors": [
      "Ibon Gracia",
      "Dimitris Boskos",
      "Luca Laurenti",
      "Manuel Mazo Jr"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2212.14264",
    "title": "Trajectory Smoothing Using GNSS/PDR Integration Via Factor Graph  Optimization in Urban Canyons",
    "abstract": "Accurate and smooth global navigation satellite system (GNSS) positioning for pedestrians in urban canyons is still a challenge due to the multipath effects and the non-light-of-sight (NLOS) receptions caused by the reflections from surrounding buildings. The recently developed factor graph optimization (FGO) based GNSS positioning method opened a new window for improving urban GNSS positioning by effectively exploiting the measurement redundancy from the historical information to resist the outlier measurements. Unfortunately, the FGO-based GNSS standalone positioning is still challenged in highly urbanized areas. As an extension of the previous FGO-based GNSS positioning method, this paper exploits the potential of the pedestrian dead reckoning (PDR) model in FGO to improve the GNSS standalone positioning performance in urban canyons. Specifically, the relative motion of the pedestrian is estimated based on the raw acceleration measurements from the onboard smartphone inertial measurement unit (IMU) via the PDR algorithm. Then the raw GNSS pseudorange, Doppler measurements, and relative motion from PDR are integrated using the FGO. Given the context of pedestrian navigation with a small acceleration most of the time, a novel soft motion model is proposed to smooth the states involved in the factor graph model. The effectiveness of the proposed method is verified step-by-step through two datasets collected in dense urban canyons of Hong Kong using smartphone-level GNSS receivers. The comparison between the conventional extended Kalman filter, several existing methods, and FGO-based integration is presented. The results reveal that the existing FGO-based GNSS standalone positioning is highly complementary to the PDR's relative motion estimation. Both improved positioning accuracy and trajectory smoothness are obtained with the help of the proposed method. ",
    "url": "https://arxiv.org/abs/2212.14264",
    "authors": [
      "Yihan Zhong",
      "Weisong Wen",
      "Li-Ta Hsu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2212.14266",
    "title": "Sequence Generation with Label Augmentation for Relation Extraction",
    "abstract": "Sequence generation demonstrates promising performance in recent information extraction efforts, by incorporating large-scale pre-trained Seq2Seq models. This paper investigates the merits of employing sequence generation in relation extraction, finding that with relation names or synonyms as generation targets, their textual semantics and the correlation (in terms of word sequence pattern) among them affect model performance. We then propose Relation Extraction with Label Augmentation (RELA), a Seq2Seq model with automatic label augmentation for RE. By saying label augmentation, we mean prod semantically synonyms for each relation name as the generation target. Besides, we present an in-depth analysis of the Seq2Seq model's behavior when dealing with RE. Experimental results show that RELA achieves competitive results compared with previous methods on four RE datasets. ",
    "url": "https://arxiv.org/abs/2212.14266",
    "authors": [
      "Bo Li",
      "Dingyao Yu",
      "Wei Ye",
      "Jinglei Zhang",
      "Shikun Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.14268",
    "title": "Detection of out-of-distribution samples using binary neuron activation  patterns",
    "abstract": "Deep neural networks (DNN) have outstanding performance in various applications. Despite numerous efforts of the research community, out-of-distribution (OOD) samples remain significant limitation of DNN classifiers. The ability to identify previously unseen inputs as novel is crucial in safety-critical applications such as self-driving cars, unmanned aerial vehicles and robots. Existing approaches to detect OOD samples treat a DNN as a black box and assess the confidence score of the output predictions. Unfortunately, this method frequently fails, because DNN are not trained to reduce their confidence for OOD inputs. In this work, we introduce a novel method for OOD detection. Our method is motivated by theoretical analysis of neuron activation patterns (NAP) in ReLU based architectures. The proposed method does not introduce high computational workload due to the binary representation of the activation patterns extracted from convolutional layers. The extensive empirical evaluation proves its high performance on various DNN architectures and seven image datasets. ion. ",
    "url": "https://arxiv.org/abs/2212.14268",
    "authors": [
      "Bartlomiej Olber",
      "Krystian Radlak",
      "Adam Popowicz",
      "Michal Szczepankiewicz",
      "Krystian Chachula"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14270",
    "title": "Reviewing Labels: Label Graph Network with Top-k Prediction Set for  Relation Extraction",
    "abstract": "The typical way for relation extraction is fine-tuning large pre-trained language models on task-specific datasets, then selecting the label with the highest probability of the output distribution as the final prediction. However, the usage of the Top-k prediction set for a given sample is commonly overlooked. In this paper, we first reveal that the Top-k prediction set of a given sample contains useful information for predicting the correct label. To effectively utilizes the Top-k prediction set, we propose Label Graph Network with Top-k Prediction Set, termed as KLG. Specifically, for a given sample, we build a label graph to review candidate labels in the Top-k prediction set and learn the connections between them. We also design a dynamic $k$-selection mechanism to learn more powerful and discriminative relation representation. Our experiments show that KLG achieves the best performances on three relation extraction datasets. Moreover, we observe that KLG is more effective in dealing with long-tailed classes. ",
    "url": "https://arxiv.org/abs/2212.14270",
    "authors": [
      "Bo Li",
      "Wei Ye",
      "Jinglei Zhang",
      "Shikun Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.14274",
    "title": "Meta-Path Based Attentional Graph Learning Model for Vulnerability  Detection",
    "abstract": "In recent years, deep learning (DL)-based methods have been widely used in code vulnerability detection. The DL-based methods typically extract structural information from source code, e.g., code structure graph, and adopt neural networks such as Graph Neural Networks (GNNs) to learn the graph representations. However, these methods do not consider the heterogeneous relations in the code structure graph, i.e., different types of nodes and edges, which may obstruct the graph representation learning. Besides, these methods are limited in capturing long-range dependencies due to the deep levels in the code structure graph. In this paper, we propose a Meta-path based Attentional Graph learning model for code vulNErability deTection, called MAGNET. MAGNET constructs a multi-granularity meta-path graph for each code snippet, in which the heterogeneous relations are denoted as meta paths to represent the structural information. A meta-path based hierarchical attentional graph neural network is also proposed to capture the relations between distant nodes in the graph. We evaluate MAGNET on three public datasets and the results show that MAGNET outperforms the best baseline method in terms of F1 score by 6.32%, 21.50%, and 25.40%, respectively. MAGNET also achieves the best performance among all the baseline methods in detecting Top-25 most dangerous Common Weakness Enumerations (CWEs), further demonstrating its effectiveness in vulnerability detection. ",
    "url": "https://arxiv.org/abs/2212.14274",
    "authors": [
      "Xin-Cheng Wen",
      "Cuiyun Gao",
      "Jiaxin Ye",
      "Zhihong Tian",
      "Yan Jia",
      "Xuan Wang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2212.14278",
    "title": "Industrial Scene Change Detection using Deep Convolutional Neural  Networks",
    "abstract": "Finding and localizing the conceptual changes in two scenes in terms of the presence or removal of objects in two images belonging to the same scene at different times in special care applications is of great significance. This is mainly due to the fact that addition or removal of important objects for some environments can be harmful. As a result, there is a need to design a program that locates these differences using machine vision. The most important challenge of this problem is the change in lighting conditions and the presence of shadows in the scene. Therefore, the proposed methods must be resistant to these challenges. In this article, a method based on deep convolutional neural networks using transfer learning is introduced, which is trained with an intelligent data synthesis process. The results of this method are tested and presented on the dataset provided for this purpose. It is shown that the presented method is more efficient than other methods and can be used in a variety of real industrial environments. ",
    "url": "https://arxiv.org/abs/2212.14278",
    "authors": [
      "Ali Atghaei",
      "Ehsan Rahnama",
      "Kiavash Azimi",
      "Hassan Shahbazi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14289",
    "title": "High-temporal-resolution event-based vehicle detection and tracking",
    "abstract": "Event-based vision has been rapidly growing in recent years justified by the unique characteristics it presents such as its high temporal resolutions (~1us), high dynamic range (>120dB), and output latency of only a few microseconds. This work further explores a hybrid, multi-modal, approach for object detection and tracking that leverages state-of-the-art frame-based detectors complemented by hand-crafted event-based methods to improve the overall tracking performance with minimal computational overhead. The methods presented include event-based bounding box (BB) refinement that improves the precision of the resulting BBs, as well as a continuous event-based object detection method, to recover missed detections and generate inter-frame detections that enable a high-temporal-resolution tracking output. The advantages of these methods are quantitatively verified by an ablation study using the higher order tracking accuracy (HOTA) metric. Results show significant performance gains resembled by an improvement in the HOTA from 56.6%, using only frames, to 64.1% and 64.9%, for the event and edge-based mask configurations combined with the two methods proposed, at the baseline framerate of 24Hz. Likewise, incorporating these methods with the same configurations has improved HOTA from 52.5% to 63.1%, and from 51.3% to 60.2% at the high-temporal-resolution tracking rate of 384Hz. Finally, a validation experiment is conducted to analyze the real-world single-object tracking performance using high-speed LiDAR. Empirical evidence shows that our approaches provide significant advantages compared to using frame-based object detectors at the baseline framerate of 24Hz and higher tracking rates of up to 500Hz. ",
    "url": "https://arxiv.org/abs/2212.14289",
    "authors": [
      "Zaid El-Shair",
      "Samir Rawashdeh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14293",
    "title": "Error syntax aware augmentation of feedback comment generation dataset",
    "abstract": "This paper presents a solution to the GenChal 2022 shared task dedicated to feedback comment generation for writing learning. In terms of this task given a text with an error and a span of the error, a system generates an explanatory note that helps the writer (language learner) to improve their writing skills. Our solution is based on fine-tuning the T5 model on the initial dataset augmented according to syntactical dependencies of the words located within indicated error span. The solution of our team \"nigula\" obtained second place according to manual evaluation by the organizers. ",
    "url": "https://arxiv.org/abs/2212.14293",
    "authors": [
      "Nikolay Babakov",
      "Maria Lysyuk",
      "Alexander Shvets",
      "Lilya Kazakova",
      "Alexander Panchenko"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.14309",
    "title": "Learning to mask: Towards generalized face forgery detection",
    "abstract": "Generalizability to unseen forgery types is crucial for face forgery detectors. Recent works have made significant progress in terms of generalization by synthetic forgery data augmentation. In this work, we explore another path for improving the generalization. Our goal is to reduce the features that are easy to learn in the training phase, so as to reduce the risk of overfitting on specific forgery types. Specifically, in our method, a teacher network takes as input the face images and generates an attention map of the deep features by a diverse multihead attention ViT. The attention map is used to guide a student network to focus on the low-attended features by reducing the highly-attended deep features. A deep feature mixup strategy is also proposed to synthesize forgeries in the feature domain. Experiments demonstrate that, without data augmentation, our method is able to achieve promising performances on unseen forgeries and highly compressed data. ",
    "url": "https://arxiv.org/abs/2212.14309",
    "authors": [
      "Jianwei Fei",
      "Yunshu Dai",
      "Huaming Wang",
      "Zhihua Xia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14315",
    "title": "\"Real Attackers Don't Compute Gradients\": Bridging the Gap Between  Adversarial ML Research and Practice",
    "abstract": "Recent years have seen a proliferation of research on adversarial machine learning. Numerous papers demonstrate powerful algorithmic attacks against a wide variety of machine learning (ML) models, and numerous other papers propose defenses that can withstand most attacks. However, abundant real-world evidence suggests that actual attackers use simple tactics to subvert ML-driven systems, and as a result security practitioners have not prioritized adversarial ML defenses. Motivated by the apparent gap between researchers and practitioners, this position paper aims to bridge the two domains. We first present three real-world case studies from which we can glean practical insights unknown or neglected in research. Next we analyze all adversarial ML papers recently published in top security conferences, highlighting positive trends and blind spots. Finally, we state positions on precise and cost-driven threat modeling, collaboration between industry and academia, and reproducible research. We believe that our positions, if adopted, will increase the real-world impact of future endeavours in adversarial ML, bringing both researchers and practitioners closer to their shared goal of improving the security of ML systems. ",
    "url": "https://arxiv.org/abs/2212.14315",
    "authors": [
      "Giovanni Apruzzese",
      "Hyrum S. Anderson",
      "Savino Dambra",
      "David Freeman",
      "Fabio Pierazzi",
      "Kevin A. Roundy"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14345",
    "title": "On Learning the Structure of Clusters in Graphs",
    "abstract": "Graph clustering is a fundamental problem in unsupervised learning, with numerous applications in computer science and in analysing real-world data. In many real-world applications, we find that the clusters have a significant high-level structure. This is often overlooked in the design and analysis of graph clustering algorithms which make strong simplifying assumptions about the structure of the graph. This thesis addresses the natural question of whether the structure of clusters can be learned efficiently and describes four new algorithmic results for learning such structure in graphs and hypergraphs. All of the presented theoretical results are extensively evaluated on both synthetic and real-word datasets of different domains, including image classification and segmentation, migration networks, co-authorship networks, and natural language processing. These experimental results demonstrate that the newly developed algorithms are practical, effective, and immediately applicable for learning the structure of clusters in real-world data. ",
    "url": "https://arxiv.org/abs/2212.14345",
    "authors": [
      "Peter Macgregor"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2212.14353",
    "title": "Sheaf-theoretic self-filtering network of low-cost sensors for local air  quality monitoring: A causal approach",
    "abstract": "Sheaf theory, which is a complex but powerful tool supported by topological theory, offers more flexibility and precision than traditional graph theory when it comes to modeling relationships between multiple features. In the realm of air quality monitoring, this can be incredibly useful in detecting sudden changes in local dust particle density, which can be difficult to accurately measure using commercial instruments. Traditional methods for air quality measurement often rely on calibrating the measurement with public standard instruments or calculating the measurements moving average over a constant period. However, this can lead to an incorrect index at the measurement location, as well as an oversmoothing effect on the signal. In this study, we propose a compact device that uses sheaf theory to detect and count vehicles as a local air quality change-causing factor. By inferring the number of vehicles into the PM2.5 index and propagating it into the recorded PM2.5 index from low-cost air monitoring sensors such as PMS7003 and BME280, we can achieve self-correction in real-time. Plus, the sheaf-theoretic method allows for easy scaling to multiple nodes for further filtering effects. By implementing sheaf theory in air quality monitoring, we can overcome the limitations of traditional methods and provide more accurate and reliable results. ",
    "url": "https://arxiv.org/abs/2212.14353",
    "authors": [
      "Anh-Duy Pham",
      "Chuong Dinh Le",
      "Hoang Viet Pham",
      "Thinh Gia Tran",
      "Dat Thanh Vo",
      "Chau Long Tran",
      "An Dinh Le",
      "Hien Bich Vo"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2212.14365",
    "title": "INO: Invariant Neural Operators for Learning Complex Physical Systems  with Momentum Conservation",
    "abstract": "Neural operators, which emerge as implicit solution operators of hidden governing equations, have recently become popular tools for learning responses of complex real-world physical systems. Nevertheless, the majority of neural operator applications has thus far been data-driven, which neglects the intrinsic preservation of fundamental physical laws in data. In this paper, we introduce a novel integral neural operator architecture, to learn physical models with fundamental conservation laws automatically guaranteed. In particular, by replacing the frame-dependent position information with its invariant counterpart in the kernel space, the proposed neural operator is by design translation- and rotation-invariant, and consequently abides by the conservation laws of linear and angular momentums. As applications, we demonstrate the expressivity and efficacy of our model in learning complex material behaviors from both synthetic and experimental datasets, and show that, by automatically satisfying these essential physical laws, our learned neural operator is not only generalizable in handling translated and rotated datasets, but also achieves state-of-the-art accuracy and efficiency as compared to baseline neural operator models. ",
    "url": "https://arxiv.org/abs/2212.14365",
    "authors": [
      "Ning Liu",
      "Yue Yu",
      "Huaiqian You",
      "Neeraj Tatikola"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.14374",
    "title": "Learning One Abstract Bit at a Time Through Self-Invented Experiments  Encoded as Neural Networks",
    "abstract": "There are two important things in science: (A) Finding answers to given questions, and (B) Coming up with good questions. Our artificial scientists not only learn to answer given questions, but also continually invent new questions, by proposing hypotheses to be verified or falsified through potentially complex and time-consuming experiments, including thought experiments akin to those of mathematicians. While an artificial scientist expands its knowledge, it remains biased towards the simplest, least costly experiments that still have surprising outcomes, until they become boring. We present an empirical analysis of the automatic generation of interesting experiments. In the first setting, we investigate self-invented experiments in a reinforcement-providing environment and show that they lead to effective exploration. In the second setting, pure thought experiments are implemented as the weights of recurrent neural networks generated by a neural experiment generator. Initially interesting thought experiments may become boring over time. ",
    "url": "https://arxiv.org/abs/2212.14374",
    "authors": [
      "Vincent Herrmann",
      "Louis Kirsch",
      "Jürgen Schmidhuber"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14376",
    "title": "Long-horizon video prediction using a dynamic latent hierarchy",
    "abstract": "The task of video prediction and generation is known to be notoriously difficult, with the research in this area largely limited to short-term predictions. Though plagued with noise and stochasticity, videos consist of features that are organised in a spatiotemporal hierarchy, different features possessing different temporal dynamics. In this paper, we introduce Dynamic Latent Hierarchy (DLH) -- a deep hierarchical latent model that represents videos as a hierarchy of latent states that evolve over separate and fluid timescales. Each latent state is a mixture distribution with two components, representing the immediate past and the predicted future, causing the model to learn transitions only between sufficiently dissimilar states, while clustering temporally persistent states closer together. Using this unique property, DLH naturally discovers the spatiotemporal structure of a dataset and learns disentangled representations across its hierarchy. We hypothesise that this simplifies the task of modeling temporal dynamics of a video, improves the learning of long-term dependencies, and reduces error accumulation. As evidence, we demonstrate that DLH outperforms state-of-the-art benchmarks in video prediction, is able to better represent stochasticity, as well as to dynamically adjust its hierarchical and temporal structure. Our paper shows, among other things, how progress in representation learning can translate into progress in prediction tasks. ",
    "url": "https://arxiv.org/abs/2212.14376",
    "authors": [
      "Alexey Zakharov",
      "Qinghai Guo",
      "Zafeirios Fountas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14395",
    "title": "Graph Federated Learning for CIoT Devices in Smart Home Applications",
    "abstract": "This paper deals with the problem of statistical and system heterogeneity in a cross-silo Federated Learning (FL) framework where there exist a limited number of Consumer Internet of Things (CIoT) devices in a smart building. We propose a novel Graph Signal Processing (GSP)-inspired aggregation rule based on graph filtering dubbed ``G-Fedfilt''. The proposed aggregator enables a structured flow of information based on the graph's topology. This behavior allows capturing the interconnection of CIoT devices and training domain-specific models. The embedded graph filter is equipped with a tunable parameter which enables a continuous trade-off between domain-agnostic and domain-specific FL. In the case of domain-agnostic, it forces G-Fedfilt to act similar to the conventional Federated Averaging (FedAvg) aggregation rule. The proposed G-Fedfilt also enables an intrinsic smooth clustering based on the graph connectivity without explicitly specified which further boosts the personalization of the models in the framework. In addition, the proposed scheme enjoys a communication-efficient time-scheduling to alleviate the system heterogeneity. This is accomplished by adaptively adjusting the amount of training data samples and sparsity of the models' gradients to reduce communication desynchronization and latency. Simulation results show that the proposed G-Fedfilt achieves up to $3.99\\% $ better classification accuracy than the conventional FedAvg when concerning model personalization on the statistically heterogeneous local datasets, while it is capable of yielding up to $2.41\\%$ higher accuracy than FedAvg in the case of testing the generalization of the models. ",
    "url": "https://arxiv.org/abs/2212.14395",
    "authors": [
      "Arash Rasti-Meymandi",
      "Seyed Mohammad Sheikholeslami",
      "Jamshid Abouei",
      "Konstantinos N. Plataniotis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14397",
    "title": "AttEntropy: Segmenting Unknown Objects in Complex Scenes using the  Spatial Attention Entropy of Semantic Segmentation Transformers",
    "abstract": "Vision transformers have emerged as powerful tools for many computer vision tasks. It has been shown that their features and class tokens can be used for salient object segmentation. However, the properties of segmentation transformers remain largely unstudied. In this work we conduct an in-depth study of the spatial attentions of different backbone layers of semantic segmentation transformers and uncover interesting properties. The spatial attentions of a patch intersecting with an object tend to concentrate within the object, whereas the attentions of larger, more uniform image areas rather follow a diffusive behavior. In other words, vision transformers trained to segment a fixed set of object classes generalize to objects well beyond this set. We exploit this by extracting heatmaps that can be used to segment unknown objects within diverse backgrounds, such as obstacles in traffic scenes. Our method is training-free and its computational overhead negligible. We use off-the-shelf transformers trained for street-scene segmentation to process other scene types. ",
    "url": "https://arxiv.org/abs/2212.14397",
    "authors": [
      "Krzysztof Lis",
      "Matthias Rottmann",
      "Sina Honari",
      "Pascal Fua",
      "Mathieu Salzmann"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14404",
    "title": "Cross Version Defect Prediction with Class Dependency Embeddings",
    "abstract": "Software Defect Prediction aims at predicting which software modules are the most probable to contain defects. The idea behind this approach is to save time during the development process by helping find bugs early. Defect Prediction models are based on historical data. Specifically, one can use data collected from past software distributions, or Versions, of the same target application under analysis. Defect Prediction based on past versions is called Cross Version Defect Prediction (CVDP). Traditionally, Static Code Metrics are used to predict defects. In this work, we use the Class Dependency Network (CDN) as another predictor for defects, combined with static code metrics. CDN data contains structural information about the target application being analyzed. Usually, CDN data is analyzed using different handcrafted network measures, like Social Network metrics. Our approach uses network embedding techniques to leverage CDN information without having to build the metrics manually. In order to use the embeddings between versions, we incorporate different embedding alignment techniques. To evaluate our approach, we performed experiments on 24 software release pairs and compared it against several benchmark methods. In these experiments, we analyzed the performance of two different graph embedding techniques, three anchor selection approaches, and two alignment techniques. We also built a meta-model based on two different embeddings and achieved a statistically significant improvement in AUC of 4.7% (p < 0.002) over the baseline method. ",
    "url": "https://arxiv.org/abs/2212.14404",
    "authors": [
      "Moti Cohen",
      "Lior Rokach",
      "Rami Puzis"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14418",
    "title": "Heterogeneous Computing Systems",
    "abstract": "This survey of heterogeneous computing systems will help in analyzing the technological trends that will be at the basis of heterogeneous computing systems, highlighting the major opportunities and challenges such technologies will bring with them. This will help to understand the importance of heterogeneous computing systems, which are becoming common architectural elements of not only the modern data centers but also highly integrated devices (IoT). Identify problems related to it, such as the resource allocation problem, middleware, processing architectures, programming challenges, etc. from the perspective of heterogeneous resources. ",
    "url": "https://arxiv.org/abs/2212.14418",
    "authors": [
      "Dimple P. Khatri",
      "Guanqun Song",
      "Ting Zhu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2212.14421",
    "title": "Timestomping Vulnerability of Age-Sensitive Gossip Networks",
    "abstract": "We consider gossip networks consisting of a source that maintains the current version of a file, $n$ nodes that use asynchronous gossip mechanisms to disseminate fresh information in the network, and an oblivious adversary who infects the packets at a target node through data timestamp manipulation, with the intent to replace circulation of fresh packets with outdated packets in the network. We demonstrate how network topology capacitates an adversary to influence age scaling in a network. We show that in a fully connected network, a single infected node increases the expected age from $O(\\log n)$ to $O(n)$. Further, we show that the optimal behavior for an adversary is to reset the timestamps of all outgoing packets to the current time and of all incoming packets to an outdated time for the infected node; thereby preventing any fresh information to go into the infected node, and facilitating acceptance of stale information out of the infected node into other network nodes. Lastly for fully connected network, we show that if an infected node contacts only a single node instead of all nodes of the network, the system age can still be degraded to $O(n)$. These show that fully connected nature of a network can be both a benefit and a detriment for information freshness; full connectivity, while enabling fast dissemination of information, also enables fast dissipation of adversarial inputs. We then analyze the unidirectional ring network, the other end of the network connectivity spectrum, where we show that the adversarial effect on age scaling of a node is limited by its distance from the adversary, and the age scaling for a large fraction of the network continues to be $O(\\sqrt{n})$, unchanged from the case with no adversary. We finally support our findings with simulations. ",
    "url": "https://arxiv.org/abs/2212.14421",
    "authors": [
      "Priyanka Kaswan",
      "Sennur Ulukus"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2212.14422",
    "title": "Security, Privacy and Challenges in Microservices Architecture and Cloud  Computing- Survey",
    "abstract": "Security issues in processor architectures remain really critical since users and devices continue to share computing as well as networking resources. So, preserving data privacy in such an environment is really a critical concern. We know that there is a continuous growth in security and privacy issues that need to be addressed. Here, we have chosen a microservice architecture, which is a small or even an independent microprocess that interacts, acts, and responds to messages via lightweight technologies such as Thrift, HTTP, or REST API. ",
    "url": "https://arxiv.org/abs/2212.14422",
    "authors": [
      "Hemanth Gopal",
      "Guanqun Song",
      "Ting Zhu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2212.14427",
    "title": "Efficient Movie Scene Detection using State-Space Transformers",
    "abstract": "The ability to distinguish between different movie scenes is critical for understanding the storyline of a movie. However, accurately detecting movie scenes is often challenging as it requires the ability to reason over very long movie segments. This is in contrast to most existing video recognition models, which are typically designed for short-range video analysis. This work proposes a State-Space Transformer model that can efficiently capture dependencies in long movie videos for accurate movie scene detection. Our model, dubbed TranS4mer, is built using a novel S4A building block, which combines the strengths of structured state-space sequence (S4) and self-attention (A) layers. Given a sequence of frames divided into movie shots (uninterrupted periods where the camera position does not change), the S4A block first applies self-attention to capture short-range intra-shot dependencies. Afterward, the state-space operation in the S4A block is used to aggregate long-range inter-shot cues. The final TranS4mer model, which can be trained end-to-end, is obtained by stacking the S4A blocks one after the other multiple times. Our proposed TranS4mer outperforms all prior methods in three movie scene detection datasets, including MovieNet, BBC, and OVSD, while also being $2\\times$ faster and requiring $3\\times$ less GPU memory than standard Transformer models. We will release our code and models. ",
    "url": "https://arxiv.org/abs/2212.14427",
    "authors": [
      "Md Mohaiminul Islam",
      "Mahmudul Hasan",
      "Kishan Shamsundar Athrey",
      "Tony Braskich",
      "Gedas Bertasius"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14453",
    "title": "Learning Multimodal Data Augmentation in Feature Space",
    "abstract": "The ability to jointly learn from multiple modalities, such as text, audio, and visual data, is a defining feature of intelligent systems. While there have been promising advances in designing neural networks to harness multimodal data, the enormous success of data augmentation currently remains limited to single-modality tasks like image classification. Indeed, it is particularly difficult to augment each modality while preserving the overall semantic structure of the data; for example, a caption may no longer be a good description of an image after standard augmentations have been applied, such as translation. Moreover, it is challenging to specify reasonable transformations that are not tailored to a particular modality. In this paper, we introduce LeMDA, Learning Multimodal Data Augmentation, an easy-to-use method that automatically learns to jointly augment multimodal data in feature space, with no constraints on the identities of the modalities or the relationship between modalities. We show that LeMDA can (1) profoundly improve the performance of multimodal deep learning architectures, (2) apply to combinations of modalities that have not been previously considered, and (3) achieve state-of-the-art results on a wide range of applications comprised of image, text, and tabular data. ",
    "url": "https://arxiv.org/abs/2212.14453",
    "authors": [
      "Zichang Liu",
      "Zhiqiang Tang",
      "Xingjian Shi",
      "Aston Zhang",
      "Mu Li",
      "Anshumali Shrivastava",
      "Andrew Gordon Wilson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14462",
    "title": "Planning with Complex Data Types in PDDL",
    "abstract": "Practically all of the planning research is limited to states represented in terms of Boolean and numeric state variables. Many practical problems, for example, planning inside complex software systems, require far more complex data types, and even real-world planning in many cases requires concepts such as sets of objects, which are not convenient to express in modeling languages with scalar types only. In this work, we investigate a modeling language for complex software systems, which supports complex data types such as sets, arrays, records, and unions. We give a reduction of a broad range of complex data types and their operations to Boolean logic, and then map this representation further to PDDL to be used with domain-independent PDDL planners. We evaluate the practicality of this approach, and provide solutions to some of the issues that arise in the PDDL translation. ",
    "url": "https://arxiv.org/abs/2212.14462",
    "authors": [
      "Mojtaba Elahi",
      "Jussi Rintanen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14479",
    "title": "Pensieve 5G: Implementation of RL-based ABR Algorithm for UHD 4K/8K  Content Delivery on Commercial 5G SA/NR-DC Network",
    "abstract": "While the rollout of the fifth-generation mobile network (5G) is underway across the globe with the intention to deliver 4K/8K UHD videos, Augmented Reality (AR), and Virtual Reality (VR) content to the mass amounts of users, the coverage and throughput are still one of the most significant issues, especially in the rural areas, where only 5G in the low-frequency band are being deployed. This called for a high-performance adaptive bitrate (ABR) algorithm that can maximize the user quality of experience given 5G network characteristics and data rate of UHD contents. Recently, many of the newly proposed ABR techniques were machine-learning based. Among that, Pensieve is one of the state-of-the-art techniques, which utilized reinforcement-learning to generate an ABR algorithm based on observation of past decision performance. By incorporating the context of the 5G network and UHD content, Pensieve has been optimized into Pensieve 5G. New QoE metrics that more accurately represent the QoE of UHD video streaming on the different types of devices were proposed and used to evaluate Pensieve 5G against other ABR techniques including the original Pensieve. The results from the simulation based on the real 5G Standalone (SA) network throughput shows that Pensieve 5G outperforms both conventional algorithms and Pensieve with the average QoE improvement of 8.8% and 14.2%, respectively. Additionally, Pensieve 5G also performed well on the commercial 5G NR-NR Dual Connectivity (NR-DC) Network, despite the training being done solely using the data from the 5G Standalone (SA) network. ",
    "url": "https://arxiv.org/abs/2212.14479",
    "authors": [
      "Kasidis Arunruangsirilert",
      "Bo Wei",
      "Hang Song",
      "Jiro Katto"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14486",
    "title": "Examining Political Rhetoric with Epistemic Stance Detection",
    "abstract": "Participants in political discourse employ rhetorical strategies -- such as hedging, attributions, or denials -- to display varying degrees of belief commitments to claims proposed by themselves or others. Traditionally, political scientists have studied these epistemic phenomena through labor-intensive manual content analysis. We propose to help automate such work through epistemic stance prediction, drawn from research in computational semantics, to distinguish at the clausal level what is asserted, denied, or only ambivalently suggested by the author or other mentioned entities (belief holders). We first develop a simple RoBERTa-based model for multi-source stance predictions that outperforms more complex state-of-the-art modeling. Then we demonstrate its novel application to political science by conducting a large-scale analysis of the Mass Market Manifestos corpus of U.S. political opinion books, where we characterize trends in cited belief holders -- respected allies and opposed bogeymen -- across U.S. political ideologies. ",
    "url": "https://arxiv.org/abs/2212.14486",
    "authors": [
      "Ankita Gupta",
      "Su Lin Blodgett",
      "Justin H Gross",
      "Brendan O'Connor"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.14490",
    "title": "Multi-modal deep learning system for depression and anxiety detection",
    "abstract": "Traditional screening practices for anxiety and depression pose an impediment to monitoring and treating these conditions effectively. However, recent advances in NLP and speech modelling allow textual, acoustic, and hand-crafted language-based features to jointly form the basis of future mental health screening and condition detection. Speech is a rich and readily available source of insight into an individual's cognitive state and by leveraging different aspects of speech, we can develop new digital biomarkers for depression and anxiety. To this end, we propose a multi-modal system for the screening of depression and anxiety from self-administered speech tasks. The proposed model integrates deep-learned features from audio and text, as well as hand-crafted features that are informed by clinically-validated domain knowledge. We find that augmenting hand-crafted features with deep-learned features improves our overall classification F1 score comparing to a baseline of hand-crafted features alone from 0.58 to 0.63 for depression and from 0.54 to 0.57 for anxiety. The findings of our work suggest that speech-based biomarkers for depression and anxiety hold significant promise in the future of digital health. ",
    "url": "https://arxiv.org/abs/2212.14490",
    "authors": [
      "Brian Diep",
      "Marija Stanojevic",
      "Jekaterina Novikova"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2212.14504",
    "title": "Improving Visual Representation Learning through Perceptual  Understanding",
    "abstract": "We present an extension to masked autoencoders (MAE) which improves on the representations learnt by the model by explicitly encouraging the learning of higher scene-level features. We do this by: (i) the introduction of a perceptual similarity term between generated and real images (ii) incorporating several techniques from the adversarial training literature including multi-scale training and adaptive discriminator augmentation. The combination of these results in not only better pixel reconstruction but also representations which appear to capture better higher-level details within images. More consequentially, we show how our method, Perceptual MAE, leads to better performance when used for downstream tasks outperforming previous methods. We achieve 78.1% top-1 accuracy linear probing on ImageNet-1K and up to 88.1% when fine-tuning, with similar results for other downstream tasks, all without use of additional pre-trained models or data. ",
    "url": "https://arxiv.org/abs/2212.14504",
    "authors": [
      "Samyakh Tukra",
      "Frederick Hoffman",
      "Ken Chatfield"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14532",
    "title": "Scale-MAE: A Scale-Aware Masked Autoencoder for Multiscale Geospatial  Representation Learning",
    "abstract": "Remote sensing imagery provides comprehensive views of the Earth, where different sensors collect complementary data at different spatial scales. Large, pretrained models are commonly finetuned with imagery that is heavily augmented to mimic different conditions and scales, with the resulting models used for various tasks with imagery from a range of spatial scales. Such models overlook scale-specific information in the data. In this paper, we present Scale-MAE, a pretraining method that explicitly learns relationships between data at different, known scales throughout the pretraining process. Scale-MAE pretrains a network by masking an input image at a known input scale, where the area of the Earth covered by the image determines the scale of the ViT positional encoding, not the image resolution. Scale-MAE encodes the masked image with a standard ViT backbone, and then decodes the masked image through a bandpass filter to reconstruct low/high frequency images at lower/higher scales. We find that tasking the network with reconstructing both low/high frequency images leads to robust multiscale representations for remote sensing imagery. Scale-MAE achieves an average of a $5.0\\%$ non-parametric kNN classification improvement across eight remote sensing datasets compared to current state-of-the-art and obtains a $0.9$ mIoU to $3.8$ mIoU improvement on the SpaceNet building segmentation transfer task for a range of evaluation scales. ",
    "url": "https://arxiv.org/abs/2212.14532",
    "authors": [
      "Colorado J. Reed",
      "Ritwik Gupta",
      "Shufan Li",
      "Sarah Brockman",
      "Christopher Funk",
      "Brian Clipp",
      "Christopher Funk",
      "Salvatore Candido",
      "Matt Uyttendaele",
      "Trevor Darrell"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14540",
    "title": "Layer Imbalance Aware Multiplex Network Embedding",
    "abstract": "Multiplex network embedding is an effective technique to jointly learn the low-dimensional representations of nodes across network layers. However, the number of edges among layers may vary significantly. This data imbalance will lead to performance degradation especially on the sparse layer due to learning bias and the adverse effects of irrelevant or conflicting data in other layers. In this paper, a Layer Imbalance Aware Multiplex Network Embedding (LIAMNE) method is proposed where the edges in auxiliary layers are under-sampled based on the node similarity in the embedding space of the target layer to achieve balanced edge distribution and to minimize noisy relations that are less relevant to the target layer. Real-world datasets with different degrees of layer imbalance are used for experimentation. The results demonstrate that LIAMNE significantly outperforms several state-of-the-art multiplex network embedding methods in link prediction on the target layer. Meantime, the comprehensive representation of the entire multiplex network is not compromised by the sampling method as evaluated by its performance on the node classification task. ",
    "url": "https://arxiv.org/abs/2212.14540",
    "authors": [
      "Kejia Chen",
      "Yinchu Qiu",
      "Zheng Liu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2212.14548",
    "title": "How would Stance Detection Techniques Evolve after the Launch of  ChatGPT?",
    "abstract": "Stance detection refers to the task of extracting the standpoint (Favor, Against or Neither) towards a target in given texts. Such research gains increasing attention with the proliferation of social media contents. The conventional framework of handling stance detection is converting it into text classification tasks. Deep learning models have already replaced rule-based models and traditional machine learning models in solving such problems. Current deep neural networks are facing two main challenges which are insufficient labeled data and information in social media posts and the unexplainable nature of deep learning models. A new pre-trained language model chatGPT was launched on Nov 30, 2022. For the stance detection tasks, our experiments show that ChatGPT can achieve SOTA or similar performance for commonly used datasets including SemEval-2016 and P-Stance. At the same time, ChatGPT can provide explanation for its own prediction, which is beyond the capability of any existing model. The explanations for the cases it cannot provide classification results are especially useful. ChatGPT has the potential to be the best AI model for stance detection tasks in NLP, or at least change the research paradigm of this field. ChatGPT also opens up the possibility of building explanatory AI for stance detection. ",
    "url": "https://arxiv.org/abs/2212.14548",
    "authors": [
      "Bowen Zhang",
      "Daijun Ding",
      "Liwen Jing"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.14566",
    "title": "Pontryagin Optimal Controller via Neural Networks",
    "abstract": "Solving real-world optimal control problems are challenging tasks, as the system dynamics can be highly non-linear or including nonconvex objectives and constraints, while in some cases the dynamics are unknown, making it hard to numerically solve the optimal control actions. To deal with such modeling and computation challenges, in this paper, we integrate Neural Networks with the Pontryagin's Minimum Principle (PMP), and propose a computationally efficient framework NN-PMP. The resulting controller can be implemented for systems with unknown and complex dynamics. It can not only utilize the accurate surrogate models parameterized by neural networks, but also efficiently recover the optimality conditions along with the optimal action sequences via PMP conditions. A toy example on a nonlinear Martian Base operation along with a real-world lossy energy storage arbitrage example demonstrates our proposed NN-PMP is a general and versatile computation tool for finding optimal solutions. Compared with solutions provided by the numerical optimization solver with approximated linear dynamics, NN-PMP achieves more efficient system modeling and higher performance in terms of control objectives. ",
    "url": "https://arxiv.org/abs/2212.14566",
    "authors": [
      "Chengyang Gu",
      "Yize Chen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14569",
    "title": "A Fine-Grained Vehicle Detection (FGVD) Dataset for Unconstrained Roads",
    "abstract": "The previous fine-grained datasets mainly focus on classification and are often captured in a controlled setup, with the camera focusing on the objects. We introduce the first Fine-Grained Vehicle Detection (FGVD) dataset in the wild, captured from a moving camera mounted on a car. It contains 5502 scene images with 210 unique fine-grained labels of multiple vehicle types organized in a three-level hierarchy. While previous classification datasets also include makes for different kinds of cars, the FGVD dataset introduces new class labels for categorizing two-wheelers, autorickshaws, and trucks. The FGVD dataset is challenging as it has vehicles in complex traffic scenarios with intra-class and inter-class variations in types, scale, pose, occlusion, and lighting conditions. The current object detectors like yolov5 and faster RCNN perform poorly on our dataset due to a lack of hierarchical modeling. Along with providing baseline results for existing object detectors on FGVD Dataset, we also present the results of a combination of an existing detector and the recent Hierarchical Residual Network (HRN) classifier for the FGVD task. Finally, we show that FGVD vehicle images are the most challenging to classify among the fine-grained datasets. ",
    "url": "https://arxiv.org/abs/2212.14569",
    "authors": [
      "Prafful Kumar Khoba",
      "Chirag Parikh",
      "Rohit Saluja",
      "Ravi Kiran Sarvadevabhatla",
      "C. V. Jawahar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14593",
    "title": "NIRVANA: Neural Implicit Representations of Videos with Adaptive  Networks and Autoregressive Patch-wise Modeling",
    "abstract": "Implicit Neural Representations (INR) have recently shown to be powerful tool for high-quality video compression. However, existing works are limiting as they do not explicitly exploit the temporal redundancy in videos, leading to a long encoding time. Additionally, these methods have fixed architectures which do not scale to longer videos or higher resolutions. To address these issues, we propose NIRVANA, which treats videos as groups of frames and fits separate networks to each group performing patch-wise prediction. This design shares computation within each group, in the spatial and temporal dimensions, resulting in reduced encoding time of the video. The video representation is modeled autoregressively, with networks fit on a current group initialized using weights from the previous group's model. To further enhance efficiency, we perform quantization of the network parameters during training, requiring no post-hoc pruning or quantization. When compared with previous works on the benchmark UVG dataset, NIRVANA improves encoding quality from 37.36 to 37.70 (in terms of PSNR) and the encoding speed by 12X, while maintaining the same compression rate. In contrast to prior video INR works which struggle with larger resolution and longer videos, we show that our algorithm is highly flexible and scales naturally due to its patch-wise and autoregressive designs. Moreover, our method achieves variable bitrate compression by adapting to videos with varying inter-frame motion. NIRVANA achieves 6X decoding speed and scales well with more GPUs, making it practical for various deployment scenarios. ",
    "url": "https://arxiv.org/abs/2212.14593",
    "authors": [
      "Shishira R Maiya",
      "Sharath Girish",
      "Max Ehrlich",
      "Hanyu Wang",
      "Kwot Sin Lee",
      "Patrick Poirson",
      "Pengxiang Wu",
      "Chen Wang",
      "Abhinav Shrivastava"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14597",
    "title": "Defense Against Adversarial Attacks on Audio DeepFake Detection",
    "abstract": "Audio DeepFakes are artificially generated utterances created using deep learning methods with the main aim to fool the listeners, most of such audio is highly convincing. Their quality is sufficient to pose a serious threat in terms of security and privacy, such as the reliability of news or defamation. To prevent the threats, multiple neural networks-based methods to detect generated speech have been proposed. In this work, we cover the topic of adversarial attacks, which decrease the performance of detectors by adding superficial (difficult to spot by a human) changes to input data. Our contribution contains evaluating the robustness of 3 detection architectures against adversarial attacks in two scenarios (white-box and using transferability mechanism) and enhancing it later by the use of adversarial training performed by our novel adaptive training method. ",
    "url": "https://arxiv.org/abs/2212.14597",
    "authors": [
      "Piotr Kawa",
      "Marcin Plata",
      "Piotr Syga"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2212.14612",
    "title": "Conformal Prediction Intervals for Remaining Useful Lifetime Estimation",
    "abstract": "The main objective of Prognostics and Health Management is to estimate the Remaining Useful Lifetime (RUL), namely, the time that a system or a piece of equipment is still in working order before starting to function incorrectly. In recent years, numerous machine learning algorithms have been proposed for RUL estimation, mainly focusing on providing more accurate RUL predictions. However, there are many sources of uncertainty in the problem, such as inherent randomness of systems failure, lack of knowledge regarding their future states, and inaccuracy of the underlying predictive models, making it infeasible to predict the RULs precisely. Hence, it is of utmost importance to quantify the uncertainty alongside the RUL predictions. In this work, we investigate the conformal prediction (CP) framework that represents uncertainty by predicting sets of possible values for the target variable (intervals in the case of RUL) instead of making point predictions. Under very mild technical assumptions, CP formally guarantees that the actual value (true RUL) is covered by the predicted set with a degree of certainty that can be prespecified. We study three CP algorithms to conformalize any single-point RUL predictor and turn it into a valid interval predictor. Finally, we conformalize two single-point RUL predictors, deep convolutional neural networks and gradient boosting, and illustrate their performance on the Commercial Modular Aero-Propulsion System Simulation (C-MAPSS) data sets. ",
    "url": "https://arxiv.org/abs/2212.14612",
    "authors": [
      "Alireza Javanmardi",
      "Eyke Hüllermeier"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2212.14621",
    "title": "Label-Efficient Interactive Time-Series Anomaly Detection",
    "abstract": "Time-series anomaly detection is an important task and has been widely applied in the industry. Since manual data annotation is expensive and inefficient, most applications adopt unsupervised anomaly detection methods, but the results are usually sub-optimal and unsatisfactory to end customers. Weak supervision is a promising paradigm for obtaining considerable labels in a low-cost way, which enables the customers to label data by writing heuristic rules rather than annotating each instance individually. However, in the time-series domain, it is hard for people to write reasonable labeling functions as the time-series data is numerically continuous and difficult to be understood. In this paper, we propose a Label-Efficient Interactive Time-Series Anomaly Detection (LEIAD) system, which enables a user to improve the results of unsupervised anomaly detection by performing only a small amount of interactions with the system. To achieve this goal, the system integrates weak supervision and active learning collaboratively while generating labeling functions automatically using only a few labeled data. All of these techniques are complementary and can promote each other in a reinforced manner. We conduct experiments on three time-series anomaly detection datasets, demonstrating that the proposed system is superior to existing solutions in both weak supervision and active learning areas. Also, the system has been tested in a real scenario in industry to show its practicality. ",
    "url": "https://arxiv.org/abs/2212.14621",
    "authors": [
      "Hong Guo",
      "Yujing Wang",
      "Jieyu Zhang",
      "Zhengjie Lin",
      "Yunhai Tong",
      "Lei Yang",
      "Luoxing Xiong",
      "Congrui Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14647",
    "title": "RL and Fingerprinting to Select Moving Target Defense Mechanisms for  Zero-day Attacks in IoT",
    "abstract": "Cybercriminals are moving towards zero-day attacks affecting resource-constrained devices such as single-board computers (SBC). Assuming that perfect security is unrealistic, Moving Target Defense (MTD) is a promising approach to mitigate attacks by dynamically altering target attack surfaces. Still, selecting suitable MTD techniques for zero-day attacks is an open challenge. Reinforcement Learning (RL) could be an effective approach to optimize the MTD selection through trial and error, but the literature fails when i) evaluating the performance of RL and MTD solutions in real-world scenarios, ii) studying whether behavioral fingerprinting is suitable for representing SBC's states, and iii) calculating the consumption of resources in SBC. To improve these limitations, the work at hand proposes an online RL-based framework to learn the correct MTD mechanisms mitigating heterogeneous zero-day attacks in SBC. The framework considers behavioral fingerprinting to represent SBCs' states and RL to learn MTD techniques that mitigate each malicious state. It has been deployed on a real IoT crowdsensing scenario with a Raspberry Pi acting as a spectrum sensor. More in detail, the Raspberry Pi has been infected with different samples of command and control malware, rootkits, and ransomware to later select between four existing MTD techniques. A set of experiments demonstrated the suitability of the framework to learn proper MTD techniques mitigating all attacks (except a harmfulness rootkit) while consuming <1 MB of storage and utilizing <55% CPU and <80% RAM. ",
    "url": "https://arxiv.org/abs/2212.14647",
    "authors": [
      "Alberto Huertas Celdrán",
      "Pedro Miguel Sánchez Sánchez",
      "Jan von der Assen",
      "Timo Schenk",
      "Gérôme Bovet",
      "Gregorio Martínez Pérez",
      "Burkhard Stiller"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14665",
    "title": "Distributionally Robust Planning Considering Wake Effect in Wind Farms  and Decision-Dependent Uncertainty",
    "abstract": "Wind power, as a green energy resource, grows rapidly worldwide. Wind farm planning has become an important problem to be addressed. Wake effect in a wind farm can cause wind speed deficits and a decrease in power generation of downstream wind turbines (WTs), which has a nonnegligible impact on wind farm planning but was seldom considered. In this paper, a bi-objective distributionally robust planning model for wind farms and energy storage systems (ESSs) is developed taking into account the wake effect. An ambiguity set based on Wasserstein metric is established to model the uncertainties. Since the wind power uncertainty is affected by the volatile wind speed and wind farm capacity decided in the first stage, the ambiguity set is decision-dependent. To solve the problem, we first propose a stochastic programming approximation with the help of minimum Lipschitz constants. Methods for evaluating the minimum Lipschitz constants are embedded into an iterative algorithm to solve the proposed model. Case studies demonstrate the necessity of considering the wake effect and show the effectiveness of the proposed method. ",
    "url": "https://arxiv.org/abs/2212.14665",
    "authors": [
      "Rui Xie",
      "Yue Chen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2212.14674",
    "title": "A Comprehensive Gold Standard and Benchmark for Comics Text Detection  and Recognition",
    "abstract": "This study focuses on improving the optical character recognition (OCR) data for panels in the COMICS dataset, the largest dataset containing text and images from comic books. To do this, we developed a pipeline for OCR processing and labeling of comic books and created the first text detection and recognition datasets for western comics, called \"COMICS Text+: Detection\" and \"COMICS Text+: Recognition\". We evaluated the performance of state-of-the-art text detection and recognition models on these datasets and found significant improvement in word accuracy and normalized edit distance compared to the text in COMICS. We also created a new dataset called \"COMICS Text+\", which contains the extracted text from the textboxes in the COMICS dataset. Using the improved text data of COMICS Text+ in the comics processing model from resulted in state-of-the-art performance on cloze-style tasks without changing the model architecture. The COMICS Text+ dataset can be a valuable resource for researchers working on tasks including text detection, recognition, and high-level processing of comics, such as narrative understanding, character relations, and story generation. All the data and inference instructions can be accessed in https://github.com/gsoykan/comics_text_plus. ",
    "url": "https://arxiv.org/abs/2212.14674",
    "authors": [
      "Gürkan Soykan",
      "Deniz Yuret",
      "Tevfik Metin Sezgin"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14675",
    "title": "Personality Detection of Applicants And Employees Using K-mode Algorithm  And Ocean Model",
    "abstract": "The combination of conduct, emotion, motivation, and thinking is referred to as personality. To shortlist candidates more effectively, many organizations rely on personality predictions. The firm can hire or pick the best candidate for the desired job description by grouping applicants based on the necessary personality preferences. A model is created to identify applicants' personality types so that employers may find qualified candidates by examining a person's facial expression, speech intonation, and resume. Additionally, the paper emphasises detecting the changes in employee behaviour. Employee attitudes and behaviour towards each set of questions are being examined and analysed. Here, the K-Modes clustering method is used to predict employee well-being, including job pressure, the working environment, and relationships with peers, utilizing the OCEAN Model and the CNN algorithm in the AVI-AI administrative system. Findings imply that AVIs can be used for efficient candidate screening with an AI decision agent. The study of the specific field is beyond the current explorations and needed to be expanded with deeper models and new configurations that can patch extremely complex operations. ",
    "url": "https://arxiv.org/abs/2212.14675",
    "authors": [
      "Binisha Mohan",
      "Dinju Vattavayalil Joseph",
      "Bharat Plavelil Subhash"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14677",
    "title": "Adversarial attacks and defenses on ML- and hardware-based IoT device  fingerprinting and identification",
    "abstract": "In the last years, the number of IoT devices deployed has suffered an undoubted explosion, reaching the scale of billions. However, some new cybersecurity issues have appeared together with this development. Some of these issues are the deployment of unauthorized devices, malicious code modification, malware deployment, or vulnerability exploitation. This fact has motivated the requirement for new device identification mechanisms based on behavior monitoring. Besides, these solutions have recently leveraged Machine and Deep Learning techniques due to the advances in this field and the increase in processing capabilities. In contrast, attackers do not stay stalled and have developed adversarial attacks focused on context modification and ML/DL evaluation evasion applied to IoT device identification solutions. This work explores the performance of hardware behavior-based individual device identification, how it is affected by possible context- and ML/DL-focused attacks, and how its resilience can be improved using defense techniques. In this sense, it proposes an LSTM-CNN architecture based on hardware performance behavior for individual device identification. Then, previous techniques have been compared with the proposed architecture using a hardware performance dataset collected from 45 Raspberry Pi devices running identical software. The LSTM-CNN improves previous solutions achieving a +0.96 average F1-Score and 0.8 minimum TPR for all devices. Afterward, context- and ML/DL-focused adversarial attacks were applied against the previous model to test its robustness. A temperature-based context attack was not able to disrupt the identification. However, some ML/DL state-of-the-art evasion attacks were successful. Finally, adversarial training and model distillation defense techniques are selected to improve the model resilience to evasion attacks, without degrading its performance. ",
    "url": "https://arxiv.org/abs/2212.14677",
    "authors": [
      "Pedro Miguel Sánchez Sánchez",
      "Alberto Huertas Celdrán",
      "Gérôme Bovet",
      "Gregorio Martínez Pérez"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14680",
    "title": "Semi-supervised Fashion Compatibility Prediction by Color Distortion  Prediction",
    "abstract": "Supervised learning methods have been suffering from the fact that a large-scale labeled dataset is mandatory, which is difficult to obtain. This has been a more significant issue for fashion compatibility prediction because compatibility aims to capture people's perception of aesthetics, which are sparse and changing. Thus, the labeled dataset may become outdated quickly due to fast fashion. Moreover, labeling the dataset always needs some expert knowledge; at least they should have a good sense of aesthetics. However, there are limited self/semi-supervised learning techniques in this field. In this paper, we propose a general color distortion prediction task forcing the baseline to recognize low-level image information to learn more discriminative representation for fashion compatibility prediction. Specifically, we first propose to distort the image by adjusting the image color balance, contrast, sharpness, and brightness. Then, we propose adding Gaussian noise to the distorted image before passing them to the convolutional neural network (CNN) backbone to learn a probability distribution over all possible distortions. The proposed pretext task is adopted in the state-of-the-art methods in fashion compatibility and shows its effectiveness in improving these methods' ability in extracting better feature representations. Applying the proposed pretext task to the baseline can consistently outperform the original baseline. ",
    "url": "https://arxiv.org/abs/2212.14680",
    "authors": [
      "Ling Xiao",
      "Toshihiko Yamasaki"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14718",
    "title": "Langevin algorithms for very deep Neural Networks with application to  image classification",
    "abstract": "Training a very deep neural network is a challenging task, as the deeper a neural network is, the more non-linear it is. We compare the performances of various preconditioned Langevin algorithms with their non-Langevin counterparts for the training of neural networks of increasing depth. For shallow neural networks, Langevin algorithms do not lead to any improvement, however the deeper the network is and the greater are the gains provided by Langevin algorithms. Adding noise to the gradient descent allows to escape from local traps, which are more frequent for very deep neural networks. Following this heuristic we introduce a new Langevin algorithm called Layer Langevin, which consists in adding Langevin noise only to the weights associated to the deepest layers. We then prove the benefits of Langevin and Layer Langevin algorithms for the training of popular deep residual architectures for image classification. ",
    "url": "https://arxiv.org/abs/2212.14718",
    "authors": [
      "Pierre Bras"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.14727",
    "title": "Countering Malicious Content Moderation Evasion in Online Social  Networks: Simulation and Detection of Word Camouflage",
    "abstract": "Content moderation is the process of screening and monitoring user-generated content online. It plays a crucial role in stopping content resulting from unacceptable behaviors such as hate speech, harassment, violence against specific groups, terrorism, racism, xenophobia, homophobia, or misogyny, to mention some few, in Online Social Platforms. These platforms make use of a plethora of tools to detect and manage malicious information; however, malicious actors also improve their skills, developing strategies to surpass these barriers and continuing to spread misleading information. Twisting and camouflaging keywords are among the most used techniques to evade platform content moderation systems. In response to this recent ongoing issue, this paper presents an innovative approach to address this linguistic trend in social networks through the simulation of different content evasion techniques and a multilingual Transformer model for content evasion detection. In this way, we share with the rest of the scientific community a multilingual public tool, named \"pyleetspeak\" to generate/simulate in a customizable way the phenomenon of content evasion through automatic word camouflage and a multilingual Named-Entity Recognition (NER) Transformer-based model tuned for its recognition and detection. The multilingual NER model is evaluated in different textual scenarios, detecting different types and mixtures of camouflage techniques, achieving an overall weighted F1 score of 0.8795. This article contributes significantly to countering malicious information by developing multilingual tools to simulate and detect new methods of evasion of content on social networks, making the fight against information disorders more effective. ",
    "url": "https://arxiv.org/abs/2212.14727",
    "authors": [
      "Álvaro Huertas-García",
      "Alejandro Martín",
      "Javier Huertas Tato",
      "David Camacho"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2212.14730",
    "title": "Machine Learning and Thermography Applied to the Detection and  Classification of Cracks in Building",
    "abstract": "Due to the environmental impacts caused by the construction industry, repurposing existing buildings and making them more energy-efficient has become a high-priority issue. However, a legitimate concern of land developers is associated with the buildings' state of conservation. For that reason, infrared thermography has been used as a powerful tool to characterize these buildings' state of conservation by detecting pathologies, such as cracks and humidity. Thermal cameras detect the radiation emitted by any material and translate it into temperature-color-coded images. Abnormal temperature changes may indicate the presence of pathologies, however, reading thermal images might not be quite simple. This research project aims to combine infrared thermography and machine learning (ML) to help stakeholders determine the viability of reusing existing buildings by identifying their pathologies and defects more efficiently and accurately. In this particular phase of this research project, we've used an image classification machine learning model of Convolutional Neural Networks (DCNN) to differentiate three levels of cracks in one particular building. The model's accuracy was compared between the MSX and thermal images acquired from two distinct thermal cameras and fused images (formed through multisource information) to test the influence of the input data and network on the detection results. ",
    "url": "https://arxiv.org/abs/2212.14730",
    "authors": [
      "Angela Busheska",
      "Nara Almeida",
      "Nicholas Sabella",
      "Eudes de A. Rocha"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14731",
    "title": "UBIWEAR: An end-to-end, data-driven framework for intelligent physical  activity prediction to empower mHealth interventions",
    "abstract": "It is indisputable that physical activity is vital for an individual's health and wellness. However, a global prevalence of physical inactivity has induced significant personal and socioeconomic implications. In recent years, a significant amount of work has showcased the capabilities of self-tracking technology to create positive health behavior change. This work is motivated by the potential of personalized and adaptive goal-setting techniques in encouraging physical activity via self-tracking. To this end, we propose UBIWEAR, an end-to-end framework for intelligent physical activity prediction, with the ultimate goal to empower data-driven goal-setting interventions. To achieve this, we experiment with numerous machine learning and deep learning paradigms as a robust benchmark for physical activity prediction tasks. To train our models, we utilize, \"MyHeart Counts\", an open, large-scale dataset collected in-the-wild from thousands of users. We also propose a prescriptive framework for self-tracking aggregated data preprocessing, to facilitate data wrangling of real-world, noisy data. Our best model achieves a MAE of 1087 steps, 65% lower than the state of the art in terms of absolute error, proving the feasibility of the physical activity prediction task, and paving the way for future research. ",
    "url": "https://arxiv.org/abs/2212.14731",
    "authors": [
      "Asterios Bampakis",
      "Sofia Yfantidou",
      "Athena Vakali"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2212.14736",
    "title": "PRISM: Privacy Preserving Internet of Things Security Management",
    "abstract": "Consumer healthcare applications are gaining increasing popularity in our homes and hospitals. These devices provide continuous monitoring at a low cost and can be used to augment high-precision medical devices. The majority of these devices aim to provide anomaly detection for the users while aiming to provide data privacy and security by design using edge computing. However, major challenges remain in applying pre-trained global models on smart health monitoring devices, for a diverse set of individuals that they provide care for. In this paper, we propose PRISM, an edge-based system for in-home smart healthcare anomaly detection. We develop and release a rigorous methodology that relies on automated IoT anomaly experimentation. We use a rich, highly granular real-world dataset from in-home patient monitoring from 44 homes of people living with dementia (PLWD) over two years. Our results indicate that the anomalies can be identified with accuracy up to 99% and mean training times as low as 0.88 seconds. While all models achieve high accuracy when trained on the same patient, their accuracy degrades when evaluated on different patients. ",
    "url": "https://arxiv.org/abs/2212.14736",
    "authors": [
      "Savvas Hadjixenophontos",
      "Anna Maria Mandalari",
      "Yuchen Zhao",
      "Hamed Haddadi"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2212.14742",
    "title": "DGFont++: Robust Deformable Generative Networks for Unsupervised Font  Generation",
    "abstract": "Automatic font generation without human experts is a practical and significant problem, especially for some languages that consist of a large number of characters. Existing methods for font generation are often in supervised learning. They require a large number of paired data, which are labor-intensive and expensive to collect. In contrast, common unsupervised image-to-image translation methods are not applicable to font generation, as they often define style as the set of textures and colors. In this work, we propose a robust deformable generative network for unsupervised font generation (abbreviated as DGFont++). We introduce a feature deformation skip connection (FDSC) to learn local patterns and geometric transformations between fonts. The FDSC predicts pairs of displacement maps and employs the predicted maps to apply deformable convolution to the low-level content feature maps. The outputs of FDSC are fed into a mixer to generate final results. Moreover, we introduce contrastive self-supervised learning to learn a robust style representation for fonts by understanding the similarity and dissimilarities of fonts. To distinguish different styles, we train our model with a multi-task discriminator, which ensures that each style can be discriminated independently. In addition to adversarial loss, another two reconstruction losses are adopted to constrain the domain-invariant characteristics between generated images and content images. Taking advantage of FDSC and the adopted loss functions, our model is able to maintain spatial information and generates high-quality character images in an unsupervised manner. Experiments demonstrate that our model is able to generate character images of higher quality than state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2212.14742",
    "authors": [
      "Xinyuan Chen",
      "Yangchen Xie",
      "Li Sun",
      "Yue Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14755",
    "title": "Secure Fusion Estimation Against FDI Sensor Attacks in Cyber-Physical  Systems",
    "abstract": "This paper is concerned with the problem of secure multi-sensors fusion estimation for cyber-physical systems, where sensor measurements may be tampered with by false data injection (FDI) attacks. In this work, it is considered that the adversary may not be able to attack all sensors. That is, several sensors remain not being attacked. In this case, new local reorganized subsystems including the FDI attack signals and un-attacked sensor measurements are constructed by the augmentation method. Then, a joint Kalman fusion estimator is designed under linear minimum variance sense to estimate the system state and FDI attack signals simultaneously. Finally, illustrative examples are employed to show the effectiveness and advantages of the proposed methods. ",
    "url": "https://arxiv.org/abs/2212.14755",
    "authors": [
      "Bo Chen",
      "Pindi Weng",
      "Daniel W.C. Ho",
      "Li Yu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2212.14776",
    "title": "On the Interpretability of Attention Networks",
    "abstract": "Attention mechanisms form a core component of several successful deep learning architectures, and are based on one key idea: ''The output depends only on a small (but unknown) segment of the input.'' In several practical applications like image captioning and language translation, this is mostly true. In trained models with an attention mechanism, the outputs of an intermediate module that encodes the segment of input responsible for the output is often used as a way to peek into the `reasoning` of the network. We make such a notion more precise for a variant of the classification problem that we term selective dependence classification (SDC) when used with attention model architectures. Under such a setting, we demonstrate various error modes where an attention model can be accurate but fail to be interpretable, and show that such models do occur as a result of training. We illustrate various situations that can accentuate and mitigate this behaviour. Finally, we use our objective definition of interpretability for SDC tasks to evaluate a few attention model learning algorithms designed to encourage sparsity and demonstrate that these algorithms help improve interpretability. ",
    "url": "https://arxiv.org/abs/2212.14776",
    "authors": [
      "Lakshmi Narayan Pandey",
      "Rahul Vashisht",
      "Harish G. Ramaswamy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14784",
    "title": "Neural Volumetric Blendshapes: Computationally Efficient Physics-Based  Facial Blendshapes",
    "abstract": "Computationally weak systems and demanding graphical applications are still mostly dependent on linear blendshapes for facial animations. The accompanying artifacts such as self-intersections, loss of volume, or missing soft tissue elasticity can be avoided by using physics-based animation models. However, these are cumbersome to implement and require immense computational effort. We propose neural volumetric blendshapes, an approach that combines the advantages of physics-based simulations with realtime runtimes even on consumer-grade CPUs. To this end, we present a neural network that efficiently approximates the involved volumetric simulations and generalizes across human identities as well as facial expressions. Our approach can be used on top of any linear blendshape system and, hence, can be deployed straightforwardly. Furthermore, it only requires a single neutral face mesh as input in the minimal setting. Along with the design of the network, we introduce a pipeline for the challenging creation of anatomically and physically plausible training data. Part of the pipeline is a novel hybrid regressor that densely positions a skull within a skin surface while avoiding intersections. The fidelity of all parts of the data generation pipeline as well as the accuracy and efficiency of the network are evaluated in this work. Upon publication, the trained models and associated code will be released. ",
    "url": "https://arxiv.org/abs/2212.14784",
    "authors": [
      "Nicolas Wagner",
      "Ulrich Schwanecke",
      "Mario Botsch"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2212.14810",
    "title": "On Machine Learning Knowledge Representation In The Form Of Partially  Unitary Operator. Knowledge Generalizing Operator",
    "abstract": "A new form of ML knowledge representation with high generalization power is developed and implemented numerically. Initial $\\mathit{IN}$ attributes and $\\mathit{OUT}$ class label are transformed into the corresponding Hilbert spaces by considering localized wavefunctions. A partially unitary operator optimally converting a state from $\\mathit{IN}$ Hilbert space into $\\mathit{OUT}$ Hilbert space is then built from an optimization problem of transferring maximal possible probability from $\\mathit{IN}$ to $\\mathit{OUT}$, this leads to the formulation of a new algebraic problem. Constructed Knowledge Generalizing Operator $\\mathcal{U}$ can be considered as a $\\mathit{IN}$ to $\\mathit{OUT}$ quantum channel; it is a partially unitary rectangular matrix of the dimension $\\mathrm{dim}(\\mathit{OUT}) \\times \\mathrm{dim}(\\mathit{IN})$ transforming operators as $A^{\\mathit{OUT}}=\\mathcal{U} A^{\\mathit{IN}} \\mathcal{U}^{\\dagger}$. Whereas only operator $\\mathcal{U}$ projections squared are observable $\\left\\langle\\mathit{OUT}|\\mathcal{U}|\\mathit{IN}\\right\\rangle^2$ (probabilities), the fundamental equation is formulated for the operator $\\mathcal{U}$ itself. This is the reason of high generalizing power of the approach; the situation is the same as for the Schr\\\"{o}dinger equation: we can only measure $\\psi^2$, but the equation is written for $\\psi$ itself. ",
    "url": "https://arxiv.org/abs/2212.14810",
    "authors": [
      "Vladislav Gennadievich Malyshkin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2212.14825",
    "title": "A projection-based reduced-order model for parametric quasi-static  nonlinear mechanics using an open-source industrial code",
    "abstract": "We propose a projection-based model order reduction procedure for a general class of parametric quasi-static problems in nonlinear mechanics with internal variables. The methodology is integrated in the industrial finite element code code aster. Model order reduction aims to lower the computational cost of engineering studies that involve the simulation to a costly high-fidelity differential model for many different parameters, which correspond, for example to material properties or initial and boundary conditions. We develop an adaptive algorithm based on a POD-Greedy strategy, and we develop an hyper-reduction strategy based on an element-wise empirical quadrature in order to speed up the assembly costs of the reduced-order model by building an appropriate reduced mesh. We introduce a cost-efficient error indicator which relies on the reconstruction of the stress field by a Gappy-POD strategy. We present numerical results for a three-dimensional elastoplastic system in order to illustrate and validate the methodology. ",
    "url": "https://arxiv.org/abs/2212.14825",
    "authors": [
      "Eki Agouzal",
      "Jean-Philippe Argaud",
      "Michel Bergmann",
      "Guilhem Ferté",
      "Tommaso Taddei"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2212.14830",
    "title": "Design and Optimisation of High-Speed Receivers for 6G Optical Wireless  Networks",
    "abstract": "To achieve multi-Gb/s data rates in 6G optical wireless access networks based on narrow infrared (IR) laser beams, a high-speed receiver with two key specifications is needed: a sufficiently large aperture to collect the required optical power and a wide field of view (FOV) to avoid strict alignment issues. This paper puts forward the systematic design and optimisation of multi-tier non-imaging angle diversity receivers (ADRs) composed of compound parabolic concentrators (CPCs) coupled with photodiode (PD) arrays for laser-based optical wireless communication (OWC) links. Design tradeoffs include the gain-FOV tradeoff for each receiver element and the area-bandwidth tradeoff for each PD array. The rate maximisation is formulated as a non-convex optimisation problem under the constraints on the minimum required FOV and the overall ADR dimensions to find optimum configuration of the receiver bandwidth and FOV, and a low-complexity optimal solution is proposed. The ADR performance is studied using computer simulations and insightful design guidelines are provided through various numerical examples. An efficient technique is also proposed to reduce the ADR dimensions based on CPC length truncation. It is shown that a compact ADR with a height of $\\leq0.5$ cm and an effective area of $\\leq0.5$ cm$^2$ reaches a data rate of $12$ Gb/s with a half-angle FOV of $30^\\circ$ over a $3$ m link distance. ",
    "url": "https://arxiv.org/abs/2212.14830",
    "authors": [
      "Elham Sarbazi",
      "Hossein Kazemi",
      "Michael Crisp",
      "Taisir El-Gorashi",
      "Jaafar Elmirghani",
      "Richard Penty",
      "Ian White",
      "Majid Safari",
      "Harald Haas"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2212.14855",
    "title": "Disentangled Explanations of Neural Network Predictions by Finding  Relevant Subspaces",
    "abstract": "Explainable AI transforms opaque decision strategies of ML models into explanations that are interpretable by the user, for example, identifying the contribution of each input feature to the prediction at hand. Such explanations, however, entangle the potentially multiple factors that enter into the overall complex decision strategy. We propose to disentangle explanations by finding relevant subspaces in activation space that can be mapped to more abstract human-understandable concepts and enable a joint attribution on concepts and input features. To automatically extract the desired representation, we propose new subspace analysis formulations that extend the principle of PCA and subspace analysis to explanations. These novel analyses, which we call principal relevant component analysis (PRCA) and disentangled relevant subspace analysis (DRSA), optimize relevance of projected activations rather than the more traditional variance or kurtosis. This enables a much stronger focus on subspaces that are truly relevant for the prediction and the explanation, in particular, ignoring activations or concepts to which the prediction model is invariant. Our approach is general enough to work alongside common attribution techniques such as Shapley Value, Integrated Gradients, or LRP. Our proposed methods show to be practically useful and compare favorably to the state of the art as demonstrated on benchmarks and three use cases. ",
    "url": "https://arxiv.org/abs/2212.14855",
    "authors": [
      "Pattarawat Chormai",
      "Jan Herrmann",
      "Klaus-Robert Müller",
      "Grégoire Montavon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14875",
    "title": "Guidance Through Surrogate: Towards a Generic Diagnostic Attack",
    "abstract": "Adversarial training is an effective approach to make deep neural networks robust against adversarial attacks. Recently, different adversarial training defenses are proposed that not only maintain a high clean accuracy but also show significant robustness against popular and well studied adversarial attacks such as PGD. High adversarial robustness can also arise if an attack fails to find adversarial gradient directions, a phenomenon known as `gradient masking'. In this work, we analyse the effect of label smoothing on adversarial training as one of the potential causes of gradient masking. We then develop a guided mechanism to avoid local minima during attack optimization, leading to a novel attack dubbed Guided Projected Gradient Attack (G-PGA). Our attack approach is based on a `match and deceive' loss that finds optimal adversarial directions through guidance from a surrogate model. Our modified attack does not require random restarts, large number of attack iterations or search for an optimal step-size. Furthermore, our proposed G-PGA is generic, thus it can be combined with an ensemble attack strategy as we demonstrate for the case of Auto-Attack, leading to efficiency and convergence speed improvements. More than an effective attack, G-PGA can be used as a diagnostic tool to reveal elusive robustness due to gradient masking in adversarial defenses. ",
    "url": "https://arxiv.org/abs/2212.14875",
    "authors": [
      "Muzammal Naseer",
      "Salman Khan",
      "Fatih Porikli",
      "Fahad Shahbaz Khan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14876",
    "title": "Reliable and Distributed Network Monitoring via In-band Network  Telemetry",
    "abstract": "Traditional network monitoring solutions usually lack of scalability due to their centralized nature collecting heartbeats from all network components via a single controller. As a solution, In-Band Network Telemetry (INT) framework has been recently proposed to collect network telemetry information more autonomously and distributedly by employing programmable switches. However, it imposes further challenges to (i) find suitable INT paths to optimize the control overhead and information freshness and (ii) ensure reliable delivery of control information over multi-hop INT paths. In this work, we propose a monitoring scheme, reliable Graph Partitioned INT (GPINT), by extending our previous work and integrating shared queue ring (SQR) as a reliability feature against potential failures in network telemetry collection due to network congestion and link degradation that may cause loss of the visibility of the network. We implement our proposal in a recent data plane programming language P4, and compare it with traditional Simple Network Management Protocol (SNMP) and also another state-of-the-art study employing Euler's method for INT path generation. Our analysis first shows the importance of having a data recovery mechanism against packet losses under different network conditions. Then, our emulation results indicate that GPINT with reliability extension performs much better than its opponent in terms of telemetry collection latency and overhead monitoring scheme even under a high amount of packet losses. ",
    "url": "https://arxiv.org/abs/2212.14876",
    "authors": [
      "Goksel Simsek",
      "Doğanalp Ergenç",
      "Ertan Onur"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2212.14884",
    "title": "Immunization Strategies Based on the Overlapping Nodes in Networks with  Community Structure",
    "abstract": "Understanding how the network topology affects the spread of an epidemic is a main concern in order to develop efficient immunization strategies. While there is a great deal of work dealing with the macroscopic topological properties of the networks, few studies have been devoted to the influence of the community structure. Furthermore, while in many real-world networks communities may overlap, in these studies non-overlapping community structures are considered. In order to gain insight about the influence of the overlapping nodes in the epidemic process we conduct an empirical evaluation of basic deterministic immunization strategies based on the overlapping nodes. Using the classical SIR model on a real-world network with ground truth overlapping community structure we analyse how immunization based on the membership number of overlapping nodes (which is the number of communities the node belongs to) affect the largest connected component size. Comparison with random immunization strategies designed for networks with non-overlapping community structure show that overlapping nodes play a major role in the epidemic process. ",
    "url": "https://arxiv.org/abs/2212.14884",
    "authors": [
      "Debayan Chakraborty",
      "Anurag Singh",
      "Hocine Cherifi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2212.14041",
    "title": "RFold: Towards Simple yet Effective RNA Secondary Structure Prediction",
    "abstract": "The secondary structure of ribonucleic acid (RNA) is more stable and accessible in the cell than its tertiary structure, making it essential in functional prediction. Though deep learning has shown promising results in this field, current methods suffer from either the post-processing step with a poor generalization or the pre-processing step with high complexity. In this work, we present RFold, a simple yet effective RNA secondary structure prediction in an end-to-end manner. RFold introduces novel Row-Col Softmax and Row-Col Argmax functions to replace the complicated post-processing step while the output is guaranteed to be valid. Moreover, RFold adopts attention maps as informative representations instead of designing hand-crafted features in the pre-processing step. Extensive experiments demonstrate that RFold achieves competitive performance and about eight times faster inference efficiency than the state-of-the-art method. The code and Colab demo are available in \\href{github.com/A4Bio/RFold}{github.com/A4Bio/RFold}. ",
    "url": "https://arxiv.org/abs/2212.14041",
    "authors": [
      "Cheng Tan",
      "Zhangyang Gao",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14042",
    "title": "FunkNN: Neural Interpolation for Functional Generation",
    "abstract": "Can we build continuous generative models which generalize across scales, can be evaluated at any coordinate, admit calculation of exact derivatives, and are conceptually simple? Existing MLP-based architectures generate worse samples than the grid-based generators with favorable convolutional inductive biases. Models that focus on generating images at different scales do better, but employ complex architectures not designed for continuous evaluation of images and derivatives. We take a signal-processing perspective and treat continuous image generation as interpolation from samples. Indeed, correctly sampled discrete images contain all information about the low spatial frequencies. The question is then how to extrapolate the spectrum in a data-driven way while meeting the above design criteria. Our answer is FunkNN -- a new convolutional network which learns how to reconstruct continuous images at arbitrary coordinates and can be applied to any image dataset. Combined with a discrete generative model it becomes a functional generator which can act as a prior in continuous ill-posed inverse problems. We show that FunkNN generates high-quality continuous images and exhibits strong out-of-distribution performance thanks to its patch-based design. We further showcase its performance in several stylized inverse problems with exact spatial derivatives. ",
    "url": "https://arxiv.org/abs/2212.14042",
    "authors": [
      "AmirEhsan Khorashadizadeh",
      "Anadi Chaman",
      "Valentin Debarnot",
      "Ivan Dokmanić"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14051",
    "title": "Power Control for 6G Industrial Wireless Subnetworks: A Graph Neural  Network Approach",
    "abstract": "6th Generation (6G) industrial wireless subnetworks are expected to replace wired connectivity for control operation in robots and production modules. Interference management techniques such as centralized power control can improve spectral efficiency in dense deployments of such subnetworks. However, existing solutions for centralized power control may require full channel state information (CSI) of all the desired and interfering links, which may be cumbersome and time-consuming to obtain in dense deployments. This paper presents a novel solution for centralized power control for industrial subnetworks based on Graph Neural Networks (GNNs). The proposed method only requires the subnetwork positioning information, usually known at the central controller, and the knowledge of the desired link channel gain during the execution phase. Simulation results show that our solution achieves similar spectral efficiency as the benchmark schemes requiring full CSI in runtime operations. Also, robustness to changes in the deployment density and environment characteristics with respect to the training phase is verified. ",
    "url": "https://arxiv.org/abs/2212.14051",
    "authors": [
      "Daniel Abode",
      "Ramoni Adeogun",
      "Gilberto Berardinelli"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2212.14076",
    "title": "Quantum-Inspired Tensor Neural Networks for Option Pricing",
    "abstract": "Recent advances in deep learning have enabled us to address the curse of dimensionality (COD) by solving problems in higher dimensions. A subset of such approaches of addressing the COD has led us to solving high-dimensional PDEs. This has resulted in opening doors to solving a variety of real-world problems ranging from mathematical finance to stochastic control for industrial applications. Although feasible, these deep learning methods are still constrained by training time and memory. Tackling these shortcomings, Tensor Neural Networks (TNN) demonstrate that they can provide significant parameter savings while attaining the same accuracy as compared to the classical Dense Neural Network (DNN). In addition, we also show how TNN can be trained faster than DNN for the same accuracy. Besides TNN, we also introduce Tensor Network Initializer (TNN Init), a weight initialization scheme that leads to faster convergence with smaller variance for an equivalent parameter count as compared to a DNN. We benchmark TNN and TNN Init by applying them to solve the parabolic PDE associated with the Heston model, which is widely used in financial pricing theory. ",
    "url": "https://arxiv.org/abs/2212.14076",
    "authors": [
      "Raj G. Patel",
      "Chia-Wei Hsing",
      "Serkan Sahin",
      "Samuel Palmer",
      "Saeed S. Jahromi",
      "Shivam Sharma",
      "Tomas Dominguez",
      "Kris Tziritas",
      "Christophe Michel",
      "Vincent Porte",
      "Mustafa Abid",
      "Stephane Aubert",
      "Pierre Castellani",
      "Samuel Mugel",
      "Roman Orus"
    ],
    "subjectives": [
      "Pricing of Securities (q-fin.PR)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2212.14253",
    "title": "Discovering Efficient Periodic Behaviours in Mechanical Systems via  Neural Approximators",
    "abstract": "It is well known that conservative mechanical systems exhibit local oscillatory behaviours due to their elastic and gravitational potentials, which completely characterise these periodic motions together with the inertial properties of the system. The classification of these periodic behaviours and their geometric characterisation are in an on-going secular debate, which recently led to the so-called eigenmanifold theory. The eigenmanifold characterises nonlinear oscillations as a generalisation of linear eigenspaces. With the motivation of performing periodic tasks efficiently, we use tools coming from this theory to construct an optimization problem aimed at inducing desired closed-loop oscillations through a state feedback law. We solve the constructed optimization problem via gradient-descent methods involving neural networks. Extensive simulations show the validity of the approach. ",
    "url": "https://arxiv.org/abs/2212.14253",
    "authors": [
      "Yannik Wotte",
      "Sven Dummer",
      "Nicolò Botteghi",
      "Christoph Brune",
      "Stefano Stramigioli",
      "Federico Califano"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2212.14424",
    "title": "Invertible normalizing flow neural networks by JKO scheme",
    "abstract": "Normalizing flow is a class of deep generative models for efficient sampling and density estimation. In practice, the flow often appears as a chain of invertible neural network blocks; to facilitate training, existing works have regularized flow trajectories and designed special network architectures. The current paper develops a neural ODE flow network inspired by the Jordan-Kinderleherer-Otto (JKO) scheme, which allows efficient block-wise training of the residual blocks and avoids inner loops of score matching or variational learning. As the JKO scheme unfolds the dynamic of gradient flow, the proposed model naturally stacks residual network blocks one-by-one, reducing the memory load and difficulty of performing end-to-end training of deep flow networks. We also develop adaptive time reparameterization of the flow network with a progressive refinement of the trajectory in probability space, which improves the model training efficiency and accuracy in practice. Using numerical experiments with synthetic and real data, we show that the proposed JKO-iFlow model achieves similar or better performance in generating new samples compared with existing flow and diffusion models at a significantly reduced computational and memory cost. ",
    "url": "https://arxiv.org/abs/2212.14424",
    "authors": [
      "Chen Xu",
      "Xiuyuan Cheng",
      "Yao Xie"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14426",
    "title": "Restricting to the chip architecture maintains the quantum neural  network accuracy, if the parameterization is a $2$-design",
    "abstract": "In the era of noisy intermediate scale quantum devices, variational quantum circuits (VQCs) are currently one of the main strategies for building quantum machine learning models. These models are made up of a quantum part and a classical part. The quantum part is given by a parametrization $U$, which, in general, is obtained from the product of different quantum gates. By its turn, the classical part corresponds to an optimizer that updates the parameters of $U$ in order to minimize a cost function $C$. However, despite the many applications of VQCs, there are still questions to be answered, such as for example: What is the best sequence of gates to be used? How to optimize their parameters? Which cost function to use? How the architecture of the quantum chips influences the final results? In this article, we focus on answering the last question. We will show that, in general, the cost function will tend to a typical average value the closer the parameterization used is from a $2$-design. Therefore, the closer this parameterization is to a $2$-design, the less the result of the quantum neural network model will depend on its parametrization. As a consequence, we can use the own architecture of the quantum chips to defined the VQC parametrization, avoiding the use of additional swap gates and thus diminishing the VQC depth and the associated errors. ",
    "url": "https://arxiv.org/abs/2212.14426",
    "authors": [
      "Lucas Friedrich",
      "Jonas Maziero"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14457",
    "title": "Bayesian Interpolation with Deep Linear Networks",
    "abstract": "This article concerns Bayesian inference using deep linear networks with output dimension one. In the interpolating (zero noise) regime we show that with Gaussian weight priors and MSE negative log-likelihood loss both the predictive posterior and the Bayesian model evidence can be written in closed form in terms of a class of meromorphic special functions called Meijer-G functions. These results are non-asymptotic and hold for any training dataset, network depth, and hidden layer widths, giving exact solutions to Bayesian interpolation using a deep Gaussian process with a Euclidean covariance at each layer. Through novel asymptotic expansions of Meijer-G functions, a rich new picture of the role of depth emerges. Specifically, we find: ${\\bf \\text{The role of depth in extrapolation}}$: The posteriors in deep linear networks with data-independent priors are the same as in shallow networks with evidence maximizing data-dependent priors. In this sense, deep linear networks make provably optimal predictions. ${\\bf \\text{The role of depth in model selection}}$: Starting from data-agnostic priors, Bayesian model evidence in wide networks is only maximized at infinite depth. This gives a principled reason to prefer deeper networks (at least in the linear case). ${\\bf \\text{Scaling laws relating depth, width, and number of datapoints}}$: With data-agnostic priors, a novel notion of effective depth given by \\[\\#\\text{hidden layers}\\times\\frac{\\#\\text{training data}}{\\text{network width}}\\] determines the Bayesian posterior in wide linear networks, giving rigorous new scaling laws for generalization error. ",
    "url": "https://arxiv.org/abs/2212.14457",
    "authors": [
      "Boris Hanin",
      "Alexander Zlokapa"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2212.14580",
    "title": "Heterogeneous Synthetic Learner for Panel Data",
    "abstract": "In the new era of personalization, learning the heterogeneous treatment effect (HTE) becomes an inevitable trend with numerous applications. Yet, most existing HTE estimation methods focus on independently and identically distributed observations and cannot handle the non-stationarity and temporal dependency in the common panel data setting. The treatment evaluators developed for panel data, on the other hand, typically ignore the individualized information. To fill the gap, in this paper, we initialize the study of HTE estimation in panel data. Under different assumptions for HTE identifiability, we propose the corresponding heterogeneous one-side and two-side synthetic learner, namely H1SL and H2SL, by leveraging the state-of-the-art HTE estimator for non-panel data and generalizing the synthetic control method that allows flexible data generating process. We establish the convergence rates of the proposed estimators. The superior performance of the proposed methods over existing ones is demonstrated by extensive numerical studies. ",
    "url": "https://arxiv.org/abs/2212.14580",
    "authors": [
      "Ye Shen",
      "Runzhe Wan",
      "Hengrui Cai",
      "Rui Song"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2212.14687",
    "title": "Multi-step-ahead Stock Price Prediction Using Recurrent Fuzzy Neural  Network and Variational Mode Decomposition",
    "abstract": "Financial time series prediction, a growing research topic, has attracted considerable interest from scholars, and several approaches have been developed. Among them, decomposition-based methods have achieved promising results. Most decomposition-based methods approximate a single function, which is insufficient for obtaining accurate results. Moreover, most existing researches have concentrated on one-step-ahead forecasting that prevents stock market investors from arriving at the best decisions for the future. This study proposes two novel methods for multi-step-ahead stock price prediction based on the issues outlined. DCT-MFRFNN, a method based on discrete cosine transform (DCT) and multi-functional recurrent fuzzy neural network (MFRFNN), uses DCT to reduce fluctuations in the time series and simplify its structure and MFRFNN to predict the stock price. VMD-MFRFNN, an approach based on variational mode decomposition (VMD) and MFRFNN, brings together their advantages. VMD-MFRFNN consists of two phases. The input signal is decomposed to several IMFs using VMD in the decomposition phase. In the prediction and reconstruction phase, each of the IMFs is given to a separate MFRFNN for prediction, and predicted signals are summed to reconstruct the output. Three financial time series, including Hang Seng Index (HSI), Shanghai Stock Exchange (SSE), and Standard & Poor's 500 Index (SPX), are used for the evaluation of the proposed methods. Experimental results indicate that VMD-MFRFNN surpasses other state-of-the-art methods. VMD-MFRFNN, on average, shows 35.93%, 24.88%, and 34.59% decreases in RMSE from the second-best model for HSI, SSE, and SPX, respectively. Also, DCT-MFRFNN outperforms MFRFNN in all experiments. ",
    "url": "https://arxiv.org/abs/2212.14687",
    "authors": [
      "Hamid Nasiri",
      "Mohammad Mehdi Ebadzadeh"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14694",
    "title": "Machine Learning as an Accurate Predictor for Percolation Threshold of  Diverse Networks",
    "abstract": "Percolation threshold is an important measure to determine the inherent rigidity of large networks. Predictors of the percolation threshold for large networks are computationally intense to run, hence it is a necessity to develop predictors of the percolation threshold of networks, that do not rely on numerical simulations. We demonstrate the efficacy of five machine learning-based regression techniques for the accurate prediction of the percolation threshold. The dataset generated to train the machine learning models contains a total of 777 real and synthetic networks and consists of 5 statistical and structural properties of networks as features and the numerically computed percolation threshold as the output attribute. We establish that the machine learning models outperform three existing empirical estimators of bond percolation threshold, and extend this experiment to predict site and explosive percolation. We also compare the performance of our models in predicting the percolation threshold and find that the gradient boosting regressor, multilayer perceptron and random forests regression models achieve the least RMSE values among the models utilized. ",
    "url": "https://arxiv.org/abs/2212.14694",
    "authors": [
      "Siddharth Patwardhan",
      "Utso Majumder",
      "Aditya Das Sarma",
      "Mayukha Pal",
      "Divyanshi Dwivedi",
      "Prasanta K. Panigrahi"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2212.14717",
    "title": "NISQ-ready community detection based on separation-node identification",
    "abstract": "The analysis of network structure is essential to many scientific areas, ranging from biology to sociology. As the computational task of clustering these networks into partitions, i.e., solving the community detection problem, is generally NP-hard, heuristic solutions are indispensable. The exploration of expedient heuristics has led to the development of particularly promising approaches in the emerging technology of quantum computing. Motivated by the substantial hardware demands for all established quantum community detection approaches, we introduce a novel QUBO based approach that only needs number-of-nodes many qubits and is represented by a QUBO-matrix as sparse as the input graph's adjacency matrix. The substantial improvement on the sparsity of the QUBO-matrix, which is typically very dense in related work, is achieved through the novel concept of separation-nodes. Instead of assigning every node to a community directly, this approach relies on the identification of a separation-node set, which -- upon its removal from the graph -- yields a set of connected components, representing the core components of the communities. Employing a greedy heuristic to assign the nodes from the separation-node sets to the identified community cores, subsequent experimental results yield a proof of concept. This work hence displays a promising approach to NISQ ready quantum community detection, catalyzing the application of quantum computers for the network structure analysis of large scale, real world problem instances. ",
    "url": "https://arxiv.org/abs/2212.14717",
    "authors": [
      "Jonas Stein",
      "Dominik Ott",
      "Mirco Schoenfeld",
      "Sebastian Feld"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2212.14747",
    "title": "VertMatch: A Semi-supervised Framework for Vertebral Structure Detection  in 3D Ultrasound Volume",
    "abstract": "Three-dimensional (3D) ultrasound imaging technique has been applied for scoliosis assessment, but current assessment method only uses coronal projection image and cannot illustrate the 3D deformity and vertebra rotation. The vertebra detection is essential to reveal 3D spine information, but the detection task is challenging due to complex data and limited annotations. We propose VertMatch, a two-step framework to detect vertebral structures in 3D ultrasound volume by utilizing unlabeled data in semi-supervised manner. The first step is to detect the possible positions of structures on transverse slice globally, and then the local patches are cropped based on detected positions. The second step is to distinguish whether the patches contain real vertebral structures and screen the predicted positions from the first step. VertMatch develops three novel components for semi-supervised learning: for position detection in the first step, (1) anatomical prior is used to screen pseudo labels generated from confidence threshold method; (2) multi-slice consistency is used to utilize more unlabeled data by inputting multiple adjacent slices; (3) for patch identification in the second step, the categories are rebalanced in each batch to solve imbalance problem. Experimental results demonstrate that VertMatch can detect vertebra accurately in ultrasound volume and outperforms state-of-the-art methods. VertMatch is also validated in clinical application on forty ultrasound scans, and it can be a promising approach for 3D assessment of scoliosis. ",
    "url": "https://arxiv.org/abs/2212.14747",
    "authors": [
      "Hongye Zeng",
      "kang Zhou",
      "Songhan Ge",
      "Yuchong Gao",
      "Jianhao Zhao",
      "Shenghua Gao",
      "Rui Zheng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.14783",
    "title": "Extended method for Statistical Signal Characterization using moments  and cumulants: Application to recognition of pattern alterations in  pulse-like waveforms employing Artificial Neural Networks",
    "abstract": "We propose a statistical procedure to characterize and extract features from a waveform that can be applied as a pre-processing signal stage in a pattern recognition task using Artificial Neural Networks. Such a procedure is based on measuring a 30-parameters set of moments and cumulants from the waveform, its derivative, and its integral. The technique is presented as an extension of the Statistical Signal Characterization method existing in the literature. As a testing methodology, we used the procedure to distinguish a pulse-like signal from different versions of itself with frequency spectrum alterations or deformations. The recognition task was performed by single feed-forward back-propagation networks trained for the case Sinc-, Gaussian-, and Chirp-pulse waveform. Because of the success obtained in these examples, we can conclude that the proposed extended statistical signal characterization method is an effective tool for pattern-recognition applications. In particular, we can use it as a fast pre-processing stage in embedded systems with limited memory or computational capability. ",
    "url": "https://arxiv.org/abs/2212.14783",
    "authors": [
      "G. H. Bustos",
      "H. H. Segnorile"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14813",
    "title": "Unsupervised learning for structure detection in plastically deformed  crystals",
    "abstract": "Detecting structures at the particle scale within plastically deformed crystalline materials allows a better understanding of the occurring phenomena. While previous approaches mostly relied on applying hand-chosen criteria on different local parameters, these approaches could only detect already known structures.We introduce an unsupervised learning algorithm to automatically detect structures within a crystal under plastic deformation. This approach is based on a study developed for structural detection on colloidal materials. This algorithm has the advantage of being computationally fast and easy to implement. We show that by using local parameters based on bond-angle distributions, we are able to detect more structures and with a higher degree of precision than traditional hand-made criteria. ",
    "url": "https://arxiv.org/abs/2212.14813",
    "authors": [
      "Armand Barbot",
      "Riccardo Gatti"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1811.09831",
    "title": "Attention, Please! Adversarial Defense via Activation Rectification and  Preservation",
    "abstract": " Title: Attention, Please! Adversarial Defense via Activation Rectification and  Preservation ",
    "url": "https://arxiv.org/abs/1811.09831",
    "authors": [
      "Shangxi Wu",
      "Jitao Sang",
      "Kaiyuan Xu",
      "Jiaming Zhang",
      "Jian Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:1812.10097",
    "title": "Trip Prediction by Leveraging Trip Histories from Neighboring Users",
    "abstract": " Comments: This work is published by IEEE (ITSC) ",
    "url": "https://arxiv.org/abs/1812.10097",
    "authors": [
      "Yuxin Chen",
      "Morteza Haghir Chehreghani"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:1901.04097",
    "title": "Search Efficient Binary Network Embedding",
    "abstract": " Title: Search Efficient Binary Network Embedding ",
    "url": "https://arxiv.org/abs/1901.04097",
    "authors": [
      "Daokun Zhang",
      "Jie Yin",
      "Xingquan Zhu",
      "Chengqi Zhang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1904.13223",
    "title": "Unsupervised Representation Learning with Minimax Distance Measures",
    "abstract": " Comments: This work is published by Springer (Machine Learning) ",
    "url": "https://arxiv.org/abs/1904.13223",
    "authors": [
      "Morteza Haghir Chehreghani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2002.05998",
    "title": "On $k$-Bend and Monotonic $\\ell$-Bend Edge Intersection Graphs of Paths  on a Grid",
    "abstract": " Title: On $k$-Bend and Monotonic $\\ell$-Bend Edge Intersection Graphs of Paths  on a Grid ",
    "url": "https://arxiv.org/abs/2002.05998",
    "authors": [
      "Eranda Çela",
      "Elisabeth Gaar"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2009.10835",
    "title": "Model-Centric and Data-Centric Aspects of Active Learning for Deep  Neural Networks",
    "abstract": " Comments: The work is published by IEEE Big Data ",
    "url": "https://arxiv.org/abs/2009.10835",
    "authors": [
      "John Daniel Bossér",
      "Erik Sörstadius",
      "Morteza Haghir Chehreghani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2011.09946",
    "title": "Data Driven Modeling of Interfacial Traction Separation Relations using  a Thermodynamically Consistent Neural Network",
    "abstract": " Title: Data Driven Modeling of Interfacial Traction Separation Relations using  a Thermodynamically Consistent Neural Network ",
    "url": "https://arxiv.org/abs/2011.09946",
    "authors": [
      "Congjie Wei",
      "Jiaxin Zhang",
      "Kenneth M. Liechti",
      "Chenglin Wu"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2012.15772",
    "title": "Estimating Uncertainty in Neural Networks for Cardiac MRI Segmentation:  A Benchmark Study",
    "abstract": " Comments: Accepted to IEEE Transactions on Biomedical Engineering. Copyright (c) 2022 IEEE. Personal use of this material is permitted. However, permission to use this material for any other purposes must be obtained from the IEEE by sending an email to pubs-permissions@ieee.org ",
    "url": "https://arxiv.org/abs/2012.15772",
    "authors": [
      "Matthew Ng",
      "Fumin Guo",
      "Labonny Biswas",
      "Steffen E. Petersen",
      "Stefan K. Piechnik",
      "Stefan Neubauer",
      "Graham Wright"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2101.04520",
    "title": "A Unified Framework for Online Trip Destination Prediction",
    "abstract": " Comments: This work is published by Springer, Machine Learning ",
    "url": "https://arxiv.org/abs/2101.04520",
    "authors": [
      "Victor Eberstein",
      "Jonas Sjöblom",
      "Nikolce Murgovski",
      "Morteza Haghir Chehreghani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2102.02515",
    "title": "HYDRA: Hypergradient Data Relevance Analysis for Interpreting Deep  Neural Networks",
    "abstract": " Title: HYDRA: Hypergradient Data Relevance Analysis for Interpreting Deep  Neural Networks ",
    "url": "https://arxiv.org/abs/2102.02515",
    "authors": [
      "Yuanyuan Chen",
      "Boyang Li",
      "Han Yu",
      "Pengcheng Wu",
      "Chunyan Miao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.10127",
    "title": "Generative Transformer for Accurate and Reliable Salient Object  Detection",
    "abstract": " Comments: Technical report, 18 pages, 17 figures ",
    "url": "https://arxiv.org/abs/2104.10127",
    "authors": [
      "Yuxin Mao",
      "Jing Zhang",
      "Zhexiong Wan",
      "Yuchao Dai",
      "Aixuan Li",
      "Yunqiu Lv",
      "Xinyu Tian",
      "Deng-Ping Fan",
      "Nick Barnes"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2104.11207",
    "title": "Fully Convolutional Line Parsing",
    "abstract": " Comments: 11 pages ",
    "url": "https://arxiv.org/abs/2104.11207",
    "authors": [
      "Xili Dai",
      "Haigang Gong",
      "Shuai Wu",
      "Xiaojun Yuan",
      "Yi Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.13205",
    "title": "Hamiltonian Deep Neural Networks Guaranteeing Non-vanishing Gradients by  Design",
    "abstract": " Title: Hamiltonian Deep Neural Networks Guaranteeing Non-vanishing Gradients by  Design ",
    "url": "https://arxiv.org/abs/2105.13205",
    "authors": [
      "Clara Lucía Galimberti",
      "Luca Furieri",
      "Liang Xu",
      "Giancarlo Ferrari-Trecate"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2106.07513",
    "title": "CodeLabeller: A Web-based Code Annotation Tool for Java Design Patterns  and Summaries",
    "abstract": " Comments: 11 pages, 6 figures, 1 Table ",
    "url": "https://arxiv.org/abs/2106.07513",
    "authors": [
      "Najam Nazar",
      "Norman Chen",
      "Chun Yong Chong"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2106.10900",
    "title": "Self-Supervised Tracking via Target-Aware Data Synthesis",
    "abstract": " Comments: 11 pages, 7 figures, Accepted by IEEE Transactions on Neural Networks and Learning Systems ",
    "url": "https://arxiv.org/abs/2106.10900",
    "authors": [
      "Xin Li",
      "Wenjie Pei",
      "Yaowei Wang",
      "Zhenyu He",
      "Huchuan Lu",
      "Ming-Hsuan Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.12113",
    "title": "Conflict Avoidance in Social Navigation -- a Survey",
    "abstract": " Title: Conflict Avoidance in Social Navigation -- a Survey ",
    "url": "https://arxiv.org/abs/2106.12113",
    "authors": [
      "Reuth Mirsky",
      "Xuesu Xiao",
      "Justin Hart",
      "Peter Stone"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2106.13950",
    "title": "Self-Evolving Integrated Vertical Heterogeneous Networks",
    "abstract": " Comments: 29 pages, 5 figures, 3 tables. arXiv admin note: text overlap with arXiv:1901.07955, arXiv:2006.02931 by other authors ",
    "url": "https://arxiv.org/abs/2106.13950",
    "authors": [
      "Amin Farajzadeh",
      "Mohammad G. Khoshkholgh",
      "Halim Yanikomeroglu",
      "Ozgur Ercetin"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2106.13997",
    "title": "The Feasibility and Inevitability of Stealth Attacks",
    "abstract": " Title: The Feasibility and Inevitability of Stealth Attacks ",
    "url": "https://arxiv.org/abs/2106.13997",
    "authors": [
      "Ivan Y. Tyukin",
      "Desmond J. Higham",
      "Alexander Bastounis",
      "Eliyas Woldegeorgis",
      "Alexander N. Gorban"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.02477",
    "title": "A Linkage-based Doubly Imbalanced Graph Learning Framework for Face  Clustering",
    "abstract": " Comments: 9 pages, accepted by SIAM International Conference on Data Mining (SDM) 2023 ",
    "url": "https://arxiv.org/abs/2107.02477",
    "authors": [
      "Huafeng Yang",
      "Qijie Shen",
      "Xingjian Chen",
      "Fangyi Zhang",
      "Rong Du"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.05341",
    "title": "Nonparametric Regression with Shallow Overparameterized Neural Networks  Trained by GD with Early Stopping",
    "abstract": " Comments: The report contains a critical issue. For details see the note: this http URL ",
    "url": "https://arxiv.org/abs/2107.05341",
    "authors": [
      "Ilja Kuzborskij",
      "Csaba Szepesvári"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2108.01727",
    "title": "Scalable Community Detection in Massive Networks Using Aggregated  Relational Data",
    "abstract": " Title: Scalable Community Detection in Massive Networks Using Aggregated  Relational Data ",
    "url": "https://arxiv.org/abs/2108.01727",
    "authors": [
      "Timothy Jones",
      "Owen G. Ward",
      "Yiran Jiang",
      "John Paisley",
      "Tian Zheng"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2108.11939",
    "title": "Understanding and Accelerating Neural Architecture Search with  Training-Free and Theory-Grounded Metrics",
    "abstract": " Comments: submitted to TPAMI ",
    "url": "https://arxiv.org/abs/2108.11939",
    "authors": [
      "Wuyang Chen",
      "Xinyu Gong",
      "Junru Wu",
      "Yunchao Wei",
      "Humphrey Shi",
      "Zhicheng Yan",
      "Yi Yang",
      "Zhangyang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.11155",
    "title": "DeLag: Using Multi-Objective Optimization to Enhance the Detection of  Latency Degradation Patterns in Service-based Systems",
    "abstract": " Title: DeLag: Using Multi-Objective Optimization to Enhance the Detection of  Latency Degradation Patterns in Service-based Systems ",
    "url": "https://arxiv.org/abs/2110.11155",
    "authors": [
      "Luca Traini",
      "Vittorio Cortellessa"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2112.00713",
    "title": "hIPPYlib-MUQ: A Bayesian Inference Software Framework for Integration of  Data with Complex Predictive Models under Uncertainty",
    "abstract": " Title: hIPPYlib-MUQ: A Bayesian Inference Software Framework for Integration of  Data with Complex Predictive Models under Uncertainty ",
    "url": "https://arxiv.org/abs/2112.00713",
    "authors": [
      "Ki-Tae Kim",
      "Umberto Villa",
      "Matthew Parno",
      "Youssef Marzouk",
      "Omar Ghattas",
      "Noemi Petra"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Mathematical Software (cs.MS)",
      "Optimization and Control (math.OC)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2112.10374",
    "title": "CGIBNet: Bandwidth-constrained Communication with Graph Information  Bottleneck in Multi-Agent Reinforcement Learning",
    "abstract": " Title: CGIBNet: Bandwidth-constrained Communication with Graph Information  Bottleneck in Multi-Agent Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2112.10374",
    "authors": [
      "Qi Tian",
      "Kun Kuang",
      "Baoxiang Wang",
      "Furui Liu",
      "Fei Wu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2201.05715",
    "title": "Taylor-Lagrange Neural Ordinary Differential Equations: Toward Fast  Training and Evaluation of Neural ODEs",
    "abstract": " Comments: Final submission IJCAI 2022 ",
    "url": "https://arxiv.org/abs/2201.05715",
    "authors": [
      "Franck Djeumou",
      "Cyrus Neary",
      "Eric Goubault",
      "Sylvie Putot",
      "Ufuk Topcu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.07646",
    "title": "A Survey on Training Challenges in Generative Adversarial Networks for  Biomedical Image Analysis",
    "abstract": " Comments: Submitted to the Journal ",
    "url": "https://arxiv.org/abs/2201.07646",
    "authors": [
      "Muhammad Muneeb Saad",
      "Ruairi O'Reilly",
      "Mubashir Husain Rehmani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.12380",
    "title": "GStarX: Explaining Graph Neural Networks with Structure-Aware  Cooperative Games",
    "abstract": " Title: GStarX: Explaining Graph Neural Networks with Structure-Aware  Cooperative Games ",
    "url": "https://arxiv.org/abs/2201.12380",
    "authors": [
      "Shichang Zhang",
      "Yozen Liu",
      "Neil Shah",
      "Yizhou Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.01811",
    "title": "ObjectSeeker: Certifiably Robust Object Detection against Patch Hiding  Attacks via Patch-agnostic Masking",
    "abstract": " Comments: IEEE Symposium on Security and Privacy 2023; extended version ",
    "url": "https://arxiv.org/abs/2202.01811",
    "authors": [
      "Chong Xiang",
      "Alexander Valtchanov",
      "Saeed Mahloujifar",
      "Prateek Mittal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.09952",
    "title": "Conquering Ghosts: Relation Learning for Information Reliability  Representation and End-to-End Robust Navigation",
    "abstract": " Title: Conquering Ghosts: Relation Learning for Information Reliability  Representation and End-to-End Robust Navigation ",
    "url": "https://arxiv.org/abs/2203.09952",
    "authors": [
      "Kefan Jin",
      "Xingyao Han"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.13301",
    "title": "Enhance Ambiguous Community Structure via Multi-strategy Community  Related Link Prediction Method with Evolutionary Process",
    "abstract": " Comments: 26 pages(single column format), 8 figures and 5 tables. Journal paper ",
    "url": "https://arxiv.org/abs/2204.13301",
    "authors": [
      "Qiming Yang",
      "Wei Wei",
      "Ruizhi Zhang",
      "Bowen Pang",
      "Xiangnan Feng"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.10620",
    "title": "GNN-Enhanced Approximate Message Passing for Massive/Ultra-Massive MIMO  Detection",
    "abstract": " Comments: 6 pages, 5 figures, Accepted by IEEE WCNC 2023 ",
    "url": "https://arxiv.org/abs/2205.10620",
    "authors": [
      "Hengtao He",
      "Alva Kosasih",
      "Xianghao Yu",
      "Jun Zhang",
      "S. H. Song",
      "Wibowo Hardjawanay",
      "Khaled B. Letaief"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.02016",
    "title": "Is $L^2$ Physics-Informed Loss Always Suitable for Training  Physics-Informed Neural Network?",
    "abstract": " Title: Is $L^2$ Physics-Informed Loss Always Suitable for Training  Physics-Informed Neural Network? ",
    "url": "https://arxiv.org/abs/2206.02016",
    "authors": [
      "Chuwei Wang",
      "Shanda Li",
      "Di He",
      "Liwei Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2206.03601",
    "title": "Decoupled Self-supervised Learning for Graphs",
    "abstract": " Title: Decoupled Self-supervised Learning for Graphs ",
    "url": "https://arxiv.org/abs/2206.03601",
    "authors": [
      "Teng Xiao",
      "Zhengyu Chen",
      "Zhimeng Guo",
      "Zeyang Zhuang",
      "Suhang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.06434",
    "title": "SmartGD: A GAN-Based Graph Drawing Framework for Diverse Aesthetic Goals",
    "abstract": " Title: SmartGD: A GAN-Based Graph Drawing Framework for Diverse Aesthetic Goals ",
    "url": "https://arxiv.org/abs/2206.06434",
    "authors": [
      "Xiaoqi Wang",
      "Kevin Yen",
      "Yifan Hu",
      "Han-Wei Shen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.11526",
    "title": "A Survey on Learnable Evolutionary Algorithms for Scalable  Multiobjective Optimization",
    "abstract": " Comments: 21 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2206.11526",
    "authors": [
      "Songbai Liu",
      "Qiuzhen Lin",
      "Jianqiang Li",
      "Kay Chen Tan"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.12338",
    "title": "Diegetic Representation Of Feedback In Open Games",
    "abstract": " Comments: 17 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2206.12338",
    "authors": [
      "Matteo Capucci"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)",
      "Category Theory (math.CT)"
    ]
  },
  {
    "id": "arXiv:2206.14796",
    "title": "On the Robustness of Dialogue History Representation in Conversational  Question Answering: A Comprehensive Study and a New Prompt-based Method",
    "abstract": " Comments: Accepted for publication at TACL in December 2022. First two authors contributed equally to this work. Our code and data will be released at: this https URL ",
    "url": "https://arxiv.org/abs/2206.14796",
    "authors": [
      "Zorik Gekhman",
      "Nadav Oved",
      "Orgad Keller",
      "Idan Szpektor",
      "Roi Reichart"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.09240",
    "title": "IDET: Iterative Difference-Enhanced Transformers for High-Quality Change  Detection",
    "abstract": " Comments: 11 pages,9 figures ",
    "url": "https://arxiv.org/abs/2207.09240",
    "authors": [
      "Qing Guo",
      "Ruofei Wang",
      "Rui Huang",
      "Shuifa Sun",
      "Yuxiang Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.12647",
    "title": "Cross-Modal Causal Relational Reasoning for Event-Level Visual Question  Answering",
    "abstract": " Comments: 18 pages, 10 figures. This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2207.12647",
    "authors": [
      "Yang Liu",
      "Guanbin Li",
      "Liang Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.13585",
    "title": "Spatio-Temporal Wind Speed Forecasting using Graph Networks and Novel  Transformer Architectures",
    "abstract": " Comments: (Please cite this version): this https URL Code Available at this https URL ",
    "url": "https://arxiv.org/abs/2208.13585",
    "authors": [
      "Lars Ødegaard Bentsen",
      "Narada Dilp Warakagoda",
      "Roy Stenbro",
      "Paal Engelstad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.13904",
    "title": "Reducing Certified Regression to Certified Classification for General  Poisoning Attacks",
    "abstract": " Comments: Accepted at the 1st IEEE conference on Secure and Trustworthy Machine Learning (SaTML'23) ",
    "url": "https://arxiv.org/abs/2208.13904",
    "authors": [
      "Zayd Hammoudeh",
      "Daniel Lowd"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.04142",
    "title": "Joint Non-parametric Point Process model for Treatments and Outcomes:  Counterfactual Time-series Prediction Under Policy Interventions",
    "abstract": " Title: Joint Non-parametric Point Process model for Treatments and Outcomes:  Counterfactual Time-series Prediction Under Policy Interventions ",
    "url": "https://arxiv.org/abs/2209.04142",
    "authors": [
      "Çağlar Hızlı",
      "ST John",
      "Anne Juuti",
      "Tuure Saarinen",
      "Kirsi Pietiläinen",
      "Pekka Marttinen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2209.05055",
    "title": "CARE: Certifiably Robust Learning with Reasoning via Variational  Inference",
    "abstract": " Title: CARE: Certifiably Robust Learning with Reasoning via Variational  Inference ",
    "url": "https://arxiv.org/abs/2209.05055",
    "authors": [
      "Jiawei Zhang",
      "Linyi Li",
      "Ce Zhang",
      "Bo Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.05152",
    "title": "Detecting Network-based Internet Censorship via Latent Feature  Representation Learning",
    "abstract": " Title: Detecting Network-based Internet Censorship via Latent Feature  Representation Learning ",
    "url": "https://arxiv.org/abs/2209.05152",
    "authors": [
      "Shawn P. Duncan",
      "Hui Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2209.07577",
    "title": "Experimental verification of the quantum nature of a neural network",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2206.00005 ",
    "url": "https://arxiv.org/abs/2209.07577",
    "authors": [
      "Andrei T. Patrascu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2209.12871",
    "title": "Variationally Mimetic Operator Networks",
    "abstract": " Comments: 37 pages, 13 figures, 1 Appendix ",
    "url": "https://arxiv.org/abs/2209.12871",
    "authors": [
      "Dhruv Patel",
      "Deep Ray",
      "Michael R. A. Abdelmalik",
      "Thomas J. R. Hughes",
      "Assad A. Oberai"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.03994",
    "title": "Relational Message Passing for Fully Inductive Knowledge Graph  Completion",
    "abstract": " Comments: Accepted by ICDE 2023 ",
    "url": "https://arxiv.org/abs/2210.03994",
    "authors": [
      "Yuxia Geng",
      "Jiaoyan Chen",
      "Jeff Z. Pan",
      "Mingyang Chen",
      "Song Jiang",
      "Wen Zhang",
      "Huajun Chen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.05958",
    "title": "Bridging the Gap Between Vision Transformers and Convolutional Neural  Networks on Small Datasets",
    "abstract": " Comments: Fix the bug when calculating FLOPs of the models ",
    "url": "https://arxiv.org/abs/2210.05958",
    "authors": [
      "Zhiying Lu",
      "Hongtao Xie",
      "Chuanbin Liu",
      "Yongdong Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.15824",
    "title": "Improving the Modality Representation with Multi-View Contrastive  Learning for Multimodal Sentiment Analysis",
    "abstract": " Title: Improving the Modality Representation with Multi-View Contrastive  Learning for Multimodal Sentiment Analysis ",
    "url": "https://arxiv.org/abs/2210.15824",
    "authors": [
      "Peipei Liu",
      "Xin Zheng",
      "Hong Li",
      "Jie Liu",
      "Yimo Ren",
      "Hongsong Zhu",
      "Limin Sun"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.11642",
    "title": "Predictive Coding Based Multiscale Network with Encoder-Decoder LSTM for  Video Prediction",
    "abstract": " Title: Predictive Coding Based Multiscale Network with Encoder-Decoder LSTM for  Video Prediction ",
    "url": "https://arxiv.org/abs/2212.11642",
    "authors": [
      "Chaofan Ling",
      "Junpei Zhong",
      "Weihua Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.12110",
    "title": "Front-Running Attack Benchmark Construction and Vulnerability Detection  Technique Evaluation",
    "abstract": " Title: Front-Running Attack Benchmark Construction and Vulnerability Detection  Technique Evaluation ",
    "url": "https://arxiv.org/abs/2212.12110",
    "authors": [
      "Wuqi Zhang",
      "Lili Wei",
      "Shing-Chi Cheung",
      "Yepang Liu",
      "Shuqing Li",
      "Lu Liu",
      "Michael R. Lyu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2212.13425",
    "title": "GEDI: GEnerative and DIscriminative Training for Self-Supervised  Learning",
    "abstract": " Comments: Fixed typos ",
    "url": "https://arxiv.org/abs/2212.13425",
    "authors": [
      "Emanuele Sansone",
      "Robin Manhaeve"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13638",
    "title": "Battling the Coronavirus 'Infodemic' Among Social Media Users in Africa",
    "abstract": " Comments: 42 pages including appendix, 9 figures ",
    "url": "https://arxiv.org/abs/2212.13638",
    "authors": [
      "Molly Offer-Westort",
      "Leah R. Rosenzweig",
      "Susan Athey"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2212.13994",
    "title": "Investigation and rectification of NIDS datasets and standardized  feature set derivation for network attack detection with graph neural  networks",
    "abstract": " Comments: 8 pages, 2 equations, 3 tables ",
    "url": "https://arxiv.org/abs/2212.13994",
    "authors": [
      "Anton Raskovalov",
      "Nikita Gabdullin",
      "Vasily Dolmatov"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Discrete Mathematics (cs.DM)",
      "Machine Learning (cs.LG)"
    ]
  }
]