[
  {
    "id": "arXiv:2311.17929",
    "title": "New Online Communities: Graph Deep Learning on Anonymous Voting Networks  to Identify Sybils in Polycentric Governance",
    "abstract": "This research examines the polycentric governance of digital assets in Decentralized Autonomous Organizations (DAOs). It offers a theoretical framework and addresses a critical challenge facing decentralized governance by developing a method to identify sybils, or spurious identities. The method uses graph deep learning techniques to identify sybil activity in a DAO governance dataset (snapshot.org). Specifically, a Graph Convolutional Neural Network (GCNN) learned voting behaviours and a fast k-means vector clustering algorithm (FAISS) used the high dimensional embeddings to identify similar nodes in a graph. The results reveal that deep learning can effectively identify sybils, reducing the voting graph by 2-5%. This research underscores the importance of sybil resistance in DAOs and offers a novel perspective on decentralized governance, informing future policy, regulation, and governance practices. ",
    "url": "https://arxiv.org/abs/2311.17929",
    "authors": [
      "Quinn DuPont"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.17936",
    "title": "Diagnostics Algorithms in Nuclear Plant Cyber Attack Analysis Toolkit",
    "abstract": "A Python interface is developed for the GPWR Simulator to automatically simulate cyber-spoofing of different steam generator parameters and plant operation. Specifically, steam generator water level, feedwater flowrate, steam flowrate, valve position, and steam generator controller parameters, including controller gain and time constant, can be directly attacked using command inject, denial of service, and man-in-the-middle type attacks. Plant operation can be initialized to any of the initial conditions provided by the GPWR simulator. Several different diagnostics algorithms have been implemented for anomaly detection, including physics-based diagnostics with Kalman filtering, data-driven diagnostics, noise profiling, and online sensor validation. Industry-standard safety analysis code RELAP5 is also available as a part of the toolkit. Diagnostics algorithms are analyzed based on accuracy and efficiency. Our observations indicate that physics-based diagnostics with Kalman filtering are the most robust. An experimental quantum kernel has been added to the framework for preliminary testing. Our first impressions suggest that while quantum kernels can be accurate, just like any other kernels, their applicability is problem/data dependent, and can be prone to overfitting. ",
    "url": "https://arxiv.org/abs/2311.17936",
    "authors": [
      "Japan K. Patel",
      "Athi Varuttamaseni",
      "Robert W. Youngblood III",
      "Junjie Guo",
      "Steven Wacker",
      "Rafael Pires Barbosa",
      "John C. Lee"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.17943",
    "title": "LayerCollapse: Adaptive compression of neural networks",
    "abstract": "Handling the ever-increasing scale of contemporary deep learning and transformer-based models poses a significant challenge. Although great strides have been made in optimizing model compression techniques such as model architecture search and knowledge distillation, the availability of data and computational resources remains a considerable hurdle for these optimizations. This paper introduces LayerCollapse, a novel alternative adaptive model compression methodology. LayerCollapse works by eliminating non-linearities within the network and collapsing two consecutive fully connected layers into a single linear transformation. This approach simultaneously reduces both the number of layers and the parameter count, thereby enhancing model efficiency. We also introduce a compression aware regularizer, which compresses the model in alignment with the dataset quality and model expressiveness, consequently reducing overfitting across tasks. Our results demonstrate LayerCollapse's effective compression and regularization capabilities in multiple fine-grained classification benchmarks, achieving up to 74% post training compression with minimal accuracy loss. We compare this method with knowledge distillation on the same target network, showcasing a five-fold increase in computational efficiency and 8% improvement in overall accuracy on the ImageNet dataset. ",
    "url": "https://arxiv.org/abs/2311.17943",
    "authors": [
      "Soheil Zibakhsh Shabgahi",
      "Mohammad Soheil Shariff",
      "Farinaz Koushanfar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.17953",
    "title": "Rethinking Image Editing Detection in the Era of Generative AI  Revolution",
    "abstract": "The accelerated advancement of generative AI significantly enhance the viability and effectiveness of generative regional editing methods. This evolution render the image manipulation more accessible, thereby intensifying the risk of altering the conveyed information within original images and even propagating misinformation. Consequently, there exists a critical demand for robust capable of detecting the edited images. However, the lack of comprehensive dataset containing images edited with abundant and advanced generative regional editing methods poses a substantial obstacle to the advancement of corresponding detection methods. We endeavor to fill the vacancy by constructing the GRE dataset, a large-scale generative regional editing dataset with the following advantages: 1) Collection of real-world original images, focusing on two frequently edited scenarios. 2) Integration of a logical and simulated editing pipeline, leveraging multiple large models in various modalities. 3) Inclusion of various editing approaches with distinct architectures. 4) Provision of comprehensive analysis tasks. We perform comprehensive experiments with proposed three tasks: edited image classification, edited method attribution and edited region localization, providing analysis of distinct editing methods and evaluation of detection methods in related fields. We expect that the GRE dataset can promote further research and exploration in the field of generative region editing detection. ",
    "url": "https://arxiv.org/abs/2311.17953",
    "authors": [
      "Zhihao Sun",
      "Haipeng Fang",
      "Xinying Zhao",
      "Danding Wang",
      "Juan Cao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.17954",
    "title": "Transformer-empowered Multi-modal Item Embedding for Enhanced Image  Search in E-Commerce",
    "abstract": "Over the past decade, significant advances have been made in the field of image search for e-commerce applications. Traditional image-to-image retrieval models, which focus solely on image details such as texture, tend to overlook useful semantic information contained within the images. As a result, the retrieved products might possess similar image details, but fail to fulfil the user's search goals. Moreover, the use of image-to-image retrieval models for products containing multiple images results in significant online product feature storage overhead and complex mapping implementations. In this paper, we report the design and deployment of the proposed Multi-modal Item Embedding Model (MIEM) to address these limitations. It is capable of utilizing both textual information and multiple images about a product to construct meaningful product features. By leveraging semantic information from images, MIEM effectively supplements the image search process, improving the overall accuracy of retrieval results. MIEM has become an integral part of the Shopee image search platform. Since its deployment in March 2023, it has achieved a remarkable 9.90% increase in terms of clicks per user and a 4.23% boost in terms of orders per user for the image search feature on the Shopee e-commerce platform. ",
    "url": "https://arxiv.org/abs/2311.17954",
    "authors": [
      "Chang Liu",
      "Peng Hou",
      "Anxiang Zeng",
      "Han Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.17955",
    "title": "PEAN: A Diffusion-based Prior-Enhanced Attention Network for Scene Text  Image Super-Resolution",
    "abstract": "Scene text image super-resolution (STISR) aims at simultaneously increasing the resolution and readability of low-resolution scene text images, thus boosting the performance of the downstream recognition task. Two factors in scene text images, semantic information and visual structure, affect the recognition performance significantly. To mitigate the effects from these factors, this paper proposes a Prior-Enhanced Attention Network (PEAN). Specifically, a diffusion-based module is developed to enhance the text prior, hence offering better guidance for the SR network to generate SR images with higher semantic accuracy. Meanwhile, the proposed PEAN leverages an attention-based modulation module to understand scene text images by neatly perceiving the local and global dependence of images, despite the shape of the text. A multi-task learning paradigm is employed to optimize the network, enabling the model to generate legible SR images. As a result, PEAN establishes new SOTA results on the TextZoom benchmark. Experiments are also conducted to analyze the importance of the enhanced text prior as a means of improving the performance of the SR network. Code will be made available at https://github.com/jdfxzzy/PEAN. ",
    "url": "https://arxiv.org/abs/2311.17955",
    "authors": [
      "Zuoyan Zhao",
      "Shipeng Zhu",
      "Pengfei Fang",
      "Hui Xue"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.17956",
    "title": "QuadraNet: Improving High-Order Neural Interaction Efficiency with  Hardware-Aware Quadratic Neural Networks",
    "abstract": "Recent progress in computer vision-oriented neural network designs is mostly driven by capturing high-order neural interactions among inputs and features. And there emerged a variety of approaches to accomplish this, such as Transformers and its variants. However, these interactions generate a large amount of intermediate state and/or strong data dependency, leading to considerable memory consumption and computing cost, and therefore compromising the overall runtime performance. To address this challenge, we rethink the high-order interactive neural network design with a quadratic computing approach. Specifically, we propose QuadraNet -- a comprehensive model design methodology from neuron reconstruction to structural block and eventually to the overall neural network implementation. Leveraging quadratic neurons' intrinsic high-order advantages and dedicated computation optimization schemes, QuadraNet could effectively achieve optimal cognition and computation performance. Incorporating state-of-the-art hardware-aware neural architecture search and system integration techniques, QuadraNet could also be well generalized in different hardware constraint settings and deployment scenarios. The experiment shows thatQuadraNet achieves up to 1.5$\\times$ throughput, 30% less memory footprint, and similar cognition performance, compared with the state-of-the-art high-order approaches. ",
    "url": "https://arxiv.org/abs/2311.17956",
    "authors": [
      "Chenhui Xu",
      "Fuxun Yu",
      "Zirui Xu",
      "Chenchen Liu",
      "Jinjun Xiong",
      "Xiang Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2311.17972",
    "title": "Self-Infilling Code Generation",
    "abstract": "This work introduces a general code generation framework that incorporates infilling operations into auto-regressive decoding. Our approach capitalizes on the observation that recent code language models with infilling capabilities can perform \\emph{self-infilling}: whereas infilling operations aim to fill in the middle based on a predefined prefix and suffix, self-infilling sequentially generates both such surrounding context and the infilled content. We utilize this feature to develop an infilling-augmented decoding process that facilitates non-monotonic generation. This approach allows for postponing the generation of uncertain code snippets until a definitive suffix is established, leading to improved control over the generation sequence. In addition, it facilitates a looping mechanism, which can iteratively update and synchronize each piece of generation in a cyclic manner. Extensive experiments are conducted to demonstrate that our proposed decoding process is effective in enhancing regularity and quality across several code generation benchmarks. ",
    "url": "https://arxiv.org/abs/2311.17972",
    "authors": [
      "Lin Zheng",
      "Jianbo Yuan",
      "Zhi Zhang",
      "Hongxia Yang",
      "Lingpeng Kong"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.17973",
    "title": "Homogeneous Artificial Neural Network",
    "abstract": "The paper proposes an artificial neural network (ANN) being a global approximator for a special class of functions, which are known as generalized homogeneous. The homogeneity means a symmetry of a function with respect to a group of transformations having topological characterization of a dilation. In this paper, a class of the so-called linear dilations is considered. A homogeneous universal approximation theorem is proven. Procedures for an upgrade of an existing ANN to a homogeneous one are developed. Theoretical results are supported by examples from the various domains (computer science, systems theory and automatic control). ",
    "url": "https://arxiv.org/abs/2311.17973",
    "authors": [
      "Andrey Polyakov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Systems and Control (eess.SY)",
      "Numerical Analysis (math.NA)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2311.17978",
    "title": "AutArch: An AI-assisted workflow for object detection and automated  recording in archaeological catalogues",
    "abstract": "Compiling large datasets from published resources, such as archaeological find catalogues presents fundamental challenges: identifying relevant content and manually recording it is a time-consuming, repetitive and error-prone task. For the data to be useful, it must be of comparable quality and adhere to the same recording standards, which is hardly ever the case in archaeology. Here, we present a new data collection method exploiting recent advances in Artificial Intelligence. Our software uses an object detection neural network combined with further classification networks to speed up, automate, and standardise data collection from legacy resources, such as archaeological drawings and photographs in large unsorted PDF files. The AI-assisted workflow detects common objects found in archaeological catalogues, such as graves, skeletons, ceramics, ornaments, stone tools and maps, and spatially relates and analyses these objects on the page to extract real-life attributes, such as the size and orientation of a grave based on the north arrow and the scale. A graphical interface allows for and assists with manual validation. We demonstrate the benefits of this approach by collecting a range of shapes and numerical attributes from richly-illustrated archaeological catalogues, and benchmark it in a real-world experiment with ten users. Moreover, we record geometric whole-outlines through contour detection, an alternative to landmark-based geometric morphometrics not achievable by hand. ",
    "url": "https://arxiv.org/abs/2311.17978",
    "authors": [
      "Kevin Klein",
      "Alyssa Wohde",
      "Alexander V. Gorelik",
      "Volker Heyd",
      "Yoan Diekmann",
      "Maxime Brami"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18022",
    "title": "A trainable manifold for accurate approximation with ReLU Networks",
    "abstract": "We present a novel technique for exercising greater control of the weights of ReLU activated neural networks to produce more accurate function approximations. Many theoretical works encode complex operations into ReLU networks using smaller base components. In these works, a common base component is a constant width approximation to x^2, which has exponentially decaying error with respect to depth. We extend this block to represent a greater range of convex one-dimensional functions. We derive a manifold of weights such that the output of these new networks utilizes exponentially many piecewise-linear segments. This manifold guides their training process to overcome drawbacks associated with random initialization and unassisted gradient descent. We train these networks to approximate functions which do not necessarily lie on the manifold, showing a significant reduction of error values over conventional approaches. ",
    "url": "https://arxiv.org/abs/2311.18022",
    "authors": [
      "Max Milkert",
      "Forrest Laine"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.18035",
    "title": "TransOpt: Transformer-based Representation Learning for Optimization  Problem Classification",
    "abstract": "We propose a representation of optimization problem instances using a transformer-based neural network architecture trained for the task of problem classification of the 24 problem classes from the Black-box Optimization Benchmarking (BBOB) benchmark. We show that transformer-based methods can be trained to recognize problem classes with accuracies in the range of 70\\%-80\\% for different problem dimensions, suggesting the possible application of transformer architectures in acquiring representations for black-box optimization problems. ",
    "url": "https://arxiv.org/abs/2311.18035",
    "authors": [
      "Gjorgjina Cenikj",
      "Gašper Petelin",
      "Tome Eftimov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2311.18047",
    "title": "Validation of Collision Detection and Avoidance Methods for Urban Air  Mobility through Simulation",
    "abstract": "Urban Air Mobility is a new concept of regional aviation that has been growing in popularity as a solution to the issue of ever-increasing ground traffic. Electric vehicles with vertical take-off and landing capabilities are being developed by numerous market companies as a result of the push toward environmentally sustainable aviation. The next stage in the eVTOL development process would be to define the concept of operation of these conceptual aircraft and then to integrate them with the existing airspace once they are airborne. In addition to coordinating with conventional air traffic and other Urban Air Mobility (UAM) vehicles, collision avoidance with uncooperative airspace users has to be addressed. Birds and drones of all sizes could be dangerous for these low-flying aircraft. Innovative collision detection and avoidance techniques need to be employed due to the uncooperative nature of these airspace users and different performance characteristics of urban air mobility vehicles compared to classical fixed-wing aircraft. The aim of this study is to validate one such system by means of fast-time solutions. This system uses a decision tree and safety envelopes to prevent collisions with non-cooperative airspace members. The system is designed to work with different aircraft configurations used for Urban Air Mobility (UAM) operations. Various scenarios are modelled by varying intruder type, location, flight path among others. Changes in flight time and closest point of approach are assessed to evaluate the system with regard to safety and efficiency. ",
    "url": "https://arxiv.org/abs/2311.18047",
    "authors": [
      "Isha Panchal",
      "Sophie F. Armanini",
      "Isabel C. Metz"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2311.18057",
    "title": "Non Linear Software Documentation with Interactive Code Examples",
    "abstract": "Documentation enables sharing knowledge between the developers of a technology and its users. Creating quality documents, however, is challenging: Documents must satisfy the needs of a large audience without being overwhelming for individuals. We address this challenge with a new document format, named Casdoc. Casdoc documents are interactive resources centered around code examples for programmers. Explanations of the code elements are presented as annotations that the readers reveal based on their needs. We evaluated Casdoc in a field study with over 300 participants who used 126 documents as part of a software design course. The majority of participants adopted Casdoc instead of a baseline format during the study. We observed that interactive documents can contain more information than static documents without being distracting to readers. We also gathered insights into five aspects of Casdoc that can be applied to other formats, and propose five guidelines to improve navigability in online documents. ",
    "url": "https://arxiv.org/abs/2311.18057",
    "authors": [
      "Mathieu Nassif",
      "Martin P. Robillard"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2311.18061",
    "title": "TransNAS-TSAD: Harnessing Transformers for Multi-Objective Neural  Architecture Search in Time Series Anomaly Detection",
    "abstract": "The surge in real-time data collection across various industries has underscored the need for advanced anomaly detection in both univariate and multivariate time series data. Traditional methods, while comprehensive, often struggle to capture the complex interdependencies in such data. This paper introduces TransNAS-TSAD, a novel framework that synergizes transformer architecture with neural architecture search (NAS), enhanced through NSGA-II algorithm optimization. This innovative approach effectively tackles the complexities of both univariate and multivariate time series, balancing computational efficiency with detection accuracy. Our evaluation reveals that TransNAS-TSAD surpasses conventional anomaly detection models, demonstrating marked improvements in diverse data scenarios. We also propose the Efficiency-Accuracy-Complexity Score (EACS) as a new metric for assessing model performance, emphasizing the crucial balance between accuracy and computational resources. TransNAS-TSAD sets a new benchmark in time series anomaly detection, offering a versatile, efficient solution for complex real-world applications. This research paves the way for future developments in the field, highlighting its potential in a wide range of industry applications. ",
    "url": "https://arxiv.org/abs/2311.18061",
    "authors": [
      "Ijaz Ul Haq",
      "Byung Suk Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2311.18063",
    "title": "TurkishBERTweet: Fast and Reliable Large Language Model for Social Media  Analysis",
    "abstract": "Turkish is one of the most popular languages in the world. Wide us of this language on social media platforms such as Twitter, Instagram, or Tiktok and strategic position of the country in the world politics makes it appealing for the social network researchers and industry. To address this need, we introduce TurkishBERTweet, the first large scale pre-trained language model for Turkish social media built using almost 900 million tweets. The model shares the same architecture as base BERT model with smaller input length, making TurkishBERTweet lighter than BERTurk and can have significantly lower inference time. We trained our model using the same approach for RoBERTa model and evaluated on two text classification tasks: Sentiment Classification and Hate Speech Detection. We demonstrate that TurkishBERTweet outperforms the other available alternatives on generalizability and its lower inference time gives significant advantage to process large-scale datasets. We also compared our models with the commercial OpenAI solutions in terms of cost and performance to demonstrate TurkishBERTweet is scalable and cost-effective solution. As part of our research, we released TurkishBERTweet and fine-tuned LoRA adapters for the mentioned tasks under the MIT License to facilitate future research and applications on Turkish social media. Our TurkishBERTweet model is available at: https://github.com/ViralLab/TurkishBERTweet ",
    "url": "https://arxiv.org/abs/2311.18063",
    "authors": [
      "Ali Najafi",
      "Onur Varol"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2311.18072",
    "title": "Self-Supervised Learning for Large-Scale Preventive Security Constrained  DC Optimal Power Flow",
    "abstract": "Security-Constrained Optimal Power Flow (SCOPF) plays a crucial role in power grid stability but becomes increasingly complex as systems grow. This paper introduces PDL-SCOPF, a self-supervised end-to-end primal-dual learning framework for producing near-optimal solutions to large-scale SCOPF problems in milliseconds. Indeed, PDL-SCOPF remedies the limitations of supervised counterparts that rely on training instances with their optimal solutions, which becomes impractical for large-scale SCOPF problems. PDL-SCOPF mimics an Augmented Lagrangian Method (ALM) for training primal and dual networks that learn the primal solutions and the Lagrangian multipliers, respectively, to the unconstrained optimizations. In addition, PDL-SCOPF incorporates a repair layer to ensure the feasibility of the power balance in the nominal case, and a binary search layer to compute, using the Automatic Primary Response (APR), the generator dispatches in the contingencies. The resulting differentiable program can then be trained end-to-end using the objective function of the SCOPF and the power balance constraints of the contingencies. Experimental results demonstrate that the PDL-SCOPF delivers accurate feasible solutions with minimal optimality gaps. The framework underlying PDL-SCOPF aims at bridging the gap between traditional optimization methods and machine learning, highlighting the potential of self-supervised end-to-end primal-dual learning for large-scale optimization tasks. ",
    "url": "https://arxiv.org/abs/2311.18072",
    "authors": [
      "Seonho Park",
      "Pascal Van Hentenryck"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2311.18074",
    "title": "Game Projection and Robustness for Game-Theoretic Autonomous Driving",
    "abstract": "Game-theoretic approaches are envisioned to bring human-like reasoning skills and decision-making processes for autonomous vehicles (AVs). However, challenges including game complexity and incomplete information still remain to be addressed before they can be sufficiently practical for real-world use. Game complexity refers to the difficulties of solving a multi-player game, which include solution existence, algorithm convergence, and scalability. To address these difficulties, a potential game based framework was developed in our recent work. However, conditions on cost function design need to be enforced to make the game a potential game. This paper relaxes the conditions and makes the potential game approach applicable to more general scenarios, even including the ones that cannot be molded as a potential game. Incomplete information refers to the ego vehicle's lack of knowledge of other traffic agents' cost functions. Cost function deviations between the ego vehicle estimated/learned other agents' cost functions and their actual ones are often inevitable. This motivates us to study the robustness of a game-theoretic solution. This paper defines the robustness margin of a game solution as the maximum magnitude of cost function deviations that can be accommodated in a game without changing the optimality of the game solution. With this definition, closed-form robustness margins are derived. Numerical studies using highway lane-changing scenarios are reported. ",
    "url": "https://arxiv.org/abs/2311.18074",
    "authors": [
      "Mushuang Liu",
      "H. Eric Tseng",
      "Dimitar Filev",
      "Anouck Girard",
      "Ilya Kolmanovsky"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.18102",
    "title": "PatchBMI-Net: Lightweight Facial Patch-based Ensemble for BMI Prediction",
    "abstract": "Due to an alarming trend related to obesity affecting 93.3 million adults in the United States alone, body mass index (BMI) and body weight have drawn significant interest in various health monitoring applications. Consequently, several studies have proposed self-diagnostic facial image-based BMI prediction methods for healthy weight monitoring. These methods have mostly used convolutional neural network (CNN) based regression baselines, such as VGG19, ResNet50, and Efficient-NetB0, for BMI prediction from facial images. However, the high computational requirement of these heavy-weight CNN models limits their deployment to resource-constrained mobile devices, thus deterring weight monitoring using smartphones. This paper aims to develop a lightweight facial patch-based ensemble (PatchBMI-Net) for BMI prediction to facilitate the deployment and weight monitoring using smartphones. Extensive experiments on BMI-annotated facial image datasets suggest that our proposed PatchBMI-Net model can obtain Mean Absolute Error (MAE) in the range [3.58, 6.51] with a size of about 3.3 million parameters. On cross-comparison with heavyweight models, such as ResNet-50 and Xception, trained for BMI prediction from facial images, our proposed PatchBMI-Net obtains equivalent MAE along with the model size reduction of about 5.4x and the average inference time reduction of about 3x when deployed on Apple-14 smartphone. Thus, demonstrating performance efficiency as well as low latency for on-device deployment and weight monitoring using smartphone applications. ",
    "url": "https://arxiv.org/abs/2311.18102",
    "authors": [
      "Parshuram N. Aarotale",
      "Twyla Hill",
      "Ajita Rattani"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18113",
    "title": "Back to 3D: Few-Shot 3D Keypoint Detection with Back-Projected 2D  Features",
    "abstract": "With the immense growth of dataset sizes and computing resources in recent years, so-called foundation models have become popular in NLP and vision tasks. In this work, we propose to explore foundation models for the task of keypoint detection on 3D shapes. A unique characteristic of keypoint detection is that it requires semantic and geometric awareness while demanding high localization accuracy. To address this problem, we propose, first, to back-project features from large pre-trained 2D vision models onto 3D shapes and employ them for this task. We show that we obtain robust 3D features that contain rich semantic information and analyze multiple candidate features stemming from different 2D foundation models. Second, we employ a keypoint candidate optimization module which aims to match the average observed distribution of keypoints on the shape and is guided by the back-projected features. The resulting approach achieves a new state of the art for few-shot keypoint detection on the KeyPointNet dataset, almost doubling the performance of the previous best methods. ",
    "url": "https://arxiv.org/abs/2311.18113",
    "authors": [
      "Thomas Wimmer",
      "Peter Wonka",
      "Maks Ovsjanikov"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2311.18115",
    "title": "Understanding the Effects of Using Parsons Problems to Scaffold Code  Writing for Students with Varying CS Self-Efficacy Levels",
    "abstract": "Introductory programming courses aim to teach students to write code independently. However, transitioning from studying worked examples to generating their own code is often difficult and frustrating for students, especially those with lower CS self-efficacy in general. Therefore, we investigated the impact of using Parsons problems as a code-writing scaffold for students with varying levels of CS self-efficacy. Parsons problems are programming tasks where students arrange mixed-up code blocks in the correct order. We conducted a between-subjects study with undergraduate students (N=89) on a topic where students have limited code-writing expertise. Students were randomly assigned to one of two conditions. Students in one condition practiced writing code without any scaffolding, while students in the other condition were provided with scaffolding in the form of an equivalent Parsons problem. We found that, for students with low CS self-efficacy levels, those who received scaffolding achieved significantly higher practice performance and in-practice problem-solving efficiency compared to those without any scaffolding. Furthermore, when given Parsons problems as scaffolding during practice, students with lower CS self-efficacy were more likely to solve them. In addition, students with higher pre-practice knowledge on the topic were more likely to effectively use the Parsons scaffolding. This study provides evidence for the benefits of using Parsons problems to scaffold students' write-code activities. It also has implications for optimizing the Parsons scaffolding experience for students, including providing personalized and adaptive Parsons problems based on the student's current problem-solving status. ",
    "url": "https://arxiv.org/abs/2311.18115",
    "authors": [
      "Xinying Hou",
      "Barbara J. Ericson",
      "Xu Wang"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2311.18129",
    "title": "Mixed-Precision Quantization for Federated Learning on  Resource-Constrained Heterogeneous Devices",
    "abstract": "While federated learning (FL) systems often utilize quantization to battle communication and computational bottlenecks, they have heretofore been limited to deploying fixed-precision quantization schemes. Meanwhile, the concept of mixed-precision quantization (MPQ), where different layers of a deep learning model are assigned varying bit-width, remains unexplored in the FL settings. We present a novel FL algorithm, FedMPQ, which introduces mixed-precision quantization to resource-heterogeneous FL systems. Specifically, local models, quantized so as to satisfy bit-width constraint, are trained by optimizing an objective function that includes a regularization term which promotes reduction of precision in some of the layers without significant performance degradation. The server collects local model updates, de-quantizes them into full-precision models, and then aggregates them into a global model. To initialize the next round of local training, the server relies on the information learned in the previous training round to customize bit-width assignments of the models delivered to different clients. In extensive benchmarking experiments on several model architectures and different datasets in both iid and non-iid settings, FedMPQ outperformed the baseline FL schemes that utilize fixed-precision quantization while incurring only a minor computational overhead on the participating devices. ",
    "url": "https://arxiv.org/abs/2311.18129",
    "authors": [
      "Huancheng Chen",
      "Haris Vikalo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2311.18130",
    "title": "The Trifecta: Three simple techniques for training deeper  Forward-Forward networks",
    "abstract": "Modern machine learning models are able to outperform humans on a variety of non-trivial tasks. However, as the complexity of the models increases, they consume significant amounts of power and still struggle to generalize effectively to unseen data. Local learning, which focuses on updating subsets of a model's parameters at a time, has emerged as a promising technique to address these issues. Recently, a novel local learning algorithm, called Forward-Forward, has received widespread attention due to its innovative approach to learning. Unfortunately, its application has been limited to smaller datasets due to scalability issues. To this end, we propose The Trifecta, a collection of three simple techniques that synergize exceptionally well and drastically improve the Forward-Forward algorithm on deeper networks. Our experiments demonstrate that our models are on par with similarly structured, backpropagation-based models in both training speed and test accuracy on simple datasets. This is achieved by the ability to learn representations that are informative locally, on a layer-by-layer basis, and retain their informativeness when propagated to deeper layers in the architecture. This leads to around 84\\% accuracy on CIFAR-10, a notable improvement (25\\%) over the original FF algorithm. These results highlight the potential of Forward-Forward as a genuine competitor to backpropagation and as a promising research avenue. ",
    "url": "https://arxiv.org/abs/2311.18130",
    "authors": [
      "Thomas Dooms",
      "Ing Jyh Tsang",
      "Jose Oramas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18140",
    "title": "ROBBIE: Robust Bias Evaluation of Large Generative Language Models",
    "abstract": "As generative large language models (LLMs) grow more performant and prevalent, we must develop comprehensive enough tools to measure and improve their fairness. Different prompt-based datasets can be used to measure social bias across multiple text domains and demographic axes, meaning that testing LLMs on more datasets can potentially help us characterize their biases more fully, and better ensure equal and equitable treatment of marginalized demographic groups. In this work, our focus is two-fold: (1) Benchmarking: a comparison of 6 different prompt-based bias and toxicity metrics across 12 demographic axes and 5 families of generative LLMs. Out of those 6 metrics, AdvPromptSet and HolisticBiasR are novel datasets proposed in the paper. The comparison of those benchmarks gives us insights about the bias and toxicity of the compared models. Therefore, we explore the frequency of demographic terms in common LLM pre-training corpora and how this may relate to model biases. (2) Mitigation: we conduct a comprehensive study of how well 3 bias/toxicity mitigation techniques perform across our suite of measurements. ROBBIE aims to provide insights for practitioners while deploying a model, emphasizing the need to not only measure potential harms, but also understand how they arise by characterizing the data, mitigate harms once found, and balance any trade-offs. We open-source our analysis code in hopes of encouraging broader measurements of bias in future LLMs. ",
    "url": "https://arxiv.org/abs/2311.18140",
    "authors": [
      "David Esiobu",
      "Xiaoqing Tan",
      "Saghar Hosseini",
      "Megan Ung",
      "Yuchen Zhang",
      "Jude Fernandes",
      "Jane Dwivedi-Yu",
      "Eleonora Presani",
      "Adina Williams",
      "Eric Michael Smith"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.18149",
    "title": "STF: Spatial Temporal Fusion for Trajectory Prediction",
    "abstract": "Trajectory prediction is a challenging task that aims to predict the future trajectory of vehicles or pedestrians over a short time horizon based on their historical positions. The main reason is that the trajectory is a kind of complex data, including spatial and temporal information, which is crucial for accurate prediction. Intuitively, the more information the model can capture, the more precise the future trajectory can be predicted. However, previous works based on deep learning methods processed spatial and temporal information separately, leading to inadequate spatial information capture, which means they failed to capture the complete spatial information. Therefore, it is of significance to capture information more fully and effectively on vehicle interactions. In this study, we introduced an integrated 3D graph that incorporates both spatial and temporal edges. Based on this, we proposed the integrated 3D graph, which considers the cross-time interaction information. In specific, we design a Spatial-Temporal Fusion (STF) model including Multi-layer perceptions (MLP) and Graph Attention (GAT) to capture the spatial and temporal information historical trajectories simultaneously on the 3D graph. Our experiment on the ApolloScape Trajectory Datasets shows that the proposed STF outperforms several baseline methods, especially on the long-time-horizon trajectory prediction. ",
    "url": "https://arxiv.org/abs/2311.18149",
    "authors": [
      "Pengqian Han",
      "Partha Roop",
      "Jiamou Liu",
      "Tianzhe Bao",
      "Yifei Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18177",
    "title": "An Effective Universal Polynomial Basis for Spectral Graph Neural  Networks",
    "abstract": "Spectral Graph Neural Networks (GNNs), also referred to as graph filters have gained increasing prevalence for heterophily graphs. Optimal graph filters rely on Laplacian eigendecomposition for Fourier transform. In an attempt to avert the prohibitive computations, numerous polynomial filters by leveraging distinct polynomials have been proposed to approximate the desired graph filters. However, polynomials in the majority of polynomial filters are predefined and remain fixed across all graphs, failing to accommodate the diverse heterophily degrees across different graphs. To tackle this issue, we first investigate the correlation between polynomial bases of desired graph filters and the degrees of graph heterophily via a thorough theoretical analysis. Afterward, we develop an adaptive heterophily basis by incorporating graph heterophily degrees. Subsequently, we integrate this heterophily basis with the homophily basis, creating a universal polynomial basis UniBasis. In consequence, we devise a general polynomial filter UniFilter. Comprehensive experiments on both real-world and synthetic datasets with varying heterophily degrees significantly support the superiority of UniFilter, demonstrating the effectiveness and generality of UniBasis, as well as its promising capability as a new method for graph analysis. ",
    "url": "https://arxiv.org/abs/2311.18177",
    "authors": [
      "Keke Huang",
      "Pietro Liò"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2311.18198",
    "title": "S-T CRF: Spatial-Temporal Conditional Random Field for Human Trajectory  Prediction",
    "abstract": "Trajectory prediction is of significant importance in computer vision. Accurate pedestrian trajectory prediction benefits autonomous vehicles and robots in planning their motion. Pedestrians' trajectories are greatly influenced by their intentions. Prior studies having introduced various deep learning methods only pay attention to the spatial and temporal information of trajectory, overlooking the explicit intention information. In this study, we introduce a novel model, termed the \\textbf{S-T CRF}: \\textbf{S}patial-\\textbf{T}emporal \\textbf{C}onditional \\textbf{R}andom \\textbf{F}ield, which judiciously incorporates intention information besides spatial and temporal information of trajectory. This model uses a Conditional Random Field (CRF) to generate a representation of future intentions, greatly improving the prediction of subsequent trajectories when combined with spatial-temporal representation. Furthermore, the study innovatively devises a space CRF loss and a time CRF loss, meticulously designed to enhance interaction constraints and temporal dynamics, respectively. Extensive experimental evaluations on dataset ETH/UCY and SDD demonstrate that the proposed method surpasses existing baseline approaches. ",
    "url": "https://arxiv.org/abs/2311.18198",
    "authors": [
      "Pengqian Han",
      "Jiamou Liu",
      "Jialing He",
      "Zeyu Zhang",
      "Song Yang",
      "Yanni Tang",
      "Partha Roop"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18244",
    "title": "Poisoning Attacks Against Contrastive Recommender Systems",
    "abstract": "Contrastive learning (CL) has recently gained significant popularity in the field of recommendation. Its ability to learn without heavy reliance on labeled data is a natural antidote to the data sparsity issue. Previous research has found that CL can not only enhance recommendation accuracy but also inadvertently exhibit remarkable robustness against noise. However, this paper identifies a vulnerability of CL-based recommender systems: Compared with their non-CL counterparts, they are even more susceptible to poisoning attacks that aim to promote target items. Our analysis points to the uniform dispersion of representations led by the CL loss as the very factor that accounts for this vulnerability. We further theoretically and empirically demonstrate that the optimization of CL loss can lead to smooth spectral values of representations. Based on these insights, we attempt to reveal the potential poisoning attacks against CL-based recommender systems. The proposed attack encompasses a dual-objective framework: One that induces a smoother spectral value distribution to amplify the CL loss's inherent dispersion effect, named dispersion promotion; and the other that directly elevates the visibility of target items, named rank promotion. We validate the destructiveness of our attack model through extensive experimentation on four datasets. By shedding light on these vulnerabilities, we aim to facilitate the development of more robust CL-based recommender systems. ",
    "url": "https://arxiv.org/abs/2311.18244",
    "authors": [
      "Zongwei Wang",
      "Junliang Yu",
      "Min Gao",
      "Hongzhi Yin",
      "Bin Cui",
      "Shazia Sadiq"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18252",
    "title": "Navigating Privacy and Copyright Challenges Across the Data Lifecycle of  Generative AI",
    "abstract": "The advent of Generative AI has marked a significant milestone in artificial intelligence, demonstrating remarkable capabilities in generating realistic images, texts, and data patterns. However, these advancements come with heightened concerns over data privacy and copyright infringement, primarily due to the reliance on vast datasets for model training. Traditional approaches like differential privacy, machine unlearning, and data poisoning only offer fragmented solutions to these complex issues. Our paper delves into the multifaceted challenges of privacy and copyright protection within the data lifecycle. We advocate for integrated approaches that combines technical innovation with ethical foresight, holistically addressing these concerns by investigating and devising solutions that are informed by the lifecycle perspective. This work aims to catalyze a broader discussion and inspire concerted efforts towards data privacy and copyright integrity in Generative AI. ",
    "url": "https://arxiv.org/abs/2311.18252",
    "authors": [
      "Dawen Zhang",
      "Boming Xia",
      "Yue Liu",
      "Xiwei Xu",
      "Thong Hoang",
      "Zhenchang Xing",
      "Mark Staples",
      "Qinghua Lu",
      "Liming Zhu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18265",
    "title": "MCI Detection using fMRI time series embeddings of Recurrence plots",
    "abstract": "The human brain can be conceptualized as a dynamical system. Utilizing resting state fMRI time series imaging, we can study the underlying dynamics at ear-marked Regions of Interest (ROIs) to understand structure or lack thereof. This differential behavior could be key to understanding the neurodegeneration and also to classify between healthy and Mild Cognitive Impairment (MCI) subjects. In this study, we consider 6 brain networks spanning over 160 ROIs derived from Dosenbach template, where each network consists of 25-30 ROIs. Recurrence plot, extensively used to understand evolution of time series, is employed. Representative time series at each ROI is converted to its corresponding recurrence plot visualization, which is subsequently condensed to low-dimensional feature embeddings through Autoencoders. The performance of the proposed method is shown on fMRI volumes of 100 subjects (balanced data), taken from publicly available ADNI dataset. Results obtained show peak classification accuracy of 93% among the 6 brain networks, mean accuracy of 89.3% thereby illustrating promise in the proposed approach. ",
    "url": "https://arxiv.org/abs/2311.18265",
    "authors": [
      "Ninad Aithal",
      "Chakka Sai Pradeep",
      "Neelam Sinha"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18273",
    "title": "HKUST at SemEval-2023 Task 1: Visual Word Sense Disambiguation with  Context Augmentation and Visual Assistance",
    "abstract": "Visual Word Sense Disambiguation (VWSD) is a multi-modal task that aims to select, among a batch of candidate images, the one that best entails the target word's meaning within a limited context. In this paper, we propose a multi-modal retrieval framework that maximally leverages pretrained Vision-Language models, as well as open knowledge bases and datasets. Our system consists of the following key components: (1) Gloss matching: a pretrained bi-encoder model is used to match contexts with proper senses of the target words; (2) Prompting: matched glosses and other textual information, such as synonyms, are incorporated using a prompting template; (3) Image retrieval: semantically matching images are retrieved from large open datasets using prompts as queries; (4) Modality fusion: contextual information from different modalities are fused and used for prediction. Although our system does not produce the most competitive results at SemEval-2023 Task 1, we are still able to beat nearly half of the teams. More importantly, our experiments reveal acute insights for the field of Word Sense Disambiguation (WSD) and multi-modal learning. Our code is available on GitHub. ",
    "url": "https://arxiv.org/abs/2311.18273",
    "authors": [
      "Zhuohao Yin",
      "Xin Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2311.18307",
    "title": "Categorical Traffic Transformer: Interpretable and Diverse Behavior  Prediction with Tokenized Latent",
    "abstract": "Adept traffic models are critical to both planning and closed-loop simulation for autonomous vehicles (AV), and key design objectives include accuracy, diverse multimodal behaviors, interpretability, and downstream compatibility. Recently, with the advent of large language models (LLMs), an additional desirable feature for traffic models is LLM compatibility. We present Categorical Traffic Transformer (CTT), a traffic model that outputs both continuous trajectory predictions and tokenized categorical predictions (lane modes, homotopies, etc.). The most outstanding feature of CTT is its fully interpretable latent space, which enables direct supervision of the latent variable from the ground truth during training and avoids mode collapse completely. As a result, CTT can generate diverse behaviors conditioned on different latent modes with semantic meanings while beating SOTA on prediction accuracy. In addition, CTT's ability to input and output tokens enables integration with LLMs for common-sense reasoning and zero-shot generalization. ",
    "url": "https://arxiv.org/abs/2311.18307",
    "authors": [
      "Yuxiao Chen",
      "Sander Tonkens",
      "Marco Pavone"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.18311",
    "title": "Anisotropic Neural Representation Learning for High-Quality Neural  Rendering",
    "abstract": "Neural radiance fields (NeRFs) have achieved impressive view synthesis results by learning an implicit volumetric representation from multi-view images. To project the implicit representation into an image, NeRF employs volume rendering that approximates the continuous integrals of rays as an accumulation of the colors and densities of the sampled points. Although this approximation enables efficient rendering, it ignores the direction information in point intervals, resulting in ambiguous features and limited reconstruction quality. In this paper, we propose an anisotropic neural representation learning method that utilizes learnable view-dependent features to improve scene representation and reconstruction. We model the volumetric function as spherical harmonic (SH)-guided anisotropic features, parameterized by multilayer perceptrons, facilitating ambiguity elimination while preserving the rendering efficiency. To achieve robust scene reconstruction without anisotropy overfitting, we regularize the energy of the anisotropic features during training. Our method is flexiable and can be plugged into NeRF-based frameworks. Extensive experiments show that the proposed representation can boost the rendering quality of various NeRFs and achieve state-of-the-art rendering performance on both synthetic and real-world scenes. ",
    "url": "https://arxiv.org/abs/2311.18311",
    "authors": [
      "Y.Wang",
      "J. Xu",
      "Y. Zeng",
      "Y. Gong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2311.18328",
    "title": "Advances in 3D Neural Stylization: A Survey",
    "abstract": "Modern artificial intelligence provides a novel way of producing digital art in styles. The expressive power of neural networks enables the realm of visual style transfer methods, which can be used to edit images, videos, and 3D data to make them more artistic and diverse. This paper reports on recent advances in neural stylization for 3D data. We provide a taxonomy for neural stylization by considering several important design choices, including scene representation, guidance data, optimization strategies, and output styles. Building on such taxonomy, our survey first revisits the background of neural stylization on 2D images, and then provides in-depth discussions on recent neural stylization methods for 3D data, where we also provide a mini-benchmark on artistic stylization methods. Based on the insights gained from the survey, we then discuss open challenges, future research, and potential applications and impacts of neural stylization. ",
    "url": "https://arxiv.org/abs/2311.18328",
    "authors": [
      "Yingshu Chen",
      "Guocheng Shao",
      "Ka Chun Shum",
      "Binh-Son Hua",
      "Sai-Kit Yeung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2311.18332",
    "title": "Multilevel Saliency-Guided Self-Supervised Learning for Image Anomaly  Detection",
    "abstract": "Anomaly detection (AD) is a fundamental task in computer vision. It aims to identify incorrect image data patterns which deviate from the normal ones. Conventional methods generally address AD by preparing augmented negative samples to enforce self-supervised learning. However, these techniques typically do not consider semantics during augmentation, leading to the generation of unrealistic or invalid negative samples. Consequently, the feature extraction network can be hindered from embedding critical features. In this study, inspired by visual attention learning approaches, we propose CutSwap, which leverages saliency guidance to incorporate semantic cues for augmentation. Specifically, we first employ LayerCAM to extract multilevel image features as saliency maps and then perform clustering to obtain multiple centroids. To fully exploit saliency guidance, on each map, we select a pixel pair from the cluster with the highest centroid saliency to form a patch pair. Such a patch pair includes highly similar context information with dense semantic correlations. The resulting negative sample is created by swapping the locations of the patch pair. Compared to prior augmentation methods, CutSwap generates more subtle yet realistic negative samples to facilitate quality feature learning. Extensive experimental and ablative evaluations demonstrate that our method achieves state-of-the-art AD performance on two mainstream AD benchmark datasets. ",
    "url": "https://arxiv.org/abs/2311.18332",
    "authors": [
      "Jianjian Qin",
      "Chunzhi Gu",
      "Jun Yu",
      "Chao Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18341",
    "title": "Learning Robust Precipitation Forecaster by Temporal Frame Interpolation",
    "abstract": "Recent advancements in deep learning have propelled the field of weather prediction models to new heights. Despite their progress, these models often struggle with real-world application due to their sensitivity to spatial-temporal shifts, a vulnerability particularly pronounced in weather prediction tasks where overfitting to local and temporal variations is common. This paper presents an investigation into the development of a robust precipitation forecasting model that stands resilient to such shifts. We introduce Temporal Frame Interpolation (TFI), an innovative technique designed to fortify forecasting models against spatial-temporal discrepancies. TFI operates by generating synthetic samples through the interpolation of adjacent frames from satellite imagery and ground radar data, thereby enriching the training dataset and bolstering the model's defense against noise on frames. Additionally, we integrate a novel multi-level dice loss, which exploits the ordinal nature of rainfall intensities to further refine model performance. These methodologies have collectively advanced our model's forecasting precision, achieving \\textit{1st place} on the transfer learning leaderboard in the \\textit{Weather4Cast'23 competition}.It not only demonstrates the efficacy of our approaches but also sets a new benchmark for deep learning applications in meteorological forecasting. Our code and weights have been public on \\url{https://github.com/Secilia-Cxy/UNetTFI}. ",
    "url": "https://arxiv.org/abs/2311.18341",
    "authors": [
      "Lu Han",
      "Xu-Yang Chen",
      "Han-Jia Ye",
      "De-Chuan Zhan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)"
    ]
  },
  {
    "id": "arXiv:2311.18344",
    "title": "DSeg: Direct Line Segments Detection",
    "abstract": "This paper presents a model-driven approach to detect image line segments. The approach incrementally detects segments on the gradient image using a linear Kalman filter that estimates the supporting line parameters and their associated variances. The algorithm is fast and robust with respect to image noise and illumination variations, it allows the detection of longer line segments than data-driven approaches, and does not require any tedious parameters tuning. An extension of the algorithm that exploits a pyramidal approach to enhance the quality of results is proposed. Results with varying scene illumination and comparisons to classic existing approaches are presented. ",
    "url": "https://arxiv.org/abs/2311.18344",
    "authors": [
      "Berger Cyrille",
      "Lacroix Simon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18345",
    "title": "Situating the social issues of image generation models in the model life  cycle: a sociotechnical approach",
    "abstract": "The race to develop image generation models is intensifying, with a rapid increase in the number of text-to-image models available. This is coupled with growing public awareness of these technologies. Though other generative AI models--notably, large language models--have received recent critical attention for the social and other non-technical issues they raise, there has been relatively little comparable examination of image generation models. This paper reports on a novel, comprehensive categorization of the social issues associated with image generation models. At the intersection of machine learning and the social sciences, we report the results of a survey of the literature, identifying seven issue clusters arising from image generation models: data issues, intellectual property, bias, privacy, and the impacts on the informational, cultural, and natural environments. We situate these social issues in the model life cycle, to aid in considering where potential issues arise, and mitigation may be needed. We then compare these issue clusters with what has been reported for large language models. Ultimately, we argue that the risks posed by image generation models are comparable in severity to the risks posed by large language models, and that the social impact of image generation models must be urgently considered. ",
    "url": "https://arxiv.org/abs/2311.18345",
    "authors": [
      "Amelia Katirai",
      "Noa Garcia",
      "Kazuki Ide",
      "Yuta Nakashima",
      "Atsuo Kishimoto"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2311.18350",
    "title": "Unveiling Backdoor Risks Brought by Foundation Models in Heterogeneous  Federated Learning",
    "abstract": "The foundation models (FMs) have been used to generate synthetic public datasets for the heterogeneous federated learning (HFL) problem where each client uses a unique model architecture. However, the vulnerabilities of integrating FMs, especially against backdoor attacks, are not well-explored in the HFL contexts. In this paper, we introduce a novel backdoor attack mechanism for HFL that circumvents the need for client compromise or ongoing participation in the FL process. This method plants and transfers the backdoor through a generated synthetic public dataset, which could help evade existing backdoor defenses in FL by presenting normal client behaviors. Empirical experiments across different HFL configurations and benchmark datasets demonstrate the effectiveness of our attack compared to traditional client-based attacks. Our findings reveal significant security risks in developing robust FM-assisted HFL systems. This research contributes to enhancing the safety and integrity of FL systems, highlighting the need for advanced security measures in the era of FMs. ",
    "url": "https://arxiv.org/abs/2311.18350",
    "authors": [
      "Xi Li",
      "Chen Wu",
      "Jiaqi Wang"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2311.18358",
    "title": "TIDE: Test Time Few Shot Object Detection",
    "abstract": "Few-shot object detection (FSOD) aims to extract semantic knowledge from limited object instances of novel categories within a target domain. Recent advances in FSOD focus on fine-tuning the base model based on a few objects via meta-learning or data augmentation. Despite their success, the majority of them are grounded with parametric readjustment to generalize on novel objects, which face considerable challenges in Industry 5.0, such as (i) a certain amount of fine-tuning time is required, and (ii) the parameters of the constructed model being unavailable due to the privilege protection, making the fine-tuning fail. Such constraints naturally limit its application in scenarios with real-time configuration requirements or within black-box settings. To tackle the challenges mentioned above, we formalize a novel FSOD task, referred to as Test TIme Few Shot DEtection (TIDE), where the model is un-tuned in the configuration procedure. To that end, we introduce an asymmetric architecture for learning a support-instance-guided dynamic category classifier. Further, a cross-attention module and a multi-scale resizer are provided to enhance the model performance. Experimental results on multiple few-shot object detection platforms reveal that the proposed TIDE significantly outperforms existing contemporary methods. The implementation codes are available at https://github.com/deku-0621/TIDE ",
    "url": "https://arxiv.org/abs/2311.18358",
    "authors": [
      "Weikai Li",
      "Hongfeng Wei",
      "Yanlai Wu",
      "Jie Yang",
      "Yudi Ruan",
      "Yuan Li",
      "Ying Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18433",
    "title": "E2PNet: Event to Point Cloud Registration with Spatio-Temporal  Representation Learning",
    "abstract": "Event cameras have emerged as a promising vision sensor in recent years due to their unparalleled temporal resolution and dynamic range. While registration of 2D RGB images to 3D point clouds is a long-standing problem in computer vision, no prior work studies 2D-3D registration for event cameras. To this end, we propose E2PNet, the first learning-based method for event-to-point cloud registration. The core of E2PNet is a novel feature representation network called Event-Points-to-Tensor (EP2T), which encodes event data into a 2D grid-shaped feature tensor. This grid-shaped feature enables matured RGB-based frameworks to be easily used for event-to-point cloud registration, without changing hyper-parameters and the training procedure. EP2T treats the event input as spatio-temporal point clouds. Unlike standard 3D learning architectures that treat all dimensions of point clouds equally, the novel sampling and information aggregation modules in EP2T are designed to handle the inhomogeneity of the spatial and temporal dimensions. Experiments on the MVSEC and VECtor datasets demonstrate the superiority of E2PNet over hand-crafted and other learning-based methods. Compared to RGB-based registration, E2PNet is more robust to extreme illumination or fast motion due to the use of event data. Beyond 2D-3D registration, we also show the potential of EP2T for other vision tasks such as flow estimation, event-to-image reconstruction and object recognition. The source code can be found at: https://github.com/Xmu-qcj/E2PNet. ",
    "url": "https://arxiv.org/abs/2311.18433",
    "authors": [
      "Xiuhong Lin",
      "Changjie Qiu",
      "Zhipeng Cai",
      "Siqi Shen",
      "Yu Zang",
      "Weiquan Liu",
      "Xuesheng Bian",
      "Matthias Müller",
      "Cheng Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18434",
    "title": "Exploring the Temperature-Dependent Phase Transition in Modern Hopfield  Networks",
    "abstract": "The recent discovery of a connection between Transformers and Modern Hopfield Networks (MHNs) has reignited the study of neural networks from a physical energy-based perspective. This paper focuses on the pivotal effect of the inverse temperature hyperparameter $\\beta$ on the distribution of energy minima of the MHN. To achieve this, the distribution of energy minima is tracked in a simplified MHN in which equidistant normalised patterns are stored. This network demonstrates a phase transition at a critical temperature $\\beta_{\\text{c}}$, from a single global attractor towards highly pattern specific minima as $\\beta$ is increased. Importantly, the dynamics are not solely governed by the hyperparameter $\\beta$ but are instead determined by an effective inverse temperature $\\beta_{\\text{eff}}$ which also depends on the distribution and size of the stored patterns. Recognizing the role of hyperparameters in the MHN could, in the future, aid researchers in the domain of Transformers to optimise their initial choices, potentially reducing the necessity for time and energy expensive hyperparameter fine-tuning. ",
    "url": "https://arxiv.org/abs/2311.18434",
    "authors": [
      "Felix Koulischer",
      "Cédric Goemaere",
      "Tom van der Meersch",
      "Johannes Deleu",
      "Thomas Demeester"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)"
    ]
  },
  {
    "id": "arXiv:2311.18460",
    "title": "Causal Fairness under Unobserved Confounding: A Neural Sensitivity  Framework",
    "abstract": "Fairness for machine learning predictions is widely required in practice for legal, ethical, and societal reasons. Existing work typically focuses on settings without unobserved confounding, even though unobserved confounding can lead to severe violations of causal fairness and, thus, unfair predictions. In this work, we analyze the sensitivity of causal fairness to unobserved confounding. Our contributions are three-fold. First, we derive bounds for causal fairness metrics under different sources of unobserved confounding. This enables practitioners to examine the sensitivity of their machine learning models to unobserved confounding in fairness-critical applications. Second, we propose a novel neural framework for learning fair predictions, which allows us to offer worst-case guarantees of the extent to which causal fairness can be violated due to unobserved confounding. Third, we demonstrate the effectiveness of our framework in a series of experiments, including a real-world case study about predicting prison sentences. To the best of our knowledge, ours is the first work to study causal fairness under unobserved confounding. To this end, our work is of direct practical value as a refutation strategy to ensure the fairness of predictions in high-stakes applications. ",
    "url": "https://arxiv.org/abs/2311.18460",
    "authors": [
      "Maresa Schröder",
      "Dennis Frauen",
      "Stefan Feuerriegel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2311.18473",
    "title": "DGMem: Learning Visual Navigation Policy without Any Labels by Dynamic  Graph Memory",
    "abstract": "In recent years, learning-based approaches have demonstrated significant promise in addressing intricate navigation tasks. Traditional methods for training deep neural network navigation policies rely on meticulously designed reward functions or extensive teleoperation datasets as navigation demonstrations. However, the former is often confined to simulated environments, and the latter demands substantial human labor, making it a time-consuming process. Our vision is for robots to autonomously learn navigation skills and adapt their behaviors to environmental changes without any human intervention. In this work, we discuss the self-supervised navigation problem and present Dynamic Graph Memory (DGMem), which facilitates training only with on-board observations. With the help of DGMem, agents can actively explore their surroundings, autonomously acquiring a comprehensive navigation policy in a data-efficient manner without external feedback. Our method is evaluated in photorealistic 3D indoor scenes, and empirical studies demonstrate the effectiveness of DGMem. ",
    "url": "https://arxiv.org/abs/2311.18473",
    "authors": [
      "Wenzhe Cai",
      "Teng Wang",
      "Guangran Cheng",
      "Lele Xu",
      "Changyin Sun"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.18474",
    "title": "A Robust Hessian-based Trust Region Algorithm for Spherical Conformal  Parameterizations",
    "abstract": "Surface parameterizations are widely applied in computer graphics, medical imaging and transformation optics. In this paper, we rigorously derive the gradient vector and Hessian matrix of the discrete conformal energy for spherical conformal parameterizations of simply connected closed surfaces of genus-$0$. In addition, we give the sparsity structure of the Hessian matrix, which leads to a robust Hessian-based trust region algorithm for the computation of spherical conformal maps. Numerical experiments demonstrate the local quadratic convergence of the proposed algorithm with low conformal distortions. We subsequently propose an application of our method to surface registrations that still maintains local quadratic convergence. ",
    "url": "https://arxiv.org/abs/2311.18474",
    "authors": [
      "Zhong-Heng Tan",
      "Tiexiang Li",
      "Wen-Wei Lin",
      "Shing-Tung Yau"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2311.18486",
    "title": "New Perspectives on the Evaluation of Link Prediction Algorithms for  Dynamic Graphs",
    "abstract": "There is a fast-growing body of research on predicting future links in dynamic networks, with many new algorithms. Some benchmark data exists, and performance evaluations commonly rely on comparing the scores of observed network events (positives) with those of randomly generated ones (negatives). These evaluation measures depend on both the predictive ability of the model and, crucially, the type of negative samples used. Besides, as generally the case with temporal data, prediction quality may vary over time. This creates a complex evaluation space. In this work, we catalog the possibilities for negative sampling and introduce novel visualization methods that can yield insight into prediction performance and the dynamics of temporal networks. We leverage these visualization tools to investigate the effect of negative sampling on the predictive performance, at the node and edge level. We validate empirically, on datasets extracted from recent benchmarks that the error is typically not evenly distributed across different data segments. Finally, we argue that such visualization tools can serve as powerful guides to evaluate dynamic link prediction methods at different levels. ",
    "url": "https://arxiv.org/abs/2311.18486",
    "authors": [
      "Raphaël Romero",
      "Tijl De Bie",
      "Jefrey Lijffijt"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.18495",
    "title": "Improving Adversarial Transferability via Model Alignment",
    "abstract": "Neural networks are susceptible to adversarial perturbations that are transferable across different models. In this paper, we introduce a novel model alignment technique aimed at improving a given source model's ability in generating transferable adversarial perturbations. During the alignment process, the parameters of the source model are fine-tuned to minimize an alignment loss. This loss measures the divergence in the predictions between the source model and another, independently trained model, referred to as the witness model. To understand the effect of model alignment, we conduct a geometric anlaysis of the resulting changes in the loss landscape. Extensive experiments on the ImageNet dataset, using a variety of model architectures, demonstrate that perturbations generated from aligned source models exhibit significantly higher transferability than those from the original source model. ",
    "url": "https://arxiv.org/abs/2311.18495",
    "authors": [
      "Avery Ma",
      "Amir-massoud Farahmand",
      "Yangchen Pan",
      "Philip Torr",
      "Jindong Gu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18498",
    "title": "Data-Agnostic Model Poisoning against Federated Learning: A Graph  Autoencoder Approach",
    "abstract": "This paper proposes a novel, data-agnostic, model poisoning attack on Federated Learning (FL), by designing a new adversarial graph autoencoder (GAE)-based framework. The attack requires no knowledge of FL training data and achieves both effectiveness and undetectability. By listening to the benign local models and the global model, the attacker extracts the graph structural correlations among the benign local models and the training data features substantiating the models. The attacker then adversarially regenerates the graph structural correlations while maximizing the FL training loss, and subsequently generates malicious local models using the adversarial graph structure and the training data features of the benign ones. A new algorithm is designed to iteratively train the malicious local models using GAE and sub-gradient descent. The convergence of FL under attack is rigorously proved, with a considerably large optimality gap. Experiments show that the FL accuracy drops gradually under the proposed attack and existing defense mechanisms fail to detect it. The attack can give rise to an infection across all benign devices, making it a serious threat to FL. ",
    "url": "https://arxiv.org/abs/2311.18498",
    "authors": [
      "Kai Li",
      "Jingjing Zheng",
      "Xin Yuan",
      "Wei Ni",
      "Ozgur B. Akan",
      "H. Vincent Poor"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.18512",
    "title": "Revisiting Proposal-based Object Detection",
    "abstract": "This paper revisits the pipeline for detecting objects in images with proposals. For any object detector, the obtained box proposals or queries need to be classified and regressed towards ground truth boxes. The common solution for the final predictions is to directly maximize the overlap between each proposal and the ground truth box, followed by a winner-takes-all ranking or non-maximum suppression. In this work, we propose a simple yet effective alternative. For proposal regression, we solve a simpler problem where we regress to the area of intersection between proposal and ground truth. In this way, each proposal only specifies which part contains the object, avoiding a blind inpainting problem where proposals need to be regressed beyond their visual scope. In turn, we replace the winner-takes-all strategy and obtain the final prediction by taking the union over the regressed intersections of a proposal group surrounding an object. Our revisited approach comes with minimal changes to the detection pipeline and can be plugged into any existing method. We show that our approach directly improves canonical object detection and instance segmentation architectures, highlighting the utility of intersection-based regression and grouping. ",
    "url": "https://arxiv.org/abs/2311.18512",
    "authors": [
      "Aritra Bhowmik",
      "Martin R. Oswald",
      "Pascal Mettes",
      "Cees G. M. Snoek"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18525",
    "title": "Detecting Anomalous Network Communication Patterns Using Graph  Convolutional Networks",
    "abstract": "To protect an organizations' endpoints from sophisticated cyberattacks, advanced detection methods are required. In this research, we present GCNetOmaly: a graph convolutional network (GCN)-based variational autoencoder (VAE) anomaly detector trained on data that include connection events among internal and external machines. As input, the proposed GCN-based VAE model receives two matrices: (i) the normalized adjacency matrix, which represents the connections among the machines, and (ii) the feature matrix, which includes various features (demographic, statistical, process-related, and Node2vec structural features) that are used to profile the individual nodes/machines. After training the model on data collected for a predefined time window, the model is applied on the same data; the reconstruction score obtained by the model for a given machine then serves as the machine's anomaly score. GCNetOmaly was evaluated on real, large-scale data logged by Carbon Black EDR from a large financial organization's automated teller machines (ATMs) as well as communication with Active Directory (AD) servers in two setups: unsupervised and supervised. The results of our evaluation demonstrate GCNetOmaly's effectiveness in detecting anomalous behavior of machines on unsupervised data. ",
    "url": "https://arxiv.org/abs/2311.18525",
    "authors": [
      "Yizhak Vaisman",
      "Gilad Katz",
      "Yuval Elovici",
      "Asaf Shabtai"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18526",
    "title": "HOT: Higher-Order Dynamic Graph Representation Learning with Efficient  Transformers",
    "abstract": "Many graph representation learning (GRL) problems are dynamic, with millions of edges added or removed per second. A fundamental workload in this setting is dynamic link prediction: using a history of graph updates to predict whether a given pair of vertices will become connected. Recent schemes for link prediction in such dynamic settings employ Transformers, modeling individual graph updates as single tokens. In this work, we propose HOT: a model that enhances this line of works by harnessing higher-order (HO) graph structures; specifically, k-hop neighbors and more general subgraphs containing a given pair of vertices. Harnessing such HO structures by encoding them into the attention matrix of the underlying Transformer results in higher accuracy of link prediction outcomes, but at the expense of increased memory pressure. To alleviate this, we resort to a recent class of schemes that impose hierarchy on the attention matrix, significantly reducing memory footprint. The final design offers a sweetspot between high accuracy and low memory utilization. HOT outperforms other dynamic GRL schemes, for example achieving 9%, 7%, and 15% higher accuracy than - respectively - DyGFormer, TGN, and GraphMixer, for the MOOC dataset. Our design can be seamlessly extended towards other dynamic GRL workloads. ",
    "url": "https://arxiv.org/abs/2311.18526",
    "authors": [
      "Maciej Besta",
      "Afonso Claudino Catarino",
      "Lukas Gianinazzi",
      "Nils Blach",
      "Piotr Nyczyk",
      "Hubert Niewiadomski",
      "Torsten Hoefler"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2311.18534",
    "title": "The lowest-order Neural Approximated Virtual Element Method",
    "abstract": "We introduce the Neural Approximated Virtual Element Method, a novel polygonal method that relies on neural networks to eliminate the need for projection and stabilization operators in the Virtual Element Method. In this paper, we discuss its formulation and detail the strategy for training the underlying neural network. The efficacy of this new method is tested through numerical experiments on elliptic problems. ",
    "url": "https://arxiv.org/abs/2311.18534",
    "authors": [
      "Stefano Berrone",
      "Davide Oberto",
      "Moreno Pintore",
      "Gioana Teora"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2311.18543",
    "title": "CrimeGraphNet: Link Prediction in Criminal Networks with Graph  Convolutional Networks",
    "abstract": "In this paper, we introduce CrimeGraphNet, a novel approach for link prediction in criminal networks utilizingGraph Convolutional Networks (GCNs). Criminal networks are intricate and dynamic, with covert links that are challenging to uncover. Accurate prediction of these links can aid in proactive crime prevention and investigation. Existing methods often fail to capture the complex interconnections in such networks. They also struggle in scenarios where only limited labeled data is available for training. To address these challenges, we propose CrimeGraphNet, which leverages the power of GCNs for link prediction in these networks. The GCNmodel effectively captures topological features and node characteristics, making it well-suited for this task. We evaluate CrimeGraphNet on several real-world criminal network datasets. Our results demonstrate that CrimeGraphNet outperforms existing methods in terms of prediction accuracy, robustness, and computational efAciency. Furthermore, our approach enables the extraction of meaningful insights from the predicted links, thereby contributing to a better understanding of the underlying criminal activities. Overall, CrimeGraphNet represents a signiAcant step forward in the use of deep learning for criminal network analysis. ",
    "url": "https://arxiv.org/abs/2311.18543",
    "authors": [
      "Chen Yang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2311.18545",
    "title": "Decentralized Deepfake Detection Network using Blockchain Technology",
    "abstract": "Deepfake technology is a major threat to the integrity of digital media. This paper presents a comprehensive framework for a blockchain-based decentralized system designed to tackle the escalating challenge of digital content integrity. The proposed system integrates advanced deep learning algorithms with the immutable and transparent nature of blockchain technology to create a trustless environment where authenticity can be verified without relying on a single centralized authority. Furthermore, the system utilizes smart contracts for dynamic algorithm management and token-based incentives further enhances the system's effectiveness and adaptability. The decentralized architecture of the system democratizes the process of verifying digital content and introduces a novel approach to combat deepfakes. The collaborative and adjustable nature of this system sets a new benchmark for digital media integrity, offering a more robust digital media environment. ",
    "url": "https://arxiv.org/abs/2311.18545",
    "authors": [
      "Dipankar Sarkar"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.18553",
    "title": "Heterogeneous Graph-based Trajectory Prediction using Local Map Context  and Social Interactions",
    "abstract": "Precisely predicting the future trajectories of surrounding traffic participants is a crucial but challenging problem in autonomous driving, due to complex interactions between traffic agents, map context and traffic rules. Vector-based approaches have recently shown to achieve among the best performances on trajectory prediction benchmarks. These methods model simple interactions between traffic agents but don't distinguish between relation-type and attributes like their distance along the road. Furthermore, they represent lanes only by sequences of vectors representing center lines and ignore context information like lane dividers and other road elements. We present a novel approach for vector-based trajectory prediction that addresses these shortcomings by leveraging three crucial sources of information: First, we model interactions between traffic agents by a semantic scene graph, that accounts for the nature and important features of their relation. Second, we extract agent-centric image-based map features to model the local map context. Finally, we generate anchor paths to enforce the policy in multi-modal prediction to permitted trajectories only. Each of these three enhancements shows advantages over the baseline model HoliGraph. ",
    "url": "https://arxiv.org/abs/2311.18553",
    "authors": [
      "Daniel Grimm",
      "Maximilian Zipfl",
      "Felix Hertlein",
      "Alexander Naumann",
      "Jürgen Lüttin",
      "Steffen Thoma",
      "Stefan Schmid",
      "Lavdim Halilaj",
      "Achim Rettinger",
      "J. Marius Zöllner"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.18567",
    "title": "Grammatical Gender's Influence on Distributional Semantics: A Causal  Perspective",
    "abstract": "How much meaning influences gender assignment across languages is an active area of research in modern linguistics and cognitive science. We can view current approaches as aiming to determine where gender assignment falls on a spectrum, from being fully arbitrarily determined to being largely semantically determined. For the latter case, there is a formulation of the neo-Whorfian hypothesis, which claims that even inanimate noun gender influences how people conceive of and talk about objects (using the choice of adjective used to modify inanimate nouns as a proxy for meaning). We offer a novel, causal graphical model that jointly represents the interactions between a noun's grammatical gender, its meaning, and adjective choice. In accordance with past results, we find a relationship between the gender of nouns and the adjectives which modify them. However, when we control for the meaning of the noun, we find that grammatical gender has a near-zero effect on adjective choice, thereby calling the neo-Whorfian hypothesis into question. ",
    "url": "https://arxiv.org/abs/2311.18567",
    "authors": [
      "Karolina Stańczak",
      "Kevin Du",
      "Adina Williams",
      "Isabelle Augenstein",
      "Ryan Cotterell"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.18575",
    "title": "Class Distribution Shifts in Zero-Shot Learning: Learning Robust  Representations",
    "abstract": "Distribution shifts between training and deployment data often affect the performance of machine learning models. In this paper, we explore a setting where a hidden variable induces a shift in the distribution of classes. These distribution shifts are particularly challenging for zero-shot classifiers, as they rely on representations learned from training classes, but are deployed on new, unseen ones. We introduce an algorithm to learn data representations that are robust to such class distribution shifts in zero-shot verification tasks. We show that our approach, which combines hierarchical data sampling with out-of-distribution generalization techniques, improves generalization to diverse class distributions in both simulations and real-world datasets. ",
    "url": "https://arxiv.org/abs/2311.18575",
    "authors": [
      "Yuli Slavutsky",
      "Yuval Benjamini"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18576",
    "title": "Fingerprint Matching with Localized Deep Representation",
    "abstract": "Compared to minutia-based fingerprint representations, fixed-length representations are attractive due to simple and efficient matching. However, fixed-length fingerprint representations are limited in accuracy when matching fingerprints with different visible areas, which can occur due to different finger poses or acquisition methods. To address this issue, we propose a localized deep representation of fingerprint, named LDRF. By focusing on the discriminative characteristics within local regions, LDRF provides a more robust and accurate fixed-length representation for fingerprints with variable visible areas. LDRF can be adapted to retain information within any valid area, making it highly flexible. The matching scores produced by LDRF also exhibit intuitive statistical characteristics, which led us to propose a matching score normalization technique to mitigate the uncertainty in the cases of very small overlapping area. With this new technique, we can maintain a high level of accuracy and reliability in our fingerprint matching, even as the size of the database grows rapidly. Our experimental results on 21 datasets containing over 140K fingerprints of various finger poses and impression types show that LDRF outperforms other fixed-length representations and is robust to sensing technologies and impression types. Besides, the proposed matching score normalization effectively reduces the false match rate (FMR) in large-scale identification experiments comprising over 5.11 million fingerprints. Specifically, this technique results in a reduction of two orders of magnitude compared to matching without matching score normalization and five orders of magnitude compared to prior works. ",
    "url": "https://arxiv.org/abs/2311.18576",
    "authors": [
      "Yongjie Duan",
      "Zhiyu Pan",
      "Jianjiang Feng",
      "Jie Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.18578",
    "title": "Communication-Efficient Heterogeneous Federated Learning with  Generalized Heavy-Ball Momentum",
    "abstract": "Federated Learning (FL) is the state-of-the-art approach for learning from decentralized data in privacy-constrained scenarios. As the current literature reports, the main problems associated with FL refer to system and statistical challenges: the former ones demand for efficient learning from edge devices, including lowering communication bandwidth and frequency, while the latter require algorithms robust to non-iidness. State-of-art approaches either guarantee convergence at increased communication cost or are not sufficiently robust to handle extreme heterogeneous local distributions. In this work we propose a novel generalization of the heavy-ball momentum, and present FedHBM to effectively address statistical heterogeneity in FL without introducing any communication overhead. We conduct extensive experimentation on common FL vision and NLP datasets, showing that our FedHBM algorithm empirically yields better model quality and higher convergence speed w.r.t. the state-of-art, especially in pathological non-iid scenarios. While being designed for cross-silo settings, we show how FedHBM is applicable in moderate-to-high cross-device scenarios, and how good model initializations (e.g. pre-training) can be exploited for prompt acceleration. Extended experimentation on large-scale real-world federated datasets further corroborates the effectiveness of our approach for real-world FL applications. ",
    "url": "https://arxiv.org/abs/2311.18578",
    "authors": [
      "Riccardo Zaccone",
      "Carlo Masone",
      "Marco Ciccone"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18587",
    "title": "Continuous 16-bit Training: Accelerating 32-bit Pre-Trained Neural  Networks",
    "abstract": "In the field of deep learning, the prevalence of models initially trained with 32-bit precision is a testament to its robustness and accuracy. However, the continuous evolution of these models often demands further training, which can be resource-intensive. This study introduces a novel approach where we continue the training of these pre-existing 32-bit models using 16-bit precision. This technique not only caters to the need for efficiency in computational resources but also significantly improves the speed of additional training phases. By adopting 16-bit precision for ongoing training, we are able to substantially decrease memory requirements and computational burden, thereby accelerating the training process in a resource-limited setting. Our experiments show that this method maintains the high standards of accuracy set by the original 32-bit training while providing a much-needed boost in training speed. This approach is especially pertinent in today's context, where most models are initially trained in 32-bit and require periodic updates and refinements. The findings from our research suggest that this strategy of 16-bit continuation training can be a key solution for sustainable and efficient deep learning, offering a practical way to enhance pre-trained models rapidly and in a resource-conscious manner. ",
    "url": "https://arxiv.org/abs/2311.18587",
    "authors": [
      "Juyoung Yun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.18595",
    "title": "DEFT: Distributed, Elastic, and Fault-tolerant State Management of  Network Functions",
    "abstract": "Network function virtualization is the key to developing elastically scalable and fault-tolerant network functions (e.g. load balancer, firewall etc.). By integrating NFV and SDN technologies, it is feasible to dynamically reroute traffic to new network function (NF) instances in the event of an NF failure or overload scenario. The fact that the majority of network functions are stateful makes the task more challenging. State migration and state replication are common approaches in achieving elasticity and fault tolerance. The majority of the studies in the literature either emphasize fault tolerance or elastic scalability while designing a state management system for network functions. In this paper, we have designed a complete state management system, called DEFT, that meets both elasticity and fault-tolerance goals. Our system also supports strong consistency on global state updates. While existing designs rely on a central controller or remote central storage to achieve strong consistency on state updates, DEFT utilizes distributed consensus mechanism to achieve the same. We have done a proof of concept implementation of DEFT and extensively tested DEFT under several model conditions to evaluate its scalability and performance. Our experimental results show that DEFT is scalable and maintains a considerably high throughput throughout. It incurs minimal performance overhead while achieving strong consistency on state updates. ",
    "url": "https://arxiv.org/abs/2311.18595",
    "authors": [
      "Md Mahir Shahriyar",
      "Gourab Saha",
      "Bishwajit Bhattacharjee",
      "Rezwana Reaz"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2311.18598",
    "title": "Generalisable Agents for Neural Network Optimisation",
    "abstract": "Optimising deep neural networks is a challenging task due to complex training dynamics, high computational requirements, and long training times. To address this difficulty, we propose the framework of Generalisable Agents for Neural Network Optimisation (GANNO) -- a multi-agent reinforcement learning (MARL) approach that learns to improve neural network optimisation by dynamically and responsively scheduling hyperparameters during training. GANNO utilises an agent per layer that observes localised network dynamics and accordingly takes actions to adjust these dynamics at a layerwise level to collectively improve global performance. In this paper, we use GANNO to control the layerwise learning rate and show that the framework can yield useful and responsive schedules that are competitive with handcrafted heuristics. Furthermore, GANNO is shown to perform robustly across a wide variety of unseen initial conditions, and can successfully generalise to harder problems than it was trained on. Our work presents an overview of the opportunities that this paradigm offers for training neural networks, along with key challenges that remain to be overcome. ",
    "url": "https://arxiv.org/abs/2311.18598",
    "authors": [
      "Kale-ab Tessera",
      "Callum Rhys Tilbury",
      "Sasha Abramowitz",
      "Ruan de Kock",
      "Omayma Mahjoub",
      "Benjamin Rosman",
      "Sara Hooker",
      "Arnu Pretorius"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2311.18620",
    "title": "Data-driven prediction of tool wear using Bayesian-regularized  artificial neural networks",
    "abstract": "The prediction of tool wear helps minimize costs and enhance product quality in manufacturing. While existing data-driven models using machine learning and deep learning have contributed to the accurate prediction of tool wear, they often lack generality and require substantial training data for high accuracy. In this paper, we propose a new data-driven model that uses Bayesian Regularized Artificial Neural Networks (BRANNs) to precisely predict milling tool wear. BRANNs combine the strengths and leverage the benefits of artificial neural networks (ANNs) and Bayesian regularization, whereby ANNs learn complex patterns and Bayesian regularization handles uncertainty and prevents overfitting, resulting in a more generalized model. We treat both process parameters and monitoring sensor signals as BRANN input parameters. We conducted an extensive experimental study featuring four different experimental data sets, including the NASA Ames milling dataset, the 2010 PHM Data Challenge dataset, the NUAA Ideahouse tool wear dataset, and an in-house performed end-milling of the Ti6Al4V dataset. We inspect the impact of input features, training data size, hidden units, training algorithms, and transfer functions on the performance of the proposed BRANN model and demonstrate that it outperforms existing state-of-the-art models in terms of accuracy and reliability. ",
    "url": "https://arxiv.org/abs/2311.18620",
    "authors": [
      "Tam T. Truong",
      "Jay Airao",
      "Panagiotis Karras",
      "Faramarz Hojati",
      "Bahman Azarhoushang",
      "Ramin Aghababaei"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.18630",
    "title": "SATHUR: Self Augmenting Task Hallucinal Unified Representation for  Generalized Class Incremental Learning",
    "abstract": "Class Incremental Learning (CIL) is inspired by the human ability to learn new classes without forgetting previous ones. CIL becomes more challenging in real-world scenarios when the samples in each incremental step are imbalanced. This creates another branch of problem, called Generalized Class Incremental Learning (GCIL) where each incremental step is structured more realistically. Grow When Required (GWR) network, a type of Self-Organizing Map (SOM), dynamically create and remove nodes and edges for adaptive learning. GWR performs incremental learning from feature vectors extracted by a Convolutional Neural Network (CNN), which acts as a feature extractor. The inherent ability of GWR to form distinct clusters, each corresponding to a class in the feature vector space, regardless of the order of samples or class imbalances, is well suited to achieving GCIL. To enhance GWR's classification performance, a high-quality feature extractor is required. However, when the convolutional layers are adapted at each incremental step, the GWR nodes corresponding to prior knowledge are subject to near-invalidation. This work introduces the Self Augmenting Task Hallucinal Unified Representation (SATHUR), which re-initializes the GWR network at each incremental step, aligning it with the current feature extractor. Comprehensive experimental results demonstrate that our proposed method significantly outperforms other state-of-the-art GCIL methods on CIFAR-100 and CORe50 datasets. ",
    "url": "https://arxiv.org/abs/2311.18630",
    "authors": [
      "Sathursan Kanagarajah",
      "Thanuja Ambegoda",
      "Ranga Rodrigo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18641",
    "title": "CrimeGAT: Leveraging Graph Attention Networks for Enhanced Predictive  Policing in Criminal Networks",
    "abstract": "In this paper, we present CrimeGAT, a novel application of Graph Attention Networks (GATs) for predictive policing in criminal networks. Criminal networks pose unique challenges for predictive analytics due to their complex structure, multi-relational links, and dynamic behavior. Traditional methods often fail to capture these complexities, leading to suboptimal predictions. To address these challenges, we propose the use of GATs, which can effectively leverage both node features and graph structure to make predictions. Our proposed CrimeGAT model integrates attention mechanisms to weigh the importance of a node's neighbors, thereby capturing the local and global structures of criminal networks. We formulate the problem as learning a function that maps node features and graph structure to a prediction of future criminal activity. The experimental results on real-world datasets demonstrate that CrimeGAT out-performs conventional methods in predicting criminal activities, thereby providing a powerful tool for law enforcement agencies to proactively deploy resources. Furthermore, the interpretable nature of the attentionmechanism inGATs offers insights into the key players and relationships in criminal networks. This research opens new avenues for applying deep learning techniques in the Aeld of predictive policing and criminal network analysis. ",
    "url": "https://arxiv.org/abs/2311.18641",
    "authors": [
      "Chen Yang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2311.18671",
    "title": "Solution to an open problem on the closeness of graphs",
    "abstract": "A network can be analyzed by means of many graph theoretical parameters. In the context of networks analysis, closeness is a structural metric that evaluates a node's significance inside a network. A cactus is a connected graph in which any block is either a cut edge or a cycle. This paper analyzes the closeness of cacti, we determine the unique graph that minimizes the closeness over all cacti with fixed numbers of vertices and cycles, which solves an open problem proposed by Poklukar \\& \\v{Z}erovnik [Fundam. Inform. 167 (2019) 219--234]. ",
    "url": "https://arxiv.org/abs/2311.18671",
    "authors": [
      "Fazal Hayat",
      "Shou-Jun Xu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2311.18675",
    "title": "Cascaded Interaction with Eroded Deep Supervision for Salient Object  Detection",
    "abstract": "Deep convolutional neural networks have been widely applied in salient object detection and have achieved remarkable results in this field. However, existing models suffer from information distortion caused by interpolation during up-sampling and down-sampling. In response to this drawback, this article starts from two directions in the network: feature and label. On the one hand, a novel cascaded interaction network with a guidance module named global-local aligned attention (GAA) is designed to reduce the negative impact of interpolation on the feature side. On the other hand, a deep supervision strategy based on edge erosion is proposed to reduce the negative guidance of label interpolation on lateral output. Extensive experiments on five popular datasets demonstrate the superiority of our method. ",
    "url": "https://arxiv.org/abs/2311.18675",
    "authors": [
      "Hewen Xiao",
      "Jie Mei",
      "Guangfu Ma",
      "Weiren Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18676",
    "title": "DQSSA: A Quantum-Inspired Solution for Maximizing Influence in Online  Social Networks (Student Abstract)",
    "abstract": "Influence Maximization is the task of selecting optimal nodes maximising the influence spread in social networks. This study proposes a Discretized Quantum-based Salp Swarm Algorithm (DQSSA) for optimizing influence diffusion in social networks. By discretizing meta-heuristic algorithms and infusing them with quantum-inspired enhancements, we address issues like premature convergence and low efficacy. The proposed method, guided by quantum principles, offers a promising solution for Influence Maximisation. Experiments on four real-world datasets reveal DQSSA's superior performance as compared to established cutting-edge algorithms. ",
    "url": "https://arxiv.org/abs/2311.18676",
    "authors": [
      "Aryaman Rao",
      "Parth Singh",
      "Dinesh Kumar Vishwakarma",
      "Mukesh Prasad"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.18685",
    "title": "Efficient, Responsive, and Robust Hopping on Deformable Terrain",
    "abstract": "Legged robot locomotion is hindered by a mismatch between applications where legs can outperform wheels or treads, most of which feature deformable substrates, and existing tools for planning and control, most of which assume flat, rigid substrates. In this study we focus on the ramifications of plastic terrain deformation on the hop-to-hop energy dynamics of a spring-legged monopedal hopping robot animated by a switched-compliance energy injection controller. From this deliberately simple robot-terrain model, we derive a hop-to-hop energy return map, and we use physical experiments and simulations to validate the hop-to-hop energy map for a real robot hopping on a real deformable substrate. The dynamical properties (fixed points, eigenvalues, basins of attraction) of this map provide insights into efficient, responsive, and robust locomotion on deformable terrain. Specifically, we identify constant-fixed-point surfaces in a controller parameter space that suggest it is possible to tune control parameters for efficiency or responsiveness while targeting a desired gait energy level. We also identify conditions under which fixed points of the energy map are globally stable, and we further characterize the basins of attraction of fixed points when these conditions are not satisfied. We conclude by discussing the implications of this hop-to-hop energy map for planning, control, and estimation for efficient, agile, and robust legged locomotion on deformable terrain. ",
    "url": "https://arxiv.org/abs/2311.18685",
    "authors": [
      "Daniel J. Lynch",
      "Jason L. Pusey",
      "Sean W. Gart",
      "Paul B. Umbanhowar",
      "Kevin M. Lynch"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.18705",
    "title": "Quantifying metadata-structure relationships in networks using  description length",
    "abstract": "Network analysis is often enriched by including an examination of node metadata. In the context of understanding the mesoscale of networks it is often assumed that node groups based on metadata and node groups based on connectivity patterns are intrinsically linked. Recently, this assumption has been challenged and it has been demonstrated that metadata might be entirely unrelated to structure or, similarly, multiple sets of metadata might be relevant to the structure of a network in different ways. We propose the metablox tool to quantify the relationship between a networks node metadata and its mesoscale structure, measuring the strength of the relationship and the type of structural arrangement exhibited by the metadata. Our tool incorporates a way to distinguish significantly relevant relationships and can be used as part of systematic meta analyses comparing large numbers of networks, which we demonstrate on a number of synthetic and empirical networks. ",
    "url": "https://arxiv.org/abs/2311.18705",
    "authors": [
      "Lena Mangold",
      "Camille Roth"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2311.18735",
    "title": "Dimension Mixer: A Generalized Method for Structured Sparsity in Deep  Neural Networks",
    "abstract": "The recent success of multiple neural architectures like CNNs, Transformers, and MLP-Mixers motivated us to look for similarities and differences between them. We found that these architectures can be interpreted through the lens of a general concept of dimension mixing. Research on coupling flows and the butterfly transform shows that partial and hierarchical signal mixing schemes are sufficient for efficient and expressive function approximation. In this work, we study group-wise sparse, non-linear, multi-layered and learnable mixing schemes of inputs and find that they are complementary to many standard neural architectures. Following our observations and drawing inspiration from the Fast Fourier Transform, we generalize Butterfly Structure to use non-linear mixer function allowing for MLP as mixing function called Butterfly MLP. We were also able to mix along sequence dimension for Transformer-based architectures called Butterfly Attention. Experiments on CIFAR and LRA datasets demonstrate that the proposed Non-Linear Butterfly Mixers are efficient and scale well when the host architectures are used as mixing function. Additionally, we propose Patch-Only MLP-Mixer for processing spatial 2D signals demonstrating a different dimension mixing strategy. ",
    "url": "https://arxiv.org/abs/2311.18735",
    "authors": [
      "Suman Sapkota",
      "Binod Bhattarai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18740",
    "title": "First-Order Model Checking on Monadically Stable Graph Classes",
    "abstract": "A graph class $\\mathscr{C}$ is called monadically stable if one cannot interpret, in first-order logic, arbitrary large linear orders in colored graphs from $\\mathscr{C}$. We prove that the model checking problem for first-order logic is fixed-parameter tractable on every monadically stable graph class. This extends the results of [Grohe, Kreutzer, and Siebertz; J. ACM '17] for nowhere dense classes and of [Dreier, M\\\"ahlmann, and Siebertz; STOC '23] for structurally nowhere dense classes to all monadically stable classes. As a complementary hardness result, we prove that for every hereditary graph class $\\mathscr{C}$ that is edge-stable (excludes some half-graph as a semi-induced subgraph) but not monadically stable, first-order model checking is $\\mathrm{AW}[*]$-hard on $\\mathscr{C}$, and $\\mathrm{W}[1]$-hard when restricted to existential sentences. This confirms, in the special case of edge-stable classes, an on-going conjecture that the notion of monadic NIP delimits the tractability of first-order model checking on hereditary classes of graphs. For our tractability result, we first prove that monadically stable graph classes have almost linear neighborhood complexity. Using this, we construct sparse neighborhood covers for monadically stable classes, which provides the missing ingredient for the algorithm of [Dreier, M\\\"ahlmann, and Siebertz; STOC '23]. The key component of this construction is the usage of orders with low crossing number [Welzl; SoCG '88], a tool from the area of range queries. For our hardness result, we prove a new characterization of monadically stable graph classes in terms of forbidden induced subgraphs. We then use this characterization to show that in hereditary classes that are edge-stable but not monadically stable, one can effectively interpret the class of all graphs using only existential formulas. ",
    "url": "https://arxiv.org/abs/2311.18740",
    "authors": [
      "Jan Dreier",
      "Ioannis Eleftheriadis",
      "Nikolas Mählmann",
      "Rose McCarty",
      "Michał Pilipczuk",
      "Szymon Toruńczyk"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)",
      "Logic (math.LO)"
    ]
  },
  {
    "id": "arXiv:2311.18749",
    "title": "TransCORALNet: A Two-Stream Transformer CORAL Networks for Supply Chain  Credit Assessment Cold Start",
    "abstract": "This paper proposes an interpretable two-stream transformer CORAL networks (TransCORALNet) for supply chain credit assessment under the segment industry and cold start problem. The model aims to provide accurate credit assessment prediction for new supply chain borrowers with limited historical data. Here, the two-stream domain adaptation architecture with correlation alignment (CORAL) loss is used as a core model and is equipped with transformer, which provides insights about the learned features and allow efficient parallelization during training. Thanks to the domain adaptation capability of the proposed model, the domain shift between the source and target domain is minimized. Therefore, the model exhibits good generalization where the source and target do not follow the same distribution, and a limited amount of target labeled instances exist. Furthermore, we employ Local Interpretable Model-agnostic Explanations (LIME) to provide more insight into the model prediction and identify the key features contributing to supply chain credit assessment decisions. The proposed model addresses four significant supply chain credit assessment challenges: domain shift, cold start, imbalanced-class and interpretability. Experimental results on a real-world data set demonstrate the superiority of TransCORALNet over a number of state-of-the-art baselines in terms of accuracy. The code is available on GitHub https://github.com/JieJieNiu/TransCORALN . ",
    "url": "https://arxiv.org/abs/2311.18749",
    "authors": [
      "Jie Shi",
      "Arno P. J. M. Siebes",
      "Siamak Mehrkanoon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Risk Management (q-fin.RM)"
    ]
  },
  {
    "id": "arXiv:2311.18761",
    "title": "Can training neural language models on a curriculum with developmentally  plausible data improve alignment with human reading behavior?",
    "abstract": "The use of neural language models to model human behavior has met with mixed success. While some work has found that the surprisal estimates from these models can be used to predict a wide range of human neural and behavioral responses, other work studying more complex syntactic phenomena has found that these surprisal estimates generate incorrect behavioral predictions. This paper explores the extent to which the misalignment between empirical and model-predicted behavior can be minimized by training models on more developmentally plausible data, such as in the BabyLM Challenge. We trained teacher language models on the BabyLM \"strict-small\" dataset and used sentence level surprisal estimates from these teacher models to create a curriculum. We found tentative evidence that our curriculum made it easier for models to acquire linguistic knowledge from the training data: on the subset of tasks in the BabyLM challenge suite evaluating models' grammatical knowledge of English, models first trained on the BabyLM data curriculum and then on a few randomly ordered training epochs performed slightly better than models trained on randomly ordered epochs alone. This improved linguistic knowledge acquisition did not result in better alignment with human reading behavior, however: models trained on the BabyLM dataset (with or without a curriculum) generated predictions that were as misaligned with human behavior as models trained on larger less curated datasets. This suggests that training on developmentally plausible datasets alone is likely insufficient to generate language models capable of accurately predicting human language processing. ",
    "url": "https://arxiv.org/abs/2311.18761",
    "authors": [
      "Aryaman Chobey",
      "Oliver Smith",
      "Anzi Wang",
      "Grusha Prasad"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.18765",
    "title": "MLLMs-Augmented Visual-Language Representation Learning",
    "abstract": "Visual-language pre-training (VLP) have achieved remarkable success in multi-modal tasks, largely attributed to the availability of large-scale image-text datasets. In this work, we demonstrate that multi-modal large language models (MLLMs) can enhance visual-language representation learning by improving data quality. Our approach is simple, utilizing MLLMs to extend multiple captions for each image. To prevent the bias that introduced by MLLMs' hallucinations and intrinsic caption styles, we propose a \"text shearing\" to keep the lengths of extended captions identical to the originals. In image-text retrieval, our method consistently obtains 5.6 ~ 35.0% and 16.8 ~ 46.1% improvement on R@1 under the fine-tuning and zero-shot settings, respectively. Notably, our zero-shot results are comparable to fine-tuning on target datasets, which encourages more exploration on the versatile use of MLLMs. ",
    "url": "https://arxiv.org/abs/2311.18765",
    "authors": [
      "Yanqing Liu",
      "Kai Wang",
      "Wenqi Shao",
      "Ping Luo",
      "Yu Qiao",
      "Mike Zheng Shou",
      "Kaipeng Zhang",
      "Yang You"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18769",
    "title": "Online Change Points Detection for Linear Dynamical Systems with Finite  Sample Guarantees",
    "abstract": "The problem of online change point detection is to detect abrupt changes in properties of time series, ideally as soon as possible after those changes occur. Existing work on online change point detection either assumes i.i.d data, focuses on asymptotic analysis, does not present theoretical guarantees on the trade-off between detection accuracy and detection delay, or is only suitable for detecting single change points. In this work, we study the online change point detection problem for linear dynamical systems with unknown dynamics, where the data exhibits temporal correlations and the system could have multiple change points. We develop a data-dependent threshold that can be used in our test that allows one to achieve a pre-specified upper bound on the probability of making a false alarm. We further provide a finite-sample-based bound for the probability of detecting a change point. Our bound demonstrates how parameters used in our algorithm affect the detection probability and delay, and provides guidance on the minimum required time between changes to guarantee detection. ",
    "url": "https://arxiv.org/abs/2311.18769",
    "authors": [
      "Lei Xin",
      "George Chiu",
      "Shreyas Sundaram"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.18778",
    "title": "Mavericks at BLP-2023 Task 1: Ensemble-based Approach Using Language  Models for Violence Inciting Text Detection",
    "abstract": "This paper presents our work for the Violence Inciting Text Detection shared task in the First Workshop on Bangla Language Processing. Social media has accelerated the propagation of hate and violence-inciting speech in society. It is essential to develop efficient mechanisms to detect and curb the propagation of such texts. The problem of detecting violence-inciting texts is further exacerbated in low-resource settings due to sparse research and less data. The data provided in the shared task consists of texts in the Bangla language, where each example is classified into one of the three categories defined based on the types of violence-inciting texts. We try and evaluate several BERT-based models, and then use an ensemble of the models as our final submission. Our submission is ranked 10th in the final leaderboard of the shared task with a macro F1 score of 0.737. ",
    "url": "https://arxiv.org/abs/2311.18778",
    "authors": [
      "Saurabh Page",
      "Sudeep Mangalvedhekar",
      "Kshitij Deshpande",
      "Tanmay Chavan",
      "Sheetal Sonawane"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.18783",
    "title": "A robust and adaptive GenEO-type domain decomposition preconditioner for  $\\mathbf{H}(\\mathbf{curl})$ problems in general non-convex three-dimensional  geometries",
    "abstract": "In this paper we develop and analyse domain decomposition methods for linear systems of equations arising from conforming finite element discretisations of positive Maxwell-type equations, namely for $\\mathbf{H}(\\mathbf{curl})$ problems. It is well known that convergence of domain decomposition methods rely heavily on the efficiency of the coarse space used in the second level. We design adaptive coarse spaces that complement a near-kernel space made from the gradient of scalar functions. The new class of preconditioner is inspired by the idea of subspace decomposition, but based on spectral coarse spaces, and is specially designed for curl-conforming discretisations of Maxwell's equations in heterogeneous media on general domains which may have holes. Our approach has wider applicability and theoretical justification than the well-known Hiptmair-Xu auxiliary space preconditioner, with results extending to the variable coefficient case and non-convex domains at the expense of a larger coarse space. ",
    "url": "https://arxiv.org/abs/2311.18783",
    "authors": [
      "Niall Bootland",
      "Victorita Dolean",
      "Frédéric Nataf",
      "Pierre-Henri Tournier"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2311.18787",
    "title": "Communication-Efficient Federated Optimization over Semi-Decentralized  Networks",
    "abstract": "In large-scale federated and decentralized learning, communication efficiency is one of the most challenging bottlenecks. While gossip communication -- where agents can exchange information with their connected neighbors -- is more cost-effective than communicating with the remote server, it often requires a greater number of communication rounds, especially for large and sparse networks. To tackle the trade-off, we examine the communication efficiency under a semi-decentralized communication protocol, in which agents can perform both agent-to-agent and agent-to-server communication in a probabilistic manner. We design a tailored communication-efficient algorithm over semi-decentralized networks, referred to as PISCO, which inherits the robustness to data heterogeneity thanks to gradient tracking and allows multiple local updates for saving communication. We establish the convergence rate of PISCO for nonconvex problems and show that PISCO enjoys a linear speedup in terms of the number of agents and local updates. Our numerical results highlight the superior communication efficiency of PISCO and its resilience to data heterogeneity and various network topologies. ",
    "url": "https://arxiv.org/abs/2311.18787",
    "authors": [
      "He Wang",
      "Yuejie Chi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2311.18789",
    "title": "Unsupervised learning architecture based on neural Darwinism and  Hopfield networks recognizes symbols with high accuracy",
    "abstract": "This paper introduces a novel unsupervised learning paradigm inspired by Gerald Edelman's theory of neuronal group selection (\"Neural Darwinism\"). The presented automaton learns to recognize arbitrary symbols (e.g., letters of an alphabet) when they are presented repeatedly, as they are when children learn to read. On a second hierarchical level, the model creates abstract categories representing the learnt symbols. The fundamental computational unit are simple McCulloch-Pitts neurons arranged into fully-connected groups (Hopfield networks with randomly initialized weights), which are \"selected\", in an evolutionary sense, through symbol presentation. The learning process is fully tractable and easily interpretable for humans, in contrast to most neural network architectures. Computational properties of Hopfield networks enabling pattern recognition are discussed. In simulations, the model achieves high accuracy in learning the letters of the Latin alphabet, presented as binary patterns on a grid. This paper is a proof of concept with no claims to state-of-the-art performance in letter recognition, but hopefully inspires new thinking in bio-inspired machine learning. ",
    "url": "https://arxiv.org/abs/2311.18789",
    "authors": [
      "Mario Stepanik"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2311.18820",
    "title": "Adversarial Attacks and Defenses for Wireless Signal Classifiers using  CDI-aware GANs",
    "abstract": "We introduce a Channel Distribution Information (CDI)-aware Generative Adversarial Network (GAN), designed to address the unique challenges of adversarial attacks in wireless communication systems. The generator in this CDI-aware GAN maps random input noise to the feature space, generating perturbations intended to deceive a target modulation classifier. Its discriminators play a dual role: one enforces that the perturbations follow a Gaussian distribution, making them indistinguishable from Gaussian noise, while the other ensures these perturbations account for realistic channel effects and resemble no-channel perturbations. Our proposed CDI-aware GAN can be used as an attacker and a defender. In attack scenarios, the CDI-aware GAN demonstrates its prowess by generating robust adversarial perturbations that effectively deceive the target classifier, outperforming known methods. Furthermore, CDI-aware GAN as a defender significantly improves the target classifier's resilience against adversarial attacks. ",
    "url": "https://arxiv.org/abs/2311.18820",
    "authors": [
      "Sujata Sinha",
      "Alkan Soysal"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2311.18824",
    "title": "An Adaptive Framework for Generalizing Network Traffic Prediction  towards Uncertain Environments",
    "abstract": "We have developed a new framework using time-series analysis for dynamically assigning mobile network traffic prediction models in previously unseen wireless environments. Our framework selectively employs learned behaviors, outperforming any single model with over a 50% improvement relative to current studies. More importantly, it surpasses traditional approaches without needing prior knowledge of a cell. While this paper focuses on network traffic prediction using our adaptive forecasting framework, this framework can also be applied to other machine learning applications in uncertain environments. The framework begins with unsupervised clustering of time-series data to identify unique trends and seasonal patterns. Subsequently, we apply supervised learning for traffic volume prediction within each cluster. This specialization towards specific traffic behaviors occurs without penalties from spatial and temporal variations. Finally, the framework adaptively assigns trained models to new, previously unseen cells. By analyzing real-time measurements of a cell, our framework intelligently selects the most suitable cluster for that cell at any given time, with cluster assignment dynamically adjusting to spatio-temporal fluctuations. ",
    "url": "https://arxiv.org/abs/2311.18824",
    "authors": [
      "Alexander Downey",
      "Evren Tuna",
      "Alkan Soysal"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2311.18826",
    "title": "Geometry-Aware Normalizing Wasserstein Flows for Optimal Causal  Inference",
    "abstract": "This manuscript enriches the framework of continuous normalizing flows (CNFs) within causal inference, primarily to augment the geometric properties of parametric submodels used in targeted maximum likelihood estimation (TMLE). By introducing an innovative application of CNFs, we construct a refined series of parametric submodels that enable a directed interpolation between the prior distribution $p_0$ and the empirical distribution $p_1$. This proposed methodology serves to optimize the semiparametric efficiency bound in causal inference by orchestrating CNFs to align with Wasserstein gradient flows. Our approach not only endeavors to minimize the mean squared error in the estimation but also imbues the estimators with geometric sophistication, thereby enhancing robustness against misspecification. This robustness is crucial, as it alleviates the dependence on the standard $n^{\\frac{1}{4}}$ rate for a doubly-robust perturbation direction in TMLE. By incorporating robust optimization principles and differential geometry into the estimators, the developed geometry-aware CNFs represent a significant advancement in the pursuit of doubly robust causal inference. ",
    "url": "https://arxiv.org/abs/2311.18826",
    "authors": [
      "Kaiwen Hou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.18832",
    "title": "Exploiting Diffusion Prior for Generalizable Pixel-Level Semantic  Prediction",
    "abstract": "Contents generated by recent advanced Text-to-Image (T2I) diffusion models are sometimes too imaginative for existing off-the-shelf property semantic predictors to estimate due to the immitigable domain gap. We introduce DMP, a pipeline utilizing pre-trained T2I models as a prior for pixel-level semantic prediction tasks. To address the misalignment between deterministic prediction tasks and stochastic T2I models, we reformulate the diffusion process through a sequence of interpolations, establishing a deterministic mapping between input RGB images and output prediction distributions. To preserve generalizability, we use low-rank adaptation to fine-tune pre-trained models. Extensive experiments across five tasks, including 3D property estimation, semantic segmentation, and intrinsic image decomposition, showcase the efficacy of the proposed method. Despite limited-domain training data, the approach yields faithful estimations for arbitrary images, surpassing existing state-of-the-art algorithms. ",
    "url": "https://arxiv.org/abs/2311.18832",
    "authors": [
      "Hsin-Ying Lee",
      "Hung-Yu Tseng",
      "Hsin-Ying Lee",
      "Ming-Hsuan Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18839",
    "title": "TrafficMOT: A Challenging Dataset for Multi-Object Tracking in Complex  Traffic Scenarios",
    "abstract": "Multi-object tracking in traffic videos is a crucial research area, offering immense potential for enhancing traffic monitoring accuracy and promoting road safety measures through the utilisation of advanced machine learning algorithms. However, existing datasets for multi-object tracking in traffic videos often feature limited instances or focus on single classes, which cannot well simulate the challenges encountered in complex traffic scenarios. To address this gap, we introduce TrafficMOT, an extensive dataset designed to encompass diverse traffic situations with complex scenarios. To validate the complexity and challenges presented by TrafficMOT, we conducted comprehensive empirical studies using three different settings: fully-supervised, semi-supervised, and a recent powerful zero-shot foundation model Tracking Anything Model (TAM). The experimental results highlight the inherent complexity of this dataset, emphasising its value in driving advancements in the field of traffic monitoring and multi-object tracking. ",
    "url": "https://arxiv.org/abs/2311.18839",
    "authors": [
      "Lihao Liu",
      "Yanqi Cheng",
      "Zhongying Deng",
      "Shujun Wang",
      "Dongdong Chen",
      "Xiaowei Hu",
      "Pietro Liò",
      "Carola-Bibiane Schönlieb",
      "Angelica Aviles-Rivero"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.17923",
    "title": "Enhanced Generative Adversarial Networks for Unseen Word Generation from  EEG Signals",
    "abstract": "Recent advances in brain-computer interface (BCI) technology, particularly based on generative adversarial networks (GAN), have shown great promise for improving decoding performance for BCI. Within the realm of Brain-Computer Interfaces (BCI), GANs find application in addressing many areas. They serve as a valuable tool for data augmentation, which can solve the challenge of limited data availability, and synthesis, effectively expanding the dataset and creating novel data formats, thus enhancing the robustness and adaptability of BCI systems. Research in speech-related paradigms has significantly expanded, with a critical impact on the advancement of assistive technologies and communication support for individuals with speech impairments. In this study, GANs were investigated, particularly for the BCI field, and applied to generate text from EEG signals. The GANs could generalize all subjects and decode unseen words, indicating its ability to capture underlying speech patterns consistent across different individuals. The method has practical applications in neural signal-based speech recognition systems and communication aids for individuals with speech difficulties. ",
    "url": "https://arxiv.org/abs/2311.17923",
    "authors": [
      "Young-Eun Lee",
      "Seo-Hyun Lee",
      "Soowon Kim",
      "Jung-Sun Lee",
      "Deok-Seon Kim",
      "Seong-Whan Lee"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2311.17969",
    "title": "Generation of a Compendium of Transcription Factor Cascades and  Identification of Potential Therapeutic Targets using Graph Machine Learning",
    "abstract": "Transcription factors (TFs) play a vital role in the regulation of gene expression thereby making them critical to many cellular processes. In this study, we used graph machine learning methods to create a compendium of TF cascades using data extracted from the STRING database. A TF cascade is a sequence of TFs that regulate each other, forming a directed path in the TF network. We constructed a knowledge graph of 81,488 unique TF cascades, with the longest cascade consisting of 62 TFs. Our results highlight the complex and intricate nature of TF interactions, where multiple TFs work together to regulate gene expression. We also identified 10 TFs with the highest regulatory influence based on centrality measurements, providing valuable information for researchers interested in studying specific TFs. Furthermore, our pathway enrichment analysis revealed significant enrichment of various pathways and functional categories, including those involved in cancer and other diseases, as well as those involved in development, differentiation, and cell signaling. The enriched pathways identified in this study may have potential as targets for therapeutic intervention in diseases associated with dysregulation of transcription factors. We have released the dataset, knowledge graph, and graphML methods for the TF cascades, and created a website to display the results, which can be accessed by researchers interested in using this dataset. Our study provides a valuable resource for understanding the complex network of interactions between TFs and their regulatory roles in cellular processes. ",
    "url": "https://arxiv.org/abs/2311.17969",
    "authors": [
      "Sonish Sivarajkumar",
      "Pratyush Tandale",
      "Ankit Bhardwaj",
      "Kipp W. Johnson",
      "Anoop Titus",
      "Benjamin S. Glicksberg",
      "Shameer Khader",
      "Kamlesh K. Yadav",
      "Lakshminarayanan Subramanian"
    ],
    "subjectives": [
      "Molecular Networks (q-bio.MN)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18007",
    "title": "Towards out-of-distribution generalization in large-scale astronomical  surveys: robust networks learn similar representations",
    "abstract": "The generalization of machine learning (ML) models to out-of-distribution (OOD) examples remains a key challenge in extracting information from upcoming astronomical surveys. Interpretability approaches are a natural way to gain insights into the OOD generalization problem. We use Centered Kernel Alignment (CKA), a similarity measure metric of neural network representations, to examine the relationship between representation similarity and performance of pre-trained Convolutional Neural Networks (CNNs) on the CAMELS Multifield Dataset. We find that when models are robust to a distribution shift, they produce substantially different representations across their layers on OOD data. However, when they fail to generalize, these representations change less from layer to layer on OOD data. We discuss the potential application of similarity representation in guiding model design, training strategy, and mitigating the OOD problem by incorporating CKA as an inductive bias during training. ",
    "url": "https://arxiv.org/abs/2311.18007",
    "authors": [
      "Yash Gondhalekar",
      "Sultan Hassan",
      "Naomi Saphra",
      "Sambatra Andrianomena"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Astrophysics of Galaxies (astro-ph.GA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18027",
    "title": "Enhancing Data-Assimilation in CFD using Graph Neural Networks",
    "abstract": "We present a novel machine learning approach for data assimilation applied in fluid mechanics, based on adjoint-optimization augmented by Graph Neural Networks (GNNs) models. We consider as baseline the Reynolds-Averaged Navier-Stokes (RANS) equations, where the unknown is the meanflow and a closure model based on the Reynolds-stress tensor is required for correctly computing the solution. An end-to-end process is cast; first, we train a GNN model for the closure term. Second, the GNN model is introduced in the training process of data assimilation, where the RANS equations act as a physics constraint for a consistent prediction. We obtain our results using direct numerical simulations based on a Finite Element Method (FEM) solver; a two-fold interface between the GNN model and the solver allows the GNN's predictions to be incorporated into post-processing steps of the FEM analysis. The proposed scheme provides an excellent reconstruction of the meanflow without any features selection; preliminary results show promising generalization properties over unseen flow configurations. ",
    "url": "https://arxiv.org/abs/2311.18027",
    "authors": [
      "Michele Quattromini",
      "Michele Alessandro Bucci",
      "Stefania Cherubini",
      "Onofrio Semeraro"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18144",
    "title": "Dynamical phase transition in quantum neural networks with large depth",
    "abstract": "Understanding the training dynamics of quantum neural networks is a fundamental task in quantum information science with wide impact in physics, chemistry and machine learning. In this work, we show that the late-time training dynamics of quantum neural networks can be described by the generalized Lotka-Volterra equations, which lead to a dynamical phase transition. When the targeted value of cost function crosses the minimum achievable value from above to below, the dynamics evolve from a frozen-kernel phase to a frozen-error phase, showing a duality between the quantum neural tangent kernel and the total error. In both phases, the convergence towards the fixed point is exponential, while at the critical point becomes polynomial. Via mapping the Hessian of the training dynamics to a Hamiltonian in the imaginary time, we reveal the nature of the phase transition to be second-order with the exponent $\\nu=1$, where scale invariance and closing gap are observed at critical point. We also provide a non-perturbative analytical theory to explain the phase transition via a restricted Haar ensemble at late time, when the output state approaches the steady state. The theory findings are verified experimentally on IBM quantum devices. ",
    "url": "https://arxiv.org/abs/2311.18144",
    "authors": [
      "Bingzhi Zhang",
      "Junyu Liu",
      "Xiao-Chuan Wu",
      "Liang Jiang",
      "Quntao Zhuang"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18214",
    "title": "Perception of Misalignment States for Sky Survey Telescopes with the  Digital Twin and the Deep Neural Networks",
    "abstract": "Sky survey telescopes play a critical role in modern astronomy, but misalignment of their optical elements can introduce significant variations in point spread functions, leading to reduced data quality. To address this, we need a method to obtain misalignment states, aiding in the reconstruction of accurate point spread functions for data processing methods or facilitating adjustments of optical components for improved image quality. Since sky survey telescopes consist of many optical elements, they result in a vast array of potential misalignment states, some of which are intricately coupled, posing detection challenges. However, by continuously adjusting the misalignment states of optical elements, we can disentangle coupled states. Based on this principle, we propose a deep neural network to extract misalignment states from continuously varying point spread functions in different field of views. To ensure sufficient and diverse training data, we recommend employing a digital twin to obtain data for neural network training. Additionally, we introduce the state graph to store misalignment data and explore complex relationships between misalignment states and corresponding point spread functions, guiding the generation of training data from experiments. Once trained, the neural network estimates misalignment states from observation data, regardless of the impacts caused by atmospheric turbulence, noise, and limited spatial sampling rates in the detector. The method proposed in this paper could be used to provide prior information for the active optics system and the optical system alignment. ",
    "url": "https://arxiv.org/abs/2311.18214",
    "authors": [
      "Miao Zhang",
      "Peng Jia",
      "Zhengyang Li",
      "Wennan Xiang",
      "Jiameng Lv",
      "Rui Sun"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Astrophysics of Galaxies (astro-ph.GA)",
      "Solar and Stellar Astrophysics (astro-ph.SR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2311.18245",
    "title": "Automatic Detection of Alzheimer's Disease with Multi-Modal Fusion of  Clinical MRI Scans",
    "abstract": "The aging population of the U.S. drives the prevalence of Alzheimer's disease. Brookmeyer et al. forecasts approximately 15 million Americans will have either clinical AD or mild cognitive impairment by 2060. In response to this urgent call, methods for early detection of Alzheimer's disease have been developed for prevention and pre-treatment. Notably, literature on the application of deep learning in the automatic detection of the disease has been proliferating. This study builds upon previous literature and maintains a focus on leveraging multi-modal information to enhance automatic detection. We aim to predict the stage of the disease - Cognitively Normal (CN), Mildly Cognitive Impairment (MCI), and Alzheimer's Disease (AD), based on two different types of brain MRI scans. We design an AlexNet-based deep learning model that learns the synergy of complementary information from both T1 and FLAIR MRI scans. ",
    "url": "https://arxiv.org/abs/2311.18245",
    "authors": [
      "Long Chen",
      "Liben Chen",
      "Binfeng Xu",
      "Wenxin Zhang",
      "Narges Razavian"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18281",
    "title": "Utilizing Radiomic Feature Analysis For Automated MRI Keypoint  Detection: Enhancing Graph Applications",
    "abstract": "Graph neural networks (GNNs) present a promising alternative to CNNs and transformers in certain image processing applications due to their parameter-efficiency in modeling spatial relationships. Currently, a major area of research involves the converting non-graph input data for GNN-based models, notably in scenarios where the data originates from images. One approach involves converting images into nodes by identifying significant keypoints within them. Super-Retina, a semi-supervised technique, has been utilized for detecting keypoints in retinal images. However, its limitations lie in the dependency on a small initial set of ground truth keypoints, which is progressively expanded to detect more keypoints. Having encountered difficulties in detecting consistent initial keypoints in brain images using SIFT and LoFTR, we proposed a new approach: radiomic feature-based keypoint detection. Demonstrating the anatomical significance of the detected keypoints was achieved by showcasing their efficacy in improving registration processes guided by these keypoints. Subsequently, these keypoints were employed as the ground truth for the keypoint detection method (LK-SuperRetina). Furthermore, the study showcases the application of GNNs in image matching, highlighting their superior performance in terms of both the number of good matches and confidence scores. This research sets the stage for expanding GNN applications into various other applications, including but not limited to image classification, segmentation, and registration. ",
    "url": "https://arxiv.org/abs/2311.18281",
    "authors": [
      "Sahar Almahfouz Nasser",
      "Shashwat Pathak",
      "Keshav Singhal",
      "Mohit Meena",
      "Nihar Gupte",
      "Ananya Chinmaya",
      "Prateek Garg",
      "Amit Sethi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18306",
    "title": "PAUNet: Precipitation Attention-based U-Net for rain prediction from  satellite radiance data",
    "abstract": "This paper introduces Precipitation Attention-based U-Net (PAUNet), a deep learning architecture for predicting precipitation from satellite radiance data, addressing the challenges of the Weather4cast 2023 competition. PAUNet is a variant of U-Net and Res-Net, designed to effectively capture the large-scale contextual information of multi-band satellite images in visible, water vapor, and infrared bands through encoder convolutional layers with center cropping and attention mechanisms. We built upon the Focal Precipitation Loss including an exponential component (e-FPL), which further enhanced the importance across different precipitation categories, particularly medium and heavy rain. Trained on a substantial dataset from various European regions, PAUNet demonstrates notable accuracy with a higher Critical Success Index (CSI) score than the baseline model in predicting rainfall over multiple time slots. PAUNet's architecture and training methodology showcase improvements in precipitation forecasting, crucial for sectors like emergency services and retail and supply chain management. ",
    "url": "https://arxiv.org/abs/2311.18306",
    "authors": [
      "P. Jyoteeshkumar Reddy",
      "Harish Baki",
      "Sandeep Chinta",
      "Richard Matear",
      "John Taylor"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18313",
    "title": "Automatic Implementation of Neural Networks through Reaction Networks --  Part I: Circuit Design and Convergence Analysis",
    "abstract": "Information processing relying on biochemical interactions in the cellular environment is essential for biological organisms. The implementation of molecular computational systems holds significant interest and potential in the fields of synthetic biology and molecular computation. This two-part article aims to introduce a programmable biochemical reaction network (BCRN) system endowed with mass action kinetics that realizes the fully connected neural network (FCNN) and has the potential to act automatically in vivo. In part I, the feedforward propagation computation, the backpropagation component, and all bridging processes of FCNN are ingeniously designed as specific BCRN modules based on their dynamics. This approach addresses a design gap in the biochemical assignment module and judgment termination module and provides a novel precise and robust realization of bi-molecular reactions for the learning process. Through equilibrium approaching, we demonstrate that the designed BCRN system achieves FCNN functionality with exponential convergence to target computational results, thereby enhancing the theoretical support for such work. Finally, the performance of this construction is further evaluated on two typical logic classification problems. ",
    "url": "https://arxiv.org/abs/2311.18313",
    "authors": [
      "Yuzhen Fan",
      "Xiaoyu Zhang",
      "Chuanhou Gao",
      "Denis Dochain"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2311.18508",
    "title": "DifAugGAN: A Practical Diffusion-style Data Augmentation for GAN-based  Single Image Super-resolution",
    "abstract": "It is well known the adversarial optimization of GAN-based image super-resolution (SR) methods makes the preceding SR model generate unpleasant and undesirable artifacts, leading to large distortion. We attribute the cause of such distortions to the poor calibration of the discriminator, which hampers its ability to provide meaningful feedback to the generator for learning high-quality images. To address this problem, we propose a simple but non-travel diffusion-style data augmentation scheme for current GAN-based SR methods, known as DifAugGAN. It involves adapting the diffusion process in generative diffusion models for improving the calibration of the discriminator during training motivated by the successes of data augmentation schemes in the field to achieve good calibration. Our DifAugGAN can be a Plug-and-Play strategy for current GAN-based SISR methods to improve the calibration of the discriminator and thus improve SR performance. Extensive experimental evaluations demonstrate the superiority of DifAugGAN over state-of-the-art GAN-based SISR methods across both synthetic and real-world datasets, showcasing notable advancements in both qualitative and quantitative results. ",
    "url": "https://arxiv.org/abs/2311.18508",
    "authors": [
      "Axi Niu",
      "Kang Zhang",
      "Joshua Tian Jin Tee",
      "Trung X. Pham",
      "Jinqiu Sun",
      "Chang D. Yoo",
      "In So Kweon",
      "Yanning Zhang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.18574",
    "title": "Multi-scale Iterative Refinement towards Robust and Versatile Molecular  Docking",
    "abstract": "Molecular docking is a key computational tool utilized to predict the binding conformations of small molecules to protein targets, which is fundamental in the design of novel drugs. Despite recent advancements in geometric deep learning-based approaches leading to improvements in blind docking efficiency, these methods have encountered notable challenges, such as limited generalization performance on unseen proteins, the inability to concurrently address the settings of blind docking and site-specific docking, and the frequent occurrence of physical implausibilities such as inter-molecular steric clash. In this study, we introduce DeltaDock, a robust and versatile framework designed for efficient molecular docking to overcome these challenges. DeltaDock operates in a two-step process: rapid initial complex structures sampling followed by multi-scale iterative refinement of the initial structures. In the initial stage, to sample accurate structures with high efficiency, we develop a ligand-dependent binding site prediction model founded on large protein models and graph neural networks. This model is then paired with GPU-accelerated sampling algorithms. The sampled structures are updated using a multi-scale iterative refinement module that captures both protein-ligand atom-atom interactions and residue-atom interactions in the following stage. Distinct from previous geometric deep learning methods that are conditioned on the blind docking setting, DeltaDock demonstrates superior performance in both blind docking and site-specific docking settings. Comprehensive experimental results reveal that DeltaDock consistently surpasses baseline methods in terms of docking accuracy. Furthermore, it displays remarkable generalization capabilities and proficiency for predicting physically valid structures, thereby attesting to its robustness and reliability in various scenarios. ",
    "url": "https://arxiv.org/abs/2311.18574",
    "authors": [
      "Jiaxian Yan",
      "Zaixi Zhang",
      "Kai Zhang",
      "Qi Liu"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18599",
    "title": "Joint Detection Algorithm for Multiple Cognitive Users in Spectrum  Sensing",
    "abstract": "Spectrum sensing technology is a crucial aspect of modern communication technology, serving as one of the essential techniques for efficiently utilizing scarce information resources in tight frequency bands. This paper first introduces three common logical circuit decision criteria in hard decisions and analyzes their decision rigor. Building upon hard decisions, the paper further introduces a method for multi-user spectrum sensing based on soft decisions. Then the paper simulates the false alarm probability and detection probability curves corresponding to the three criteria. The simulated results of multi-user collaborative sensing indicate that the simulation process significantly reduces false alarm probability and enhances detection probability. This approach effectively detects spectrum resources unoccupied during idle periods, leveraging the concept of time-division multiplexing and rationalizing the redistribution of information resources. The entire computation process relies on the calculation principles of power spectral density in communication theory, involving threshold decision detection for noise power and the sum of noise and signal power. It provides a secondary decision detection, reflecting the perceptual decision performance of logical detection methods with relative accuracy. ",
    "url": "https://arxiv.org/abs/2311.18599",
    "authors": [
      "Fanfei Meng",
      "Yuxin Wang",
      "Lele Zhang",
      "Yingxin Zhao",
      "David Demeter"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.18639",
    "title": "Targeted Reduction of Causal Models",
    "abstract": "Why does a phenomenon occur? Addressing this question is central to most scientific inquiries based on empirical observations, and often heavily relies on simulations of scientific models. As models become more intricate, deciphering the causes behind these phenomena in high-dimensional spaces of interconnected variables becomes increasingly challenging. Causal machine learning may assist scientists in the discovery of relevant and interpretable patterns of causation in simulations. We introduce Targeted Causal Reduction (TCR), a method for turning complex models into a concise set of causal factors that explain a specific target phenomenon. We derive an information theoretic objective to learn TCR from interventional data or simulations and propose algorithms to optimize this objective efficiently. TCR's ability to generate interpretable high-level explanations from complex models is demonstrated on toy and mechanical systems, illustrating its potential to assist scientists in the study of complex phenomena in a broad range of disciplines. ",
    "url": "https://arxiv.org/abs/2311.18639",
    "authors": [
      "Armin Kekić",
      "Bernhard Schölkopf",
      "Michel Besserve"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18672",
    "title": "A Comparison Between Invariant and Equivariant Classical and Quantum  Graph Neural Networks",
    "abstract": "Machine learning algorithms are heavily relied on to understand the vast amounts of data from high-energy particle collisions at the CERN Large Hadron Collider (LHC). The data from such collision events can naturally be represented with graph structures. Therefore, deep geometric methods, such as graph neural networks (GNNs), have been leveraged for various data analysis tasks in high-energy physics. One typical task is jet tagging, where jets are viewed as point clouds with distinct features and edge connections between their constituent particles. The increasing size and complexity of the LHC particle datasets, as well as the computational models used for their analysis, greatly motivate the development of alternative fast and efficient computational paradigms such as quantum computation. In addition, to enhance the validity and robustness of deep networks, one can leverage the fundamental symmetries present in the data through the use of invariant inputs and equivariant layers. In this paper, we perform a fair and comprehensive comparison between classical graph neural networks (GNNs) and equivariant graph neural networks (EGNNs) and their quantum counterparts: quantum graph neural networks (QGNNs) and equivariant quantum graph neural networks (EQGNN). The four architectures were benchmarked on a binary classification task to classify the parton-level particle initiating the jet. Based on their AUC scores, the quantum networks were shown to outperform the classical networks. However, seeing the computational advantage of the quantum networks in practice may have to wait for the further development of quantum technology and its associated APIs. ",
    "url": "https://arxiv.org/abs/2311.18672",
    "authors": [
      "Roy T. Forestano",
      "Marçal Comajoan Cara",
      "Gopal Ramesh Dahale",
      "Zhongtian Dong",
      "Sergei Gleyzer",
      "Daniel Justice",
      "Kyoungchul Kong",
      "Tom Magorsch",
      "Konstantin T. Matchev",
      "Katia Matcheva",
      "Eyup B. Unlu"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.18694",
    "title": "Balancing Summarization and Change Detection in Graph Streams",
    "abstract": "This study addresses the issue of balancing graph summarization and graph change detection. Graph summarization compresses large-scale graphs into a smaller scale. However, the question remains: To what extent should the original graph be compressed? This problem is solved from the perspective of graph change detection, aiming to detect statistically significant changes using a stream of summary graphs. If the compression rate is extremely high, important changes can be ignored, whereas if the compression rate is extremely low, false alarms may increase with more memory. This implies that there is a trade-off between compression rate in graph summarization and accuracy in change detection. We propose a novel quantitative methodology to balance this trade-off to simultaneously realize reliable graph summarization and change detection. We introduce a probabilistic structure of hierarchical latent variable model into a graph, thereby designing a parameterized summary graph on the basis of the minimum description length principle. The parameter specifying the summary graph is then optimized so that the accuracy of change detection is guaranteed to suppress Type I error probability (probability of raising false alarms) to be less than a given confidence level. First, we provide a theoretical framework for connecting graph summarization with change detection. Then, we empirically demonstrate its effectiveness on synthetic and real datasets. ",
    "url": "https://arxiv.org/abs/2311.18694",
    "authors": [
      "Shintaro Fukushima",
      "Kenji Yamanishi"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.18732",
    "title": "Indoor Millimeter Wave Localization using Multiple Self-Supervised Tiny  Neural Networks",
    "abstract": "We consider the localization of a mobile millimeter-wave client in a large indoor environment using multilayer perceptron neural networks (NNs). Instead of training and deploying a single deep model, we proceed by choosing among multiple tiny NNs trained in a self-supervised manner. The main challenge then becomes to determine and switch to the best NN among the available ones, as an incorrect NN will fail to localize the client. In order to upkeep the localization accuracy, we propose two switching schemes: one based on a Kalman filter, and one based on the statistical distribution of the training data. We analyze the proposed schemes via simulations, showing that our approach outperforms both geometric localization schemes and the use of a single NN. ",
    "url": "https://arxiv.org/abs/2311.18732",
    "authors": [
      "Anish Shastri",
      "Andres Garcia-Saavedra",
      "Paolo Casari"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2311.18744",
    "title": "$\\mathbb{Z}_2\\times \\mathbb{Z}_2$ Equivariant Quantum Neural Networks:  Benchmarking against Classical Neural Networks",
    "abstract": "This paper presents a comprehensive comparative analysis of the performance of Equivariant Quantum Neural Networks (EQNN) and Quantum Neural Networks (QNN), juxtaposed against their classical counterparts: Equivariant Neural Networks (ENN) and Deep Neural Networks (DNN). We evaluate the performance of each network with two toy examples for a binary classification task, focusing on model complexity (measured by the number of parameters) and the size of the training data set. Our results show that the $\\mathbb{Z}_2\\times \\mathbb{Z}_2$ EQNN and the QNN provide superior performance for smaller parameter sets and modest training data samples. ",
    "url": "https://arxiv.org/abs/2311.18744",
    "authors": [
      "Zhongtian Dong",
      "Marçal Comajoan Cara",
      "Gopal Ramesh Dahale",
      "Roy T. Forestano",
      "Sergei Gleyzer",
      "Daniel Justice",
      "Kyoungchul Kong",
      "Tom Magorsch",
      "Konstantin T. Matchev",
      "Katia Matcheva",
      "Eyup B. Unlu"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2009.05794",
    "title": "BARS-CTR: Open Benchmarking for Click-Through Rate Prediction",
    "abstract": " Comments: Accepted by CIKM 2021. See the benchmark at this https URL ",
    "url": "https://arxiv.org/abs/2009.05794",
    "authors": [
      "Jieming Zhu",
      "Jinyang Liu",
      "Shuai Yang",
      "Qi Zhang",
      "Xiuqiang He"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2009.09213",
    "title": "Dodging DeepFake Detection via Implicit Spatial-Domain Notch Filtering",
    "abstract": " Comments: 14 pages ",
    "url": "https://arxiv.org/abs/2009.09213",
    "authors": [
      "Yihao Huang",
      "Felix Juefei-Xu",
      "Qing Guo",
      "Yang Liu",
      "Geguang Pu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.15114",
    "title": "UltraGCN: Ultra Simplification of Graph Convolutional Networks for  Recommendation",
    "abstract": " Comments: Accepted by CIKM 2021. Code available at: this https URL ",
    "url": "https://arxiv.org/abs/2110.15114",
    "authors": [
      "Kelong Mao",
      "Jieming Zhu",
      "Xi Xiao",
      "Biao Lu",
      "Zhaowei Wang",
      "Xiuqiang He"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2112.05128",
    "title": "Fair Community Detection and Structure Learning in Heterogeneous  Graphical Models",
    "abstract": " Title: Fair Community Detection and Structure Learning in Heterogeneous  Graphical Models ",
    "url": "https://arxiv.org/abs/2112.05128",
    "authors": [
      "Davoud Ataee Tarzanagh",
      "Laura Balzano",
      "Alfred O. Hero"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.08728",
    "title": "RandoMix: A mixed sample data augmentation method with multiple mixed  modes",
    "abstract": " Title: RandoMix: A mixed sample data augmentation method with multiple mixed  modes ",
    "url": "https://arxiv.org/abs/2205.08728",
    "authors": [
      "Xiaoliang Liu",
      "Furao Shen",
      "Jian Zhao",
      "Changhai Nie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.11377",
    "title": "The END: Estimation Network Design for games under partial-decision  information",
    "abstract": " Comments: 12 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2208.11377",
    "authors": [
      "Mattia Bianchi",
      "Sergio Grammatico"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2209.02973",
    "title": "Foundations of probability-raising causality in Markov decision  processes",
    "abstract": " Comments: Submission for Logical Methods in Computer Science (special issue FoSSaCS 2022). arXiv admin note: substantial text overlap with arXiv:2201.08768 ",
    "url": "https://arxiv.org/abs/2209.02973",
    "authors": [
      "Christel Baier",
      "Jakob Piribauer",
      "Robin Ziemek"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2209.09207",
    "title": "Table Detection in the Wild: A Novel Diverse Table Detection Dataset and  Method",
    "abstract": " Comments: Open source Table detection dataset and baseline results ",
    "url": "https://arxiv.org/abs/2209.09207",
    "authors": [
      "Mrinal Haloi",
      "Shashank Shekhar",
      "Nikhil Fande",
      "Siddhant Swaroop Dash",
      "Sanjay G"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.03628",
    "title": "GraspCaps: A Capsule Network Approach for Familiar 6DoF Object Grasping",
    "abstract": " Comments: Submitted to CVPR 2023, Supplementary video: this https URL ",
    "url": "https://arxiv.org/abs/2210.03628",
    "authors": [
      "Tomas van der Velde",
      "Hamed Ayoobi",
      "Hamidreza Kasaei"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.06186",
    "title": "Gotcha: Real-Time Video Deepfake Detection via Challenge-Response",
    "abstract": " Comments: Code and data to be released by the end of 2023 ",
    "url": "https://arxiv.org/abs/2210.06186",
    "authors": [
      "Govind Mittal",
      "Chinmay Hegde",
      "Nasir Memon"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.01858",
    "title": "Relating graph auto-encoders to linear models",
    "abstract": " Comments: accepted to TMLR ",
    "url": "https://arxiv.org/abs/2211.01858",
    "authors": [
      "Solveig Klepper",
      "Ulrike von Luxburg"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.06841",
    "title": "Point-DAE: Denoising Autoencoders for Self-supervised Point Cloud  Learning",
    "abstract": " Comments: The codes are available at \\url{this https URL} ",
    "url": "https://arxiv.org/abs/2211.06841",
    "authors": [
      "Yabin Zhang",
      "Jiehong Lin",
      "Ruihuang Li",
      "Kui Jia",
      "Lei Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.12993",
    "title": "Benchmarking Robustness to Adversarial Image Obfuscations",
    "abstract": " Title: Benchmarking Robustness to Adversarial Image Obfuscations ",
    "url": "https://arxiv.org/abs/2301.12993",
    "authors": [
      "Florian Stimberg",
      "Ayan Chakrabarti",
      "Chun-Ta Lu",
      "Hussein Hazimeh",
      "Otilia Stretcu",
      "Wei Qiao",
      "Yintao Liu",
      "Merve Kaya",
      "Cyrus Rashtchian",
      "Ariel Fuxman",
      "Mehmet Tek",
      "Sven Gowal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.10414",
    "title": "Improving Scene Text Image Super-resolution via Dual Prior Modulation  Network",
    "abstract": " Comments: Accepted by AAAI-2023 ",
    "url": "https://arxiv.org/abs/2302.10414",
    "authors": [
      "Shipeng Zhu",
      "Zuoyan Zhao",
      "Pengfei Fang",
      "Hui Xue"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.10886",
    "title": "Some Intriguing Aspects about Lipschitz Continuity of Neural Networks",
    "abstract": " Title: Some Intriguing Aspects about Lipschitz Continuity of Neural Networks ",
    "url": "https://arxiv.org/abs/2302.10886",
    "authors": [
      "Grigory Khromov",
      "Sidak Pal Singh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2303.00566",
    "title": "Structured Pruning for Deep Convolutional Neural Networks: A survey",
    "abstract": " Comments: Accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence ",
    "url": "https://arxiv.org/abs/2303.00566",
    "authors": [
      "Yang He",
      "Lingao Xiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.01681",
    "title": "Dense Pixel-to-Pixel Harmonization via Continuous Image Representation",
    "abstract": " Comments: Accepted by IEEE Transactions on Circuits and Systems for Video Technology (TCSVT) ",
    "url": "https://arxiv.org/abs/2303.01681",
    "authors": [
      "Jianqi Chen",
      "Yilan Zhang",
      "Zhengxia Zou",
      "Keyan Chen",
      "Zhenwei Shi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.12001",
    "title": "ViC-MAE: Self-Supervised Representation Learning from Images and Video  with Contrastive Masked Autoencoders",
    "abstract": " Comments: More results on Video an Image datasets, ViC-MAE now supports training on videos and images ",
    "url": "https://arxiv.org/abs/2303.12001",
    "authors": [
      "Jefferson Hernandez",
      "Ruben Villegas",
      "Vicente Ordonez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.00902",
    "title": "FinalMLP: An Enhanced Two-Stream MLP Model for CTR Prediction",
    "abstract": " Comments: Accepted by AAAI 2023. Code available at this https URL ",
    "url": "https://arxiv.org/abs/2304.00902",
    "authors": [
      "Kelong Mao",
      "Jieming Zhu",
      "Liangcai Su",
      "Guohao Cai",
      "Yuru Li",
      "Zhenhua Dong"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2304.10253",
    "title": "Image retrieval outperforms diffusion models on data augmentation",
    "abstract": " Title: Image retrieval outperforms diffusion models on data augmentation ",
    "url": "https://arxiv.org/abs/2304.10253",
    "authors": [
      "Max F. Burg",
      "Florian Wenzel",
      "Dominik Zietlow",
      "Max Horn",
      "Osama Makansi",
      "Francesco Locatello",
      "Chris Russell"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.00162",
    "title": "Beyond Prediction: On-street Parking Recommendation using Heterogeneous  Graph-based List-wise Ranking",
    "abstract": " Title: Beyond Prediction: On-street Parking Recommendation using Heterogeneous  Graph-based List-wise Ranking ",
    "url": "https://arxiv.org/abs/2305.00162",
    "authors": [
      "Hanyu Sun",
      "Xiao Huang",
      "Wei Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02381",
    "title": "Discovering Communication Pattern Shifts in Large-Scale Labeled Networks  using Encoder Embedding and Vertex Dynamics",
    "abstract": " Comments: 10 pages + 2 pages appendix, 8 figures ",
    "url": "https://arxiv.org/abs/2305.02381",
    "authors": [
      "Cencheng Shen",
      "Jonathan Larson",
      "Ha Trinh",
      "Xihan Qin",
      "Youngser Park",
      "Carey E. Priebe"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.08192",
    "title": "Diffusion Models for Imperceptible and Transferable Adversarial Attack",
    "abstract": " Comments: Code Page: this https URL In Paper Version v2, we incorporate more discussions and experiments ",
    "url": "https://arxiv.org/abs/2305.08192",
    "authors": [
      "Jianqi Chen",
      "Hao Chen",
      "Keyan Chen",
      "Yilan Zhang",
      "Zhengxia Zou",
      "Zhenwei Shi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.11164",
    "title": "Exploring the Carbon Footprint of Hugging Face's ML Models: A Repository  Mining Study",
    "abstract": " Comments: Accepted at the 2023 ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM) ",
    "url": "https://arxiv.org/abs/2305.11164",
    "authors": [
      "Joel Castaño",
      "Silverio Martínez-Fernández",
      "Xavier Franch",
      "Justus Bogner"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.13236",
    "title": "ADA-GP: Accelerating DNN Training By Adaptive Gradient Prediction",
    "abstract": " Comments: 13 pages, 21 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2305.13236",
    "authors": [
      "Vahid Janfaza",
      "Shantanu Mandal",
      "Farabi Mahmud",
      "Abdullah Muzahid"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.00210",
    "title": "PERFOGRAPH: A Numerical Aware Program Graph Representation for  Performance Optimization and Program Analysis",
    "abstract": " Title: PERFOGRAPH: A Numerical Aware Program Graph Representation for  Performance Optimization and Program Analysis ",
    "url": "https://arxiv.org/abs/2306.00210",
    "authors": [
      "Ali TehraniJamsaz",
      "Quazi Ishtiaque Mahmud",
      "Le Chen",
      "Nesreen K. Ahmed",
      "Ali Jannesari"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.00974",
    "title": "Discovering Failure Modes of Text-guided Diffusion Models via  Adversarial Search",
    "abstract": " Comments: Project page: this https URL ",
    "url": "https://arxiv.org/abs/2306.00974",
    "authors": [
      "Qihao Liu",
      "Adam Kortylewski",
      "Yutong Bai",
      "Song Bai",
      "Alan Yuille"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.07266",
    "title": "Operator Learning with Neural Fields: Tackling PDEs on General  Geometries",
    "abstract": " Title: Operator Learning with Neural Fields: Tackling PDEs on General  Geometries ",
    "url": "https://arxiv.org/abs/2306.07266",
    "authors": [
      "Louis Serrano",
      "Lise Le Boudec",
      "Armand Kassaï Koupaï",
      "Thomas X Wang",
      "Yuan Yin",
      "Jean-Noël Vittaut",
      "Patrick Gallinari"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.07404",
    "title": "Compositor: Bottom-up Clustering and Compositing for Robust Part and  Object Segmentation",
    "abstract": " Title: Compositor: Bottom-up Clustering and Compositing for Robust Part and  Object Segmentation ",
    "url": "https://arxiv.org/abs/2306.07404",
    "authors": [
      "Ju He",
      "Jieneng Chen",
      "Ming-Xian Lin",
      "Qihang Yu",
      "Alan Yuille"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.08266",
    "title": "Analyzing Robustness of Angluin's L$^*$ Algorithm in Presence of Noise",
    "abstract": " Comments: 23 pages. arXiv admin note: substantial text overlap with arXiv:2209.10315 ",
    "url": "https://arxiv.org/abs/2306.08266",
    "authors": [
      "Lina Ye",
      "Igor Khmelnitsky",
      "Serge Haddad",
      "Benoît Barbot",
      "Benedikt Bollig",
      "Martin Leucker",
      "Daniel Neider",
      "Rajarshi Roy"
    ],
    "subjectives": [
      "Formal Languages and Automata Theory (cs.FL)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2306.15220",
    "title": "S-TLLR: STDP-inspired Temporal Local Learning Rule for Spiking Neural  Networks",
    "abstract": " Comments: 22 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2306.15220",
    "authors": [
      "Marco Paul E. Apolinario",
      "Kaushik Roy"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.07688",
    "title": "DRM-IR: Task-Adaptive Deep Unfolding Network for All-In-One Image  Restoration",
    "abstract": " Title: DRM-IR: Task-Adaptive Deep Unfolding Network for All-In-One Image  Restoration ",
    "url": "https://arxiv.org/abs/2307.07688",
    "authors": [
      "Yuanshuo Cheng",
      "Mingwen Shao",
      "Yecong Wan",
      "Chao Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2307.14680",
    "title": "TimeGNN: Temporal Dynamic Graph Learning for Time Series Forecasting",
    "abstract": " Title: TimeGNN: Temporal Dynamic Graph Learning for Time Series Forecasting ",
    "url": "https://arxiv.org/abs/2307.14680",
    "authors": [
      "Nancy Xu",
      "Chrysoula Kosma",
      "Michalis Vazirgiannis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04051",
    "title": "Generative Models for Anomaly Detection and Design-Space Dimensionality  Reduction in Shape Optimization",
    "abstract": " Comments: Accepted in Engineering Applications of Artificial Intelligence, Elsevier ",
    "url": "https://arxiv.org/abs/2308.04051",
    "authors": [
      "Danny D'Agostino"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2308.10997",
    "title": "MarkovGen: Structured Prediction for Efficient Text-to-Image Generation",
    "abstract": " Title: MarkovGen: Structured Prediction for Efficient Text-to-Image Generation ",
    "url": "https://arxiv.org/abs/2308.10997",
    "authors": [
      "Sadeep Jayasumana",
      "Daniel Glasner",
      "Srikumar Ramalingam",
      "Andreas Veit",
      "Ayan Chakrabarti",
      "Sanjiv Kumar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.13054",
    "title": "Are there graphs whose shortest path structure requires large edge  weights?",
    "abstract": " Comments: ITCS 2024 ",
    "url": "https://arxiv.org/abs/2308.13054",
    "authors": [
      "Aaron Bernstein",
      "Greg Bodwin",
      "Nicole Wein"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2309.03720",
    "title": "A Natural Gas Consumption Forecasting System for Continual Learning  Scenarios based on Hoeffding Trees with Change Point Detection Mechanism",
    "abstract": " Title: A Natural Gas Consumption Forecasting System for Continual Learning  Scenarios based on Hoeffding Trees with Change Point Detection Mechanism ",
    "url": "https://arxiv.org/abs/2309.03720",
    "authors": [
      "Radek Svoboda",
      "Sebastian Basterrech",
      "Jędrzej Kozal",
      "Jan Platoš",
      "Michał Woźniak"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2309.09737",
    "title": "Moving Object Detection and Tracking with 4D Radar Point Cloud",
    "abstract": " Comments: 8 pages, 4 figures. Co-first authorship for Zhijun Pan, Fangqiang Ding and Hantao Zhong, listed randomly ",
    "url": "https://arxiv.org/abs/2309.09737",
    "authors": [
      "Zhijun Pan",
      "Fangqiang Ding",
      "Hantao Zhong",
      "Chris Xiaoxuan Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.00402",
    "title": "DiskANN++: Efficient Page-based Search over Isomorphic Mapped Graph  Index using Query-sensitivity Entry Vertex",
    "abstract": " Comments: 15 pages including references ",
    "url": "https://arxiv.org/abs/2310.00402",
    "authors": [
      "Jiongkang Ni",
      "Xiaoliang Xu",
      "Yuxiang Wang",
      "Can Li",
      "Jiajie Yao",
      "Shihai Xiao",
      "Xuecang Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2310.03915",
    "title": "Leveraging Low-Rank and Sparse Recurrent Connectivity for Robust  Closed-Loop Control",
    "abstract": " Title: Leveraging Low-Rank and Sparse Recurrent Connectivity for Robust  Closed-Loop Control ",
    "url": "https://arxiv.org/abs/2310.03915",
    "authors": [
      "Neehal Tumma",
      "Mathias Lechner",
      "Noel Loo",
      "Ramin Hasani",
      "Daniela Rus"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.04705",
    "title": "Multi-scale MRI reconstruction via dilated ensemble networks",
    "abstract": " Title: Multi-scale MRI reconstruction via dilated ensemble networks ",
    "url": "https://arxiv.org/abs/2310.04705",
    "authors": [
      "Wendi Ma",
      "Marlon Bran Lorenzana",
      "Wei Dai",
      "Hongfu Sun",
      "Shekhar S. Chandra"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.05566",
    "title": "Aggregated f-average Neural Network for Interpretable Ensembling",
    "abstract": " Comments: 6 pages ",
    "url": "https://arxiv.org/abs/2310.05566",
    "authors": [
      "Mathieu Vu",
      "Emilie Chouzenoux",
      "Jean-Christophe Pesquet",
      "Ismail Ben Ayed"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.09485",
    "title": "Applying Bayesian Ridge Regression AI Modeling in Virus Severity  Prediction",
    "abstract": " Comments: 7 pages, 2 figures, 5 listings ",
    "url": "https://arxiv.org/abs/2310.09485",
    "authors": [
      "Jai Pal",
      "Bryan Hong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.11346",
    "title": "Towards Generalizable Multi-Camera 3D Object Detection via Perspective  Debiasing",
    "abstract": " Title: Towards Generalizable Multi-Camera 3D Object Detection via Perspective  Debiasing ",
    "url": "https://arxiv.org/abs/2310.11346",
    "authors": [
      "Hao Lu",
      "Yunpeng Zhang",
      "Qing Lian",
      "Dalong Du",
      "Yingcong Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.16121",
    "title": "19 Parameters Is All You Need: Tiny Neural Networks for Particle Physics",
    "abstract": " Comments: 5 pages, submitted to the \"Machine Learning and the Physical Sciences\" NeurIPS 2023 Workshop ",
    "url": "https://arxiv.org/abs/2310.16121",
    "authors": [
      "Alexander Bogatskiy",
      "Timothy Hoffman",
      "Jan T. Offermann"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)"
    ]
  },
  {
    "id": "arXiv:2311.01714",
    "title": "EXIM: A Hybrid Explicit-Implicit Representation for Text-Guided 3D Shape  Generation",
    "abstract": " Comments: SIGGRAPH Asia 2023 & TOG Project page: this https URL ",
    "url": "https://arxiv.org/abs/2311.01714",
    "authors": [
      "Zhengzhe Liu",
      "Jingyu Hu",
      "Ka-Hei Hui",
      "Xiaojuan Qi",
      "Daniel Cohen-Or",
      "Chi-Wing Fu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.01723",
    "title": "Towards Calibrated Robust Fine-Tuning of Vision-Language Models",
    "abstract": " Comments: NeurIPS 2023 Workshop on Distribution Shifts (DistShift), camera-ready ",
    "url": "https://arxiv.org/abs/2311.01723",
    "authors": [
      "Changdae Oh",
      "Mijoo Kim",
      "Hyesu Lim",
      "Junhyeok Park",
      "Euiseog Jeong",
      "Zhi-Qi Cheng",
      "Kyungwoo Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.03192",
    "title": "Modelling and Optimization Based Control for Demand Response in Active  Distribution Networks",
    "abstract": " Title: Modelling and Optimization Based Control for Demand Response in Active  Distribution Networks ",
    "url": "https://arxiv.org/abs/2311.03192",
    "authors": [
      "Arsam Aryandoust"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.05499",
    "title": "Measuring the Prevalence of WiFi Bottlenecks in Home Access Networks",
    "abstract": " Title: Measuring the Prevalence of WiFi Bottlenecks in Home Access Networks ",
    "url": "https://arxiv.org/abs/2311.05499",
    "authors": [
      "Ranya Sharma",
      "Marc Richardson",
      "Guilherme Martins",
      "Nick Feamster"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2311.12281",
    "title": "GPUSCAN$^{++}$:Efficient Structural Graph Clustering on GPUs",
    "abstract": " Title: GPUSCAN$^{++}$:Efficient Structural Graph Clustering on GPUs ",
    "url": "https://arxiv.org/abs/2311.12281",
    "authors": [
      "Long Yuan",
      "Zeyu Zhou",
      "Xuemin Lin",
      "Zi Chen",
      "Xiang Zhao",
      "Fan Zhang"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2311.12630",
    "title": "Hierarchical Joint Graph Learning and Multivariate Time Series  Forecasting",
    "abstract": " Comments: Temporal Graph Learning Workshop @ NeurIPS 2023, New Orleans, United States ",
    "url": "https://arxiv.org/abs/2311.12630",
    "authors": [
      "Juhyeon Kim",
      "Hyungeun Lee",
      "Seungwon Yu",
      "Ung Hwang",
      "Wooyul Jung",
      "Miseon Park",
      "Kijung Yoon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.12831",
    "title": "ECNR: Efficient Compressive Neural Representation of Time-Varying  Volumetric Datasets",
    "abstract": " Title: ECNR: Efficient Compressive Neural Representation of Time-Varying  Volumetric Datasets ",
    "url": "https://arxiv.org/abs/2311.12831",
    "authors": [
      "Kaiyuan Tang",
      "Chaoli Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14333",
    "title": "Cycle Invariant Positional Encoding for Graph Representation Learning",
    "abstract": " Comments: Accepted as oral presentation in the Learning on Graphs Conference (LoG 2023) ",
    "url": "https://arxiv.org/abs/2311.14333",
    "authors": [
      "Zuoyu Yan",
      "Tengfei Ma",
      "Liangcai Gao",
      "Zhi Tang",
      "Chao Chen",
      "Yusu Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.14837",
    "title": "Benchmarking Robustness of Text-Image Composed Retrieval",
    "abstract": " Comments: Accepted by R0-FoMo: Workshop on Robustness of Few-shot and Zero-shot Learning in Foundation Models at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2311.14837",
    "authors": [
      "Shitong Sun",
      "Jindong Gu",
      "Shaogang Gong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2311.14897",
    "title": "Towards Scalable 3D Anomaly Detection and Localization: A Benchmark via  3D Anomaly Synthesis and A Self-Supervised Learning Network",
    "abstract": " Title: Towards Scalable 3D Anomaly Detection and Localization: A Benchmark via  3D Anomaly Synthesis and A Self-Supervised Learning Network ",
    "url": "https://arxiv.org/abs/2311.14897",
    "authors": [
      "Wenqiao Li",
      "Xiaohao Xu",
      "Yao Gu",
      "Bozhong Zheng",
      "Shenghua Gao",
      "Yingna Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.14948",
    "title": "Effective Backdoor Mitigation Depends on the Pre-training Objective",
    "abstract": " Comments: Accepted for oral presentation at BUGS workshop @ NeurIPS 2023 (this https URL) ",
    "url": "https://arxiv.org/abs/2311.14948",
    "authors": [
      "Sahil Verma",
      "Gantavya Bhatt",
      "Avi Schwarzschild",
      "Soumye Singhal",
      "Arnav Mohanty Das",
      "Chirag Shah",
      "John P Dickerson",
      "Jeff Bilmes"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.15202",
    "title": "Dual-stream contrastive predictive network with joint handcrafted  feature view for SAR ship classification",
    "abstract": " Comments: 6 pages, 3 figures, ICASSP2024 ",
    "url": "https://arxiv.org/abs/2311.15202",
    "authors": [
      "Xianting Feng",
      "Hao zheng",
      "Zhigang Hu",
      "Liu Yang",
      "Meiguang Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.16361",
    "title": "Making Self-supervised Learning Robust to Spurious Correlation via  Learning-speed Aware Sampling",
    "abstract": " Comments: Accepted by NeurIPS 2023 Workshop Self-Supervised Learning - Theory and Practice, 18 pages, 7 figures, 7 tables ",
    "url": "https://arxiv.org/abs/2311.16361",
    "authors": [
      "Weicheng Zhu",
      "Sheng Liu",
      "Carlos Fernandez-Granda",
      "Narges Razavian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.16487",
    "title": "On the Robustness of Decision-Focused Learning",
    "abstract": " Comments: 17 pages, 45 figures, submitted to AAAI artificial intelligence for operations research workshop ",
    "url": "https://arxiv.org/abs/2311.16487",
    "authors": [
      "Yehya Farhat"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2311.16605",
    "title": "LasTGL: An Industrial Framework for Large-Scale Temporal Graph Learning",
    "abstract": " Comments: Preprint; Work in progress ",
    "url": "https://arxiv.org/abs/2311.16605",
    "authors": [
      "Jintang Li",
      "Jiawang Dan",
      "Ruofan Wu",
      "Jing Zhou",
      "Sheng Tian",
      "Yunfei Liu",
      "Baokun Wang",
      "Changhua Meng",
      "Weiqiang Wang",
      "Yuchang Zhu",
      "Liang Chen",
      "Zibin Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.16733",
    "title": "LLMs for Science: Usage for Code Generation and Data Analysis",
    "abstract": " Comments: Preprint; In Submission ",
    "url": "https://arxiv.org/abs/2311.16733",
    "authors": [
      "Mohamed Nejjar",
      "Luca Zacharias",
      "Fabian Stiehle",
      "Ingo Weber"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.17134",
    "title": "GlycoNMR: Dataset and benchmarks for NMR chemical shift prediction of  carbohydrates with graph neural networks",
    "abstract": " Title: GlycoNMR: Dataset and benchmarks for NMR chemical shift prediction of  carbohydrates with graph neural networks ",
    "url": "https://arxiv.org/abs/2311.17134",
    "authors": [
      "Zizhang Chen",
      "Ryan Paul Badman",
      "Lachele Foley",
      "Robert Woods",
      "Pengyu Hong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2311.17361",
    "title": "How does spatial structure affect psychological restoration? A method  based on Graph Neural Networks and Street View Imagery",
    "abstract": " Comments: 33 pages, 7 figures, Under review ",
    "url": "https://arxiv.org/abs/2311.17361",
    "authors": [
      "Haoran Ma",
      "Yan Zhang",
      "Pengyuan Liu",
      "Fan Zhang",
      "Pengyu Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.17400",
    "title": "Improving the Robustness of Transformer-based Large Language Models with  Dynamic Attention",
    "abstract": " Title: Improving the Robustness of Transformer-based Large Language Models with  Dynamic Attention ",
    "url": "https://arxiv.org/abs/2311.17400",
    "authors": [
      "Lujia Shen",
      "Yuwen Pu",
      "Shouling Ji",
      "Changjiang Li",
      "Xuhong Zhang",
      "Chunpeng Ge",
      "Ting Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.17410",
    "title": "GNNFlow: A Distributed Framework for Continuous Temporal GNN Learning on  Dynamic Graphs",
    "abstract": " Title: GNNFlow: A Distributed Framework for Continuous Temporal GNN Learning on  Dynamic Graphs ",
    "url": "https://arxiv.org/abs/2311.17410",
    "authors": [
      "Yuchen Zhong",
      "Guangming Sheng",
      "Tianzuo Qin",
      "Minjie Wang",
      "Quan Gan",
      "Chuan Wu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.17597",
    "title": "Continual Self-supervised Learning: Towards Universal Multi-modal  Medical Data Representation Learning",
    "abstract": " Title: Continual Self-supervised Learning: Towards Universal Multi-modal  Medical Data Representation Learning ",
    "url": "https://arxiv.org/abs/2311.17597",
    "authors": [
      "Yiwen Ye",
      "Yutong Xie",
      "Jianpeng Zhang",
      "Ziyang Chen",
      "Qi Wu",
      "Yong Xia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.17684",
    "title": "Who can help me? Reconstructing users' psychological journeys in  depression-related social media interactions",
    "abstract": " Comments: main article + supporting information ",
    "url": "https://arxiv.org/abs/2311.17684",
    "authors": [
      "Virginia Morini",
      "Salvatore Citraro",
      "Elena Sajno",
      "Maria Sansoni",
      "Giuseppe Riva",
      "Massimo Stella",
      "Giulio Rossetti"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2311.17836",
    "title": "On Scaling Robust Feedback Control and State Estimation Problems in  Power Networks",
    "abstract": " Comments: In Press ",
    "url": "https://arxiv.org/abs/2311.17836",
    "authors": [
      "MirSaleh Bahavarnia",
      "Muhammad Nadeem",
      "Ahmad F. Taha"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  }
]