[
  {
    "id": "arXiv:2204.07579",
    "title": "Interpretable Fault Diagnosis of Rolling Element Bearings with Temporal  Logic Neural Network",
    "abstract": "Machine learning-based methods have achieved successful applications in machinery fault diagnosis. However, the main limitation that exists for these methods is that they operate as a black box and are generally not interpretable. This paper proposes a novel neural network structure, called temporal logic neural network (TLNN), in which the neurons of the network are logic propositions. More importantly, the network can be described and interpreted as a weighted signal temporal logic. TLNN not only keeps the nice properties of traditional neuron networks but also provides a formal interpretation of itself with formal language. Experiments with real datasets show the proposed neural network can obtain highly accurate fault diagnosis results with good computation efficiency. Additionally, the embedded formal language of the neuron network can provide explanations about the decision process, thus achieve interpretable fault diagnosis. ",
    "url": "https://arxiv.org/abs/2204.07579",
    "authors": [
      "Gang Chen",
      "Yu Lu",
      "Rong Su",
      "Zhaodan Kong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.07615",
    "title": "Resource-Constrained Neural Architecture Search on Tabular Datasets",
    "abstract": "The best neural architecture for a given machine learning problem depends on many factors: not only the complexity and structure of the dataset, but also on resource constraints including latency, compute, energy consumption, etc. Neural architecture search (NAS) for tabular datasets is an important but under-explored problem. Previous NAS algorithms designed for image search spaces incorporate resource constraints directly into the reinforcement learning rewards. In this paper, we argue that search spaces for tabular NAS pose considerable challenges for these existing reward-shaping methods, and propose a new reinforcement learning (RL) controller to address these challenges. Motivated by rejection sampling, when we sample candidate architectures during a search, we immediately discard any architecture that violates our resource constraints. We use a Monte-Carlo-based correction to our RL policy gradient update to account for this extra filtering step. Results on several tabular datasets show TabNAS, the proposed approach, efficiently finds high-quality models that satisfy the given resource constraints. ",
    "url": "https://arxiv.org/abs/2204.07615",
    "authors": [
      "Chengrun Yang",
      "Gabriel Bender",
      "Hanxiao Liu",
      "Pieter-Jan Kindermans",
      "Madeleine Udell",
      "Yifeng Lu",
      "Quoc Le",
      "Da Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.07616",
    "title": "Multi-Frame Self-Supervised Depth with Transformers",
    "abstract": "Multi-frame depth estimation improves over single-frame approaches by also leveraging geometric relationships between images via feature matching, in addition to learning appearance-based features. In this paper we revisit feature matching for self-supervised monocular depth estimation, and propose a novel transformer architecture for cost volume generation. We use depth-discretized epipolar sampling to select matching candidates, and refine predictions through a series of self- and cross-attention layers. These layers sharpen the matching probability between pixel features, improving over standard similarity metrics prone to ambiguities and local minima. The refined cost volume is decoded into depth estimates, and the whole pipeline is trained end-to-end from videos using only a photometric objective. Experiments on the KITTI and DDAD datasets show that our DepthFormer architecture establishes a new state of the art in self-supervised monocular depth estimation, and is even competitive with highly specialized supervised single-frame architectures. We also show that our learned cross-attention network yields representations transferable across datasets, increasing the effectiveness of pre-training strategies. Project page: https://sites.google.com/tri.global/depthformer ",
    "url": "https://arxiv.org/abs/2204.07616",
    "authors": [
      "Vitor Guizilini",
      "Rares Ambrus",
      "Dian Chen",
      "Sergey Zakharov",
      "Adrien Gaidon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.07637",
    "title": "Towards a Stronger Theory for Permutation-based Evolutionary Algorithms",
    "abstract": "While the theoretical analysis of evolutionary algorithms (EAs) has made significant progress for pseudo-Boolean optimization problems in the last 25 years, only sporadic theoretical results exist on how EAs solve permutation-based problems. To overcome the lack of permutation-based benchmark problems, we propose a general way to transfer the classic pseudo-Boolean benchmarks into benchmarks defined on sets of permutations. We then conduct a rigorous runtime analysis of the permutation-based $(1+1)$ EA proposed by Scharnow, Tinnefeld, and Wegener (2004) on the analogues of the \\textsc{LeadingOnes} and \\textsc{Jump} benchmarks. The latter shows that, different from bit-strings, it is not only the Hamming distance that determines how difficult it is to mutate a permutation $\\sigma$ into another one $\\tau$, but also the precise cycle structure of $\\sigma \\tau^{-1}$. For this reason, we also regard the more symmetric scramble mutation operator. We observe that it not only leads to simpler proofs, but also reduces the runtime on jump functions with odd jump size by a factor of $\\Theta(n)$. Finally, we show that a heavy-tailed version of the scramble operator, as in the bit-string case, leads to a speed-up of order $m^{\\Theta(m)}$ on jump functions with jump size~$m$.% ",
    "url": "https://arxiv.org/abs/2204.07637",
    "authors": [
      "Benjamin Doerr",
      "Yassine Ghannane",
      "Marouane Ibn Brahim"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.07651",
    "title": "Learning time-dependent PDE solver using Message Passing Graph Neural  Networks",
    "abstract": "One of the main challenges in solving time-dependent partial differential equations is to develop computationally efficient solvers that are accurate and stable. Here, we introduce a graph neural network approach to finding efficient PDE solvers through learning using message-passing models. We first introduce domain invariant features for PDE-data inspired by classical PDE solvers for an efficient physical representation. Next, we use graphs to represent PDE-data on an unstructured mesh and show that message passing graph neural networks (MPGNN) can parameterize governing equations, and as a result, efficiently learn accurate solver schemes for linear/nonlinear PDEs. We further show that the solvers are independent of the initial trained geometry, i.e. the trained solver can find PDE solution on different complex domains. Lastly, we show that a recurrent graph neural network approach can find a temporal sequence of solutions to a PDE. ",
    "url": "https://arxiv.org/abs/2204.07651",
    "authors": [
      "Pourya Pilva",
      "Ahmad Zareei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.07653",
    "title": "Bayesian Updating of Seismic Ground Failure Estimates via Causal  Graphical Models and Satellite Imagery",
    "abstract": "Earthquake-induced secondary ground failure hazards, such as liquefaction and landslides, result in catastrophic building and infrastructure damage as well as human fatalities. To facilitate emergency responses and mitigate losses, the U.S. Geological Survey provides a rapid hazard estimation system for earthquake-triggered landslides and liquefaction using geospatial susceptibility proxies and ShakeMap ground motion estimates. In this study, we develop a generalized causal graph-based Bayesian network that models the physical interdependencies between geospatial features, seismic ground failures, and building damage, as well as DPMs. Geospatial features provide physical insights for estimating ground failure occurrence while DPMs contain event-specific surface change observations. This physics-informed causal graph incorporates these variables with complex physical relationships in one holistic Bayesian updating scheme to effectively fuse information from both geospatial models and remote sensing data. This framework is scalable and flexible enough to deal with highly complex multi-hazard combinations. We then develop a stochastic variational inference algorithm to jointly update the intractable posterior probabilities of unobserved landslides, liquefaction, and building damage at different locations efficiently. In addition, a local graphical model pruning algorithm is presented to reduce the computational cost of large-scale seismic ground failure estimation. We apply this framework to the September 2018 Hokkaido Iburi-Tobu, Japan (M6.6) earthquake and January 2020 Southwest Puerto Rico (M6.4) earthquake to evaluate the performance of our algorithm. ",
    "url": "https://arxiv.org/abs/2204.07653",
    "authors": [
      "Susu Xu",
      "Joshua Dimasaka",
      "David J. Wald",
      "Hae Young Noh"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2204.07657",
    "title": "Accurate detection of sepsis at ED triage using machine learning with  clinical natural language processing",
    "abstract": "Sepsis is a life-threatening condition with organ dysfunction and is a leading cause of death and critical illness worldwide. Accurate detection of sepsis during emergency department triage would allow early initiation of lab analysis, antibiotic administration, and other sepsis treatment protocols. The purpose of this study was to determine whether EHR data can be extracted and synthesized with the latest machine learning algorithms (KATE Sepsis) and clinical natural language processing to produce accurate sepsis models, and compare KATE Sepsis performance with existing sepsis screening protocols, such as SIRS and qSOFA. A machine learning model (KATE Sepsis) was developed using patient encounters with triage data from 16 participating hospitals. KATE Sepsis, SIRS, standard screening (SIRS with source of infection) and qSOFA were tested in three settings. Cohort-A was a retrospective analysis on medical records from a single Site 1. Cohort-B was a prospective analysis of Site 1. Cohort-C was a retrospective analysis on Site 1 with 15 additional sites. Across all cohorts, KATE Sepsis demonstrates an AUC of 0.94-0.963 with 73-74.87% TPR and 3.76-7.17% FPR. Standard screening demonstrates an AUC of 0.682-0.726 with 39.39-51.19% TPR and 2.9-6.02% FPR. The qSOFA protocol demonstrates an AUC of 0.544-0.56, with 10.52-13.18% TPR and 1.22-1.68% FPR. For severe sepsis, across all cohorts, KATE Sepsis demonstrates an AUC of 0.935-0.972 with 70-82.26% TPR and 4.64-8.62% FPR. For septic shock, across all cohorts, KATE Sepsis demonstrates an AUC of 0.96-0.981 with 85.71-89.66% TPR and 4.85-8.8% FPR. SIRS, standard screening, and qSOFA demonstrate low AUC and TPR for severe sepsis and septic shock detection. KATE Sepsis provided substantially better sepsis detection performance in triage than commonly used screening protocols. ",
    "url": "https://arxiv.org/abs/2204.07657",
    "authors": [
      "Oleksandr Ivanov",
      "Karen Molander",
      "Robert Dunne",
      "Stephen Liu",
      "Kevin Masek",
      "Erica Lewis",
      "Lisa Wolf",
      "Debbie Travers",
      "Deena Brecher",
      "Deb Delaney",
      "Kyla Montgomery",
      "Christian Reilly"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.07661",
    "title": "Fairly Accurate: Learning Optimal Accuracy vs. Fairness Tradeoffs for  Hate Speech Detection",
    "abstract": "Recent work has emphasized the importance of balancing competing objectives in model training (e.g., accuracy vs. fairness, or competing measures of fairness). Such trade-offs reflect a broader class of multi-objective optimization (MOO) problems in which optimization methods seek Pareto optimal trade-offs between competing goals. In this work, we first introduce a differentiable measure that enables direct optimization of group fairness (specifically, balancing accuracy across groups) in model training. Next, we demonstrate two model-agnostic MOO frameworks for learning Pareto optimal parameterizations over different groups of neural classification models. We evaluate our methods on the specific task of hate speech detection, in which prior work has shown lack of group fairness across speakers of different English dialects. Empirical results across convolutional, sequential, and transformer-based neural architectures show superior empirical accuracy vs. fairness trade-offs over prior work. More significantly, our measure enables the Pareto machinery to ensure that each architecture achieves the best possible trade-off between fairness and accuracy w.r.t. the dataset, given user-prescribed error tolerance bounds. ",
    "url": "https://arxiv.org/abs/2204.07661",
    "authors": [
      "Venelin Kovatchev",
      "Soumyajit Gupta",
      "Matthew Lease"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.07667",
    "title": "Just Fine-tune Twice: Selective Differential Privacy for Large Language  Models",
    "abstract": "With the increasing adoption of NLP models in real-world products, it becomes more and more important to protect these models from privacy leakage. Because private information in language data is sparse, previous research formalized a Selective-Differential-Privacy (SDP) notion to provide protection for sensitive tokens detected by policy functions, and prove its effectiveness on RNN-based models. But the previous mechanism requires separating the private and public model parameters and thus cannot be applied on large attention-based models. In this paper, we propose a simple yet effective just-fine-tune-twice privacy mechanism to first fine-tune on in-domain redacted data and then on in-domain private data, to achieve SDP for large Transformer-based language models. We also design explicit and contextual policy functions to provide protections at different levels. Experiments show that our models achieve strong performance while staying robust to the canary insertion attack. We further show that even under low-resource settings with a small amount of in-domain data, SDP can still improve the model utility. We will release the code, data and models to facilitate future research. ",
    "url": "https://arxiv.org/abs/2204.07667",
    "authors": [
      "Weiyan Shi",
      "Si Chen",
      "Chiyuan Zhang",
      "Ruoxi Jia",
      "Zhou Yu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.07673",
    "title": "Self-Similarity Priors: Neural Collages as Differentiable Fractal  Representations",
    "abstract": "Many patterns in nature exhibit self-similarity: they can be compactly described via self-referential transformations. Said patterns commonly appear in natural and artificial objects, such as molecules, shorelines, galaxies and even images. In this work, we investigate the role of learning in the automated discovery of self-similarity and in its utilization for downstream tasks. To this end, we design a novel class of implicit operators, Neural Collages, which (1) represent data as the parameters of a self-referential, structured transformation, and (2) employ hypernetworks to amortize the cost of finding these parameters to a single forward pass. We investigate how to leverage the representations produced by Neural Collages in various tasks, including data compression and generation. Neural Collages image compressors are orders of magnitude faster than other self-similarity-based algorithms during encoding and offer compression rates competitive with implicit methods. Finally, we showcase applications of Neural Collages for fractal art and as deep generative models. ",
    "url": "https://arxiv.org/abs/2204.07673",
    "authors": [
      "Michael Poli",
      "Winnie Xu",
      "Stefano Massaroli",
      "Chenlin Meng",
      "Kuno Kim",
      "Stefano Ermon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.07674",
    "title": "CILDA: Contrastive Data Augmentation using Intermediate Layer Knowledge  Distillation",
    "abstract": "Knowledge distillation (KD) is an efficient framework for compressing large-scale pre-trained language models. Recent years have seen a surge of research aiming to improve KD by leveraging Contrastive Learning, Intermediate Layer Distillation, Data Augmentation, and Adversarial Training. In this work, we propose a learning based data augmentation technique tailored for knowledge distillation, called CILDA. To the best of our knowledge, this is the first time that intermediate layer representations of the main task are used in improving the quality of augmented samples. More precisely, we introduce an augmentation technique for KD based on intermediate layer matching using contrastive loss to improve masked adversarial data augmentation. CILDA outperforms existing state-of-the-art KD approaches on the GLUE benchmark, as well as in an out-of-domain evaluation. ",
    "url": "https://arxiv.org/abs/2204.07674",
    "authors": [
      "Md Akmal Haidar",
      "Mehdi Rezagholizadeh",
      "Abbas Ghaddar",
      "Khalil Bibi",
      "Philippe Langlais",
      "Pascal Poupart"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.07679",
    "title": "DialAug: Mixing up Dialogue Contexts in Contrastive Learning for Robust  Conversational Modeling",
    "abstract": "Retrieval-based conversational systems learn to rank response candidates for a given dialogue context by computing the similarity between their vector representations. However, training on a single textual form of the multi-turn context limits the ability of a model to learn representations that generalize to natural perturbations seen during inference. In this paper we propose a framework that incorporates augmented versions of a dialogue context into the learning objective. We utilize contrastive learning as an auxiliary objective to learn robust dialogue context representations that are invariant to perturbations injected through the augmentation method. We experiment with four benchmark dialogue datasets and demonstrate that our framework combines well with existing augmentation methods and can significantly improve over baseline BERT-based ranking architectures. Furthermore, we propose a novel data augmentation method, ConMix, that adds token level perturbations through stochastic mixing of tokens from other contexts in the batch. We show that our proposed augmentation method outperforms previous data augmentation approaches, and provides dialogue representations that are more robust to common perturbations seen during inference. ",
    "url": "https://arxiv.org/abs/2204.07679",
    "authors": [
      "Lahari Poddar",
      "Peiyao Wang",
      "Julia Reinspach"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.07689",
    "title": "Sparsely Activated Mixture-of-Experts are Robust Multi-Task Learners",
    "abstract": "Traditional multi-task learning (MTL) methods use dense networks that use the same set of shared weights across several different tasks. This often creates interference where two or more tasks compete to pull model parameters in different directions. In this work, we study whether sparsely activated Mixture-of-Experts (MoE) improve multi-task learning by specializing some weights for learning shared representations and using the others for learning task-specific information. To this end, we devise task-aware gating functions to route examples from different tasks to specialized experts which share subsets of network weights conditioned on the task. This results in a sparsely activated multi-task model with a large number of parameters, but with the same computational cost as that of a dense model. We demonstrate such sparse networks to improve multi-task learning along three key dimensions: (i) transfer to low-resource tasks from related tasks in the training mixture; (ii) sample-efficient generalization to tasks not seen during training by making use of task-aware routing from seen related tasks; (iii) robustness to the addition of unrelated tasks by avoiding catastrophic forgetting of existing tasks. ",
    "url": "https://arxiv.org/abs/2204.07689",
    "authors": [
      "Shashank Gupta",
      "Subhabrata Mukherjee",
      "Krishan Subudhi",
      "Eduardo Gonzalez",
      "Damien Jose",
      "Ahmed H. Awadallah",
      "Jianfeng Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.07697",
    "title": "Theory of Graph Neural Networks: Representation and Learning",
    "abstract": "Graph Neural Networks (GNNs), neural network architectures targeted to learning representations of graphs, have become a popular learning model for prediction tasks on nodes, graphs and configurations of points, with wide success in practice. This article summarizes a selection of the emerging theoretical results on approximation and learning properties of widely used message passing GNNs and higher-order GNNs, focusing on representation, generalization and extrapolation. Along the way, it summarizes mathematical connections. ",
    "url": "https://arxiv.org/abs/2204.07697",
    "authors": [
      "Stefanie Jegelka"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.07703",
    "title": "TeleGraph: A Benchmark Dataset for Hierarchical Link Prediction",
    "abstract": "Link prediction is a key problem for network-structured data, attracting considerable research efforts owing to its diverse applications. The current link prediction methods focus on general networks and are overly dependent on either the closed triangular structure of networks or node attributes. Their performance on sparse or highly hierarchical networks has not been well studied. On the other hand, the available tree-like benchmark datasets are either simulated, with limited node information, or small in scale. To bridge this gap, we present a new benchmark dataset TeleGraph, a highly sparse and hierarchical telecommunication network associated with rich node attributes, for assessing and fostering the link inference techniques. Our empirical results suggest that most of the algorithms fail to produce a satisfactory performance on a nearly tree-like dataset, which calls for special attention when designing or deploying the link prediction algorithm in practice. ",
    "url": "https://arxiv.org/abs/2204.07703",
    "authors": [
      "Min Zhou",
      "Bisheng Li",
      "Menglin Yang",
      "Lujia Pan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.07707",
    "title": "Privacy-Preserving Image Classification Using Isotropic Network",
    "abstract": "In this paper, we propose a privacy-preserving image classification method that uses encrypted images and an isotropic network such as the vision transformer. The proposed method allows us not only to apply images without visual information to deep neural networks (DNNs) for both training and testing but also to maintain a high classification accuracy. In addition, compressible encrypted images, called encryption-then-compression (EtC) images, can be used for both training and testing without any adaptation network. Previously, to classify EtC images, an adaptation network was required before a classification network, so methods with an adaptation network have been only tested on small images. To the best of our knowledge, previous privacy-preserving image classification methods have never considered image compressibility and patch embedding-based isotropic networks. In an experiment, the proposed privacy-preserving image classification was demonstrated to outperform state-of-the-art methods even when EtC images were used in terms of classification accuracy and robustness against various attacks under the use of two isotropic networks: vision transformer and ConvMixer. ",
    "url": "https://arxiv.org/abs/2204.07707",
    "authors": [
      "AprilPyone MaungMaung",
      "Hitoshi Kiya"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.07709",
    "title": "Easy-Sec: PUF-Based Rapid and Robust Authentication Framework for the  Internet of Vehicles",
    "abstract": "With the rapid growth of new technological paradigms such as the Internet of Things (IoT), it opens new doors for many applications in the modern era for the betterment of human life. One of the recent applications of the IoT is the Internet of Vehicles (IoV) which helps to see unprecedented growth of connected vehicles on the roads. The IoV is gaining attention due to enhancing traffic safety and providing low route information. One of the most important and major requirements of the IoV is preserving security and privacy under strict latency. Moreover, vehicles are required to be authenticated frequently and fast considering limited bandwidth, high mobility, and density of the vehicles. To address the security vulnerabilities and data integrity, an ultralight authentication scheme has been proposed in this article. Physical Unclonable Function (PUF) and XOR function are used to authenticate both server and vehicle in two message flow which makes the proposed scheme ultralight, and less computation is required. The proposed Easy-Sec can authenticate vehicles maintaining low latency and resisting known security threats. Furthermore, the proposed Easy-Sec needs low overhead so that it does not increase the burden of the IoV network. Computational ( around 4 ms) and Communication (32 bytes) overhead shows the feasibility, efficiency, and also security features are depicted using formal analysis, Burrows, Abadi, and Needham (BAN) logic, and informal analysis to show the robustness of the proposed mechanisms against security threats. ",
    "url": "https://arxiv.org/abs/2204.07709",
    "authors": [
      "Pintu Kumar Sadhu",
      "Venkata P. Yanambaka",
      "Saraju P. Mohanty",
      "Elias Kougianos"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.07720",
    "title": "DMCS : Density Modularity based Community Search",
    "abstract": "Community Search, or finding a connected subgraph (known as a community) containing the given query nodes in a social network, is a fundamental problem. Most of the existing community search models only focus on the internal cohesiveness of a community. However, a high-quality community often has high modularity, which means dense connections inside communities and sparse connections to the nodes outside the community. In this paper, we conduct a pioneer study on searching a community with high modularity. We point out that while modularity has been popularly used in community detection (without query nodes), it has not been adopted for community search, surprisingly, and its application in community search (related to query nodes) brings in new challenges. We address these challenges by designing a new graph modularity function named Density Modularity. To the best of our knowledge, this is the first work on the community search problem using graph modularity. The community search based on the density modularity, termed as DMCS, is to find a community in a social network that contains all the query nodes and has high density-modularity. We prove that the DMCS problem is NP-hard. To efficiently address DMCS, we present new algorithms that run in log-linear time to the graph size. We conduct extensive experimental studies in real-world and synthetic networks, which offer insights into the efficiency and effectiveness of our algorithms. In particular, our algorithm achieves up to 8.5 times higher accuracy in terms of NMI than baseline algorithms. ",
    "url": "https://arxiv.org/abs/2204.07720",
    "authors": [
      "Junghoon Kim",
      "Siqiang Luo",
      "Gao Cong",
      "Wenyuan Yu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.07724",
    "title": "Semantic interpretation for convolutional neural networks: What makes a  cat a cat?",
    "abstract": "The interpretability of deep neural networks has attracted increasing attention in recent years, and several methods have been created to interpret the \"black box\" model. Fundamental limitations remain, however, that impede the pace of understanding the networks, especially the extraction of understandable semantic space. In this work, we introduce the framework of semantic explainable AI (S-XAI), which utilizes row-centered principal component analysis to obtain the common traits from the best combination of superpixels discovered by a genetic algorithm, and extracts understandable semantic spaces on the basis of discovered semantically sensitive neurons and visualization techniques. Statistical interpretation of the semantic space is also provided, and the concept of semantic probability is proposed for the first time. Our experimental results demonstrate that S-XAI is effective in providing a semantic interpretation for the CNN, and offers broad usage, including trustworthiness assessment and semantic sample searching. ",
    "url": "https://arxiv.org/abs/2204.07724",
    "authors": [
      "Hao Xu",
      "Yuntian Chen",
      "Dongxiao Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.07726",
    "title": "A Hierarchical Terminal Recognition Approach based on Network Traffic  Analysis",
    "abstract": "Recognizing the type of connected devices to a network helps to perform security policies. In smart grids, identifying massive number of grid metering terminals based on network traffic analysis is almost blank and existing research has not proposed a targeted end-to-end model to solve the flow classification problem. Therefore, we proposed a hierarchical terminal recognition approach that applies the details of grid data. We have formed a two-level model structure by segmenting the grid data, which uses the statistical characteristics of network traffic and the specific behavior characteristics of grid metering terminals. Moreover, through the selection and reconstruction of features, we combine three algorithms to achieve accurate identification of terminal types that transmit network traffic. We conduct extensive experiments on a real dataset containing three types of grid metering terminals, and the results show that our research has improved performance compared to common recognition models. The combination of an autoencoder, K-Means and GradientBoost algorithm achieved the best recognition rate with F1 value of 98.3%. ",
    "url": "https://arxiv.org/abs/2204.07726",
    "authors": [
      "Lingzi Kong",
      "Daoqi Han",
      "Junmei Ding",
      "Mingrui Fan",
      "Yueming Lu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07742",
    "title": "DRFLM: Distributionally Robust Federated Learning with Inter-client  Noise via Local Mixup",
    "abstract": "Recently, federated learning has emerged as a promising approach for training a global model using data from multiple organizations without leaking their raw data. Nevertheless, directly applying federated learning to real-world tasks faces two challenges: (1) heterogeneity in the data among different organizations; and (2) data noises inside individual organizations. In this paper, we propose a general framework to solve the above two challenges simultaneously. Specifically, we propose using distributionally robust optimization to mitigate the negative effects caused by data heterogeneity paradigm to sample clients based on a learnable distribution at each iteration. Additionally, we observe that this optimization paradigm is easily affected by data noises inside local clients, which has a significant performance degradation in terms of global model prediction accuracy. To solve this problem, we propose to incorporate mixup techniques into the local training process of federated learning. We further provide comprehensive theoretical analysis including robustness analysis, convergence analysis, and generalization ability. Furthermore, we conduct empirical studies across different drug discovery tasks, such as ADMET property prediction and drug-target affinity prediction. ",
    "url": "https://arxiv.org/abs/2204.07742",
    "authors": [
      "Bingzhe Wu",
      "Zhipeng Liang",
      "Yuxuan Han",
      "Yatao Bian",
      "Peilin Zhao",
      "Junzhou Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.07749",
    "title": "From Parental Control to Joint Family Oversight: Can Parents and Teens  Manage Mobile Online Safety and Privacy as Equals?",
    "abstract": "Our research aims to highlight and alleviate the complex tensions around online safety, privacy, and smartphone usage in families so that parents and teens can work together to better manage mobile privacy and security-related risks. We developed a mobile application (\"app\") for Community Oversight of Privacy and Security (\"CO-oPS\") and had parents and teens assess whether it would be applicable for use with their families. CO-oPS is an Android app that allows a group of users to co-monitor the apps installed on one another's devices and the privacy permissions granted to those apps. We conducted a study with 19 parent-teen (ages 13-17) pairs to understand how they currently managed mobile safety and app privacy within their family and then had them install, use, and evaluate the CO-oPS app. We found that both parents and teens gave little consideration to online safety and privacy before installing new apps or granting privacy permissions. When using CO-oPS, participants liked how the app increased transparency into one another's devices in a way that facilitated communication, but were less inclined to use features for in-app messaging or to hide apps from one another. Key themes related to power imbalances between parents and teens surfaced that made co-management challenging. Parents were more open to collaborative oversight than teens, who felt that it was not their place to monitor their parents, even though both often believed parents lacked the technological expertise to monitor themselves. Our study sheds light on why collaborative practices for managing online safety and privacy within families may be beneficial but also quite difficult to implement in practice. We provide recommendations for overcoming these challenges based on the insights gained from our study. ",
    "url": "https://arxiv.org/abs/2204.07749",
    "authors": [
      "Mamtaj Akter",
      "Amy Godfrey",
      "Jess Kropczynski",
      "Heather Lipford",
      "Pamela Wisniewski"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2204.07752",
    "title": "Homomorphic Encryption and Federated Learning based Privacy-Preserving  CNN Training: COVID-19 Detection Use-Case",
    "abstract": "Medical data is often highly sensitive in terms of data privacy and security concerns. Federated learning, one type of machine learning techniques, has been started to use for the improvement of the privacy and security of medical data. In the federated learning, the training data is distributed across multiple machines, and the learning process is performed in a collaborative manner. There are several privacy attacks on deep learning (DL) models to get the sensitive information by attackers. Therefore, the DL model itself should be protected from the adversarial attack, especially for applications using medical data. One of the solutions for this problem is homomorphic encryption-based model protection from the adversary collaborator. This paper proposes a privacy-preserving federated learning algorithm for medical data using homomorphic encryption. The proposed algorithm uses a secure multi-party computation protocol to protect the deep learning model from the adversaries. In this study, the proposed algorithm using a real-world medical dataset is evaluated in terms of the model performance. ",
    "url": "https://arxiv.org/abs/2204.07752",
    "authors": [
      "Febrianti Wibawa",
      "Ferhat Ozgur Catak",
      "Salih Sarp",
      "Murat Kuzlu",
      "Umit Cali"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07763",
    "title": "UFRC: A Unified Framework for Reliable COVID-19 Detection on  Crowdsourced Cough Audio",
    "abstract": "We suggested a unified system with core components of data augmentation, ImageNet-pretrained ResNet-50, cost-sensitive loss, deep ensemble learning, and uncertainty estimation to quickly and consistently detect COVID-19 using acoustic evidence. To increase the model's capacity to identify a minority class, data augmentation and cost-sensitive loss are incorporated (infected samples). In the COVID-19 detection challenge, ImageNet-pretrained ResNet-50 has been found to be effective. The unified framework also integrates deep ensemble learning and uncertainty estimation to integrate predictions from various base classifiers for generalisation and reliability. We ran a series of tests using the DiCOVA2021 challenge dataset to assess the efficacy of our proposed method, and the results show that our method has an AUC-ROC of 85.43 percent, making it a promising method for COVID-19 detection. The unified framework also demonstrates that audio may be used to quickly diagnose different respiratory disorders. ",
    "url": "https://arxiv.org/abs/2204.07763",
    "authors": [
      "Jiangeng Chang",
      "Yucheng Ruan",
      "Cui Shaoze",
      "John Soong Tshon Yit",
      "Mengling Feng"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.07772",
    "title": "SETTI: A Self-supervised Adversarial Malware Detection Architecture in  an IoT Environment",
    "abstract": "In recent years, malware detection has become an active research topic in the area of Internet of Things (IoT) security. The principle is to exploit knowledge from large quantities of continuously generated malware. Existing algorithms practice available malware features for IoT devices and lack real-time prediction behaviors. More research is thus required on malware detection to cope with real-time misclassification of the input IoT data. Motivated by this, in this paper we propose an adversarial self-supervised architecture for detecting malware in IoT networks, SETTI, considering samples of IoT network traffic that may not be labeled. In the SETTI architecture, we design three self-supervised attack techniques, namely Self-MDS, GSelf-MDS and ASelf-MDS. The Self-MDS method considers the IoT input data and the adversarial sample generation in real-time. The GSelf-MDS builds a generative adversarial network model to generate adversarial samples in the self-supervised structure. Finally, ASelf-MDS utilizes three well-known perturbation sample techniques to develop adversarial malware and inject it over the self-supervised architecture. Also, we apply a defence method to mitigate these attacks, namely adversarial self-supervised training to protect the malware detection architecture against injecting the malicious samples. To validate the attack and defence algorithms, we conduct experiments on two recent IoT datasets: IoT23 and NBIoT. Comparison of the results shows that in the IoT23 dataset, the Self-MDS method has the most damaging consequences from the attacker's point of view by reducing the accuracy rate from 98% to 74%. In the NBIoT dataset, the ASelf-MDS method is the most devastating algorithm that can plunge the accuracy rate from 98% to 77%. ",
    "url": "https://arxiv.org/abs/2204.07772",
    "authors": [
      "Marjan Golmaryami",
      "Rahim Taheri",
      "Zahra Pooranian",
      "Mohammad Shojafar",
      "Pei Xiao"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07786",
    "title": "Approaching sales forecasting using recurrent neural networks and  transformers",
    "abstract": "Accurate and fast demand forecast is one of the hot topics in supply chain for enabling the precise execution of the corresponding downstream processes (inbound and outbound planning, inventory placement, network planning, etc). We develop three alternatives to tackle the problem of forecasting the customer sales at day/store/item level using deep learning techniques and the Corporaci\\'on Favorita data set, published as part of a Kaggle competition. Our empirical results show how good performance can be achieved by using a simple sequence to sequence architecture with minimal data preprocessing effort. Additionally, we describe a training trick for making the model more time independent and hence improving generalization over time. The proposed solution achieves a RMSLE of around 0.54, which is competitive with other more specific solutions to the problem proposed in the Kaggle competition. ",
    "url": "https://arxiv.org/abs/2204.07786",
    "authors": [
      "Iván Vallés-Pérez",
      "Emilio Soria-Olivas",
      "Marcelino Martínez-Sober",
      "Antonio J. Serrano-López",
      "Juan Gómez-Sanchís",
      "Fernando Mateo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2204.07791",
    "title": "UAMD-Net: A Unified Adaptive Multimodal Neural Network for Dense Depth  Completion",
    "abstract": "Depth prediction is a critical problem in robotics applications especially autonomous driving. Generally, depth prediction based on binocular stereo matching and fusion of monocular image and laser point cloud are two mainstream methods. However, the former usually suffers from overfitting while building cost volume, and the latter has a limited generalization due to the lack of geometric constraint. To solve these problems, we propose a novel multimodal neural network, namely UAMD-Net, for dense depth completion based on fusion of binocular stereo matching and the weak constrain from the sparse point clouds. Specifically, the sparse point clouds are converted to sparse depth map and sent to the multimodal feature encoder (MFE) with binocular image, constructing a cross-modal cost volume. Then, it will be further processed by the multimodal feature aggregator (MFA) and the depth regression layer. Furthermore, the existing multimodal methods ignore the problem of modal dependence, that is, the network will not work when a certain modal input has a problem. Therefore, we propose a new training strategy called Modal-dropout which enables the network to be adaptively trained with multiple modal inputs and inference with specific modal inputs. Benefiting from the flexible network structure and adaptive training method, our proposed network can realize unified training under various modal input conditions. Comprehensive experiments conducted on KITTI depth completion benchmark demonstrate that our method produces robust results and outperforms other state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2204.07791",
    "authors": [
      "Guancheng Chen",
      "Junli Lin",
      "Huabiao Qin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.07796",
    "title": "Fuzzy-based Robust Precision Consensus Tracking for Uncertain Networked  Systems with Cooperative-Antagonistic Interactions",
    "abstract": "In bipartite consensus tracking (BCT) tasks for nonlinear multiagent systems, stochastic disturbances and actuator faults are regarded as essential factors that hamper effective controller formulation and tracking precision improvement. To address these difficulties, we design an improved finitetime performance function (FTPF) for a fuzzy fault-tolerant distributed cooperative control scheme to achieve finite-time robust precision BCT tasks for nonlinear multiagent systems. The parameter selection range of the improved FTPF is relaxed, which renders systems to achieve better transient performance. Benefitting from stochastic Lyapunov stability theory, it is shown that all signals of systems are semi-global uniformly ultimately bounded in probability, and bipartite consensus errors can satisfy the arbitrary precision with probability in the predefined time. Finally, to verify its effectiveness, the proposed control scheme is applied to BCT tasks of a group of vehicles, which manifests anticipated control performance under various uncertainties. ",
    "url": "https://arxiv.org/abs/2204.07796",
    "authors": [
      "Amorey Lewis"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Adaptation and Self-Organizing Systems (nlin.AO)"
    ]
  },
  {
    "id": "arXiv:2204.07799",
    "title": "Scheduling Coflows for Minimizing the Total Weighted Completion Time in  Heterogeneous Parallel Networks",
    "abstract": "Coflow is a network abstraction used to represent communication patterns in data centers. The coflow scheduling problem in large data centers is one of the most important $NP$-hard problems. Many previous studies on coflow scheduling mainly focus on the single-core model. However, with the growth of data centers, this single-core model is no longer sufficient. This paper considers the coflow scheduling problem in heterogeneous parallel networks. The heterogeneous parallel network is an architecture based on multiple network cores running in parallel. In this paper, two polynomial-time approximation algorithms are developed for scheduling divisible and indivisible coflows in heterogeneous parallel networks, respectively. Both algorithms achieve an approximation ratio of $O(\\log m/ \\log \\log m)$ with arbitrary release times. ",
    "url": "https://arxiv.org/abs/2204.07799",
    "authors": [
      "Chi-Yeh Chen"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2204.07805",
    "title": "Universal Solution Manifold Networks (USM-Nets): non-intrusive mesh-free  surrogate models for problems in variable domains",
    "abstract": "We introduce Universal Solution Manifold Network (USM-Net), a novel surrogate model, based on Artificial Neural Networks (ANNs), which applies to differential problems whose solution depends on physical and geometrical parameters. Our method employs a mesh-less architecture, thus overcoming the limitations associated with image segmentation and mesh generation required by traditional discretization methods. Indeed, we encode geometrical variability through scalar landmarks, such as coordinates of points of interest. In biomedical applications, these landmarks can be inexpensively processed from clinical images. Our approach is non-intrusive and modular, as we select a data-driven loss function. The latter can also be modified by considering additional constraints, thus leveraging available physical knowledge. Our approach can also accommodate a universal coordinate system, which supports the USM-Net in learning the correspondence between points belonging to different geometries, boosting prediction accuracy on unobserved geometries. Finally, we present two numerical test cases in computational fluid dynamics involving variable Reynolds numbers as well as computational domains of variable shape. The results show that our method allows for inexpensive but accurate approximations of velocity and pressure, avoiding computationally expensive image segmentation, mesh generation, or re-training for every new instance of physical parameters and shape of the domain. ",
    "url": "https://arxiv.org/abs/2204.07805",
    "authors": [
      "Francesco Regazzoni",
      "Stefano Pagani",
      "Alfio Quarteroni"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2204.07827",
    "title": "Local treewidth of random and noisy graphs with applications to stopping  contagion in networks",
    "abstract": "We study the notion of local treewidth in sparse random graphs: the maximum treewidth over all $k$-vertex subgraphs of an $n$-vertex graph. When $k$ is not too large, we give nearly tight bounds for this local treewidth parameter; we also derive tight bounds for the local treewidth of noisy trees, trees where every non-edge is added independently with small probability. We apply our upper bounds on the local treewidth to obtain fixed parameter tractable algorithms (on random graphs and noisy trees) for edge-removal problems centered around containing a contagious process evolving over a network. In these problems, our main parameter of study is $k$, the number of \"infected\" vertices in the network. For a certain range of parameters the running time of our algorithms on $n$-vertex graphs is $2^{o(k)}\\textrm{poly}(n)$, improving upon the $2^{\\Omega(k)}\\textrm{poly}(n)$ performance of the best-known algorithms designed for worst-case instances of these edge deletion problems. ",
    "url": "https://arxiv.org/abs/2204.07827",
    "authors": [
      "Hermish Mehta",
      "Daniel Reichman"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2204.07832",
    "title": "A Contrastive Cross-Channel Data Augmentation Framework for Aspect-based  Sentiment Analysis",
    "abstract": "Aspect-Based Sentiment Analysis is a fine-grained sentiment analysis task, which focuses on detecting the sentiment polarity towards the aspect in a sentence. However, it is always sensitive to the multi-aspect challenge, where features of multiple aspects in a sentence will affect each other. To mitigate this issue, we design a novel training framework, called Contrastive Cross-Channel Data Augmentation (C3DA). A source sentence will be fed a domain-specific generator to obtain some synthetic sentences and is concatenated with these generated sentences to conduct supervised training and proposed contrastive training. To be specific, considering the limited ABSA labeled data, we also introduce some parameter-efficient approaches to complete sentences generation. This novel generation method consists of an Aspect Augmentation Channel (AAC) to generate aspect-specific sentences and a Polarity Augmentation (PAC) to generate polarity-inverted sentences. According to our extensive experiments, our C3DA framework can outperform those baselines without any augmentations by about 1\\% on accuracy and Macro-F1. ",
    "url": "https://arxiv.org/abs/2204.07832",
    "authors": [
      "Bing Wang",
      "Liang Ding",
      "Qihuang Zhong",
      "Ximing Li",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.07835",
    "title": "What If: Generating Code to Answer Simulation Questions",
    "abstract": "Many texts, especially in chemistry and biology, describe complex processes. We focus on texts that describe a chemical reaction process and questions that ask about the process's outcome under different environmental conditions. To answer questions about such processes, one needs to understand the interactions between the different entities involved in the process and to simulate their state transitions during the process execution under different conditions. A state transition is defined as the memory modification the program does to the variables during the execution. We hypothesize that generating code and executing it to simulate the process will allow answering such questions. We, therefore, define a domain-specific language (DSL) to represent processes. We contribute to the community a unique dataset curated by chemists and annotated by computer scientists. The dataset is composed of process texts, simulation questions, and their corresponding computer codes represented by the DSL.We propose a neural program synthesis approach based on reinforcement learning with a novel state-transition semantic reward. The novel reward is based on the run-time semantic similarity between the predicted code and the reference code. This allows simulating complex process transitions and thus answering simulation questions. Our approach yields a significant boost in accuracy for simulation questions: 88\\% accuracy as opposed to 83\\% accuracy of the state-of-the-art neural program synthesis approaches and 54\\% accuracy of state-of-the-art end-to-end text-based approaches. ",
    "url": "https://arxiv.org/abs/2204.07835",
    "authors": [
      "Gal Peretz",
      "Kira Radinsky"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07837",
    "title": "BLISS: Robust Sequence-to-Sequence Learning via Self-Supervised Input  Representation",
    "abstract": "Data augmentations (DA) are the cores to achieving robust sequence-to-sequence learning on various natural language processing (NLP) tasks. However, most of the DA approaches force the decoder to make predictions conditioned on the perturbed input representation, underutilizing supervised information provided by perturbed input. In this work, we propose a framework-level robust sequence-to-sequence learning approach, named BLISS, via self-supervised input representation, which has the great potential to complement the data-level augmentation approaches. The key idea is to supervise the sequence-to-sequence framework with both the \\textit{supervised} (\"input$\\rightarrow$output\") and \\textit{self-supervised} (\"perturbed input$\\rightarrow$input\") information. We conduct comprehensive experiments to validate the effectiveness of BLISS on various tasks, including machine translation, grammatical error correction, and text summarization. The results show that BLISS outperforms significantly the vanilla Transformer and consistently works well across tasks than the other five contrastive baselines. Extensive analyses reveal that BLISS learns robust representations and rich linguistic knowledge, confirming our claim. Source code will be released upon publication. ",
    "url": "https://arxiv.org/abs/2204.07837",
    "authors": [
      "Zheng Zhang",
      "Liang Ding",
      "Dazhao Cheng",
      "Xuebo Liu",
      "Min Zhang",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.07840",
    "title": "A Robust and Scalable Attention Guided Deep Learning Framework for  Movement Quality Assessment",
    "abstract": "Physical rehabilitation programs frequently begin with a brief stay in the hospital and continue with home-based rehabilitation. Lack of feedback on exercise correctness is a significant issue in home-based rehabilitation. Automated movement quality assessment (MQA) using skeletal movement data (hereafter referred to as skeletal data) collected via depth imaging devices can assist with home-based rehabilitation by providing the necessary quantitative feedback. This paper aims to use recent advances in deep learning to address the problem of MQA. Movement quality score generation is an essential component of MQA. We propose three novel skeletal data augmentation schemes. We show that using the proposed augmentations for generating movement quality scores result in significant performance boosts over existing methods. Finally, we propose a novel transformer based architecture for MQA. Four novel feature extractors are proposed and studied that allow the transformer network to operate on skeletal data. We show that adding the attention mechanism in the design of the proposed feature extractor allows the transformer network to pay attention to specific body parts that make a significant contribution towards executing a movement. We report an improvement in movement quality score prediction of 12% on UI-PRMD dataset and 21% on KIMORE dataset compared to the existing methods. ",
    "url": "https://arxiv.org/abs/2204.07840",
    "authors": [
      "Aditya Kanade",
      "Mansi Sharma",
      "Manivannan Muniyandi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.07841",
    "title": "Multimodal Few-Shot Object Detection with Meta-Learning Based  Cross-Modal Prompting",
    "abstract": "We study multimodal few-shot object detection (FSOD) in this paper, using both few-shot visual examples and class semantic information for detection. Most of previous works focus on either few-shot or zero-shot object detection, ignoring the complementarity of visual and semantic information. We first show that meta-learning and prompt-based learning, the most commonly-used methods for few-shot learning and zero-shot transferring from pre-trained vision-language models to downstream tasks, are conceptually similar. They both reformulate the objective of downstream tasks the same as the pre-training tasks, and mostly without tuning the parameters of pre-trained models. Based on this observation, we propose to combine meta-learning with prompt-based learning for multimodal FSOD without fine-tuning, by learning transferable class-agnostic multimodal FSOD models over many-shot base classes. Specifically, to better exploit the pre-trained vision-language models, the meta-learning based cross-modal prompting is proposed to generate soft prompts and further used to extract the semantic prototype, conditioned on the few-shot visual examples. Then, the extracted semantic prototype and few-shot visual prototype are fused to generate the multimodal prototype for detection. Our models can efficiently fuse the visual and semantic information at both token-level and feature-level. We comprehensively evaluate the proposed multimodal FSOD models on multiple few-shot object detection benchmarks, achieving promising results. ",
    "url": "https://arxiv.org/abs/2204.07841",
    "authors": [
      "Guangxing Han",
      "Jiawei Ma",
      "Shiyuan Huang",
      "Long Chen",
      "Rama Chellappa",
      "Shih-Fu Chang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2204.07848",
    "title": "STRATA: Word Boundaries & Phoneme Recognition From Continuous Urdu  Speech using Transfer Learning, Attention, & Data Augmentation",
    "abstract": "Phoneme recognition is a largely unsolved problem in NLP, especially for low-resource languages like Urdu. The systems that try to extract the phonemes from audio speech require hand-labeled phonetic transcriptions. This requires expert linguists to annotate speech data with its relevant phonetic representation which is both an expensive and a tedious task. In this paper, we propose STRATA, a framework for supervised phoneme recognition that overcomes the data scarcity issue for low resource languages using a seq2seq neural architecture integrated with transfer learning, attention mechanism, and data augmentation. STRATA employs transfer learning to reduce the network loss in half. It uses attention mechanism for word boundaries and frame alignment detection which further reduces the network loss by 4% and is able to identify the word boundaries with 92.2% accuracy. STRATA uses various data augmentation techniques to further reduce the loss by 1.5% and is more robust towards new signals both in terms of generalization and accuracy. STRATA is able to achieve a Phoneme Error Rate of 16.5% and improves upon the state of the art by 1.1% for TIMIT dataset (English) and 11.5% for CSaLT dataset (Urdu). ",
    "url": "https://arxiv.org/abs/2204.07848",
    "authors": [
      "Saad Naeem",
      "Omer Beg"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.07852",
    "title": "Traffic-Aware Mean-Field Power Allocation for Ultra-Dense NB-IoT  Networks",
    "abstract": "The Narrowband Internet of Things (NB-IoT) is a cellular technology introduced by the Third Generation Partnership Project (3GPP) to provide connectivity to a large number of low-cost IoT devices with strict energy consumption limitations. However, in an ultra-dense small cell network employing NB-IoT technology, inter-cell interference can be a problem, raising serious concerns regarding the performance of NB-IoT, particularly in uplink transmission. Thus, a power allocation method must be established to analyze uplink performance, control and predict inter-cell interference, and avoid excessive energy waste during transmission. Unfortunately, standard power allocation techniques become inappropriate as their computational complexity grows in an ultra-dense environment. Furthermore, the performance of NB-IoT is strongly dependent on the traffic generated by IoT devices. In order to tackle these challenges, we provide a consistent and distributed uplink power allocation solution under spatiotemporal fluctuation incorporating NB-IoT features such as the number of repetitions and the data rate, as well as the IoT device's energy budget, packet size, and traffic intensity, by leveraging stochastic geometry analysis and Mean-Field Game (MFG) theory. The effectiveness of our approach is illustrated via extensive numerical analysis, and many insightful discussions are presented. ",
    "url": "https://arxiv.org/abs/2204.07852",
    "authors": [
      "Sami Nadif",
      "Essaid Sabir",
      "Halima Elbiaze",
      "Abdelkrim Haqiq"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Computer Science and Game Theory (cs.GT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.07854",
    "title": "IIFNet: A Fusion based Intelligent Service for Noisy Preamble Detection  in 6G",
    "abstract": "In this article, we present our vision of preamble detection in a physical random access channel for next-generation (Next-G) networks using machine learning techniques. Preamble detection is performed to maintain communication and synchronization between devices of the Internet of Everything (IoE) and next-generation nodes. Considering the scalability and traffic density, Next-G networks have to deal with preambles corrupted by noise due to channel characteristics or environmental constraints. We show that when injecting 15% random noise, the detection performance degrades to 48%. We propose an informative instance-based fusion network (IIFNet) to cope with random noise and to improve detection performance, simultaneously. A novel sampling strategy for selecting informative instances from feature spaces has also been explored to improve detection performance. The proposed IIFNet is tested on a real dataset for preamble detection that was collected with the help of a reputable company (AZCOM Technology). ",
    "url": "https://arxiv.org/abs/2204.07854",
    "authors": [
      "Sunder Ali Khowaja",
      "Kapal Dev",
      "Parus Khuwaja",
      "Quoc-Viet Pham",
      "Nawab Muhammad Faseeh Qureshi",
      "Paolo Bellavista",
      "Maurizio Magarini"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.07868",
    "title": "Alternating Channel Estimation and Prediction for Cell-Free mMIMO with  Channel Aging: A Deep Learning Based Scheme",
    "abstract": "In large scale dynamic wireless networks, the amount of overhead caused by channel estimation (CE) is becoming one of the main performance bottlenecks. This is due to the large number users whose channels should be estimated, the user mobility, and the rapid channel change caused by the usage of the high-frequency spectrum (e.g. millimeter wave). In this work, we propose a new hybrid channel estimation/prediction (CEP) scheme to reduce overhead in time-division duplex (TDD) wireless cell-free massive multiple-input-multiple-output (mMIMO) systems. The scheme proposes sending a pilot signal from each user only once in a given number (window) of coherence intervals (CIs). Then minimum mean-square error (MMSE) estimation is used to estimate the channel of this CI, while a deep neural network (DNN) is used to predict the channels of the remaining CIs in the window. The DNN exploits the temporal correlation between the consecutive CIs and the received pilot signals to improve the channel prediction accuracy. By doing so, CE overhead is reduced by at least 50 percent at the expense of negligible CE error for practical user mobility settings. Consequently, the proposed CEP scheme improves the spectral efficiency compared to the conventional MMSE CE approach, especially when the number of users is large, which is demonstrated numerically. ",
    "url": "https://arxiv.org/abs/2204.07868",
    "authors": [
      "Mohanad Obeed",
      "Yasser Al-Eryani",
      "Anas Chaaban"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07887",
    "title": "Mapping LiDAR and Camera Measurements in a Dual Top-View Grid  Representation Tailored for Automated Vehicles",
    "abstract": "We present a generic evidential grid mapping pipeline designed for imaging sensors such as LiDARs and cameras. Our grid-based evidential model contains semantic estimates for cell occupancy and ground separately. We specify the estimation steps for input data represented by point sets, but mainly focus on input data represented by images such as disparity maps or LiDAR range images. Instead of relying on an external ground segmentation only, we deduce occupancy evidence by analyzing the surface orientation around measurements. We conduct experiments and evaluate the presented method using LiDAR and stereo camera data recorded in real traffic scenarios. Our method estimates cell occupancy robustly and with a high level of detail while maximizing efficiency and minimizing the dependency to external processing modules. ",
    "url": "https://arxiv.org/abs/2204.07887",
    "authors": [
      "Sven Richter",
      "Frank Bieder",
      "Sascha Wirges",
      "Christoph Stiller"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.07889",
    "title": "SymForce: Symbolic Computation and Code Generation for Robotics",
    "abstract": "We present SymForce, a fast symbolic computation and code generation library for robotics applications like computer vision, state estimation, motion planning, and controls. SymForce combines the development speed and flexibility of symbolic mathematics with the performance of autogenerated, highly optimized code in C++ or any target runtime language. SymForce provides geometry and camera types, Lie group operations, and branchless singularity handling for creating and analyzing complex symbolic expressions in Python, built on top of SymPy. Generated functions can be integrated as factors into our tangent space nonlinear optimizer, which is highly optimized for real-time production use. We introduce novel methods to automatically compute tangent space Jacobians, eliminating the need for bug-prone handwritten derivatives. This workflow enables faster runtime code, faster development time, and fewer lines of handwritten code versus the state-of-the-art. Our experiments demonstrate that our approach can yield order of magnitude speedups on computational tasks core to robotics. Code is available at https://github.com/symforce-org/symforce . ",
    "url": "https://arxiv.org/abs/2204.07889",
    "authors": [
      "Hayk Martiros",
      "Aaron Miller",
      "Nathan Bucki",
      "Bradley Solliday",
      "Ryan Kennedy",
      "Jack Zhu",
      "Tung Dang",
      "Dominic Pattison",
      "Harrison Zheng",
      "Teo Tomic",
      "Peter Henry",
      "Gareth Cross",
      "Josiah VanderMey",
      "Alvin Sun",
      "Samuel Wang",
      "Kristen Holtz"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Symbolic Computation (cs.SC)"
    ]
  },
  {
    "id": "arXiv:2204.07922",
    "title": "A Survey on Efficient Processing of Similarity Queries over Neural  Embeddings",
    "abstract": "Similarity query is the family of queries based on some similarity metrics. Unlike the traditional database queries which are mostly based on value equality, similarity queries aim to find targets \"similar enough to\" the given data objects, depending on some similarity metric, e.g., Euclidean distance, cosine similarity and so on. To measure the similarity between data objects, traditional methods normally work on low level or syntax features(e.g., basic visual features on images or bag-of-word features of text), which makes them weak to compute the semantic similarities between objects. So for measuring data similarities semantically, neural embedding is applied. Embedding techniques work by representing the raw data objects as vectors (so called \"embeddings\" or \"neural embeddings\" since they are mostly generated by neural network models) that expose the hidden semantics of the raw data, based on which embeddings do show outstanding effectiveness on capturing data similarities, making it one of the most widely used and studied techniques in the state-of-the-art similarity query processing research. But there are still many open challenges on the efficiency of embedding based similarity query processing, which are not so well-studied as the effectiveness. In this survey, we first provide an overview of the \"similarity query\" and \"similarity query processing\" problems. Then we talk about recent approaches on designing the indexes and operators for highly efficient similarity query processing on top of embeddings (or more generally, high dimensional data). Finally, we investigate the specific solutions with and without using embeddings in selected application domains of similarity queries, including entity resolution and information retrieval. By comparing the solutions, we show how neural embeddings benefit those applications. ",
    "url": "https://arxiv.org/abs/2204.07922",
    "authors": [
      "Yifan Wang"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2204.07927",
    "title": "In Defense of Subspace Tracker: Orthogonal Embedding for Visual Tracking",
    "abstract": "The paper focuses on a classical tracking model, subspace learning, grounded on the fact that the targets in successive frames are considered to reside in a low-dimensional subspace or manifold due to the similarity in their appearances. In recent years, a number of subspace trackers have been proposed and obtained impressive results. Inspired by the most recent results that the tracking performance is boosted by the subspace with discrimination capability learned over the recently localized targets and their immediately surrounding background, this work aims at solving such a problem: how to learn a robust low-dimensional subspace to accurately and discriminatively represent these target and background samples. To this end, a discriminative approach, which reliably separates the target from its surrounding background, is injected into the subspace learning by means of joint learning, achieving a dimension-adaptive subspace with superior discrimination capability. The proposed approach is extensively evaluated and compared with the state-of-the-art trackers on four popular tracking benchmarks. The experimental results demonstrate that the proposed tracker performs competitively against its counterparts. In particular, it achieves more than 9% performance increase compared with the state-of-the-art subspace trackers. ",
    "url": "https://arxiv.org/abs/2204.07927",
    "authors": [
      "Yao Sui",
      "Guanghui Wang",
      "Li Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.07932",
    "title": "Towards Comprehensive Testing on the Robustness of Cooperative  Multi-agent Reinforcement Learning",
    "abstract": "While deep neural networks (DNNs) have strengthened the performance of cooperative multi-agent reinforcement learning (c-MARL), the agent policy can be easily perturbed by adversarial examples. Considering the safety critical applications of c-MARL, such as traffic management, power management and unmanned aerial vehicle control, it is crucial to test the robustness of c-MARL algorithm before it was deployed in reality. Existing adversarial attacks for MARL could be used for testing, but is limited to one robustness aspects (e.g., reward, state, action), while c-MARL model could be attacked from any aspect. To overcome the challenge, we propose MARLSafe, the first robustness testing framework for c-MARL algorithms. First, motivated by Markov Decision Process (MDP), MARLSafe consider the robustness of c-MARL algorithms comprehensively from three aspects, namely state robustness, action robustness and reward robustness. Any c-MARL algorithm must simultaneously satisfy these robustness aspects to be considered secure. Second, due to the scarceness of c-MARL attack, we propose c-MARL attacks as robustness testing algorithms from multiple aspects. Experiments on \\textit{SMAC} environment reveals that many state-of-the-art c-MARL algorithms are of low robustness in all aspect, pointing out the urgent need to test and enhance robustness of c-MARL algorithms. ",
    "url": "https://arxiv.org/abs/2204.07932",
    "authors": [
      "Jun Guo",
      "Yonghong Chen",
      "Yihang Hao",
      "Zixin Yin",
      "Yin Yu",
      "Simin Li"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07935",
    "title": "Causal Intervention for Subject-Deconfounded Facial Action Unit  Recognition",
    "abstract": "Subject-invariant facial action unit (AU) recognition remains challenging for the reason that the data distribution varies among subjects. In this paper, we propose a causal inference framework for subject-invariant facial action unit recognition. To illustrate the causal effect existing in AU recognition task, we formulate the causalities among facial images, subjects, latent AU semantic relations, and estimated AU occurrence probabilities via a structural causal model. By constructing such a causal diagram, we clarify the causal effect among variables and propose a plug-in causal intervention module, CIS, to deconfound the confounder \\emph{Subject} in the causal diagram. Extensive experiments conducted on two commonly used AU benchmark datasets, BP4D and DISFA, show the effectiveness of our CIS, and the model with CIS inserted, CISNet, has achieved state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2204.07935",
    "authors": [
      "Yingjie Chen",
      "Diqi Chen",
      "Tao Wang",
      "Yizhou Wang",
      "Yun Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.07936",
    "title": "Robust Task Planning for Assembly Lines with Human-Robot Collaboration",
    "abstract": "Efficient and robust task planning for a human-robot collaboration (HRC) system remains challenging. The human-aware task planner needs to assign jobs to both robots and human workers so that they can work collaboratively to achieve better time efficiency. However, the complexity of the tasks and the stochastic nature of the human collaborators bring challenges to such task planning. To reduce the complexity of the planning problem, we utilize the hierarchical task model, which explicitly captures the sequential and parallel relationships of the task. We model human movements with the sigma-lognormal functions to account for human-induced uncertainties. A human action model adaptation scheme is applied during run-time, and it provides a measure for modeling the human-induced uncertainties. We propose a sampling-based method to estimate human job completion time uncertainties. Next, we propose a robust task planner, which formulates the planning problem as a robust optimization problem by considering the task structure and the uncertainties. We conduct simulations of a robot arm collaborating with a human worker in an electronics assembly setting. The results show that our proposed planner can reduce task completion time when human-induced uncertainties occur compared to the baseline planner. ",
    "url": "https://arxiv.org/abs/2204.07936",
    "authors": [
      "Jessica Leu",
      "Yujiao Cheng",
      "Changliu Liu",
      "Masayoshi Tomizuka"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.07937",
    "title": "Unsupervised Cross-Task Generalization via Retrieval Augmentation",
    "abstract": "Humans can perform unseen tasks by recalling relevant skills that are acquired previously and then generalizing them to the target tasks, even if there is no supervision at all. In this paper, we aim to improve such cross-task generalization ability of massive multi-task language models such as T0 (Sanh et al., 2021) in an unsupervised setting. We propose a retrieval-augmentation method named ReCross that takes a few unlabelled examples as queries to retrieve a small subset of upstream data and uses them to update the multi-task model for better generalization. Our empirical results show that the proposed ReCross consistently outperforms non-retrieval baselines by a significant margin. ",
    "url": "https://arxiv.org/abs/2204.07937",
    "authors": [
      "Bill Yuchen Lin",
      "Kangmin Tan",
      "Chris Miller",
      "Beiwen Tian",
      "Xiang Ren"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07940",
    "title": "WhyGen: Explaining ML-powered Code Generation by Referring to Training  Examples",
    "abstract": "Deep learning has demonstrated great abilities in various code generation tasks. However, despite the great convenience for some developers, many are concerned that the code generators may recite or closely mimic copyrighted training data without user awareness, leading to legal and ethical concerns. To ease this problem, we introduce a tool, named WhyGen, to explain the generated code by referring to training examples. Specifically, we first introduce a data structure, named inference fingerprint, to represent the decision process of the model when generating a prediction. The fingerprints of all training examples are collected offline and saved to a database. When the model is used at runtime for code generation, the most relevant training examples can be retrieved by querying the fingerprint database. Our experiments have shown that WhyGen is able to precisely notify the users about possible recitations and highly similar imitations with a top-10 accuracy of 81.21%. The demo video can be found at https://youtu.be/EtoQP6850To. ",
    "url": "https://arxiv.org/abs/2204.07940",
    "authors": [
      "Weixiang Yan",
      "Yuanchun Li"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.07964",
    "title": "Target-Relevant Knowledge Preservation for Multi-Source Domain Adaptive  Object Detection",
    "abstract": "Domain adaptive object detection (DAOD) is a promising way to alleviate performance drop of detectors in new scenes. Albeit great effort made in single source domain adaptation, a more generalized task with multiple source domains remains not being well explored, due to knowledge degradation during their combination. To address this issue, we propose a novel approach, namely target-relevant knowledge preservation (TRKP), to unsupervised multi-source DAOD. Specifically, TRKP adopts the teacher-student framework, where the multi-head teacher network is built to extract knowledge from labeled source domains and guide the student network to learn detectors in unlabeled target domain. The teacher network is further equipped with an adversarial multi-source disentanglement (AMSD) module to preserve source domain-specific knowledge and simultaneously perform cross-domain alignment. Besides, a holistic target-relevant mining (HTRM) scheme is developed to re-weight the source images according to the source-target relevance. By this means, the teacher network is enforced to capture target-relevant knowledge, thus benefiting decreasing domain shift when mentoring object detection in the target domain. Extensive experiments are conducted on various widely used benchmarks with new state-of-the-art scores reported, highlighting the effectiveness. ",
    "url": "https://arxiv.org/abs/2204.07964",
    "authors": [
      "Jiaxi Wu",
      "Jiaxin Chen",
      "Mengzhe He",
      "Yiru Wang",
      "Bo Li",
      "Bingqi Ma",
      "Weihao Gan",
      "Wei Wu",
      "Yali Wang",
      "Di Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.07965",
    "title": "Entropy-based Active Learning for Object Detection with Progressive  Diversity Constraint",
    "abstract": "Active learning is a promising alternative to alleviate the issue of high annotation cost in the computer vision tasks by consciously selecting more informative samples to label. Active learning for object detection is more challenging and existing efforts on it are relatively rare. In this paper, we propose a novel hybrid approach to address this problem, where the instance-level uncertainty and diversity are jointly considered in a bottom-up manner. To balance the computational complexity, the proposed approach is designed as a two-stage procedure. At the first stage, an Entropy-based Non-Maximum Suppression (ENMS) is presented to estimate the uncertainty of every image, which performs NMS according to the entropy in the feature space to remove predictions with redundant information gains. At the second stage, a diverse prototype (DivProto) strategy is explored to ensure the diversity across images by progressively converting it into the intra-class and inter-class diversities of the entropy-based class-specific prototypes. Extensive experiments are conducted on MS COCO and Pascal VOC, and the proposed approach achieves state of the art results and significantly outperforms the other counterparts, highlighting its superiority. ",
    "url": "https://arxiv.org/abs/2204.07965",
    "authors": [
      "Jiaxi Wu",
      "Jiaxin Chen",
      "Di Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.07969",
    "title": "Augmentation Invariance and Adaptive Sampling in Semantic Segmentation  of Agricultural Aerial Images",
    "abstract": "In this paper, we investigate the problem of Semantic Segmentation for agricultural aerial imagery. We observe that the existing methods used for this task are designed without considering two characteristics of the aerial data: (i) the top-down perspective implies that the model cannot rely on a fixed semantic structure of the scene, because the same scene may be experienced with different rotations of the sensor; (ii) there can be a strong imbalance in the distribution of semantic classes because the relevant objects of the scene may appear at extremely different scales (e.g., a field of crops and a small vehicle). We propose a solution to these problems based on two ideas: (i) we use together a set of suitable augmentation and a consistency loss to guide the model to learn semantic representations that are invariant to the photometric and geometric shifts typical of the top-down perspective (Augmentation Invariance); (ii) we use a sampling method (Adaptive Sampling) that selects the training images based on a measure of pixel-wise distribution of classes and actual network confidence. With an extensive set of experiments conducted on the Agriculture-Vision dataset, we demonstrate that our proposed strategies improve the performance of the current state-of-the-art method. ",
    "url": "https://arxiv.org/abs/2204.07969",
    "authors": [
      "Antonio Tavera",
      "Edoardo Arnaudo",
      "Carlo Masone",
      "Barbara Caputo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.07974",
    "title": "Anomaly Detection in Autonomous Driving: A Survey",
    "abstract": "Nowadays, there are outstanding strides towards a future with autonomous vehicles on our roads. While the perception of autonomous vehicles performs well under closed-set conditions, they still struggle to handle the unexpected. This survey provides an extensive overview of anomaly detection techniques based on camera, lidar, radar, multimodal and abstract object level data. We provide a systematization including detection approach, corner case level, ability for an online application, and further attributes. We outline the state-of-the-art and point out current research gaps. ",
    "url": "https://arxiv.org/abs/2204.07974",
    "authors": [
      "Daniel Bogdoll",
      "Maximilian Nitsche",
      "J. Marius Zöllner"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.08029",
    "title": "Deep Learning based Automatic Detection of Dicentric Chromosome",
    "abstract": "Automatic detection of dicentric chromosomes is an essential step to estimate radiation exposure and development of end to end emergency bio dosimetry systems. During accidents, a large amount of data is required to be processed for extensive testing to formulate a medical treatment plan for the masses, which requires this process to be automated. Current approaches require human adjustments according to the data and therefore need a human expert to calibrate the system. This paper proposes a completely data driven framework which requires minimum intervention of field experts and can be deployed in emergency cases with relative ease. Our approach involves YOLOv4 to detect the chromosomes and remove the debris in each image, followed by a classifier that differentiates between an analysable chromosome and a non-analysable one. Images are extracted from YOLOv4 based on the protocols described by WHO-BIODOSNET. The analysable chromosome is classified as Monocentric or Dicentric and an image is accepted for consideration of dose estimation based on the analysable chromosome count. We report an accuracy in dicentric identification of 94.33% on a 1:1 split of Dicentric and Monocentric Chromosomes. ",
    "url": "https://arxiv.org/abs/2204.08029",
    "authors": [
      "Angad Singh Wadhwa",
      "Nikhil Tyagi",
      "Pinaki Roy Chowdhury"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08081",
    "title": "Initial state reconstruction on graphs",
    "abstract": "The presence of noise is an intrinsic problem in acquisition processes for digital images. One way to enhance images is to combine the forward and backward diffusion equations. However, the latter problem is well known to be exponentially unstable with respect to any small perturbations on the final data. In this scenario, the final data can be regarded as a blurred image obtained from the forward process, and that image can be pixelated as a network. Therefore, we study in this work a regularization framework for the backward diffusion equation on graphs. Our aim is to construct a spectral graph-based solution based upon a cut-off projection. Stability and convergence results are provided together with some numerical experiments. ",
    "url": "https://arxiv.org/abs/2204.08081",
    "authors": [
      "Vo Anh Khoa",
      "Mai Thanh Nhat Truong",
      "Imhotep Hogan",
      "Roselyn Williams"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Spectral Theory (math.SP)"
    ]
  },
  {
    "id": "arXiv:2204.08084",
    "title": "Learning 3D Semantics from Pose-Noisy 2D Images with Hierarchical Full  Attention Network",
    "abstract": "We propose a novel framework to learn 3D point cloud semantics from 2D multi-view image observations containing pose error. On the one hand, directly learning from the massive, unstructured and unordered 3D point cloud is computationally and algorithmically more difficult than learning from compactly-organized and context-rich 2D RGB images. On the other hand, both LiDAR point cloud and RGB images are captured in standard automated-driving datasets. This motivates us to conduct a \"task transfer\" paradigm so that 3D semantic segmentation benefits from aggregating 2D semantic cues, albeit pose noises are contained in 2D image observations. Among all difficulties, pose noise and erroneous prediction from 2D semantic segmentation approaches are the main challenges for the task transfer. To alleviate the influence of those factor, we perceive each 3D point using multi-view images and for each single image a patch observation is associated. Moreover, the semantic labels of a block of neighboring 3D points are predicted simultaneously, enabling us to exploit the point structure prior to further improve the performance. A hierarchical full attention network~(HiFANet) is designed to sequentially aggregates patch, bag-of-frames and inter-point semantic cues, with hierarchical attention mechanism tailored for different level of semantic cues. Also, each preceding attention block largely reduces the feature size before feeding to the next attention block, making our framework slim. Experiment results on Semantic-KITTI show that the proposed framework outperforms existing 3D point cloud based methods significantly, it requires much less training data and exhibits tolerance to pose noise. The code is available at https://github.com/yuhanghe01/HiFANet. ",
    "url": "https://arxiv.org/abs/2204.08084",
    "authors": [
      "Yuhang He",
      "Lin Chen",
      "Junkun Xie",
      "Long Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08120",
    "title": "Neural Gaits: Learning Bipedal Locomotion via Control Barrier Functions  and Zero Dynamics Policies",
    "abstract": "This work presents Neural Gaits, a method for learning dynamic walking gaits through the enforcement of set invariance that can be refined episodically using experimental data from the robot. We frame walking as a set invariance problem enforceable via control barrier functions (CBFs) defined on the reduced-order dynamics quantifying the underactuated component of the robot: the zero dynamics. Our approach contains two learning modules: one for learning a policy that satisfies the CBF condition, and another for learning a residual dynamics model to refine imperfections of the nominal model. Importantly, learning only over the zero dynamics significantly reduces the dimensionality of the learning problem while using CBFs allows us to still make guarantees for the full-order system. The method is demonstrated experimentally on an underactuated bipedal robot, where we are able to show agile and dynamic locomotion, even with partially unknown dynamics. ",
    "url": "https://arxiv.org/abs/2204.08120",
    "authors": [
      "Ivan Dario Jimenez Rodriguez",
      "Noel Csomay-Shanklin",
      "Yisong Yue",
      "Aaron D. Ames"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.08134",
    "title": "A Practical Cross-Device Federated Learning Framework over 5G Networks",
    "abstract": "The concept of federated learning (FL) was first proposed by Google in 2016. Thereafter, FL has been widely studied for the feasibility of application in various fields due to its potential to make full use of data without compromising the privacy. However, limited by the capacity of wireless data transmission, the employment of federated learning on mobile devices has been making slow progress in practical. The development and commercialization of the 5th generation (5G) mobile networks has shed some light on this. In this paper, we analyze the challenges of existing federated learning schemes for mobile devices and propose a novel cross-device federated learning framework, which utilizes the anonymous communication technology and ring signature to protect the privacy of participants while reducing the computation overhead of mobile devices participating in FL. In addition, our scheme implements a contribution-based incentive mechanism to encourage mobile users to participate in FL. We also give a case study of autonomous driving. Finally, we present the performance evaluation of the proposed scheme and discuss some open issues in federated learning. ",
    "url": "https://arxiv.org/abs/2204.08134",
    "authors": [
      "Wenti Yang",
      "Naiyu Wang",
      "Zhitao Guan",
      "Longfei Wu",
      "Xiaojiang Du",
      "Mohsen Guizani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2204.08143",
    "title": "Detect Rumors in Microblog Posts for Low-Resource Domains via  Adversarial Contrastive Learning",
    "abstract": "Massive false rumors emerging along with breaking news or trending topics severely hinder the truth. Existing rumor detection approaches achieve promising performance on the yesterday`s news, since there is enough corpus collected from the same domain for model training. However, they are poor at detecting rumors about unforeseen events especially those propagated in different languages due to the lack of training data and prior knowledge (i.e., low-resource regimes). In this paper, we propose an adversarial contrastive learning framework to detect rumors by adapting the features learned from well-resourced rumor data to that of the low-resourced. Our model explicitly overcomes the restriction of domain and/or language usage via language alignment and a novel supervised contrastive training paradigm. Moreover, we develop an adversarial augmentation mechanism to further enhance the robustness of low-resource rumor representation. Extensive experiments conducted on two low-resource datasets collected from real-world microblog platforms demonstrate that our framework achieves much better performance than state-of-the-art methods and exhibits a superior capacity for detecting rumors at early stages. ",
    "url": "https://arxiv.org/abs/2204.08143",
    "authors": [
      "Hongzhan Lin",
      "Jing Ma",
      "Liangliang Chen",
      "Zhiwei Yang",
      "Mingfei Cheng",
      "Guang Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.08150",
    "title": "Characterizing and Understanding Distributed GNN Training on GPUs",
    "abstract": "Graph neural network (GNN) has been demonstrated to be a powerful model in many domains for its effectiveness in learning over graphs. To scale GNN training for large graphs, a widely adopted approach is distributed training which accelerates training using multiple computing nodes. Maximizing the performance is essential, but the execution of distributed GNN training remains preliminarily understood. In this work, we provide an in-depth analysis of distributed GNN training on GPUs, revealing several significant observations and providing useful guidelines for both software optimization and hardware optimization. ",
    "url": "https://arxiv.org/abs/2204.08150",
    "authors": [
      "Haiyang Lin",
      "Mingyu Yan",
      "Xiaocheng Yang",
      "Mo Zou",
      "Wenming Li",
      "Xiaochun Ye",
      "Dongrui Fan"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.08152",
    "title": "Back to the Future: Bidirectional Information Decoupling Network for  Multi-turn Dialogue Modeling",
    "abstract": "Multi-turn dialogue modeling as a challenging branch of natural language understanding (NLU), aims to build representations for machines to understand human dialogues, which provides a solid foundation for multiple downstream tasks. Recent studies of dialogue modeling commonly employ pre-trained language models (PrLMs) to encode the dialogue history as successive tokens, which is insufficient in capturing the temporal characteristics of dialogues. Therefore, we propose Bidirectional Information Decoupling Network (BiDeN) as a universal dialogue encoder, which explicitly incorporates both the past and future contexts and can be generalized to a wide range of dialogue-related tasks. Experimental results on datasets of different downstream tasks demonstrate the universality and effectiveness of our BiDeN. ",
    "url": "https://arxiv.org/abs/2204.08152",
    "authors": [
      "Yiyang Li",
      "Hai Zhao",
      "Zhuosheng Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.08159",
    "title": "Multi-scale Anomaly Detection for Big Time Series of Industrial Sensors",
    "abstract": "Given a multivariate big time series, can we detect anomalies as soon as they occur? Many existing works detect anomalies by learning how much a time series deviates away from what it should be in the reconstruction framework. However, most models have to cut the big time series into small pieces empirically since optimization algorithms cannot afford such a long series. The question is raised: do such cuts pollute the inherent semantic segments, like incorrect punctuation in sentences? Therefore, we propose a reconstruction-based anomaly detection method, MissGAN, iteratively learning to decode and encode naturally smooth time series in coarse segments, and finding out a finer segment from low-dimensional representations based on HMM. As a result, learning from multi-scale segments, MissGAN can reconstruct a meaningful and robust time series, with the help of adversarial regularization and extra conditional states. MissGAN does not need labels or only needs labels of normal instances, making it widely applicable. Experiments on industrial datasets of real water network sensors show our MissGAN outperforms the baselines with scalability. Besides, we use a case study on the CMU Motion dataset to demonstrate that our model can well distinguish unexpected gestures from a given conditional motion. ",
    "url": "https://arxiv.org/abs/2204.08159",
    "authors": [
      "Quan Ding",
      "Shenghua Liu",
      "Bin Zhou",
      "Huawei Shen",
      "Xueqi Cheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.08164",
    "title": "Robust End-to-end Speaker Diarization with Generic Neural Clustering",
    "abstract": "End-to-end speaker diarization approaches have shown exceptional performance over the traditional modular approaches. To further improve the performance of the end-to-end speaker diarization for real speech recordings, recently works have been proposed which integrate unsupervised clustering algorithms with the end-to-end neural diarization models. However, these methods have a number of drawbacks: 1) The unsupervised clustering algorithms cannot leverage the supervision from the available datasets; 2) The K-means-based unsupervised algorithms that are explored often suffer from the constraint violation problem; 3) There is unavoidable mismatch between the supervised training and the unsupervised inference. In this paper, a robust generic neural clustering approach is proposed that can be integrated with any chunk-level predictor to accomplish a fully supervised end-to-end speaker diarization model. Also, by leveraging the sequence modelling ability of a recurrent neural network, the proposed neural clustering approach can dynamically estimate the number of speakers during inference. Experimental show that when integrating an attractor-based chunk-level predictor, the proposed neural clustering approach can yield better Diarization Error Rate (DER) than the constrained K-means-based clustering approaches under the mismatched conditions. ",
    "url": "https://arxiv.org/abs/2204.08164",
    "authors": [
      "Chenyu Yang",
      "Yu Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.08166",
    "title": "TOD-CNN: An Effective Convolutional Neural Network for Tiny Object  Detection in Sperm Videos",
    "abstract": "The detection of tiny objects in microscopic videos is a problematic point, especially in large-scale experiments. For tiny objects (such as sperms) in microscopic videos, current detection methods face challenges in fuzzy, irregular, and precise positioning of objects. In contrast, we present a convolutional neural network for tiny object detection (TOD-CNN) with an underlying data set of high-quality sperm microscopic videos (111 videos, $>$ 278,000 annotated objects), and a graphical user interface (GUI) is designed to employ and test the proposed model effectively. TOD-CNN is highly accurate, achieving $85.60\\%$ AP$_{50}$ in the task of real-time sperm detection in microscopic videos. To demonstrate the importance of sperm detection technology in sperm quality analysis, we carry out relevant sperm quality evaluation metrics and compare them with the diagnosis results from medical doctors. ",
    "url": "https://arxiv.org/abs/2204.08166",
    "authors": [
      "Shuojia Zou",
      "Chen Li",
      "Hongzan Sun",
      "Peng Xu",
      "Jiawei Zhang",
      "Pingli Ma",
      "Yudong Yao",
      "Xinyu Huang",
      "Marcin Grzegorzek"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.08171",
    "title": "Distributed Neural Precoding for Hybrid mmWave MIMO Communications with  Limited Feedback",
    "abstract": "Hybrid precoding is a cost-efficient technique for millimeter wave (mmWave) massive multiple-input multiple-output (MIMO) communications. This paper proposes a deep learning approach by using a distributed neural network for hybrid analog-and-digital precoding design with limited feedback. The proposed distributed neural precoding network, called DNet, is committed to achieving two objectives. First, the DNet realizes channel state information (CSI) compression with a distributed architecture of neural networks, which enables practical deployment on multiple users. Specifically, this neural network is composed of multiple independent sub-networks with the same structure and parameters, which reduces both the number of training parameters and network complexity. Secondly, DNet learns the calculation of hybrid precoding from reconstructed CSI from limited feedback. Different from existing black-box neural network design, the DNet is specifically designed according to the data form of the matrix calculation of hybrid precoding. Simulation results show that the proposed DNet significantly improves the performance up to nearly 50% compared to traditional limited feedback precoding methods under the tests with various CSI compression ratios. ",
    "url": "https://arxiv.org/abs/2204.08171",
    "authors": [
      "Kai Wei",
      "Jindan Xu",
      "Wei Xu",
      "Ning Wang",
      "Dong Chen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.08175",
    "title": "Usage of specific attention improves change point detection",
    "abstract": "The change point is a moment of an abrupt alteration in the data distribution. Current methods for change point detection are based on recurrent neural methods suitable for sequential data. However, recent works show that transformers based on attention mechanisms perform better than standard recurrent models for many tasks. The most benefit is noticeable in the case of longer sequences. In this paper, we investigate different attentions for the change point detection task and proposed specific form of attention related to the task at hand. We show that using a special form of attention outperforms state-of-the-art results. ",
    "url": "https://arxiv.org/abs/2204.08175",
    "authors": [
      "Anna Dmitrienko",
      "Evgenia Romanenkova",
      "Alexey Zaytsev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.08182",
    "title": "Modality-Balanced Embedding for Video Retrieval",
    "abstract": "Video search has become the main routine for users to discover videos relevant to a text query on large short-video sharing platforms. During training a query-video bi-encoder model using online search logs, we identify a modality bias phenomenon that the video encoder almost entirely relies on text matching, neglecting other modalities of the videos such as vision, audio. This modality imbalanceresults from a) modality gap: the relevance between a query and a video text is much easier to learn as the query is also a piece of text, with the same modality as the video text; b) data bias: most training samples can be solved solely by text matching. Here we share our practices to improve the first retrieval stage including our solution for the modality imbalance issue. We propose MBVR (short for Modality Balanced Video Retrieval) with two key components: manually generated modality-shuffled (MS) samples and a dynamic margin (DM) based on visual relevance. They can encourage the video encoder to pay balanced attentions to each modality. Through extensive experiments on a real world dataset, we show empirically that our method is both effective and efficient in solving modality bias problem. We have also deployed our MBVR in a large video platform and observed statistically significant boost over a highly optimized baseline in an A/B test and manual GSB evaluations. ",
    "url": "https://arxiv.org/abs/2204.08182",
    "authors": [
      "Xun Wang",
      "Bingqing Ke",
      "Xuanping Li",
      "Fangyu Liu",
      "Mingyu Zhang",
      "Xiao Liang",
      "Qiushi Xiao",
      "Yue Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.08185",
    "title": "Completion Delay of Random Linear Network Coding in Full-Duplex Relay  Networks",
    "abstract": "As the next-generation wireless networks thrive, full-duplex and relaying techniques are combined to improve the network performance. Random linear network coding (RLNC) is another popular technique to enhance the efficiency and reliability in wireless communications. In this paper, in order to explore the potential of RLNC in full-duplex relay networks, we investigate two fundamental perfect RLNC schemes and theoretically analyze their completion delay performance. The first scheme is a straightforward application of conventional perfect RLNC studied in wireless broadcast, so it involves no additional process at the relay. Its performance serves as an upper bound among all perfect RLNC schemes. The other scheme allows sufficiently large buffer and unconstrained linear coding at the relay. It attains the optimal performance and serves as a lower bound among all RLNC schemes. For both schemes, closed-form formulae to characterize the expected completion delay at a single receiver as well as for the whole system are derived. Numerical results are also demonstrated to justify the theoretical characterizations, and compare the two new schemes with the existing one. ",
    "url": "https://arxiv.org/abs/2204.08185",
    "authors": [
      "Rina Su",
      "Qifu Tyler Sun",
      "Zhongshan Zhang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2204.08194",
    "title": "Phishing Fraud Detection on Ethereum using Graph Neural Network",
    "abstract": "Blockchain has widespread applications in the financial field but has also attracted increasing cybercrimes. Recently, phishing fraud has emerged as a major threat to blockchain security, calling for the development of effective regulatory strategies. Nowadays network science has been widely used in modeling Ethereum transaction data, further introducing the network representation learning technology to analyze the transaction patterns. In this paper, we consider phishing detection as a graph classification task and propose an end-to-end Phishing Detection Graph Neural Network framework (PDGNN). Specifically, we first construct a lightweight Ethereum transaction network and extract transaction subgraphs of collected phishing accounts. Then we propose an end-to-end detection model based on Chebyshev-GCN to precisely distinguish between normal and phishing accounts. Extensive experiments on five Ethereum datasets demonstrate that our PDGNN significantly outperforms general phishing detection methods and scales well in large transaction networks. ",
    "url": "https://arxiv.org/abs/2204.08194",
    "authors": [
      "Panpan Li",
      "Yunyi Xie",
      "Xinyao Xu",
      "Jiajun Zhou",
      "Qi Xuan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.08196",
    "title": "Self-Supervised Arbitrary-Scale Point Clouds Upsampling via Implicit  Neural Representation",
    "abstract": "Point clouds upsampling is a challenging issue to generate dense and uniform point clouds from the given sparse input. Most existing methods either take the end-to-end supervised learning based manner, where large amounts of pairs of sparse input and dense ground-truth are exploited as supervision information; or treat up-scaling of different scale factors as independent tasks, and have to build multiple networks to handle upsampling with varying factors. In this paper, we propose a novel approach that achieves self-supervised and magnification-flexible point clouds upsampling simultaneously. We formulate point clouds upsampling as the task of seeking nearest projection points on the implicit surface for seed points. To this end, we define two implicit neural functions to estimate projection direction and distance respectively, which can be trained by two pretext learning tasks. Experimental results demonstrate that our self-supervised learning based scheme achieves competitive or even better performance than supervised learning based state-of-the-art methods. The source code is publicly available at https://github.com/xnowbzhao/sapcu. ",
    "url": "https://arxiv.org/abs/2204.08196",
    "authors": [
      "Wenbo Zhao",
      "Xianming Liu",
      "Zhiwei Zhong",
      "Junjun Jiang",
      "Wei Gao",
      "Ge Li",
      "Xiangyang Ji"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2204.08198",
    "title": "UTNLP at SemEval-2022 Task 6: A Comparative Analysis of Sarcasm  Detection using generative-based and mutation-based data augmentation",
    "abstract": "Sarcasm is a term that refers to the use of words to mock, irritate, or amuse someone. It is commonly used on social media. The metaphorical and creative nature of sarcasm presents a significant difficulty for sentiment analysis systems based on affective computing. The methodology and results of our team, UTNLP, in the SemEval-2022 shared task 6 on sarcasm detection are presented in this paper. We put different models, and data augmentation approaches to the test and report on which one works best. The tests begin with traditional machine learning models and progress to transformer-based and attention-based models. We employed data augmentation based on data mutation and data generation. Using RoBERTa and mutation-based data augmentation, our best approach achieved an F1-sarcastic of 0.38 in the competition's evaluation phase. After the competition, we fixed our model's flaws and achieved an F1-sarcastic of 0.414. ",
    "url": "https://arxiv.org/abs/2204.08198",
    "authors": [
      "Amirhossein Abaskohi",
      "Arash Rasouli",
      "Tanin Zeraati",
      "Behnam Bahrak"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.08206",
    "title": "TigerLily: Finding drug interactions in silico with the Graph",
    "abstract": "Tigerlily is a TigerGraph based system designed to solve the drug interaction prediction task. In this machine learning task, we want to predict whether two drugs have an adverse interaction. Our framework allows us to solve this highly relevant real-world problem using graph mining techniques in these steps: (a) Using PyTigergraph we create a heterogeneous biological graph of drugs and proteins. (b) We calculate the personalized PageRank scores of drug nodes in the TigerGraph Cloud. (c) We embed the nodes using sparse non-negative matrix factorization of the personalized PageRank matrix. (d) Using the node embeddings we train a gradient boosting based drug interaction predictor. ",
    "url": "https://arxiv.org/abs/2204.08206",
    "authors": [
      "Benedek Rozemberczki"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2204.08226",
    "title": "Empirical Evaluation and Theoretical Analysis for Representation  Learning: A Survey",
    "abstract": "Representation learning enables us to automatically extract generic feature representations from a dataset to solve another machine learning task. Recently, extracted feature representations by a representation learning algorithm and a simple predictor have exhibited state-of-the-art performance on several machine learning tasks. Despite its remarkable progress, there exist various ways to evaluate representation learning algorithms depending on the application because of the flexibility of representation learning. To understand the current representation learning, we review evaluation methods of representation learning algorithms and theoretical analyses. On the basis of our evaluation survey, we also discuss the future direction of representation learning. Note that this survey is the extended version of Nozawa and Sato (2022). ",
    "url": "https://arxiv.org/abs/2204.08226",
    "authors": [
      "Kento Nozawa",
      "Issei Sato"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08227",
    "title": "The Devil is in the Frequency: Geminated Gestalt Autoencoder for  Self-Supervised Visual Pre-Training",
    "abstract": "The self-supervised Masked Image Modeling (MIM) schema, following \"mask-and-reconstruct\" pipeline of recovering contents from masked image, has recently captured the increasing interest in the multimedia community, owing to the excellent ability of learning visual representation from unlabeled data. Aiming at learning representations with high semantics abstracted, a group of works attempts to reconstruct non-semantic pixels with large-ratio masking strategy, which may suffer from \"over-smoothing\" problem, while others directly infuse semantics into targets in off-line way requiring extra data. Different from them, we shift the perspective to the Fourier domain which naturally has global perspective and present a new Masked Image Modeling (MIM), termed Geminated Gestalt Autoencoder (Ge$^2$-AE) for visual pre-training. Specifically, we equip our model with geminated decoders in charge of reconstructing image contents from both pixel and frequency space, where each other serves as not only the complementation but also the reciprocal constraints. Through this way, more robust representations can be learned in the pre-trained encoders, of which the effectiveness is confirmed by the juxtaposing experimental results on downstream recognition tasks. We also conduct several quantitative and qualitative experiments to investigate the learning behavior of our method. To our best knowledge, this is the first MIM work to solve the visual pre-training through the lens of frequency domain. ",
    "url": "https://arxiv.org/abs/2204.08227",
    "authors": [
      "Hao Liu",
      "Xinghua Jiang",
      "Xin Li",
      "Antai Guo",
      "Deqiang Jiang",
      "Bo Ren"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08229",
    "title": "Preference Enhanced Social Influence Modeling for Network-Aware Cascade  Prediction",
    "abstract": "Network-aware cascade size prediction aims to predict the final reposted number of user-generated information via modeling the propagation process in social networks. Estimating the user's reposting probability by social influence, namely state activation plays an important role in the information diffusion process. Therefore, Graph Neural Networks (GNN), which can simulate the information interaction between nodes, has been proved as an effective scheme to handle this prediction task. However, existing studies including GNN-based models usually neglect a vital factor of user's preference which influences the state activation deeply. To that end, we propose a novel framework to promote cascade size prediction by enhancing the user preference modeling according to three stages, i.e., preference topics generation, preference shift modeling, and social influence activation. Our end-to-end method makes the user activating process of information diffusion more adaptive and accurate. Extensive experiments on two large-scale real-world datasets have clearly demonstrated the effectiveness of our proposed model compared to state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2204.08229",
    "authors": [
      "Likang Wu",
      "Hao Wang",
      "Enhong Chen",
      "Zhi Li",
      "Hongke Zhao",
      "Jianhui Ma"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2204.08237",
    "title": "Modx: Binary Level Partial Imported Third-Party Library Detection  through Program Modularization and Semantic Matching",
    "abstract": "With the rapid growth of software, using third-party libraries (TPLs) has become increasingly popular. The prosperity of the library usage has provided the software engineers with handful of methods to facilitate and boost the program development. Unfortunately, it also poses great challenges as it becomes much more difficult to manage the large volume of libraries. Researches and studies have been proposed to detect and understand the TPLs in the software. However, most existing approaches rely on syntactic features, which are not robust when these features are changed or deliberately hidden by the adversarial parties. Moreover, these approaches typically model each of the imported libraries as a whole, therefore, cannot be applied to scenarios where the host software only partially uses the library code segments. To detect both fully and partially imported TPLs at the semantic level, we propose ModX, a framework that leverages novel program modularization techniques to decompose the program into finegrained functionality-based modules. By extracting both syntactic and semantic features, it measures the distance between modules to detect similar library module reuse in the program. Experimental results show that ModX outperforms other modularization tools by distinguishing more coherent program modules with 353% higher module quality scores and beats other TPL detection tools with on average 17% better in precision and 8% better in recall. ",
    "url": "https://arxiv.org/abs/2204.08237",
    "authors": [
      "Can Yang",
      "Zhengzi Xu",
      "Hongxu Chen",
      "Yang Liu",
      "Xiaorui Gong",
      "Baoxu Liu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.08241",
    "title": "GNN-encoder: Learning a Dual-encoder Architecture via Graph Neural  Networks for Passage Retrieval",
    "abstract": "Recently, retrieval models based on dense representations are dominant in passage retrieval tasks, due to their outstanding ability in terms of capturing semantics of input text compared to the traditional sparse vector space models. A common practice of dense retrieval models is to exploit a dual-encoder architecture to represent a query and a passage independently. Though efficient, such a structure loses interaction between the query-passage pair, resulting in inferior accuracy. To enhance the performance of dense retrieval models without loss of efficiency, we propose a GNN-encoder model in which query (passage) information is fused into passage (query) representations via graph neural networks that are constructed by queries and their top retrieved passages. By this means, we maintain a dual-encoder structure, and retain some interaction information between query-passage pairs in their representations, which enables us to achieve both efficiency and efficacy in passage retrieval. Evaluation results indicate that our method significantly outperforms the existing models on MSMARCO, Natural Questions and TriviaQA datasets, and achieves the new state-of-the-art on these datasets. ",
    "url": "https://arxiv.org/abs/2204.08241",
    "authors": [
      "Jiduan Liu",
      "Jiahao Liu",
      "Yang Yang",
      "Jingang Wang",
      "Wei Wu",
      "Dongyan Zhao",
      "Rui Yan"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2204.08247",
    "title": "Joint Multi-view Unsupervised Feature Selection and Graph Learning",
    "abstract": "Despite the recent progress, the existing multi-view unsupervised feature selection methods mostly suffer from two limitations. First, they generally utilize either cluster structure or similarity structure to guide the feature selection, neglecting the possibility of a joint formulation with mutual benefits. Second, they often learn the similarity structure by either global structure learning or local structure learning, lacking the capability of graph learning with both global and local structural awareness. In light of this, this paper presents a joint multi-view unsupervised feature selection and graph learning (JMVFG) approach. Particularly, we formulate the multi-view feature selection with orthogonal decomposition, where each target matrix is decomposed into a view-specific basis matrix and a view-consistent cluster indicator. Cross-space locality preservation is incorporated to bridge the cluster structure learning in the projected space and the similarity learning (i.e., graph learning) in the original space. Further, a unified objective function is presented to enable the simultaneous learning of the cluster structure, the global and local similarity structures, and the multi-view consistency and inconsistency, upon which an alternating optimization algorithm is developed with theoretically proved convergence. Extensive experiments demonstrate the superiority of our approach for both multi-view feature selection and graph learning tasks. ",
    "url": "https://arxiv.org/abs/2204.08247",
    "authors": [
      "Si-Guo Fang",
      "Dong Huang",
      "Chang-Dong Wang",
      "Yong Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.08254",
    "title": "Deterministic Low-Diameter Decompositions for Weighted Graphs and  Distributed and Parallel Applications",
    "abstract": "This paper presents new deterministic and distributed low-diameter decomposition algorithms for weighted graphs. In particular, we show that if one can efficiently compute approximate distances in a parallel or a distributed setting, one can also efficiently compute low-diameter decompositions. This consequently implies solutions to many fundamental distance based problems using a polylogarithmic number of approximate distance computations. Our low-diameter decomposition generalizes and extends the line of work starting from [Rozho\\v{n}, Ghaffari STOC 2020] to weighted graphs in a very model-independent manner. Moreover, our clustering results have additional useful properties, including strong-diameter guarantees, separation properties, restricting cluster centers to specified terminals, and more. Applications include: -- The first near-linear work and polylogarithmic depth randomized and deterministic parallel algorithm for low-stretch spanning trees (LSST) with polylogarithmic stretch. Previously, the best parallel LSST algorithm required $m \\cdot n^{o(1)}$ work and $n^{o(1)}$ depth and was inherently randomized. No deterministic LSST algorithm with truly sub-quadratic work and sub-linear depth was known. -- The first near-linear work and polylogarithmic depth deterministic algorithm for computing an $\\ell_1$-embedding into polylogarithmic dimensional space with polylogarithmic distortion. The best prior deterministic algorithms for $\\ell_1$-embeddings either require large polynomial work or are inherently sequential. Even when we apply our techniques to the classical problem of computing a ball-carving with strong-diameter $O(\\log^2 n)$ in an unweighted graph, our new clustering algorithm still leads to an improvement in round complexity from $O(\\log^{10} n)$ rounds [Chang, Ghaffari PODC 21] to $O(\\log^{4} n)$. ",
    "url": "https://arxiv.org/abs/2204.08254",
    "authors": [
      "Michael Elkin",
      "Bernhard Haeupler",
      "Václav Rozhoň",
      "Christoph Grunau"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2204.08279",
    "title": "Communication Bounds for Convolutional Neural Networks",
    "abstract": "Convolutional neural networks (CNNs) are important in a wide variety of machine learning tasks and applications, so optimizing their performance is essential. Moving words of data between levels of a memory hierarchy or between processors on a network is much more expensive than the cost of arithmetic, so minimizing communication is critical to optimizing performance. In this paper, we present new lower bounds on data movement for mixed precision convolutions in both single-processor and parallel distributed memory models, as well as algorithms that outperform current implementations such as Im2Col. We obtain performance figures using GEMMINI, a machine learning accelerator, where our tiling provides improvements between 13% and 150% over a vendor supplied algorithm. ",
    "url": "https://arxiv.org/abs/2204.08279",
    "authors": [
      "Anthony Chen",
      "James Demmel",
      "Grace Dinh",
      "Mason Haberle",
      "Olga Holtz"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computational Complexity (cs.CC)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2204.08280",
    "title": "Non-intrusive reduced-order modeling using convolutional autoencoders",
    "abstract": "The use of reduced-order models (ROMs) in physics-based modeling and simulation almost always involves the use of linear reduced basis (RB) methods such as the proper orthogonal decomposition (POD). For some nonlinear problems, linear RB methods perform poorly, failing to provide an efficient subspace for the solution space. The use of nonlinear manifolds for ROMs has gained traction in recent years, showing increased performance for certain nonlinear problems over linear methods. Deep learning has been popular to this end through the use of autoencoders for providing a nonlinear trial manifold for the solution space. In this work, we present a non-intrusive ROM framework for steady-state parameterized partial differential equations (PDEs) that uses convolutional autoencoders (CAEs) to provide a nonlinear solution manifold and is augmented by Gaussian process regression (GPR) to approximate the expansion coefficients of the reduced model. When applied to a numerical example involving the steady incompressible Navier-Stokes equations solving a lid-driven cavity problem, it is shown that the proposed ROM offers greater performance in prediction of full-order states when compared to a popular method employing POD and GPR over a number of ROM dimensions. ",
    "url": "https://arxiv.org/abs/2204.08280",
    "authors": [
      "Rakesh Halder",
      "Krzysztof Fidkowski",
      "Kevin Maki"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2204.08286",
    "title": "A Novel Multi-Task Learning Empowered Codebook Design for Downlink SCMA  Networks",
    "abstract": "Sparse code multiple access (SCMA) is a promising code-domain non-orthogonal multiple access (NOMA) scheme for the enabling of massive machine-type communication. In SCMA, the design of good sparse codebooks and efficient multiuser decoding have attracted tremendous research attention in the past few years. This paper aims to leverage deep learning to jointly design the downlink SCMA encoder and decoder with the aid of autoencoder. We introduce a novel end-to-end learning based SCMA (E2E-SCMA) design framework, under which improved sparse codebooks and low-complexity decoder are obtained. Compared to conventional SCMA schemes, our numerical results show that the proposed E2E-SCMA leads to significant improvements in terms of error rate and computational complexity. ",
    "url": "https://arxiv.org/abs/2204.08286",
    "authors": [
      "Qu Luo",
      "Zilong Liu",
      "Gaojie Chen",
      "Yi Ma",
      "Pei Xiao"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.08292",
    "title": "StepGame: A New Benchmark for Robust Multi-Hop Spatial Reasoning in  Texts",
    "abstract": "Inferring spatial relations in natural language is a crucial ability an intelligent system should possess. The bAbI dataset tries to capture tasks relevant to this domain (task 17 and 19). However, these tasks have several limitations. Most importantly, they are limited to fixed expressions, they are limited in the number of reasoning steps required to solve them, and they fail to test the robustness of models to input that contains irrelevant or redundant information. In this paper, we present a new Question-Answering dataset called StepGame for robust multi-hop spatial reasoning in texts. Our experiments demonstrate that state-of-the-art models on the bAbI dataset struggle on the StepGame dataset. Moreover, we propose a Tensor-Product based Memory-Augmented Neural Network (TP-MANN) specialized for spatial reasoning tasks. Experimental results on both datasets show that our model outperforms all the baselines with superior generalization and robustness performance. ",
    "url": "https://arxiv.org/abs/2204.08292",
    "authors": [
      "Zhengxiang Shi",
      "Qiang Zhang",
      "Aldo Lipani"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.08306",
    "title": "A Convergence Analysis of Nesterov's Accelerated Gradient Method in  Training Deep Linear Neural Networks",
    "abstract": "Momentum methods, including heavy-ball~(HB) and Nesterov's accelerated gradient~(NAG), are widely used in training neural networks for their fast convergence. However, there is a lack of theoretical guarantees for their convergence and acceleration since the optimization landscape of the neural network is non-convex. Nowadays, some works make progress towards understanding the convergence of momentum methods in an over-parameterized regime, where the number of the parameters exceeds that of the training instances. Nonetheless, current results mainly focus on the two-layer neural network, which are far from explaining the remarkable success of the momentum methods in training deep neural networks. Motivated by this, we investigate the convergence of NAG with constant learning rate and momentum parameter in training two architectures of deep linear networks: deep fully-connected linear neural networks and deep linear ResNets. Based on the over-parameterization regime, we first analyze the residual dynamics induced by the training trajectory of NAG for a deep fully-connected linear neural network under the random Gaussian initialization. Our results show that NAG can converge to the global minimum at a $(1 - \\mathcal{O}(1/\\sqrt{\\kappa}))^t$ rate, where $t$ is the iteration number and $\\kappa > 1$ is a constant depending on the condition number of the feature matrix. Compared to the $(1 - \\mathcal{O}(1/{\\kappa}))^t$ rate of GD, NAG achieves an acceleration over GD. To the best of our knowledge, this is the first theoretical guarantee for the convergence of NAG to the global minimum in training deep neural networks. Furthermore, we extend our analysis to deep linear ResNets and derive a similar convergence result. ",
    "url": "https://arxiv.org/abs/2204.08306",
    "authors": [
      "Xin Liu",
      "Wei Tao",
      "Zhisong Pan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2204.08307",
    "title": "Heavy Rain Face Image Restoration: Integrating Physical Degradation  Model and Facial Component Guided Adversarial Learning",
    "abstract": "With the recent increase in intelligent CCTVs for visual surveillance, a new image degradation that integrates resolution conversion and synthetic rain models is required. For example, in heavy rain, face images captured by CCTV from a distance have significant deterioration in both visibility and resolution. Unlike traditional image degradation models (IDM), such as rain removal and superresolution, this study addresses a new IDM referred to as a scale-aware heavy rain model and proposes a method for restoring high-resolution face images (HR-FIs) from low-resolution heavy rain face images (LRHR-FI). To this end, a 2-stage network is presented. The first stage generates low-resolution face images (LR-FIs), from which heavy rain has been removed from the LRHR-FIs to improve visibility. To realize this, an interpretable IDM-based network is constructed to predict physical parameters, such as rain streaks, transmission maps, and atmospheric light. In addition, the image reconstruction loss is evaluated to enhance the estimates of the physical parameters. For the second stage, which aims to reconstruct the HR-FIs from the LR-FIs outputted in the first stage, facial component guided adversarial learning (FCGAL) is applied to boost facial structure expressions. To focus on informative facial features and reinforce the authenticity of facial components, such as the eyes and nose, a face-parsing-guided generator and facial local discriminators are designed for FCGAL. The experimental results verify that the proposed approach based on physical-based network design and FCGAL can remove heavy rain and increase the resolution and visibility simultaneously. Moreover, the proposed heavy-rain face image restoration outperforms state-of-the-art models of heavy rain removal, image-to-image translation, and superresolution. ",
    "url": "https://arxiv.org/abs/2204.08307",
    "authors": [
      "Chang-Hwan Son",
      "Da-Hee Jeong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08319",
    "title": "Backward Reachability Analysis for Neural Feedback Loops",
    "abstract": "The increasing prevalence of neural networks (NNs) in safety-critical applications calls for methods to certify their behavior and guarantee safety. This paper presents a backward reachability approach for safety verification of neural feedback loops (NFLs), i.e., closed-loop systems with NN control policies. While recent works have focused on forward reachability as a strategy for safety certification of NFLs, backward reachability offers advantages over the forward strategy, particularly in obstacle avoidance scenarios. Prior works have developed techniques for backward reachability analysis for systems without NNs, but the presence of NNs in the feedback loop presents a unique set of problems due to the nonlinearities in their activation functions and because NN models are generally not invertible. To overcome these challenges, we use existing forward NN analysis tools to find affine bounds on the control inputs and solve a series of linear programs (LPs) to efficiently find an approximation of the backprojection (BP) set, i.e., the set of states for which the NN control policy will drive the system to a given target set. We present an algorithm to iteratively find BP set estimates over a given time horizon and demonstrate the ability to reduce conservativeness in the BP set estimates by up to 88% with low additional computational cost. We use numerical results from a double integrator model to verify the efficacy of these algorithms and demonstrate the ability to certify safety for a linearized ground robot model in a collision avoidance scenario where forward reachability fails. ",
    "url": "https://arxiv.org/abs/2204.08319",
    "authors": [
      "Nicholas Rober",
      "Michael Everett",
      "Jonathan P. How"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.08352",
    "title": "MHSCNet: A Multimodal Hierarchical Shot-aware Convolutional Network for  Video Summarization",
    "abstract": "Video summarization intends to produce a concise video summary by effectively capturing and combining the most informative parts of the whole content. Existing approaches for video summarization regard the task as a frame-wise keyframe selection problem and generally construct the frame-wise representation by combining the long-range temporal dependency with the unimodal or bimodal information. However, the optimal video summaries need to reflect the most valuable keyframe with its own information, and one with semantic power of the whole content. Thus, it is critical to construct a more powerful and robust frame-wise representation and predict the frame-level importance score in a fair and comprehensive manner. To tackle the above issues, we propose a multimodal hierarchical shot-aware convolutional network, denoted as MHSCNet, to enhance the frame-wise representation via combining the comprehensive available multimodal information. Specifically, we design a hierarchical ShotConv network to incorporate the adaptive shot-aware frame-level representation by considering the short-range and long-range temporal dependency. Based on the learned shot-aware representations, MHSCNet can predict the frame-level importance score in the local and global view of the video. Extensive experiments on two standard video summarization datasets demonstrate that our proposed method consistently outperforms state-of-the-art baselines. Source code will be made publicly available. ",
    "url": "https://arxiv.org/abs/2204.08352",
    "authors": [
      "Wujiang Xu",
      "Shaoshuai Li",
      "Qiongxu Ma",
      "Yunan Zhao",
      "Sheng Guo",
      "jeff little Guo",
      "Bing Han",
      "Junchi Yan",
      "Yifei Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08360",
    "title": "Zero-Shot Program Representation Learning",
    "abstract": "Learning program representations has been the core prerequisite of code intelligent tasks such as code search and code clone detection. The state-of-the-art pre-trained models such as CodeBERT require the availability of large-scale code corpora. However, gathering training samples can be costly and infeasible for domain-specific languages such as Solidity for smart contracts. In this paper, we propose Zecoler, a zero-shot learning approach for code representations. Zecoler is built upon a pre-trained programming language model. In order to elicit knowledge from the pre-trained models efficiently, Zecoler casts the downstream tasks to the same form of pre-training tasks by inserting trainable prompts into the original input. Then, it employs the prompt learning technique which optimizes the pre-trained model by merely adjusting the original input. This enables the representation model to efficiently fit the scarce task-oriented data while reusing pre-trained knowledge. We evaluate Zecoler in three code intelligent tasks in two program languages that have no training samples, namely, Solidity and Go, with model trained in corpora of common languages such as Java. Experimental results show that our approach significantly outperforms baseline models in both zero-shot and few-shot settings. ",
    "url": "https://arxiv.org/abs/2204.08360",
    "authors": [
      "Nan Cui",
      "Yuze Jiang",
      "Xiaodong Gu",
      "Beijun Shen"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.08381",
    "title": "Multiple-environment Self-adaptive Network for Aerial-view  Geo-localization",
    "abstract": "Aerial-view geo-localization tends to determine an unknown position through matching the drone-view image with the geo-tagged satellite-view image. This task is mostly regarded as an image retrieval problem. The key underpinning this task is to design a series of deep neural networks to learn discriminative image descriptors. However, existing methods meet large performance drops under realistic weather, such as rain and fog, since they do not take the domain shift between the training data and multiple test environments into consideration. To minor this domain gap, we propose a Multiple-environment Self-adaptive Network (MuSe-Net) to dynamically adjust the domain shift caused by environmental changing. In particular, MuSe-Net employs a two-branch neural network containing one multiple-environment style extraction network and one self-adaptive feature extraction network. As the name implies, the multiple-environment style extraction network is to extract the environment-related style information, while the self-adaptive feature extraction network utilizes an adaptive modulation module to dynamically minimize the environment-related style gap. Extensive experiments on two widely-used benchmarks, i.e., University-1652 and CVUSA, demonstrate that the proposed MuSe-Net achieves a competitive result for geo-localization in multiple environments. Furthermore, we observe that the proposed method also shows great potential to the unseen extreme weather, such as mixing the fog, rain and snow. ",
    "url": "https://arxiv.org/abs/2204.08381",
    "authors": [
      "Tingyu Wang",
      "Zhedong Zheng",
      "Yaoqi Sun",
      "Tat-Seng Chua",
      "Yi Yang",
      "Chenggang Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08382",
    "title": "Subspace Nonnegative Matrix Factorization for Feature Representation",
    "abstract": "Traditional nonnegative matrix factorization (NMF) learns a new feature representation on the whole data space, which means treating all features equally. However, a subspace is often sufficient for accurate representation in practical applications, and redundant features can be invalid or even harmful. For example, if a camera has some sensors destroyed, then the corresponding pixels in the photos from this camera are not helpful to identify the content, which means only the subspace consisting of remaining pixels is worthy of attention. This paper proposes a new NMF method by introducing adaptive weights to identify key features in the original space so that only a subspace involves generating the new representation. Two strategies are proposed to achieve this: the fuzzier weighted technique and entropy regularized weighted technique, both of which result in an iterative solution with a simple form. Experimental results on several real-world datasets demonstrated that the proposed methods can generate a more accurate feature representation than existing methods. The code developed in this study is available at https://github.com/WNMF1/FWNMF-ERWNMF. ",
    "url": "https://arxiv.org/abs/2204.08382",
    "authors": [
      "Junhang Li",
      "Jiao Wei",
      "Can Tong",
      "Tingting Shen",
      "Yuchen Liu",
      "Chen Li",
      "Shouliang Qi",
      "Yudong Yao",
      "Yueyang Teng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.08394",
    "title": "CenterNet++ for Object Detection",
    "abstract": "There are two mainstreams for object detection: top-down and bottom-up. The state-of-the-art approaches mostly belong to the first category. In this paper, we demonstrate that the bottom-up approaches are as competitive as the top-down and enjoy higher recall. Our approach, named CenterNet, detects each object as a triplet keypoints (top-left and bottom-right corners and the center keypoint). We firstly group the corners by some designed cues and further confirm the objects by the center keypoints. The corner keypoints equip the approach with the ability to detect objects of various scales and shapes and the center keypoint avoids the confusion brought by a large number of false-positive proposals. Our approach is a kind of anchor-free detector because it does not need to define explicit anchor boxes. We adapt our approach to the backbones with different structures, i.e., the 'hourglass' like networks and the the 'pyramid' like networks, which detect objects on a single-resolution feature map and multi-resolution feature maps, respectively. On the MS-COCO dataset, CenterNet with Res2Net-101 and Swin-Transformer achieves APs of 53.7% and 57.1%, respectively, outperforming all existing bottom-up detectors and achieving state-of-the-art. We also design a real-time CenterNet, which achieves a good trade-off between accuracy and speed with an AP of 43.6% at 30.5 FPS. https://github.com/Duankaiwen/PyCenterNet. ",
    "url": "https://arxiv.org/abs/2204.08394",
    "authors": [
      "Kaiwen Duan",
      "Song Bai",
      "Lingxi Xie",
      "Honggang Qi",
      "Qingming Huang",
      "Qi Tian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.08398",
    "title": "L3Cube-HingCorpus and HingBERT: A Code Mixed Hindi-English Dataset and  BERT Language Models",
    "abstract": "Code-switching occurs when more than one language is mixed in a given sentence or a conversation. This phenomenon is more prominent on social media platforms and its adoption is increasing over time. Therefore code-mixed NLP has been extensively studied in the literature. As pre-trained transformer-based architectures are gaining popularity, we observe that real code-mixing data are scarce to pre-train large language models. We present L3Cube-HingCorpus, the first large-scale real Hindi-English code mixed data in a Roman script. It consists of 52.93M sentences and 1.04B tokens, scraped from Twitter. We further present HingBERT, HingMBERT, HingRoBERTa, and HingGPT. The BERT models have been pre-trained on codemixed HingCorpus using masked language modelling objectives. We show the effectiveness of these BERT models on the subsequent downstream tasks like code-mixed sentiment analysis, POS tagging, NER, and LID from the GLUECoS benchmark. The HingGPT is a GPT2 based generative transformer model capable of generating full tweets. We also release L3Cube-HingLID Corpus, the largest code-mixed Hindi-English language identification(LID) dataset and HingBERT-LID, a production-quality LID model to facilitate capturing of more code-mixed data using the process outlined in this work. The dataset and models are available at https://github.com/l3cube-pune/code-mixed-nlp . ",
    "url": "https://arxiv.org/abs/2204.08398",
    "authors": [
      "Ravindra Nayak",
      "Raviraj Joshi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.08400",
    "title": "Dynamic Network Adaptation at Inference",
    "abstract": "Machine learning (ML) inference is a real-time workload that must comply with strict Service Level Objectives (SLOs), including latency and accuracy targets. Unfortunately, ensuring that SLOs are not violated in inference-serving systems is challenging due to inherent model accuracy-latency tradeoffs, SLO diversity across and within application domains, evolution of SLOs over time, unpredictable query patterns, and co-location interference. In this paper, we observe that neural networks exhibit high degrees of per-input activation sparsity during inference. . Thus, we propose SLO-Aware Neural Networks which dynamically drop out nodes per-inference query, thereby tuning the amount of computation performed, according to specified SLO optimization targets and machine utilization. SLO-Aware Neural Networks achieve average speedups of $1.3-56.7\\times$ with little to no accuracy loss (less than 0.3%). When accuracy constrained, SLO-Aware Neural Networks are able to serve a range of accuracy targets at low latency with the same trained model. When latency constrained, SLO-Aware Neural Networks can proactively alleviate latency degradation from co-location interference while maintaining high accuracy to meet latency constraints. ",
    "url": "https://arxiv.org/abs/2204.08400",
    "authors": [
      "Daniel Mendoza",
      "Caroline Trippel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2204.08401",
    "title": "TranS: Transition-based Knowledge Graph Embedding with Synthetic  Relation Representation",
    "abstract": "Knowledge graph embedding (KGE) aims to learn continuous vectors of relations and entities in knowledge graph. Recently, transition-based KGE methods have achieved promising performance, where the single relation vector learns to translate head entity to tail entity. However, this scoring pattern is not suitable for complex scenarios where the same entity pair has different relations. Previous models usually focus on the improvement of entity representation for 1-to-N, N-to-1 and N-to-N relations, but ignore the single relation vector. In this paper, we propose a novel transition-based method, TranS, for knowledge graph embedding. The single relation vector in traditional scoring patterns is replaced with synthetic relation representation, which can solve these issues effectively and efficiently. Experiments on a large knowledge graph dataset, ogbl-wikikg2, show that our model achieves state-of-the-art results. ",
    "url": "https://arxiv.org/abs/2204.08401",
    "authors": [
      "Xuanyu Zhang",
      "Qing Yang",
      "Dongliang Xu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.08414",
    "title": "STONet: A Neural-Operator-Driven Spatio-temporal Network",
    "abstract": "Graph-based spatio-temporal neural networks are effective to model the spatial dependency among discrete points sampled irregularly from unstructured grids, thanks to the great expressiveness of graph neural networks. However, these models are usually spatially-transductive -- only fitting the signals for discrete spatial nodes fed in models but unable to generalize to `unseen' spatial points with zero-shot. In comparison, for forecasting tasks on continuous space such as temperature prediction on the earth's surface, the \\textit{spatially-inductive} property allows the model to generalize to any point in the spatial domain, demonstrating models' ability to learn the underlying mechanisms or physics laws of the systems, rather than simply fit the signals. Besides, in temporal domains, \\textit{irregularly-sampled} time series, e.g. data with missing values, urge models to be temporally-continuous. Motivated by the two issues, we propose a spatio-temporal framework based on neural operators for PDEs, which learn the underlying mechanisms governing the dynamics of spatially-continuous physical quantities. Experiments show our model's improved performance on forecasting spatially-continuous physic quantities, and its superior generalization to unseen spatial points and ability to handle temporally-irregular data. ",
    "url": "https://arxiv.org/abs/2204.08414",
    "authors": [
      "Haitao Lin",
      "Guojiang Zhao",
      "Lirong Wu",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.08444",
    "title": "Network Onion Divergence: Network representation and comparison using  nested configuration models with fixed connectivity, correlation and  centrality patterns",
    "abstract": "Random networks, constrained to reproduce specific features of networks, are often used to represent and analyze network data as well as their mathematical descriptions. Chief among them, the configuration model constrains random networks by their degree distribution and is foundational to many areas of network science. However, these representations are often selected based on intuition or mathematical and computational simplicity rather than on statistical evidence. To evaluate the quality of a network representation we need to consider both the amount of information required by a random network model as well as the probability of recovering the original data when using the model as a generative process. To this end, we calculate the approximate size of network ensembles generated by the popular configuration model and its generalizations that include degree-correlations and centrality layers based on the onion decomposition. We then apply minimum description length as a model selection criterion and also introduce the Network Onion Divergence: model selection and network comparison over a nested family of configuration models with differing level of structural details. Using over 100 empirical sets of network data, we find that a simple Layered Configuration Model offers the most compact representation of the majority of real networks. We hope that our results will continue to motivate the development of intricate random network models that help capture network structure beyond the simple degree distribution. ",
    "url": "https://arxiv.org/abs/2204.08444",
    "authors": [
      "Laurent Hébert-Dufresne",
      "Jean-Gabriel Young",
      "Alexander Daniels",
      "Antoine Allard"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2204.08453",
    "title": "Neural Space-filling Curves",
    "abstract": "We present Neural Space-filling Curves (SFCs), a data-driven approach to infer a context-based scan order for a set of images. Linear ordering of pixels forms the basis for many applications such as video scrambling, compression, and auto-regressive models that are used in generative modeling for images. Existing algorithms resort to a fixed scanning algorithm such as Raster scan or Hilbert scan. Instead, our work learns a spatially coherent linear ordering of pixels from the dataset of images using a graph-based neural network. The resulting Neural SFC is optimized for an objective suitable for the downstream task when the image is traversed along with the scan line order. We show the advantage of using Neural SFCs in downstream applications such as image compression. Code and additional results will be made available at https://hywang66.github.io/publication/neuralsfc. ",
    "url": "https://arxiv.org/abs/2204.08453",
    "authors": [
      "Hanyu Wang",
      "Kamal Gupta",
      "Larry Davis",
      "Abhinav Shrivastava"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08454",
    "title": "Revisiting Consistency Regularization for Semi-supervised Change  Detection in Remote Sensing Images",
    "abstract": "Remote-sensing (RS) Change Detection (CD) aims to detect \"changes of interest\" from co-registered bi-temporal images. The performance of existing deep supervised CD methods is attributed to the large amounts of annotated data used to train the networks. However, annotating large amounts of remote sensing images is labor-intensive and expensive, particularly with bi-temporal images, as it requires pixel-wise comparisons by a human expert. On the other hand, we often have access to unlimited unlabeled multi-temporal RS imagery thanks to ever-increasing earth observation programs. In this paper, we propose a simple yet effective way to leverage the information from unlabeled bi-temporal images to improve the performance of CD approaches. More specifically, we propose a semi-supervised CD model in which we formulate an unsupervised CD loss in addition to the supervised Cross-Entropy (CE) loss by constraining the output change probability map of a given unlabeled bi-temporal image pair to be consistent under the small random perturbations applied on the deep feature difference map that is obtained by subtracting their latent feature representations. Experiments conducted on two publicly available CD datasets show that the proposed semi-supervised CD method can reach closer to the performance of supervised CD even with access to as little as 10% of the annotated training data. Code available at https://github.com/wgcban/SemiCD. ",
    "url": "https://arxiv.org/abs/2204.08454",
    "authors": [
      "Wele Gedara Chaminda Bandara",
      "Vishal M. Patel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.07596",
    "title": "Perfectly Balanced: Improving Transfer and Robustness of Supervised  Contrastive Learning",
    "abstract": "An ideal learned representation should display transferability and robustness. Supervised contrastive learning (SupCon) is a promising method for training accurate models, but produces representations that do not capture these properties due to class collapse -- when all points in a class map to the same representation. Recent work suggests that \"spreading out\" these representations improves them, but the precise mechanism is poorly understood. We argue that creating spread alone is insufficient for better representations, since spread is invariant to permutations within classes. Instead, both the correct degree of spread and a mechanism for breaking this invariance are necessary. We first prove that adding a weighted class-conditional InfoNCE loss to SupCon controls the degree of spread. Next, we study three mechanisms to break permutation invariance: using a constrained encoder, adding a class-conditional autoencoder, and using data augmentation. We show that the latter two encourage clustering of latent subclasses under more realistic conditions than the former. Using these insights, we show that adding a properly-weighted class-conditional InfoNCE loss and a class-conditional autoencoder to SupCon achieves 11.1 points of lift on coarse-to-fine transfer across 5 standard datasets and 4.7 points on worst-group robustness on 3 datasets, setting state-of-the-art on CelebA by 11.5 points. ",
    "url": "https://arxiv.org/abs/2204.07596",
    "authors": [
      "Mayee F. Chen",
      "Daniel Y. Fu",
      "Avanika Narayan",
      "Michael Zhang",
      "Zhao Song",
      "Kayvon Fatahalian",
      "Christopher Ré"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07613",
    "title": "$Υ$-Net: A Spatiospectral Network for Retinal OCT Segmentation",
    "abstract": "Automated segmentation of retinal optical coherence tomography (OCT) images has become an important recent direction in machine learning for medical applications. We hypothesize that the anatomic structure of layers and their high-frequency variation in OCT images make retinal OCT a fitting choice for extracting spectral-domain features and combining them with spatial domain features. In this work, we present $\\Upsilon$-Net, an architecture that combines the frequency domain features with the image domain to improve the segmentation performance of OCT images. The results of this work demonstrate that the introduction of two branches, one for spectral and one for spatial domain features, brings a very significant improvement in fluid segmentation performance and allows outperformance as compared to the well-known U-Net model. Our improvement was 13% on the fluid segmentation dice score and 1.9% on the average dice score. Finally, removing selected frequency ranges in the spectral domain demonstrates the impact of these features on the fluid segmentation outperformance. ",
    "url": "https://arxiv.org/abs/2204.07613",
    "authors": [
      "Azade Farshad",
      "Yousef Yeganeh",
      "Peter Gehlbach",
      "Nassir Navab"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07634",
    "title": "A generative neural network model for random dot product graphs",
    "abstract": "We present GraphMoE, a novel neural network-based approach to learning generative models for random graphs. The neural network is trained to match the distribution of a class of random graphs by way of a moment estimator. The features used for training are graphlets, subgraph counts of small order. The neural network accepts random noise as input and outputs vector representations for nodes in the graph. Random graphs are then realized by applying a kernel to the representations. Graphs produced this way are demonstrated to be able to imitate data from chemistry, medicine, and social networks. The produced graphs are similar enough to the target data to be able to fool discriminator neural networks otherwise capable of separating classes of random graphs. ",
    "url": "https://arxiv.org/abs/2204.07634",
    "authors": [
      "Vittorio Loprinzo",
      "Laurent Younes"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07777",
    "title": "Exploiting Multiple EEG Data Domains with Adversarial Learning",
    "abstract": "Electroencephalography (EEG) is shown to be a valuable data source for evaluating subjects' mental states. However, the interpretation of multi-modal EEG signals is challenging, as they suffer from poor signal-to-noise-ratio, are highly subject-dependent, and are bound to the equipment and experimental setup used, (i.e. domain). This leads to machine learning models often suffer from poor generalization ability, where they perform significantly worse on real-world data than on the exploited training data. Recent research heavily focuses on cross-subject and cross-session transfer learning frameworks to reduce domain calibration efforts for EEG signals. We argue that multi-source learning via learning domain-invariant representations from multiple data-sources is a viable alternative, as the available data from different EEG data-source domains (e.g., subjects, sessions, experimental setups) grow massively. We propose an adversarial inference approach to learn data-source invariant representations in this context, enabling multi-source learning for EEG-based brain-computer interfaces. We unify EEG recordings from different source domains (i.e., emotion recognition datasets SEED, SEED-IV, DEAP, DREAMER), and demonstrate the feasibility of our invariant representation learning approach in suppressing data-source-relevant information leakage by 35% while still achieving stable EEG-based emotion classification performance. ",
    "url": "https://arxiv.org/abs/2204.07777",
    "authors": [
      "David Bethge",
      "Philipp Hallgarten",
      "Ozan Özdenizci",
      "Ralf Mikut",
      "Albrecht Schmidt",
      "Tobias Grosse-Puppendahl"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07821",
    "title": "Detection of Small Holes by the Scale-Invariant Robust Density-Aware  Distance (RDAD) Filtration",
    "abstract": "A novel topological-data-analytical (TDA) method is proposed to distinguish, from noise, small holes surrounded by high-density regions of a probability density function whose mass is concentrated near a manifold (or more generally, a CW complex) embedded in a high-dimensional Euclidean space. The proposed method is robust against additive noise and outliers. In particular, sample points are allowed to be perturbed away from the manifold. Traditional TDA tools, like those based on the distance filtration, often struggle to distinguish small features from noise, because of their short persistence. An alternative filtration, called Robust Density-Aware Distance (RDAD) filtration, is proposed to prolong the persistence of small holes surrounded by high-density regions. This is achieved by weighting the distance function by the density in the sense of Bell et al. Distance-to-measure is incorporated to enhance stability and mitigate noise due to the density estimation. The utility of the proposed filtration in identifying small holes, as well as its robustness against noise, are illustrated through an analytical example and extensive numerical experiments. Basic mathematical properties of the proposed filtration are proven. ",
    "url": "https://arxiv.org/abs/2204.07821",
    "authors": [
      "Chunyin",
      "Gennady Samorodnitsky",
      "Christina Yu",
      "Andrey Yao"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Computational Geometry (cs.CG)",
      "Algebraic Topology (math.AT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.07824",
    "title": "Few-Shot Transfer Learning to improve Chest X-Ray pathology detection  using limited triplets",
    "abstract": "Deep learning approaches applied to medical imaging have reached near-human or better-than-human performance on many diagnostic tasks. For instance, the CheXpert competition on detecting pathologies in chest x-rays has shown excellent multi-class classification performance. However, training and validating deep learning models require extensive collections of images and still produce false inferences, as identified by a human-in-the-loop. In this paper, we introduce a practical approach to improve the predictions of a pre-trained model through Few-Shot Learning (FSL). After training and validating a model, a small number of false inference images are collected to retrain the model using \\textbf{\\textit{Image Triplets}} - a false positive or false negative, a true positive, and a true negative. The retrained FSL model produces considerable gains in performance with only a few epochs and few images. In addition, FSL opens rapid retraining opportunities for human-in-the-loop systems, where a radiologist can relabel false inferences, and the model can be quickly retrained. We compare our retrained model performance with existing FSL approaches in medical imaging that train and evaluate models at once. ",
    "url": "https://arxiv.org/abs/2204.07824",
    "authors": [
      "Ananth Reddy Bhimireddy",
      "John Lee Burns",
      "Saptarshi Purkayastha",
      "Judy Wawira Gichoya"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.07850",
    "title": "Multi-organ Segmentation Network with Adversarial Performance Validator",
    "abstract": "CT organ segmentation on computed tomography (CT) images becomes a significant brick for modern medical image analysis, supporting clinic workflows in multiple domains. Previous segmentation methods include 2D convolution neural networks (CNN) based approaches, fed by CT image slices that lack the structural knowledge in axial view, and 3D CNN-based methods with the expensive computation cost in multi-organ segmentation applications. This paper introduces an adversarial performance validation network into a 2D-to-3D segmentation framework. The classifier and performance validator competition contribute to accurate segmentation results via back-propagation. The proposed network organically converts the 2D-coarse result to 3D high-quality segmentation masks in a coarse-to-fine manner, allowing joint optimization to improve segmentation accuracy. Besides, the structural information of one specific organ is depicted by a statistics-meaningful prior bounding box, which is transformed into a global feature leveraging the learning process in 3D fine segmentation. The experiments on the NIH pancreas segmentation dataset demonstrate the proposed network achieves state-of-the-art accuracy on small organ segmentation and outperforms the previous best. High accuracy is also reported on multi-organ segmentation in a dataset collected by ourselves. ",
    "url": "https://arxiv.org/abs/2204.07850",
    "authors": [
      "Haoyu Fang",
      "Yi Fang",
      "Xiaofeng Yang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.07890",
    "title": "Modeling Complex Interactions in a Disrupted Environment: Relational  Events in the WTC Response",
    "abstract": "When subjected to a sudden, unanticipated threat, human groups characteristically self-organize to identify the threat, determine potential responses, and act to reduce its impact. Central to this process is the challenge of coordinating information sharing and response activity within a disrupted environment. In this paper, we consider coordination in the context of responses to the 2001 World Trade Center disaster. Using records of communications among 17 organizational units, we examine the mechanisms driving communication dynamics, with an emphasis on the emergence of coordinating roles. We employ relational event models (REMs) to identify the mechanisms shaping communications in each unit, finding a consistent pattern of behavior across units with very different characteristics. Using a simulation-based \"knock-out\" study, we also probe the importance of different mechanisms for hub formation. Our results suggest that, while preferential attachment and pre-disaster role structure generally contribute to the emergence of hub structure, temporally local conversational norms play a much larger role. We discuss broader implications for the role of microdynamics in driving macroscopic outcomes, and for the emergence of coordination in other settings. ",
    "url": "https://arxiv.org/abs/2204.07890",
    "authors": [
      "Scott Leo Renshaw",
      "Selena M. Livas",
      "Miruna G. Petrescu-Prahova",
      "Carter T. Butts"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2204.07923",
    "title": "Accelerated MRI With Deep Linear Convolutional Transform Learning",
    "abstract": "Recent studies show that deep learning (DL) based MRI reconstruction outperforms conventional methods, such as parallel imaging and compressed sensing (CS), in multiple applications. Unlike CS that is typically implemented with pre-determined linear representations for regularization, DL inherently uses a non-linear representation learned from a large database. Another line of work uses transform learning (TL) to bridge the gap between these two approaches by learning linear representations from data. In this work, we combine ideas from CS, TL and DL reconstructions to learn deep linear convolutional transforms as part of an algorithm unrolling approach. Using end-to-end training, our results show that the proposed technique can reconstruct MR images to a level comparable to DL methods, while supporting uniform undersampling patterns unlike conventional CS methods. Our proposed method relies on convex sparse image reconstruction with linear representation at inference time, which may be beneficial for characterizing robustness, stability and generalizability. ",
    "url": "https://arxiv.org/abs/2204.07923",
    "authors": [
      "Hongyi Gu",
      "Burhaneddin Yaman",
      "Steen Moeller",
      "Il Yong Chun",
      "Mehmet Akçakaya"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2204.07942",
    "title": "Wound Severity Classification using Deep Neural Network",
    "abstract": "The classification of wound severity is a critical step in wound diagnosis. An effective classifier can help wound professionals categorize wound conditions more quickly and affordably, allowing them to choose the best treatment option. This study used wound photos to construct a deep neural network-based wound severity classifier that classified them into one of three classes: green, yellow, or red. The green class denotes wounds still in the early stages of healing and are most likely to recover with adequate care. Wounds in the yellow category require more attention and treatment than those in the green category. Finally, the red class denotes the most severe wounds that require prompt attention and treatment. A dataset containing different types of wound images is designed with the help of wound specialists. Nine deep learning models are used with applying the concept of transfer learning. Several stacked models are also developed by concatenating these transfer learning models. The maximum accuracy achieved on multi-class classification is 68.49%. In addition, we achieved 78.79%, 81.40%, and 77.57% accuracies on green vs. yellow, green vs. red, and yellow vs. red classifications for binary classifications. ",
    "url": "https://arxiv.org/abs/2204.07942",
    "authors": [
      "D. M. Anisuzzaman",
      "Yash Patel",
      "Jeffrey Niezgoda",
      "Sandeep Gopalakrishnan",
      "Zeyun Yu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07963",
    "title": "AFSC: Adaptive Fourier Space Compression for Anomaly Detection",
    "abstract": "Anomaly Detection (AD) on medical images enables a model to recognize any type of anomaly pattern without lesion-specific supervised learning. Data augmentation based methods construct pseudo-healthy images by \"pasting\" fake lesions on real healthy ones, and a network is trained to predict healthy images in a supervised manner. The lesion can be found by difference between the unhealthy input and pseudo-healthy output. However, using only manually designed fake lesions fail to approximate to irregular real lesions, hence limiting the model generalization. We assume by exploring the intrinsic data property within images, we can distinguish previously unseen lesions from healthy regions in an unhealthy image. In this study, we propose an Adaptive Fourier Space Compression (AFSC) module to distill healthy feature for AD. The compression of both magnitude and phase in frequency domain addresses the hyper intensity and diverse position of lesions. Experimental results on the BraTS and MS-SEG datasets demonstrate an AFSC baseline is able to produce promising detection results, and an AFSC module can be effectively embedded into existing AD methods. ",
    "url": "https://arxiv.org/abs/2204.07963",
    "authors": [
      "Haote Xu",
      "Yunlong Zhang",
      "Liyan Sun",
      "Chenxin Li",
      "Yue Huang",
      "Xinghao Ding"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08000",
    "title": "LRH-Net: A Multi-Level Knowledge Distillation Approach for Low-Resource  Heart Network",
    "abstract": "An electrocardiogram (ECG) monitors the electrical activity generated by the heart and is used to detect fatal cardiovascular diseases (CVDs). Conventionally, to capture the precise electrical activity, clinical experts use multiple-lead ECGs (typically 12 leads). But in recent times, large-size deep learning models have been used to detect these diseases. However, such models require heavy compute resources like huge memory and long inference time. To alleviate these shortcomings, we propose a low-parameter model, named Low Resource Heart-Network (LRH-Net), which uses fewer leads to detect ECG anomalies in a resource-constrained environment. A multi-level knowledge distillation process is used on top of that to get better generalization performance on our proposed model. The multi-level knowledge distillation process distills the knowledge to LRH-Net trained on a reduced number of leads from higher parameter (teacher) models trained on multiple leads to reduce the performance gap. The proposed model is evaluated on the PhysioNet-2020 challenge dataset with constrained input. The parameters of the LRH-Net are 106x less than our teacher model for detecting CVDs. The performance of the LRH-Net was scaled up to 3.2% and the inference time scaled down by 75% compared to the teacher model. In contrast to the compute- and parameter-intensive deep learning techniques, the proposed methodology uses a subset of ECG leads using the low resource LRH-Net, making it eminently suitable for deployment on edge devices. ",
    "url": "https://arxiv.org/abs/2204.08000",
    "authors": [
      "Ekansh Chauhan",
      "Swathi Guptha",
      "Likith Reddy",
      "Bapi Raju"
    ],
    "subjectives": [
      "Medical Physics (physics.med-ph)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.08127",
    "title": "Parallel Network with Channel Attention and Post-Processing for Carotid  Arteries Vulnerable Plaque Segmentation in Ultrasound Images",
    "abstract": "Carotid arteries vulnerable plaques are a crucial factor in the screening of atherosclerosis by ultrasound technique. However, the plaques are contaminated by various noises such as artifact, speckle noise, and manual segmentation may be time-consuming. This paper proposes an automatic convolutional neural network (CNN) method for plaque segmentation in carotid ultrasound images using a small dataset. First, a parallel network with three independent scale decoders is utilized as our base segmentation network, pyramid dilation convolutions are used to enlarge receptive fields in the three segmentation sub-networks. Subsequently, the three decoders are merged to be rectified in channels by SENet. Thirdly, in test stage, the initially segmented plaque is refined by the max contour morphology post-processing to obtain the final plaque. Moreover, three loss function Dice loss, SSIM loss and cross-entropy loss are compared to segment plaques. Test results show that the proposed method with dice loss function yields a Dice value of 0.820, an IoU of 0.701, Acc of 0.969, and modified Hausdorff distance (MHD) of 1.43 for 30 vulnerable cases of plaques, it outperforms some of the conventional CNN-based methods on these metrics. Additionally, we apply an ablation experiment to show the validity of each proposed module. Our study provides some reference for similar researches and may be useful in actual applications for plaque segmentation of ultrasound carotid arteries. ",
    "url": "https://arxiv.org/abs/2204.08127",
    "authors": [
      "Yanchao Yuan",
      "Cancheng Li",
      "Lu Xu",
      "Ke Zhang",
      "Yang Hua",
      "Jicong Zhang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08160",
    "title": "On Arbitrary Compression for Decentralized Consensus and Stochastic  Optimization over Directed Networks",
    "abstract": "We study the decentralized consensus and stochastic optimization problems with compressed communications over static directed graphs. We propose an iterative gradient-based algorithm that compresses messages according to a desired compression ratio. The proposed method provably reduces the communication overhead on the network at every communication round. Contrary to existing literature, we allow for arbitrary compression ratios in the communicated messages. We show a linear convergence rate for the proposed method on the consensus problem. Moreover, we provide explicit convergence rates for decentralized stochastic optimization problems on smooth functions that are either (i) strongly convex, (ii) convex, or (iii) non-convex. Finally, we provide numerical experiments to illustrate convergence under arbitrary compression ratios and the communication efficiency of our algorithm. ",
    "url": "https://arxiv.org/abs/2204.08160",
    "authors": [
      "Mohammad Taha Toghani",
      "César A. Uribe"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.08397",
    "title": "Fast and Memory-Efficient Network Towards Efficient Image  Super-Resolution",
    "abstract": "Runtime and memory consumption are two important aspects for efficient image super-resolution (EISR) models to be deployed on resource-constrained devices. Recent advances in EISR exploit distillation and aggregation strategies with plenty of channel split and concatenation operations to make full use of limited hierarchical features. In contrast, sequential network operations avoid frequently accessing preceding states and extra nodes, and thus are beneficial to reducing the memory consumption and runtime overhead. Following this idea, we design our lightweight network backbone by mainly stacking multiple highly optimized convolution and activation layers and decreasing the usage of feature fusion. We propose a novel sequential attention branch, where every pixel is assigned an important factor according to local and global contexts, to enhance high-frequency details. In addition, we tailor the residual block for EISR and propose an enhanced residual block (ERB) to further accelerate the network inference. Finally, combining all the above techniques, we construct a fast and memory-efficient network (FMEN) and its small version FMEN-S, which runs 33% faster and reduces 74% memory consumption compared with the state-of-the-art EISR model: E-RFDN, the champion in AIM 2020 efficient super-resolution challenge. Besides, FMEN-S achieves the lowest memory consumption and the second shortest runtime in NTIRE 2022 challenge on efficient super-resolution. Code is available at https://github.com/NJU-Jet/FMEN. ",
    "url": "https://arxiv.org/abs/2204.08397",
    "authors": [
      "Zongcai Du",
      "Ding Liu",
      "Jie Liu",
      "Jie Tang",
      "Gangshan Wu",
      "Lean Fu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:1709.00944",
    "title": "Audio-Visual Speech Enhancement Using Multimodal Deep Convolutional  Neural Networks",
    "abstract": " Comments: This paper is the same as arXiv:1703.10893v6. Apologies for the inconvenience. arXiv admin note: text overlap with arXiv:1703.10893 ",
    "url": "https://arxiv.org/abs/1709.00944",
    "authors": [
      "Jen-Cheng Hou",
      "Syu-Siang Wang",
      "Ying-Hui Lai",
      "Yu Tsao",
      "Hsiu-Wen Chang",
      "Hsin-Min Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2006.05905",
    "title": "Spatial-Temporal Dynamic Graph Attention Networks for Ride-hailing  Demand Prediction",
    "abstract": " Comments: 11 pages, 6 figures. arXiv admin note: text overlap with arXiv:2006.04089 ",
    "url": "https://arxiv.org/abs/2006.05905",
    "authors": [
      "Weiguo Pian",
      "Yingbo Wu",
      "Xiangmou Qu",
      "Junpeng Cai",
      "Ziyi Kou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2008.04015",
    "title": "MHSA-Net: Multi-Head Self-Attention Network for Occluded Person  Re-Identification",
    "abstract": " Comments: Accepted by TNNLS ",
    "url": "https://arxiv.org/abs/2008.04015",
    "authors": [
      "Hongchen Tan",
      "Xiuping Liu",
      "Baocai Yin",
      "Xin Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2009.09258",
    "title": "Can You Spot the Chameleon? Adversarially Camouflaging Images from  Co-Salient Object Detection",
    "abstract": " Comments: Accepted to CVPR 2022 ",
    "url": "https://arxiv.org/abs/2009.09258",
    "authors": [
      "Ruijun Gao",
      "Qing Guo",
      "Felix Juefei-Xu",
      "Hongkai Yu",
      "Huazhu Fu",
      "Wei Feng",
      "Yang Liu",
      "Song Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2009.11435",
    "title": "Dynamic Approximate Maximum Independent Set on Massive Graphs",
    "abstract": " Title: Dynamic Approximate Maximum Independent Set on Massive Graphs ",
    "url": "https://arxiv.org/abs/2009.11435",
    "authors": [
      "Xiangyu Gao",
      "Jianzhong Li",
      "Dongjing Miao"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2010.12190",
    "title": "Towards Robust Neural Networks via Orthogonal Diversity",
    "abstract": " Title: Towards Robust Neural Networks via Orthogonal Diversity ",
    "url": "https://arxiv.org/abs/2010.12190",
    "authors": [
      "Kun Fang",
      "Qinghua Tao",
      "Yingwen Wu",
      "Tao Li",
      "Jia Cai",
      "Feipeng Cai",
      "Xiaolin Huang",
      "Jie Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2101.11952",
    "title": "Rethinking Rotated Object Detection with Gaussian Wasserstein Distance  Loss",
    "abstract": " Comments: 15 pages, 6 figures, 9 tables, accepted by ICML21, codes are available at this https URL and this https URL ",
    "url": "https://arxiv.org/abs/2101.11952",
    "authors": [
      "Xue Yang",
      "Junchi Yan",
      "Qi Ming",
      "Wentao Wang",
      "Xiaopeng Zhang",
      "Qi Tian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2102.12380",
    "title": "Pre-Training on Dynamic Graph Neural Networks",
    "abstract": " Title: Pre-Training on Dynamic Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2102.12380",
    "authors": [
      "Ke-jia Chen",
      "Jiajun Zhang",
      "Linpu Jiang",
      "Yunyun Wang",
      "Yuxuan Dai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2104.08677",
    "title": "From Fully Trained to Fully Random Embeddings: Improving Neural Machine  Translation with Compact Word Embedding Tables",
    "abstract": " Title: From Fully Trained to Fully Random Embeddings: Improving Neural Machine  Translation with Compact Word Embedding Tables ",
    "url": "https://arxiv.org/abs/2104.08677",
    "authors": [
      "Krtin Kumar",
      "Peyman Passban",
      "Mehdi Rezagholizadeh",
      "Yiu Sing Lau",
      "Qun Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.09096",
    "title": "Wake Up and Join Me! An Energy-Efficient Algorithm for Maximal Matching  in Radio Networks",
    "abstract": " Comments: 14 pages, 2 figures, 3 algorithms ",
    "url": "https://arxiv.org/abs/2104.09096",
    "authors": [
      "Varsha Dani",
      "Aayush Gupta",
      "Thomas P. Hayes",
      "Seth Pettie"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2105.00373",
    "title": "Investigating the Impact of Multi-LiDAR Placement on Object Detection  for Autonomous Driving",
    "abstract": " Comments: CVPR 2022 camera-ready version:15 pages, 14 figures, 9 tables ",
    "url": "https://arxiv.org/abs/2105.00373",
    "authors": [
      "Hanjiang Hu",
      "Zuxin Liu",
      "Sharad Chitlangia",
      "Akhil Agnihotri",
      "Ding Zhao"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.04588",
    "title": "Partitioning H-Free Graphs of Bounded Diameter",
    "abstract": " Title: Partitioning H-Free Graphs of Bounded Diameter ",
    "url": "https://arxiv.org/abs/2105.04588",
    "authors": [
      "Christoph Brause",
      "Petr Golovach",
      "Barnaby Martin",
      "Daniël Paulusma",
      "Siani Smith"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2105.07146",
    "title": "GCN-MIF: Graph Convolutional Network with Multi-Information Fusion for  Low-dose CT Denoising",
    "abstract": " Comments: Submitted to TMI with under review ",
    "url": "https://arxiv.org/abs/2105.07146",
    "authors": [
      "Kecheng Chen",
      "Jiayu Sun",
      "Jiang Shen",
      "Jixiang Luo",
      "Xinyu Zhang",
      "Xuelin Pan",
      "Dongsheng Wu",
      "Yue Zhao",
      "Miguel Bento",
      "Yazhou Ren",
      "Xiaorong Pu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.11122",
    "title": "Heterogeneous Graph Representation Learning with Relation Awareness",
    "abstract": " Comments: Accepted by the TKDE journal ",
    "url": "https://arxiv.org/abs/2105.11122",
    "authors": [
      "Le Yu",
      "Leilei Sun",
      "Bowen Du",
      "Chuanren Liu",
      "Weifeng Lv",
      "Hui Xiong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2105.13010",
    "title": "An error analysis of generative adversarial networks for learning  distributions",
    "abstract": " Title: An error analysis of generative adversarial networks for learning  distributions ",
    "url": "https://arxiv.org/abs/2105.13010",
    "authors": [
      "Jian Huang",
      "Yuling Jiao",
      "Zhen Li",
      "Shiao Liu",
      "Yang Wang",
      "Yunfei Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.01883",
    "title": "Learning High-Precision Bounding Box for Rotated Object Detection via  Kullback-Leibler Divergence",
    "abstract": " Comments: 16 pages, 5 figures, 8 tables, accepted by NeurIPS21, codes are available at this https URL and this https URL ",
    "url": "https://arxiv.org/abs/2106.01883",
    "authors": [
      "Xue Yang",
      "Xiaojiang Yang",
      "Jirui Yang",
      "Qi Ming",
      "Wentao Wang",
      "Qi Tian",
      "Junchi Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.05492",
    "title": "Learning Adversarially Robust Policies in Multi-Agent Games",
    "abstract": " Title: Learning Adversarially Robust Policies in Multi-Agent Games ",
    "url": "https://arxiv.org/abs/2106.05492",
    "authors": [
      "Eric Zhao",
      "Alexander R. Trott",
      "Caiming Xiong",
      "Stephan Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.01832",
    "title": "Provable Convergence of Nesterov's Accelerated Gradient Method for  Over-Parameterized Neural Networks",
    "abstract": " Title: Provable Convergence of Nesterov's Accelerated Gradient Method for  Over-Parameterized Neural Networks ",
    "url": "https://arxiv.org/abs/2107.01832",
    "authors": [
      "Xin Liu",
      "Zhisong Pan",
      "Wei Tao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.02185",
    "title": "Growing Urban Bicycle Networks",
    "abstract": " Comments: Main text: 14 pages, 7 figures. Website: this http URL ",
    "url": "https://arxiv.org/abs/2107.02185",
    "authors": [
      "Michael Szell",
      "Sayat Mimar",
      "Tyler Perlman",
      "Gourab Ghoshal",
      "Roberta Sinatra"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2107.02451",
    "title": "Integrating Large Circular Kernels into CNNs through Neural Architecture  Search",
    "abstract": " Comments: 20 pages, 10 figures, submitted to a conference ",
    "url": "https://arxiv.org/abs/2107.02451",
    "authors": [
      "Kun He",
      "Chao Li",
      "Yixiao Yang",
      "Gao Huang",
      "John E. Hopcroft"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.12724",
    "title": "Quantum Meet-in-the-Middle Attack on Feistel Construction",
    "abstract": " Comments: 18 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2107.12724",
    "authors": [
      "Yinsong Xu",
      "Zheng Yuan"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2108.00083",
    "title": "Majorization Minimization Methods for Distributed Pose Graph  Optimization",
    "abstract": " Comments: 33 pages ",
    "url": "https://arxiv.org/abs/2108.00083",
    "authors": [
      "Taosha Fan",
      "Todd Murphey"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2108.00502",
    "title": "Choice number of Kneser graphs",
    "abstract": " Title: Choice number of Kneser graphs ",
    "url": "https://arxiv.org/abs/2108.00502",
    "authors": [
      "Vera Bulankina",
      "Andrey Kupavskii"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2108.03899",
    "title": "A Concise Function Representation for Faster Exact MPE and Constrained  Optimisation in Graphical Models",
    "abstract": " Comments: Submitted to IEEE Transactions on Cybernetics ",
    "url": "https://arxiv.org/abs/2108.03899",
    "authors": [
      "Filippo Bistaffa"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2108.06688",
    "title": "Complex Knowledge Base Question Answering: A Survey",
    "abstract": " Comments: 20 pages, 4 tables, 7 figures. arXiv admin note: text overlap with arXiv:2105.11644 ",
    "url": "https://arxiv.org/abs/2108.06688",
    "authors": [
      "Yunshi Lan",
      "Gaole He",
      "Jinhao Jiang",
      "Jing Jiang",
      "Wayne Xin Zhao",
      "Ji-Rong Wen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2108.07344",
    "title": "IsoScore: Measuring the Uniformity of Embedding Space Utilization",
    "abstract": " Comments: ACL 2022 camera ready version ",
    "url": "https://arxiv.org/abs/2108.07344",
    "authors": [
      "William Rudman",
      "Nate Gillman",
      "Taylor Rayne",
      "Carsten Eickhoff"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.05710",
    "title": "Robust Stability of Neural-Network Controlled Nonlinear Systems with  Parametric Variability",
    "abstract": " Comments: 15 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2109.05710",
    "authors": [
      "Soumyabrata Talukder",
      "Ratnesh Kumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2109.08830",
    "title": "Multilingual Molecular Representation Learning via Contrastive  Pre-training",
    "abstract": " Comments: Accepted to ACL 2022 main conference ",
    "url": "https://arxiv.org/abs/2109.08830",
    "authors": [
      "Zhihui Guo",
      "Pramod Sharma",
      "Andy Martinez",
      "Liang Du",
      "Robin Abraham"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2110.07580",
    "title": "Graph Condensation for Graph Neural Networks",
    "abstract": " Comments: ICLR 2022 ",
    "url": "https://arxiv.org/abs/2110.07580",
    "authors": [
      "Wei Jin",
      "Lingxiao Zhao",
      "Shichang Zhang",
      "Yozen Liu",
      "Jiliang Tang",
      "Neil Shah"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2110.08101",
    "title": "An Artificial Neural Network-Based Model Predictive Control for  Three-phase Flying Capacitor Multi-Level Inverter",
    "abstract": " Comments: 12 pages, 21 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2110.08101",
    "authors": [
      "Abualkasim Bakeer",
      "Ihab S. Mohamed",
      "Parisa Boodaghi Malidarreh",
      "Intissar Hattabi",
      "Lantao Liu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.12908",
    "title": "Learning to run a power network with trust",
    "abstract": " Title: Learning to run a power network with trust ",
    "url": "https://arxiv.org/abs/2110.12908",
    "authors": [
      "Antoine Marot",
      "Benjamin Donnot",
      "Karim Chaouache",
      "Adrian Kelly",
      "Qiuhua Huang",
      "Ramij-Raja Hossain",
      "Jochen L. Cremer"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2111.13656",
    "title": "Towards Low-Cost and Efficient Malaria Detection",
    "abstract": " Title: Towards Low-Cost and Efficient Malaria Detection ",
    "url": "https://arxiv.org/abs/2111.13656",
    "authors": [
      "Waqas Sultani",
      "Wajahat Nawaz",
      "Syed Javed",
      "Muhammad Sohail Danish",
      "Asma Saadia",
      "Mohsen Ali"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.04150",
    "title": "BA-Net: Bridge Attention for Deep Convolutional Neural Networks",
    "abstract": " Title: BA-Net: Bridge Attention for Deep Convolutional Neural Networks ",
    "url": "https://arxiv.org/abs/2112.04150",
    "authors": [
      "Yue Zhao",
      "Junzhou Chen",
      "Zirui Zhang",
      "Ronghui Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.06121",
    "title": "Magnifying Networks for Images with Billions of Pixels",
    "abstract": " Title: Magnifying Networks for Images with Billions of Pixels ",
    "url": "https://arxiv.org/abs/2112.06121",
    "authors": [
      "Neofytos Dimitriou",
      "Ognjen Arandjelovic"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.07868",
    "title": "Few-shot Instruction Prompts for Pretrained Language Models to Detect  Social Biases",
    "abstract": " Comments: Submission revised with new results ",
    "url": "https://arxiv.org/abs/2112.07868",
    "authors": [
      "Shrimai Prabhumoye",
      "Rafal Kocielnik",
      "Mohammad Shoeybi",
      "Anima Anandkumar",
      "Bryan Catanzaro"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.08288",
    "title": "Improving both domain robustness and domain adaptability in machine  translation",
    "abstract": " Comments: update English-Chinese results ",
    "url": "https://arxiv.org/abs/2112.08288",
    "authors": [
      "Wen Lai",
      "Jindřich Libovický",
      "Alexander Fraser"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.11377",
    "title": "Shape from Polarization for Complex Scenes in the Wild",
    "abstract": " Comments: Accepted to CVPR 2022; Github link: this https URL; Project website: this https URL ",
    "url": "https://arxiv.org/abs/2112.11377",
    "authors": [
      "Chenyang Lei",
      "Chenyang Qi",
      "Jiaxin Xie",
      "Na Fan",
      "Vladlen Koltun",
      "Qifeng Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.00767",
    "title": "BDG-Net: Boundary Distribution Guided Network for Accurate Polyp  Segmentation",
    "abstract": " Comments: Accepted by SPIE Medical Imaging 2022 ",
    "url": "https://arxiv.org/abs/2201.00767",
    "authors": [
      "Zihuan Qiu",
      "Zhichuan Wang",
      "Miaomiao Zhang",
      "Ziyong Xu",
      "Jie Fan",
      "Linfeng Xu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.01647",
    "title": "Relationship extraction for knowledge graph creation from biomedical  literature",
    "abstract": " Comments: Paper submitted to Journal of Semantic Web ",
    "url": "https://arxiv.org/abs/2201.01647",
    "authors": [
      "Nikola Milosevic",
      "Wolfgang Thielemann"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.02489",
    "title": "Semantic-based Data Augmentation for Math Word Problems",
    "abstract": " Title: Semantic-based Data Augmentation for Math Word Problems ",
    "url": "https://arxiv.org/abs/2201.02489",
    "authors": [
      "Ailisi Li",
      "Jiaqing Liang",
      "Yanghua Xiao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2201.04805",
    "title": "Non-Stationary Representation Learning in Sequential Linear Bandits",
    "abstract": " Comments: 24 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2201.04805",
    "authors": [
      "Yuzhen Qin",
      "Tommaso Menara",
      "Samet Oymak",
      "ShiNung Ching",
      "Fabio Pasqualetti"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2201.10734",
    "title": "CrossRectify: Leveraging Disagreement for Semi-supervised Object  Detection",
    "abstract": " Title: CrossRectify: Leveraging Disagreement for Semi-supervised Object  Detection ",
    "url": "https://arxiv.org/abs/2201.10734",
    "authors": [
      "Chengcheng Ma",
      "Xingjia Pan",
      "Qixiang Ye",
      "Fan Tang",
      "Weiming Dong",
      "Changsheng Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.12129",
    "title": "Impact of Phase-Noise and Spatial Correlation on Double-RIS-Assisted  Multiuser MISO Networks",
    "abstract": " Title: Impact of Phase-Noise and Spatial Correlation on Double-RIS-Assisted  Multiuser MISO Networks ",
    "url": "https://arxiv.org/abs/2201.12129",
    "authors": [
      "Zaid Abdullah",
      "Anastasios Papazafeiropoulos",
      "Steven Kisseleff",
      "Symeon Chatzinotas",
      "Bjorn Ottersten"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2202.03851",
    "title": "MetaKG: Meta-learning on Knowledge Graph for Cold-start Recommendation",
    "abstract": " Comments: Accepted to TKDE2022 ",
    "url": "https://arxiv.org/abs/2202.03851",
    "authors": [
      "Yuntao Du",
      "Xinjun Zhu",
      "Lu Chen",
      "Ziquan Fang",
      "Yunjun Gao"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.06172",
    "title": "Efficient Spatial Representation and Routing of Deformable  One-Dimensional Objects for Manipulation",
    "abstract": " Comments: 7 pages ",
    "url": "https://arxiv.org/abs/2202.06172",
    "authors": [
      "Azarakhsh Keipour",
      "Maryam Bandari",
      "Stefan Schaal"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.06602",
    "title": "Neural Re-ranking in Multi-stage Recommender Systems: A Review",
    "abstract": " Comments: 8 pages ",
    "url": "https://arxiv.org/abs/2202.06602",
    "authors": [
      "Weiwen Liu",
      "Yunjia Xi",
      "Jiarui Qin",
      "Fei Sun",
      "Bo Chen",
      "Weinan Zhang",
      "Rui Zhang",
      "Ruiming Tang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2202.10617",
    "title": "An Ensemble Learning Framework for Vehicle Trajectory Prediction in  Interactive Scenarios",
    "abstract": " Title: An Ensemble Learning Framework for Vehicle Trajectory Prediction in  Interactive Scenarios ",
    "url": "https://arxiv.org/abs/2202.10617",
    "authors": [
      "Zirui Li",
      "Yunlong Lin",
      "Cheng Gong",
      "Xinwei Wang",
      "Qi Liu",
      "Jianwei Gong",
      "Chao Lu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.13248",
    "title": "Automated Data Augmentations for Graph Classification",
    "abstract": " Title: Automated Data Augmentations for Graph Classification ",
    "url": "https://arxiv.org/abs/2202.13248",
    "authors": [
      "Youzhi Luo",
      "Michael McThrow",
      "Wing Yee Au",
      "Tao Komikado",
      "Kanji Uchino",
      "Koji Maruhashi",
      "Shuiwang Ji"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.13785",
    "title": "CAKE: A Scalable Commonsense-Aware Framework For Multi-View Knowledge  Graph Completion",
    "abstract": " Comments: The full version of a long paper accepted to ACL 2022 main conference ",
    "url": "https://arxiv.org/abs/2202.13785",
    "authors": [
      "Guanglin Niu",
      "Bo Li",
      "Yongfei Zhang",
      "Shiliang Pu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.00449",
    "title": "Deep Learning based Prediction of MSI using MMR Markers in Colorectal  Cancer",
    "abstract": " Title: Deep Learning based Prediction of MSI using MMR Markers in Colorectal  Cancer ",
    "url": "https://arxiv.org/abs/2203.00449",
    "authors": [
      "Ruqayya Awan",
      "Mohammed Nimir",
      "Shan E Ahmed Raza",
      "Mohsin Bilal",
      "Johannes Lotz",
      "David Snead",
      "Andrew Robinson",
      "Nasir M. Rajpoot"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.00953",
    "title": "Computationally Efficient and Statistically Optimal Robust Low-rank  Matrix Estimation",
    "abstract": " Title: Computationally Efficient and Statistically Optimal Robust Low-rank  Matrix Estimation ",
    "url": "https://arxiv.org/abs/2203.00953",
    "authors": [
      "Yinan Shen",
      "Jingyang Li",
      "Jian-Feng Cai",
      "Dong Xia"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Information Theory (cs.IT)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.03216",
    "title": "USTC-NELSLIP at SemEval-2022 Task 11: Gazetteer-Adapted Integration  Network for Multilingual Complex Named Entity Recognition",
    "abstract": " Comments: Winner system (USTC-NELSLIP) of SemEval 2022 MultiCoNER shared task on 3 tracks (Chinese, Bangla, Code-mixed) ",
    "url": "https://arxiv.org/abs/2203.03216",
    "authors": [
      "Beiduo Chen",
      "Jun-Yu Ma",
      "Jiajun Qi",
      "Wu Guo",
      "Zhen-Hua Ling",
      "Quan Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.05983",
    "title": "PseudoProp: Robust Pseudo-Label Generation for Semi-Supervised Object  Detection in Autonomous Driving Systems",
    "abstract": " Comments: Accepted by the Workshop on Autonomous Driving (WAD) at CVPR 2022 ",
    "url": "https://arxiv.org/abs/2203.05983",
    "authors": [
      "Shu Hu",
      "Chun-Hao Liu",
      "Jayanta Dutta",
      "Ming-Ching Chang",
      "Siwei Lyu",
      "Naveen Ramakrishnan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.15275",
    "title": "A Multi-size Kernel based Adaptive Convolutional Neural Network for  Bearing Fault Diagnosis",
    "abstract": " Comments: 21 pages, 16 figures ",
    "url": "https://arxiv.org/abs/2203.15275",
    "authors": [
      "Guangwei Yu",
      "Gang Li",
      "Xingtong Si",
      "Zhuoyuan Song"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16028",
    "title": "Span Classification with Structured Information for Disfluency Detection  in Spoken Utterances",
    "abstract": " Title: Span Classification with Structured Information for Disfluency Detection  in Spoken Utterances ",
    "url": "https://arxiv.org/abs/2203.16028",
    "authors": [
      "Sreyan Ghosh",
      "Sonal Kumar",
      "Yaman Kumar Singla",
      "Rajiv Ratn Shah",
      "S. Umesh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Multimedia (cs.MM)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.01057",
    "title": "Learning-Based Approaches for Graph Problems: A Survey",
    "abstract": " Comments: v1: 41 pages; v2: 40 pages ",
    "url": "https://arxiv.org/abs/2204.01057",
    "authors": [
      "Kai Siong Yow",
      "Siqiang Luo"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.02441",
    "title": "Imaging Conductivity from Current Density Magnitude using Neural  Networks",
    "abstract": " Comments: 29 pp, 9 figures (several typos are corrected in the new version) ",
    "url": "https://arxiv.org/abs/2204.02441",
    "authors": [
      "Bangti Jin",
      "Xiyao Li",
      "Xiliang Lu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.02824",
    "title": "ShowFace: Coordinated Face Inpainting with Memory-Disentangled  Refinement Networks",
    "abstract": " Title: ShowFace: Coordinated Face Inpainting with Memory-Disentangled  Refinement Networks ",
    "url": "https://arxiv.org/abs/2204.02824",
    "authors": [
      "Zhuojie Wu",
      "Xingqun Qi",
      "Zijian Wang",
      "Wanting Zhou",
      "Kun Yuan",
      "Muyi Sun",
      "Zhenan Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03597",
    "title": "Imitating, Fast and Slow: Robust learning from demonstrations via  decision-time planning",
    "abstract": " Title: Imitating, Fast and Slow: Robust learning from demonstrations via  decision-time planning ",
    "url": "https://arxiv.org/abs/2204.03597",
    "authors": [
      "Carl Qi",
      "Pieter Abbeel",
      "Aditya Grover"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.04952",
    "title": "MGIMN: Multi-Grained Interactive Matching Network for Few-shot Text  Classification",
    "abstract": " Comments: 10 pages, 2 figures, 6 tabels ",
    "url": "https://arxiv.org/abs/2204.04952",
    "authors": [
      "Jianhai Zhang",
      "Mieradilijiang Maimaiti",
      "Xing Gao",
      "Yuanhang Zheng",
      "Ji Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.05423",
    "title": "Automated Task Updates of Temporal Logic Specifications for  Heterogeneous Robots",
    "abstract": " Comments: Accepted by IEEE International Conference on Robotics and Automation (ICRA) 2022 ",
    "url": "https://arxiv.org/abs/2204.05423",
    "authors": [
      "Amy Fang",
      "Hadas Kress-Gazit"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.05999",
    "title": "InCoder: A Generative Model for Code Infilling and Synthesis",
    "abstract": " Comments: 25 pages, 13 figures. v2: added NeoX-20B results & StackOverflow corpus info ",
    "url": "https://arxiv.org/abs/2204.05999",
    "authors": [
      "Daniel Fried",
      "Armen Aghajanyan",
      "Jessy Lin",
      "Sida Wang",
      "Eric Wallace",
      "Freda Shi",
      "Ruiqi Zhong",
      "Wen-tau Yih",
      "Luke Zettlemoyer",
      "Mike Lewis"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.06353",
    "title": "AHP: Learning to Negative Sample for Hyperedge Prediction",
    "abstract": " Comments: To be published in the Proceedings of the 45th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2022) ",
    "url": "https://arxiv.org/abs/2204.06353",
    "authors": [
      "Hyunjin Hwang",
      "Seungwoo Lee",
      "Chanyoung Park",
      "Kijung Shin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.07050",
    "title": "Recent Advances and New Frontiers in Spiking Neural Networks",
    "abstract": " Comments: Accepted at IJCAI2022 ",
    "url": "https://arxiv.org/abs/2204.07050",
    "authors": [
      "Duzhen Zhang",
      "Tielin Zhang",
      "Shuncheng Jia",
      "Qingyu Wang",
      "Bo Xu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.07121",
    "title": "Facing the Illusion and Reality of Safety in Social VR",
    "abstract": " Comments: (CHI'EA' 2022) In CHI Conference on Human Factors in Computing Systems, Proceedings of the 1st Workshop on Novel Challenges of Safety, Security and Privacy in Extended Reality ",
    "url": "https://arxiv.org/abs/2204.07121",
    "authors": [
      "Qingxiao Zheng",
      "Tue Ngoc Do",
      "Lingqing Wang",
      "Yun Huang"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2204.07129",
    "title": "On The Complexity of Matching Cut for Graphs of Bounded Radius and  $H$-Free Graphs",
    "abstract": " Title: On The Complexity of Matching Cut for Graphs of Bounded Radius and  $H$-Free Graphs ",
    "url": "https://arxiv.org/abs/2204.07129",
    "authors": [
      "Felicia Lucke",
      "Daniël Paulusma",
      "Bernard Ries"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2204.07439",
    "title": "INSTA-BNN: Binary Neural Network with INSTAnce-aware Threshold",
    "abstract": " Comments: 19 pages, 7 figures; excluded axessibility package ",
    "url": "https://arxiv.org/abs/2204.07439",
    "authors": [
      "Changhun Lee",
      "Hyungjun Kim",
      "Eunhyeok Park",
      "Jae-Joon Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  }
]