[
  {
    "id": "arXiv:2304.02653",
    "title": "Adaptive Ensemble Learning: Boosting Model Performance through  Intelligent Feature Fusion in Deep Neural Networks",
    "abstract": "In this paper, we present an Adaptive Ensemble Learning framework that aims to boost the performance of deep neural networks by intelligently fusing features through ensemble learning techniques. The proposed framework integrates ensemble learning strategies with deep learning architectures to create a more robust and adaptable model capable of handling complex tasks across various domains. By leveraging intelligent feature fusion methods, the Adaptive Ensemble Learning framework generates more discriminative and effective feature representations, leading to improved model performance and generalization capabilities. We conducted extensive experiments and evaluations on several benchmark datasets, including image classification, object detection, natural language processing, and graph-based learning tasks. The results demonstrate that the proposed framework consistently outperforms baseline models and traditional feature fusion techniques, highlighting its effectiveness in enhancing deep learning models' performance. Furthermore, we provide insights into the impact of intelligent feature fusion on model performance and discuss the potential applications of the Adaptive Ensemble Learning framework in real-world scenarios. The paper also explores the design and implementation of adaptive ensemble models, ensemble training strategies, and meta-learning techniques, which contribute to the framework's versatility and adaptability. In conclusion, the Adaptive Ensemble Learning framework represents a significant advancement in the field of feature fusion and ensemble learning for deep neural networks, with the potential to transform a wide range of applications across multiple domains. ",
    "url": "https://arxiv.org/abs/2304.02653",
    "authors": [
      "Neelesh Mungoli"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.02654",
    "title": "Adopting Two Supervisors for Efficient Use of Large-Scale Remote Deep  Neural Networks",
    "abstract": "Recent decades have seen the rise of large-scale Deep Neural Networks (DNNs) to achieve human-competitive performance in a variety of artificial intelligence tasks. Often consisting of hundreds of millions, if not hundreds of billion parameters, these DNNs are too large to be deployed to, or efficiently run on resource-constrained devices such as mobile phones or IoT microcontrollers. Systems relying on large-scale DNNs thus have to call the corresponding model over the network, leading to substantial costs for hosting and running the large-scale remote model, costs which are often charged on a per-use basis. In this paper, we propose BiSupervised, a novel architecture, where, before relying on a large remote DNN, a system attempts to make a prediction on a small-scale local model. A DNN supervisor monitors said prediction process and identifies easy inputs for which the local prediction can be trusted. For these inputs, the remote model does not have to be invoked, thus saving costs, while only marginally impacting the overall system accuracy. Our architecture furthermore foresees a second supervisor to monitor the remote predictions and identify inputs for which not even these can be trusted, allowing to raise an exception or run a fallback strategy instead. We evaluate the cost savings, and the ability to detect incorrectly predicted inputs on four diverse case studies: IMDB movie review sentiment classification, Github issue triaging, Imagenet image classification, and SQuADv2 free-text question answering ",
    "url": "https://arxiv.org/abs/2304.02654",
    "authors": [
      "Michael Weiss",
      "Paolo Tonella"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2304.02688",
    "title": "Going Further: Flatness at the Rescue of Early Stopping for Adversarial  Example Transferability",
    "abstract": "Transferability is the property of adversarial examples to be misclassified by other models than the surrogate model for which they were crafted. Previous research has shown that transferability is substantially increased when the training of the surrogate model has been early stopped. A common hypothesis to explain this is that the later training epochs are when models learn the non-robust features that adversarial attacks exploit. Hence, an early stopped model is more robust (hence, a better surrogate) than fully trained models. We demonstrate that the reasons why early stopping improves transferability lie in the side effects it has on the learning dynamics of the model. We first show that early stopping benefits transferability even on models learning from data with non-robust features. We then establish links between transferability and the exploration of the loss landscape in the parameter space, on which early stopping has an inherent effect. More precisely, we observe that transferability peaks when the learning rate decays, which is also the time at which the sharpness of the loss significantly drops. This leads us to propose RFN, a new approach for transferability that minimizes loss sharpness during training in order to maximize transferability. We show that by searching for large flat neighborhoods, RFN always improves over early stopping (by up to 47 points of transferability rate) and is competitive to (if not better than) strong state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2304.02688",
    "authors": [
      "Martin Gubri",
      "Maxime Cordy",
      "Yves Le Traon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.02693",
    "title": "A Certified Radius-Guided Attack Framework to Image Segmentation Models",
    "abstract": "Image segmentation is an important problem in many safety-critical applications. Recent studies show that modern image segmentation models are vulnerable to adversarial perturbations, while existing attack methods mainly follow the idea of attacking image classification models. We argue that image segmentation and classification have inherent differences, and design an attack framework specially for image segmentation models. Our attack framework is inspired by certified radius, which was originally used by defenders to defend against adversarial perturbations to classification models. We are the first, from the attacker perspective, to leverage the properties of certified radius and propose a certified radius guided attack framework against image segmentation models. Specifically, we first adapt randomized smoothing, the state-of-the-art certification method for classification models, to derive the pixel's certified radius. We then focus more on disrupting pixels with relatively smaller certified radii and design a pixel-wise certified radius guided loss, when plugged into any existing white-box attack, yields our certified radius-guided white-box attack. Next, we propose the first black-box attack to image segmentation models via bandit. We design a novel gradient estimator, based on bandit feedback, which is query-efficient and provably unbiased and stable. We use this gradient estimator to design a projected bandit gradient descent (PBGD) attack, as well as a certified radius-guided PBGD (CR-PBGD) attack. We prove our PBGD and CR-PBGD attacks can achieve asymptotically optimal attack performance with an optimal rate. We evaluate our certified-radius guided white-box and black-box attacks on multiple modern image segmentation models and datasets. Our results validate the effectiveness of our certified radius-guided attack framework. ",
    "url": "https://arxiv.org/abs/2304.02693",
    "authors": [
      "Wenjie Qu",
      "Youqi Li",
      "Binghui Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02724",
    "title": "Exploring the Utility of Self-Supervised Pretraining Strategies for the  Detection of Absent Lung Sliding in M-Mode Lung Ultrasound",
    "abstract": "Self-supervised pretraining has been observed to improve performance in supervised learning tasks in medical imaging. This study investigates the utility of self-supervised pretraining prior to conducting supervised fine-tuning for the downstream task of lung sliding classification in M-mode lung ultrasound images. We propose a novel pairwise relationship that couples M-mode images constructed from the same B-mode image and investigate the utility of data augmentation procedure specific to M-mode lung ultrasound. The results indicate that self-supervised pretraining yields better performance than full supervision, most notably for feature extractors not initialized with ImageNet-pretrained weights. Moreover, we observe that including a vast volume of unlabelled data results in improved performance on external validation datasets, underscoring the value of self-supervision for improving generalizability in automatic ultrasound interpretation. To the authors' best knowledge, this study is the first to characterize the influence of self-supervised pretraining for M-mode ultrasound. ",
    "url": "https://arxiv.org/abs/2304.02724",
    "authors": [
      "Blake VanBerlo",
      "Brian Li",
      "Alexander Wong",
      "Jesse Hoey",
      "Robert Arntfield"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02730",
    "title": "Fair Ordering via Social Choice Theory",
    "abstract": "Control of the ordering of transactions in modern blockchains can be extremely profitable. Rather than allow one central actor to control this revenue source, recent research has studied mechanisms for decentralizing the process of computing an ordering among multiple, distributed replicas. This problem is akin to the classic problem from social choice theory of aggregating ordinal votes, applied to a streaming setting. Prior work proposes a ``$\\gamma$-batch-order-fairness'' requirement on the aggregate ordering. Under this requirement, the ordering should be divisible into contiguous batches, and when a $\\gamma$ fraction of replicas receive $tx$ before $tx^\\prime$, then $tx^\\prime$ cannot be in an earlier batch than $tx$. We extend this definition to formalize the notion that these batches should have minimal size, thereby giving the first notion of order fairness that cannot be vacuously satisfied (by arbitrarily large batches) and that can be satisfied in the presence of faulty replicas. We then show that the Ranked Pairs aggregation method produces an ordering that satisfies our fairness definition for every choice of parameter $\\gamma$ simultaneously and for any number of faulty replicas (where fairness guarantees linearly degrade as the fraction of faulty replicas increases). We then instantiate our protocol in the streaming setting. Careful analysis of the interactions between ordering dependencies enables our protocol to simulate Ranked Pairs voting in this setting, and adjustments to ordering algorithm give a protocol that (under synchronous network assumptions) always appends a transaction to the output ordering after a bounded amount of time. ",
    "url": "https://arxiv.org/abs/2304.02730",
    "authors": [
      "Geoffrey Ramseyer",
      "Ashish Goel"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.02739",
    "title": "Bengali Fake Review Detection using Semi-supervised Generative  Adversarial Networks",
    "abstract": "This paper investigates the potential of semi-supervised Generative Adversarial Networks (GANs) to fine-tune pretrained language models in order to classify Bengali fake reviews from real reviews with a few annotated data. With the rise of social media and e-commerce, the ability to detect fake or deceptive reviews is becoming increasingly important in order to protect consumers from being misled by false information. Any machine learning model will have trouble identifying a fake review, especially for a low resource language like Bengali. We have demonstrated that the proposed semi-supervised GAN-LM architecture (generative adversarial network on top of a pretrained language model) is a viable solution in classifying Bengali fake reviews as the experimental results suggest that even with only 1024 annotated samples, BanglaBERT with semi-supervised GAN (SSGAN) achieved an accuracy of 83.59% and a f1-score of 84.89% outperforming other pretrained language models - BanglaBERT generator, Bangla BERT Base and Bangla-Electra by almost 3%, 4% and 10% respectively in terms of accuracy. The experiments were conducted on a manually labeled food review dataset consisting of total 6014 real and fake reviews collected from various social media groups. Researchers that are experiencing difficulty recognizing not just fake reviews but other classification issues owing to a lack of labeled data may find a solution in our proposed methodology. ",
    "url": "https://arxiv.org/abs/2304.02739",
    "authors": [
      "Md. Tanvir Rouf Shawon",
      "G. M. Shahariar",
      "Faisal Muhammad Shah",
      "Mohammad Shafiul Alam",
      "Md. Shahriar Mahbub"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02754",
    "title": "Behavioral estimates of conceptual structure are robust across tasks in  humans but not large language models",
    "abstract": "Neural network models of language have long been used as a tool for developing hypotheses about conceptual representation in the mind and brain. For many years, such use involved extracting vector-space representations of words and using distances among these to predict or understand human behavior in various semantic tasks. In contemporary language AIs, however, it is possible to interrogate the latent structure of conceptual representations using methods nearly identical to those commonly used with human participants. The current work uses two common techniques borrowed from cognitive psychology to estimate and compare lexical-semantic structure in both humans and a well-known AI, the DaVinci variant of GPT-3. In humans, we show that conceptual structure is robust to differences in culture, language, and method of estimation. Structures estimated from AI behavior, while individually fairly consistent with those estimated from human behavior, depend much more upon the particular task used to generate behavior responses--responses generated by the very same model in the two tasks yield estimates of conceptual structure that cohere less with one another than do human structure estimates. The results suggest one important way that knowledge inhering in contemporary AIs can differ from human cognition. ",
    "url": "https://arxiv.org/abs/2304.02754",
    "authors": [
      "Siddharth Suresh",
      "Lisa Padua",
      "Kushin Mukherjee",
      "Timothy T Rogers"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02755",
    "title": "Hybrid Zonotopes Exactly Represent ReLU Neural Networks",
    "abstract": "We show that hybrid zonotopes offer an equivalent representation of feed-forward fully connected neural networks with ReLU activation functions. Our approach demonstrates that the complexity of binary variables is equal to the total number of neurons in the network and hence grows linearly in the size of the network. We demonstrate the utility of the hybrid zonotope formulation through three case studies including nonlinear function approximation, MPC closed-loop reachability and verification, and robustness of classification on the MNIST dataset. ",
    "url": "https://arxiv.org/abs/2304.02755",
    "authors": [
      "Joshua Ortiz",
      "Alyssa Vellucci",
      "Justin Koeln",
      "Justin Ruths"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.02757",
    "title": "The Saudi Privacy Policy Dataset",
    "abstract": "This paper introduces the Saudi Privacy Policy Dataset, a diverse compilation of Arabic privacy policies from various sectors in Saudi Arabia, annotated according to the 10 principles of the Personal Data Protection Law (PDPL); the PDPL was established to be compatible with General Data Protection Regulation (GDPR); one of the most comprehensive data regulations worldwide. Data were collected from multiple sources, including the Saudi Central Bank, the Saudi Arabia National United Platform, the Council of Health Insurance, and general websites using Google and Wikipedia. The final dataset includes 1,000 websites belonging to 7 sectors, 4,638 lines of text, 775,370 tokens, and a corpus size of 8,353 KB. The annotated dataset offers significant reuse potential for assessing privacy policy compliance, benchmarking privacy practices across industries, and developing automated tools for monitoring adherence to data protection regulations. By providing a comprehensive and annotated dataset of privacy policies, this paper aims to facilitate further research and development in the areas of privacy policy analysis, natural language processing, and machine learning applications related to privacy and data protection, while also serving as an essential resource for researchers, policymakers, and industry professionals interested in understanding and promoting compliance with privacy regulations in Saudi Arabia. ",
    "url": "https://arxiv.org/abs/2304.02757",
    "authors": [
      "Hend Al-Khalifa",
      "Malak Mashaabi",
      "Ghadi Al-Yahya",
      "Raghad Alnashwan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.02760",
    "title": "Adaptive Headway Motion Control and Motion Prediction for Safe Unicycle  Motion Design",
    "abstract": "Differential drive robots that can be modeled as a kinematic unicycle are a standard mobile base platform for many service and logistics robots. Safe and smooth autonomous motion around obstacles is a crucial skill for unicycle robots to perform diverse tasks in complex environments. A classical control approach for unicycle control is feedback linearization using a headway point at a fixed headway distance in front of the unicycle. The unicycle headway control brings the headway point to a desired goal location by embedding a linear headway reference dynamics, which often results in an undesired offset for the actual unicycle position. In this paper, we introduce a new unicycle headway control approach with an adaptive headway distance that overcomes this limitation, i.e., when the headway point reaches the goal the unicycle position is also at the goal. By systematically analyzing the closed-loop unicycle motion under the adaptive headway controller, we design analytical feedback motion prediction methods that bound the closed-loop unicycle position trajectory and so can be effectively used for safety assessment and safe unicycle motion design around obstacles. We present an application of adaptive headway motion control and motion prediction for safe unicycle path following around obstacles in numerical simulations. ",
    "url": "https://arxiv.org/abs/2304.02760",
    "authors": [
      "Aykut İşleyen",
      "Nathan van de Wouw",
      "Ömür Arslan"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.02763",
    "title": "A Robust Observer with Gyroscopic Bias Correction for Rotational  Dynamics",
    "abstract": "We propose an observer for rotational dynamics subject to directional and gyroscopic measurements, which simultaneously estimates the gyroscopic biases and attitude rates. We show uniform almost global asymptotic and local exponential stability of the resulting error dynamics, implying robustness against bounded disturbances. This robustness is quantified with respect to a popular nonlinear complementary filter in quantitative simulation studies, and we explore how the measurement noise propagates to the asymptotic errors as a function of tuning. This is an extended version of a paper with the same title (to appear at IFAC WC 2023). Additional mathematical details are provided in this extended version. ",
    "url": "https://arxiv.org/abs/2304.02763",
    "authors": [
      "Erjen Lefeber",
      "Marcus Greiff",
      "Anders Robertsson"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.02785",
    "title": "Performance of Data Augmentation Methods for Brazilian Portuguese Text  Classification",
    "abstract": "Improving machine learning performance while increasing model generalization has been a constantly pursued goal by AI researchers. Data augmentation techniques are often used towards achieving this target, and most of its evaluation is made using English corpora. In this work, we took advantage of different existing data augmentation methods to analyze their performances applied to text classification problems using Brazilian Portuguese corpora. As a result, our analysis shows some putative improvements in using some of these techniques; however, it also suggests further exploitation of language bias and non-English text data scarcity. ",
    "url": "https://arxiv.org/abs/2304.02785",
    "authors": [
      "Marcellus Amadeus",
      "Paulo Branco"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.02786",
    "title": "UNICORN: A Unified Backdoor Trigger Inversion Framework",
    "abstract": "The backdoor attack, where the adversary uses inputs stamped with triggers (e.g., a patch) to activate pre-planted malicious behaviors, is a severe threat to Deep Neural Network (DNN) models. Trigger inversion is an effective way of identifying backdoor models and understanding embedded adversarial behaviors. A challenge of trigger inversion is that there are many ways of constructing the trigger. Existing methods cannot generalize to various types of triggers by making certain assumptions or attack-specific constraints. The fundamental reason is that existing work does not consider the trigger's design space in their formulation of the inversion problem. This work formally defines and analyzes the triggers injected in different spaces and the inversion problem. Then, it proposes a unified framework to invert backdoor triggers based on the formalization of triggers and the identified inner behaviors of backdoor models from our analysis. Our prototype UNICORN is general and effective in inverting backdoor triggers in DNNs. The code can be found at https://github.com/RU-System-Software-and-Security/UNICORN. ",
    "url": "https://arxiv.org/abs/2304.02786",
    "authors": [
      "Zhenting Wang",
      "Kai Mei",
      "Juan Zhai",
      "Shiqing Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02797",
    "title": "DeLiRa: Self-Supervised Depth, Light, and Radiance Fields",
    "abstract": "Differentiable volumetric rendering is a powerful paradigm for 3D reconstruction and novel view synthesis. However, standard volume rendering approaches struggle with degenerate geometries in the case of limited viewpoint diversity, a common scenario in robotics applications. In this work, we propose to use the multi-view photometric objective from the self-supervised depth estimation literature as a geometric regularizer for volumetric rendering, significantly improving novel view synthesis without requiring additional information. Building upon this insight, we explore the explicit modeling of scene geometry using a generalist Transformer, jointly learning a radiance field as well as depth and light fields with a set of shared latent codes. We demonstrate that sharing geometric information across tasks is mutually beneficial, leading to improvements over single-task learning without an increase in network complexity. Our DeLiRa architecture achieves state-of-the-art results on the ScanNet benchmark, enabling high quality volumetric rendering as well as real-time novel view and depth synthesis in the limited viewpoint diversity setting. ",
    "url": "https://arxiv.org/abs/2304.02797",
    "authors": [
      "Vitor Guizilini",
      "Igor Vasiljevic",
      "Jiading Fang",
      "Rares Ambrus",
      "Sergey Zakharov",
      "Vincent Sitzmann",
      "Adrien Gaidon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02806",
    "title": "Graph Mixture of Experts: Learning on Large-Scale Graphs with Explicit  Diversity Modeling",
    "abstract": "Graph neural networks (GNNs) have been widely applied to learning over graph data. Yet, real-world graphs commonly exhibit diverse graph structures and contain heterogeneous nodes and edges. Moreover, to enhance the generalization ability of GNNs, it has become common practice to further increase the diversity of training graph structures by incorporating graph augmentations and/or performing large-scale pre-training on more graphs. Therefore, it becomes essential for a GNN to simultaneously model diverse graph structures. Yet, naively increasing the GNN model capacity will suffer from both higher inference costs and the notorious trainability issue of GNNs. This paper introduces the Mixture-of-Expert (MoE) idea to GNNs, aiming to enhance their ability to accommodate the diversity of training graph structures, without incurring computational overheads. Our new Graph Mixture of Expert (GMoE) model enables each node in the graph to dynamically select its own optimal \\textit{information aggregation experts}. These experts are trained to model different subgroups of graph structures in the training set. Additionally, GMoE includes information aggregation experts with varying aggregation hop sizes, where the experts with larger hop sizes are specialized in capturing information over longer ranges. The effectiveness of GMoE is verified through experimental results on a large variety of graph, node, and link prediction tasks in the OGB benchmark. For instance, it enhances ROC-AUC by $1.81\\%$ in ogbg-molhiv and by $1.40\\%$ in ogbg-molbbbp, as compared to the non-MoE baselines. Our code is available at https://github.com/VITA-Group/Graph-Mixture-of-Experts. ",
    "url": "https://arxiv.org/abs/2304.02806",
    "authors": [
      "Haotao Wang",
      "Ziyu Jiang",
      "Yan Han",
      "Zhangyang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02811",
    "title": "HomPINNs: homotopy physics-informed neural networks for solving the  inverse problems of nonlinear differential equations with multiple solutions",
    "abstract": "Due to the complex behavior arising from non-uniqueness, symmetry, and bifurcations in the solution space, solving inverse problems of nonlinear differential equations (DEs) with multiple solutions is a challenging task. To address this issue, we propose homotopy physics-informed neural networks (HomPINNs), a novel framework that leverages homotopy continuation and neural networks (NNs) to solve inverse problems. The proposed framework begins with the use of a NN to simultaneously approximate known observations and conform to the constraints of DEs. By utilizing the homotopy continuation method, the approximation traces the observations to identify multiple solutions and solve the inverse problem. The experiments involve testing the performance of the proposed method on one-dimensional DEs and applying it to solve a two-dimensional Gray-Scott simulation. Our findings demonstrate that the proposed method is scalable and adaptable, providing an effective solution for solving DEs with multiple solutions and unknown parameters. Moreover, it has significant potential for various applications in scientific computing, such as modeling complex systems and solving inverse problems in physics, chemistry, biology, etc. ",
    "url": "https://arxiv.org/abs/2304.02811",
    "authors": [
      "Haoyang Zheng",
      "Yao Huang",
      "Ziyang Huang",
      "Wenrui Hao",
      "Guang Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2304.02813",
    "title": "Causal Repair of Learning-enabled Cyber-physical Systems",
    "abstract": "Models of actual causality leverage domain knowledge to generate convincing diagnoses of events that caused an outcome. It is promising to apply these models to diagnose and repair run-time property violations in cyber-physical systems (CPS) with learning-enabled components (LEC). However, given the high diversity and complexity of LECs, it is challenging to encode domain knowledge (e.g., the CPS dynamics) in a scalable actual causality model that could generate useful repair suggestions. In this paper, we focus causal diagnosis on the input/output behaviors of LECs. Specifically, we aim to identify which subset of I/O behaviors of the LEC is an actual cause for a property violation. An important by-product is a counterfactual version of the LEC that repairs the run-time property by fixing the identified problematic behaviors. Based on this insights, we design a two-step diagnostic pipeline: (1) construct and Halpern-Pearl causality model that reflects the dependency of property outcome on the component's I/O behaviors, and (2) perform a search for an actual cause and corresponding repair on the model. We prove that our pipeline has the following guarantee: if an actual cause is found, the system is guaranteed to be repaired; otherwise, we have high probabilistic confidence that the LEC under analysis did not cause the property violation. We demonstrate that our approach successfully repairs learned controllers on a standard OpenAI Gym benchmark. ",
    "url": "https://arxiv.org/abs/2304.02813",
    "authors": [
      "Pengyuan Lu",
      "Ivan Ruchkin",
      "Matthew Cleaveland",
      "Oleg Sokolsky",
      "Insup Lee"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2304.02833",
    "title": "DoUnseen: Zero-Shot Object Detection for Robotic Grasping",
    "abstract": "How can we segment varying numbers of objects where each specific object represents its own separate class? To make the problem even more realistic, how can we add and delete classes on the fly without retraining? This is the case of robotic applications where no datasets of the objects exist or application that includes thousands of objects (E.g., in logistics) where it is impossible to train a single model to learn all of the objects. Most current research on object segmentation for robotic grasping focuses on class-level object segmentation (E.g., box, cup, bottle), closed sets (specific objects of a dataset; for example, YCB dataset), or deep learning-based template matching. In this work, we are interested in open sets where the number of classes is unknown, varying, and without pre-knowledge about the objects' types. We consider each specific object as its own separate class. Our goal is to develop a zero-shot object detector that requires no training and can add any object as a class just by capturing a few images of the object. Our main idea is to break the segmentation pipelines into two steps by combining unseen object segmentation networks cascaded by zero-shot classifiers. We evaluate our zero-shot object detector on unseen datasets and compare it to a trained Mask R-CNN on those datasets. The results show that the performance varies from practical to unsuitable depending on the environment setup and the objects being handled. The code is available in our DoUnseen library repository. ",
    "url": "https://arxiv.org/abs/2304.02833",
    "authors": [
      "Anas Gouda",
      "Moritz Roidl"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.02834",
    "title": "Probing the Purview of Neural Networks via Gradient Analysis",
    "abstract": "We analyze the data-dependent capacity of neural networks and assess anomalies in inputs from the perspective of networks during inference. The notion of data-dependent capacity allows for analyzing the knowledge base of a model populated by learned features from training data. We define purview as the additional capacity necessary to characterize inference samples that differ from the training data. To probe the purview of a network, we utilize gradients to measure the amount of change required for the model to characterize the given inputs more accurately. To eliminate the dependency on ground-truth labels in generating gradients, we introduce confounding labels that are formulated by combining multiple categorical labels. We demonstrate that our gradient-based approach can effectively differentiate inputs that cannot be accurately represented with learned features. We utilize our approach in applications of detecting anomalous inputs, including out-of-distribution, adversarial, and corrupted samples. Our approach requires no hyperparameter tuning or additional data processing and outperforms state-of-the-art methods by up to 2.7%, 19.8%, and 35.6% of AUROC scores, respectively. ",
    "url": "https://arxiv.org/abs/2304.02834",
    "authors": [
      "Jinsol Lee",
      "Charlie Lehman",
      "Mohit Prabhushankar",
      "Ghassan AlRegib"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02835",
    "title": "GIF: A General Graph Unlearning Strategy via Influence Function",
    "abstract": "With the greater emphasis on privacy and security in our society, the problem of graph unlearning -- revoking the influence of specific data on the trained GNN model, is drawing increasing attention. However, ranging from machine unlearning to recently emerged graph unlearning methods, existing efforts either resort to retraining paradigm, or perform approximate erasure that fails to consider the inter-dependency between connected neighbors or imposes constraints on GNN structure, therefore hard to achieve satisfying performance-complexity trade-offs. In this work, we explore the influence function tailored for graph unlearning, so as to improve the unlearning efficacy and efficiency for graph unlearning. We first present a unified problem formulation of diverse graph unlearning tasks \\wrt node, edge, and feature. Then, we recognize the crux to the inability of traditional influence function for graph unlearning, and devise Graph Influence Function (GIF), a model-agnostic unlearning method that can efficiently and accurately estimate parameter changes in response to a $\\epsilon$-mass perturbation in deleted data. The idea is to supplement the objective of the traditional influence function with an additional loss term of the influenced neighbors due to the structural dependency. Further deductions on the closed-form solution of parameter changes provide a better understanding of the unlearning mechanism. We conduct extensive experiments on four representative GNN models and three benchmark datasets to justify the superiority of GIF for diverse graph unlearning tasks in terms of unlearning efficacy, model utility, and unlearning efficiency. Our implementations are available at \\url{https://github.com/wujcan/GIF-torch/}. ",
    "url": "https://arxiv.org/abs/2304.02835",
    "authors": [
      "Jiancan Wu",
      "Yi Yang",
      "Yuchun Qian",
      "Yongduo Sui",
      "Xiang Wang",
      "Xiangnan He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.02838",
    "title": "TBDetector:Transformer-Based Detector for Advanced Persistent Threats  with Provenance Graph",
    "abstract": "APT detection is difficult to detect due to the long-term latency, covert and slow multistage attack patterns of Advanced Persistent Threat (APT). To tackle these issues, we propose TBDetector, a transformer-based advanced persistent threat detection method for APT attack detection. Considering that provenance graphs provide rich historical information and have the powerful attacks historic correlation ability to identify anomalous activities, TBDetector employs provenance analysis for APT detection, which summarizes long-running system execution with space efficiency and utilizes transformer with self-attention based encoder-decoder to extract long-term contextual features of system states to detect slow-acting attacks. Furthermore, we further introduce anomaly scores to investigate the anomaly of different system states, where each state is calculated with an anomaly score corresponding to its similarity score and isolation score. To evaluate the effectiveness of the proposed method, we have conducted experiments on five public datasets, i.e., streamspot, cadets, shellshock, clearscope, and wget_baseline. Experimental results and comparisons with state-of-the-art methods have exhibited better performance of our proposed method. ",
    "url": "https://arxiv.org/abs/2304.02838",
    "authors": [
      "Nan Wang",
      "Xuezhi Wen",
      "Dalin Zhang",
      "Xibin Zhao",
      "Jiahui Ma",
      "Mengxia Luo",
      "Sen Nie",
      "Shi Wu",
      "Jiqiang Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02840",
    "title": "NTK-SAP: Improving neural network pruning by aligning training dynamics",
    "abstract": "Pruning neural networks before training has received increasing interest due to its potential to reduce training time and memory. One popular method is to prune the connections based on a certain metric, but it is not entirely clear what metric is the best choice. Recent advances in neural tangent kernel (NTK) theory suggest that the training dynamics of large enough neural networks is closely related to the spectrum of the NTK. Motivated by this finding, we propose to prune the connections that have the least influence on the spectrum of the NTK. This method can help maintain the NTK spectrum, which may help align the training dynamics to that of its dense counterpart. However, one possible issue is that the fixed-weight-NTK corresponding to a given initial point can be very different from the NTK corresponding to later iterates during the training phase. We further propose to sample multiple realizations of random weights to estimate the NTK spectrum. Note that our approach is weight-agnostic, which is different from most existing methods that are weight-dependent. In addition, we use random inputs to compute the fixed-weight-NTK, making our method data-agnostic as well. We name our foresight pruning algorithm Neural Tangent Kernel Spectrum-Aware Pruning (NTK-SAP). Empirically, our method achieves better performance than all baselines on multiple datasets. ",
    "url": "https://arxiv.org/abs/2304.02840",
    "authors": [
      "Yite Wang",
      "Dawei Li",
      "Ruoyu Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.02841",
    "title": "Learning Neural Eigenfunctions for Unsupervised Semantic Segmentation",
    "abstract": "Unsupervised semantic segmentation is a long-standing challenge in computer vision with great significance. Spectral clustering is a theoretically grounded solution to it where the spectral embeddings for pixels are computed to construct distinct clusters. Despite recent progress in enhancing spectral clustering with powerful pre-trained models, current approaches still suffer from inefficiencies in spectral decomposition and inflexibility in applying them to the test data. This work addresses these issues by casting spectral clustering as a parametric approach that employs neural network-based eigenfunctions to produce spectral embeddings. The outputs of the neural eigenfunctions are further restricted to discrete vectors that indicate clustering assignments directly. As a result, an end-to-end NN-based paradigm of spectral clustering emerges. In practice, the neural eigenfunctions are lightweight and take the features from pre-trained models as inputs, improving training efficiency and unleashing the potential of pre-trained models for dense prediction. We conduct extensive empirical studies to validate the effectiveness of our approach and observe significant performance gains over competitive baselines on Pascal Context, Cityscapes, and ADE20K benchmarks. ",
    "url": "https://arxiv.org/abs/2304.02841",
    "authors": [
      "Zhijie Deng",
      "Yucen Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02845",
    "title": "Robust Neural Architecture Search",
    "abstract": "Neural Architectures Search (NAS) becomes more and more popular over these years. However, NAS-generated models tends to suffer greater vulnerability to various malicious attacks. Lots of robust NAS methods leverage adversarial training to enhance the robustness of NAS-generated models, however, they neglected the nature accuracy of NAS-generated models. In our paper, we propose a novel NAS method, Robust Neural Architecture Search (RNAS). To design a regularization term to balance accuracy and robustness, RNAS generates architectures with both high accuracy and good robustness. To reduce search cost, we further propose to use noise examples instead adversarial examples as input to search architectures. Extensive experiments show that RNAS achieves state-of-the-art (SOTA) performance on both image classification and adversarial attacks, which illustrates the proposed RNAS achieves a good tradeoff between robustness and accuracy. ",
    "url": "https://arxiv.org/abs/2304.02845",
    "authors": [
      "Xunyu Zhu",
      "Jian Li",
      "Yong Liu",
      "Weiping Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.02847",
    "title": "Robustmix: Improving Robustness by Regularizing the Frequency Bias of  Deep Nets",
    "abstract": "Deep networks have achieved impressive results on a range of well-curated benchmark datasets. Surprisingly, their performance remains sensitive to perturbations that have little effect on human performance. In this work, we propose a novel extension of Mixup called Robustmix that regularizes networks to classify based on lower-frequency spatial features. We show that this type of regularization improves robustness on a range of benchmarks such as Imagenet-C and Stylized Imagenet. It adds little computational overhead and, furthermore, does not require a priori knowledge of a large set of image transformations. We find that this approach further complements recent advances in model architecture and data augmentation, attaining a state-of-the-art mCE of 44.8 with an EfficientNet-B8 model and RandAugment, which is a reduction of 16 mCE compared to the baseline. ",
    "url": "https://arxiv.org/abs/2304.02847",
    "authors": [
      "Jonas Ngnawe",
      "Marianne ABEMGNIGNI NJIFON",
      "Jonathan Heek",
      "Yann Dauphin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02848",
    "title": "Patch-aware Batch Normalization for Improving Cross-domain Robustness",
    "abstract": "Despite the significant success of deep learning in computer vision tasks, cross-domain tasks still present a challenge in which the model's performance will degrade when the training set and the test set follow different distributions. Most existing methods employ adversarial learning or instance normalization for achieving data augmentation to solve this task. In contrast, considering that the batch normalization (BN) layer may not be robust for unseen domains and there exist the differences between local patches of an image, we propose a novel method called patch-aware batch normalization (PBN). To be specific, we first split feature maps of a batch into non-overlapping patches along the spatial dimension, and then independently normalize each patch to jointly optimize the shared BN parameter at each iteration. By exploiting the differences between local patches of an image, our proposed PBN can effectively enhance the robustness of the model's parameters. Besides, considering the statistics from each patch may be inaccurate due to their smaller size compared to the global feature maps, we incorporate the globally accumulated statistics with the statistics from each batch to obtain the final statistics for normalizing each patch. Since the proposed PBN can replace the typical BN, it can be integrated into most existing state-of-the-art methods. Extensive experiments and analysis demonstrate the effectiveness of our PBN in multiple computer vision tasks, including classification, object detection, instance retrieval, and semantic segmentation. ",
    "url": "https://arxiv.org/abs/2304.02848",
    "authors": [
      "Lei Qi",
      "Dongjia Zhao",
      "Yinghuan Shi",
      "Xin Geng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02853",
    "title": "Learning Instance-Level Representation for Large-Scale Multi-Modal  Pretraining in E-commerce",
    "abstract": "This paper aims to establish a generic multi-modal foundation model that has the scalable capability to massive downstream applications in E-commerce. Recently, large-scale vision-language pretraining approaches have achieved remarkable advances in the general domain. However, due to the significant differences between natural and product images, directly applying these frameworks for modeling image-level representations to E-commerce will be inevitably sub-optimal. To this end, we propose an instance-centric multi-modal pretraining paradigm called ECLIP in this work. In detail, we craft a decoder architecture that introduces a set of learnable instance queries to explicitly aggregate instance-level semantics. Moreover, to enable the model to focus on the desired product instance without reliance on expensive manual annotations, two specially configured pretext tasks are further proposed. Pretrained on the 100 million E-commerce-related data, ECLIP successfully extracts more generic, semantic-rich, and robust representations. Extensive experimental results show that, without further fine-tuning, ECLIP surpasses existing methods by a large margin on a broad range of downstream tasks, demonstrating the strong transferability to real-world E-commerce applications. ",
    "url": "https://arxiv.org/abs/2304.02853",
    "authors": [
      "Yang Jin",
      "Yongzhi Li",
      "Zehuan Yuan",
      "Yadong Mu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02858",
    "title": "A review of ensemble learning and data augmentation models for class  imbalanced problems: combination, implementation and evaluation",
    "abstract": "Class imbalance (CI) in classification problems arises when the number of observations belonging to one class is lower than the other classes. Ensemble learning that combines multiple models to obtain a robust model has been prominently used with data augmentation methods to address class imbalance problems. In the last decade, a number of strategies have been added to enhance ensemble learning and data augmentation methods, along with new methods such as generative adversarial networks (GANs). A combination of these has been applied in many studies, but the true rank of different combinations would require a computational review. In this paper, we present a computational review to evaluate data augmentation and ensemble learning methods used to address prominent benchmark CI problems. We propose a general framework that evaluates 10 data augmentation and 10 ensemble learning methods for CI problems. Our objective was to identify the most effective combination for improving classification performance on imbalanced datasets. The results indicate that combinations of data augmentation methods with ensemble learning can significantly improve classification performance on imbalanced datasets. These findings have important implications for the development of more effective approaches for handling imbalanced datasets in machine learning applications. ",
    "url": "https://arxiv.org/abs/2304.02858",
    "authors": [
      "Azal Ahmad Khan",
      "Omkar Chaudhari",
      "Rohitash Chandra"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.02867",
    "title": "VPFusion: Towards Robust Vertical Representation Learning for 3D Object  Detection",
    "abstract": "Efficient point cloud representation is a fundamental element of Lidar-based 3D object detection. Recent grid-based detectors usually divide point clouds into voxels or pillars and construct single-stream networks in Bird's Eye View. However, these point cloud encoding paradigms underestimate the point representation in the vertical direction, which cause the loss of semantic or fine-grained information, especially for vertical sensitive objects like pedestrian and cyclists. In this paper, we propose an explicit vertical multi-scale representation learning framework, VPFusion, to combine the complementary information from both voxel and pillar streams. Specifically, VPFusion first builds upon a sparse voxel-pillar-based backbone. The backbone divides point clouds into voxels and pillars, then encodes features with 3D and 2D sparse convolution simultaneously. Next, we introduce the Sparse Fusion Layer (SFL), which establishes a bidirectional pathway for sparse voxel and pillar features to enable the interaction between them. Additionally, we present the Dense Fusion Neck (DFN) to effectively combine the dense feature maps from voxel and pillar branches with multi-scale. Extensive experiments on the large-scale Waymo Open Dataset and nuScenes Dataset demonstrate that VPFusion surpasses the single-stream baselines by a large margin and achieves state-of-the-art performance with real-time inference speed. ",
    "url": "https://arxiv.org/abs/2304.02867",
    "authors": [
      "Yuhao Huang",
      "Sanping Zhou",
      "Junjie Zhang",
      "Jinpeng Dong",
      "Nanning Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02870",
    "title": "Protecting User Privacy in Online Settings via Supervised Learning",
    "abstract": "Companies that have an online presence-in particular, companies that are exclusively digital-often subscribe to this business model: collect data from the user base, then expose the data to advertisement agencies in order to turn a profit. Such companies routinely market a service as \"free\", while obfuscating the fact that they tend to \"charge\" users in the currency of personal information rather than money. However, online companies also gather user data for more principled purposes, such as improving the user experience and aggregating statistics. The problem is the sale of user data to third parties. In this work, we design an intelligent approach to online privacy protection that leverages supervised learning. By detecting and blocking data collection that might infringe on a user's privacy, we can restore a degree of digital privacy to the user. In our evaluation, we collect a dataset of network requests and measure the performance of several classifiers that adhere to the supervised learning paradigm. The results of our evaluation demonstrate the feasibility and potential of our approach. ",
    "url": "https://arxiv.org/abs/2304.02870",
    "authors": [
      "Alexandru Rusescu",
      "Brooke Lampe",
      "Weizhi Meng"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02886",
    "title": "Automatic ICD-10 Code Association: A Challenging Task on French Clinical  Texts",
    "abstract": "Automatically associating ICD codes with electronic health data is a well-known NLP task in medical research. NLP has evolved significantly in recent years with the emergence of pre-trained language models based on Transformers architecture, mainly in the English language. This paper adapts these models to automatically associate the ICD codes. Several neural network architectures have been experimented with to address the challenges of dealing with a large set of both input tokens and labels to be guessed. In this paper, we propose a model that combines the latest advances in NLP and multi-label classification for ICD-10 code association. Fair experiments on a Clinical dataset in the French language show that our approach increases the $F_1$-score metric by more than 55\\% compared to state-of-the-art results. ",
    "url": "https://arxiv.org/abs/2304.02886",
    "authors": [
      "Yakini Tchouka",
      "Jean-François Couchot",
      "David Laiymani",
      "Philippe Selles",
      "Azzedine Rahmani"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.02892",
    "title": "Learning Cautiously in Federated Learning with Noisy and Heterogeneous  Clients",
    "abstract": "Federated learning (FL) is a distributed framework for collaboratively training with privacy guarantees. In real-world scenarios, clients may have Non-IID data (local class imbalance) with poor annotation quality (label noise). The co-existence of label noise and class imbalance in FL's small local datasets renders conventional FL methods and noisy-label learning methods both ineffective. To address the challenges, we propose FedCNI without using an additional clean proxy dataset. It includes a noise-resilient local solver and a robust global aggregator. For the local solver, we design a more robust prototypical noise detector to distinguish noisy samples. Further to reduce the negative impact brought by the noisy samples, we devise a curriculum pseudo labeling method and a denoise Mixup training strategy. For the global aggregator, we propose a switching re-weighted aggregation method tailored to different learning periods. Extensive experiments demonstrate our method can substantially outperform state-of-the-art solutions in mix-heterogeneous FL environments. ",
    "url": "https://arxiv.org/abs/2304.02892",
    "authors": [
      "Chenrui Wu",
      "Zexi Li",
      "Fangxin Wang",
      "Chao Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.02897",
    "title": "LSketch: A Label-Enabled Graph Stream Sketch Toward Time-Sensitive  Queries",
    "abstract": "Graph streams represent data interactions in real applications. The mining of graph streams plays an important role in network security, social network analysis, and traffic control, among others. However, the sheer volume and high dynamics cause great challenges for efficient storage and subsequent query analysis on them. Current studies apply sketches to summarize graph streams. We propose LSketch that works for heterogeneous graph streams, which effectively preserves the label information carried by the streams in real scenes, thereby enriching the expressive ability of sketches. In addition, as graph streams continue to evolve over time, edges too old may lose their practical significance. Therefore, we introduce the sliding window model into LSketch to eliminate the expired edges automatically. LSketch uses sub-linear storage space and can support structure based queries and time-sensitive queries with high accuracy. We perform extensive experiments over four real datasets, demonstrating the superiority of the proposed method over state-of-the-art methods, in aspects of query accuracy and time efficiency. ",
    "url": "https://arxiv.org/abs/2304.02897",
    "authors": [
      "Yiling Zeng",
      "Chunyao Song",
      "Yuhan Li",
      "Tingjian Ge"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2304.02931",
    "title": "Mask Detection and Classification in Thermal Face Images",
    "abstract": "Face masks are recommended to reduce the transmission of many viruses, especially SARS-CoV-2. Therefore, the automatic detection of whether there is a mask on the face, what type of mask is worn, and how it is worn is an important research topic. In this work, the use of thermal imaging was considered to analyze the possibility of detecting (localizing) a mask on the face, as well as to check whether it is possible to classify the type of mask on the face. The previously proposed dataset of thermal images was extended and annotated with the description of a type of mask and a location of a mask within a face. Different deep learning models were adapted. The best model for face mask detection turned out to be the Yolov5 model in the \"nano\" version, reaching mAP higher than 97% and precision of about 95%. High accuracy was also obtained for mask type classification. The best results were obtained for the convolutional neural network model built on an autoencoder initially trained in the thermal image reconstruction problem. The pretrained encoder was used to train a classifier which achieved an accuracy of 91%. ",
    "url": "https://arxiv.org/abs/2304.02931",
    "authors": [
      "Natalia Kowalczyk",
      "Jacek Rumiński"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.02932",
    "title": "Quantifying and Defending against Privacy Threats on Federated Knowledge  Graph Embedding",
    "abstract": "Knowledge Graph Embedding (KGE) is a fundamental technique that extracts expressive representation from knowledge graph (KG) to facilitate diverse downstream tasks. The emerging federated KGE (FKGE) collaboratively trains from distributed KGs held among clients while avoiding exchanging clients' sensitive raw KGs, which can still suffer from privacy threats as evidenced in other federated model trainings (e.g., neural networks). However, quantifying and defending against such privacy threats remain unexplored for FKGE which possesses unique properties not shared by previously studied models. In this paper, we conduct the first holistic study of the privacy threat on FKGE from both attack and defense perspectives. For the attack, we quantify the privacy threat by proposing three new inference attacks, which reveal substantial privacy risk by successfully inferring the existence of the KG triple from victim clients. For the defense, we propose DP-Flames, a novel differentially private FKGE with private selection, which offers a better privacy-utility tradeoff by exploiting the entity-binding sparse gradient property of FKGE and comes with a tight privacy accountant by incorporating the state-of-the-art private selection technique. We further propose an adaptive privacy budget allocation policy to dynamically adjust defense magnitude across the training procedure. Comprehensive evaluations demonstrate that the proposed defense can successfully mitigate the privacy threat by effectively reducing the success rate of inference attacks from $83.1\\%$ to $59.4\\%$ on average with only a modest utility decrease. ",
    "url": "https://arxiv.org/abs/2304.02932",
    "authors": [
      "Yuke Hu",
      "Wei Liang",
      "Ruofan Wu",
      "Kai Xiao",
      "Weiqiang Wang",
      "Xiaochen Li",
      "Jinfei Liu",
      "Zhan Qin"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.02933",
    "title": "Convolutional neural networks for crack detection on flexible road  pavements",
    "abstract": "Flexible road pavements deteriorate primarily due to traffic and adverse environmental conditions. Cracking is the most common deterioration mechanism; the surveying thereof is typically conducted manually using internationally defined classification standards. In South Africa, the use of high-definition video images has been introduced, which allows for safer road surveying. However, surveying is still a tedious manual process. Automation of the detection of defects such as cracks would allow for faster analysis of road networks and potentially reduce human bias and error. This study performs a comparison of six state-of-the-art convolutional neural network models for the purpose of crack detection. The models are pretrained on the ImageNet dataset, and fine-tuned using a new real-world binary crack dataset consisting of 14000 samples. The effects of dataset augmentation are also investigated. Of the six models trained, five achieved accuracy above 97%. The highest recorded accuracy was 98%, achieved by the ResNet and VGG16 models. The dataset is available at the following URL: https://zenodo.org/record/7795975 ",
    "url": "https://arxiv.org/abs/2304.02933",
    "authors": [
      "Hermann Tapamo",
      "Anna Bosman",
      "James Maina",
      "Emile Horak"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02947",
    "title": "Adaptable and Interpretable Framework for Novelty Detection in Real-Time  IoT Systems",
    "abstract": "This paper presents the Real-time Adaptive and Interpretable Detection (RAID) algorithm. The novel approach addresses the limitations of state-of-the-art anomaly detection methods for multivariate dynamic processes, which are restricted to detecting anomalies within the scope of the model training conditions. The RAID algorithm adapts to non-stationary effects such as data drift and change points that may not be accounted for during model development, resulting in prolonged service life. A dynamic model based on joint probability distribution handles anomalous behavior detection in a system and the root cause isolation based on adaptive process limits. RAID algorithm does not require changes to existing process automation infrastructures, making it highly deployable across different domains. Two case studies involving real dynamic system data demonstrate the benefits of the RAID algorithm, including change point adaptation, root cause isolation, and improved detection accuracy. ",
    "url": "https://arxiv.org/abs/2304.02947",
    "authors": [
      "Marek Wadinger",
      "Michal Kvasnica"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.02950",
    "title": "Multi-view Adversarial Discriminator: Mine the Non-causal Factors for  Object Detection in Unseen Domains",
    "abstract": "Domain shift degrades the performance of object detection models in practical applications. To alleviate the influence of domain shift, plenty of previous work try to decouple and learn the domain-invariant (common) features from source domains via domain adversarial learning (DAL). However, inspired by causal mechanisms, we find that previous methods ignore the implicit insignificant non-causal factors hidden in the common features. This is mainly due to the single-view nature of DAL. In this work, we present an idea to remove non-causal factors from common features by multi-view adversarial training on source domains, because we observe that such insignificant non-causal factors may still be significant in other latent spaces (views) due to the multi-mode structure of data. To summarize, we propose a Multi-view Adversarial Discriminator (MAD) based domain generalization model, consisting of a Spurious Correlations Generator (SCG) that increases the diversity of source domain by random augmentation and a Multi-View Domain Classifier (MVDC) that maps features to multiple latent spaces, such that the non-causal factors are removed and the domain-invariant features are purified. Extensive experiments on six benchmarks show our MAD obtains state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2304.02950",
    "authors": [
      "Mingjun Xu",
      "Lingyun Qin",
      "Weijie Chen",
      "Shiliang Pu",
      "Lei Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02956",
    "title": "SwarmGear: Heterogeneous Swarm of Drones with Reconfigurable Leader  Drone and Virtual Impedance Links for Multi-Robot Inspection",
    "abstract": "The continuous monitoring by drone swarms remains a challenging problem due to the lack of power supply and the inability of drones to land on uneven surfaces. Heterogeneous swarms, including ground and aerial vehicles, can support longer inspections and carry a higher number of sensors on board. However, their capabilities are limited by the mobility of wheeled and legged robots in a cluttered environment. In this paper, we propose a novel concept for autonomous inspection that we call SwarmGear. SwarmGear utilizes a heterogeneous swarm that investigates the environment in a leader-follower formation. The leader drone is able to land on rough terrain and traverse it by four compliant robotic legs, possessing both the functionalities of an aerial and mobile robot. To preserve the formation of the swarm during its motion, virtual impedance links were developed between the leader and the follower drones. We evaluated experimentally the accuracy of the hybrid leader drone's ground locomotion. By changing the step parameters, the optimal step configuration was found. Two types of gaits were evaluated. The experiments revealed low crosstrack error (mean of 2 cm and max of 4.8 cm) and the ability of the leader drone to move with a 190 mm step length and a 3 degree standard yaw deviation. Four types of drone formations were considered. The best formation was used for experiments with SwarmGear, and it showed low overall crosstrack error for the swarm (mean 7.9 cm for the type 1 gait and 5.1 cm for the type 2 gait). The proposed system can potentially improve the performance of autonomous swarms in cluttered and unstructured environments by allowing all agents of the swarm to switch between aerial and ground formations to overcome various obstacles and perform missions over a large area. ",
    "url": "https://arxiv.org/abs/2304.02956",
    "authors": [
      "Zhanibek Darush",
      "Mikhail Martynov",
      "Aleksey Fedoseev",
      "Aleksei Shcherbak",
      "Dzmitry Tsetserukou"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.02959",
    "title": "When approximate design for fast homomorphic computation provides  differential privacy guarantees",
    "abstract": "While machine learning has become pervasive in as diversified fields as industry, healthcare, social networks, privacy concerns regarding the training data have gained a critical importance. In settings where several parties wish to collaboratively train a common model without jeopardizing their sensitive data, the need for a private training protocol is particularly stringent and implies to protect the data against both the model's end-users and the actors of the training phase. Differential privacy (DP) and cryptographic primitives are complementary popular countermeasures against privacy attacks. Among these cryptographic primitives, fully homomorphic encryption (FHE) offers ciphertext malleability at the cost of time-consuming operations in the homomorphic domain. In this paper, we design SHIELD, a probabilistic approximation algorithm for the argmax operator which is both fast when homomorphically executed and whose inaccuracy is used as a feature to ensure DP guarantees. Even if SHIELD could have other applications, we here focus on one setting and seamlessly integrate it in the SPEED collaborative training framework from \"SPEED: Secure, PrivatE, and Efficient Deep learning\" (Grivet S\\'ebert et al., 2021) to improve its computational efficiency. After thoroughly describing the FHE implementation of our algorithm and its DP analysis, we present experimental results. To the best of our knowledge, it is the first work in which relaxing the accuracy of an homomorphic calculation is constructively usable as a degree of freedom to achieve better FHE performances. ",
    "url": "https://arxiv.org/abs/2304.02959",
    "authors": [
      "Arnaud Grivet Sébert",
      "Martin Zuber",
      "Oana Stan",
      "Renaud Sirdey",
      "Cédric Gouy-Pailler"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02961",
    "title": "HGCC: Enhancing Hyperbolic Graph Convolution Networks on Heterogeneous  Collaborative Graph for Recommendation",
    "abstract": "Due to the naturally power-law distributed nature of user-item interaction data in recommendation tasks, hyperbolic space modeling has recently been introduced into collaborative filtering methods. Among them, hyperbolic GCN combines the advantages of GCN and hyperbolic space and achieves a surprising performance. However, these methods only partially exploit the nature of hyperbolic space in their designs due to completely random embedding initialization and an inaccurate tangent space aggregation. In addition, the data used in these works mainly focus on user-item interaction data only, which further limits the performance of the models. In this paper, we propose a hyperbolic GCN collaborative filtering model, HGCC, which improves the existing hyperbolic GCN structure for collaborative filtering and incorporates side information. It keeps the long-tailed nature of the collaborative graph by adding power law prior to node embedding initialization; then, it aggregates neighbors directly in multiple hyperbolic spaces through the gyromidpoint method to obtain more accurate computation results; finally, the gate fusion with prior is used to fuse multiple embeddings of one node from different hyperbolic space automatically. Experimental results on four real datasets show that our model is highly competitive and outperforms leading baselines, including hyperbolic GCNs. Further experiments validate the efficacy of our proposed approach and give a further explanation by the learned embedding. ",
    "url": "https://arxiv.org/abs/2304.02961",
    "authors": [
      "Lu Zhang",
      "Ning Wu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2304.02963",
    "title": "Benchmarking Robustness to Text-Guided Corruptions",
    "abstract": "This study investigates the robustness of image classifiers to text-guided corruptions. We utilize diffusion models to edit images to different domains. Unlike other works that use synthetic or hand-picked data for benchmarking, we use diffusion models as they are generative models capable of learning to edit images while preserving their semantic content. Thus, the corruptions will be more realistic and the comparison will be more informative. Also, there is no need for manual labeling and we can create large-scale benchmarks with less effort. We define a prompt hierarchy based on the original ImageNet hierarchy to apply edits in different domains. As well as introducing a new benchmark we try to investigate the robustness of different vision models. The results of this study demonstrate that the performance of image classifiers decreases significantly in different language-based corruptions and edit domains. We also observe that convolutional models are more robust than transformer architectures. Additionally, we see that common data augmentation techniques can improve the performance on both the original data and the edited images. The findings of this research can help improve the design of image classifiers and contribute to the development of more robust machine learning systems. The code for generating the benchmark will be made available online upon publication. ",
    "url": "https://arxiv.org/abs/2304.02963",
    "authors": [
      "Mohammadreza Mofayezi",
      "Yasamin Medghalchi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02972",
    "title": "Training a Two Layer ReLU Network Analytically",
    "abstract": "Neural networks are usually trained with different variants of gradient descent based optimization algorithms such as stochastic gradient descent or the Adam optimizer. Recent theoretical work states that the critical points (where the gradient of the loss is zero) of two-layer ReLU networks with the square loss are not all local minima. However, in this work we will explore an algorithm for training two-layer neural networks with ReLU-like activation and the square loss that alternatively finds the critical points of the loss function analytically for one layer while keeping the other layer and the neuron activation pattern fixed. Experiments indicate that this simple algorithm can find deeper optima than Stochastic Gradient Descent or the Adam optimizer, obtaining significantly smaller training loss values on four out of the five real datasets evaluated. Moreover, the method is faster than the gradient descent methods and has virtually no tuning parameters. ",
    "url": "https://arxiv.org/abs/2304.02972",
    "authors": [
      "Adrian Barbu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.02976",
    "title": "Unconstrained Parametrization of Dissipative and Contracting Neural  Ordinary Differential Equations",
    "abstract": "In this work, we introduce and study a class of Deep Neural Networks (DNNs) in continuous-time. The proposed architecture stems from the combination of Neural Ordinary Differential Equations (Neural ODEs) with the model structure of recently introduced Recurrent Equilibrium Networks (RENs). We show how to endow our proposed NodeRENs with contractivity and dissipativity -- crucial properties for robust learning and control. Most importantly, as for RENs, we derive parametrizations of contractive and dissipative NodeRENs which are unconstrained, hence enabling their learning for a large number of parameters. We validate the properties of NodeRENs, including the possibility of handling irregularly sampled data, in a case study in nonlinear system identification. ",
    "url": "https://arxiv.org/abs/2304.02976",
    "authors": [
      "Daniele Martinelli",
      "Clara Lucía Galimberti",
      "Ian R. Manchester",
      "Luca Furieri",
      "Giancarlo Ferrari-Trecate"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02978",
    "title": "A Fast and Lightweight Network for Low-Light Image Enhancement",
    "abstract": "Low-light images often suffer from severe noise, low brightness, low contrast, and color deviation. While several low-light image enhancement methods have been proposed, there remains a lack of efficient methods that can simultaneously solve all of these problems. In this paper, we introduce FLW-Net, a Fast and LightWeight Network for low-light image enhancement that significantly improves processing speed and overall effect. To achieve efficient low-light image enhancement, we recognize the challenges of the lack of an absolute reference and the need for a large receptive field to obtain global contrast. Therefore, we propose an efficient global feature information extraction component and design loss functions based on relative information to overcome these challenges. Finally, we conduct comparative experiments to demonstrate the effectiveness of the proposed method, and the results confirm that FLW-Net can significantly reduce the complexity of supervised low-light image enhancement networks while improving processing effect. Code is available at https://github.com/hitzhangyu/FLW-Net ",
    "url": "https://arxiv.org/abs/2304.02978",
    "authors": [
      "Yu Zhang",
      "Xiaoguang Di",
      "Junde Wu",
      "RAO FU",
      "Yong Li",
      "Yue Wang",
      "Yanwu Xu",
      "Guohui YANG",
      "Chunhui Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.02983",
    "title": "Leveraging Social Interactions to Detect Misinformation on Social Media",
    "abstract": "Detecting misinformation threads is crucial to guarantee a healthy environment on social media. We address the problem using the data set created during the COVID-19 pandemic. It contains cascades of tweets discussing information weakly labeled as reliable or unreliable, based on a previous evaluation of the information source. The models identifying unreliable threads usually rely on textual features. But reliability is not just what is said, but by whom and to whom. We additionally leverage on network information. Following the homophily principle, we hypothesize that users who interact are generally interested in similar topics and spreading similar kind of news, which in turn is generally reliable or not. We test several methods to learn representations of the social interactions within the cascades, combining them with deep neural language models in a Multi-Input (MI) framework. Keeping track of the sequence of the interactions during the time, we improve over previous state-of-the-art models. ",
    "url": "https://arxiv.org/abs/2304.02983",
    "authors": [
      "Tommaso Fornaciari",
      "Luca Luceri",
      "Emilio Ferrara",
      "Dirk Hovy"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.02991",
    "title": "Exploiting the Complementarity of 2D and 3D Networks to Address  Domain-Shift in 3D Semantic Segmentation",
    "abstract": "3D semantic segmentation is a critical task in many real-world applications, such as autonomous driving, robotics, and mixed reality. However, the task is extremely challenging due to ambiguities coming from the unstructured, sparse, and uncolored nature of the 3D point clouds. A possible solution is to combine the 3D information with others coming from sensors featuring a different modality, such as RGB cameras. Recent multi-modal 3D semantic segmentation networks exploit these modalities relying on two branches that process the 2D and 3D information independently, striving to maintain the strength of each modality. In this work, we first explain why this design choice is effective and then show how it can be improved to make the multi-modal semantic segmentation more robust to domain shift. Our surprisingly simple contribution achieves state-of-the-art performances on four popular multi-modal unsupervised domain adaptation benchmarks, as well as better results in a domain generalization scenario. ",
    "url": "https://arxiv.org/abs/2304.02991",
    "authors": [
      "Adriano Cardace",
      "Pierluigi Zama Ramirez",
      "Samuele Salti",
      "Luigi Di Stefano"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03045",
    "title": "Protected or Porous: A Comparative Analysis of Threat Detection  Capability of IoT Safeguards",
    "abstract": "Consumer Internet of Things (IoT) devices are increasingly common, from smart speakers to security cameras, in homes. Along with their benefits come potential privacy and security threats. To limit these threats a number of commercial services have become available (IoT safeguards). The safeguards claim to provide protection against IoT privacy risks and security threats. However, the effectiveness and the associated privacy risks of these safeguards remains a key open question. In this paper, we investigate the threat detection capabilities of IoT safeguards for the first time. We develop and release an approach for automated safeguards experimentation to reveal their response to common security threats and privacy risks. We perform thousands of automated experiments using popular commercial IoT safeguards when deployed in a large IoT testbed. Our results indicate not only that these devices may be ineffective in preventing risks, but also their cloud interactions and data collection operations may introduce privacy risks for the households that adopt them. ",
    "url": "https://arxiv.org/abs/2304.03045",
    "authors": [
      "Anna Maria Mandalari",
      "Hamed Haddadi",
      "Daniel J. Dubois",
      "David Choffnes"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.03052",
    "title": "Generalized uncertain Nash games: Reformulation and robust equilibrium  seeking -- Extended version",
    "abstract": "We consider generalized Nash equilibrium problems (GNEPs) with linear coupling constraints affected by both local (i.e., agent-wise) and global (i.e., shared resources) disturbances taking values in polyhedral uncertainty sets. By making use of traditional tools borrowed from robust optimization, for this class of problems we derive a tractable, finite-dimensional reformulation leading to a deterministic ''extended game'', and we show that this latter still amounts to a GNEP featuring generalized Nash equilibria ''in the worst-case''. We then design a fully-distributed, accelerated algorithm based on monotone operator theory, which enjoys convergence towards a Nash equilibrium of the original, uncertain game under weak structural assumptions. Finally, we illustrate the effectiveness of the proposed distributed scheme through numerical simulations ",
    "url": "https://arxiv.org/abs/2304.03052",
    "authors": [
      "Marta Fochesato",
      "Filippo Fabiani",
      "John Lygeros"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.03054",
    "title": "Manipulating Federated Recommender Systems: Poisoning with Synthetic  Users and Its Countermeasures",
    "abstract": "Federated Recommender Systems (FedRecs) are considered privacy-preserving techniques to collaboratively learn a recommendation model without sharing user data. Since all participants can directly influence the systems by uploading gradients, FedRecs are vulnerable to poisoning attacks of malicious clients. However, most existing poisoning attacks on FedRecs are either based on some prior knowledge or with less effectiveness. To reveal the real vulnerability of FedRecs, in this paper, we present a new poisoning attack method to manipulate target items' ranks and exposure rates effectively in the top-$K$ recommendation without relying on any prior knowledge. Specifically, our attack manipulates target items' exposure rate by a group of synthetic malicious users who upload poisoned gradients considering target items' alternative products. We conduct extensive experiments with two widely used FedRecs (Fed-NCF and Fed-LightGCN) on two real-world recommendation datasets. The experimental results show that our attack can significantly improve the exposure rate of unpopular target items with extremely fewer malicious users and fewer global epochs than state-of-the-art attacks. In addition to disclosing the security hole, we design a novel countermeasure for poisoning attacks on FedRecs. Specifically, we propose a hierarchical gradient clipping with sparsified updating to defend against existing poisoning attacks. The empirical results demonstrate that the proposed defending mechanism improves the robustness of FedRecs. ",
    "url": "https://arxiv.org/abs/2304.03054",
    "authors": [
      "Wei Yuan",
      "Quoc Viet Hung Nguyen",
      "Tieke He",
      "Liang Chen",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2304.03057",
    "title": "Distributed formation-enforcing control for UAVs robust to observation  noise in relative pose measurements",
    "abstract": "A technique that allows a formation-enforcing control (FEC) derived from graph rigidity theory to interface with a realistic relative localization system is proposed in this paper. Recent research in sensor-based multi-robot control has given rise to multiple modalities of mutual relative localization systems. In particular, vision-based relative localization has reached the stage where it can be carried onboard lightweight UAVs in order to retrieve the relative positions and relative orientations of cooperating units. A separate stream of development spawned distributed formation-enforcing control which can lead individual robots into a desired formation using relative localization of their neighbors. These two fields naturally complement each other by achieving real-world flights of UAVs in formation without the need for absolute localization in the world. However, real relative localization systems are, without exception, burdened by non-negligible sensory noise, which is typically not fully taken into account in formation-enforcing control algorithms. Such noise can lead to rapid changes in velocity, which further interferes with visual localization. Our approach provides a solution to these challenges, enabling practical deployment of FEC under realistic conditions, as we demonstrated in real-world experiments. ",
    "url": "https://arxiv.org/abs/2304.03057",
    "authors": [
      "Viktor Walter",
      "Matouš Vrba",
      "Daniel Bonilla Licea",
      "Martin Saska"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.03087",
    "title": "Investigating Chain-of-thought with ChatGPT for Stance Detection on  Social Media",
    "abstract": "Stance detection predicts attitudes towards targets in texts and has gained attention with the rise of social media. Traditional approaches include conventional machine learning, early deep neural networks, and pre-trained fine-tuning models. However, with the evolution of very large pre-trained language models (VLPLMs) like ChatGPT (GPT-3.5), traditional methods face deployment challenges. The parameter-free Chain-of-Thought (CoT) approach, not requiring backpropagation training, has emerged as a promising alternative. This paper examines CoT's effectiveness in stance detection tasks, demonstrating its superior accuracy and discussing associated challenges. ",
    "url": "https://arxiv.org/abs/2304.03087",
    "authors": [
      "Bowen Zhang",
      "Xianghua Fu",
      "Daijun Ding",
      "Hu Huang",
      "Yangyang Li",
      "Liwen Jing"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.03093",
    "title": "Inductive Graph Unlearning",
    "abstract": "As a way to implement the \"right to be forgotten\" in machine learning, \\textit{machine unlearning} aims to completely remove the contributions and information of the samples to be deleted from a trained model without affecting the contributions of other samples. Recently, many frameworks for machine unlearning have been proposed, and most of them focus on image and text data. To extend machine unlearning to graph data, \\textit{GraphEraser} has been proposed. However, a critical issue is that \\textit{GraphEraser} is specifically designed for the transductive graph setting, where the graph is static and attributes and edges of test nodes are visible during training. It is unsuitable for the inductive setting, where the graph could be dynamic and the test graph information is invisible in advance. Such inductive capability is essential for production machine learning systems with evolving graphs like social media and transaction networks. To fill this gap, we propose the \\underline{{\\bf G}}\\underline{{\\bf U}}ided \\underline{{\\bf I}}n\\underline{{\\bf D}}uctiv\\underline{{\\bf E}} Graph Unlearning framework (GUIDE). GUIDE consists of three components: guided graph partitioning with fairness and balance, efficient subgraph repair, and similarity-based aggregation. Empirically, we evaluate our method on several inductive benchmarks and evolving transaction graphs. Generally speaking, GUIDE can be efficiently implemented on the inductive graph learning tasks for its low graph partition cost, no matter on computation or structure information. The code will be available here: https://github.com/Happy2Git/GUIDE. ",
    "url": "https://arxiv.org/abs/2304.03093",
    "authors": [
      "Cheng-Long Wang",
      "Mengdi Huai",
      "Di Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.03098",
    "title": "Static Fuzzy Bag-of-Words: a lightweight sentence embedding algorithm",
    "abstract": "The introduction of embedding techniques has pushed forward significantly the Natural Language Processing field. Many of the proposed solutions have been presented for word-level encoding; anyhow, in the last years, new mechanism to treat information at an higher level of aggregation, like at sentence- and document-level, have emerged. With this work we address specifically the sentence embeddings problem, presenting the Static Fuzzy Bag-of-Word model. Our model is a refinement of the Fuzzy Bag-of-Words approach, providing sentence embeddings with a predefined dimension. SFBoW provides competitive performances in Semantic Textual Similarity benchmarks, while requiring low computational resources. ",
    "url": "https://arxiv.org/abs/2304.03098",
    "authors": [
      "Matteo Muffo",
      "Roberto Tedesco",
      "Licia Sbattella",
      "Vincenzo Scotti"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.03105",
    "title": "Geometric-aware Pretraining for Vision-centric 3D Object Detection",
    "abstract": "Multi-camera 3D object detection for autonomous driving is a challenging problem that has garnered notable attention from both academia and industry. An obstacle encountered in vision-based techniques involves the precise extraction of geometry-conscious features from RGB images. Recent approaches have utilized geometric-aware image backbones pretrained on depth-relevant tasks to acquire spatial information. However, these approaches overlook the critical aspect of view transformation, resulting in inadequate performance due to the misalignment of spatial knowledge between the image backbone and view transformation. To address this issue, we propose a novel geometric-aware pretraining framework called GAPretrain. Our approach incorporates spatial and structural cues to camera networks by employing the geometric-rich modality as guidance during the pretraining phase. The transference of modal-specific attributes across different modalities is non-trivial, but we bridge this gap by using a unified bird's-eye-view (BEV) representation and structural hints derived from LiDAR point clouds to facilitate the pretraining process. GAPretrain serves as a plug-and-play solution that can be flexibly applied to multiple state-of-the-art detectors. Our experiments demonstrate the effectiveness and generalization ability of the proposed method. We achieve 46.2 mAP and 55.5 NDS on the nuScenes val set using the BEVFormer method, with a gain of 2.7 and 2.1 points, respectively. We also conduct experiments on various image backbones and view transformations to validate the efficacy of our approach. Code will be released at https://github.com/OpenDriveLab/BEVPerception-Survey-Recipe. ",
    "url": "https://arxiv.org/abs/2304.03105",
    "authors": [
      "Linyan Huang",
      "Huijie Wang",
      "Jia Zeng",
      "Shengchuan Zhang",
      "Liujuan Cao",
      "Rongrong Ji",
      "Junchi Yan",
      "Hongyang Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03108",
    "title": "FABRID: Flexible Attestation-Based Routing for Inter-Domain Networks",
    "abstract": "In its current state, the Internet does not provide end users with transparency and control regarding on-path forwarding devices. In particular, the lack of network device information reduces the trustworthiness of the forwarding path and prevents end-user applications requiring specific router capabilities from reaching their full potential. Moreover, the inability to influence the traffic's forwarding path results in applications communicating over undesired routes, while alternative paths with more desirable properties remain unusable. In this work, we present FABRID, a system that enables applications to forward traffic flexibly, potentially on multiple paths selected to comply with user-defined preferences, where information about forwarding devices is exposed and transparently attested by autonomous systems (ASes). The granularity of this information is chosen by each AS individually, protecting them from leaking sensitive network details, while the secrecy and authenticity of preferences embedded within the users' packets are protected through efficient cryptographic operations. We show the viability of FABRID by deploying it on a global SCION network test bed, and we demonstrate high throughput on commodity hardware. ",
    "url": "https://arxiv.org/abs/2304.03108",
    "authors": [
      "Cyrill Krähenbühl",
      "Marc Wyss",
      "David Basin",
      "Vincent Lenders",
      "Adrian Perrig",
      "Martin Strohmeier"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.03110",
    "title": "Continual Detection Transformer for Incremental Object Detection",
    "abstract": "Incremental object detection (IOD) aims to train an object detector in phases, each with annotations for new object categories. As other incremental settings, IOD is subject to catastrophic forgetting, which is often addressed by techniques such as knowledge distillation (KD) and exemplar replay (ER). However, KD and ER do not work well if applied directly to state-of-the-art transformer-based object detectors such as Deformable DETR and UP-DETR. In this paper, we solve these issues by proposing a ContinuaL DEtection TRansformer (CL-DETR), a new method for transformer-based IOD which enables effective usage of KD and ER in this context. First, we introduce a Detector Knowledge Distillation (DKD) loss, focusing on the most informative and reliable predictions from old versions of the model, ignoring redundant background predictions, and ensuring compatibility with the available ground-truth labels. We also improve ER by proposing a calibration strategy to preserve the label distribution of the training set, therefore better matching training and testing statistics. We conduct extensive experiments on COCO 2017 and demonstrate that CL-DETR achieves state-of-the-art results in the IOD setting. ",
    "url": "https://arxiv.org/abs/2304.03110",
    "authors": [
      "Yaoyao Liu",
      "Bernt Schiele",
      "Andrea Vedaldi",
      "Christian Rupprecht"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03112",
    "title": "Simplifying Content-Based Neural News Recommendation: On User Modeling  and Training Objectives",
    "abstract": "The advent of personalized news recommendation has given rise to increasingly complex recommender architectures. Most neural news recommenders rely on user click behavior and typically introduce dedicated user encoders that aggregate the content of clicked news into user embeddings (early fusion). These models are predominantly trained with standard point-wise classification objectives. The existing body of work exhibits two main shortcomings: (1) despite general design homogeneity, direct comparisons between models are hindered by varying evaluation datasets and protocols; (2) it leaves alternative model designs and training objectives vastly unexplored. In this work, we present a unified framework for news recommendation, allowing for a systematic and fair comparison of news recommenders across several crucial design dimensions: (i) candidate-awareness in user modeling, (ii) click behavior fusion, and (iii) training objectives. Our findings challenge the status quo in neural news recommendation. We show that replacing sizable user encoders with parameter-efficient dot products between candidate and clicked news embeddings (late fusion) often yields substantial performance gains. Moreover, our results render contrastive training a viable alternative to point-wise classification objectives. ",
    "url": "https://arxiv.org/abs/2304.03112",
    "authors": [
      "Andreea Iana",
      "Goran Glavaš",
      "Heiko Paulheim"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2304.03122",
    "title": "Is it conceivable that neurogenesis, neural Darwinism, and species  evolution could all serve as inspiration for the creation of evolutionary  deep neural networks?",
    "abstract": "Deep Neural Networks (DNNs) are built using artificial neural networks. They are part of machine learning methods that are capable of learning from data that have been used in a wide range of applications. DNNs are mainly handcrafted and they usually contain numerous layers. Research frontier has emerged that concerns automated construction of DNNs via evolutionary algorithms. This paper emphasizes the importance of what we call two-dimensional brain evolution and how it can inspire two dimensional DNN evolutionary modeling. We also highlight the connection between the dropout method which is widely-used in regularizing DNNs and neurogenesis of the brain, and how these concepts could benefit DNNs evolution.The paper concludes with several recommendations for enhancing the automatic construction of DNNs. ",
    "url": "https://arxiv.org/abs/2304.03122",
    "authors": [
      "Mohammed Al-Rawi"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.03135",
    "title": "VLPD: Context-Aware Pedestrian Detection via Vision-Language Semantic  Self-Supervision",
    "abstract": "Detecting pedestrians accurately in urban scenes is significant for realistic applications like autonomous driving or video surveillance. However, confusing human-like objects often lead to wrong detections, and small scale or heavily occluded pedestrians are easily missed due to their unusual appearances. To address these challenges, only object regions are inadequate, thus how to fully utilize more explicit and semantic contexts becomes a key problem. Meanwhile, previous context-aware pedestrian detectors either only learn latent contexts with visual clues, or need laborious annotations to obtain explicit and semantic contexts. Therefore, we propose in this paper a novel approach via Vision-Language semantic self-supervision for context-aware Pedestrian Detection (VLPD) to model explicitly semantic contexts without any extra annotations. Firstly, we propose a self-supervised Vision-Language Semantic (VLS) segmentation method, which learns both fully-supervised pedestrian detection and contextual segmentation via self-generated explicit labels of semantic classes by vision-language models. Furthermore, a self-supervised Prototypical Semantic Contrastive (PSC) learning method is proposed to better discriminate pedestrians and other classes, based on more explicit and semantic contexts obtained from VLS. Extensive experiments on popular benchmarks show that our proposed VLPD achieves superior performances over the previous state-of-the-arts, particularly under challenging circumstances like small scale and heavy occlusion. Code is available at https://github.com/lmy98129/VLPD. ",
    "url": "https://arxiv.org/abs/2304.03135",
    "authors": [
      "Mengyin Liu",
      "Jie Jiang",
      "Chao Zhu",
      "Xu-Cheng Yin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2304.03140",
    "title": "From Saliency to DINO: Saliency-guided Vision Transformer for Few-shot  Keypoint Detection",
    "abstract": "Unlike current deep keypoint detectors that are trained to recognize limited number of body parts, few-shot keypoint detection (FSKD) attempts to localize any keypoints, including novel or base keypoints, depending on the reference samples. FSKD requires the semantically meaningful relations for keypoint similarity learning to overcome the ubiquitous noise and ambiguous local patterns. One rescue comes with vision transformer (ViT) as it captures long-range relations well. However, ViT may model irrelevant features outside of the region of interest due to the global attention matrix, thus degrading similarity learning between support and query features. In this paper, we present a novel saliency-guided vision transformer, dubbed SalViT, for few-shot keypoint detection. Our SalViT enjoys a uniquely designed masked self-attention and a morphology learner, where the former introduces saliency map as a soft mask to constrain the self-attention on foregrounds, while the latter leverages the so-called power normalization to adjust morphology of saliency map, realizing ``dynamically changing receptive field''. Moreover, as salinecy detectors add computations, we show that attentive masks of DINO transformer can replace saliency. On top of SalViT, we also investigate i) transductive FSKD that enhances keypoint representations with unlabelled data and ii) FSKD under occlusions. We show that our model performs well on five public datasets and achieves ~10% PCK higher than the normally trained model under severe occlusions. ",
    "url": "https://arxiv.org/abs/2304.03140",
    "authors": [
      "Changsheng Lu",
      "Hao Zhu",
      "Piotr Koniusz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03144",
    "title": "BotTriNet: A Unified and Efficient Embedding for Social Bots Detection  via Metric Learning",
    "abstract": "A persistently popular topic in online social networks is the rapid and accurate discovery of bot accounts to prevent their invasion and harassment of genuine users. We propose a unified embedding framework called BOTTRINET, which utilizes textual content posted by accounts for bot detection based on the assumption that contexts naturally reveal account personalities and habits. Content is abundant and valuable if the system efficiently extracts bot-related information using embedding techniques. Beyond the general embedding framework that generates word, sentence, and account embeddings, we design a triplet network to tune the raw embeddings (produced by traditional natural language processing techniques) for better classification performance. We evaluate detection accuracy and f1score on a real-world dataset CRESCI2017, comprising three bot account categories and five bot sample sets. Our system achieves the highest average accuracy of 98.34% and f1score of 97.99% on two content-intensive bot sets, outperforming previous work and becoming state-of-the-art. It also makes a breakthrough on four content-less bot sets, with an average accuracy improvement of 11.52% and an average f1score increase of 16.70%. ",
    "url": "https://arxiv.org/abs/2304.03144",
    "authors": [
      "Jun Wu",
      "Xuesong Ye",
      "Man Yan Yuet"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.03145",
    "title": "Evaluating the Robustness of Machine Reading Comprehension Models to Low  Resource Entity Renaming",
    "abstract": "Question answering (QA) models have shown compelling results in the task of Machine Reading Comprehension (MRC). Recently these systems have proved to perform better than humans on held-out test sets of datasets e.g. SQuAD, but their robustness is not guaranteed. The QA model's brittleness is exposed when evaluated on adversarial generated examples by a performance drop. In this study, we explore the robustness of MRC models to entity renaming, with entities from low-resource regions such as Africa. We propose EntSwap, a method for test-time perturbations, to create a test set whose entities have been renamed. In particular, we rename entities of type: country, person, nationality, location, organization, and city, to create AfriSQuAD2. Using the perturbed test set, we evaluate the robustness of three popular MRC models. We find that compared to base models, large models perform well comparatively on novel entities. Furthermore, our analysis indicates that entity type person highly challenges the MRC models' performance. ",
    "url": "https://arxiv.org/abs/2304.03145",
    "authors": [
      "Clemencia Siro",
      "Tunde Oluwaseyi Ajayi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.03147",
    "title": "Improving Visual Question Answering Models through Robustness Analysis  and In-Context Learning with a Chain of Basic Questions",
    "abstract": "Deep neural networks have been critical in the task of Visual Question Answering (VQA), with research traditionally focused on improving model accuracy. Recently, however, there has been a trend towards evaluating the robustness of these models against adversarial attacks. This involves assessing the accuracy of VQA models under increasing levels of noise in the input, which can target either the image or the proposed query question, dubbed the main question. However, there is currently a lack of proper analysis of this aspect of VQA. This work proposes a new method that utilizes semantically related questions, referred to as basic questions, acting as noise to evaluate the robustness of VQA models. It is hypothesized that as the similarity of a basic question to the main question decreases, the level of noise increases. To generate a reasonable noise level for a given main question, a pool of basic questions is ranked based on their similarity to the main question, and this ranking problem is cast as a LASSO optimization problem. Additionally, this work proposes a novel robustness measure, R_score, and two basic question datasets to standardize the analysis of VQA model robustness. The experimental results demonstrate that the proposed evaluation method effectively analyzes the robustness of VQA models. Moreover, the experiments show that in-context learning with a chain of basic questions can enhance model accuracy. ",
    "url": "https://arxiv.org/abs/2304.03147",
    "authors": [
      "Jia-Hong Huang",
      "Modar Alfadly",
      "Bernard Ghanem",
      "Marcel Worring"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.03151",
    "title": "Assessing VoD pressure on network power consumption",
    "abstract": "Assessing the energy consumption or carbon footprint of data distribution of video streaming services is usually carried out through energy or carbon intensity figures (in Wh or gCO2e per GB). In this paper, we first review the reasons why such approaches are likely to lead to misunderstandings and potentially to erroneous conclusions. To overcome those shortcomings, we propose a new methodology whose key idea is to consider a video streaming usage at the whole scale of a territory, and evaluate the impact of this usage on the network infrastructure. At the core of our methodology is a parametric model of a simplified network and Content Delivery Network (CDN) infrastructure, which is automatically scaled according to peak usage needs. This allows us to compare the power consumption of this infrastructure under different scenarios, ranging from a sober baseline to a generalized use of high bitrate videos. Our results show that classical efficiency indicators do not reflect the power consumption increase of more intensive Internet usage, and might even lead to misleading conclusions. ",
    "url": "https://arxiv.org/abs/2304.03151",
    "authors": [
      "Gaël Guennebaud",
      "Aurélie Bugeau",
      "Antoine Dudouit"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2304.03168",
    "title": "Interference-Aware Deployment for Maximizing User Satisfaction in  Multi-UAV Wireless Networks",
    "abstract": "In this letter, we study the deployment of Unmanned Aerial Vehicle mounted Base Stations (UAV-BSs) in multi-UAV cellular networks. We model the multi-UAV deployment problem as a user satisfaction maximization problem, that is, maximizing the proportion of served ground users (GUs) that meet a given minimum data rate requirement. We propose an interference-aware deployment (IAD) algorithm for serving arbitrarily distributed outdoor GUs. The proposed algorithm can alleviate the problem of overlapping coverage between adjacent UAV-BSs to minimize inter-cell interference. Therefore, reducing co-channel interference between UAV-BSs will improve user satisfaction and ensure that most GUs can achieve the minimum data rate requirement. Simulation results show that our proposed IAD outperforms comparative methods by more than 10% in user satisfaction in high-density environments. ",
    "url": "https://arxiv.org/abs/2304.03168",
    "authors": [
      "Chuan-Chi Lai",
      "Ang-Hsun Tsai",
      "Chia-Wei Ting",
      "Ko-Han Lin",
      "Jing-Chi Ling",
      "Chia-En Tsai"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.03169",
    "title": "Selective Data Augmentation for Robust Speech Translation",
    "abstract": "Speech translation (ST) systems translate speech in one language to text in another language. End-to-end ST systems (e2e-ST) have gained popularity over cascade systems because of their enhanced performance due to reduced latency and computational cost. Though resource intensive, e2e-ST systems have the inherent ability to retain para and non-linguistic characteristics of the speech unlike cascade systems. In this paper, we propose to use an e2e architecture for English-Hindi (en-hi) ST. We use two imperfect machine translation (MT) services to translate Libri-trans en text into hi text. While each service gives MT data individually to generate parallel ST data, we propose a data augmentation strategy of noisy MT data to aid robust ST. The main contribution of this paper is the proposal of a data augmentation strategy. We show that this results in better ST (BLEU score) compared to brute force augmentation of MT data. We observed an absolute improvement of 1.59 BLEU score with our approach. ",
    "url": "https://arxiv.org/abs/2304.03169",
    "authors": [
      "Rajul Acharya",
      "Ashish Panda",
      "Sunil Kumar Kopparapu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2304.03172",
    "title": "A Privacy Preserving Distributed Model Identification Algorithm for  Power Distribution Systems",
    "abstract": "Distributed control/optimization is a promising approach for network systems due to its advantages over centralized schemes, such as robustness, cost-effectiveness, and improved privacy. However, distributed methods can have drawbacks, such as slower convergence rates due to limited knowledge of the overall network model. Additionally, ensuring privacy in the communication of sensitive information can pose implementation challenges. To address this issue, we propose a distributed model identification algorithm that enables each agent to identify the sub-model that characterizes the relationship between its local control and the overall system outputs. The proposed algorithm maintains the privacy of local agents by only communicating through dummy variables. We demonstrate the efficacy of our algorithm in the context of power distribution systems by applying it to the voltage regulation of a modified IEEE distribution system. The proposed algorithm is well-suited to the needs of power distribution controls and offers an effective solution to the challenges of distributed model identification in network systems. ",
    "url": "https://arxiv.org/abs/2304.03172",
    "authors": [
      "Chin-Yao Chang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.03184",
    "title": "Instant-NVR: Instant Neural Volumetric Rendering for Human-object  Interactions from Monocular RGBD Stream",
    "abstract": "Convenient 4D modeling of human-object interactions is essential for numerous applications. However, monocular tracking and rendering of complex interaction scenarios remain challenging. In this paper, we propose Instant-NVR, a neural approach for instant volumetric human-object tracking and rendering using a single RGBD camera. It bridges traditional non-rigid tracking with recent instant radiance field techniques via a multi-thread tracking-rendering mechanism. In the tracking front-end, we adopt a robust human-object capture scheme to provide sufficient motion priors. We further introduce a separated instant neural representation with a novel hybrid deformation module for the interacting scene. We also provide an on-the-fly reconstruction scheme of the dynamic/static radiance fields via efficient motion-prior searching. Moreover, we introduce an online key frame selection scheme and a rendering-aware refinement strategy to significantly improve the appearance details for online novel-view synthesis. Extensive experiments demonstrate the effectiveness and efficiency of our approach for the instant generation of human-object radiance fields on the fly, notably achieving real-time photo-realistic novel view synthesis under complex human-object interactions. ",
    "url": "https://arxiv.org/abs/2304.03184",
    "authors": [
      "Yuheng Jiang",
      "Kaixin Yao",
      "Zhuo Su",
      "Zhehao Shen",
      "Haimin Luo",
      "Lan Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03198",
    "title": "RFAConv: Innovating Spatital Attention and Standard Convolutional  Operation",
    "abstract": "Spatial attention has been demonstrated to enable convolutional neural networks to focus on critical information to improve network performance, but it still has limitations. In this paper, we explain the effectiveness of spatial attention from a new perspective, it is that the spatial attention mechanism essentially solves the problem of convolutional kernel parameter sharing. However, the information contained in the attention map generated by spatial attention is still lacking for large-size convolutional kernels. So, we propose a new attention mechanism called Receptive-Field Attention (RFA). The Convolutional Block Attention Module (CBAM) and Coordinate Attention (CA) only focus on spatial features and cannot fully solve the problem of convolutional kernel parameter sharing, but in RFA, the receptive-field spatial feature not only is focused but also provide good attention weights for large-size convolutional kernels. The Receptive-Field Attention convolutional operation (RFAConv) designed by RFA can be considered a new way to replace the standard convolution and brings almost negligible computational cost and a number of parameters. Numerous experiments on Imagenet-1k, MS COCO, and VOC demonstrate the superior performance of our approach in classification, object detection, and semantic segmentation tasks. Importantly, we believe that for some current spatial attention mechanisms that focus only on spatial features, it is time to improve the performance of the network by focusing on receptive-field spatial features. The code and pre-trained models for the relevant tasks can be found at https://github.com/Liuchen1997/RFAConv ",
    "url": "https://arxiv.org/abs/2304.03198",
    "authors": [
      "Xin Zhang",
      "Chen Liu",
      "Degang Yang",
      "Tingting Song",
      "Yichen Ye",
      "Ke Li",
      "Yingze Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03215",
    "title": "Hierarchical Graph Neural Network with Cross-Attention for Cross-Device  User Matching",
    "abstract": "Cross-device user matching is a critical problem in numerous domains, including advertising, recommender systems, and cybersecurity. It involves identifying and linking different devices belonging to the same person, utilizing sequence logs. Previous data mining techniques have struggled to address the long-range dependencies and higher-order connections between the logs. Recently, researchers have modeled this problem as a graph problem and proposed a two-tier graph contextual embedding (TGCE) neural network architecture, which outperforms previous methods. In this paper, we propose a novel hierarchical graph neural network architecture (HGNN), which has a more computationally efficient second level design than TGCE. Furthermore, we introduce a cross-attention (Cross-Att) mechanism in our model, which improves performance by 5% compared to the state-of-the-art TGCE method. ",
    "url": "https://arxiv.org/abs/2304.03215",
    "authors": [
      "Ali Taghibakhshi",
      "Mingyuan Ma",
      "Ashwath Aithal",
      "Onur Yilmaz",
      "Haggai Maron",
      "Matthew West"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.03216",
    "title": "On the Pareto Front of Multilingual Neural Machine Translation",
    "abstract": "In this work, we study how the generalization performance of a given direction changes with its sampling ratio in Multilingual Neural Machine Translation (MNMT). By training over 200 multilingual models with various model sizes, directions, and total numbers of tasks, we find that scalarization leads to a multitask trade-off front that deviates from the traditional Pareto front when there exists data imbalance in the training corpus. That is, the performance of certain translation directions does not improve with the increase of its weight in the multi-task optimization objective, which poses greater challenge to improve the overall performance of all directions. Based on our observations, we propose the Double Power Law to predict the unique performance trade-off front in MNMT, which is robust across various languages, data adequacy and number of tasks. Finally, we formulate sample ratio selection in MNMT as an optimization problem based on the Double Power Law, which achieves better performance than temperature searching and gradient manipulation methods using up to half of the total training budget in our experiments. ",
    "url": "https://arxiv.org/abs/2304.03216",
    "authors": [
      "Liang Chen",
      "Shuming Ma",
      "Dongdong Zhang",
      "Furu Wei",
      "Baobao Chang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.03220",
    "title": "Anomaly Detection via Gumbel Noise Score Matching",
    "abstract": "We propose Gumbel Noise Score Matching (GNSM), a novel unsupervised method to detect anomalies in categorical data. GNSM accomplishes this by estimating the scores, i.e. the gradients of log likelihoods w.r.t.~inputs, of continuously relaxed categorical distributions. We test our method on a suite of anomaly detection tabular datasets. GNSM achieves a consistently high performance across all experiments. We further demonstrate the flexibility of GNSM by applying it to image data where the model is tasked to detect poor segmentation predictions. Images ranked anomalous by GNSM show clear segmentation failures, with the outputs of GNSM strongly correlating with segmentation metrics computed on ground-truth. We outline the score matching training objective utilized by GNSM and provide an open-source implementation of our work. ",
    "url": "https://arxiv.org/abs/2304.03220",
    "authors": [
      "Ahsan Mahmood",
      "Junier Oliva",
      "Martin Styner"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03228",
    "title": "FedBot: Enhancing Privacy in Chatbots with Federated Learning",
    "abstract": "Chatbots are mainly data-driven and usually based on utterances that might be sensitive. However, training deep learning models on shared data can violate user privacy. Such issues have commonly existed in chatbots since their inception. In the literature, there have been many approaches to deal with privacy, such as differential privacy and secure multi-party computation, but most of them need to have access to users' data. In this context, Federated Learning (FL) aims to protect data privacy through distributed learning methods that keep the data in its location. This paper presents Fedbot, a proof-of-concept (POC) privacy-preserving chatbot that leverages large-scale customer support data. The POC combines Deep Bidirectional Transformer models and federated learning algorithms to protect customer data privacy during collaborative model training. The results of the proof-of-concept showcase the potential for privacy-preserving chatbots to transform the customer support industry by delivering personalized and efficient customer service that meets data privacy regulations and legal requirements. Furthermore, the system is specifically designed to improve its performance and accuracy over time by leveraging its ability to learn from previous interactions. ",
    "url": "https://arxiv.org/abs/2304.03228",
    "authors": [
      "Addi Ait-Mlouk",
      "Sadi Alawadi",
      "Salman Toor",
      "Andreas Hellander"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.03249",
    "title": "Age-Aware Gossiping in Network Topologies",
    "abstract": "We consider a fully-connected wireless gossip network which consists of a source and $n$ receiver nodes. The source updates itself with a Poisson process and also sends updates to the nodes as Poisson arrivals. Upon receiving the updates, the nodes update their knowledge about the source. The nodes gossip the data among themselves in the form of Poisson arrivals to disperse their knowledge about the source. The total gossiping rate is bounded by a constraint. The goal of the network is to be as timely as possible with the source. We propose a scheme which we coin \\emph{age sense updating multiple access in networks (ASUMAN)}, which is a distributed opportunistic gossiping scheme, where after each time the source updates itself, each node waits for a time proportional to its current age and broadcasts a signal to the other nodes of the network. This allows the nodes in the network which have higher age to remain silent and only the low-age nodes to gossip, thus utilizing a significant portion of the constrained total gossip rate. We calculate the average age for a typical node in such a network with symmetric settings, and show that the theoretical upper bound on the age scales as $O(1)$. ASUMAN, with an average age of $O(1)$, offers significant gains compared to a system where the nodes just gossip blindly with a fixed update rate, in which case the age scales as $O(\\log n)$. Further, we analyzed the performance of ASUMAN for fractional, finitely connected, sublinear and hierarchical cluster networks. Finally, we show that the $O(1)$ age scaling can be extended to asymmetric settings as well. We give an example of power law arrivals, where nodes' ages scale differently but follow the $O(1)$ bound. ",
    "url": "https://arxiv.org/abs/2304.03249",
    "authors": [
      "Purbesh Mitra",
      "Sennur Ulukus"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Multiagent Systems (cs.MA)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.03256",
    "title": "The complexity of decomposing a graph into a matching and a bounded  linear forest",
    "abstract": "Deciding whether a graph can be edge-decomposed into a matching and a $k$-bounded linear forest was recently shown by Campbell, H{\\\"o}rsch and Moore to be NP-complete for every $k \\ge 9$, and solvable in polynomial time for $k=1,2$. In the first part of this paper, we close this gap by showing that this problem is in NP-complete for every $k \\ge 3$. In the second part of the paper, we show that deciding whether a graph can be edge-decomposed into a matching and a $k$-bounded star forest is polynomially solvable for any $k \\in \\mathbb{N} \\cup \\{ \\infty \\}$, answering another question by Campbell, H{\\\"o}rsch and Moore from the same paper. ",
    "url": "https://arxiv.org/abs/2304.03256",
    "authors": [
      "Agnijo Banerjee",
      "João Pedro Marciano",
      "Adva Mond",
      "Jan Petr",
      "Julien Portier"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2304.03265",
    "title": "Causal Discovery with Score Matching on Additive Models with Arbitrary  Noise",
    "abstract": "Causal discovery methods are intrinsically constrained by the set of assumptions needed to ensure structure identifiability. Moreover additional restrictions are often imposed in order to simplify the inference task: this is the case for the Gaussian noise assumption on additive non-linear models, which is common to many causal discovery approaches. In this paper we show the shortcomings of inference under this hypothesis, analyzing the risk of edge inversion under violation of Gaussianity of the noise terms. Then, we propose a novel method for inferring the topological ordering of the variables in the causal graph, from data generated according to an additive non-linear model with a generic noise distribution. This leads to NoGAM (Not only Gaussian Additive noise Models), a causal discovery algorithm with a minimal set of assumptions and state of the art performance, experimentally benchmarked on synthetic data. ",
    "url": "https://arxiv.org/abs/2304.03265",
    "authors": [
      "Francesco Montagna",
      "Nicoletta Noceti",
      "Lorenzo Rosasco",
      "Kun Zhang",
      "Francesco Locatello"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2304.03266",
    "title": "Neural Fields meet Explicit Geometric Representation for Inverse  Rendering of Urban Scenes",
    "abstract": "Reconstruction and intrinsic decomposition of scenes from captured imagery would enable many applications such as relighting and virtual object insertion. Recent NeRF based methods achieve impressive fidelity of 3D reconstruction, but bake the lighting and shadows into the radiance field, while mesh-based methods that facilitate intrinsic decomposition through differentiable rendering have not yet scaled to the complexity and scale of outdoor scenes. We present a novel inverse rendering framework for large urban scenes capable of jointly reconstructing the scene geometry, spatially-varying materials, and HDR lighting from a set of posed RGB images with optional depth. Specifically, we use a neural field to account for the primary rays, and use an explicit mesh (reconstructed from the underlying neural field) for modeling secondary rays that produce higher-order lighting effects such as cast shadows. By faithfully disentangling complex geometry and materials from lighting effects, our method enables photorealistic relighting with specular and shadow effects on several outdoor datasets. Moreover, it supports physics-based scene manipulations such as virtual object insertion with ray-traced shadow casting. ",
    "url": "https://arxiv.org/abs/2304.03266",
    "authors": [
      "Zian Wang",
      "Tianchang Shen",
      "Jun Gao",
      "Shengyu Huang",
      "Jacob Munkberg",
      "Jon Hasselgren",
      "Zan Gojcic",
      "Wenzheng Chen",
      "Sanja Fidler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03280",
    "title": "LANe: Lighting-Aware Neural Fields for Compositional Scene Synthesis",
    "abstract": "Neural fields have recently enjoyed great success in representing and rendering 3D scenes. However, most state-of-the-art implicit representations model static or dynamic scenes as a whole, with minor variations. Existing work on learning disentangled world and object neural fields do not consider the problem of composing objects into different world neural fields in a lighting-aware manner. We present Lighting-Aware Neural Field (LANe) for the compositional synthesis of driving scenes in a physically consistent manner. Specifically, we learn a scene representation that disentangles the static background and transient elements into a world-NeRF and class-specific object-NeRFs to allow compositional synthesis of multiple objects in the scene. Furthermore, we explicitly designed both the world and object models to handle lighting variation, which allows us to compose objects into scenes with spatially varying lighting. This is achieved by constructing a light field of the scene and using it in conjunction with a learned shader to modulate the appearance of the object NeRFs. We demonstrate the performance of our model on a synthetic dataset of diverse lighting conditions rendered with the CARLA simulator, as well as a novel real-world dataset of cars collected at different times of the day. Our approach shows that it outperforms state-of-the-art compositional scene synthesis on the challenging dataset setup, via composing object-NeRFs learned from one scene into an entirely different scene whilst still respecting the lighting variations in the novel scene. For more results, please visit our project website https://lane-composition.github.io/. ",
    "url": "https://arxiv.org/abs/2304.03280",
    "authors": [
      "Akshay Krishnan",
      "Amit Raj",
      "Xianling Zhang",
      "Alexandra Carlson",
      "Nathan Tseng",
      "Sandhya Sridhar",
      "Nikita Jaipuria",
      "James Hays"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02656",
    "title": "Graph Representation Learning for Interactive Biomolecule Systems",
    "abstract": "Advances in deep learning models have revolutionized the study of biomolecule systems and their mechanisms. Graph representation learning, in particular, is important for accurately capturing the geometric information of biomolecules at different levels. This paper presents a comprehensive review of the methodologies used to represent biological molecules and systems as computer-recognizable objects, such as sequences, graphs, and surfaces. Moreover, it examines how geometric deep learning models, with an emphasis on graph-based techniques, can analyze biomolecule data to enable drug discovery, protein characterization, and biological system analysis. The study concludes with an overview of the current state of the field, highlighting the challenges that exist and the potential future research directions. ",
    "url": "https://arxiv.org/abs/2304.02656",
    "authors": [
      "Xinye Xiong",
      "Bingxin Zhou",
      "Yu Guang Wang"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02713",
    "title": "NUMSnet: Nested-U Multi-class Segmentation network for 3D Medical Image  Stacks",
    "abstract": "Semantic segmentation for medical 3D image stacks enables accurate volumetric reconstructions, computer-aided diagnostics and follow up treatment planning. In this work, we present a novel variant of the Unet model called the NUMSnet that transmits pixel neighborhood features across scans through nested layers to achieve accurate multi-class semantic segmentations with minimal training data. We analyze the semantic segmentation performance of the NUMSnet model in comparison with several Unet model variants to segment 3-7 regions of interest using only 10% of images for training per Lung-CT and Heart-CT volumetric image stacks. The proposed NUMSnet model achieves up to 20% improvement in segmentation recall with 4-9% improvement in Dice scores for Lung-CT stacks and 2.5-10% improvement in Dice scores for Heart-CT stacks when compared to the Unet++ model. The NUMSnet model needs to be trained by ordered images around the central scan of each volumetric stack. Propagation of image feature information from the 6 nested layers of the Unet++ model are found to have better computation and segmentation performances than propagation of all up-sampling layers in a Unet++ model. The NUMSnet model achieves comparable segmentation performances to existing works, while being trained on as low as 5\\% of the training images. Also, transfer learning allows faster convergence of the NUMSnet model for multi-class semantic segmentation from pathology in Lung-CT images to cardiac segmentations in Heart-CT stacks. Thus, the proposed model can standardize multi-class semantic segmentation on a variety of volumetric image stacks with minimal training dataset. This can significantly reduce the cost, time and inter-observer variabilities associated with computer-aided detections and treatment. ",
    "url": "https://arxiv.org/abs/2304.02713",
    "authors": [
      "Sohini Roychowdhury"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02720",
    "title": "Domain Generalization with Adversarial Intensity Attack for Medical  Image Segmentation",
    "abstract": "Most statistical learning algorithms rely on an over-simplified assumption, that is, the train and test data are independent and identically distributed. In real-world scenarios, however, it is common for models to encounter data from new and different domains to which they were not exposed to during training. This is often the case in medical imaging applications due to differences in acquisition devices, imaging protocols, and patient characteristics. To address this problem, domain generalization (DG) is a promising direction as it enables models to handle data from previously unseen domains by learning domain-invariant features robust to variations across different domains. To this end, we introduce a novel DG method called Adversarial Intensity Attack (AdverIN), which leverages adversarial training to generate training data with an infinite number of styles and increase data diversity while preserving essential content information. We conduct extensive evaluation experiments on various multi-domain segmentation datasets, including 2D retinal fundus optic disc/cup and 3D prostate MRI. Our results demonstrate that AdverIN significantly improves the generalization ability of the segmentation models, achieving significant improvement on these challenging datasets. Code is available upon publication. ",
    "url": "https://arxiv.org/abs/2304.02720",
    "authors": [
      "Zheyuan Zhang",
      "Bin Wang",
      "Lanhong Yao",
      "Ugur Demir",
      "Debesh Jha",
      "Ismail Baris Turkbey",
      "Boqing Gong",
      "Ulas Bagci"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02729",
    "title": "Constructing Phylogenetic Networks via Cherry Picking and Machine  Learning",
    "abstract": "Combining a set of phylogenetic trees into a single phylogenetic network that explains all of them is a fundamental challenge in evolutionary studies. Existing methods are computationally expensive and can either handle only small numbers of phylogenetic trees or are limited to severely restricted classes of networks. In this paper, we apply the recently-introduced theoretical framework of cherry picking to design a class of efficient heuristics that are guaranteed to produce a network containing each of the input trees, for datasets consisting of binary trees. Some of the heuristics in this framework are based on the design and training of a machine learning model that captures essential information on the structure of the input trees and guides the algorithms towards better solutions. We also propose simple and fast randomised heuristics that prove to be very effective when run multiple times. Unlike the existing exact methods, our heuristics are applicable to datasets of practical size, and the experimental study we conducted on both simulated and real data shows that these solutions are qualitatively good, always within some small constant factor from the optimum. Moreover, our machine-learned heuristics are one of the first applications of machine learning to phylogenetics and show its promise. ",
    "url": "https://arxiv.org/abs/2304.02729",
    "authors": [
      "Giulia Bernardini",
      "Leo van Iersel",
      "Esther Julien",
      "Leen Stougie"
    ],
    "subjectives": [
      "Populations and Evolution (q-bio.PE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02767",
    "title": "MethaneMapper: Spectral Absorption aware Hyperspectral Transformer for  Methane Detection",
    "abstract": "Methane (CH$_4$) is the chief contributor to global climate change. Recent Airborne Visible-Infrared Imaging Spectrometer-Next Generation (AVIRIS-NG) has been very useful in quantitative mapping of methane emissions. Existing methods for analyzing this data are sensitive to local terrain conditions, often require manual inspection from domain experts, prone to significant error and hence are not scalable. To address these challenges, we propose a novel end-to-end spectral absorption wavelength aware transformer network, MethaneMapper, to detect and quantify the emissions. MethaneMapper introduces two novel modules that help to locate the most relevant methane plume regions in the spectral domain and uses them to localize these accurately. Thorough evaluation shows that MethaneMapper achieves 0.63 mAP in detection and reduces the model size (by 5x) compared to the current state of the art. In addition, we also introduce a large-scale dataset of methane plume segmentation mask for over 1200 AVIRIS-NG flight lines from 2015-2022. It contains over 4000 methane plume sites. Our dataset will provide researchers the opportunity to develop and advance new methods for tackling this challenging green-house gas detection problem with significant broader social impact. Dataset and source code are public ",
    "url": "https://arxiv.org/abs/2304.02767",
    "authors": [
      "Satish Kumar",
      "Ivan Arevalo",
      "ASM Iftekhar",
      "B S Manjunath"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.02902",
    "title": "Towards Efficient MCMC Sampling in Bayesian Neural Networks by  Exploiting Symmetry",
    "abstract": "Bayesian inference in deep neural networks is challenging due to the high-dimensional, strongly multi-modal parameter posterior density landscape. Markov chain Monte Carlo approaches asymptotically recover the true posterior but are considered prohibitively expensive for large modern architectures. Local methods, which have emerged as a popular alternative, focus on specific parameter regions that can be approximated by functions with tractable integrals. While these often yield satisfactory empirical results, they fail, by definition, to account for the multi-modality of the parameter posterior. In this work, we argue that the dilemma between exact-but-unaffordable and cheap-but-inexact approaches can be mitigated by exploiting symmetries in the posterior landscape. Such symmetries, induced by neuron interchangeability and certain activation functions, manifest in different parameter values leading to the same functional output value. We show theoretically that the posterior predictive density in Bayesian neural networks can be restricted to a symmetry-free parameter reference set. By further deriving an upper bound on the number of Monte Carlo chains required to capture the functional diversity, we propose a straightforward approach for feasible Bayesian inference. Our experiments suggest that efficient sampling is indeed possible, opening up a promising path to accurate uncertainty quantification in deep learning. ",
    "url": "https://arxiv.org/abs/2304.02902",
    "authors": [
      "Jonas Gregor Wiese",
      "Lisa Wimmer",
      "Theodore Papamarkou",
      "Bernd Bischl",
      "Stephan Günnemann",
      "David Rügamer"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02911",
    "title": "Heavy-Tailed Regularization of Weight Matrices in Deep Neural Networks",
    "abstract": "Unraveling the reasons behind the remarkable success and exceptional generalization capabilities of deep neural networks presents a formidable challenge. Recent insights from random matrix theory, specifically those concerning the spectral analysis of weight matrices in deep neural networks, offer valuable clues to address this issue. A key finding indicates that the generalization performance of a neural network is associated with the degree of heavy tails in the spectrum of its weight matrices. To capitalize on this discovery, we introduce a novel regularization technique, termed Heavy-Tailed Regularization, which explicitly promotes a more heavy-tailed spectrum in the weight matrix through regularization. Firstly, we employ the Weighted Alpha and Stable Rank as penalty terms, both of which are differentiable, enabling the direct calculation of their gradients. To circumvent over-regularization, we introduce two variations of the penalty function. Then, adopting a Bayesian statistics perspective and leveraging knowledge from random matrices, we develop two novel heavy-tailed regularization methods, utilizing Powerlaw distribution and Frechet distribution as priors for the global spectrum and maximum eigenvalues, respectively. We empirically show that heavytailed regularization outperforms conventional regularization techniques in terms of generalization performance. ",
    "url": "https://arxiv.org/abs/2304.02911",
    "authors": [
      "Xuanzhe Xiao",
      "Zeng Li",
      "Chuanlong Xie",
      "Fengwei Zhou"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.03048",
    "title": "Expert-Independent Generalization of Well and Seismic Data Using Machine  Learning Methods for Complex Reservoirs Predicting During Early-Stage  Geological Exploration",
    "abstract": "The aim of this study is to develop and apply an autonomous approach for predicting the probability of hydrocarbon reservoirs spreading in the studied area. Autonomy means that after preparing and inputting geological-geophysical information, the influence of an expert on the algorithms is minimized. The study was made based on the 3D seismic survey data and well information on the early exploration stage of the studied field. As a result, a forecast of the probability of spatial distribution of reservoirs was made for two sets of input data: the base set and the set after reverse-calibration, and three-dimensional cubes of calibrated probabilities of belonging of the studied space to the identified classes were obtained. The approach presented in the paper allows for expert-independent generalization of geological and geophysical data, and to use this generalization for hypothesis testing and creating geological models based on a probabilistic representation of the reservoir. The quality of the probabilistic representation depends on the quality and quantity of the input data. Depending on the input data, the approach can be a useful tool for exploration and prospecting of geological objects, identifying potential resources, optimizing and designing field development. ",
    "url": "https://arxiv.org/abs/2304.03048",
    "authors": [
      "Dmitry Ivlev"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.03096",
    "title": "Spectral Gap Regularization of Neural Networks",
    "abstract": "We introduce Fiedler regularization, a novel approach for regularizing neural networks that utilizes spectral/graphical information. Existing regularization methods often focus on penalizing weights in a global/uniform manner that ignores the connectivity structure of the neural network. We propose to use the Fiedler value of the neural network's underlying graph as a tool for regularization. We provide theoretical motivation for this approach via spectral graph theory. We demonstrate several useful properties of the Fiedler value that make it useful as a regularization tool. We provide an approximate, variational approach for faster computation during training. We provide an alternative formulation of this framework in the form of a structurally weighted $\\text{L}_1$ penalty, thus linking our approach to sparsity induction. We provide uniform generalization error bounds for Fiedler regularization via a Rademacher complexity analysis. We performed experiments on datasets that compare Fiedler regularization with classical regularization methods such as dropout and weight decay. Results demonstrate the efficacy of Fiedler regularization. This is a journal extension of the conference paper by Tam and Dunson (2020). ",
    "url": "https://arxiv.org/abs/2304.03096",
    "authors": [
      "Edric Tam",
      "David Dunson"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.03101",
    "title": "Multi-task learning for tissue segmentation and tumor detection in  colorectal cancer histology slides",
    "abstract": "Automating tissue segmentation and tumor detection in histopathology images of colorectal cancer (CRC) is an enabler for faster diagnostic pathology workflows. At the same time it is a challenging task due to low availability of public annotated datasets and high variability of image appearance. The semi-supervised learning for CRC detection (SemiCOL) challenge 2023 provides partially annotated data to encourage the development of automated solutions for tissue segmentation and tumor detection. We propose a U-Net based multi-task model combined with channel-wise and image-statistics-based color augmentations, as well as test-time augmentation, as a candidate solution to the SemiCOL challenge. Our approach achieved a multi-task Dice score of .8655 (Arm 1) and .8515 (Arm 2) for tissue segmentation and AUROC of .9725 (Arm 1) and 0.9750 (Arm 2) for tumor detection on the challenge validation set. The source code for our approach is made publicly available at https://github.com/lely475/CTPLab_SemiCOL2023. ",
    "url": "https://arxiv.org/abs/2304.03101",
    "authors": [
      "Lydia A. Schoenpflug",
      "Maxime W. Lafarge",
      "Anja L. Frei",
      "Viktor H. Koelzer"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03113",
    "title": "Efficient SAGE Estimation via Causal Structure Learning",
    "abstract": "The Shapley Additive Global Importance (SAGE) value is a theoretically appealing interpretability method that fairly attributes global importance to a model's features. However, its exact calculation requires the computation of the feature's surplus performance contributions over an exponential number of feature sets. This is computationally expensive, particularly because estimating the surplus contributions requires sampling from conditional distributions. Thus, SAGE approximation algorithms only take a fraction of the feature sets into account. We propose $d$-SAGE, a method that accelerates SAGE approximation. $d$-SAGE is motivated by the observation that conditional independencies (CIs) between a feature and the model target imply zero surplus contributions, such that their computation can be skipped. To identify CIs, we leverage causal structure learning (CSL) to infer a graph that encodes (conditional) independencies in the data as $d$-separations. This is computationally more efficient because the expense of the one-time graph inference and the $d$-separation queries is negligible compared to the expense of surplus contribution evaluations. Empirically we demonstrate that $d$-SAGE enables the efficient and accurate estimation of SAGE values. ",
    "url": "https://arxiv.org/abs/2304.03113",
    "authors": [
      "Christoph Luther",
      "Gunnar König",
      "Moritz Grosse-Wentrup"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.03210",
    "title": "Causal Discovery and Optimal Experimental Design for Genome-Scale  Biological Network Recovery",
    "abstract": "Causal discovery of genome-scale networks is important for identifying pathways from genes to observable traits - e.g. differences in cell function, disease, drug resistance and others. Causal learners based on graphical models rely on interventional samples to orient edges in the network. However, these models have not been shown to scale up the size of the genome, which are on the order of 1e3-1e4 genes. We introduce a new learner, SP-GIES, that jointly learns from interventional and observational datasets and achieves almost 4x speedup against an existing learner for 1,000 node networks. SP-GIES achieves an AUC-PR score of 0.91 on 1,000 node networks, and scales up to 2,000 node networks - this is 4x larger than existing works. We also show how SP-GIES improves downstream optimal experimental design strategies for selecting interventional experiments to perform on the system. This is an important step forward in realizing causal discovery at scale via autonomous experimental design. ",
    "url": "https://arxiv.org/abs/2304.03210",
    "authors": [
      "Ashka Shah",
      "Arvind Ramanathan",
      "Valerie Hayot-Sasson",
      "Rick Stevens"
    ],
    "subjectives": [
      "Molecular Networks (q-bio.MN)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2304.03247",
    "title": "A Bayesian Framework for Causal Analysis of Recurrent Events in Presence  of Immortal Risk",
    "abstract": "Observational studies of recurrent event rates are common in biomedical statistics. Broadly, the goal is to estimate differences in event rates under two treatments within a defined target population over a specified followup window. Estimation with observational claims data is challenging because while membership in the target population is defined in terms of eligibility criteria, treatment is rarely assigned exactly at the time of eligibility. Ad-hoc solutions to this timing misalignment, such as assigning treatment at eligibility based on subsequent assignment, incorrectly attribute prior event rates to treatment - resulting in immortal risk bias. Even if eligibility and treatment are aligned, a terminal event process (e.g. death) often stops the recurrent event process of interest. Both processes are also censored so that events are not observed over the entire followup window. Our approach addresses misalignment by casting it as a treatment switching problem: some patients are on treatment at eligibility while others are off treatment but may switch to treatment at a specified time - if they survive long enough. We define and identify an average causal effect of switching under specified causal assumptions. Estimation is done using a g-computation framework with a joint semiparametric Bayesian model for the death and recurrent event processes. Computing the estimand for various switching times allows us to assess the impact of treatment timing. We apply the method to contrast hospitalization rates under different opioid treatment strategies among patients with chronic back pain using Medicare claims data. ",
    "url": "https://arxiv.org/abs/2304.03247",
    "authors": [
      "Arman Oganisian",
      "Anthony Girard",
      "Jon A. Steingrimsson",
      "Patience Moyo"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1907.03244",
    "title": "Time Distance: A Novel Collision Prediction and Path Planning Method",
    "abstract": " Title: Time Distance: A Novel Collision Prediction and Path Planning Method ",
    "url": "https://arxiv.org/abs/1907.03244",
    "authors": [
      "Ali Analooee",
      "Shahram Azadi",
      "Reza Kazemi"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:1910.09161",
    "title": "Sequential Adversarial Anomaly Detection for One-Class Event Data",
    "abstract": " Title: Sequential Adversarial Anomaly Detection for One-Class Event Data ",
    "url": "https://arxiv.org/abs/1910.09161",
    "authors": [
      "Shixiang Zhu",
      "Henry Shaowu Yuchi",
      "Minghe Zhang",
      "Yao Xie"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2001.01330",
    "title": "Convolutional Neural Networks with Intermediate Loss for 3D  Super-Resolution of CT and MRI Scans",
    "abstract": " Comments: Accepted in IEEE Access ",
    "url": "https://arxiv.org/abs/2001.01330",
    "authors": [
      "Mariana-Iuliana Georgescu",
      "Radu Tudor Ionescu",
      "Nicolae Verga"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2008.12328",
    "title": "A Background-Agnostic Framework with Adversarial Training for Abnormal  Event Detection in Video",
    "abstract": " Comments: Accepted in IEEE Transactions on Pattern Analysis and Machine Intelligence ",
    "url": "https://arxiv.org/abs/2008.12328",
    "authors": [
      "Mariana-Iuliana Georgescu",
      "Radu Tudor Ionescu",
      "Fahad Shahbaz Khan",
      "Marius Popescu",
      "Mubarak Shah"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2106.13952",
    "title": "Spectral-Spatial Global Graph Reasoning for Hyperspectral Image  Classification",
    "abstract": " Comments: Accepted by IEEE TNNLS ",
    "url": "https://arxiv.org/abs/2106.13952",
    "authors": [
      "Di Wang",
      "Bo Du",
      "Liangpei Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2109.14251",
    "title": "Road Network Guided Fine-Grained Urban Traffic Flow Inference",
    "abstract": " Title: Road Network Guided Fine-Grained Urban Traffic Flow Inference ",
    "url": "https://arxiv.org/abs/2109.14251",
    "authors": [
      "Lingbo Liu",
      "Mengmeng Liu",
      "Guanbin Li",
      "Ziyi Wu",
      "Junfan Lin",
      "Liang Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.11084",
    "title": "Grafting Transformer on Automatically Designed Convolutional Neural  Network for Hyperspectral Image Classification",
    "abstract": " Comments: 15 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2110.11084",
    "authors": [
      "Xizhe Xue",
      "Haokui Zhang",
      "Bei Fang",
      "Zongwen Bai",
      "Ying Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.11267",
    "title": "Sequential locality of graphs and its hypothesis testing",
    "abstract": " Comments: 23 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2111.11267",
    "authors": [
      "Tatsuro Kawamoto",
      "Teruyoshi Kobayashi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2112.09279",
    "title": "Robust Upper Bounds for Adversarial Training",
    "abstract": " Title: Robust Upper Bounds for Adversarial Training ",
    "url": "https://arxiv.org/abs/2112.09279",
    "authors": [
      "Dimitris Bertsimas",
      "Xavier Boix",
      "Kimberly Villalobos Carballo",
      "Dick den Hertog"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2202.07568",
    "title": "StratDef: Strategic Defense Against Adversarial Attacks in ML-based  Malware Detection",
    "abstract": " Title: StratDef: Strategic Defense Against Adversarial Attacks in ML-based  Malware Detection ",
    "url": "https://arxiv.org/abs/2202.07568",
    "authors": [
      "Aqib Rashid",
      "Jose Such"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.09401",
    "title": "Bias Analysis of Spatial Coherence-Based RTF Vector Estimation for  Acoustic Sensor Networks in a Diffuse Sound Field",
    "abstract": " Title: Bias Analysis of Spatial Coherence-Based RTF Vector Estimation for  Acoustic Sensor Networks in a Diffuse Sound Field ",
    "url": "https://arxiv.org/abs/2205.09401",
    "authors": [
      "Wiebke Middelberg",
      "Simon Doclo"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.01041",
    "title": "End-to-End Security for Distributed Event-Driven Enclave Applications on  Heterogeneous TEEs",
    "abstract": " Comments: 41 pages main text + 4 pages appendix, accepted at ACM Transactions on Privacy and Security (TOPS), first co-authorship between Gianluca Scopelliti and Sepideh Pouyanrad, source code available at this https URL ",
    "url": "https://arxiv.org/abs/2206.01041",
    "authors": [
      "Gianluca Scopelliti",
      "Sepideh Pouyanrad",
      "Job Noorman",
      "Fritz Alder",
      "Christoph Baumann",
      "Frank Piessens",
      "Jan Tobias Mühlberg"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2206.04516",
    "title": "Accurate Node Feature Estimation with Structured Variational Graph  Autoencoder",
    "abstract": " Comments: Fixed Table 4 from the KDD 2022 version ",
    "url": "https://arxiv.org/abs/2206.04516",
    "authors": [
      "Jaemin Yoo",
      "Hyunsik Jeon",
      "Jinhong Jung",
      "U Kang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.06968",
    "title": "DASS: Differentiable Architecture Search for Sparse neural networks",
    "abstract": " Comments: 18 pages with 12 figures ",
    "url": "https://arxiv.org/abs/2207.06968",
    "authors": [
      "Hamid Mousavi",
      "Mohammad Loni",
      "Mina Alibeigi",
      "Masoud Daneshtalab"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.10909",
    "title": "DBQ-SSD: Dynamic Ball Query for Efficient 3D Object Detection",
    "abstract": " Comments: ICLR 2023. Code at this https URL ",
    "url": "https://arxiv.org/abs/2207.10909",
    "authors": [
      "Jinrong Yang",
      "Lin Song",
      "Songtao Liu",
      "Weixin Mao",
      "Zeming Li",
      "Xiaoping Li",
      "Hongbin Sun",
      "Jian Sun",
      "Nanning Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03451",
    "title": "Fast detection of specific fragments against a set of sequences",
    "abstract": " Title: Fast detection of specific fragments against a set of sequences ",
    "url": "https://arxiv.org/abs/2208.03451",
    "authors": [
      "Marie-Pierre Béal",
      "Maxime Crochemore"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2209.04562",
    "title": "The Bayan Algorithm: Detecting Communities in Networks Through Exact and  Approximate Optimization of Modularity",
    "abstract": " Comments: 6 pages, 2 figures, 1 table ",
    "url": "https://arxiv.org/abs/2209.04562",
    "authors": [
      "Samin Aref",
      "Hriday Chheda",
      "Mahdi Mostajabdaveh"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2209.06185",
    "title": "HistoPerm: A Permutation-Based View Generation Approach for Improving  Histopathologic Feature Representation Learning",
    "abstract": " Title: HistoPerm: A Permutation-Based View Generation Approach for Improving  Histopathologic Feature Representation Learning ",
    "url": "https://arxiv.org/abs/2209.06185",
    "authors": [
      "Joseph DiPalma",
      "Lorenzo Torresani",
      "Saeed Hassanpour"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.07034",
    "title": "A Temporal Densely Connected Recurrent Network for Event-based Human  Pose Estimation",
    "abstract": " Title: A Temporal Densely Connected Recurrent Network for Event-based Human  Pose Estimation ",
    "url": "https://arxiv.org/abs/2209.07034",
    "authors": [
      "Zhanpeng Shao",
      "Wen Zhou",
      "Wuzhen Wang",
      "Jianyu Yang",
      "Youfu Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.09828",
    "title": "Joint Base Station and IRS Deployment for Enhancing Network Coverage: A  Graph-Based Modeling and Optimization Approach",
    "abstract": " Comments: 14 pages. Accepted for publication by IEEE TWC. Our other works on multi-IRS aided wireless network: IRS-user associations (arXiv:2009.02551), single-path multi-hop routing (arXiv:2010.13589), multi-path multi-hop routing (arXiv:2110.11104), multi-beam multi-hop routing (arXiv:2101.00217), distributed beam training (arXiv:2106.11896), and a tutorial paper (arXiv:2109.13641) ",
    "url": "https://arxiv.org/abs/2209.09828",
    "authors": [
      "Weidong Mei",
      "Rui Zhang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2209.10691",
    "title": "PREF: Predictability Regularized Neural Motion Fields",
    "abstract": " Comments: Accepted at ECCV 2022 (oral). Paper + supplementary material ",
    "url": "https://arxiv.org/abs/2209.10691",
    "authors": [
      "Liangchen Song",
      "Xuan Gong",
      "Benjamin Planche",
      "Meng Zheng",
      "David Doermann",
      "Junsong Yuan",
      "Terrence Chen",
      "Ziyan Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.12648",
    "title": "Feedback Motion Prediction for Safe Unicycle Robot Navigation",
    "abstract": " Comments: 11 pages, 5 figures, extended version of a paper submitted to a conference publication ",
    "url": "https://arxiv.org/abs/2209.12648",
    "authors": [
      "Aykut İşleyen",
      "Nathan van de Wouw",
      "Ömür Arslan"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.13692",
    "title": "Embedding Hindsight Reasoning in Separation Logic",
    "abstract": " Title: Embedding Hindsight Reasoning in Separation Logic ",
    "url": "https://arxiv.org/abs/2209.13692",
    "authors": [
      "Roland Meyer",
      "Thomas Wies",
      "Sebastian Wolff"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2209.14750",
    "title": "Non-contrastive representation learning for intervals from well logs",
    "abstract": " Title: Non-contrastive representation learning for intervals from well logs ",
    "url": "https://arxiv.org/abs/2209.14750",
    "authors": [
      "Alexander Marusov",
      "Alexey Zaytsev"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.12496",
    "title": "Bayesian Optimization with Conformal Prediction Sets",
    "abstract": " Comments: For code, see this https URL ",
    "url": "https://arxiv.org/abs/2210.12496",
    "authors": [
      "Samuel Stanton",
      "Wesley Maddox",
      "Andrew Gordon Wilson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2211.01144",
    "title": "UniASM: Binary Code Similarity Detection without Fine-tuning",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2211.01144",
    "authors": [
      "Yeming Gu",
      "Hui Shu",
      "Fan Hu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2212.05895",
    "title": "Diff-Font: Diffusion Model for Robust One-Shot Font Generation",
    "abstract": " Title: Diff-Font: Diffusion Model for Robust One-Shot Font Generation ",
    "url": "https://arxiv.org/abs/2212.05895",
    "authors": [
      "Haibin He",
      "Xinyuan Chen",
      "Chaoyue Wang",
      "Juhua Liu",
      "Bo Du",
      "Dacheng Tao",
      "Yu Qiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.11237",
    "title": "Not Just Pretty Pictures: Text-to-Image Generators Enable Interpretable  Interventions for Robust Representations",
    "abstract": " Title: Not Just Pretty Pictures: Text-to-Image Generators Enable Interpretable  Interventions for Robust Representations ",
    "url": "https://arxiv.org/abs/2212.11237",
    "authors": [
      "Jianhao Yuan",
      "Francesco Pinto",
      "Adam Davies",
      "Aarushi Gupta",
      "Philip Torr"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13848",
    "title": "Learning Lipschitz Functions by GD-trained Shallow Overparameterized  ReLU Neural Networks",
    "abstract": " Title: Learning Lipschitz Functions by GD-trained Shallow Overparameterized  ReLU Neural Networks ",
    "url": "https://arxiv.org/abs/2212.13848",
    "authors": [
      "Ilja Kuzborskij",
      "Csaba Szepesvári"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.14532",
    "title": "Scale-MAE: A Scale-Aware Masked Autoencoder for Multiscale Geospatial  Representation Learning",
    "abstract": " Title: Scale-MAE: A Scale-Aware Masked Autoencoder for Multiscale Geospatial  Representation Learning ",
    "url": "https://arxiv.org/abs/2212.14532",
    "authors": [
      "Colorado J. Reed",
      "Ritwik Gupta",
      "Shufan Li",
      "Sarah Brockman",
      "Christopher Funk",
      "Brian Clipp",
      "Kurt Keutzer",
      "Salvatore Candido",
      "Matt Uyttendaele",
      "Trevor Darrell"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.10287",
    "title": "A Positioning System in an Urban Vertical Heterogeneous Network  (VHetNet)",
    "abstract": " Title: A Positioning System in an Urban Vertical Heterogeneous Network  (VHetNet) ",
    "url": "https://arxiv.org/abs/2301.10287",
    "authors": [
      "Hongzhao Zheng",
      "Mohamed Atia",
      "Halim Yanikomeroglu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.02013",
    "title": "IoT Botnet Detection Using an Economic Deep Learning Model",
    "abstract": " Comments: The paper under reviewing process ",
    "url": "https://arxiv.org/abs/2302.02013",
    "authors": [
      "Nelly Elsayed",
      "Zag ElSayed",
      "Magdy Bayoumi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.02442",
    "title": "Nonlinear elasticity complex and a finite element diagram chase",
    "abstract": " Comments: Manuscript prepared for proceedings of the INdAM conference \"Approximation Theory and Numerical Analysis meet Algebra, Geometry, Topology'', which was held in September 2022 at Cortona, Italy ",
    "url": "https://arxiv.org/abs/2302.02442",
    "authors": [
      "Kaibo Hu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2302.05601",
    "title": "Pruning Deep Neural Networks from a Sparsity Perspective",
    "abstract": " Comments: ICLR 2023 ",
    "url": "https://arxiv.org/abs/2302.05601",
    "authors": [
      "Enmao Diao",
      "Ganghua Wang",
      "Jiawei Zhan",
      "Yuhong Yang",
      "Jie Ding",
      "Vahid Tarokh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.11328",
    "title": "PAD: Towards Principled Adversarial Malware Detection Against Evasion  Attacks",
    "abstract": " Comments: Accepted by IEEE Transactions on Dependable and Secure Computing; To appear ",
    "url": "https://arxiv.org/abs/2302.11328",
    "authors": [
      "Deqiang Li",
      "Shicheng Cui",
      "Yun Li",
      "Jia Xu",
      "Fu Xiao",
      "Shouhuai Xu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2303.00524",
    "title": "Semi-decentralized Inference in Heterogeneous Graph Neural Networks for  Traffic Demand Forecasting: An Edge-Computing Approach",
    "abstract": " Comments: 13 pages, 10 figures, LaTeX; typos corrected, references added, mathematical analysis added ",
    "url": "https://arxiv.org/abs/2303.00524",
    "authors": [
      "Mahmoud Nazzal",
      "Abdallah Khreishah",
      "Joyoung Lee",
      "Shaahin Angizi",
      "Ala Al-Fuqaha",
      "Mohsen Guizani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.00822",
    "title": "Planning for Attacker Entrapment in Adversarial Settings",
    "abstract": " Title: Planning for Attacker Entrapment in Adversarial Settings ",
    "url": "https://arxiv.org/abs/2303.00822",
    "authors": [
      "Brittany Cates",
      "Anagha Kulkarni",
      "Sarath Sreedharan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.01726",
    "title": "On Sensitivity of Compact Directed Acyclic Word Graphs",
    "abstract": " Comments: This is a full version of the paper accepted for WORDS 2023 ",
    "url": "https://arxiv.org/abs/2303.01726",
    "authors": [
      "Hiroto Fujimaru",
      "Yuto Nakashima",
      "Shunsuke Inenaga"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2303.03324",
    "title": "Time series anomaly detection with reconstruction-based state-space  models",
    "abstract": " Title: Time series anomaly detection with reconstruction-based state-space  models ",
    "url": "https://arxiv.org/abs/2303.03324",
    "authors": [
      "Fan Wang",
      "Keli Wang",
      "Boyu Yao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.10112",
    "title": "Causal Discovery from Temporal Data: An Overview and New Perspectives",
    "abstract": " Comments: 52 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2303.10112",
    "authors": [
      "Chang Gong",
      "Di Yao",
      "Chuzhe Zhang",
      "Wenbin Li",
      "Jingping Bi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2303.13570",
    "title": "Return of the RNN: Residual Recurrent Networks for Invertible Sentence  Embeddings",
    "abstract": " Comments: Adds descriptions of the use of dropout, the use of custom C++ code, the removal of non-English sentences, other minor changes ",
    "url": "https://arxiv.org/abs/2303.13570",
    "authors": [
      "Jeremy Wilkerson"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.00202",
    "title": "Improving Fast Adversarial Training with Prior-Guided Knowledge",
    "abstract": " Title: Improving Fast Adversarial Training with Prior-Guided Knowledge ",
    "url": "https://arxiv.org/abs/2304.00202",
    "authors": [
      "Xiaojun Jia",
      "Yong Zhang",
      "Xingxing Wei",
      "Baoyuan Wu",
      "Ke Ma",
      "Jue Wang",
      "Xiaochun Cao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.00902",
    "title": "FinalMLP: An Enhanced Two-Stream MLP Model for CTR Prediction",
    "abstract": " Comments: Accepted by AAAI 2023. Code available at this https URL ",
    "url": "https://arxiv.org/abs/2304.00902",
    "authors": [
      "Kelong Mao",
      "Jieming Zhu",
      "Liangcai Su",
      "Guohao Cai",
      "Yuru Li",
      "Zhenhua Dong"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2304.01311",
    "title": "Characterizing the Users, Challenges, and Visualization Needs of  Knowledge Graphs in Practice",
    "abstract": " Title: Characterizing the Users, Challenges, and Visualization Needs of  Knowledge Graphs in Practice ",
    "url": "https://arxiv.org/abs/2304.01311",
    "authors": [
      "Harry Li",
      "Gabriel Appleby",
      "Camelia Daniela Brumar",
      "Remco Chang",
      "Ashley Suh"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Databases (cs.DB)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01347",
    "title": "Temporal Dynamic Synchronous Functional Brain Network for Schizophrenia  Diagnosis and Lateralization Analysis",
    "abstract": " Title: Temporal Dynamic Synchronous Functional Brain Network for Schizophrenia  Diagnosis and Lateralization Analysis ",
    "url": "https://arxiv.org/abs/2304.01347",
    "authors": [
      "Cheng Zhu",
      "Ying Tan",
      "Shuqi Yang",
      "Jiaqing Miao",
      "Jiayi Zhu",
      "Huan Huang",
      "Dezhong Yao",
      "Cheng Luo"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2304.01507",
    "title": "RARE: Robust Masked Graph Autoencoder",
    "abstract": " Title: RARE: Robust Masked Graph Autoencoder ",
    "url": "https://arxiv.org/abs/2304.01507",
    "authors": [
      "Wenxuan Tu",
      "Qing Liao",
      "Sihang Zhou",
      "Xin Peng",
      "Chuan Ma",
      "Zhe Liu",
      "Xinwang Liu",
      "Zhiping Cai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01598",
    "title": "MM-BSN: Self-Supervised Image Denoising for Real-World with Multi-Mask  based on Blind-Spot Network",
    "abstract": " Comments: Accepted by CVPRW 2023 ",
    "url": "https://arxiv.org/abs/2304.01598",
    "authors": [
      "Dan Zhang",
      "Fangfang Zhou",
      "Yuwen Jiang",
      "Zhengming Fu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01823",
    "title": "The structure of quasi-transitive graphs avoiding a minor with  applications to the domino problem",
    "abstract": " Comments: 41 pages, 4 figures. (Abstract shortened to meet arxiv requirements) v2: Problem 6.1 has a negative answer ",
    "url": "https://arxiv.org/abs/2304.01823",
    "authors": [
      "Louis Esperet",
      "Ugo Giocanti",
      "Clément Legrand-Duchesne"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Dynamical Systems (math.DS)",
      "Group Theory (math.GR)"
    ]
  }
]