[
  {
    "id": "arXiv:2204.10365",
    "title": "Towards an Enhanced Understanding of Bias in Pre-trained Neural Language  Models: A Survey with Special Emphasis on Affective Bias",
    "abstract": "The remarkable progress in Natural Language Processing (NLP) brought about by deep learning, particularly with the recent advent of large pre-trained neural language models, is brought into scrutiny as several studies began to discuss and report potential biases in NLP applications. Bias in NLP is found to originate from latent historical biases encoded by humans into textual data which gets perpetuated or even amplified by NLP algorithm. We present a survey to comprehend bias in large pre-trained language models, analyze the stages at which they occur in these models, and various ways in which these biases could be quantified and mitigated. Considering wide applicability of textual affective computing based downstream tasks in real-world systems such as business, healthcare, education, etc., we give a special emphasis on investigating bias in the context of affect (emotion) i.e., Affective Bias, in large pre-trained language models. We present a summary of various bias evaluation corpora that help to aid future research and discuss challenges in the research on bias in pre-trained language models. We believe that our attempt to draw a comprehensive view of bias in pre-trained language models, and especially the exploration of affective bias will be highly beneficial to researchers interested in this evolving field. ",
    "url": "https://arxiv.org/abs/2204.10365",
    "authors": [
      "Anoop K.",
      "Manjary P. Gangan",
      "Deepak P.",
      "Lajish V. L"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10374",
    "title": "Learning how to Interact with a Complex Interface using Hierarchical  Reinforcement Learning",
    "abstract": "Hierarchical Reinforcement Learning (HRL) allows interactive agents to decompose complex problems into a hierarchy of sub-tasks. Higher-level tasks can invoke the solutions of lower-level tasks as if they were primitive actions. In this work, we study the utility of hierarchical decompositions for learning an appropriate way to interact with a complex interface. Specifically, we train HRL agents that can interface with applications in a simulated Android device. We introduce a Hierarchical Distributed Deep Reinforcement Learning architecture that learns (1) subtasks corresponding to simple finger gestures, and (2) how to combine these gestures to solve several Android tasks. Our approach relies on goal conditioning and can be used more generally to convert any base RL agent into an HRL agent. We use the AndroidEnv environment to evaluate our approach. For the experiments, the HRL agent uses a distributed version of the popular DQN algorithm to train different components of the hierarchy. While the native action space is completely intractable for simple DQN agents, our architecture can be used to establish an effective way to interact with different tasks, significantly improving the performance of the same DQN agent over different levels of abstraction. ",
    "url": "https://arxiv.org/abs/2204.10374",
    "authors": [
      "Gheorghe Comanici",
      "Amelia Glaese",
      "Anita Gergely",
      "Daniel Toyama",
      "Zafarali Ahmed",
      "Tyler Jackson",
      "Philippe Hamel",
      "Doina Precup"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10383",
    "title": "Autonomous Vehicle Parking in Dynamic Environments: An Integrated System  with Prediction and Motion Planning",
    "abstract": "This paper presents an integrated motion planning system for autonomous vehicle (AV) parking in the presence of other moving vehicles. The proposed system includes 1) a hybrid environment predictor that predicts the motions of the surrounding vehicles and 2) a strategic motion planner that reacts to the predictions. The hybrid environment predictor performs short-term predictions via an extended Kalman filter and an adaptive observer. It also combines short-term predictions with a driver behavior cost-map to make long-term predictions. The strategic motion planner comprises 1) a model predictive control-based safety controller for trajectory tracking; 2) a search-based retreating planner for finding an evasion path in an emergency; 3) an optimization-based repairing planner for planning a new path when the original path is invalidated. Simulation validation demonstrates the effectiveness of the proposed method in terms of initial planning, motion prediction, safe tracking, retreating in an emergency, and trajectory repairing. ",
    "url": "https://arxiv.org/abs/2204.10383",
    "authors": [
      "Jessica Leu",
      "Yebin Wang",
      "Masayoshi Tomizuka",
      "Stefano Di Cairano"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.10390",
    "title": "SoftEdge: Regularizing Graph Classification with Random Soft Edges",
    "abstract": "Graph data augmentation plays a vital role in regularizing Graph Neural Networks (GNNs), which leverage information exchange along edges in graphs, in the form of message passing, for learning. Due to their effectiveness, simple edge and node manipulations (e.g., addition and deletion) have been widely used in graph augmentation. In this paper, we identify a limitation in such a common augmentation technique. That is, simple edge and node manipulations can create graphs with an identical structure or indistinguishable structures to message passing GNNs but of conflict labels, leading to the sample collision issue and thus the degradation of model performance. To address this problem, we propose SoftEdge, which assigns random weights to a portion of the edges of a given graph to construct dynamic neighborhoods over the graph. We prove that SoftEdge creates collision-free augmented graphs. We also show that this simple method obtains superior accuracy to popular node and edge manipulation approaches and notable resilience to the accuracy degradation with the GNN depth. ",
    "url": "https://arxiv.org/abs/2204.10390",
    "authors": [
      "Hongyu Guo",
      "Sun Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10408",
    "title": "ICDBigBird: A Contextual Embedding Model for ICD Code Classification",
    "abstract": "The International Classification of Diseases (ICD) system is the international standard for classifying diseases and procedures during a healthcare encounter and is widely used for healthcare reporting and management purposes. Assigning correct codes for clinical procedures is important for clinical, operational, and financial decision-making in healthcare. Contextual word embedding models have achieved state-of-the-art results in multiple NLP tasks. However, these models have yet to achieve state-of-the-art results in the ICD classification task since one of their main disadvantages is that they can only process documents that contain a small number of tokens which is rarely the case with real patient notes. In this paper, we introduce ICDBigBird a BigBird-based model which can integrate a Graph Convolutional Network (GCN), that takes advantage of the relations between ICD codes in order to create 'enriched' representations of their embeddings, with a BigBird contextual model that can process larger documents. Our experiments on a real-world clinical dataset demonstrate the effectiveness of our BigBird-based model on the ICD classification task as it outperforms the previous state-of-the-art models. ",
    "url": "https://arxiv.org/abs/2204.10408",
    "authors": [
      "George Michalopoulos",
      "Michal Malyska",
      "Nicola Sahar",
      "Alexander Wong",
      "Helen Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10423",
    "title": "Social Distancing Network Creation",
    "abstract": "During a pandemic people have to find a trade-off between meeting others and staying safely at home. While meeting others is pleasant, it also increases the risk of infection. We consider this dilemma by introducing a game-theoretic network creation model in which selfish agents can form bilateral connections. They benefit from network neighbors, but at the same time, they want to maximize their distance to all other agents. This models the inherent conflict that social distancing rules impose on the behavior of selfish agents in a social network. Besides addressing this familiar issue, our model can be seen as the inverse to the well-studied Network Creation Game by Fabrikant et al. [PODC 2003] where agents aim at being as central as possible in the created network. Thus, our work is in-line with studies that compare minimization problems with their maximization versions. We look at two variants of network creation governed by social distancing. In the first variant, there are no restrictions on the connections being formed. We characterize optimal and equilibrium networks, and we derive asymptotically tight bounds on the Price of Anarchy and Price of Stability. The second variant is the model's generalization that allows restrictions on the connections that can be formed. As our main result, we prove that Swap-Maximal Routing-Cost Spanning Trees, an efficiently computable weaker variant of Maximum Routing-Cost Spanning Trees, actually resemble equilibria for a significant range of the parameter space. Moreover, we give almost tight bounds on the Price of Anarchy and Price of Stability. These results imply that, compared the well-studied inverse models, under social distancing the agents' selfish behavior has a significantly stronger impact on the quality of the equilibria, i.e., allowing socially much worse stable states. ",
    "url": "https://arxiv.org/abs/2204.10423",
    "authors": [
      "Tobias Friedrich",
      "Hans Gawendowicz",
      "Pascal Lenzner",
      "Anna Melnichenko"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2204.10424",
    "title": "Neural Networks with Local Converging Inputs (NNLCI) for Solving  Conservation Laws, Part II: 2D Problems",
    "abstract": "In our prior work [arXiv:2109.09316], neural network methods with inputs based on domain of dependence and a converging sequence were introduced for solving one dimensional conservation laws, in particular the Euler systems. To predict a high-fidelity solution at a given space-time location, two solutions of a conservation law from a converging sequence, computed from low-cost numerical schemes, and in a local domain of dependence of the space-time location, serve as the input of a neural network. In the present work, we extend the methods to two dimensional Euler systems and introduce variations. Numerical results demonstrate that the methods not only work very well in one dimension [arXiv:2109.09316], but also perform well in two dimensions. Despite smeared local input data, the neural network methods are able to predict shocks, contacts, and smooth regions of the solution accurately. The neural network methods are efficient and relatively easy to train because they are local solvers. ",
    "url": "https://arxiv.org/abs/2204.10424",
    "authors": [
      "Haoxiang Huang",
      "Yingjie Liu",
      "Vigor Yang"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2204.10432",
    "title": "Improving the Generalizability of Depression Detection by Leveraging  Clinical Questionnaires",
    "abstract": "Automated methods have been widely used to identify and analyze mental health conditions (e.g., depression) from various sources of information, including social media. Yet, deployment of such models in real-world healthcare applications faces challenges including poor out-of-domain generalization and lack of trust in black box models. In this work, we propose approaches for depression detection that are constrained to different degrees by the presence of symptoms described in PHQ9, a questionnaire used by clinicians in the depression screening process. In dataset-transfer experiments on three social media datasets, we find that grounding the model in PHQ9's symptoms substantially improves its ability to generalize to out-of-distribution data compared to a standard BERT-based approach. Furthermore, this approach can still perform competitively on in-domain data. These results and our qualitative analyses suggest that grounding model predictions in clinically-relevant symptoms can improve generalizability while producing a model that is easier to inspect. ",
    "url": "https://arxiv.org/abs/2204.10432",
    "authors": [
      "Thong Nguyen",
      "Andrew Yates",
      "Ayah Zirikly",
      "Bart Desmet",
      "Arman Cohan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.10435",
    "title": "PreTraM: Self-Supervised Pre-training via Connecting Trajectory and Map",
    "abstract": "Deep learning has recently achieved significant progress in trajectory forecasting. However, the scarcity of trajectory data inhibits the data-hungry deep-learning models from learning good representations. While mature representation learning methods exist in computer vision and natural language processing, these pre-training methods require large-scale data. It is hard to replicate these approaches in trajectory forecasting due to the lack of adequate trajectory data (e.g., 34K samples in the nuScenes dataset). To work around the scarcity of trajectory data, we resort to another data modality closely related to trajectories-HD-maps, which is abundantly provided in existing datasets. In this paper, we propose PreTraM, a self-supervised pre-training scheme via connecting trajectories and maps for trajectory forecasting. Specifically, PreTraM consists of two parts: 1) Trajectory-Map Contrastive Learning, where we project trajectories and maps to a shared embedding space with cross-modal contrastive learning, and 2) Map Contrastive Learning, where we enhance map representation with contrastive learning on large quantities of HD-maps. On top of popular baselines such as AgentFormer and Trajectron++, PreTraM boosts their performance by 5.5% and 6.9% relatively in FDE-10 on the challenging nuScenes dataset. We show that PreTraM improves data efficiency and scales well with model size. ",
    "url": "https://arxiv.org/abs/2204.10435",
    "authors": [
      "Chenfeng Xu",
      "Tian Li",
      "Chen Tang",
      "Lingfeng Sun",
      "Kurt Keutzer",
      "Masayoshi Tomizuka",
      "Alireza Fathi",
      "Wei Zhan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10437",
    "title": "DiRA: Discriminative, Restorative, and Adversarial Learning for  Self-supervised Medical Image Analysis",
    "abstract": "Discriminative learning, restorative learning, and adversarial learning have proven beneficial for self-supervised learning schemes in computer vision and medical imaging. Existing efforts, however, omit their synergistic effects on each other in a ternary setup, which, we envision, can significantly benefit deep semantic representation learning. To realize this vision, we have developed DiRA, the first framework that unites discriminative, restorative, and adversarial learning in a unified manner to collaboratively glean complementary visual information from unlabeled medical images for fine-grained semantic representation learning. Our extensive experiments demonstrate that DiRA (1) encourages collaborative learning among three learning ingredients, resulting in more generalizable representation across organs, diseases, and modalities; (2) outperforms fully supervised ImageNet models and increases robustness in small data regimes, reducing annotation cost across multiple medical imaging applications; (3) learns fine-grained semantic representation, facilitating accurate lesion localization with only image-level annotation; and (4) enhances state-of-the-art restorative approaches, revealing that DiRA is a general mechanism for united representation learning. All code and pre-trained models are available at https: //github.com/JLiangLab/DiRA. ",
    "url": "https://arxiv.org/abs/2204.10437",
    "authors": [
      "Fatemeh Haghighi",
      "Mohammad Reza Hosseinzadeh Taher",
      "Michael B. Gotway",
      "Jianming Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.10457",
    "title": "Stackelberg Routing of Autonomous Cars in Mixed-Autonomy Traffic  Networks",
    "abstract": "As autonomous cars are becoming tangible technologies, road networks will soon be shared by human-driven and autonomous cars. However, humans normally act selfishly which may result in network inefficiencies. In this work, we study increasing the efficiency of mixed-autonomy traffic networks by routing autonomous cars altruistically. We consider a Stackelberg routing setting where a central planner can route autonomous cars in the favor of society such that when human-driven cars react and select their routes selfishly, the overall system efficiency is increased. We develop a Stackelberg routing strategy for autonomous cars in a mixed-autonomy traffic network with arbitrary geometry. We bound the price of anarchy that our Stackelberg strategy induces and prove that our proposed Stackelberg routing will reduce the price of anarchy, i.e. it increases the network efficiency. Specifically, we consider a non-atomic routing game in a mixed-autonomy setting with affine latency functions and develop an extension of the SCALE Stackelberg strategy for mixed-autonomy networks. We derive an upper bound on the price of anarchy that this Stackelberg routing induces and demonstrate that in the limit, our bound recovers the price of anarchy bounds for networks of only human-driven cars. ",
    "url": "https://arxiv.org/abs/2204.10457",
    "authors": [
      "Maxwell Kolarich",
      "Negar Mehr"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2204.10467",
    "title": "Neural Contrastive Clustering: Fully Unsupervised Bias Reduction for  Sentiment Classification",
    "abstract": "Background: Neural networks produce biased classification results due to correlation bias (they learn correlations between their inputs and outputs to classify samples, even when those correlations do not represent cause-and-effect relationships). Objective: This study introduces a fully unsupervised method of mitigating correlation bias, demonstrated with sentiment classification on COVID-19 social media data. Methods: Correlation bias in sentiment classification often arises in conversations about controversial topics. Therefore, this study uses adversarial learning to contrast clusters based on sentiment classification labels, with clusters produced by unsupervised topic modeling. This discourages the neural network from learning topic-related features that produce biased classification results. Results: Compared to a baseline classifier, neural contrastive clustering approximately doubles accuracy on bias-prone sentences for human-labeled COVID-19 social media data, without adversely affecting the classifier's overall F1 score. Despite being a fully unsupervised approach, neural contrastive clustering achieves a larger improvement in accuracy on bias-prone sentences than a supervised masking approach. Conclusions: Neural contrastive clustering reduces correlation bias in sentiment text classification. Further research is needed to explore generalizing this technique to other neural network architectures and application domains. ",
    "url": "https://arxiv.org/abs/2204.10467",
    "authors": [
      "Jared Mowery"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10483",
    "title": "NLP Based Anomaly Detection for Categorical Time Series",
    "abstract": "Identifying anomalies in large multi-dimensional time series is a crucial and difficult task across multiple domains. Few methods exist in the literature that address this task when some of the variables are categorical in nature. We formalize an analogy between categorical time series and classical Natural Language Processing and demonstrate the strength of this analogy for anomaly detection and root cause investigation by implementing and testing three different machine learning anomaly detection and root cause investigation models based upon it. ",
    "url": "https://arxiv.org/abs/2204.10483",
    "authors": [
      "Matthew Horak",
      "Sowmya Chandrasekaran",
      "Giovanni Tobar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.10485",
    "title": "Attentions Help CNNs See Better: Attention-based Hybrid Image Quality  Assessment Network",
    "abstract": "Image quality assessment (IQA) algorithm aims to quantify the human perception of image quality. Unfortunately, there is a performance drop when assessing the distortion images generated by generative adversarial network (GAN) with seemingly realistic texture. In this work, we conjecture that this maladaptation lies in the backbone of IQA models, where patch-level prediction methods use independent image patches as input to calculate their scores separately, but lack spatial relationship modeling among image patches. Therefore, we propose an Attention-based Hybrid Image Quality Assessment Network (AHIQ) to deal with the challenge and get better performance on the GAN-based IQA task. Firstly, we adopt a two-branch architecture, including a vision transformer (ViT) branch and a convolutional neural network (CNN) branch for feature extraction. The hybrid architecture combines interaction information among image patches captured by ViT and local texture details from CNN. To make the features from shallow CNN more focused on the visually salient region, a deformable convolution is applied with the help of semantic information from the ViT branch. Finally, we use a patch-wise score prediction module to obtain the final score. The experiments show that our model outperforms the state-of-the-art methods on four standard IQA datasets and AHIQ ranked first on the Full Reference (FR) track of the NTIRE 2022 Perceptual Image Quality Assessment Challenge. ",
    "url": "https://arxiv.org/abs/2204.10485",
    "authors": [
      "Shanshan Lao",
      "Yuan Gong",
      "Shuwei Shi",
      "Sidi Yang",
      "Tianhe Wu",
      "Jiahao Wang",
      "Weihao Xia",
      "Yujiu Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10494",
    "title": "Lengths of Cycles in Generalized Pancake Graphs",
    "abstract": "In this paper, we consider the lengths of cycles that can be embedded on the edges of the \\emph{generalized pancake graph} which is the Cayley graph of the generalized symmetric group, the wreath product of the cyclic group $C_m$ and the symmetric group, generated by prefix reversals. In the cases when the cyclic group has one or two elements the graphs are the \\emph{pancake graphs} and \\emph{burnt pancake graphs}, respectively. We prove that when the cyclic group has three elements the underlying, undirected graph of the generalized pancake graph is pancyclic, thus resembling a similar property of the pancake graphs and the burnt pancake graphs. Moreover, when the cyclic group has four elements, the resulting undirected graphs will have all the even-length cycles. We utilize these results as base cases and show that if $m>2$ is even, the corresponding undirected pancake graph has all cycles of even length starting from its girth to a Hamiltonian cycle. Moreover, when $m$ is odd, the corresponding undirected pancake graph has cycles of all lengths starting from its girth to a Hamiltonian cycle. We furthermore show that the girth of the undirected generalized pancake graphs is $\\min\\{m,8\\}$ if $m\\geq3$, thus complementing the known results for $m=1,2.$ ",
    "url": "https://arxiv.org/abs/2204.10494",
    "authors": [
      "Saúl A. Blanco",
      "Charles Buehrle"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2204.10502",
    "title": "LiDetector: License Incompatibility Detection for Open Source Software",
    "abstract": "Open-source software (OSS) licenses dictate the conditions which should be followed to reuse, distribute, and modify the software. Apart from widely-used licenses such as the MIT License, developers are also allowed to customize their own licenses (called custom licenses), whose descriptions are more flexible. The presence of such various licenses imposes challenges to understanding licenses and their compatibility. To avoid financial and legal risks, it is essential to ensure license compatibility when integrating third-party packages or reusing code accompanied with licenses. In this work, we propose LiDetector, an effective tool that extracts and interprets OSS licenses (including both official licenses and custom licenses), and detects license incompatibility among these licenses. Specifically, LiDetector introduces a learning-based method to automatically identify meaningful license terms from an arbitrary license and employs Probabilistic Context-Free Grammar (PCFG) to infer rights and obligations for incompatibility detection. Experiments demonstrate that LiDetector outperforms existing methods with 93.28% precision for term identification, and 91.09% accuracy for right and obligation inference, and can effectively detect incompatibility with a 10.06% FP rate and 2.56% FN rate. Furthermore, with LiDetector, our large-scale empirical study on 1,846 projects reveals that 72.91% of the projects are suffering from license incompatibility, including popular ones such as the MIT License and the Apache License. We highlighted lessons learned from the perspectives of different stakeholders and made all related data and the replication package publicly available to facilitate follow-up research. ",
    "url": "https://arxiv.org/abs/2204.10502",
    "authors": [
      "Sihan Xu",
      "Ya Gao",
      "Lingling Fan",
      "Zheli Liu",
      "Yang Liu",
      "Hua Ji"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.10505",
    "title": "Application of Federated Learning in Building a Robust COVID-19 Chest  X-ray Classification Model",
    "abstract": "While developing artificial intelligence (AI)-based algorithms to solve problems, the amount of data plays a pivotal role - large amount of data helps the researchers and engineers to develop robust AI algorithms. In the case of building AI-based models for problems related to medical imaging, these data need to be transferred from the medical institutions where they were acquired to the organizations developing the algorithms. This movement of data involves time-consuming formalities like complying with HIPAA, GDPR, etc.There is also a risk of patients' private data getting leaked, compromising their confidentiality. One solution to these problems is using the Federated Learning framework. Federated Learning (FL) helps AI models to generalize better and create a robust AI model by using data from different sources having different distributions and data characteristics without moving all the data to a central server. In our paper, we apply the FL framework for training a deep learning model to solve a binary classification problem of predicting the presence or absence of COVID-19. We took three different sources of data and trained individual models on each source. Then we trained an FL model on the complete data and compared all the model performances. We demonstrated that the FL model performs better than the individual models. Moreover, the FL model performed at par with the model trained on all the data combined at a central server. Thus Federated Learning leads to generalized AI models without the cost of data transfer and regulatory overhead. ",
    "url": "https://arxiv.org/abs/2204.10505",
    "authors": [
      "Amartya Bhattacharya",
      "Manish Gawali",
      "Jitesh Seth",
      "Viraj Kulkarni"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10521",
    "title": "Rethinking Offensive Text Detection as a Multi-Hop Reasoning Problem",
    "abstract": "We introduce the task of implicit offensive text detection in dialogues, where a statement may have either an offensive or non-offensive interpretation, depending on the listener and context. We argue that reasoning is crucial for understanding this broader class of offensive utterances and release SLIGHT, a dataset to support research on this task. Experiments using the data show that state-of-the-art methods of offense detection perform poorly when asked to detect implicitly offensive statements, achieving only ${\\sim} 11\\%$ accuracy. In contrast to existing offensive text detection datasets, SLIGHT features human-annotated chains of reasoning which describe the mental process by which an offensive interpretation can be reached from each ambiguous statement. We explore the potential for a multi-hop reasoning approach by utilizing existing entailment models to score the probability of these chains and show that even naive reasoning models can yield improved performance in most situations. Furthermore, analysis of the chains provides insight into the human interpretation process and emphasizes the importance of incorporating additional commonsense knowledge. ",
    "url": "https://arxiv.org/abs/2204.10521",
    "authors": [
      "Qiang Zhang",
      "Jason Naradowsky",
      "Yusuke Miyao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2204.10527",
    "title": "Few-Shot Object Detection with Proposal Balance Refinement",
    "abstract": "Few-shot object detection has gained significant attention in recent years as it has the potential to greatly reduce the reliance on large amounts of manually annotated bounding boxes. While most existing few-shot object detection literature primarily focuses on bounding box classification by obtaining as discriminative feature embeddings as possible, we emphasize the necessity of handling the lack of intersection-over-union (IoU) variations induced by a biased distribution of novel samples. In this paper, we analyze the IoU imbalance that is caused by the relatively high number of low-quality region proposals, and reveal that it plays a critical role in improving few-shot learning capabilities. The well-known two stage fine-tuning technique causes insufficient quality and quantity of the novel positive samples, which hinders the effective object detection of unseen novel classes. To alleviate this issue, we present a few-shot object detection model with proposal balance refinement, a simple yet effective approach in learning object proposals using an auxiliary sequential bounding box refinement process. This process enables the detector to be optimized on the various IoU scores through additional novel class samples. To fully exploit our sequential stage architecture, we revise the fine-tuning strategy and expose the Region Proposal Network to the novel classes in order to provide increased learning opportunities for the region-of-interest (RoI) classifiers and regressors. Our extensive assessments on PASCAL VOC and COCO demonstrate that our framework substantially outperforms other existing few-shot object detection approaches. ",
    "url": "https://arxiv.org/abs/2204.10527",
    "authors": [
      "Sueyeon Kim",
      "Woo-Jeoung Nam",
      "Seong-Whan Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10529",
    "title": "Exploring Hidden Semantics in Neural Networks with Symbolic Regression",
    "abstract": "Many recent studies focus on developing mechanisms to explain the black-box behaviors of neural networks (NNs). However, little work has been done to extract the potential hidden semantics (mathematical representation) of a neural network. A succinct and explicit mathematical representation of a NN model could improve the understanding and interpretation of its behaviors. To address this need, we propose a novel symbolic regression method for neural works (called SRNet) to discover the mathematical expressions of a NN. SRNet creates a Cartesian genetic programming (NNCGP) to represent the hidden semantics of a single layer in a NN. It then leverages a multi-chromosome NNCGP to represent hidden semantics of all layers of the NN. The method uses a (1+$\\lambda$) evolutionary strategy (called MNNCGP-ES) to extract the final mathematical expressions of all layers in the NN. Experiments on 12 symbolic regression benchmarks and 5 classification benchmarks show that SRNet not only can reveal the complex relationships between each layer of a NN but also can extract the mathematical representation of the whole NN. Compared with LIME and MAPLE, SRNet has higher interpolation accuracy and trends to approximate the real model on the practical dataset. ",
    "url": "https://arxiv.org/abs/2204.10529",
    "authors": [
      "Yuanzhen Luo",
      "Qiang Lu",
      "Xilei Hu",
      "Jake Luo",
      "Zhiguang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.10533",
    "title": "Fourier Imager Network (FIN): A deep neural network for hologram  reconstruction with superior external generalization",
    "abstract": "Deep learning-based image reconstruction methods have achieved remarkable success in phase recovery and holographic imaging. However, the generalization of their image reconstruction performance to new types of samples never seen by the network remains a challenge. Here we introduce a deep learning framework, termed Fourier Imager Network (FIN), that can perform end-to-end phase recovery and image reconstruction from raw holograms of new types of samples, exhibiting unprecedented success in external generalization. FIN architecture is based on spatial Fourier transform modules that process the spatial frequencies of its inputs using learnable filters and a global receptive field. Compared with existing convolutional deep neural networks used for hologram reconstruction, FIN exhibits superior generalization to new types of samples, while also being much faster in its image inference speed, completing the hologram reconstruction task in ~0.04 s per 1 mm^2 of the sample area. We experimentally validated the performance of FIN by training it using human lung tissue samples and blindly testing it on human prostate, salivary gland tissue and Pap smear samples, proving its superior external generalization and image reconstruction speed. Beyond holographic microscopy and quantitative phase imaging, FIN and the underlying neural network architecture might open up various new opportunities to design broadly generalizable deep learning models in computational imaging and machine vision fields. ",
    "url": "https://arxiv.org/abs/2204.10533",
    "authors": [
      "Hanlong Chen",
      "Luzhe Huang",
      "Tairan Liu",
      "Aydogan Ozcan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2204.10539",
    "title": "Energy-efficient and Privacy-aware Social Distance Monitoring with  Low-resolution Infrared Sensors and Adaptive Inference",
    "abstract": "Low-resolution infrared (IR) Sensors combined with machine learning (ML) can be leveraged to implement privacy-preserving social distance monitoring solutions in indoor spaces. However, the need of executing these applications on Internet of Things (IoT) edge nodes makes energy consumption critical. In this work, we propose an energy-efficient adaptive inference solution consisting of the cascade of a simple wake-up trigger and a 8-bit quantized Convolutional Neural Network (CNN), which is only invoked for difficult-to-classify frames. Deploying such adaptive system on a IoT Microcontroller, we show that, when processing the output of a 8x8 low-resolution IR sensor, we are able to reduce the energy consumption by 37-57% with respect to a static CNN-based approach, with an accuracy drop of less than 2% (83% balanced accuracy). ",
    "url": "https://arxiv.org/abs/2204.10539",
    "authors": [
      "Chen Xie",
      "Daniele Jahier Pagliari",
      "Andrea Calimera"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10540",
    "title": "Following Closely: A Robust Monocular Person Following System for Mobile  Robot",
    "abstract": "Monocular person following (MPF) is a capability that supports many useful applications of a mobile robot. However, existing MPF solutions are not completely satisfactory. Firstly, they often fail to track the target at a close distance either because they are based on a visual servo or they need the observation of the full body by the robot. Secondly, their target Re-IDentification (Re-ID) abilities are weak in cases of target appearance change and highly similar appearance of distracting people. To remove the assumption of full-body observation, we propose a width-based tracking module, which relies on the target width, which can be observed even at a close distance. For handling issues related to appearance variation, we use a global CNN (convolutional neural network) descriptor to represent the target and a ridge regression model to learn a target appearance model online. We adopt a sampling strategy for online classifier learning, in which both long-term and short-term samples are involved. We evaluate our method in two datasets including a public person following dataset and a custom-built one with challenging target appearance and target distance. Our method achieves state-of-the-art (SOTA) results on both datasets. For the benefit of the community, we make public the dataset and the source code. ",
    "url": "https://arxiv.org/abs/2204.10540",
    "authors": [
      "Hanjing Ye",
      "Jieting Zhao",
      "Yaling Pan",
      "Weinan Chen",
      "Hong Zhang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.10541",
    "title": "Privacy-preserving Social Distance Monitoring on Microcontrollers with  Low-Resolution Infrared Sensors and CNNs",
    "abstract": "Low-resolution infrared (IR) array sensors offer a low-cost, low-power, and privacy-preserving alternative to optical cameras and smartphones/wearables for social distance monitoring in indoor spaces, permitting the recognition of basic shapes, without revealing the personal details of individuals. In this work, we demonstrate that an accurate detection of social distance violations can be achieved processing the raw output of a 8x8 IR array sensor with a small-sized Convolutional Neural Network (CNN). Furthermore, the CNN can be executed directly on a Microcontroller (MCU)-based sensor node. With results on a newly collected open dataset, we show that our best CNN achieves 86.3% balanced accuracy, significantly outperforming the 61% achieved by a state-of-the-art deterministic algorithm. Changing the architectural parameters of the CNN, we obtain a rich Pareto set of models, spanning 70.5-86.3% accuracy and 0.18-75k parameters. Deployed on a STM32L476RG MCU, these models have a latency of 0.73-5.33ms, with an energy consumption per inference of 9.38-68.57{\\mu}J. ",
    "url": "https://arxiv.org/abs/2204.10541",
    "authors": [
      "Chen Xie",
      "Francesco Daghero",
      "Yukai Chen",
      "Marco Castellano",
      "Luca Gandolfi",
      "Andrea Calimera",
      "Enrico Macii",
      "Massimo Poncino",
      "Daniele Jahier Pagliari"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.10546",
    "title": "Depth Pruning with Auxiliary Networks for TinyML",
    "abstract": "Pruning is a neural network optimization technique that sacrifices accuracy in exchange for lower computational requirements. Pruning has been useful when working with extremely constrained environments in tinyML. Unfortunately, special hardware requirements and limited study on its effectiveness on already compact models prevent its wider adoption. Depth pruning is a form of pruning that requires no specialized hardware but suffers from a large accuracy falloff. To improve this, we propose a modification that utilizes a highly efficient auxiliary network as an effective interpreter of intermediate feature maps. Our results show a parameter reduction of 93% on the MLPerfTiny Visual Wakewords (VWW) task and 28% on the Keyword Spotting (KWS) task with accuracy cost of 0.65% and 1.06% respectively. When evaluated on a Cortex-M0 microcontroller, our proposed method reduces the VWW model size by 4.7x and latency by 1.6x while counter intuitively gaining 1% accuracy. KWS model size on Cortex-M0 was also reduced by 1.2x and latency by 1.2x at the cost of 2.21% accuracy. ",
    "url": "https://arxiv.org/abs/2204.10546",
    "authors": [
      "Josen Daniel De Leon",
      "Rowel Atienza"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10568",
    "title": "A Linear Time Algorithm for Computing Max-Flow Vitality in Undirected  Unweighted Planar Graphs",
    "abstract": "The vitality of an edge in a graph with respect to the maximum flow between two fixed vertices $s$ and $t$ is defined as the reduction of the maximum flow value caused by the removal of that edge. The max-flow vitality problem has already been efficiently solved for $st$-planar graphs but has remained open for general planar graphs. For the first time our result provides an optimal solution for general planar graphs although restricted to the case of unweighted planar graphs. ",
    "url": "https://arxiv.org/abs/2204.10568",
    "authors": [
      "Giorgio Ausiello",
      "Lorenzo Balzotti",
      "Paolo G. Franciosa",
      "Isabella Lari",
      "Andrea Ribichini"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2204.10581",
    "title": "FAIR4Cov: Fused Audio Instance and Representation for COVID-19 Detection",
    "abstract": "Audio-based classification techniques on body sounds have long been studied to support diagnostic decisions, particularly in pulmonary diseases. In response to the urgency of the COVID-19 pandemic, a growing number of models are developed to identify COVID-19 patients based on acoustic input. Most models focus on cough because the dry cough is the best-known symptom of COVID-19. However, other body sounds, such as breath and speech, have also been revealed to correlate with COVID-19 as well. In this work, rather than relying on a specific body sound, we propose Fused Audio Instance and Representation for COVID-19 Detection (FAIR4Cov). It relies on constructing a joint feature vector obtained from a plurality of body sounds in waveform and spectrogram representation. The core component of FAIR4Cov is a self-attention fusion unit that is trained to establish the relation of multiple body sounds and audio representations and integrate it into a compact feature vector. We set up our experiments on different combinations of body sounds using only waveform, spectrogram, and a joint representation of waveform and spectrogram. Our findings show that the use of self-attention to combine extracted features from cough, breath, and speech sounds leads to the best performance with an Area Under the Receiver Operating Characteristic Curve (AUC) score of 0.8658, a sensitivity of 0.8057, and a specificity of 0.7958. This AUC is 0.0227 higher than the one of the models trained on spectrograms only and 0.0847 higher than the one of the models trained on waveforms only. The results demonstrate that the combination of spectrogram with waveform representation helps to enrich the extracted features and outperforms the models with single representation. ",
    "url": "https://arxiv.org/abs/2204.10581",
    "authors": [
      "Tuan Truong",
      "Matthias Lenga",
      "Antoine Serrurier",
      "Sadegh Mohammadi"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.10586",
    "title": "Efficient Training of Neural Transducer for Speech Recognition",
    "abstract": "As one of the most popular sequence-to-sequence modeling approaches for speech recognition, the RNN-Transducer has achieved evolving performance with more and more sophisticated neural network models of growing size and increasing training epochs. While strong computation resources seem to be the prerequisite of training superior models, we try to overcome it by carefully designing a more efficient training pipeline. In this work, we propose an efficient 3-stage progressive training pipeline to build highly-performing neural transducer models from scratch with very limited computation resources in a reasonable short time period. The effectiveness of each stage is experimentally verified on both Librispeech and Switchboard corpora. The proposed pipeline is able to train transducer models approaching state-of-the-art performance with a single GPU in just 2-3 weeks. Our best conformer transducer achieves 4.1% WER on Librispeech test-other with only 35 epochs of training. ",
    "url": "https://arxiv.org/abs/2204.10586",
    "authors": [
      "Wei Zhou",
      "Wilfried Michel",
      "Ralf Schlüter",
      "Hermann Ney"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.10588",
    "title": "A Note on the Regularity of Images Generated by Convolutional Neural  Networks",
    "abstract": "The regularity of images generated by convolutional neural networks, such as the U-net, generative adversarial networks, or the deep image prior, is analyzed. In a resolution-independent, infinite dimensional setting, it is shown that such images, represented as functions, are always continuous and, in some circumstances, even continuously differentiable, contradicting the widely accepted modeling of sharp edges in images via jump discontinuities. While such statements require an infinite dimensional setting, the connection to (discretized) neural networks used in practice is made by considering the limit as the resolution approaches infinity. As practical consequence, the results of this paper suggest to refrain from basic L2 regularization of network weights in case of images being the network output. ",
    "url": "https://arxiv.org/abs/2204.10588",
    "authors": [
      "Andreas Habring",
      "Martin Holler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2204.10606",
    "title": "Enhancing the Transferability via Feature-Momentum Adversarial Attack",
    "abstract": "Transferable adversarial attack has drawn increasing attention due to their practical threaten to real-world applications. In particular, the feature-level adversarial attack is one recent branch that can enhance the transferability via disturbing the intermediate features. The existing methods usually create a guidance map for features, where the value indicates the importance of the corresponding feature element and then employs an iterative algorithm to disrupt the features accordingly. However, the guidance map is fixed in existing methods, which can not consistently reflect the behavior of networks as the image is changed during iteration. In this paper, we describe a new method called Feature-Momentum Adversarial Attack (FMAA) to further improve transferability. The key idea of our method is that we estimate a guidance map dynamically at each iteration using momentum to effectively disturb the category-relevant features. Extensive experiments demonstrate that our method significantly outperforms other state-of-the-art methods by a large margin on different target models. ",
    "url": "https://arxiv.org/abs/2204.10606",
    "authors": [
      "Xianglong",
      "Yuezun Li",
      "Haipeng Qu",
      "Junyu Dong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10610",
    "title": "Fast Autonomous Robotic Exploration Using the Underlying Graph Structure",
    "abstract": "In this work, we fully define the existing relationships between traditional optimality criteria and the connectivity of the underlying pose-graph in Active SLAM, characterizing, therefore, the connection between Graph Theory and the Theory Optimal Experimental Design. We validate the proposed relationships in 2D and 3D graph SLAM datasets, showing a remarkable relaxation of the computational load when using the graph structure. Furthermore, we present a novel Active SLAM framework which outperforms traditional methods by successfully leveraging the graphical facet of the problem so as to autonomously explore an unknown environment. ",
    "url": "https://arxiv.org/abs/2204.10610",
    "authors": [
      "Julio A. Placed",
      "José A. Castellanos"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.10614",
    "title": "Modelling graph dynamics in fraud detection with \"Attention\"",
    "abstract": "At online retail platforms, detecting fraudulent accounts and transactions is crucial to improve customer experience, minimize loss, and avoid unauthorized transactions. Despite the variety of different models for deep learning on graphs, few approaches have been proposed for dealing with graphs that are both heterogeneous and dynamic. In this paper, we propose DyHGN (Dynamic Heterogeneous Graph Neural Network) and its variants to capture both temporal and heterogeneous information. We first construct dynamic heterogeneous graphs from registration and transaction data from eBay. Then, we build models with diachronic entity embedding and heterogeneous graph transformer. We also use model explainability techniques to understand the behaviors of DyHGN-* models. Our findings reveal that modelling graph dynamics with heterogeneous inputs need to be conducted with \"attention\" depending on the data structure, distribution, and computation cost. ",
    "url": "https://arxiv.org/abs/2204.10614",
    "authors": [
      "Susie Xi Rao",
      "Clémence Lanfranchi",
      "Shuai Zhang",
      "Zhichao Han",
      "Zitao Zhang",
      "Wei Min",
      "Mo Cheng",
      "Yinan Shan",
      "Yang Zhao",
      "Ce Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.10619",
    "title": "Real-time HOG+SVM based object detection using SoC FPGA for a UHD video  stream",
    "abstract": "Object detection is an essential component of many vision systems. For example, pedestrian detection is used in advanced driver assistance systems (ADAS) and advanced video surveillance systems (AVSS). Currently, most detectors use deep convolutional neural networks (e.g., the YOLO -- You Only Look Once -- family), which, however, due to their high computational complexity, are not able to process a very high-resolution video stream in real-time, especially within a limited energy budget. In this paper we present a hardware implementation of the well-known pedestrian detector with HOG (Histogram of Oriented Gradients) feature extraction and SVM (Support Vector Machine) classification. Our system running on AMD Xilinx Zynq UltraScale+ MPSoC (Multiprocessor System on Chip) device allows real-time processing of 4K resolution (UHD -- Ultra High Definition, 3840 x 2160 pixels) video for 60 frames per second. The system is capable of detecting a pedestrian in a single scale. The results obtained confirm the high suitability of reprogrammable devices in the real-time implementation of embedded vision systems. ",
    "url": "https://arxiv.org/abs/2204.10619",
    "authors": [
      "Mateusz Wasala",
      "Tomasz Kryjak"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Hardware Architecture (cs.AR)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.10629",
    "title": "MEKER: Memory Efficient Knowledge Embedding Representation for Link  Prediction and Question Answering",
    "abstract": "Knowledge Graphs (KGs) are symbolically structured storages of facts. The KG embedding contains concise data used in NLP tasks requiring implicit information about the real world. Furthermore, the size of KGs that may be useful in actual NLP assignments is enormous, and creating embedding over it has memory cost issues. We represent KG as a 3rd-order binary tensor and move beyond the standard CP decomposition by using a data-specific generalized version of it. The generalization of the standard CP-ALS algorithm allows obtaining optimization gradients without a backpropagation mechanism. It reduces the memory needed in training while providing computational benefits. We propose a MEKER, a memory-efficient KG embedding model, which yields SOTA-comparable performance on link prediction tasks and KG-based Question Answering. ",
    "url": "https://arxiv.org/abs/2204.10629",
    "authors": [
      "Viktoriia Chekalina",
      "Anton Razzhigaev",
      "Albert Sayapin",
      "Alexander Panchenko"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10638",
    "title": "Dynamic Prototype Convolution Network for Few-Shot Semantic Segmentation",
    "abstract": "The key challenge for few-shot semantic segmentation (FSS) is how to tailor a desirable interaction among support and query features and/or their prototypes, under the episodic training scenario. Most existing FSS methods implement such support-query interactions by solely leveraging plain operations - e.g., cosine similarity and feature concatenation - for segmenting the query objects. However, these interaction approaches usually cannot well capture the intrinsic object details in the query images that are widely encountered in FSS, e.g., if the query object to be segmented has holes and slots, inaccurate segmentation almost always happens. To this end, we propose a dynamic prototype convolution network (DPCN) to fully capture the aforementioned intrinsic details for accurate FSS. Specifically, in DPCN, a dynamic convolution module (DCM) is firstly proposed to generate dynamic kernels from support foreground, then information interaction is achieved by convolution operations over query features using these kernels. Moreover, we equip DPCN with a support activation module (SAM) and a feature filtering module (FFM) to generate pseudo mask and filter out background information for the query images, respectively. SAM and FFM together can mine enriched context information from the query features. Our DPCN is also flexible and efficient under the k-shot FSS setting. Extensive experiments on PASCAL-5i and COCO-20i show that DPCN yields superior performances under both 1-shot and 5-shot settings. ",
    "url": "https://arxiv.org/abs/2204.10638",
    "authors": [
      "Jie Liu",
      "Yanqi Bao",
      "Guo-Sen Xie",
      "Huan Xiong",
      "Jan-Jakob Sonke",
      "Efstratios Gavves"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10641",
    "title": "Pre-train a Discriminative Text Encoder for Dense Retrieval via  Contrastive Span Prediction",
    "abstract": "Dense retrieval has shown promising results in many information retrieval (IR) related tasks, whose foundation is high-quality text representation learning for effective search. Some recent studies have shown that autoencoder-based language models are able to boost the dense retrieval performance using a weak decoder. However, we argue that 1) it is not discriminative to decode all the input texts and, 2) even a weak decoder has the bypass effect on the encoder. Therefore, in this work, we introduce a novel contrastive span prediction task to pre-train the encoder alone, but still retain the bottleneck ability of the autoencoder. % Therefore, in this work, we propose to drop out the decoder and introduce a novel contrastive span prediction task to pre-train the encoder alone. The key idea is to force the encoder to generate the text representation close to its own random spans while far away from others using a group-wise contrastive loss. In this way, we can 1) learn discriminative text representations efficiently with the group-wise contrastive learning over spans and, 2) avoid the bypass effect of the decoder thoroughly. Comprehensive experiments over publicly available retrieval benchmark datasets show that our approach can outperform existing pre-training methods for dense retrieval significantly. ",
    "url": "https://arxiv.org/abs/2204.10641",
    "authors": [
      "Xinyu Ma",
      "Jiafeng Guo",
      "Ruqing Zhang",
      "Yixing Fan",
      "Xueqi Cheng"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2204.10647",
    "title": "Log-based Sparse Nonnegative Matrix Factorization for Data  Representation",
    "abstract": "Nonnegative matrix factorization (NMF) has been widely studied in recent years due to its effectiveness in representing nonnegative data with parts-based representations. For NMF, a sparser solution implies better parts-based representation.However, current NMF methods do not always generate sparse solutions.In this paper, we propose a new NMF method with log-norm imposed on the factor matrices to enhance the sparseness.Moreover, we propose a novel column-wisely sparse norm, named $\\ell_{2,\\log}$-(pseudo) norm to enhance the robustness of the proposed method.The $\\ell_{2,\\log}$-(pseudo) norm is invariant, continuous, and differentiable.For the $\\ell_{2,\\log}$ regularized shrinkage problem, we derive a closed-form solution, which can be used for other general problems.Efficient multiplicative updating rules are developed for the optimization, which theoretically guarantees the convergence of the objective value sequence.Extensive experimental results confirm the effectiveness of the proposed method, as well as the enhanced sparseness and robustness. ",
    "url": "https://arxiv.org/abs/2204.10647",
    "authors": [
      "Chong Peng",
      "Yiqun Zhang",
      "Yongyong Chen",
      "Zhao Kang",
      "Chenglizhao Chen",
      "Qiang Cheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10667",
    "title": "DFAM-DETR: Deformable feature based attention mechanism DETR on slender  object detection",
    "abstract": "Object detection is one of the most significant aspects of computer vision, and it has achieved substantial results in a variety of domains. It is worth noting that there are few studies focusing on slender object detection. CNNs are widely employed in object detection, however it performs poorly on slender object detection due to the fixed geometric structure and sampling points. In comparison, Deformable DETR has the ability to obtain global to specific features. Even though it outperforms the CNNs in slender objects detection accuracy and efficiency, the results are still not satisfactory. Therefore, we propose Deformable Feature based Attention Mechanism (DFAM) to increase the slender object detection accuracy and efficiency of Deformable DETR. The DFAM has adaptive sampling points of deformable convolution and attention mechanism that aggregate information from the entire input sequence in the backbone network. This improved detector is named as Deformable Feature based Attention Mechanism DETR (DFAM- DETR). Results indicate that DFAM-DETR achieves outstanding detection performance on slender objects. ",
    "url": "https://arxiv.org/abs/2204.10667",
    "authors": [
      "Wen Feng",
      "Wang Mei",
      "Hu Xiaojie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10675",
    "title": "Unknown Face Presentation Attack Detection via Localised Learning of  Multiple Kernels",
    "abstract": "The paper studies face spoofing, a.k.a. presentation attack detection (PAD) in the demanding scenarios of unknown types of attack. While earlier studies have revealed the benefits of ensemble methods, and in particular, a multiple kernel learning approach to the problem, one limitation of such techniques is that they typically treat the entire observation space similarly and ignore any variability and local structure inherent to the data. This work studies this aspect of the face presentation attack detection problem in relation to multiple kernel learning in a one-class setting to benefit from intrinsic local structure in bona fide face samples. More concretely, inspired by the success of the one-class Fisher null formalism, we formulate a convex localised multiple kernel learning algorithm by imposing a joint matrix-norm constraint on the collection of local kernel weights and infer locally adaptive weights for zero-shot one-class unseen attack detection. We present a theoretical study of the proposed localised MKL algorithm using Rademacher complexities to characterise its generalisation capability and demonstrate the advantages of the proposed technique over some other options. An assessment of the proposed approach on general object image datasets illustrates its efficacy for abnormality and novelty detection while the results of the experiments on face PAD datasets verifies its potential in detecting unknown/unseen face presentation attacks. ",
    "url": "https://arxiv.org/abs/2204.10675",
    "authors": [
      "Shervin Rahimzadeh Arashloo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10698",
    "title": "Graph Gain: A Concave-Hull Based Volumetric Gain for Robotic Exploration",
    "abstract": "The existing volumetric gain for robotic exploration is calculated in the 3D occupancy map, while the sampling-based exploration method is extended in the reachable (free) space. The inconsistency between them makes the existing calculation of volumetric gain inappropriate for a complete exploration of the environment. To address this issue, we propose a concave-hull based volumetric gain in a sampling-based exploration framework. The concave hull is constructed based on the viewpoints generated by Rapidly-exploring Random Tree (RRT) and the nodes that fail to expand. All space outside this concave hull is considered unknown. The volumetric gain is calculated based on the viewpoints configuration rather than using the occupancy map. With the new volumetric gain, robots can avoid inefficient or even erroneous exploration behavior caused by the inappropriateness of existing volumetric gain calculation methods. Our exploration method is evaluated against the existing state-of-the-art RRT-based method in a benchmark environment. In the evaluated environment, the average running time of our method is about 38.4% of the existing state-of-the-art method and our method is more robust. ",
    "url": "https://arxiv.org/abs/2204.10698",
    "authors": [
      "Zezhou Sun",
      "Huajun Liu",
      "Chengzhong Xu",
      "Hui Kong"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.10702",
    "title": "Attractor landscapes in Boolean networks with firing memory",
    "abstract": "In this paper we study the dynamical behavior of Boolean networks with firing memory, namely Boolean networks whose vertices are updated synchronously depending on their proper Boolean local transition functions so that each vertex remains at its firing state a finite number of steps. We prove in particular that these networks have the same computational power than the classical ones, ie any Boolean network with firing memory composed of $m$ vertices can be simulated by a Boolean network by adding vertices. We also prove general results on specific classes of networks. For instance, we show that the existence of at least one delay greater than 1 in disjunctive networks makes such networks have only fixed points as attractors. Moreover, for arbitrary networks composed of two vertices, we characterize the delay phase space, \\ie the delay values such that networks admits limit cycles or fixed points. Finally, we analyze two classical biological models by introducing delays: the model of the immune control of the $\\lambda$-phage and that of the genetic control of the floral morphogenesis of the plant \\emph{Arabidopsis thaliana}. ",
    "url": "https://arxiv.org/abs/2204.10702",
    "authors": [
      "Eric Goles",
      "Fabiola Lobos",
      "Gonzalo A. Ruz",
      "Sylvain Sené"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2204.10710",
    "title": "Tweets2Stance: Users stance detection exploiting Zero-Shot Learning  Algorithms on Tweets",
    "abstract": "In the last years there has been a growing attention towards predicting the political orientation of active social media users, being this of great help to study political forecasts, opinion dynamics modeling and users polarization. Existing approaches, mainly targeting Twitter users, rely on content-based analysis or are based on a mixture of content, network and communication analysis. The recent research perspective exploits the fact that a user's political affinity mainly depends on his/her positions on major political and social issues, thus shifting the focus on detecting the stance of users through user-generated content shared on social networks. The work herein described focuses on a completely unsupervised stance detection framework that predicts the user's stance about specific social-political statements by exploiting content-based analysis of its Twitter timeline. The ground-truth user's stance may come from Voting Advice Applications, online tools that help citizens to identify their political leanings by comparing their political preferences with party political stances. Starting from the knowledge of the agreement level of six parties on 20 different statements, the objective of the study is to predict the stance of a Party p in regard to each statement s exploiting what the Twitter Party account wrote on Twitter. To this end we propose Tweets2Stance (T2S), a novel and totally unsupervised stance detector framework which relies on the zero-shot learning technique to quickly and accurately operate on non-labeled data. Interestingly, T2S can be applied to any social media user for any context of interest, not limited to the political one. Results obtained from multiple experiments show that, although the general maximum F1 value is 0.4, T2S can correctly predict the stance with a general minimum MAE of 1.13, which is a great achievement considering the task complexity. ",
    "url": "https://arxiv.org/abs/2204.10710",
    "authors": [
      "Margherita Gambini",
      "Tiziano Fagni",
      "Caterina Senette",
      "Maurizio Tesconi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10740",
    "title": "Embracing AWKWARD! Real-time Adjustment of Reactive Planning Using  Social Norms",
    "abstract": "This paper presents the AWKWARD agent architecture for the development of agents in Multi-Agent Systems. AWKWARD agents can have their plans re-configured in real time to align with social role requirements under changing environmental and social circumstances. The proposed hybrid architecture makes use of Behaviour Oriented Design (BOD) to develop agents with reactive planning and of the well-established OperA framework to provide organisational, social, and interaction definitions in order to validate and adjust agents' behaviours. Together, OperA and BOD can achieve real-time adjustment of agent plans for evolving social roles, while providing the additional benefit of transparency into the interactions that drive this behavioural change in individual agents. We present this architecture to motivate the bridging between traditional symbolic- and behaviour-based AI communities, where such combined solutions can help MAS researchers in their pursuit of building stronger, more robust intelligent agent teams. We use DOTA2 -- a game where success is heavily dependent on social interactions -- as a medium to demonstrate a sample implementation of our proposed hybrid architecture ",
    "url": "https://arxiv.org/abs/2204.10740",
    "authors": [
      "Leila Methnani",
      "Andreas Antoniades",
      "Andreas Theodorou"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10747",
    "title": "A New Polar Code Design Based on Reciprocal Channel Approximation",
    "abstract": "This paper revisits polar code design for a binary-input additive white Gaussian noise (BI-AWGN) channel when successive cancellation (SC) decoding is applied at the receiver. We focus on the reciprocal channel approximation (RCA), which is often adopted in the design of low-density parity-check (LDPC) codes. In order to apply RCA to polar code design for various codeword lengths, we derive rigorous closed-form approximations that are valid over a wide range of SNR over an AWGN channel, for both the mutual information of BPSK signaling and the corresponding reciprocal channel mapping. As a result, the computational complexity required for evaluating channel polarization is thus equivalent to that based on the popular Gaussian approximation (GA) approach. Simulation results show that the proposed polar code design based on RCA outperforms those based on GA as well as the so-called improved GA (IGA) approach, especially as the codeword length is increased. Furthermore, the RCA-based design yields a better block error rate (BLER) estimate compared to GA-based approaches. ",
    "url": "https://arxiv.org/abs/2204.10747",
    "authors": [
      "Hideki Ochiai",
      "Kosuke Ikeya",
      "Patrick Mitran"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2204.10754",
    "title": "Deterministic Self-Adjusting Tree Networks Using Rotor Walks",
    "abstract": "We revisit the design of self-adjusting single-source tree networks. The problem can be seen as a generalization of the classic list update problem to trees, and finds applications in reconfigurable datacenter networks. We are given a fixed balanced binary tree T connecting n nodes V = {v_1, ... , v_n}. A source node v_0, attached to the root of the tree, issues communication requests to nodes in V, in an online and adversarial manner; the access cost of a request to a node v, is given by the current depth of v in T. The online algorithm can try to reduce the access cost by performing swap operations, with which the position of a node is exchanged with the position of its parent in the tree; a swap operation costs one unit. The objective is to design an online algorithm which minimizes the total access cost plus adjustment cost (swapping). Avin et al. recently presented Random-Push, a constant competitive online algorithm for this problem, based on random walks, together with an analysis exploiting the most recently used (MRU) property of random walks. We study analytically and empirically, online algorithms for this problem. In particular, we explore how to derandomize Random-Push. We consider a simple derandomized algorithm which we call Rotor-Push, as its behavior is reminiscent of rotor walks. We first prove that Rotor-Push is constant competitive: its competitive ratio is 12 and hence by a factor of five lower than the best existing competitive ratio. In contrast to Random-Push, the algorithm does not feature the MRU property, which requires a new analysis. We present a significantly improved and simpler analysis for the randomized algorithm, showing that it is 16-competitive. We compare empirically all self-adjusting single-source tree networks, using synthetic and real data with varying locality and observe that Rotor-Push and Random-Push have almost identical performance. ",
    "url": "https://arxiv.org/abs/2204.10754",
    "authors": [
      "Chen Avin",
      "Marcin Bienkowski",
      "Iosif Salem",
      "Robert Sama",
      "Stefan Schmid",
      "Paweł Schmidt"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2204.10762",
    "title": "Dite-HRNet: Dynamic Lightweight High-Resolution Network for Human Pose  Estimation",
    "abstract": "A high-resolution network exhibits remarkable capability in extracting multi-scale features for human pose estimation, but fails to capture long-range interactions between joints and has high computational complexity. To address these problems, we present a Dynamic lightweight High-Resolution Network (Dite-HRNet), which can efficiently extract multi-scale contextual information and model long-range spatial dependency for human pose estimation. Specifically, we propose two methods, dynamic split convolution and adaptive context modeling, and embed them into two novel lightweight blocks, which are named dynamic multi-scale context block and dynamic global context block. These two blocks, as the basic component units of our Dite-HRNet, are specially designed for the high-resolution networks to make full use of the parallel multi-resolution architecture. Experimental results show that the proposed network achieves superior performance on both COCO and MPII human pose estimation datasets, surpassing the state-of-the-art lightweight networks. Code is available at: \\url{https://github.com/ZiyiZhang27/Dite-HRNet}. ",
    "url": "https://arxiv.org/abs/2204.10762",
    "authors": [
      "Qun Li",
      "Ziyi Zhang",
      "Fu Xiao",
      "Feng Zhang",
      "Bir Bhanu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10766",
    "title": "From Books to Knowledge Graphs",
    "abstract": "The digital transformation of the scientific publishing industry has led to dramatic improvements in content discoverability and information analytics. Unfortunately, these improvements have not been uniform across research areas. The scientific literature in the arts, humanities and social sciences (AHSS) still lags behind, in part due to the scale of analog backlogs, the persisting importance of national languages, and a publisher ecosystem made of many, small or medium enterprises. We propose a bottom-up approach to support publishers in creating and maintaining their own publication knowledge graphs in the open domain. We do so by releasing a pipeline able to extract structured information from the bibliographies and indexes of AHSS publications, disambiguate, normalize and export it as linked data. We test the proposed pipeline on Brill's Classics collection, and release an implementation in open source for further use and improvement. ",
    "url": "https://arxiv.org/abs/2204.10766",
    "authors": [
      "Natallia Kokash",
      "Matteo Romanello",
      "Ernest Suyver",
      "Giovanni Colavizza"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)"
    ]
  },
  {
    "id": "arXiv:2204.10777",
    "title": "ParkPredict+: Multimodal Intent and Motion Prediction for Vehicles in  Parking Lots with CNN and Transformer",
    "abstract": "The problem of multimodal intent and trajectory prediction for human-driven vehicles in parking lots is addressed in this paper. Using models designed with CNN and Transformer networks, we extract temporal-spatial and contextual information from trajectory history and local bird's eye view (BEV) semantic images, and generate predictions about intent distribution and future trajectory sequences. Our methods outperforms existing models in accuracy, while allowing an arbitrary number of modes, encoding complex multi-agent scenarios, and adapting to different parking maps. In addition, we present the first public human driving dataset in parking lot with high resolution and rich traffic scenarios for relevant research in this field. ",
    "url": "https://arxiv.org/abs/2204.10777",
    "authors": [
      "Xu Shen",
      "Matthew Lacayo",
      "Nidhir Guggilla",
      "Francesco Borrelli"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.10779",
    "title": "Centralized Adversarial Learning for Robust Deep Hashing",
    "abstract": "Deep hashing has been extensively utilized in massive image retrieval because of its efficiency and effectiveness. Recently, it becomes a hot issue to study adversarial examples which poses a security challenge to deep hashing models. However, there is still a critical bottleneck: how to find a superior and exact semantic representative as the guide to further enhance the adversarial attack and defense in deep hashing based retrieval. We, for the first time, attempt to design an effective adversarial learning with the min-max paradigm to improve the robustness of hashing networks by using the generated adversarial samples. Specifically, we obtain the optimal solution (called center code) through a proved Continuous Hash Center Method (CHCM), which preserves the semantic similarity with positive samples and dissimilarity with negative samples. On one hand, we propose the Deep Hashing Central Attack (DHCA) for efficient attack on hashing retrieval by maximizing the Hamming distance between the hash code of adversarial example and the center code. On the other hand, we present the Deep Hashing Central Adversarial Training (DHCAT) to optimize the hashing networks for defense, by minimizing the Hamming distance to the center code. Extensive experiments on the benchmark datasets verify that our attack method can achieve better performance than the state-of-the-arts, and our defense algorithm can effectively mitigate the effects of adversarial perturbations. ",
    "url": "https://arxiv.org/abs/2204.10779",
    "authors": [
      "Xunguang Wang",
      "Xu Yuan",
      "Zheng Zhang",
      "Guangming Lu",
      "Xiaomeng Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10782",
    "title": "On Feature Learning in Neural Networks with Global Convergence  Guarantees",
    "abstract": "We study the optimization of wide neural networks (NNs) via gradient flow (GF) in setups that allow feature learning while admitting non-asymptotic global convergence guarantees. First, for wide shallow NNs under the mean-field scaling and with a general class of activation functions, we prove that when the input dimension is no less than the size of the training set, the training loss converges to zero at a linear rate under GF. Building upon this analysis, we study a model of wide multi-layer NNs whose second-to-last layer is trained via GF, for which we also prove a linear-rate convergence of the training loss to zero, but regardless of the input dimension. We also show empirically that, unlike in the Neural Tangent Kernel (NTK) regime, our multi-layer model exhibits feature learning and can achieve better generalization performance than its NTK counterpart. ",
    "url": "https://arxiv.org/abs/2204.10782",
    "authors": [
      "Zhengdao Chen",
      "Eric Vanden-Eijnden",
      "Joan Bruna"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Probability (math.PR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.10803",
    "title": "Pay \"Attention\" to Adverse Weather: Weather-aware Attention-based Object  Detection",
    "abstract": "Despite the recent advances of deep neural networks, object detection for adverse weather remains challenging due to the poor perception of some sensors in adverse weather. Instead of relying on one single sensor, multimodal fusion has been one promising approach to provide redundant detection information based on multiple sensors. However, most existing multimodal fusion approaches are ineffective in adjusting the focus of different sensors under varying detection environments in dynamic adverse weather conditions. Moreover, it is critical to simultaneously observe local and global information under complex weather conditions, which has been neglected in most early or late-stage multimodal fusion works. In view of these, this paper proposes a Global-Local Attention (GLA) framework to adaptively fuse the multi-modality sensing streams, i.e., camera, gated camera, and lidar data, at two fusion stages. Specifically, GLA integrates an early-stage fusion via a local attention network and a late-stage fusion via a global attention network to deal with both local and global information, which automatically allocates higher weights to the modality with better detection features at the late-stage fusion to cope with the specific weather condition adaptively. Experimental results demonstrate the superior performance of the proposed GLA compared with state-of-the-art fusion approaches under various adverse weather conditions, such as light fog, dense fog, and snow. ",
    "url": "https://arxiv.org/abs/2204.10803",
    "authors": [
      "Saket S. Chaturvedi",
      "Lan Zhang",
      "Xiaoyong Yuan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10815",
    "title": "A Vocabulary-Free Multilingual Neural Tokenizer for End-to-End Task  Learning",
    "abstract": "Subword tokenization is a commonly used input pre-processing step in most recent NLP models. However, it limits the models' ability to leverage end-to-end task learning. Its frequency-based vocabulary creation compromises tokenization in low-resource languages, leading models to produce suboptimal representations. Additionally, the dependency on a fixed vocabulary limits the subword models' adaptability across languages and domains. In this work, we propose a vocabulary-free neural tokenizer by distilling segmentation information from heuristic-based subword tokenization. We pre-train our character-based tokenizer by processing unique words from multilingual corpus, thereby extensively increasing word diversity across languages. Unlike the predefined and fixed vocabularies in subword methods, our tokenizer allows end-to-end task learning, resulting in optimal task-specific tokenization. The experimental results show that replacing the subword tokenizer with our neural tokenizer consistently improves performance on multilingual (NLI) and code-switching (sentiment analysis) tasks, with larger gains in low-resource languages. Additionally, our neural tokenizer exhibits a robust performance on downstream tasks when adversarial noise is present (typos and misspelling), further increasing the initial improvements over statistical subword tokenizers. ",
    "url": "https://arxiv.org/abs/2204.10815",
    "authors": [
      "Md Mofijul Islam",
      "Gustavo Aguilar",
      "Pragaash Ponnusamy",
      "Clint Solomon Mathialagan",
      "Chengyuan Ma",
      "Chenlei Guo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.10822",
    "title": "Robust and efficient primal-dual Newton-Krylov solvers for  viscous-plastic sea-ice models",
    "abstract": "We present a Newton-Krylov solver for a viscous-plastic sea-ice model. This constitutive relation is commonly used in climate models to describe the large scale sea-ice motion. Due to the strong nonlinearity of the momentum equation, the development of fast, robust and scalable solvers is still a substantial challenge. We propose a novel primal-dual Newton linearization for the momentum equation. In contrast to existing methods, it converges faster and more robustly with respect to mesh refinement, and thus allows fully resolved sea-ice simulations. Combined with an algebraic multigrid-preconditioned Krylov method for the Newton linearized systems, which contain strongly varying coefficients, the resulting solver scales well and can be used in parallel. We present highly resolved benchmark solutions and solve problems with up to 8.4 million spatial unknowns. ",
    "url": "https://arxiv.org/abs/2204.10822",
    "authors": [
      "Yu-hsuan Shih",
      "Carolin Mehlmann",
      "Martin Losch",
      "Georg Stadler"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2204.10831",
    "title": "A note on graph drawings with star-shaped boundaries in the plane",
    "abstract": "In this note, we propose a straightforward method to produce an straight-line embedding of a planar graph where one face of a graph is fixed in the plane as a star-shaped polygon. It is based on minimizing discrete Dirichlet energies, following the idea of Tutte's embedding theorem. We will call it a geodesic triangulation of the star-shaped polygon. Moreover, we study the homotopy property of spaces of all straight-line embeddings. We give a simple argument to show that this space is contractible if the boundary is a non-convex quadrilateral. We conjecture that the same statement holds for general star-shaped polygons. ",
    "url": "https://arxiv.org/abs/2204.10831",
    "authors": [
      "Yanwen Luo"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "General Topology (math.GN)"
    ]
  },
  {
    "id": "arXiv:2204.10836",
    "title": "Federated Learning Enables Big Data for Rare Cancer Boundary Detection",
    "abstract": "Although machine learning (ML) has shown promise in numerous domains, there are concerns about generalizability to out-of-sample data. This is currently addressed by centrally sharing ample, and importantly diverse, data from multiple sites. However, such centralization is challenging to scale (or even not feasible) due to various limitations. Federated ML (FL) provides an alternative to train accurate and generalizable ML models, by only sharing numerical model updates. Here we present findings from the largest FL study to-date, involving data from 71 healthcare institutions across 6 continents, to generate an automatic tumor boundary detector for the rare disease of glioblastoma, utilizing the largest dataset of such patients ever used in the literature (25,256 MRI scans from 6,314 patients). We demonstrate a 33% improvement over a publicly trained model to delineate the surgically targetable tumor, and 23% improvement over the tumor's entire extent. We anticipate our study to: 1) enable more studies in healthcare informed by large and diverse data, ensuring meaningful results for rare diseases and underrepresented populations, 2) facilitate further quantitative analyses for glioblastoma via performance optimization of our consensus model for eventual public release, and 3) demonstrate the effectiveness of FL at such scale and task complexity as a paradigm shift for multi-site collaborations, alleviating the need for data sharing. ",
    "url": "https://arxiv.org/abs/2204.10836",
    "authors": [
      "Sarthak Pati",
      "Ujjwal Baid",
      "Brandon Edwards",
      "Micah Sheller",
      "Shih-Han Wang",
      "G Anthony Reina",
      "Patrick Foley",
      "Alexey Gruzdev",
      "Deepthi Karkada",
      "Christos Davatzikos",
      "Chiharu Sako",
      "Satyam Ghodasara",
      "Michel Bilello",
      "Suyash Mohan",
      "Philipp Vollmuth",
      "Gianluca Brugnara",
      "Chandrakanth J Preetha",
      "Felix Sahm",
      "Klaus Maier-Hein",
      "Maximilian Zenk",
      "Martin Bendszus",
      "Wolfgang Wick",
      "Evan Calabrese",
      "Jeffrey Rudie",
      "Javier Villanueva-Meyer",
      "Soonmee Cha",
      "Madhura Ingalhalikar",
      "Manali Jadhav",
      "Umang Pandey",
      "Jitender Saini",
      "John Garrett",
      "Matthew Larson",
      "Robert Jeraj",
      "Stuart Currie",
      "Russell Frood",
      "Kavi Fatania",
      "Raymond Y Huang",
      "Ken Chang",
      "Carmen Balaña Quintero",
      "Jaume Capellades",
      "Josep Puig",
      "Johannes Trenkler",
      "Josef Pichler",
      "Georg Necker",
      "Andreas Haunschmidt",
      "Stephan Meckel",
      "Gaurav Shukla",
      "Spencer Liem",
      "Gregory S Alexander"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.10839",
    "title": "How Sampling Impacts the Robustness of Stochastic Neural Networks",
    "abstract": "Stochastic neural networks (SNNs) are random functions and predictions are gained by averaging over multiple realizations of this random function. Consequently, an adversarial attack is calculated based on one set of samples and applied to the prediction defined by another set of samples. In this paper we analyze robustness in this setting by deriving a sufficient condition for the given prediction process to be robust against the calculated attack. This allows us to identify the factors that lead to an increased robustness of SNNs and helps to explain the impact of the variance and the amount of samples. Among other things, our theoretical analysis gives insights into (i) why increasing the amount of samples drawn for the estimation of adversarial examples increases the attack's strength, (ii) why decreasing sample size during inference hardly influences the robustness, and (iii) why a higher prediction variance between realizations relates to a higher robustness. We verify the validity of our theoretical findings by an extensive empirical analysis. ",
    "url": "https://arxiv.org/abs/2204.10839",
    "authors": [
      "Sina Däubener",
      "Asja Fischer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10846",
    "title": "Self-Supervised Video Object Segmentation via Cutout Prediction and  Tagging",
    "abstract": "We propose a novel self-supervised Video Object Segmentation (VOS) approach that strives to achieve better object-background discriminability for accurate object segmentation. Distinct from previous self-supervised VOS methods, our approach is based on a discriminative learning loss formulation that takes into account both object and background information to ensure object-background discriminability, rather than using only object appearance. The discriminative learning loss comprises cutout-based reconstruction (cutout region represents part of a frame, whose pixels are replaced with some constant values) and tag prediction loss terms. The cutout-based reconstruction term utilizes a simple cutout scheme to learn the pixel-wise correspondence between the current and previous frames in order to reconstruct the original current frame with added cutout region in it. The introduced cutout patch guides the model to focus as much on the significant features of the object of interest as the less significant ones, thereby implicitly equipping the model to address occlusion-based scenarios. Next, the tag prediction term encourages object-background separability by grouping tags of all pixels in the cutout region that are similar, while separating them from the tags of the rest of the reconstructed frame pixels. Additionally, we introduce a zoom-in scheme that addresses the problem of small object segmentation by capturing fine structural information at multiple scales. Our proposed approach, termed CT-VOS, achieves state-of-the-art results on two challenging benchmarks: DAVIS-2017 and Youtube-VOS. A detailed ablation showcases the importance of the proposed loss formulation to effectively capture object-background discriminability and the impact of our zoom-in scheme to accurately segment small-sized objects. ",
    "url": "https://arxiv.org/abs/2204.10846",
    "authors": [
      "Jyoti Kini",
      "Fahad Shahbaz Khan",
      "Salman Khan",
      "Mubarak Shah"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.10849",
    "title": "Metric Learning and Adaptive Boundary for Out-of-Domain Detection",
    "abstract": "Conversational agents are usually designed for closed-world environments. Unfortunately, users can behave unexpectedly. Based on the open-world environment, we often encounter the situation that the training and test data are sampled from different distributions. Then, data from different distributions are called out-of-domain (OOD). A robust conversational agent needs to react to these OOD utterances adequately. Thus, the importance of robust OOD detection is emphasized. Unfortunately, collecting OOD data is a challenging task. We have designed an OOD detection algorithm independent of OOD data that outperforms a wide range of current state-of-the-art algorithms on publicly available datasets. Our algorithm is based on a simple but efficient approach of combining metric learning with adaptive decision boundary. Furthermore, compared to other algorithms, we have found that our proposed algorithm has significantly improved OOD performance in a scenario with a lower number of classes while preserving the accuracy for in-domain (IND) classes. ",
    "url": "https://arxiv.org/abs/2204.10849",
    "authors": [
      "Petr Lorenc",
      "Tommaso Gargiani",
      "Jan Pichl",
      "Jakub Konrád",
      "Petr Marek",
      "Ondřej Kobza",
      "Jan Šedivý"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.10436",
    "title": "Scale-Equivariant Unrolled Neural Networks for Data-Efficient  Accelerated MRI Reconstruction",
    "abstract": "Unrolled neural networks have enabled state-of-the-art reconstruction performance and fast inference times for the accelerated magnetic resonance imaging (MRI) reconstruction task. However, these approaches depend on fully-sampled scans as ground truth data which is either costly or not possible to acquire in many clinical medical imaging applications; hence, reducing dependence on data is desirable. In this work, we propose modeling the proximal operators of unrolled neural networks with scale-equivariant convolutional neural networks in order to improve the data-efficiency and robustness to drifts in scale of the images that might stem from the variability of patient anatomies or change in field-of-view across different MRI scanners. Our approach demonstrates strong improvements over the state-of-the-art unrolled neural networks under the same memory constraints both with and without data augmentations on both in-distribution and out-of-distribution scaled images without significantly increasing the train or inference time. ",
    "url": "https://arxiv.org/abs/2204.10436",
    "authors": [
      "Beliz Gunel",
      "Arda Sahiner",
      "Arjun D. Desai",
      "Akshay S. Chaudhari",
      "Shreyas Vasanawala",
      "Mert Pilanci",
      "John Pauly"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10473",
    "title": "Gene Function Prediction with Gene Interaction Networks: A Context Graph  Kernel Approach",
    "abstract": "Predicting gene functions is a challenge for biologists in the post genomic era. Interactions among genes and their products compose networks that can be used to infer gene functions. Most previous studies adopt a linkage assumption, i.e., they assume that gene interactions indicate functional similarities between connected genes. In this study, we propose to use a gene's context graph, i.e., the gene interaction network associated with the focal gene, to infer its functions. In a kernel-based machine-learning framework, we design a context graph kernel to capture the information in context graphs. Our experimental study on a testbed of p53-related genes demonstrates the advantage of using indirect gene interactions and shows the empirical superiority of the proposed approach over linkage-assumption-based methods, such as the algorithm to minimize inconsistent connected genes and diffusion kernels. ",
    "url": "https://arxiv.org/abs/2204.10473",
    "authors": [
      "Xin Li",
      "Hsinchun Chen",
      "Jiexun Li",
      "Zhu Zhang"
    ],
    "subjectives": [
      "Molecular Networks (q-bio.MN)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.10495",
    "title": "Adversarial Estimators",
    "abstract": "We develop an asymptotic theory of adversarial estimators (`A-estimators'). Like maximum-likelihood-type estimators (`M-estimators'), both the estimator and estimand are defined as the critical points of a sample and population average respectively. A-estimators generalize M-estimators, as their objective is maximized by one set of parameters and minimized by another. The continuous-updating Generalized Method of Moments estimator, popular in econometrics and causal inference, is among the earliest members of this class which distinctly falls outside the M-estimation framework. Since the recent success of Generative Adversarial Networks, A-estimators received considerable attention in both machine learning and causal inference contexts, where a flexible adversary can remove the need for researchers to manually specify which features of a problem are important. We present general results characterizing the convergence rates of A-estimators under both point-wise and partial identification, and derive the asymptotic root-n normality for plug-in estimates of smooth functionals of their parameters. All unknown parameters may contain functions which are approximated via sieves. While the results apply generally, we provide easily verifiable, low-level conditions for the case where the sieves correspond to (deep) neural networks. Our theory also yields the asymptotic normality of general functionals of neural network M-estimators (as a special case), overcoming technical issues previously identified by the literature. We examine a variety of A-estimators proposed across econometrics and machine learning and use our theory to derive novel statistical results for each of them. Embedding distinct A-estimators into the same framework, we notice interesting connections among them, providing intuition and formal justification for their recent success in practical applications. ",
    "url": "https://arxiv.org/abs/2204.10495",
    "authors": [
      "Jonas Metzger"
    ],
    "subjectives": [
      "Econometrics (econ.EM)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.10676",
    "title": "Bayesian mixed-effect models for independent dynamic social network data",
    "abstract": "Relational event or time-stamped social network data have become increasingly available over the years. Accordingly, statistical methods for such data have also surfaced. These techniques are based on log-linear models of the rates of interactions in a social network via actor covariates and network statistics. Particularly, the use of survival analysis concepts has stimulated the development of powerful methods over the past decade. These models mainly focus on the analysis of single networks. To date, there are few models that can deal with multiple relational event networks jointly. In this paper, we propose a new Bayesian hierarchical model for multiple relational event sequences. This approach allows inferences at the actor level, which are useful in understanding which effects guide actors' preferences in social interactions. We also present Bayes factors for hypothesis testing in this class of models. In addition, a new Bayes factor to test random-effect structures is developed. In this test, we let the prior be determined by the data, alleviating the issue of employing improper priors in Bayes factors and thus preventing the use of ad-hoc choices in absence of prior information. We use data of classroom interactions among high school students to illustrate the proposed methods. ",
    "url": "https://arxiv.org/abs/2204.10676",
    "authors": [
      "Fabio Vieira",
      "Roger Leenders",
      "Daniel McFarland",
      "Joris Mulder"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.10773",
    "title": "Denoising of Three-Dimensional Fast Spin Echo Magnetic Resonance Images  of Knee Joints using Spatial-Variant Noise-Relevant Residual Learning of  Convolution Neural Network",
    "abstract": "Two-dimensional (2D) fast spin echo (FSE) techniques play a central role in the clinical magnetic resonance imaging (MRI) of knee joints. Moreover, three-dimensional (3D) FSE provides high-isotropic-resolution magnetic resonance (MR) images of knee joints, but it has a reduced signal-to-noise ratio compared to 2D FSE. Deep-learning denoising methods are a promising approach for denoising MR images, but they are often trained using synthetic noise due to challenges in obtaining true noise distributions for MR images. In this study, inherent true noise information from 2-NEX acquisition was used to develop a deep-learning model based on residual learning of convolutional neural network (CNN), and this model was used to suppress the noise in 3D FSE MR images of knee joints. The proposed CNN used two-step residual learning over parallel transporting and residual blocks and was designed to comprehensively learn real noise features from 2-NEX training data. The results of an ablation study validated the network design. The new method achieved improved denoising performance of 3D FSE knee MR images compared with current state-of-the-art methods, based on the peak signal-to-noise ratio and structural similarity index measure. The improved image quality after denoising using the new method was verified by radiological evaluation. A deep CNN using the inherent spatial-varying noise information in 2-NEX acquisitions was developed. This method showed promise for clinical MRI assessments of the knee, and has potential applications for the assessment of other anatomical structures. ",
    "url": "https://arxiv.org/abs/2204.10773",
    "authors": [
      "Shutian Zhao",
      "Donal G. Cahill",
      "Siyue Li",
      "Fan Xiao",
      "Thierry Blu",
      "James F Griffith",
      "Weitian Chen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:1808.07292",
    "title": "XAI Beyond Classification: Interpretable Neural Clustering",
    "abstract": " Comments: 28 pages ",
    "url": "https://arxiv.org/abs/1808.07292",
    "authors": [
      "Xi Peng",
      "Yunnan Li",
      "Ivor W. Tsang",
      "Hongyuan Zhu",
      "Jiancheng Lv",
      "Joey Tianyi Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1909.08417",
    "title": "Persistence B-Spline Grids: Stable Vector Representation of Persistence  Diagrams Based on Data Fitting",
    "abstract": " Title: Persistence B-Spline Grids: Stable Vector Representation of Persistence  Diagrams Based on Data Fitting ",
    "url": "https://arxiv.org/abs/1909.08417",
    "authors": [
      "Zhetong Dong",
      "Hongwei Lin",
      "Chi Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Geometry (cs.CG)",
      "Algebraic Topology (math.AT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1911.04586",
    "title": "Chemical Reactions-based Detection Mechanism for Molecular  Communications",
    "abstract": " Comments: 13 pages, 11 figures, 1 table. This journal version was submitted in April 2022 to the IEEE for possible publication. A part of this article was presented at the IEEE Wireless Communications and Networking Conference 2020 and stored in the previous version on arXiv ",
    "url": "https://arxiv.org/abs/1911.04586",
    "authors": [
      "Trang Ngoc Cao",
      "Vahid Jamali",
      "Wayan Wicke",
      "Phee Lep Yeoh",
      "Nikola Zlatanov",
      "Jamie S Evans",
      "Robert Schober"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2001.00937",
    "title": "Resilient Multi-Dimensional Consensus in Adversarial Environment",
    "abstract": " Title: Resilient Multi-Dimensional Consensus in Adversarial Environment ",
    "url": "https://arxiv.org/abs/2001.00937",
    "authors": [
      "Jiaqi Yan",
      "Xiuxian Li",
      "Yilin Mo",
      "Changyun Wen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2002.09792",
    "title": "Real-Time Detectors for Digital and Physical Adversarial Inputs to  Perception Systems",
    "abstract": " Title: Real-Time Detectors for Digital and Physical Adversarial Inputs to  Perception Systems ",
    "url": "https://arxiv.org/abs/2002.09792",
    "authors": [
      "Yiannis Kantaros",
      "Taylor Carpenter",
      "Kaustubh Sridhar",
      "Yahan Yang",
      "Insup Lee",
      "James Weimer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2004.11494",
    "title": "Beyond Data Samples: Aligning Differential Networks Estimation with  Scientific Knowledge",
    "abstract": " Comments: 9 pages of main draft; 25 pages of Appendix; 5 Tables ; 14 Figures ; Learning of Structure Difference between Two Graphical Models ",
    "url": "https://arxiv.org/abs/2004.11494",
    "authors": [
      "Arshdeep Sekhon",
      "Zhe Wang",
      "Yanjun Qi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2011.04047",
    "title": "Computing Lengths of Non-Crossing Shortest Paths in Planar Graphs",
    "abstract": " Comments: 15 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2011.04047",
    "authors": [
      "Lorenzo Balzotti",
      "Paolo G. Franciosa"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2102.08847",
    "title": "Differential Privacy for Government Agencies -- Are We There Yet?",
    "abstract": " Comments: 45 pages, 0 figures ",
    "url": "https://arxiv.org/abs/2102.08847",
    "authors": [
      "Joerg Drechsler"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Other Statistics (stat.OT)"
    ]
  },
  {
    "id": "arXiv:2105.06637",
    "title": "Understanding occupants' behaviour, engagement, emotion, and comfort  indoors with heterogeneous sensors and wearables",
    "abstract": " Comments: This paper has been accepted by Nature Scientific Data. The link for the datasets: this https URL ",
    "url": "https://arxiv.org/abs/2105.06637",
    "authors": [
      "Nan Gao",
      "Max Marschall",
      "Jane Burry",
      "Simon Watkins",
      "Flora D. Salim"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.02602",
    "title": "InDiD: Instant Disorder Detection via Representation Learning",
    "abstract": " Title: InDiD: Instant Disorder Detection via Representation Learning ",
    "url": "https://arxiv.org/abs/2106.02602",
    "authors": [
      "Evgenia Romanenkova",
      "Alexander Stepikin",
      "Matvey Morozov",
      "Alexey Zaytsev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.05239",
    "title": "XBNet : An Extremely Boosted Neural Network",
    "abstract": " Title: XBNet : An Extremely Boosted Neural Network ",
    "url": "https://arxiv.org/abs/2106.05239",
    "authors": [
      "Tushar Sarkar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.08982",
    "title": "InsPose: Instance-Aware Networks for Single-Stage Multi-Person Pose  Estimation",
    "abstract": " Title: InsPose: Instance-Aware Networks for Single-Stage Multi-Person Pose  Estimation ",
    "url": "https://arxiv.org/abs/2107.08982",
    "authors": [
      "Dahu Shi",
      "Xing Wei",
      "Xiaodong Yu",
      "Wenming Tan",
      "Ye Ren",
      "Shiliang Pu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.06115",
    "title": "Subcubic planar graphs of girth 7 are class I",
    "abstract": " Comments: 7 pages plus 6 pages of annex; 11 figures ",
    "url": "https://arxiv.org/abs/2108.06115",
    "authors": [
      "Sebastien Bonduelle",
      "František Kardoš"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2108.10682",
    "title": "A Study into Patient Similarity through Representation Learning from  Medical Records",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2104.14229 ",
    "url": "https://arxiv.org/abs/2108.10682",
    "authors": [
      "Sahar Khalafi",
      "Nasser Ghadiri",
      "Milad Moradi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2108.11674",
    "title": "Network Module Detection from Multi-Modal Node Features with a Greedy  Decision Forest for Actionable Explainable AI",
    "abstract": " Title: Network Module Detection from Multi-Modal Node Features with a Greedy  Decision Forest for Actionable Explainable AI ",
    "url": "https://arxiv.org/abs/2108.11674",
    "authors": [
      "Bastian Pfeifer",
      "Hubert Baniecki",
      "Anna Saranti",
      "Przemyslaw Biecek",
      "Andreas Holzinger"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Molecular Networks (q-bio.MN)"
    ]
  },
  {
    "id": "arXiv:2109.05820",
    "title": "Improving the Robustness of Adversarial Attacks Using an  Affine-Invariant Gradient Estimator",
    "abstract": " Title: Improving the Robustness of Adversarial Attacks Using an  Affine-Invariant Gradient Estimator ",
    "url": "https://arxiv.org/abs/2109.05820",
    "authors": [
      "Wenzhao Xiang",
      "Hang Su",
      "Chang Liu",
      "Yandong Guo",
      "Shibao Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.13742",
    "title": "Adaptive Attribute and Structure Subspace Clustering Network",
    "abstract": " Comments: This paper has been accepted by IEEE Transactions on Image Processing ",
    "url": "https://arxiv.org/abs/2109.13742",
    "authors": [
      "Zhihao Peng",
      "Hui Liu",
      "Yuheng Jia",
      "Junhui Hou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.00925",
    "title": "Matching Models for Graph Retrieval",
    "abstract": " Comments: BS Thesis ",
    "url": "https://arxiv.org/abs/2110.00925",
    "authors": [
      "Chitrank Gupta",
      "Yash Jain"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.12460",
    "title": "ViCE: Visual Concept Embedding Discovery and Superpixelization",
    "abstract": " Title: ViCE: Visual Concept Embedding Discovery and Superpixelization ",
    "url": "https://arxiv.org/abs/2111.12460",
    "authors": [
      "Robin Karlsson",
      "Tomoki Hayashi",
      "Keisuke Fujii",
      "Alexander Carballo",
      "Kento Ohtani",
      "Kazuya Takeda"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.05648",
    "title": "Minimax detection of localized signals in statistical inverse problems",
    "abstract": " Title: Minimax detection of localized signals in statistical inverse problems ",
    "url": "https://arxiv.org/abs/2112.05648",
    "authors": [
      "Markus Pohlmann",
      "Frank Werner",
      "Axel Munk"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2112.07774",
    "title": "Assessing Human Interaction in Virtual Reality With Continually Learning  Prediction Agents Based on Reinforcement Learning Algorithms: A Pilot Study",
    "abstract": " Title: Assessing Human Interaction in Virtual Reality With Continually Learning  Prediction Agents Based on Reinforcement Learning Algorithms: A Pilot Study ",
    "url": "https://arxiv.org/abs/2112.07774",
    "authors": [
      "Dylan J. A. Brenneis",
      "Adam S. Parker",
      "Michael Bradley Johanson",
      "Andrew Butcher",
      "Elnaz Davoodi",
      "Leslie Acker",
      "Matthew M. Botvinick",
      "Joseph Modayil",
      "Adam White",
      "Patrick M. Pilarski"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2202.09587",
    "title": "An Evaluation of Open-source Tools for the Provision of Differential  Privacy",
    "abstract": " Comments: We conducted a major revision for this paper with a renewed title and we added more coauthors that contribute to the new version ",
    "url": "https://arxiv.org/abs/2202.09587",
    "authors": [
      "Shiliang Zhang",
      "Anton Hagermalm",
      "Sanjin Slavnic"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.03137",
    "title": "MSDN: Mutually Semantic Distillation Network for Zero-Shot Learning",
    "abstract": " Comments: Accepted to CVPR'22 ",
    "url": "https://arxiv.org/abs/2203.03137",
    "authors": [
      "Shiming Chen",
      "Ziming Hong",
      "Guo-Sen Xie",
      "Wenhan Yang",
      "Qinmu Peng",
      "Kai Wang",
      "Jian Zhao",
      "Xinge You"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.03798",
    "title": "New Insights on Reducing Abrupt Representation Change in Online  Continual Learning",
    "abstract": " Comments: This has been withdrawn as it is a new version of arXiv:2104.05025 ",
    "url": "https://arxiv.org/abs/2203.03798",
    "authors": [
      "Lucas Caccia",
      "Rahaf Aljundi",
      "Nader Asadi",
      "Tinne Tuytelaars",
      "Joelle Pineau",
      "Eugene Belilovsky"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.04118",
    "title": "An Efficient Polyp Segmentation Network",
    "abstract": " Comments: 4 pages, in Turkish language, 2 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2203.04118",
    "authors": [
      "Tugberk Erol",
      "Duygu Sarikaya"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.08606",
    "title": "A Reachability Index for Recursive Label-Concatenated Graph Queries",
    "abstract": " Title: A Reachability Index for Recursive Label-Concatenated Graph Queries ",
    "url": "https://arxiv.org/abs/2203.08606",
    "authors": [
      "Chao Zhang",
      "Angela Bonifati",
      "Hugo Kapp",
      "Vlad Ioan Haprian",
      "Jean-Pierre Lozi"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2203.09961",
    "title": "Personalized Filled-pause Generation with Group-wise Prediction Models",
    "abstract": " Comments: Accepted to LREC 2022 ",
    "url": "https://arxiv.org/abs/2203.09961",
    "authors": [
      "Yuta Matsunaga",
      "Takaaki Saeki",
      "Shinnosuke Takamichi",
      "Hiroshi Saruwatari"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.10316",
    "title": "Learning to Reason Deductively: Math Word Problem Solving as Complex  Relation Extraction",
    "abstract": " Comments: 12 pages, 7 figures, Accepted by ACL-2022 main conference as a long paper ",
    "url": "https://arxiv.org/abs/2203.10316",
    "authors": [
      "Zhanming Jie",
      "Jierui Li",
      "Wei Lu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.01785",
    "title": "Code Verification for Practically Singular Equations",
    "abstract": " Title: Code Verification for Practically Singular Equations ",
    "url": "https://arxiv.org/abs/2204.01785",
    "authors": [
      "Brian A. Freno",
      "Neil R. Matula"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2204.05508",
    "title": "Fast Selective Flushing to Mitigate Contention-based Cache Timing  Attacks",
    "abstract": " Comments: This work has been submitted to the ACM for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2204.05508",
    "authors": [
      "Tuo Li",
      "Sri Parameswaran"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2204.06240",
    "title": "CowClip: Reducing CTR Prediction Model Training Time from 12 hours to 10  minutes on 1 GPU",
    "abstract": " Title: CowClip: Reducing CTR Prediction Model Training Time from 12 hours to 10  minutes on 1 GPU ",
    "url": "https://arxiv.org/abs/2204.06240",
    "authors": [
      "Zangwei Zheng",
      "Pengtai Xu",
      "Xuan Zou",
      "Da Tang",
      "Zhen Li",
      "Chenguang Xi",
      "Peng Wu",
      "Leqi Zou",
      "Yijie Zhu",
      "Ming Chen",
      "Xiangzhuo Ding",
      "Fuzhao Xue",
      "Ziheng Qing",
      "Youlong Cheng",
      "Yang You"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2204.06718",
    "title": "Learning Convolutional Neural Networks in the Frequency Domain",
    "abstract": " Comments: Submitted to NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2204.06718",
    "authors": [
      "Hengyue Pan",
      "Yixin Chen",
      "Xin Niu",
      "Wenbo Zhou",
      "Dongsheng Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.07854",
    "title": "IIFNet: A Fusion based Intelligent Service for Noisy Preamble Detection  in 6G",
    "abstract": " Comments: 7 pages, 3 figures, 2 tables, Accepted Article ",
    "url": "https://arxiv.org/abs/2204.07854",
    "authors": [
      "Sunder Ali Khowaja",
      "Kapal Dev",
      "Parus Khuwaja",
      "Quoc-Viet Pham",
      "Nawab Muhammad Faseeh Qureshi",
      "Paolo Bellavista",
      "Maurizio Magarini"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.09204",
    "title": "Interventional Multi-Instance Learning with Deconfounded Instance-Level  Prediction",
    "abstract": " Comments: 7 pages. Accepted by AAAI2022 ",
    "url": "https://arxiv.org/abs/2204.09204",
    "authors": [
      "Tiancheng Lin",
      "Hongteng Xu",
      "Canqian Yang",
      "Yi Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.09353",
    "title": "Analyzing the Impact of Undersampling on the Benchmarking and  Configuration of Evolutionary Algorithms",
    "abstract": " Comments: To be published in proceedings of Genetic and Evolutionary Computation Conference (GECCO 22), July 9-13, 2022, Boston, MA, USA. ACM, New York, NY, USA, 9 pages. this https URL ",
    "url": "https://arxiv.org/abs/2204.09353",
    "authors": [
      "Diederick Vermetten",
      "Hao Wang",
      "Manuel López-Ibañez",
      "Carola Doerr",
      "Thomas Bäck"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.09710",
    "title": "Complete identification of complex salt-geometries from inaccurate  migrated images using Deep Learning",
    "abstract": " Comments: 19 pages, 13 figures. First manuscript version submitted to Geophysics in September 2021 ",
    "url": "https://arxiv.org/abs/2204.09710",
    "authors": [
      "Ana Paula O. Muller",
      "Jesse C. Costa",
      "Clecio R. Bom",
      "Elisangela L. Faria",
      "Matheus Klatt",
      "Gabriel Teixeira",
      "Marcelo P. de Albuquerque",
      "Marcio P. de Albuquerque"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]