[
  {
    "id": "arXiv:2108.03455",
    "title": "An output-sensitive algorithm for all-pairs shortest paths in directed  acyclic graphs",
    "abstract": "A straightforward dynamic programming method for the single-source shortest paths problem (SSSP) in an edge-weighted directed acyclic graph (DAG) processes the vertices in a topologically sorted order. First, we similarly iterate this method alternatively in a breadth-first search sorted order and the reverse order on an input directed graph with both positive and negative real edge weights, $n$ vertices and $m$ edges. For a positive integer $t,$ after $O(t)$ iterations in $O(tm)$ time, we obtain for each vertex $v$ a path distance from the source to $v$ not exceeding that yielded by the shortest path from the source to $v$ among the so called {\\em$ t+$light paths}. A directed path between two vertices is $t+$light if it contains at most $t$ more edges than the minimum edge-cardinality directed path between these vertices. After $O(n)$ iterations, we obtain an $O(nm)$-time solution to SSSP in directed graphs with real edge weights matching that of Bellman and Ford. Our main result is an output-sensitive algorithm for the all-pairs shortest paths problem (APSP) in DAGs with positive and negative real edge weights. It runs in time $O(\\min \\{n^{\\omega}, nm+n^2\\log n\\}+\\sum_{v\\in V}\\text{indeg}(v)|\\text{leaf}(T_v)|),$ where $n$ is the number of vertices, $m$ is the number of edges, $\\omega$ is the exponent of fast matrix multiplication, $\\text{indeg}(v)$ stands for the indegree of $v,$ $T_v$ is a tree of lexicographically-first shortest directed paths from all ancestors of $v$ to $v$, and $\\text{leaf}(T_v)$ is the set of leaves in $T_v.$ Finally, we discuss an extension of hypothetical improved upper time-bounds for APSP in non-negatively edge-weighted DAGs to include directed graphs with a polynomial number of large directed cycles. ",
    "url": "https://arxiv.org/abs/2108.03455",
    "authors": [
      "Andrzej Lingas",
      "Mia Persson",
      "Dzmitry Sledneu"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2108.03585",
    "title": "Ensemble neuroevolution based approach for multivariate time series  anomaly detection",
    "abstract": "Multivariate time series anomaly detection is a very common problem in the field of failure prevention. Fast prevention means lower repair costs and losses. The amount of sensors in novel industry systems makes the anomaly detection process quite difficult for humans. Algorithms which automates the process of detecting anomalies are crucial in modern failure-prevention systems. Therefore, many machine and deep learning models have been designed to address this problem. Mostly, they are autoencoder-based architectures with some generative adversarial elements. In this work, a framework is shown which incorporates neuroevolution methods to boost the anomaly-detection scores of new and already known models. The presented approach adapts evolution strategies for evolving ensemble model, in which every single model works on a subgroup of data sensors. The next goal of neuroevolution is to optimise architecture and hyperparameters like window size, the number of layers, layer depths, etc. The proposed framework shows that it is possible to boost most of the anomaly detection deep learning models in a reasonable time and a fully automated mode. The tests were run on SWAT and WADI datasets. To our knowledge, this is the first approach in which an ensemble deep learning anomaly detection model is built in a fully automatic way using a neuroevolution strategy. ",
    "url": "https://arxiv.org/abs/2108.03585",
    "authors": [
      "Kamil Faber",
      "Dominik Żurek",
      "Marcin Pietroń",
      "Kamil Piętak"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2108.03968",
    "title": "Not quite there yet: Combining analogical patterns and encoder-decoder  networks for cognitively plausible inflection",
    "abstract": "The paper presents four models submitted to Part 2 of the SIGMORPHON 2021 Shared Task 0, which aims at replicating human judgements on the inflection of nonce lexemes. Our goal is to explore the usefulness of combining pre-compiled analogical patterns with an encoder-decoder architecture. Two models are designed using such patterns either in the input or the output of the network. Two extra models controlled for the role of raw similarity of nonce inflected forms to existing inflected forms in the same paradigm cell, and the role of the type frequency of analogical patterns. Our strategy is entirely endogenous in the sense that the models appealing solely to the data provided by the SIGMORPHON organisers, without using external resources. Our model 2 ranks second among all submitted systems, suggesting that the inclusion of analogical patterns in the network architecture is useful in mimicking speakers' predictions. ",
    "url": "https://arxiv.org/abs/2108.03968",
    "authors": [
      "Basilio Calderone",
      "Nabil Hathout",
      "Olivier Bonami"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2108.04052",
    "title": "Training of deep residual networks with stochastic MG/OPT",
    "abstract": "We train deep residual networks with a stochastic variant of the nonlinear multigrid method MG/OPT. To build the multilevel hierarchy, we use the dynamical systems viewpoint specific to residual networks. We report significant speed-ups and additional robustness for training MNIST on deep residual networks. Our numerical experiments also indicate that multilevel training can be used as a pruning technique, as many of the auxiliary networks have accuracies comparable to the original network. ",
    "url": "https://arxiv.org/abs/2108.04052",
    "authors": [
      "Cyrill von Planta",
      "Alena Kopanicakova",
      "Rolf Krause"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.04177",
    "title": "Novel scorpion detection system combining computer vision and  fluorescence",
    "abstract": "In this work, a fully automatic and real-time system for the detection of scorpions was developed using computer vision and deep learning techniques. This system is based on the implementation of a double validation process using the shape features and the fluorescent characteristics of scorpions when exposed to ultraviolet (UV) light. The Haar Cascade Classifier (HCC) and YOLO (You Only Look Once) models have been used and compared as the first mechanism for the scorpion shape detection. The detection of the fluorescence emitted by the scorpions under UV light has been used as a second detection mechanism in order to increase the accuracy and precision of the system. The results obtained show that the system can accurately and reliably detect the presence of scorpions. In addition, values obtained of recall of 100% is essential with the purpose of providing a health security tool. Although the developed system can only be used at night or in dark environment, where the fluorescence emitted by the scorpions can be visualized, the nocturnal activity of scorpions justifies the incorporation of this second validation mechanism. ",
    "url": "https://arxiv.org/abs/2108.04177",
    "authors": [
      "Francisco Luis Giambelluca",
      "Jorge Osio",
      "Luis A. Giambelluca",
      "Marcelo A. Cappelletti"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2108.04180",
    "title": "Estimation of excess air coefficient on coal combustion processes via  gauss model and artificial neural network",
    "abstract": "It is no doubt that the most important contributing cause of global efficiency of coal fired thermal systems is combustion efficiency. In this study, the relationship between the flame image obtained by a CCD camera and the excess air coefficient ({\\lambda}) has been modelled. The model has been obtained with a three-stage approach: 1) Data collection and synchronization: Obtaining the flame images by means of a CCD camera mounted on a 10 cm diameter observation port, {\\lambda} data has been coordinately measured and recorded by the flue gas analyzer. 2) Feature extraction: Gridding the flame image, it is divided into small pieces. The uniformity of each piece to the optimal flame image has been calculated by means of modelling with single and multivariable Gaussian, calculating of color probabilities and Gauss mixture approach. 3) Matching and testing: A multilayer artificial neural network (ANN) has been used for the matching of feature-{\\lambda}. ",
    "url": "https://arxiv.org/abs/2108.04180",
    "authors": [
      "Sedat Golgiyaz",
      "Muhammed Fatih Talu",
      "Mahmut Daskin",
      "Cem Onat"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2108.04218",
    "title": "eRAKI: Fast Robust Artificial neural networks for K-space Interpolation  (RAKI) with Coil Combination and Joint Reconstruction",
    "abstract": "RAKI can perform database-free MRI reconstruction by training models using only auto-calibration signal (ACS) from each specific scan. As it trains a separate model for each individual coil, learning and inference with RAKI can be computationally prohibitive, particularly for large 3D datasets. In this abstract, we accelerate RAKI more than 200 times by directly learning a coil-combined target and further improve the reconstruction performance using joint reconstruction across multiple echoes together with an elliptical-CAIPI sampling approach. We further deploy these improvements in quantitative imaging and rapidly obtain T2 and T2* parameter maps from a fast EPTI scan. ",
    "url": "https://arxiv.org/abs/2108.04218",
    "authors": [
      "Heng Yu",
      "Zijing Dong",
      "Yamin Arefeen",
      "Congyu Liao",
      "Kawin Setsompop",
      "Berkin Bilgic"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.03498",
    "title": "Kinematics clustering enables head impact subtyping for better traumatic  brain injury prediction",
    "abstract": "Traumatic brain injury can be caused by various types of head impacts. However, due to different kinematic characteristics, many brain injury risk estimation models are not generalizable across the variety of impacts that humans may sustain. The current definitions of head impact subtypes are based on impact sources (e.g., football, traffic accident), which may not reflect the intrinsic kinematic similarities of impacts across the impact sources. To investigate the potential new definitions of impact subtypes based on kinematics, 3,161 head impacts from various sources including simulation, college football, mixed martial arts, and car racing were collected. We applied the K-means clustering to cluster the impacts on 16 standardized temporal features from head rotation kinematics. Then, we developed subtype-specific ridge regression models for cumulative strain damage (using the threshold of 15%), which significantly improved the estimation accuracy compared with the baseline method which mixed impacts from different sources and developed one model (R^2 from 0.7 to 0.9). To investigate the effect of kinematic features, we presented the top three critical features (maximum resultant angular acceleration, maximum angular acceleration along the z-axis, maximum linear acceleration along the y-axis) based on regression accuracy and used logistic regression to find the critical points for each feature that partitioned the subtypes. This study enables researchers to define head impact subtypes in a data-driven manner, which leads to more generalizable brain injury risk estimation. ",
    "url": "https://arxiv.org/abs/2108.03498",
    "authors": [
      "Xianghao Zhan",
      "Yiheng Li",
      "Yuzhe Liu",
      "Nicholas J. Cecchi",
      "Olivier Gevaert",
      "Michael M. Zeineh",
      "Gerald A. Grant",
      "David B. Camarillo"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)",
      "Tissues and Organs (q-bio.TO)"
    ]
  },
  {
    "id": "arXiv:1903.08543",
    "title": "Optimizing thermodynamic trajectories using evolutionary and  gradient-based reinforcement learning",
    "abstract": " Comments: 10 pages, 5 figures ",
    "url": "https://arxiv.org/abs/1903.08543",
    "authors": [
      "Chris Beeler",
      "Uladzimir Yahorau",
      "Rory Coles",
      "Kyle Mills",
      "Stephen Whitelam",
      "Isaac Tamblyn"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2002.03744",
    "title": "A joint precoding framework for wideband reconfigurable intelligent  surface-aided cell-free network",
    "abstract": " Comments: Published in IEEE TSP. This joint precoding framework considers the general case of multiple BSs, multiple RISs, multiple users, multiple antennas at both BSs and users, and multiple carriers, so it can be also used for other special cases in which some of these parameters are single. The simulation codes are provided at: this http URL ",
    "url": "https://arxiv.org/abs/2002.03744",
    "authors": [
      "Zijian Zhang",
      "Linglong Dai"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)",
      "Performance (cs.PF)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2003.11769",
    "title": "Nonconvex sparse regularization for deep neural networks and its  optimality",
    "abstract": " Title: Nonconvex sparse regularization for deep neural networks and its  optimality ",
    "url": "https://arxiv.org/abs/2003.11769",
    "authors": [
      "Ilsang Ohn",
      "Yongdai Kim"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2006.06336",
    "title": "Extracting and categorising the reactions to COVID-19 by the South  African public -- A social media study",
    "abstract": " Comments: 6 pages, Accepted and to be published in AFRICON 2021 ",
    "url": "https://arxiv.org/abs/2006.06336",
    "authors": [
      "Vukosi Marivate",
      "Avashlin Moodley",
      "Athandiwe Saba"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2008.01863",
    "title": "Minimum maximal matchings in cubic graphs",
    "abstract": " Comments: 16 pages, 3 figures. Revised based on referees' comments ",
    "url": "https://arxiv.org/abs/2008.01863",
    "authors": [
      "Wouter Cames van Batenburg"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2009.10907",
    "title": "Joint routing and pricing control in congested mixed autonomy networks",
    "abstract": " Title: Joint routing and pricing control in congested mixed autonomy networks ",
    "url": "https://arxiv.org/abs/2009.10907",
    "authors": [
      "Mohammadhadi Mansourianfar",
      "Ziyuan Gu",
      "S. Travis Waller",
      "Meead Saberi"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2011.14694",
    "title": "Anchored-STFT and GNAA: An extension of STFT in conjunction with an  adversarial data augmentation technique for the decoding of neural signals",
    "abstract": " Comments: 29 pages, 6 figures, 4 tables ",
    "url": "https://arxiv.org/abs/2011.14694",
    "authors": [
      "Omair Ali",
      "Muhammad Saif-ur-Rehman",
      "Susanne Dyck",
      "Tobias Glasmachers",
      "Ioannis Iossifidis",
      "Christian Klaes"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2012.00489",
    "title": "Deep Gravity: enhancing mobility flows generation with deep neural  networks and geographic information",
    "abstract": " Title: Deep Gravity: enhancing mobility flows generation with deep neural  networks and geographic information ",
    "url": "https://arxiv.org/abs/2012.00489",
    "authors": [
      "Filippo Simini",
      "Gianni Barlacchi",
      "Massimiliano Luca",
      "Luca Pappalardo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2102.13298",
    "title": "Many-Qudit representation for the Travelling Salesman Problem  Optimisation",
    "abstract": " Comments: 9 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2102.13298",
    "authors": [
      "Vladimir Vargas-Calderón",
      "Nicolas Parra-A.",
      "Herbert Vinck-Posada",
      "Fabio A. González"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Computational Complexity (cs.CC)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2106.13475",
    "title": "Limitations of machine learning for building energy prediction",
    "abstract": " Title: Limitations of machine learning for building energy prediction ",
    "url": "https://arxiv.org/abs/2106.13475",
    "authors": [
      "Clayton Miller",
      "Bianca Picchetti",
      "Chun Fu",
      "Jovan Pantelic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  }
]