[
  {
    "id": "arXiv:2305.02323",
    "title": "Correlation-Driven Multi-Level Multimodal Learning for Anomaly Detection  on Multiple Energy Sources",
    "abstract": "Advanced metering infrastructure (AMI) has been widely used as an intelligent energy consumption measurement system. Electric power was the representative energy source that can be collected by AMI; most existing studies to detect abnormal energy consumption have focused on a single energy source, i.e., power. Recently, other energy sources such as water, gas, and heating have also been actively collected. As a result, it is necessary to develop a unified methodology for anomaly detection across multiple energy sources; however, research efforts have rarely been made to tackle this issue. The inherent difficulty with this issue stems from the fact that anomalies are not usually annotated. Moreover, existing works of anomaly definition depend on only individual energy sources. In this paper, we first propose a method for defining anomalies considering not only individual energy sources but also correlations between them. Then, we propose a new Correlation-driven Multi-Level Multimodal Learning model for anomaly detection on multiple energy sources. The distinguishing property of the model incorporates multiple energy sources in multi-levels based on the strengths of the correlations between them. Furthermore, we generalize the proposed model in order to integrate arbitrary new energy sources with further performance improvement, considering not only correlated but also non-correlated sources. Through extensive experiments on real-world datasets consisting of three to five energy sources, we demonstrate that the proposed model clearly outperforms the existing multimodal learning and recent time-series anomaly detection models, and we observe that our model makes further the performance improvement as more correlated or non-correlated energy sources are integrated. ",
    "url": "https://arxiv.org/abs/2305.02323",
    "authors": [
      "Taehee Kim",
      "Hyuk-Yoon Kwon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.02324",
    "title": "Cross-Stream Contrastive Learning for Self-Supervised Skeleton-Based  Action Recognition",
    "abstract": "Self-supervised skeleton-based action recognition enjoys a rapid growth along with the development of contrastive learning. The existing methods rely on imposing invariance to augmentations of 3D skeleton within a single data stream, which merely leverages the easy positive pairs and limits the ability to explore the complicated movement patterns. In this paper, we advocate that the defect of single-stream contrast and the lack of necessary feature transformation are responsible for easy positives, and therefore propose a Cross-Stream Contrastive Learning framework for skeleton-based action Representation learning (CSCLR). Specifically, the proposed CSCLR not only utilizes intra-stream contrast pairs, but introduces inter-stream contrast pairs as hard samples to formulate a better representation learning. Besides, to further exploit the potential of positive pairs and increase the robustness of self-supervised representation learning, we propose a Positive Feature Transformation (PFT) strategy which adopts feature-level manipulation to increase the variance of positive pairs. To validate the effectiveness of our method, we conduct extensive experiments on three benchmark datasets NTU-RGB+D 60, NTU-RGB+D 120 and PKU-MMD. Experimental results show that our proposed CSCLR exceeds the state-of-the-art methods on a diverse range of evaluation protocols. ",
    "url": "https://arxiv.org/abs/2305.02324",
    "authors": [
      "Ding Li",
      "Yongqiang Tang",
      "Zhizhong Zhang",
      "Wensheng Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02368",
    "title": "Metric Tools for Sensitivity Analysis with Applications to Neural  Networks",
    "abstract": "As Machine Learning models are considered for autonomous decisions with significant social impact, the need for understanding how these models work rises rapidly. Explainable Artificial Intelligence (XAI) aims to provide interpretations for predictions made by Machine Learning models, in order to make the model trustworthy and more transparent for the user. For example, selecting relevant input variables for the problem directly impacts the model's ability to learn and make accurate predictions, so obtaining information about input importance play a crucial role when training the model. One of the main XAI techniques to obtain input variable importance is the sensitivity analysis based on partial derivatives. However, existing literature of this method provide no justification of the aggregation metrics used to retrieved information from the partial derivatives. In this paper, a theoretical framework is proposed to study sensitivities of ML models using metric techniques. From this metric interpretation, a complete family of new quantitative metrics called $\\alpha$-curves is extracted. These $\\alpha$-curves provide information with greater depth on the importance of the input variables for a machine learning model than existing XAI methods in the literature. We demonstrate the effectiveness of the $\\alpha$-curves using synthetic and real datasets, comparing the results against other XAI methods for variable importance and validating the analysis results with the ground truth or literature information. ",
    "url": "https://arxiv.org/abs/2305.02368",
    "authors": [
      "Jaime Pizarroso",
      "David Alfaya",
      "José Portela",
      "Antonio Muñoz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02371",
    "title": "Spectral cyclicality of networks",
    "abstract": "We introduce the spectral influence and spectral cyclicality based on the largest eigenvalue of a graph adjacency matrix, two novel concepts of centrality capturing diffusion and interdependence from a local and a global point of view respectively. We define a new clustering algorithm to distinguish communities with high cyclicality and interdependence, allowing overlapping, and we conclude our study with an application to the input-output analysis in the case of the Moroccan economy. ",
    "url": "https://arxiv.org/abs/2305.02371",
    "authors": [
      "Nizar Riane"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2305.02374",
    "title": "A Novel Plagiarism Detection Approach Combining BERT-based Word  Embedding, Attention-based LSTMs and an Improved Differential Evolution  Algorithm",
    "abstract": "Detecting plagiarism involves finding similar items in two different sources. In this article, we propose a novel method for detecting plagiarism that is based on attention mechanism-based long short-term memory (LSTM) and bidirectional encoder representations from transformers (BERT) word embedding, enhanced with optimized differential evolution (DE) method for pre-training and a focal loss function for training. BERT could be included in a downstream task and fine-tuned as a task-specific BERT can be included in a downstream task and fine-tuned as a task-specific structure, while the trained BERT model is capable of detecting various linguistic characteristics. Unbalanced classification is one of the primary issues with plagiarism detection. We suggest a focal loss-based training technique that carefully learns minority class instances to solve this. Another issue that we tackle is the training phase itself, which typically employs gradient-based methods like back-propagation for the learning process and thus suffers from some drawbacks, including sensitivity to initialization. To initiate the BP process, we suggest a novel DE algorithm that makes use of a clustering-based mutation operator. Here, a winning cluster is identified for the current DE population, and a fresh updating method is used to produce potential answers. We evaluate our proposed approach on three benchmark datasets ( MSRP, SNLI, and SemEval2014) and demonstrate that it performs well when compared to both conventional and population-based methods. ",
    "url": "https://arxiv.org/abs/2305.02374",
    "authors": [
      "Seyed Vahid Moravvej",
      "Seyed Jalaleddin Mousavirad",
      "Diego Oliva",
      "Fardin Mohammadi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2305.02377",
    "title": "Privacy in Population Protocols with Probabilistic Scheduling",
    "abstract": "The population protocol model introduced by Angluin et al. in 2006 offers a theoretical framework for designing and analyzing distributed algorithms among limited-resource mobile agents. While the original population protocol model considers the concept of anonymity, the issue of privacy is not investigated thoroughly. However, there is a need for time- and space-efficient privacy-preserving techniques in the population protocol model if these algorithms are to be implemented in settings handling sensitive data, such as sensor networks, IoT devices, and drones. In this work, we introduce several formal definitions of privacy, ranging from assuring only plausible deniability of the population input vector to having a full information-theoretic guarantee that knowledge beyond an agent's input and output bear no influence on the probability of a particular input vector. We then apply these definitions to both existing and novel protocols. We show that the Remainder-computing protocol given by Delporte-Gallet et al. in 2007 (which is proven to satisfy output independent privacy under adversarial scheduling) is not information-theoretically private under probabilistic scheduling. In contrast, we provide a new algorithm and demonstrate that it correctly and information-theoretically privately computes Remainder under probabilistic scheduling. ",
    "url": "https://arxiv.org/abs/2305.02377",
    "authors": [
      "Talley Amir",
      "James Aspnes"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2305.02381",
    "title": "Discovering Communication Pattern Shifts in Large-Scale Networks using  Encoder Embedding and Vertex Dynamics",
    "abstract": "The analysis of large-scale time-series network data, such as social media and email communications, remains a significant challenge for graph analysis methodology. In particular, the scalability of graph analysis is a critical issue hindering further progress in large-scale downstream inference. In this paper, we introduce a novel approach called \"temporal encoder embedding\" that can efficiently embed large amounts of graph data with linear complexity. We apply this method to an anonymized time-series communication network from a large organization spanning 2019-2020, consisting of over 100 thousand vertices and 80 million edges. Our method embeds the data within 10 seconds on a standard computer and enables the detection of communication pattern shifts for individual vertices, vertex communities, and the overall graph structure. Through supporting theory and synthesis studies, we demonstrate the theoretical soundness of our approach under random graph models and its numerical effectiveness through simulation studies. ",
    "url": "https://arxiv.org/abs/2305.02381",
    "authors": [
      "Cencheng Shen",
      "Jonathan Larson",
      "Ha Trinh",
      "Xihan Qin",
      "Youngser Park",
      "Carey E. Priebe"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.02383",
    "title": "On the Security Risks of Knowledge Graph Reasoning",
    "abstract": "Knowledge graph reasoning (KGR) -- answering complex logical queries over large knowledge graphs -- represents an important artificial intelligence task, entailing a range of applications (e.g., cyber threat hunting). However, despite its surging popularity, the potential security risks of KGR are largely unexplored, which is concerning, given the increasing use of such capability in security-critical domains. This work represents a solid initial step towards bridging the striking gap. We systematize the security threats to KGR according to the adversary's objectives, knowledge, and attack vectors. Further, we present ROAR, a new class of attacks that instantiate a variety of such threats. Through empirical evaluation in representative use cases (e.g., medical decision support, cyber threat hunting, and commonsense reasoning), we demonstrate that ROAR is highly effective to mislead KGR to suggest pre-defined answers for target queries, yet with negligible impact on non-target ones. Finally, we explore potential countermeasures against ROAR, including filtering of potentially poisoning knowledge and training with adversarially augmented queries, which leads to several promising research directions. ",
    "url": "https://arxiv.org/abs/2305.02383",
    "authors": [
      "Zhaohan Xi",
      "Tianyu Du",
      "Changjiang Li",
      "Ren Pang",
      "Shouling Ji",
      "Xiapu Luo",
      "Xusheng Xiao",
      "Fenglong Ma",
      "Ting Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02394",
    "title": "Defending against Insertion-based Textual Backdoor Attacks via  Attribution",
    "abstract": "Textual backdoor attack, as a novel attack model, has been shown to be effective in adding a backdoor to the model during training. Defending against such backdoor attacks has become urgent and important. In this paper, we propose AttDef, an efficient attribution-based pipeline to defend against two insertion-based poisoning attacks, BadNL and InSent. Specifically, we regard the tokens with larger attribution scores as potential triggers since larger attribution words contribute more to the false prediction results and therefore are more likely to be poison triggers. Additionally, we further utilize an external pre-trained language model to distinguish whether input is poisoned or not. We show that our proposed method can generalize sufficiently well in two common attack scenarios (poisoning training data and testing data), which consistently improves previous methods. For instance, AttDef can successfully mitigate both attacks with an average accuracy of 79.97% (56.59% up) and 48.34% (3.99% up) under pre-training and post-training attack defense respectively, achieving the new state-of-the-art performance on prediction recovery over four benchmark datasets. ",
    "url": "https://arxiv.org/abs/2305.02394",
    "authors": [
      "Jiazhao Li",
      "Zhuofeng Wu",
      "Wei Ping",
      "Chaowei Xiao",
      "V.G. Vinod Vydiswaran"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02424",
    "title": "Backdoor Learning on Sequence to Sequence Models",
    "abstract": "Backdoor learning has become an emerging research area towards building a trustworthy machine learning system. While a lot of works have studied the hidden danger of backdoor attacks in image or text classification, there is a limited understanding of the model's robustness on backdoor attacks when the output space is infinite and discrete. In this paper, we study a much more challenging problem of testing whether sequence-to-sequence (seq2seq) models are vulnerable to backdoor attacks. Specifically, we find by only injecting 0.2\\% samples of the dataset, we can cause the seq2seq model to generate the designated keyword and even the whole sentence. Furthermore, we utilize Byte Pair Encoding (BPE) to create multiple new triggers, which brings new challenges to backdoor detection since these backdoors are not static. Extensive experiments on machine translation and text summarization have been conducted to show our proposed methods could achieve over 90\\% attack success rate on multiple datasets and models. ",
    "url": "https://arxiv.org/abs/2305.02424",
    "authors": [
      "Lichang Chen",
      "Minhao Cheng",
      "Heng Huang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.02442",
    "title": "Tackling Universal Properties of Minimal Trap Spaces of Boolean Networks",
    "abstract": "Minimal trap spaces (MTSs) capture subspaces in which the Boolean dynamics is trapped, whatever the update mode. They correspond to the attractors of the most permissive mode. Due to their versatility, the computation of MTSs has recently gained traction, essentially by focusing on their enumeration. In this paper, we address the logical reasoning on universal properties of MTSs in the scope of two problems: the reprogramming of Boolean networks for identifying the permanent freeze of Boolean variables that enforce a given property on all the MTSs, and the synthesis of Boolean networks from universal properties on their MTSs. Both problems reduce to solving the satisfiability of quantified propositional logic formula with 3 levels of quantifiers ($\\exists\\forall\\exists$). In this paper, we introduce a Counter-Example Guided Refinement Abstraction (CEGAR) to efficiently solve these problems by coupling the resolution of two simpler formulas. We provide a prototype relying on Answer-Set Programming for each formula and show its tractability on a wide range of Boolean models of biological networks. ",
    "url": "https://arxiv.org/abs/2305.02442",
    "authors": [
      "Sara Riva",
      "Jean-Marie Lagniez",
      "Gustavo Magaña López",
      "Loïc Paulevé"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Artificial Intelligence (cs.AI)",
      "Discrete Mathematics (cs.DM)",
      "Systems and Control (eess.SY)",
      "Molecular Networks (q-bio.MN)"
    ]
  },
  {
    "id": "arXiv:2305.02471",
    "title": "Toward the Automated Construction of Probabilistic Knowledge Graphs for  the Maritime Domain",
    "abstract": "International maritime crime is becoming increasingly sophisticated, often associated with wider criminal networks. Detecting maritime threats by means of fusing data purely related to physical movement (i.e., those generated by physical sensors, or hard data) is not sufficient. This has led to research and development efforts aimed at combining hard data with other types of data (especially human-generated or soft data). Existing work often assumes that input soft data is available in a structured format, or is focused on extracting certain relevant entities or concepts to accompany or annotate hard data. Much less attention has been given to extracting the rich knowledge about the situations of interest implicitly embedded in the large amount of soft data existing in unstructured formats (such as intelligence reports and news articles). In order to exploit the potentially useful and rich information from such sources, it is necessary to extract not only the relevant entities and concepts but also their semantic relations, together with the uncertainty associated with the extracted knowledge (i.e., in the form of probabilistic knowledge graphs). This will increase the accuracy of and confidence in, the extracted knowledge and facilitate subsequent reasoning and learning. To this end, we propose Maritime DeepDive, an initial prototype for the automated construction of probabilistic knowledge graphs from natural language data for the maritime domain. In this paper, we report on the current implementation of Maritime DeepDive, together with preliminary results on extracting probabilistic events from maritime piracy incidents. This pipeline was evaluated on a manually crafted gold standard, yielding promising results. ",
    "url": "https://arxiv.org/abs/2305.02471",
    "authors": [
      "Fatemeh Shiri",
      "Teresa Wang",
      "Shirui Pan",
      "Xiaojun Chang",
      "Yuan-Fang Li",
      "Reza Haffari",
      "Van Nguyen",
      "Shuang Yu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.02484",
    "title": "A Deterministic Construction of a Large Distance Code from the  Wozencraft Ensemble",
    "abstract": "We present an explicit construction of a sequence of rate $1/2$ Wozencraft ensemble codes (over any fixed finite field $\\mathbb{F}_q$) that achieve minimum distance $\\Omega(\\sqrt{k})$ where $k$ is the message length. The coefficients of the Wozencraft ensemble codes are constructed using Sidon Sets and the cyclic structure of $\\mathbb{F}_{q^{k}}$ where $k+1$ is prime with $q$ a primitive root modulo $k+1$. Assuming Artin's conjecture, there are infinitely many such $k$ for any prime power $q$. ",
    "url": "https://arxiv.org/abs/2305.02484",
    "authors": [
      "Venkatesan Guruswami",
      "Shilun Li"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2305.02496",
    "title": "Revisiting Graph Contrastive Learning for Anomaly Detection",
    "abstract": "Combining Graph neural networks (GNNs) with contrastive learning for anomaly detection has drawn rising attention recently. Existing graph contrastive anomaly detection (GCAD) methods have primarily focused on improving detection capability through graph augmentation and multi-scale contrast modules. However, the underlying mechanisms of how these modules work have not been fully explored. We dive into the multi-scale and graph augmentation mechanism and observed that multi-scale contrast modules do not enhance the expression, while the multi-GNN modules are the hidden contributors. Previous studies have tended to attribute the benefits brought by multi-GNN to the multi-scale modules. In the paper, we delve into the misconception and propose Multi-GNN and Augmented Graph contrastive framework MAG, which unified the existing GCAD methods in the contrastive self-supervised perspective. We extracted two variants from the MAG framework, L-MAG and M-MAG. The L-MAG is the lightweight instance of the MAG, which outperform the state-of-the-art on Cora and Pubmed with the low computational cost. The variant M-MAG equipped with multi-GNN modules further improve the detection performance. Our study sheds light on the drawback of the existing GCAD methods and demonstrates the potential of multi-GNN and graph augmentation modules. Our code is available at https://github.com/liuyishoua/MAG-Framework. ",
    "url": "https://arxiv.org/abs/2305.02496",
    "authors": [
      "Zhiyuan Liu",
      "Chunjie Cao",
      "Fangjian Tao",
      "Jingzhang Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02503",
    "title": "A Cross-direction Task Decoupling Network for Small Logo Detection",
    "abstract": "Logo detection plays an integral role in many applications. However, handling small logos is still difficult since they occupy too few pixels in the image, which burdens the extraction of discriminative features. The aggregation of small logos also brings a great challenge to the classification and localization of logos. To solve these problems, we creatively propose Cross-direction Task Decoupling Network (CTDNet) for small logo detection. We first introduce Cross-direction Feature Pyramid (CFP) to realize cross-direction feature fusion by adopting horizontal transmission and vertical transmission. In addition, Multi-frequency Task Decoupling Head (MTDH) decouples the classification and localization tasks into two branches. A multi frequency attention convolution branch is designed to achieve more accurate regression by combining discrete cosine transform and convolution creatively. Comprehensive experiments on four logo datasets demonstrate the effectiveness and efficiency of the proposed method. ",
    "url": "https://arxiv.org/abs/2305.02503",
    "authors": [
      "Sujuan",
      "Xingzhuo",
      "Weiqing",
      "Jiacheng",
      "Wang",
      "Jing",
      "Zheng",
      "Yuanjie",
      "Jiang",
      "Shuqiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02504",
    "title": "Learning Missing Modal Electronic Health Records with Unified  Multi-modal Data Embedding and Modality-Aware Attention",
    "abstract": "Electronic Health Record (EHR) provides abundant information through various modalities. However, learning multi-modal EHR is currently facing two major challenges, namely, 1) data embedding and 2) cases with missing modality. A lack of shared embedding function across modalities can discard the temporal relationship between different EHR modalities. On the other hand, most EHR studies are limited to relying only on EHR Times-series, and therefore, missing modality in EHR has not been well-explored. Therefore, in this study, we introduce a Unified Multi-modal Set Embedding (UMSE) and Modality-Aware Attention (MAA) with Skip Bottleneck (SB). UMSE treats all EHR modalities without a separate imputation module or error-prone carry-forward, whereas MAA with SB learns missing modal EHR with effective modality-aware attention. Our model outperforms other baseline models in mortality, vasopressor need, and intubation need prediction with the MIMIC-IV dataset. ",
    "url": "https://arxiv.org/abs/2305.02504",
    "authors": [
      "Kwanhyung Lee",
      "Soojeong Lee",
      "Sangchul Hahn",
      "Heejung Hyun",
      "Edward Choi",
      "Byungeun Ahn",
      "Joohyung Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02507",
    "title": "Stimulative Training++: Go Beyond The Performance Limits of Residual  Networks",
    "abstract": "Residual networks have shown great success and become indispensable in recent deep neural network models. In this work, we aim to re-investigate the training process of residual networks from a novel social psychology perspective of loafing, and further propose a new training scheme as well as three improved strategies for boosting residual networks beyond their performance limits. Previous research has suggested that residual networks can be considered as ensembles of shallow networks, which implies that the final performance of a residual network is influenced by a group of subnetworks. We identify a previously overlooked problem that is analogous to social loafing, where subnetworks within a residual network are prone to exert less effort when working as part of a group compared to working alone. We define this problem as \\textit{network loafing}. Similar to the decreased individual productivity and overall performance as demonstrated in society, network loafing inevitably causes sub-par performance. Inspired by solutions from social psychology, we first propose a novel training scheme called stimulative training, which randomly samples a residual subnetwork and calculates the KL divergence loss between the sampled subnetwork and the given residual network for extra supervision. In order to unleash the potential of stimulative training, we further propose three simple-yet-effective strategies, including a novel KL- loss that only aligns the network logits direction, random smaller inputs for subnetworks, and inter-stage sampling rules. Comprehensive experiments and analysis verify the effectiveness of stimulative training as well as its three improved strategies. ",
    "url": "https://arxiv.org/abs/2305.02507",
    "authors": [
      "Peng Ye",
      "Tong He",
      "Shengji Tang",
      "Baopu Li",
      "Tao Chen",
      "Lei Bai",
      "Wanli Ouyang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02511",
    "title": "Directional Antenna Based Scheduling Protocol for IoT Networks",
    "abstract": "Scheduling and Channel Access at the MAC layer of the IoT network plays a pivotal role in enhancing the performance of IoT networks. State-of-the-art Omni-directional antenna based application data transmission has relatively less achievable throughput in comparison with directional antenna based scheduling protocols. To enhance the performance of the IoT networks, this paper propose a distributed one-hop scheduling algorithm called Directional Scheduling protocol for constrained deterministic 6TiSCH-IoT network. With this, in-creased number of IoT nodes can have concurrent application data transmission with efficient spatial reuse. This in-turn results in higher number of cell allocation to the one-hop IoT nodes during data transmission. The proposed algorithm makes use of through directional transmissions avoids head of line blocking. ",
    "url": "https://arxiv.org/abs/2305.02511",
    "authors": [
      "Anil Carie",
      "Abdur Rashid Sangi",
      "Satish Anamalamudi",
      "Murali Krishna Enduri",
      "Baha Ihnaini",
      "Hemn Barzan Abdalla",
      "Mohammed Saeed Alkatheiri"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2305.02517",
    "title": "USTC-NELSLIP at SemEval-2023 Task 2: Statistical Construction and Dual  Adaptation of Gazetteer for Multilingual Complex NER",
    "abstract": "This paper describes the system developed by the USTC-NELSLIP team for SemEval-2023 Task 2 Multilingual Complex Named Entity Recognition (MultiCoNER II). A method named Statistical Construction and Dual Adaptation of Gazetteer (SCDAG) is proposed for Multilingual Complex NER. The method first utilizes a statistics-based approach to construct a gazetteer. Secondly, the representations of gazetteer networks and language models are adapted by minimizing the KL divergence between them at both the sentence-level and entity-level. Finally, these two networks are then integrated for supervised named entity recognition (NER) training. The proposed method is applied to XLM-R with a gazetteer built from Wikidata, and shows great generalization ability across different tracks. Experimental results and detailed analysis verify the effectiveness of the proposed method. The official results show that our system ranked 1st on one track (Hindi) in this task. ",
    "url": "https://arxiv.org/abs/2305.02517",
    "authors": [
      "Jun-Yu Ma",
      "Jia-Chen Gu",
      "Jiajun Qi",
      "Zhen-Hua Ling",
      "Quan Liu",
      "Xiaoyi Zhao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.02518",
    "title": "Simultaneously Calibration of Multi Hand-Eye Robot System Based on Graph",
    "abstract": "Precise calibration is the basis for the vision-guided robot system to achieve high-precision operations. Systems with multiple eyes (cameras) and multiple hands (robots) are particularly sensitive to calibration errors, such as micro-assembly systems. Most existing methods focus on the calibration of a single unit of the whole system, such as poses between hand and eye, or between two hands. These methods can be used to determine the relative pose between each unit, but the serialized incremental calibration strategy cannot avoid the problem of error accumulation in a large-scale system. Instead of focusing on a single unit, this paper models the multi-eye and multi-hand system calibration problem as a graph and proposes a method based on the minimum spanning tree and graph optimization. This method can automatically plan the serialized optimal calibration strategy in accordance with the system settings to get coarse calibration results initially. Then, with these initial values, the closed-loop constraints are introduced to carry out global optimization. Simulation experiments demonstrate the performance of the proposed algorithm under different noises and various hand-eye configurations. In addition, experiments on real robot systems are presented to further verify the proposed method. ",
    "url": "https://arxiv.org/abs/2305.02518",
    "authors": [
      "Zishun Zhou",
      "Liping Ma",
      "Xilong Liu",
      "Zhiqiang Cao",
      "Junzhi Yu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.02522",
    "title": "BitGNN: Unleashing the Performance Potential of Binary Graph Neural  Networks on GPUs",
    "abstract": "Recent studies have shown that Binary Graph Neural Networks (GNNs) are promising for saving computations of GNNs through binarized tensors. Prior work, however, mainly focused on algorithm designs or training techniques, leaving it open to how to materialize the performance potential on accelerator hardware fully. This work redesigns the binary GNN inference backend from the efficiency perspective. It fills the gap by proposing a series of abstractions and techniques to map binary GNNs and their computations best to fit the nature of bit manipulations on GPUs. Results on real-world graphs with GCNs, GraphSAGE, and GraphSAINT show that the proposed techniques outperform state-of-the-art binary GNN implementations by 8-22X with the same accuracy maintained. BitGNN code is publicly available. ",
    "url": "https://arxiv.org/abs/2305.02522",
    "authors": [
      "Jou-An Chen",
      "Hsin-Hsuan Sung",
      "Xipeng Shen",
      "Sutanay Choudhury",
      "Ang Li"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02528",
    "title": "Self-Supervised 3D Scene Flow Estimation Guided by Superpoints",
    "abstract": "3D scene flow estimation aims to estimate point-wise motions between two consecutive frames of point clouds. Superpoints, i.e., points with similar geometric features, are usually employed to capture similar motions of local regions in 3D scenes for scene flow estimation. However, in existing methods, superpoints are generated with the offline clustering methods, which cannot characterize local regions with similar motions for complex 3D scenes well, leading to inaccurate scene flow estimation. To this end, we propose an iterative end-to-end superpoint based scene flow estimation framework, where the superpoints can be dynamically updated to guide the point-level flow prediction. Specifically, our framework consists of a flow guided superpoint generation module and a superpoint guided flow refinement module. In our superpoint generation module, we utilize the bidirectional flow information at the previous iteration to obtain the matching points of points and superpoint centers for soft point-to-superpoint association construction, in which the superpoints are generated for pairwise point clouds. With the generated superpoints, we first reconstruct the flow for each point by adaptively aggregating the superpoint-level flow, and then encode the consistency between the reconstructed flow of pairwise point clouds. Finally, we feed the consistency encoding along with the reconstructed flow into GRU to refine point-level flow. Extensive experiments on several different datasets show that our method can achieve promising performance. ",
    "url": "https://arxiv.org/abs/2305.02528",
    "authors": [
      "Yaqi Shen",
      "Le Hui",
      "Jin Xie",
      "Jian Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02536",
    "title": "Scanpath Prediction in Panoramic Videos via Expected Code Length  Minimization",
    "abstract": "Predicting human scanpaths when exploring panoramic videos is a challenging task due to the spherical geometry and the multimodality of the input, and the inherent uncertainty and diversity of the output. Most previous methods fail to give a complete treatment of these characteristics, and thus are prone to errors. In this paper, we present a simple new criterion for scanpath prediction based on principles from lossy data compression. This criterion suggests minimizing the expected code length of quantized scanpaths in a training set, which corresponds to fitting a discrete conditional probability model via maximum likelihood. Specifically, the probability model is conditioned on two modalities: a viewport sequence as the deformation-reduced visual input and a set of relative historical scanpaths projected onto respective viewports as the aligned path input. The probability model is parameterized by a product of discretized Gaussian mixture models to capture the uncertainty and the diversity of scanpaths from different users. Most importantly, the training of the probability model does not rely on the specification of ``ground-truth'' scanpaths for imitation learning. We also introduce a proportional-integral-derivative (PID) controller-based sampler to generate realistic human-like scanpaths from the learned probability model. Experimental results demonstrate that our method consistently produces better quantitative scanpath results in terms of prediction accuracy (by comparing to the assumed ``ground-truths'') and perceptual realism (through machine discrimination) over a wide range of prediction horizons. We additionally verify the perceptual realism improvement via a formal psychophysical experiment and the generalization improvement on several unseen panoramic video datasets. ",
    "url": "https://arxiv.org/abs/2305.02536",
    "authors": [
      "Mu Li",
      "Kanglong Fan",
      "Kede Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02549",
    "title": "FormNetV2: Multimodal Graph Contrastive Learning for Form Document  Information Extraction",
    "abstract": "The recent advent of self-supervised pre-training techniques has led to a surge in the use of multimodal learning in form document understanding. However, existing approaches that extend the mask language modeling to other modalities require careful multi-task tuning, complex reconstruction target designs, or additional pre-training data. In FormNetV2, we introduce a centralized multimodal graph contrastive learning strategy to unify self-supervised pre-training for all modalities in one loss. The graph contrastive objective maximizes the agreement of multimodal representations, providing a natural interplay for all modalities without special customization. In addition, we extract image features within the bounding box that joins a pair of tokens connected by a graph edge, capturing more targeted visual cues without loading a sophisticated and separately pre-trained image embedder. FormNetV2 establishes new state-of-the-art performance on FUNSD, CORD, SROIE and Payment benchmarks with a more compact model size. ",
    "url": "https://arxiv.org/abs/2305.02549",
    "authors": [
      "Chen-Yu Lee",
      "Chun-Liang Li",
      "Hao Zhang",
      "Timothy Dozat",
      "Vincent Perot",
      "Guolong Su",
      "Xiang Zhang",
      "Kihyuk Sohn",
      "Nikolai Glushnev",
      "Renshen Wang",
      "Joshua Ainslie",
      "Shangbang Long",
      "Siyang Qin",
      "Yasuhisa Fujii",
      "Nan Hua",
      "Tomas Pfister"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02559",
    "title": "Madvex: Instrumentation-based Adversarial Attacks on Machine Learning  Malware Detection",
    "abstract": "WebAssembly (Wasm) is a low-level binary format for web applications, which has found widespread adoption due to its improved performance and compatibility with existing software. However, the popularity of Wasm has also led to its exploitation for malicious purposes, such as cryptojacking, where malicious actors use a victim's computing resources to mine cryptocurrencies without their consent. To counteract this threat, machine learning-based detection methods aiming to identify cryptojacking activities within Wasm code have emerged. It is well-known that neural networks are susceptible to adversarial attacks, where inputs to a classifier are perturbed with minimal changes that result in a crass misclassification. While applying changes in image classification is easy, manipulating binaries in an automated fashion to evade malware classification without changing functionality is non-trivial. In this work, we propose a new approach to include adversarial examples in the code section of binaries via instrumentation. The introduced gadgets allow for the inclusion of arbitrary bytes, enabling efficient adversarial attacks that reliably bypass state-of-the-art machine learning classifiers such as the CNN-based Minos recently proposed at NDSS 2021. We analyze the cost and reliability of instrumentation-based adversarial example generation and show that the approach works reliably at minimal size and performance overheads. ",
    "url": "https://arxiv.org/abs/2305.02559",
    "authors": [
      "Nils Loose",
      "Felix Mächtle",
      "Claudius Pott",
      "Volodymyr Bezsmertnyi",
      "Thomas Eisenbarth"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.02577",
    "title": "Text Reading Order in Uncontrolled Conditions by Sparse Graph  Segmentation",
    "abstract": "Text reading order is a crucial aspect in the output of an OCR engine, with a large impact on downstream tasks. Its difficulty lies in the large variation of domain specific layout structures, and is further exacerbated by real-world image degradations such as perspective distortions. We propose a lightweight, scalable and generalizable approach to identify text reading order with a multi-modal, multi-task graph convolutional network (GCN) running on a sparse layout based graph. Predictions from the model provide hints of bidimensional relations among text lines and layout region structures, upon which a post-processing cluster-and-sort algorithm generates an ordered sequence of all the text lines. The model is language-agnostic and runs effectively across multi-language datasets that contain various types of images taken in uncontrolled conditions, and it is small enough to be deployed on virtually any platform including mobile devices. ",
    "url": "https://arxiv.org/abs/2305.02577",
    "authors": [
      "Renshen Wang",
      "Yasuhisa Fujii",
      "Alessandro Bissacco"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02584",
    "title": "Enhancing IoT Security and Privacy with Trusted Execution Environments  and Machine Learning",
    "abstract": "With the increasing popularity of Internet of Things (IoT) devices, security concerns have become a major challenge: confidential information is constantly being transmitted (sometimes inadvertently) from user devices to untrusted cloud services. This work proposes a design to enhance security and privacy in IoT based systems by isolating hardware peripheral drivers in a trusted execution environment (TEE), and leveraging secure machine learning classification techniques to filter out sensitive data, e.g., speech, images, etc. from the associated peripheral devices before it makes its way to an untrusted party in the cloud. ",
    "url": "https://arxiv.org/abs/2305.02584",
    "authors": [
      "Peterson Yuhala"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.02596",
    "title": "A Soft Coordination Method of Heterogeneous Devices in Distribution  System Voltage Control",
    "abstract": "With the continuous increase of photovoltaic (PV) penetration, the voltage control interactions between newly installed PV inverters and previously deployed on-load tap-changer (OLTC) transformers become ever more significant. To achieve coordinated voltage regulation, current methods often rely on a decision-making algorithm to fully take over the control of all devices, requiring OLTC to give up its existing tap switching logic and execute corresponding upgrades. Aiming at bridging this gap, a soft coordination framework is proposed in this paper. Specifically, the decision-making commands are only applied on inverters, and OLTC that retains its own operation rule will be indirectly controlled by the changed system voltage, which is a result of appropriately adjusting inverters' Var output. The proposed method achieves the soft coordination by establishing a modified actor-critic algorithm to train a proxy model of inverters. The well-trained proxy model can properly adjust inverters' Var output to \"softly\" coordinate OLTC's tap operations, which finally attains coordinated voltage regulation and line loss minimization. Simulation results verify the superiority of our proposed method over traditional ones in coordinating heterogeneous devices for voltage control. ",
    "url": "https://arxiv.org/abs/2305.02596",
    "authors": [
      "Licheng Wang",
      "Tao Wang",
      "Gang Huang",
      "Ruifeng Yan",
      "Kai Wang",
      "Youbing Zhang",
      "Shijie Cheng"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.02605",
    "title": "IMAP: Intrinsically Motivated Adversarial Policy",
    "abstract": "Reinforcement learning (RL) agents are known to be vulnerable to evasion attacks during deployment. In single-agent environments, attackers can inject imperceptible perturbations on the policy or value network's inputs or outputs; in multi-agent environments, attackers can control an adversarial opponent to indirectly influence the victim's observation. Adversarial policies offer a promising solution to craft such attacks. Still, current approaches either require perfect or partial knowledge of the victim policy or suffer from sample inefficiency due to the sparsity of task-related rewards. To overcome these limitations, we propose the Intrinsically Motivated Adversarial Policy (IMAP) for efficient black-box evasion attacks in single- and multi-agent environments without any knowledge of the victim policy. IMAP uses four intrinsic objectives based on state coverage, policy coverage, risk, and policy divergence to encourage exploration and discover stronger attacking skills. We also design a novel Bias-Reduction (BR) method to boost IMAP further. Our experiments demonstrate the effectiveness of these intrinsic objectives and BR in improving adversarial policy learning in the black-box setting against multiple types of victim agents in various single- and multi-agent MuJoCo environments. Notably, our IMAP reduces the performance of the state-of-the-art robust WocaR-PPO agents by 34\\%-54\\% and achieves a SOTA attacking success rate of 83.91\\% in the two-player zero-sum game YouShallNotPass. ",
    "url": "https://arxiv.org/abs/2305.02605",
    "authors": [
      "Xiang Zheng",
      "Xingjun Ma",
      "Shengjie Wang",
      "Xinyu Wang",
      "Chao Shen",
      "Cong Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02610",
    "title": "Boundary-aware Backward-Compatible Representation via Adversarial  Learning in Image Retrieval",
    "abstract": "Image retrieval plays an important role in the Internet world. Usually, the core parts of mainstream visual retrieval systems include an online service of the embedding model and a large-scale vector database. For traditional model upgrades, the old model will not be replaced by the new one until the embeddings of all the images in the database are re-computed by the new model, which takes days or weeks for a large amount of data. Recently, backward-compatible training (BCT) enables the new model to be immediately deployed online by making the new embeddings directly comparable to the old ones. For BCT, improving the compatibility of two models with less negative impact on retrieval performance is the key challenge. In this paper, we introduce AdvBCT, an Adversarial Backward-Compatible Training method with an elastic boundary constraint that takes both compatibility and discrimination into consideration. We first employ adversarial learning to minimize the distribution disparity between embeddings of the new model and the old model. Meanwhile, we add an elastic boundary constraint during training to improve compatibility and discrimination efficiently. Extensive experiments on GLDv2, Revisited Oxford (ROxford), and Revisited Paris (RParis) demonstrate that our method outperforms other BCT methods on both compatibility and discrimination. The implementation of AdvBCT will be publicly available at https://github.com/Ashespt/AdvBCT. ",
    "url": "https://arxiv.org/abs/2305.02610",
    "authors": [
      "Tan Pan",
      "Furong Xu",
      "Xudong Yang",
      "Sifeng He",
      "Chen Jiang",
      "Qingpei Guo",
      "Feng Qian Xiaobo Zhang",
      "Yuan Cheng",
      "Lei Yang",
      "Wei Chu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02615",
    "title": "Affective Reasoning at Utterance Level in Conversations: A Causal  Discovery Approach",
    "abstract": "The affective reasoning task is a set of emerging affect-based tasks in conversation, including Emotion Recognition in Conversation (ERC),Emotion-Cause Pair Extraction (ECPE), and Emotion-Cause Span Recognition (ECSR). Existing methods make various assumptions on the apparent relationship while neglecting the essential causal model due to the nonuniqueness of skeletons and unobservability of implicit causes. This paper settled down the above two problems and further proposed Conversational Affective Causal Discovery (CACD). It is a novel causal discovery method showing how to discover causal relationships in a conversation via designing a common skeleton and generating a substitute for implicit causes. CACD contains two steps: (i) building a common centering one graph node causal skeleton for all utterances in variable-length conversations; (ii) Causal Auto-Encoder (CAE) correcting the skeleton to yield causal representation through generated implicit causes and known explicit causes. Comprehensive experiments demonstrate that our novel method significantly outperforms the SOTA baselines in six affect-related datasets on the three tasks. ",
    "url": "https://arxiv.org/abs/2305.02615",
    "authors": [
      "Hang Chen",
      "Jing Luo",
      "Xinyu Yang",
      "Wenjing Zhu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02632",
    "title": "A framework for the emergence and analysis of language in social  learning agents",
    "abstract": "Artificial neural networks (ANNs) are increasingly used as research models, but questions remain about their generalizability and representational invariance. Biological neural networks under social constraints evolved to enable communicable representations, demonstrating generalization capabilities. This study proposes a communication protocol between cooperative agents to analyze the formation of individual and shared abstractions and their impact on task performance. This communication protocol aims to mimic language features by encoding high-dimensional information through low-dimensional representation. Using grid-world mazes and reinforcement learning, teacher ANNs pass a compressed message to a student ANN for better task completion. Through this, the student achieves a higher goal-finding rate and generalizes the goal location across task worlds. Further optimizing message content to maximize student reward improves information encoding, suggesting that an accurate representation in the space of messages requires bi-directional input. This highlights the role of language as a common representation between agents and its implications on generalization capabilities. ",
    "url": "https://arxiv.org/abs/2305.02632",
    "authors": [
      "Tobias J. Wieczorek",
      "Tatjana Tchumatchenko",
      "Carlos Wert Carvajal",
      "Maximilian F. Eggl"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02640",
    "title": "Learning to Recover Causal Relationship from Indefinite Data in the  Presence of Latent Confounders",
    "abstract": "In Causal Discovery with latent variables, We define two data paradigms: definite data: a single-skeleton structure with observed nodes single-value, and indefinite data: a set of multi-skeleton structures with observed nodes multi-value. Multi,skeletons induce low sample utilization and multi values induce incapability of the distribution assumption, both leading that recovering causal relations from indefinite data is, as of yet, largely unexplored. We design the causal strength variational model to settle down these two problems. Specifically, we leverage the causal strength instead of independent noise as latent variable to mediate evidence lower bound. By this design ethos, The causal strength of different skeletons is regarded as a distribution and can be expressed as a single-valued causal graph matrix. Moreover, considering the latent confounders, we disentangle the causal graph G into two relatisubgraphs O and C. O contains pure relations between observed nodes, while C represents the relations from latent variables to observed nodes. We summarize the above designs as Confounding Disentanglement Causal Discovery (biCD), which is tailored to learn causal representation from indefinite data under the latent confounding. Finally, we conduct comprehensive experiments on synthetic and real-world data to demonstrate the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2305.02640",
    "authors": [
      "Hang Chen",
      "Xinyu Yang",
      "Qing Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2305.02646",
    "title": "Low-Complexity Design and Detection of Unitary Constellations in  Non-Coherent SIMO Systems for URLLC",
    "abstract": "In this paper, we propose a novel multi-symbol unitary constellation structure for non-coherent single-input multiple-output (SIMO) communications over block Rayleigh fading channels. To facilitate the design and the detection of large unitary constellations at reduced complexity, the proposed constellations are constructed as the Cartesian product of independent amplitude and phase-shift-keying (PSK) vectors, and hence, can be iteratively detected. The amplitude vector can be detected by exhaustive search, whose complexity is still sufficiently low in short packet transmissions. For detection of the PSK vector, we adopt a maximum-A-posteriori (MAP) criterion to improve the reliability of the sorted decision-feedback differential detection (sort-DFDD), which results in near-optimal error performance in the case of the same modulation order of the transmit PSK symbols at different time slots. This detector is called MAP-based-reliability-sort-DFDD (MAP-R-sort-DFDD) and has polynomial complexity. For the case of different modulation orders at different time slots, we observe that undetected symbols with lower modulation orders have a significant impact on the detection of PSK symbols with higher modulation orders. We exploit this observation and propose an improved detector called improved-MAP-R-sort-DFDD, which approaches the optimal error performance with polynomial time complexity. Simulation results show the merits of our proposed multi-symbol unitary constellation when compared to competing low-complexity unitary constellations. ",
    "url": "https://arxiv.org/abs/2305.02646",
    "authors": [
      "Son T. Duong",
      "Ha H. Nguyen",
      "Ebrahim Bedeer",
      "Robert Barton"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.02667",
    "title": "A QoS-Aware Joint Uplink Spectrum and Power Allocation with Link  Adaptation for Vehicular Communications in 5G networks",
    "abstract": "In this work, we have proposed link adaptation based joint spectrum and power allocation algorithms for uplink cellular vehicle-to-everything (C-V2X) communication for OFDMA based 5G systems. In C-V2X, vehicle-to-vehicle (V2V) users share radio resources with vehicle-to-infrastructure (V2I) users. Existing works primarily focus on the optimal pairing of V2V and V2I users under the assumption that each V2I user needs a single resource block (RB); minimizing any interference through power allocation. In contrast, in this work, we have considered that the number of RBs needed by the users is a function of their channel condition and Quality of Service (QoS) - a method called link adaptation. It is effective in compensating for the incessant channel quality fluctuations at the high frequencies of operation of 5G. The first proposed resource allocation scheme of this work greedily allocates RBs to V2I users using link adaptation and then uses Hungarian algorithm to pair V2V with V2I users, while minimizing interference through power allocation. To reduce the complexity, the second scheme groups RBs into resource chunks (RCs); then uses Hungarian algorithm twice - first to allocate RCs to V2I users, and then to pair V2I users with V2V users. Extensive simulations reveal that link adaptation increases the number of satisfied V2I users as well as their sum-rate, while also improving QoS of individual users, thereby making it indispensable for C-V2X system. We have also considered the presence of best-effort users, and the diverse QoS has been provided through the multi-numerology frame structure of 5G. ",
    "url": "https://arxiv.org/abs/2305.02667",
    "authors": [
      "Krishna Pal Thakur",
      "Basabdatta Palit"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.02668",
    "title": "LatentAugment: Dynamically Optimized Latent Probabilities of Data  Augmentation",
    "abstract": "Although data augmentation is a powerful technique for improving the performance of image classification tasks, it is difficult to identify the best augmentation policy. The optimal augmentation policy, which is the latent variable, cannot be directly observed. To address this problem, this study proposes $\\textit{LatentAugment}$, which estimates the latent probability of optimal augmentation. The proposed method is appealing in that it can dynamically optimize the augmentation strategies for each input and model parameter in learning iterations. Theoretical analysis shows that LatentAugment is a general model that includes other augmentation methods as special cases, and it is simple and computationally efficient in comparison with existing augmentation methods. Experimental results show that the proposed LatentAugment has higher test accuracy than previous augmentation methods on the CIFAR-10, CIFAR-100, SVHN, and ImageNet datasets. ",
    "url": "https://arxiv.org/abs/2305.02668",
    "authors": [
      "Koichi Kuriyama"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02678",
    "title": "Real-Time Neural Appearance Models",
    "abstract": "We present a complete system for real-time rendering of scenes with complex appearance previously reserved for offline use. This is achieved with a combination of algorithmic and system level innovations. Our appearance model utilizes learned hierarchical textures that are interpreted using neural decoders, which produce reflectance values and importance-sampled directions. To best utilize the modeling capacity of the decoders, we equip the decoders with two graphics priors. The first prior -- transformation of directions into learned shading frames -- facilitates accurate reconstruction of mesoscale effects. The second prior -- a microfacet sampling distribution -- allows the neural decoder to perform importance sampling efficiently. The resulting appearance model supports anisotropic sampling and level-of-detail rendering, and allows baking deeply layered material graphs into a compact unified neural representation. By exposing hardware accelerated tensor operations to ray tracing shaders, we show that it is possible to inline and execute the neural decoders efficiently inside a real-time path tracer. We analyze scalability with increasing number of neural materials and propose to improve performance using code optimized for coherent and divergent execution. Our neural material shaders can be over an order of magnitude faster than non-neural layered materials. This opens up the door for using film-quality visuals in real-time applications such as games and live previews. ",
    "url": "https://arxiv.org/abs/2305.02678",
    "authors": [
      "Tizian Zeltner",
      "Fabrice Rousselle",
      "Andrea Weidlich",
      "Petrik Clarberg",
      "Jan Novák",
      "Benedikt Bitterli",
      "Alex Evans",
      "Tomáš Davidovič",
      "Simon Kallweit",
      "Aaron Lefohn"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2305.02691",
    "title": "PGB: A PubMed Graph Benchmark for Heterogeneous Network Representation  Learning",
    "abstract": "There has been a rapid growth in biomedical literature, yet capturing the heterogeneity of the bibliographic information of these articles remains relatively understudied. Although graph mining research via heterogeneous graph neural networks has taken center stage, it remains unclear whether these approaches capture the heterogeneity of the PubMed database, a vast digital repository containing over 33 million articles. We introduce PubMed Graph Benchmark (PGB), a new benchmark dataset for evaluating heterogeneous graph embeddings for biomedical literature. PGB is one of the largest heterogeneous networks to date and consists of 30 million English articles. The benchmark contains rich metadata including abstract, authors, citations, MeSH terms, MeSH hierarchy, and some other information. The benchmark contains an evaluation task of 21 systematic reviews topics from 3 different datasets. In PGB, we aggregate the metadata associated with the biomedical articles from PubMed into a unified source and make the benchmark publicly available for any future works. ",
    "url": "https://arxiv.org/abs/2305.02691",
    "authors": [
      "Eric W Lee",
      "Joyce C Ho"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.02695",
    "title": "In-situ Anomaly Detection in Additive Manufacturing with Graph Neural  Networks",
    "abstract": "Transforming a design into a high-quality product is a challenge in metal additive manufacturing due to rare events which can cause defects to form. Detecting these events in-situ could, however, reduce inspection costs, enable corrective action, and is the first step towards a future of tailored material properties. In this study a model is trained on laser input information to predict nominal laser melting conditions. An anomaly score is then calculated by taking the difference between the predictions and new observations. The model is evaluated on a dataset with known defects achieving an F1 score of 0.821. This study shows that anomaly detection methods are an important tool in developing robust defect detection methods. ",
    "url": "https://arxiv.org/abs/2305.02695",
    "authors": [
      "Sebastian Larsen",
      "Paul A. Hooper"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2305.02704",
    "title": "Mixed Max-and-Min Fractional Programming for Wireless Networks",
    "abstract": "Fractional programming (FP) plays a crucial role in wireless network design because many relevant problems involve maximizing or minimizing ratio terms. Notice that the maximization case and the minimization case of FP cannot be converted to each other in general, so they have to be dealt with separately in most of the previous studies. Thus, an existing FP method for maximizing ratios typically does not work for the minimization case, and vice versa. However, the FP objective can be mixed max-and-min, e.g., one may wish to maximize the signal-to-interference-plus-noise ratio (SINR) of the legitimate receiver while minimizing that of the eavesdropper. We aim to fill the gap between max-FP and min-FP by devising a unified optimization framework. The main results are three-fold. First, we extend the existing max-FP technique called quadratic transform to the min-FP, and further develop a full generalization for the mixed case. Second. we provide a minorization-maximization (MM) interpretation of the proposed unified approach, thereby establishing its convergence and also obtaining a matrix extension; another result we obtain is a generalized Lagrangian dual transform which facilitates the solving of the logarithmic FP. Finally, we present three typical applications: the age-of-information (AoI) minimization, the Cramer-Rao bound minimization for sensing, and the secure data rate maximization, none of which can be efficiently addressed by the previous FP methods. ",
    "url": "https://arxiv.org/abs/2305.02704",
    "authors": [
      "Yannan Chen",
      "Licheng Zhao",
      "Kaiming Shen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2305.02705",
    "title": "Guidance & Control Networks for Time-Optimal Quadcopter Flight",
    "abstract": "Reaching fast and autonomous flight requires computationally efficient and robust algorithms. To this end, we train Guidance & Control Networks to approximate optimal control policies ranging from energy-optimal to time-optimal flight. We show that the policies become more difficult to learn the closer we get to the time-optimal 'bang-bang' control profile. We also assess the importance of knowing the maximum angular rotor velocity of the quadcopter and show that over- or underestimating this limit leads to less robust flight. We propose an algorithm to identify the current maximum angular rotor velocity onboard and a network that adapts its policy based on the identified limit. Finally, we extend previous work on Guidance & Control Networks by learning to take consecutive waypoints into account. We fly a 4x3m track in similar lap times as the differential-flatness-based minimum snap benchmark controller while benefiting from the flexibility that Guidance & Control Networks offer. ",
    "url": "https://arxiv.org/abs/2305.02705",
    "authors": [
      "Sebastien Origer",
      "Christophe De Wagter",
      "Robin Ferede",
      "Guido C.H.E. de Croon",
      "Dario Izzo"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.02741",
    "title": "Uncertainty Aware Deep Learning Model for Secure and Trustworthy Channel  Estimation in 5G Networks",
    "abstract": "With the rise of intelligent applications, such as self-driving cars and augmented reality, the security and reliability of wireless communication systems have become increasingly crucial. One of the most critical components of ensuring a high-quality experience is channel estimation, which is fundamental for efficient transmission and interference management in wireless networks. However, using deep neural networks (DNNs) in channel estimation raises security and trust concerns due to their complexity and the need for more transparency in decision-making. This paper proposes a Monte Carlo Dropout (MCDO)-based approach for secure and trustworthy channel estimation in 5G networks. Our approach combines the advantages of traditional and deep learning techniques by incorporating conventional pilot-based channel estimation as a prior in the deep learning model. Additionally, we use MCDO to obtain uncertainty-aware predictions, enhancing the model's security and trustworthiness. Our experiments demonstrate that our proposed approach outperforms traditional and deep learning-based approaches regarding security, trustworthiness, and performance in 5G scenarios. ",
    "url": "https://arxiv.org/abs/2305.02741",
    "authors": [
      "Ferhat Ozgur Catak",
      "Umit Cali",
      "Murat Kuzlu",
      "Salih Sarp"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.02743",
    "title": "Incremental 3D Semantic Scene Graph Prediction from RGB Sequences",
    "abstract": "D semantic scene graphs are a powerful holistic representation as they describe the individual objects and depict the relation between them. They are compact high-level graphs that enable many tasks requiring scene reasoning. In real-world settings, existing 3D estimation methods produce robust predictions that mostly rely on dense inputs. In this work, we propose a real-time framework that incrementally builds a consistent 3D semantic scene graph of a scene given an RGB image sequence. Our method consists of a novel incremental entity estimation pipeline and a scene graph prediction network. The proposed pipeline simultaneously reconstructs a sparse point map and fuses entity estimation from the input images. The proposed network estimates 3D semantic scene graphs with iterative message passing using multi-view and geometric features extracted from the scene entities. Extensive experiments on the 3RScan dataset show the effectiveness of the proposed method in this challenging task, outperforming state-of-the-art approaches. ",
    "url": "https://arxiv.org/abs/2305.02743",
    "authors": [
      "Shun-Cheng Wu",
      "Keisuke Tateno",
      "Nassir Navab",
      "Federico Tombari"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02745",
    "title": "Age-Invariant Face Embedding using the Wasserstein Distance",
    "abstract": "In this work, we study face verification in datasets where images of the same individuals exhibit significant age differences. This poses a major challenge for current face recognition and verification techniques. To address this issue, we propose a novel approach that utilizes multitask learning and a Wasserstein distance discriminator to disentangle age and identity embeddings of facial images. Our approach employs multitask learning with a Wasserstein distance discriminator that minimizes the mutual information between the age and identity embeddings by minimizing the Jensen-Shannon divergence. This improves the encoding of age and identity information in face images and enhances the performance of face verification in age-variant datasets. We evaluate the effectiveness of our approach using multiple age-variant face datasets and demonstrate its superiority over state-of-the-art methods in terms of face verification accuracy. ",
    "url": "https://arxiv.org/abs/2305.02745",
    "authors": [
      "Eran Dahan",
      "Yosi Keller"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02747",
    "title": "Unsupervised Dialogue Topic Segmentation with Topic-aware Utterance  Representation",
    "abstract": "Dialogue Topic Segmentation (DTS) plays an essential role in a variety of dialogue modeling tasks. Previous DTS methods either focus on semantic similarity or dialogue coherence to assess topic similarity for unsupervised dialogue segmentation. However, the topic similarity cannot be fully identified via semantic similarity or dialogue coherence. In addition, the unlabeled dialogue data, which contains useful clues of utterance relationships, remains underexploited. In this paper, we propose a novel unsupervised DTS framework, which learns topic-aware utterance representations from unlabeled dialogue data through neighboring utterance matching and pseudo-segmentation. Extensive experiments on two benchmark datasets (i.e., DialSeg711 and Doc2Dial) demonstrate that our method significantly outperforms the strong baseline methods. For reproducibility, we provide our code and data at:https://github.com/AlibabaResearch/DAMO-ConvAI/tree/main/dial-start. ",
    "url": "https://arxiv.org/abs/2305.02747",
    "authors": [
      "Haoyu Gao",
      "Rui Wang",
      "Ting-En Lin",
      "Yuchuan Wu",
      "Min Yang",
      "Fei Huang",
      "Yongbin Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02749",
    "title": "Explainable Reinforcement Learning via a Causal World Model",
    "abstract": "Generating explanations for reinforcement learning (RL) is challenging as actions may produce long-term effects on the future. In this paper, we develop a novel framework for explainable RL by learning a causal world model without prior knowledge of the causal structure of the environment. The model captures the influence of actions, allowing us to interpret the long-term effects of actions through causal chains, which present how actions influence environmental variables and finally lead to rewards. Different from most explanatory models which suffer from low accuracy, our model remains accurate while improving explainability, making it applicable in model-based learning. As a result, we demonstrate that our causal model can serve as the bridge between explainability and learning. ",
    "url": "https://arxiv.org/abs/2305.02749",
    "authors": [
      "Zhongwei Yu",
      "Jingqing Ruan",
      "Dengpeng Xing"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02760",
    "title": "Multi-Modality Deep Network for JPEG Artifacts Reduction",
    "abstract": "In recent years, many convolutional neural network-based models are designed for JPEG artifacts reduction, and have achieved notable progress. However, few methods are suitable for extreme low-bitrate image compression artifacts reduction. The main challenge is that the highly compressed image loses too much information, resulting in reconstructing high-quality image difficultly. To address this issue, we propose a multimodal fusion learning method for text-guided JPEG artifacts reduction, in which the corresponding text description not only provides the potential prior information of the highly compressed image, but also serves as supplementary information to assist in image deblocking. We fuse image features and text semantic features from the global and local perspectives respectively, and design a contrastive loss built upon contrastive learning to produce visually pleasing results. Extensive experiments, including a user study, prove that our method can obtain better deblocking results compared to the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2305.02760",
    "authors": [
      "Xuhao Jiang",
      "Weimin Tan",
      "Qing Lin",
      "Chenxi Ma",
      "Bo Yan",
      "Liquan Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02769",
    "title": "Towards End-to-End Semi-Supervised Table Detection with Deformable  Transformer",
    "abstract": "Table detection is the task of classifying and localizing table objects within document images. With the recent development in deep learning methods, we observe remarkable success in table detection. However, a significant amount of labeled data is required to train these models effectively. Many semi-supervised approaches are introduced to mitigate the need for a substantial amount of label data. These approaches use CNN-based detectors that rely on anchor proposals and post-processing stages such as NMS. To tackle these limitations, this paper presents a novel end-to-end semi-supervised table detection method that employs the deformable transformer for detecting table objects. We evaluate our semi-supervised method on PubLayNet, DocBank, ICADR-19 and TableBank datasets, and it achieves superior performance compared to previous methods. It outperforms the fully supervised method (Deformable transformer) by +3.4 points on 10\\% labels of TableBank-both dataset and the previous CNN-based semi-supervised approach (Soft Teacher) by +1.8 points on 10\\% labels of PubLayNet dataset. We hope this work opens new possibilities towards semi-supervised and unsupervised table detection methods. ",
    "url": "https://arxiv.org/abs/2305.02769",
    "authors": [
      "Tahira Shehzadi",
      "Khurram Azeem Hashmi",
      "Didier Stricker",
      "Marcus Liwicki",
      "Muhammad Zeshan Afzal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02772",
    "title": "Efficient and Robust Time-Optimal Trajectory Planning and Control for  Agile Quadrotor Flight",
    "abstract": "Agile quadrotor flight relies on rapidly planning and accurately tracking time-optimal trajectories, a technology critical to their application in the wild. However, the computational burden of computing time-optimal trajectories based on the full quadrotor dynamics (typically on the order of minutes or even hours) can hinder its ability to respond quickly to changing scenarios. Additionally, modeling errors and external disturbances can lead to deviations from the desired trajectory during tracking in real time. This letter proposes a novel approach to computing time-optimal trajectories, by fixing the nodes with waypoint constraints and adopting separate sampling intervals for trajectories between waypoints, which significantly accelerates trajectory planning. Furthermore, the planned paths are tracked via a time-adaptive model predictive control scheme whose allocated tracking time can be adaptively adjusted on-the-fly, therefore enhancing the tracking accuracy and robustness. We evaluate our approach through simulations and experimentally validate its performance in dynamic waypoint scenarios for time-optimal trajectory replanning and trajectory tracking. ",
    "url": "https://arxiv.org/abs/2305.02772",
    "authors": [
      "Ziyu Zhou",
      "Gang Wang",
      "Jian Sun",
      "Jikai Wang",
      "Jie Chen"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.02777",
    "title": "Unified Model Learning for Various Neural Machine Translation",
    "abstract": "Existing neural machine translation (NMT) studies mainly focus on developing dataset-specific models based on data from different tasks (e.g., document translation and chat translation). Although the dataset-specific models have achieved impressive performance, it is cumbersome as each dataset demands a model to be designed, trained, and stored. In this work, we aim to unify these translation tasks into a more general setting. Specifically, we propose a ``versatile'' model, i.e., the Unified Model Learning for NMT (UMLNMT) that works with data from different tasks, and can translate well in multiple settings simultaneously, and theoretically it can be as many as possible. Through unified learning, UMLNMT is able to jointly train across multiple tasks, implementing intelligent on-demand translation. On seven widely-used translation tasks, including sentence translation, document translation, and chat translation, our UMLNMT results in substantial improvements over dataset-specific models with significantly reduced model deployment costs. Furthermore, UMLNMT can achieve competitive or better performance than state-of-the-art dataset-specific methods. Human evaluation and in-depth analysis also demonstrate the superiority of our approach on generating diverse and high-quality translations. Additionally, we provide a new genre translation dataset about famous aphorisms with 186k Chinese->English sentence pairs. ",
    "url": "https://arxiv.org/abs/2305.02777",
    "authors": [
      "Yunlong Liang",
      "Fandong Meng",
      "Jinan Xu",
      "Jiaan Wang",
      "Yufeng Chen",
      "Jie Zhou"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02782",
    "title": "A Momentum-Incorporated Non-Negative Latent Factorization of Tensors  Model for Dynamic Network Representation",
    "abstract": "A large-scale dynamic network (LDN) is a source of data in many big data-related applications due to their large number of entities and large-scale dynamic interactions. They can be modeled as a high-dimensional incomplete (HDI) tensor that contains a wealth of knowledge about time patterns. A Latent factorization of tensors (LFT) model efficiently extracts this time pattern, which can be established using stochastic gradient descent (SGD) solvers. However, LFT models based on SGD are often limited by training schemes and have poor tail convergence. To solve this problem, this paper proposes a novel nonlinear LFT model (MNNL) based on momentum-incorporated SGD, which extracts non-negative latent factors from HDI tensors to make training unconstrained and compatible with general training schemes, while improving convergence accuracy and speed. Empirical studies on two LDN datasets show that compared to existing models, the MNNL model has higher prediction accuracy and convergence speed. ",
    "url": "https://arxiv.org/abs/2305.02782",
    "authors": [
      "Aoling Zeng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.02783",
    "title": "Automated Code generation for Information Technology Tasks in YAML  through Large Language Models",
    "abstract": "The recent improvement in code generation capabilities due to the use of large language models has mainly benefited general purpose programming languages. Domain specific languages, such as the ones used for IT Automation, have received far less attention, despite involving many active developers and being an essential component of modern cloud platforms. This work focuses on the generation of Ansible-YAML, a widely used markup language for IT Automation. We present Ansible Wisdom, a natural-language to Ansible-YAML code generation tool, aimed at improving IT automation productivity. Ansible Wisdom is a transformer-based model, extended by training with a new dataset containing Ansible-YAML. We also develop two novel performance metrics for YAML and Ansible to capture the specific characteristics of this domain. Results show that Ansible Wisdom can accurately generate Ansible script from natural language prompts with performance comparable or better than existing state of the art code generation models. ",
    "url": "https://arxiv.org/abs/2305.02783",
    "authors": [
      "Saurabh Pujar",
      "Luca Buratti",
      "Xiaojie Guo",
      "Nicolas Dupuis",
      "Burn Lewis",
      "Sahil Suneja",
      "Atin Sood",
      "Ganesh Nalawade",
      "Matt Jones",
      "Alessandro Morari",
      "Ruchir Puri"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2305.02810",
    "title": "Interpretable Sentence Representation with Variational Autoencoders and  Attention",
    "abstract": "In this thesis, we develop methods to enhance the interpretability of recent representation learning techniques in natural language processing (NLP) while accounting for the unavailability of annotated data. We choose to leverage Variational Autoencoders (VAEs) due to their efficiency in relating observations to latent generative factors and their effectiveness in data-efficient learning and interpretable representation learning. As a first contribution, we identify and remove unnecessary components in the functioning scheme of semi-supervised VAEs making them faster, smaller and easier to design. Our second and main contribution is to use VAEs and Transformers to build two models with inductive bias to separate information in latent representations into understandable concepts without annotated data. The first model, Attention-Driven VAE (ADVAE), is able to separately represent and control information about syntactic roles in sentences. The second model, QKVAE, uses separate latent variables to form keys and values for its Transformer decoder and is able to separate syntactic and semantic information in its neural representations. In transfer experiments, QKVAE has competitive performance compared to supervised models and equivalent performance to a supervised model using 50K annotated samples. Additionally, QKVAE displays improved syntactic role disentanglement capabilities compared to ADVAE. Overall, we demonstrate that it is possible to enhance the interpretability of state-of-the-art deep learning architectures for language modeling with unannotated data in situations where text data is abundant but annotations are scarce. ",
    "url": "https://arxiv.org/abs/2305.02810",
    "authors": [
      "Ghazi Felhi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02816",
    "title": "Shannon meets Gray: Noise-robust, Low-sensitivity Codes with  Applications in Differential Privacy",
    "abstract": "Integer data is typically made differentially private by adding noise from a Discrete Laplace (or Discrete Gaussian) distribution. We study the setting where differential privacy of a counting query is achieved using bit-wise randomized response, i.e., independent, random bit flips on the encoding of the query answer. Binary error-correcting codes transmitted through noisy channels with independent bit flips are well-studied in information theory. However, such codes are unsuitable for differential privacy since they have (by design) high sensitivity, i.e., neighboring integers have encodings with a large Hamming distance. Gray codes show that it is possible to create an efficient sensitivity 1 encoding, but are also not suitable for differential privacy due to lack of noise-robustness. Our main result is that it is possible, with a constant rate code, to simultaneously achieve the sensitivity of Gray codes and the noise-robustness of error-correcting codes (down to the noise level required for differential privacy). An application of this new encoding of the integers is a faster, space-optimal differentially private data structure for histograms. ",
    "url": "https://arxiv.org/abs/2305.02816",
    "authors": [
      "David Rasmussen Lolck",
      "Rasmus Pagh"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2305.02847",
    "title": "Fundamental Detection Probability vs. Achievable Rate Tradeoff in  Integrated Sensing and Communication Systems",
    "abstract": "Integrating sensing functionalities is envisioned as a distinguishing feature of next-generation mobile networks, which has given rise to the development of a novel enabling technology -- \\emph{Integrated Sensing and Communication (ISAC)}. Portraying the theoretical performance bounds of ISAC systems is fundamentally important to understand how sensing and communication functionalities interact (e.g., competitively or cooperatively) in terms of resource utilization, while revealing insights and guidelines for the development of effective physical-layer techniques. In this paper, we characterize the fundamental performance tradeoff between the detection probability for target monitoring and the user's achievable rate in ISAC systems. To this end, we first discuss the achievable rate of the user under sensing-free and sensing-interfered communication scenarios. Furthermore, we derive closed-form expressions for the probability of false alarm (PFA) and the successful probability of detection (PD) for monitoring the target of interest, where we consider both communication-assisted and communication-interfered sensing scenarios. In addition, the effects of the unknown channel coefficient are also taken into account in our theoretical analysis. Based on our analytical results, we then carry out a comprehensive assessment of the performance tradeoff between sensing and communication functionalities. Specifically, we formulate a power allocation problem to minimize the transmit power at the base station (BS) under the constraints of ensuring a required PD for perception as well as the communication user's quality of service requirement in terms of achievable rate. Finally, simulation results corroborate the accuracy of our theoretical analysis and the effectiveness of the proposed power allocation solutions. ",
    "url": "https://arxiv.org/abs/2305.02847",
    "authors": [
      "Jiancheng An",
      "Hongbin Li",
      "Derrick Wing Kwan Ng",
      "Chau Yuen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.02854",
    "title": "Near-Optimal Compact Routing and Decomposition Schemes for Planar Graphs",
    "abstract": "We consider the problem of computing compact routing tables for a (weighted) planar graph $G:= (V, E,w)$ in the PRAM, CONGEST, and the novel HYBRID communication model. We present algorithms with polylogarithmic work and communication that are almost optimal in all relevant parameters, i.e., computation time, table sizes, and stretch. All algorithms are heavily randomized, and all our bounds hold w.h.p. For a given parameter $\\epsilon>0$, our scheme computes labels of size $\\widetilde{O}(\\epsilon^{-1})$ and is computed in $\\widetilde{O}(\\epsilon^{-2})$ time and $\\widetilde{O}(n)$ work in the PRAM and a HYBRID model and $\\widetilde{O}(\\epsilon^{-2} \\cdot HD)$ (Here, $HD$ denotes the network's hop-diameter) time in CONGEST. The stretch of the resulting routing scheme is $1+\\epsilon$. To achieve these results, we extend the divide-and-conquer framework of Li and Parter [STOC '19] and combine it with state-of-the-art distributed distance approximation algorithms [STOC '22]. Furthermore, we provide a distributed decomposition scheme, which may be of independent interest. ",
    "url": "https://arxiv.org/abs/2305.02854",
    "authors": [
      "Jinfeng Dou",
      "Thorsten Götte",
      "Henning Hillebrandt",
      "Christian Scheideler",
      "Julian Werthmann"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2305.02857",
    "title": "Maximum Causal Entropy Inverse Constrained Reinforcement Learning",
    "abstract": "When deploying artificial agents in real-world environments where they interact with humans, it is crucial that their behavior is aligned with the values, social norms or other requirements of that environment. However, many environments have implicit constraints that are difficult to specify and transfer to a learning agent. To address this challenge, we propose a novel method that utilizes the principle of maximum causal entropy to learn constraints and an optimal policy that adheres to these constraints, using demonstrations of agents that abide by the constraints. We prove convergence in a tabular setting and provide an approximation which scales to complex environments. We evaluate the effectiveness of the learned policy by assessing the reward received and the number of constraint violations, and we evaluate the learned cost function based on its transferability to other agents. Our method has been shown to outperform state-of-the-art approaches across a variety of tasks and environments, and it is able to handle problems with stochastic dynamics and a continuous state-action space. ",
    "url": "https://arxiv.org/abs/2305.02857",
    "authors": [
      "Mattijs Baert",
      "Pietro Mazzaglia",
      "Sam Leroux",
      "Pieter Simoens"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02858",
    "title": "ReMask: A Robust Information-Masking Approach for Domain Counterfactual  Generation",
    "abstract": "Domain shift is a big challenge in NLP, thus, many approaches resort to learning domain-invariant features to mitigate the inference phase domain shift. Such methods, however, fail to leverage the domain-specific nuances relevant to the task at hand. To avoid such drawbacks, domain counterfactual generation aims to transform a text from the source domain to a given target domain. However, due to the limited availability of data, such frequency-based methods often miss and lead to some valid and spurious domain-token associations. Hence, we employ a three-step domain obfuscation approach that involves frequency and attention norm-based masking, to mask domain-specific cues, and unmasking to regain the domain generic context. Our experiments empirically show that the counterfactual samples sourced from our masked text lead to improved domain transfer on 10 out of 12 domain sentiment classification settings, with an average of 2% accuracy improvement over the state-of-the-art for unsupervised domain adaptation (UDA). Further, our model outperforms the state-of-the-art by achieving 1.4% average accuracy improvement in the adversarial domain adaptation (ADA) setting. Moreover, our model also shows its domain adaptation efficacy on a large multi-domain intent classification dataset where it attains state-of-the-art results. We release the codes publicly at \\url{https://github.com/declare-lab/remask}. ",
    "url": "https://arxiv.org/abs/2305.02858",
    "authors": [
      "Pengfei Hong",
      "Rishabh Bhardwaj",
      "Navonil Majumdar",
      "Somak Aditya",
      "Soujanya Poria"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02859",
    "title": "Social Robot Navigation through Constrained Optimization: a Comparative  Study of Uncertainty-based Objectives and Constraints",
    "abstract": "This work is dedicated to the study of how uncertainty estimation of the human motion prediction can be embedded into constrained optimization techniques, such as Model Predictive Control (MPC) for the social robot navigation. We propose several cost objectives and constraint functions obtained from the uncertainty of predicting pedestrian positions and related to the probability of the collision that can be applied to the MPC, and all the different variants are compared in challenging scenes with multiple agents. The main question this paper tries to answer is: what are the most important uncertainty-based criteria for social MPC? For that, we evaluate the proposed approaches with several social navigation metrics in an extensive set of scenarios of different complexity in reproducible synthetic environments. The main outcome of our study is a foundation for a practical guide on when and how to use uncertainty-aware approaches for social robot navigation in practice and what are the most effective criteria. ",
    "url": "https://arxiv.org/abs/2305.02859",
    "authors": [
      "Timur Akhtyamov",
      "Aleksandr Kashirin",
      "Aleksey Postnikov",
      "Gonzalo Ferrer"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.02866",
    "title": "Hierarchical Transformer for Scalable Graph Learning",
    "abstract": "Graph Transformer is gaining increasing attention in the field of machine learning and has demonstrated state-of-the-art performance on benchmarks for graph representation learning. However, as current implementations of Graph Transformer primarily focus on learning representations of small-scale graphs, the quadratic complexity of the global self-attention mechanism presents a challenge for full-batch training when applied to larger graphs. Additionally, conventional sampling-based methods fail to capture necessary high-level contextual information, resulting in a significant loss of performance. In this paper, we introduce the Hierarchical Scalable Graph Transformer (HSGT) as a solution to these challenges. HSGT successfully scales the Transformer architecture to node representation learning tasks on large-scale graphs, while maintaining high performance. By utilizing graph hierarchies constructed through coarsening techniques, HSGT efficiently updates and stores multi-scale information in node embeddings at different levels. Together with sampling-based training methods, HSGT effectively captures and aggregates multi-level information on the hierarchical graph using only Transformer blocks. Empirical evaluations demonstrate that HSGT achieves state-of-the-art performance on large-scale benchmarks with graphs containing millions of nodes with high efficiency. ",
    "url": "https://arxiv.org/abs/2305.02866",
    "authors": [
      "Wenhao Zhu",
      "Tianyu Wen",
      "Guojie Song",
      "Xiaojun Ma",
      "Liang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.02882",
    "title": "Simple Noisy Environment Augmentation for Reinforcement Learning",
    "abstract": "Data augmentation is a widely used technique for improving model performance in machine learning, particularly in computer vision and natural language processing. Recently, there has been increasing interest in applying augmentation techniques to reinforcement learning (RL) problems, with a focus on image-based augmentation. In this paper, we explore a set of generic wrappers designed to augment RL environments with noise and encourage agent exploration and improve training data diversity which are applicable to a broad spectrum of RL algorithms and environments. Specifically, we concentrate on augmentations concerning states, rewards, and transition dynamics and introduce two novel augmentation techniques. In addition, we introduce a noise rate hyperparameter for control over the frequency of noise injection. We present experimental results on the impact of these wrappers on return using three popular RL algorithms, Soft Actor-Critic (SAC), Twin Delayed DDPG (TD3), and Proximal Policy Optimization (PPO), across five MuJoCo environments. To support the choice of augmentation technique in practice, we also present analysis that explores the performance these techniques across environments. Lastly, we publish the wrappers in our noisyenv repository for use with gym environments. ",
    "url": "https://arxiv.org/abs/2305.02882",
    "authors": [
      "Raad Khraishi",
      "Ramin Okhrati"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02886",
    "title": "SlipCover: Near Zero-Overhead Code Coverage for Python",
    "abstract": "Coverage analysis is widely used but can suffer from high overhead. This overhead is especially acute in the context of Python, which is already notoriously slow (a recent study observes a roughly 30x slowdown vs. native code). We find that the state-of-the-art coverage tool for Python, coverage.py, leads to slowdowns of 1.3x--3.6x (median: 2.8x) for the standard Python interpreter. Slowdowns are even more extreme when using PyPy, a JIT-compiled Python implementation, where coverage.py slows execution by 2.4x--325x (median: 14x). This performance degradation reduces the utility of coverage analysis in most use cases, including testing and fuzzing, and precludes its use in deployment. This paper presents SlipCover, a novel, near-zero overhead coverage analyzer for Python. SlipCover works without modifications to either the Python interpreter or PyPy. It first processes a program's AST to accurately identify all branches and lines. SlipCover then dynamically rewrites Python bytecodes to add lightweight instrumentation to each identified branch and line. At run time, SlipCover periodically de-instruments already-covered lines and branches. The result is extremely low overheads -- a median of just 5% -- making SlipCover suitable for use in deployment. We show its efficiency can translate to significant increases in the speed of coverage-based clients. As a proof of concept, we integrate SlipCover into TPBT, a targeted property-based testing system, and observe a 22x speedup. ",
    "url": "https://arxiv.org/abs/2305.02886",
    "authors": [
      "Juan Altmayer Pizzorno",
      "Emery D Berger"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2305.02888",
    "title": "Neuromorphic Sensing for Yawn Detection in Driver Drowsiness",
    "abstract": "Driver monitoring systems (DMS) are a key component of vehicular safety and essential for the transition from semiautonomous to fully autonomous driving. A key task for DMS is to ascertain the cognitive state of a driver and to determine their level of tiredness. Neuromorphic vision systems, based on event camera technology, provide advanced sensing of facial characteristics, in particular the behavior of a driver's eyes. This research explores the potential to extend neuromorphic sensing techniques to analyze the entire facial region, detecting yawning behaviors that give a complimentary indicator of tiredness. A neuromorphic dataset is constructed from 952 video clips (481 yawns, 471 not-yawns) captured with an RGB color camera, with 37 subjects. A total of 95200 neuromorphic image frames are generated from this video data using a video-to-event converter. From these data 21 subjects were selected to provide a training dataset, 8 subjects were used for validation data, and the remaining 8 subjects were reserved for an \"unseen\" test dataset. An additional 12300 frames were generated from event simulations of a public dataset to test against other methods. A CNN with self-attention and a recurrent head was designed, trained, and tested with these data. Respective precision and recall scores of 95.9 percent and 94.7 percent were achieved on our test set, and 89.9 percent and 91 percent on the simulated public test set, demonstrating the feasibility to add yawn detection as a sensing component of a neuromorphic DMS. ",
    "url": "https://arxiv.org/abs/2305.02888",
    "authors": [
      "Paul Kielty",
      "Mehdi Sefidgar Dilmaghani",
      "Cian Ryan",
      "Joe Lemley",
      "Peter Corcoran"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02901",
    "title": "Single Node Injection Label Specificity Attack on Graph Neural Networks  via Reinforcement Learning",
    "abstract": "Graph neural networks (GNNs) have achieved remarkable success in various real-world applications. However, recent studies highlight the vulnerability of GNNs to malicious perturbations. Previous adversaries primarily focus on graph modifications or node injections to existing graphs, yielding promising results but with notable limitations. Graph modification attack~(GMA) requires manipulation of the original graph, which is often impractical, while graph injection attack~(GIA) necessitates training a surrogate model in the black-box setting, leading to significant performance degradation due to divergence between the surrogate architecture and the actual victim model. Furthermore, most methods concentrate on a single attack goal and lack a generalizable adversary to develop distinct attack strategies for diverse goals, thus limiting precise control over victim model behavior in real-world scenarios. To address these issues, we present a gradient-free generalizable adversary that injects a single malicious node to manipulate the classification result of a target node in the black-box evasion setting. We propose Gradient-free Generalizable Single Node Injection Attack, namely G$^2$-SNIA, a reinforcement learning framework employing Proximal Policy Optimization. By directly querying the victim model, G$^2$-SNIA learns patterns from exploration to achieve diverse attack goals with extremely limited attack budgets. Through comprehensive experiments over three acknowledged benchmark datasets and four prominent GNNs in the most challenging and realistic scenario, we demonstrate the superior performance of our proposed G$^2$-SNIA over the existing state-of-the-art baselines. Moreover, by comparing G$^2$-SNIA with multiple white-box evasion baselines, we confirm its capacity to generate solutions comparable to those of the best adversaries. ",
    "url": "https://arxiv.org/abs/2305.02901",
    "authors": [
      "Dayuan Chen",
      "Jian Zhang",
      "Yuqian Lv",
      "Jinhuan Wang",
      "Hongjie Ni",
      "Shanqing Yu",
      "Zhen Wang",
      "Qi Xuan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.02909",
    "title": "Aligning Bird-Eye View Representation of Point Cloud Sequences using  Scene Flow",
    "abstract": "Low-resolution point clouds are challenging for object detection methods due to their sparsity. Densifying the present point cloud by concatenating it with its predecessors is a popular solution to this challenge. Such concatenation is possible thanks to the removal of ego vehicle motion using its odometry. This method is called Ego Motion Compensation (EMC). Thanks to the added points, EMC significantly improves the performance of single-frame detectors. However, it suffers from the shadow effect that manifests in dynamic objects' points scattering along their trajectories. This effect results in a misalignment between feature maps and objects' locations, thus limiting performance improvement to stationary and slow-moving objects only. Scene flow allows aligning point clouds in 3D space, thus naturally resolving the misalignment in feature spaces. By observing that scene flow computation shares several components with 3D object detection pipelines, we develop a plug-in module that enables single-frame detectors to compute scene flow to rectify their Bird-Eye View representation. Experiments on the NuScenes dataset show that our module leads to a significant increase (up to 16%) in the Average Precision of large vehicles, which interestingly demonstrates the most severe shadow effect. The code is published at https://github.com/quan-dao/pc-corrector. ",
    "url": "https://arxiv.org/abs/2305.02909",
    "authors": [
      "Minh-Quan Dao",
      "Vincent Frémont",
      "Elwan Héry"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.02911",
    "title": "UPDExplainer: an Interpretable Transformer-based Framework for Urban  Physical Disorder Detection Using Street View Imagery",
    "abstract": "Urban Physical Disorder (UPD), such as old or abandoned buildings, broken sidewalks, litter, and graffiti, has a negative impact on residents' quality of life. They can also increase crime rates, cause social disorder, and pose a public health risk. Currently, there is a lack of efficient and reliable methods for detecting and understanding UPD. To bridge this gap, we propose UPDExplainer, an interpretable transformer-based framework for UPD detection. We first develop a UPD detection model based on the Swin Transformer architecture, which leverages readily accessible street view images to learn discriminative representations. In order to provide clear and comprehensible evidence and analysis, we subsequently introduce a UPD factor identification and ranking module that combines visual explanation maps with semantic segmentation maps. This novel integrated approach enables us to identify the exact objects within street view images that are responsible for physical disorders and gain insights into the underlying causes. Experimental results on the re-annotated Place Pulse 2.0 dataset demonstrate promising detection performance of the proposed method, with an accuracy of 79.9%. For a comprehensive evaluation of the method's ranking performance, we report the mean Average Precision (mAP), R-Precision (RPrec), and Normalized Discounted Cumulative Gain (NDCG), with success rates of 75.51%, 80.61%, and 82.58%, respectively. We also present a case study of detecting and ranking physical disorders in the southern region of downtown Los Angeles, California, to demonstrate the practicality and effectiveness of our framework. ",
    "url": "https://arxiv.org/abs/2305.02911",
    "authors": [
      "Chuanbo Hu",
      "Shan Jia",
      "Fan Zhang",
      "Changjiang Xiao",
      "Mindi Ruan",
      "Jacob Thrasher",
      "Xin Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02925",
    "title": "Maximum values of the Sombor-index-like graph invariants of connected  graphs",
    "abstract": "A set of novel vertex-degree-based invariants, similar to the Sombor-index, was introduced by Gutman, denoted by $SO_1, SO_2, \\ldots,SO_6$. These invariants were constructed through geometric reasoning based on a new graph invariant framework. Motivated by proposed open problems in [Z. Tang, Q. Li, H. Deng, \\textit{Trees with Extremal Values of the Sombor-Index-Like Graph Invariants}, MATCH Commun. Math. Comput. Chem. \\textbf{90} (2023) 203-222], we have found the maximum values of $SO_5$ and $SO_6$ in the set of molecular trees with a given number of vertices, respectively, and we have found the maximum value of $SO_5$ in the set of connected graphs. ",
    "url": "https://arxiv.org/abs/2305.02925",
    "authors": [
      "Milan Bašić",
      "Marko Milenković"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2305.02948",
    "title": "HARQ Delay Minimization of 5G Wireless Network with Imperfect Feedback",
    "abstract": "5G new radio (NR) technology is introduced to satisfy more demanding services. Ultra-Reliable Low Latency Communication (URLLC) requires very low delay compared with the previous techniques. This is hard to achieve when hybrid automatic repeat request (HARQ) is applied and especially when the feedback channel is erroneous. In this work, we consider various delay components in incremental redundancy (IR) HARQ systems and minimize the average delay by applying asymmetric feedback detection (AFD) and find the optimal transmission length for each transmission attempt. A M/G/1 queuing model is used in this work to analyze the queuing delay in 5G NR when there are multiple uses in the system. Numerical results show that significant performance gains and lower outage probability can be achieved by applying AFD. ",
    "url": "https://arxiv.org/abs/2305.02948",
    "authors": [
      "Weihang Ding",
      "Mohammad Shikh-Bahaei"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.02961",
    "title": "FUSegNet: A Deep Convolutional Neural Network for Foot Ulcer  Segmentation",
    "abstract": "This paper presents FUSegNet, a new model for foot ulcer segmentation in diabetes patients, which uses the pre-trained EfficientNet-b7 as a backbone to address the issue of limited training samples. A modified spatial and channel squeeze-and-excitation (scSE) module called parallel scSE or P-scSE is proposed that combines additive and max-out scSE. A new arrangement is introduced for the module by fusing it in the middle of each decoder stage. As the top decoder stage carries a limited number of feature maps, max-out scSE is bypassed there to form a shorted P-scSE. A set of augmentations, comprising geometric, morphological, and intensity-based augmentations, is applied before feeding the data into the network. The proposed model is first evaluated on a publicly available chronic wound dataset where it achieves a data-based dice score of 92.70%, which is the highest score among the reported approaches. The model outperforms other scSE-based UNet models in terms of Pratt's figure of merits (PFOM) scores in most categories, which evaluates the accuracy of edge localization. The model is then tested in the MICCAI 2021 FUSeg challenge, where a variation of FUSegNet called x-FUSegNet is submitted. The x-FUSegNet model, which takes the average of outputs obtained by FUSegNet using 5-fold cross-validation, achieves a dice score of 89.23%, placing it at the top of the FUSeg Challenge leaderboard. The source code for the model is available on https://github.com/mrinal054/FUSegNet. ",
    "url": "https://arxiv.org/abs/2305.02961",
    "authors": [
      "Mrinal Kanti Dhar",
      "Taiyu Zhang",
      "Yash Patel",
      "Zeyun Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02997",
    "title": "When Do Neural Nets Outperform Boosted Trees on Tabular Data?",
    "abstract": "Tabular data is one of the most commonly used types of data in machine learning. Despite recent advances in neural nets (NNs) for tabular data, there is still an active discussion on whether or not NNs generally outperform gradient-boosted decision trees (GBDTs) on tabular data, with several recent works arguing either that GBDTs consistently outperform NNs on tabular data, or vice versa. In this work, we take a step back and ask, 'does it matter?' We conduct the largest tabular data analysis to date, by comparing 19 algorithms across 176 datasets, and we find that the 'NN vs. GBDT' debate is overemphasized: for a surprisingly high number of datasets, either the performance difference between GBDTs and NNs is negligible, or light hyperparameter tuning on a GBDT is more important than selecting the best algorithm. Next, we analyze 965 metafeatures to determine what properties of a dataset make NNs or GBDTs better-suited to perform well. For example, we find that GBDTs are much better than NNs at handling skewed feature distributions, heavy-tailed feature distributions, and other forms of dataset irregularities. Our insights act as a guide for practitioners to decide whether or not they need to run a neural net to reach top performance on their dataset. Our codebase and all raw results are available at https://github.com/naszilla/tabzilla. ",
    "url": "https://arxiv.org/abs/2305.02997",
    "authors": [
      "Duncan McElfresh",
      "Sujay Khandagale",
      "Jonathan Valverde",
      "Vishak Prasad C",
      "Ganesh Ramakrishnan",
      "Micah Goldblum",
      "Colin White"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.03010",
    "title": "Sentence Embedding Leaks More Information than You Expect: Generative  Embedding Inversion Attack to Recover the Whole Sentence",
    "abstract": "Sentence-level representations are beneficial for various natural language processing tasks. It is commonly believed that vector representations can capture rich linguistic properties. Currently, large language models (LMs) achieve state-of-the-art performance on sentence embedding. However, some recent works suggest that vector representations from LMs can cause information leakage. In this work, we further investigate the information leakage issue and propose a generative embedding inversion attack (GEIA) that aims to reconstruct input sequences based only on their sentence embeddings. Given the black-box access to a language model, we treat sentence embeddings as initial tokens' representations and train or fine-tune a powerful decoder model to decode the whole sequences directly. We conduct extensive experiments to demonstrate that our generative inversion attack outperforms previous embedding inversion attacks in classification metrics and generates coherent and contextually similar sentences as the original inputs. ",
    "url": "https://arxiv.org/abs/2305.03010",
    "authors": [
      "Haoran Li",
      "Mingshi Xu",
      "Yangqiu Song"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.03017",
    "title": "Improving Code Example Recommendations on Informal Documentation Using  BERT and Query-Aware LSH: A Comparative Study",
    "abstract": "The study of code example recommendation has been conducted extensively in the past and recently in order to assist developers in their software development tasks. This is because developers often spend significant time searching for relevant code examples on the internet, utilizing open-source projects and informal documentation. For finding useful code examples, informal documentation, such as Stack Overflow discussions and forums, can be invaluable. We have focused our research on Stack Overflow, which is a popular resource for discussing different topics among software developers. For increasing the quality of the recommended code examples, we have collected and recommended the best code examples in the Java programming language. We have utilized BERT in our approach, which is a Large Language Model (LLM) for text representation that can effectively extract semantic information from textual data. Our first step involved using BERT to convert code examples into numerical vectors. Subsequently, we applied LSH to identify Approximate Nearest Neighbors (ANN). Our research involved the implementation of two variants of this approach, namely the Random Hyperplane-based LSH and the Query-Aware LSH. Our study compared two algorithms using four parameters: HitRate, Mean Reciprocal Rank (MRR), Average Execution Time, and Relevance. The results of our analysis revealed that the Query- Aware (QA) approach outperformed the Random Hyperplane-based (RH) approach in terms of HitRate. Specifically, the QA approach achieved a HitRate improvement of 20% to 35% for query pairs compared to the RH approach. Creating hashing tables and assigning data samples to buckets using the QA approach is at least four times faster than the RH approach. The QA approach returns code examples within milliseconds, while it takes several seconds (sec) for the RH approach to recommend code examples. ",
    "url": "https://arxiv.org/abs/2305.03017",
    "authors": [
      "Sajjad Rahmani",
      "AmirHossein Naghshzan",
      "Latifa Guerrouj"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.03049",
    "title": "NeuralEditor: Editing Neural Radiance Fields via Manipulating Point  Clouds",
    "abstract": "This paper proposes NeuralEditor that enables neural radiance fields (NeRFs) natively editable for general shape editing tasks. Despite their impressive results on novel-view synthesis, it remains a fundamental challenge for NeRFs to edit the shape of the scene. Our key insight is to exploit the explicit point cloud representation as the underlying structure to construct NeRFs, inspired by the intuitive interpretation of NeRF rendering as a process that projects or \"plots\" the associated 3D point cloud to a 2D image plane. To this end, NeuralEditor introduces a novel rendering scheme based on deterministic integration within K-D tree-guided density-adaptive voxels, which produces both high-quality rendering results and precise point clouds through optimization. NeuralEditor then performs shape editing via mapping associated points between point clouds. Extensive evaluation shows that NeuralEditor achieves state-of-the-art performance in both shape deformation and scene morphing tasks. Notably, NeuralEditor supports both zero-shot inference and further fine-tuning over the edited scene. Our code, benchmark, and demo video are available at https://immortalco.github.io/NeuralEditor. ",
    "url": "https://arxiv.org/abs/2305.03049",
    "authors": [
      "Jun-Kun Chen",
      "Jipeng Lyu",
      "Yu-Xiong Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.00735",
    "title": "xTrimoABFold: De novo Antibody Structure Prediction without MSA",
    "abstract": "In the field of antibody engineering, an essential task is to design a novel antibody whose paratopes bind to a specific antigen with correct epitopes. Understanding antibody structure and its paratope can facilitate a mechanistic understanding of its function. Therefore, antibody structure prediction from its sequence alone has always been a highly valuable problem for de novo antibody design. AlphaFold2, a breakthrough in the field of structural biology, provides a solution to predict protein structure based on protein sequences and computationally expensive coevolutionary multiple sequence alignments (MSAs). However, the computational efficiency and undesirable prediction accuracy of antibodies, especially on the complementarity-determining regions (CDRs) of antibodies limit their applications in the industrially high-throughput drug design. To learn an informative representation of antibodies, we employed a deep antibody language model (ALM) on curated sequences from the observed antibody space database via a transformer model. We also developed a novel model named xTrimoABFold to predict antibody structure from antibody sequence based on the pretrained ALM as well as efficient evoformers and structural modules. The model was trained end-to-end on the antibody structures in PDB by minimizing the ensemble loss of domain-specific focal loss on CDR and the frame-aligned point loss. xTrimoABFold outperforms AlphaFold2 and other protein language model based SOTAs, e.g., OmegaFold, HelixFold-Single, and IgFold with a large significant margin (30+\\% improvement on RMSD) while performing 151 times faster than AlphaFold2. To the best of our knowledge, xTrimoABFold achieved state-of-the-art antibody structure prediction. Its improvement in both accuracy and efficiency makes it a valuable tool for de novo antibody design and could make further improvements in immuno-theory. ",
    "url": "https://arxiv.org/abs/2212.00735",
    "authors": [
      "Yining Wang",
      "Xumeng Gong",
      "Shaochuan Li",
      "Bing Yang",
      "YiWu Sun",
      "Chuan Shi",
      "Yangang Wang",
      "Cheng Yang",
      "Hui Li",
      "Le Song"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02325",
    "title": "Sex Detection in the Early Stage of Fertilized Chicken Eggs via Image  Recognition",
    "abstract": "Culling newly hatched male chicks in industrial hatcheries poses a serious ethical problem. Both laying and broiler breeders need males, but it is a problem because they are produced more than needed. Being able to determine the sex of chicks in the egg at the beginning or early stage of incubation can eliminate ethical problems as well as many additional costs. When we look at the literature, the methods used are very costly, low in applicability, invasive, inadequate in accuracy, or too late to eliminate ethical problems. Considering the embryo's development, the earliest observed candidate feature for sex determination is blood vessels. Detection from blood vessels can eliminate ethical issues, and these vessels can be seen when light is shined into the egg until the first seven days. In this study, sex determination was made by morphological analysis from embryonic vascular images obtained in the first week when the light was shined into the egg using a standard camera without any invasive procedure to the egg. ",
    "url": "https://arxiv.org/abs/2305.02325",
    "authors": [
      "Ufuk Asil",
      "Efendi Nasibov"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2305.02334",
    "title": "Structures of Neural Network Effective Theories",
    "abstract": "We develop a diagrammatic approach to effective field theories (EFTs) corresponding to deep neural networks at initialization, which dramatically simplifies computations of finite-width corrections to neuron statistics. The structures of EFT calculations make it transparent that a single condition governs criticality of all connected correlators of neuron preactivations. Understanding of such EFTs may facilitate progress in both deep learning and field theory simulations. ",
    "url": "https://arxiv.org/abs/2305.02334",
    "authors": [
      "Ian Banta",
      "Tianji Cai",
      "Nathaniel Craig",
      "Zhengkang Zhang"
    ],
    "subjectives": [
      "High Energy Physics - Theory (hep-th)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)"
    ]
  },
  {
    "id": "arXiv:2305.02401",
    "title": "Synthetic DOmain-Targeted Augmentation (S-DOTA) Improves Model  Generalization in Digital Pathology",
    "abstract": "Machine learning algorithms have the potential to improve patient outcomes in digital pathology. However, generalization of these tools is currently limited by sensitivity to variations in tissue preparation, staining procedures and scanning equipment that lead to domain shift in digitized slides. To overcome this limitation and improve model generalization, we studied the effectiveness of two Synthetic DOmain-Targeted Augmentation (S-DOTA) methods, namely CycleGAN-enabled Scanner Transform (ST) and targeted Stain Vector Augmentation (SVA), and compared them against the International Color Consortium (ICC) profile-based color calibration (ICC Cal) method and a baseline method using traditional brightness, color and noise augmentations. We evaluated the ability of these techniques to improve model generalization to various tasks and settings: four models, two model types (tissue segmentation and cell classification), two loss functions, six labs, six scanners, and three indications (hepatocellular carcinoma (HCC), nonalcoholic steatohepatitis (NASH), prostate adenocarcinoma). We compared these methods based on the macro-averaged F1 scores on in-distribution (ID) and out-of-distribution (OOD) test sets across multiple domains, and found that S-DOTA methods (i.e., ST and SVA) led to significant improvements over ICC Cal and baseline on OOD data while maintaining comparable performance on ID data. Thus, we demonstrate that S-DOTA may help address generalization due to domain shift in real world applications. ",
    "url": "https://arxiv.org/abs/2305.02401",
    "authors": [
      "Sai Chowdary Gullapally",
      "Yibo Zhang",
      "Nitin Kumar Mittal",
      "Deeksha Kartik",
      "Sandhya Srinivasan",
      "Kevin Rose",
      "Daniel Shenker",
      "Dinkar Juyal",
      "Harshith Padigela",
      "Raymond Biju",
      "Victor Minden",
      "Chirag Maheshwari",
      "Marc Thibault",
      "Zvi Goldstein",
      "Luke Novak",
      "Nidhi Chandra",
      "Justin Lee",
      "Aaditya Prakash",
      "Chintan Shah",
      "John Abel",
      "Darren Fahy",
      "Amaro Taylor-Weiner",
      "Anand Sampat"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02414",
    "title": "The independence ratio of 4-cycle-free planar graphs",
    "abstract": "We prove that every $n$-vertex planar graph $G$ with no triangle sharing an edge with a 4-cycle has independence ratio $n/\\alpha(G) \\leq 4 - \\varepsilon$ for $\\varepsilon = 1/30$. This result implies that the same bound holds for 4-cycle-free planar graphs and planar graphs with no adjacent triangles and no triangle sharing an edge with a 5-cycle. For the latter case we strengthen the bound to $\\varepsilon = 2/9$. ",
    "url": "https://arxiv.org/abs/2305.02414",
    "authors": [
      "Tom Kelly",
      "Sid Kolichala",
      "Caleb McFarland",
      "Jatong Su"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2305.02422",
    "title": "GAMIVAL: Video Quality Prediction on Mobile Cloud Gaming Content",
    "abstract": "The mobile cloud gaming industry has been rapidly growing over the last decade. When streaming gaming videos are transmitted to customers' client devices from cloud servers, algorithms that can monitor distorted video quality without having any reference video available are desirable tools. However, creating No-Reference Video Quality Assessment (NR VQA) models that can accurately predict the quality of streaming gaming videos rendered by computer graphics engines is a challenging problem, since gaming content generally differs statistically from naturalistic videos, often lacks detail, and contains many smooth regions. Until recently, the problem has been further complicated by the lack of adequate subjective quality databases of mobile gaming content. We have created a new gaming-specific NR VQA model called the Gaming Video Quality Evaluator (GAMIVAL), which combines and leverages the advantages of spatial and temporal gaming distorted scene statistics models, a neural noise model, and deep semantic features. Using a support vector regression (SVR) as a regressor, GAMIVAL achieves superior performance on the new LIVE-Meta Mobile Cloud Gaming (LIVE-Meta MCG) video quality database. ",
    "url": "https://arxiv.org/abs/2305.02422",
    "authors": [
      "Yu-Chih Chen",
      "Avinab Saha",
      "Chase Davis",
      "Bo Qiu",
      "Xiaoming Wang",
      "Rahul~Gowda",
      "Ioannis~Katsavounidis",
      "Alan C. Bovik"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2305.02473",
    "title": "Semisupervised regression in latent structure networks on unknown  manifolds",
    "abstract": "Random graphs are increasingly becoming objects of interest for modeling networks in a wide range of applications. Latent position random graph models posit that each node is associated with a latent position vector, and that these vectors follow some geometric structure in the latent space. In this paper, we consider random dot product graphs, in which an edge is formed between two nodes with probability given by the inner product of their respective latent positions. We assume that the latent position vectors lie on an unknown one-dimensional curve and are coupled with a response covariate via a regression model. Using the geometry of the underlying latent position vectors, we propose a manifold learning and graph embedding technique to predict the response variable on out-of-sample nodes, and we establish convergence guarantees for these responses. Our theoretical results are supported by simulations and an application to Drosophila brain data. ",
    "url": "https://arxiv.org/abs/2305.02473",
    "authors": [
      "Aranyak Acharyya",
      "Joshua Agterberg",
      "Michael W. Trosset",
      "Youngser Park",
      "Carey E. Priebe"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02491",
    "title": "Self-Supervised Learning for Organs At Risk and Tumor Segmentation with  Uncertainty Quantification",
    "abstract": "In this study, our goal is to show the impact of self-supervised pre-training of transformers for organ at risk (OAR) and tumor segmentation as compared to costly fully-supervised learning. The proposed algorithm is called Monte Carlo Transformer based U-Net (MC-Swin-U). Unlike many other available models, our approach presents uncertainty quantification with Monte Carlo dropout strategy while generating its voxel-wise prediction. We test and validate the proposed model on both public and one private datasets and evaluate the gross tumor volume (GTV) as well as nearby risky organs' boundaries. We show that self-supervised pre-training approach improves the segmentation scores significantly while providing additional benefits for avoiding large-scale annotation costs. ",
    "url": "https://arxiv.org/abs/2305.02491",
    "authors": [
      "Ilkin Isler",
      "Debesh Jha",
      "Curtis Lisle",
      "Justin Rineer",
      "Patrick Kelly",
      "Bulent Aydogan",
      "Mohamed Abazeed",
      "Damla Turgut",
      "Ulas Bagci"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02573",
    "title": "Joint Graph Learning and Model Fitting in Laplacian Regularized  Stratified Models",
    "abstract": "Laplacian regularized stratified models (LRSM) are models that utilize the explicit or implicit network structure of the sub-problems as defined by the categorical features called strata (e.g., age, region, time, forecast horizon, etc.), and draw upon data from neighboring strata to enhance the parameter learning of each sub-problem. They have been widely applied in machine learning and signal processing problems, including but not limited to time series forecasting, representation learning, graph clustering, max-margin classification, and general few-shot learning. Nevertheless, existing works on LRSM have either assumed a known graph or are restricted to specific applications. In this paper, we start by showing the importance and sensitivity of graph weights in LRSM, and provably show that the sensitivity can be arbitrarily large when the parameter scales and sample sizes are heavily imbalanced across nodes. We then propose a generic approach to jointly learn the graph while fitting the model parameters by solving a single optimization problem. We interpret the proposed formulation from both a graph connectivity viewpoint and an end-to-end Bayesian perspective, and propose an efficient algorithm to solve the problem. Convergence guarantees of the proposed optimization algorithm is also provided despite the lack of global strongly smoothness of the Laplacian regularization term typically required in the existing literature, which may be of independent interest. Finally, we illustrate the efficiency of our approach compared to existing methods by various real-world numerical examples. ",
    "url": "https://arxiv.org/abs/2305.02573",
    "authors": [
      "Ziheng Cheng",
      "Junzi Zhang",
      "Akshay Agrawal",
      "Stephen Boyd"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2305.02622",
    "title": "Critical heat flux diagnosis using conditional generative adversarial  networks",
    "abstract": "The critical heat flux (CHF) is an essential safety boundary in boiling heat transfer processes employed in high heat flux thermal-hydraulic systems. Identifying CHF is vital for preventing equipment damage and ensuring overall system safety, yet it is challenging due to the complexity of the phenomena. For an in-depth understanding of the complicated phenomena, various methodologies have been devised, but the acquisition of high-resolution data is limited by the substantial resource consumption required. This study presents a data-driven, image-to-image translation method for reconstructing thermal data of a boiling system at CHF using conditional generative adversarial networks (cGANs). The supervised learning process relies on paired images, which include total reflection visualizations and infrared thermometry measurements obtained from flow boiling experiments. Our proposed approach has the potential to not only provide evidence connecting phase interface dynamics with thermal distribution but also to simplify the laborious and time-consuming experimental setup and data-reduction procedures associated with infrared thermal imaging, thereby providing an effective solution for CHF diagnosis. ",
    "url": "https://arxiv.org/abs/2305.02622",
    "authors": [
      "UngJin Na",
      "Moonhee Choi",
      "HangJin Jo"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02657",
    "title": "Statistical Optimality of Deep Wide Neural Networks",
    "abstract": "In this paper, we consider the generalization ability of deep wide feedforward ReLU neural networks defined on a bounded domain $\\mathcal X \\subset \\mathbb R^{d}$. We first demonstrate that the generalization ability of the neural network can be fully characterized by that of the corresponding deep neural tangent kernel (NTK) regression. We then investigate on the spectral properties of the deep NTK and show that the deep NTK is positive definite on $\\mathcal{X}$ and its eigenvalue decay rate is $(d+1)/d$. Thanks to the well established theories in kernel regression, we then conclude that multilayer wide neural networks trained by gradient descent with proper early stopping achieve the minimax rate, provided that the regression function lies in the reproducing kernel Hilbert space (RKHS) associated with the corresponding NTK. Finally, we illustrate that the overfitted multilayer wide neural networks can not generalize well on $\\mathbb S^{d}$. ",
    "url": "https://arxiv.org/abs/2305.02657",
    "authors": [
      "Yicheng Li",
      "Zixiong Yu",
      "Guhan Chen",
      "Qian Lin"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.02719",
    "title": "Using Spatio-Temporal Dual-Stream Network with Self-Supervised Learning  for Lung Tumor Classification on Radial Probe Endobronchial Ultrasound Video",
    "abstract": "The purpose of this study is to develop a computer-aided diagnosis system for classifying benign and malignant lung lesions, and to assist physicians in real-time analysis of radial probe endobronchial ultrasound (EBUS) videos. During the biopsy process of lung cancer, physicians use real-time ultrasound images to find suitable lesion locations for sampling. However, most of these images are difficult to classify and contain a lot of noise. Previous studies have employed 2D convolutional neural networks to effectively differentiate between benign and malignant lung lesions, but doctors still need to manually select good-quality images, which can result in additional labor costs. In addition, the 2D neural network has no ability to capture the temporal information of the ultrasound video, so it is difficult to obtain the relationship between the features of the continuous images. This study designs an automatic diagnosis system based on a 3D neural network, uses the SlowFast architecture as the backbone to fuse temporal and spatial features, and uses the SwAV method of contrastive learning to enhance the noise robustness of the model. The method we propose includes the following advantages, such as (1) using clinical ultrasound films as model input, thereby reducing the need for high-quality image selection by physicians, (2) high-accuracy classification of benign and malignant lung lesions can assist doctors in clinical diagnosis and reduce the time and risk of surgery, and (3) the capability to classify well even in the presence of significant image noise. The AUC, accuracy, precision, recall and specificity of our proposed method on the validation set reached 0.87, 83.87%, 86.96%, 90.91% and 66.67%, respectively. The results have verified the importance of incorporating temporal information and the effectiveness of using the method of contrastive learning on feature extraction. ",
    "url": "https://arxiv.org/abs/2305.02719",
    "authors": [
      "Ching-Kai Lin",
      "Chin-Wen Chen",
      "Yun-Chien Cheng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02735",
    "title": "Quasi-cyclic perfect codes in Doob graphs and special partitions of  Galois rings",
    "abstract": "The Galois ring GR$(4^\\Delta)$ is the residue ring $Z_4[x]/(h(x))$, where $h(x)$ is a basic primitive polynomial of degree $\\Delta$ over $Z_4$. For any odd $\\Delta$ larger than $1$, we construct a partition of GR$(4^\\Delta) \\backslash \\{0\\}$ into $6$-subsets of type $\\{a,b,-a-b,-a,-b,a+b\\}$ and $3$-subsets of type $\\{c,-c,2c\\}$ such that the partition is invariant under the multiplication by a nonzero element of the Teichmuller set in GR$(4^\\Delta)$ and, if $\\Delta$ is not a multiple of $3$, under the action of the automorphism group of GR$(4^\\Delta)$. As a corollary, this implies the existence of quasi-cyclic additive $1$-perfect codes of index $(2^\\Delta-1)$ in $D((2^\\Delta-1)(2^\\Delta-2)/{6}, 2^\\Delta-1 )$ where $D(m,n)$ is the Doob metric scheme on $Z^{2m+n}$. ",
    "url": "https://arxiv.org/abs/2305.02735",
    "authors": [
      "Minjia Shi",
      "Xiaoxiao Li",
      "Denis S. Krotov",
      "Ferruh Özbudak"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2305.02799",
    "title": "A Heterogeneous 6G Networked Sensing Architecture with Active and  Passive Anchors",
    "abstract": "In the future 6G integrated sensing and communication (ISAC) cellular systems, networked sensing is a promising technique that can leverage the cooperation among the base stations (BSs) to perform high-resolution localization. However, a dense deployment of BSs to fully reap the networked sensing gain is not a cost-efficient solution in practice. Motivated by the advance in the intelligent reflecting surface (IRS) technology for 6G communication, this paper examines the feasibility of deploying the low-cost IRSs to enhance the anchor density for networked sensing. Specifically, we propose a novel heterogeneous networked sensing architecture, which consists of both the active anchors, i.e., the BSs, and the passive anchors, i.e., the IRSs. Under this framework, the BSs emit the orthogonal frequency division multiplexing (OFDM) communication signals in the downlink for localizing the targets based on their echoes reflected via/not via the IRSs. However, there are two challenges for using passive anchors in localization. First, it is impossible to utilize the round-trip signal between a passive IRS and a passive target for estimating their distance. Second, before localizing a target, we do not know which IRS is closest to it and serves as its anchor. In this paper, we show that the distance between a target and its associated IRS can be indirectly estimated based on the length of the BS-target-BS path and the BS-target-IRS-BS path. Moreover, we propose an efficient data association method to match each target to its associated IRS. Numerical results are given to validate the feasibility and effectiveness of our proposed heterogeneous networked sensing architecture with both active and passive anchors. ",
    "url": "https://arxiv.org/abs/2305.02799",
    "authors": [
      "Qipeng Wang",
      "Liang Liu",
      "Shuowen Zhang",
      "Boya Di",
      "Francis C. M. Lau"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2004.09938",
    "title": "On the Parameterised Complexity of Induced Multipartite Graph Parameters",
    "abstract": " Comments: 8 pages, 0 figures ",
    "url": "https://arxiv.org/abs/2004.09938",
    "authors": [
      "Ryan L. Mann",
      "Luke Mathieson",
      "Catherine Greenhill"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2005.02151",
    "title": "Vertex Nomination in Richly Attributed Networks",
    "abstract": " Comments: 46 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2005.02151",
    "authors": [
      "Keith Levin",
      "Carey E. Priebe",
      "Vince Lyzinski"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2009.05266",
    "title": "GTEA: Inductive Representation Learning on Temporal Interaction Graphs  via Temporal Edge Aggregation",
    "abstract": " Comments: accepted by PAKDD2023 ",
    "url": "https://arxiv.org/abs/2009.05266",
    "authors": [
      "Siyue Xie",
      "Yiming Li",
      "Da Sun Handason Tam",
      "Xiaxin Liu",
      "Qiu Fang Ying",
      "Wing Cheong Lau",
      "Dah Ming Chiu",
      "Shou Zhi Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2102.13337",
    "title": "Neural Generalization of Multiple Kernel Learning",
    "abstract": " Title: Neural Generalization of Multiple Kernel Learning ",
    "url": "https://arxiv.org/abs/2102.13337",
    "authors": [
      "Ahmad Navid Ghanizadeh",
      "Kamaledin Ghiasi-Shirazi",
      "Reza Monsefi",
      "Mohammadreza Qaraei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.09371",
    "title": "Non-linear Functional Modeling using Neural Networks",
    "abstract": " Comments: 3 figures, 10 tables (including supplementary material), 14 pages (including supplementary material) ",
    "url": "https://arxiv.org/abs/2104.09371",
    "authors": [
      "Aniruddha Rajendra Rao",
      "Matthew Reimherr"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.08484",
    "title": "A Novel Evolutionary Algorithm for Hierarchical Neural Architecture  Search",
    "abstract": " Title: A Novel Evolutionary Algorithm for Hierarchical Neural Architecture  Search ",
    "url": "https://arxiv.org/abs/2107.08484",
    "authors": [
      "Aristeidis Christoforidis",
      "George Kyriakides",
      "Konstantinos Margaritis"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.03438",
    "title": "Influence Maximization in Social Networks: A Survey of Behaviour-Aware  Methods",
    "abstract": " Title: Influence Maximization in Social Networks: A Survey of Behaviour-Aware  Methods ",
    "url": "https://arxiv.org/abs/2108.03438",
    "authors": [
      "Ahmad Zareie",
      "Rizos Sakellariou"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2110.10048",
    "title": "Improving Tail-Class Representation with Centroid Contrastive Learning",
    "abstract": " Comments: Add in acknowledgment ",
    "url": "https://arxiv.org/abs/2110.10048",
    "authors": [
      "Anthony Meng Huat Tiong",
      "Junnan Li",
      "Guosheng Lin",
      "Boyang Li",
      "Caiming Xiong",
      "Steven C.H. Hoi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.00543",
    "title": "Deterministic Generation of Multipartite Entanglement via Causal  Activation in the Quantum Internet",
    "abstract": " Title: Deterministic Generation of Multipartite Entanglement via Causal  Activation in the Quantum Internet ",
    "url": "https://arxiv.org/abs/2112.00543",
    "authors": [
      "Seid Koudia",
      "Angela Sara Cacciapuoti",
      "Marcello Caleffi"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.02002",
    "title": "On discord in the voter model for complex networks",
    "abstract": " Comments: 7 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2203.02002",
    "authors": [
      "Antoine Vendeville",
      "Benjamin Guedj",
      "Shi Zhou"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2203.08133",
    "title": "Animatable Implicit Neural Representations for Creating Realistic  Avatars from Videos",
    "abstract": " Comments: Project page: this https URL arXiv admin note: substantial text overlap with arXiv:2105.02872 ",
    "url": "https://arxiv.org/abs/2203.08133",
    "authors": [
      "Sida Peng",
      "Zhen Xu",
      "Junting Dong",
      "Qianqian Wang",
      "Shangzhan Zhang",
      "Qing Shuai",
      "Hujun Bao",
      "Xiaowei Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.09063",
    "title": "Hierarchical Intention Tracking for Robust Human-Robot Collaboration in  Industrial Assembly Tasks",
    "abstract": " Comments: 8 pages, 6 figures. Accepted by ICRA 2023 ",
    "url": "https://arxiv.org/abs/2203.09063",
    "authors": [
      "Zhe Huang",
      "Ye-Ji Mun",
      "Xiang Li",
      "Yiqing Xie",
      "Ninghan Zhong",
      "Weihang Liang",
      "Junyi Geng",
      "Tan Chen",
      "Katherine Driggs-Campbell"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.11933",
    "title": "Cleanformer: A multichannel array configuration-invariant neural  enhancement frontend for ASR in smart speakers",
    "abstract": " Comments: Accepted to ICASSP 2023 ",
    "url": "https://arxiv.org/abs/2204.11933",
    "authors": [
      "Joseph Caroselli",
      "Arun Narayanan",
      "Nathan Howard",
      "Tom O'Malley"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2206.08368",
    "title": "Unbiased 4D: Monocular 4D Reconstruction with a Neural Deformation Model",
    "abstract": " Comments: 26 pages, 17 figures, 8 tables ",
    "url": "https://arxiv.org/abs/2206.08368",
    "authors": [
      "Erik C.M. Johnson",
      "Marc Habermann",
      "Soshi Shimada",
      "Vladislav Golyanik",
      "Christian Theobalt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.09097",
    "title": "Secure Embedding Aggregation for Federated Representation Learning",
    "abstract": " Title: Secure Embedding Aggregation for Federated Representation Learning ",
    "url": "https://arxiv.org/abs/2206.09097",
    "authors": [
      "Jiaxiang Tang",
      "Jinbao Zhu",
      "Songze Li",
      "Lichao Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2207.11871",
    "title": "Towards Complex Document Understanding By Discrete Reasoning",
    "abstract": " Comments: ACM MM 2022 ",
    "url": "https://arxiv.org/abs/2207.11871",
    "authors": [
      "Fengbin Zhu",
      "Wenqiang Lei",
      "Fuli Feng",
      "Chao Wang",
      "Haozhou Zhang",
      "Tat-Seng Chua"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.01979",
    "title": "Few-shot Incremental Event Detection",
    "abstract": " Comments: 20 pages, 9 figures, ",
    "url": "https://arxiv.org/abs/2209.01979",
    "authors": [
      "Hao Wang",
      "Hanwen Shi",
      "Jianyong Duan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.01448",
    "title": "Rhythmic Gesticulator: Rhythm-Aware Co-Speech Gesture Synthesis with  Hierarchical Neural Embeddings",
    "abstract": " Comments: SIGGRAPH Asia 2022 (Journal Track); Project Page: this https URL ",
    "url": "https://arxiv.org/abs/2210.01448",
    "authors": [
      "Tenglong Ao",
      "Qingzhe Gao",
      "Yuke Lou",
      "Baoquan Chen",
      "Libin Liu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2210.06478",
    "title": "Attention-Based Generative Neural Image Compression on Solar Dynamics  Observatory",
    "abstract": " Comments: Accepted to IEEE 21$^{st}$ International Conference on Machine Learning and Applications 2022 (ICMLA) - Selected for Oral Presentation ",
    "url": "https://arxiv.org/abs/2210.06478",
    "authors": [
      "Ali Zafari",
      "Atefeh Khoshkhahtinat",
      "Piyush M. Mehta",
      "Nasser M. Nasrabadi",
      "Barbara J. Thompson",
      "Daniel da Silva",
      "Michael S. F. Kirk"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Solar and Stellar Astrophysics (astro-ph.SR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.01723",
    "title": "Model-Checking for First-Order Logic with Disjoint Paths Predicates in  Proper Minor-Closed Graph Classes",
    "abstract": " Comments: An extended abstract of this paper appeared in the Proceedings of the 34th Annual ACM-SIAM Symposium on Discrete Algorithms (SODA 2023) ",
    "url": "https://arxiv.org/abs/2211.01723",
    "authors": [
      "Petr A. Golovach",
      "Giannos Stamoulis",
      "Dimitrios M. Thilikos"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2211.04154",
    "title": "Russian propaganda on social media during the 2022 invasion of Ukraine",
    "abstract": " Title: Russian propaganda on social media during the 2022 invasion of Ukraine ",
    "url": "https://arxiv.org/abs/2211.04154",
    "authors": [
      "Dominique Geissler",
      "Dominik Bär",
      "Nicolas Pröllochs",
      "Stefan Feuerriegel"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2211.07125",
    "title": "Global Performance Guarantees for Neural Network Models of AC Power Flow",
    "abstract": " Comments: Submitted to IEEE TNNLS ",
    "url": "https://arxiv.org/abs/2211.07125",
    "authors": [
      "Samuel Chevalier",
      "Spyros Chatzivasileiadis"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.16854",
    "title": "Resolving Prime Modules: The Structure of Pseudo-cographs and  Galled-Tree Explainable Graphs",
    "abstract": " Comments: 18 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2211.16854",
    "authors": [
      "Marc Hellmuth",
      "Guillaume E. Scholz"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2212.10355",
    "title": "Optimizing Serially Concatenated Neural Codes with Classical Decoders",
    "abstract": " Comments: WSA/SCC 23, 6 pages ",
    "url": "https://arxiv.org/abs/2212.10355",
    "authors": [
      "Jannis Clausius",
      "Marvin Geiselhart",
      "Stephan ten Brink"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08523",
    "title": "Side Contract Commitment Attacks on Blockchains",
    "abstract": " Comments: Preprint split in two ",
    "url": "https://arxiv.org/abs/2301.08523",
    "authors": [
      "Daji Landis",
      "Nikolaj I. Schwartzbach"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.03380",
    "title": "Phase Transitions in the Detection of Correlated Databases",
    "abstract": " Comments: 23 pages ",
    "url": "https://arxiv.org/abs/2302.03380",
    "authors": [
      "Dor Elimelech",
      "Wasim Huleihel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2302.08629",
    "title": "Physics-based parameterized neural ordinary differential equations:  prediction of laser ignition in a rocket combustor",
    "abstract": " Title: Physics-based parameterized neural ordinary differential equations:  prediction of laser ignition in a rocket combustor ",
    "url": "https://arxiv.org/abs/2302.08629",
    "authors": [
      "Yizhou Qian",
      "Jonathan Wang",
      "Quentin Douasbin",
      "Eric Darve"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.04201",
    "title": "DR-VIDAL -- Doubly Robust Variational Information-theoretic Deep  Adversarial Learning for Counterfactual Prediction and Treatment Effect  Estimation on Real World Data",
    "abstract": " Comments: AMIA Annual Symposium, 2022 (this https URL) ",
    "url": "https://arxiv.org/abs/2303.04201",
    "authors": [
      "Shantanu Ghosh",
      "Zheng Feng",
      "Jiang Bian",
      "Kevin Butler",
      "Mattia Prosperi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2303.09806",
    "title": "DexRepNet: Learning Dexterous Robotic Grasping Network with Geometric  and Spatial Hand-Object Representations",
    "abstract": " Comments: IROS2023(Under Review) ",
    "url": "https://arxiv.org/abs/2303.09806",
    "authors": [
      "Qingtao Liu",
      "Yu Cui",
      "Zhengnan Sun",
      "Haoming Li",
      "Gaofeng Li",
      "Lin Shao",
      "Jiming Chen",
      "Qi Ye"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.12743",
    "title": "DR.CPO: Diversified and Realistic 3D Augmentation via Iterative  Construction, Random Placement, and HPR Occlusion",
    "abstract": " Title: DR.CPO: Diversified and Realistic 3D Augmentation via Iterative  Construction, Random Placement, and HPR Occlusion ",
    "url": "https://arxiv.org/abs/2303.12743",
    "authors": [
      "Jungwook Shin",
      "Jaeill Kim",
      "Kyungeun Lee",
      "Hyunghun Cho",
      "Wonjong Rhee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.02199",
    "title": "Knowledge Combination to Learn Rotated Detection Without Rotated  Annotation",
    "abstract": " Comments: 10 pages, 5 figures, Accepted by CVPR 2023 ",
    "url": "https://arxiv.org/abs/2304.02199",
    "authors": [
      "Tianyu Zhu",
      "Bryce Ferenczi",
      "Pulak Purkait",
      "Tom Drummond",
      "Hamid Rezatofighi",
      "Anton van den Hengel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03996",
    "title": "A Unified Characterization of Private Learnability via Graph Theory",
    "abstract": " Comments: v1.1, typo fix ",
    "url": "https://arxiv.org/abs/2304.03996",
    "authors": [
      "Noga Alon",
      "Shay Moran",
      "Hilla Schefler",
      "Amir Yehudayoff"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.04099",
    "title": "Unsupervised Story Discovery from Continuous News Streams via Scalable  Thematic Embedding",
    "abstract": " Comments: Accepted by SIGIR'23 ",
    "url": "https://arxiv.org/abs/2304.04099",
    "authors": [
      "Susik Yoon",
      "Dongha Lee",
      "Yunyi Zhang",
      "Jiawei Han"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)",
      "Databases (cs.DB)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.07989",
    "title": "IMCDCF: An Incremental Malware Detection Approach Using Hidden Markov  Models",
    "abstract": " Title: IMCDCF: An Incremental Malware Detection Approach Using Hidden Markov  Models ",
    "url": "https://arxiv.org/abs/2304.07989",
    "authors": [
      "Ran Liu",
      "Charles Nicholas"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.09355",
    "title": "To Compress or Not to Compress- Self-Supervised Learning and Information  Theory: A Review",
    "abstract": " Title: To Compress or Not to Compress- Self-Supervised Learning and Information  Theory: A Review ",
    "url": "https://arxiv.org/abs/2304.09355",
    "authors": [
      "Ravid Shwartz-Ziv",
      "Yann LeCun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2304.11359",
    "title": "Detecting Adversarial Faces Using Only Real Face Self-Perturbations",
    "abstract": " Comments: IJCAI2023 ",
    "url": "https://arxiv.org/abs/2304.11359",
    "authors": [
      "Qian Wang",
      "Yongqin Xian",
      "Hefei Ling",
      "Jinyuan Zhang",
      "Xiaorui Lin",
      "Ping Li",
      "Jiazhong Chen",
      "Ning Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.11794",
    "title": "FineEHR: Refine Clinical Note Representations to Improve Mortality  Prediction",
    "abstract": " Comments: The 11th International Symposium on Digital Forensics and Security (Full Paper, Oral Presentation) ",
    "url": "https://arxiv.org/abs/2304.11794",
    "authors": [
      "Jun Wu",
      "Xuesong Ye",
      "Chengjie Mou",
      "Weinan Dai"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.14460",
    "title": "Gradient-based Maximally Interfered Retrieval for Domain Incremental 3D  Object Detection",
    "abstract": " Title: Gradient-based Maximally Interfered Retrieval for Domain Incremental 3D  Object Detection ",
    "url": "https://arxiv.org/abs/2304.14460",
    "authors": [
      "Barza Nisar",
      "Hruday Vishal Kanna Anand",
      "Steven L. Waslander"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.01290",
    "title": "A Direct Construction of Type-II $Z$ Complementary Code Set with  Arbitrarily Large Codes",
    "abstract": " Title: A Direct Construction of Type-II $Z$ Complementary Code Set with  Arbitrarily Large Codes ",
    "url": "https://arxiv.org/abs/2305.01290",
    "authors": [
      "Rajen Kumar",
      "Prashant Kumar Srivastava",
      "Sudhan Majhi"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2305.01666",
    "title": "BrainNPT: Pre-training of Transformer networks for brain network  classification",
    "abstract": " Comments: Prepared to Submit to TMI ",
    "url": "https://arxiv.org/abs/2305.01666",
    "authors": [
      "Jinlong Hu",
      "Yangmin Huang",
      "Nan Wang",
      "Shoubin Dong"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2305.01777",
    "title": "Representation Learning via Manifold Flattening and Reconstruction",
    "abstract": " Comments: 43 pages, 19 figures ",
    "url": "https://arxiv.org/abs/2305.01777",
    "authors": [
      "Michael Psenka",
      "Druv Pai",
      "Vishal Raman",
      "Shankar Sastry",
      "Yi Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Differential Geometry (math.DG)"
    ]
  },
  {
    "id": "arXiv:2305.01938",
    "title": "Doc2SoarGraph: Discrete Reasoning over Visually-Rich Table-Text  Documents with Semantic-Oriented Hierarchical Graphs",
    "abstract": " Title: Doc2SoarGraph: Discrete Reasoning over Visually-Rich Table-Text  Documents with Semantic-Oriented Hierarchical Graphs ",
    "url": "https://arxiv.org/abs/2305.01938",
    "authors": [
      "Fengbin Zhu",
      "Chao Wang",
      "Fuli Feng",
      "Zifeng Ren",
      "Moxin Li",
      "Tat-Seng Chua"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02154",
    "title": "Random Shreier graphs of the general linear group over finite fields and  expanders",
    "abstract": " Comments: 31 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2305.02154",
    "authors": [
      "Geoffroy Caillat-Grenier"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2305.02177",
    "title": "Transforming Visual Scene Graphs to Image Captions",
    "abstract": " Comments: 12 pages, 4 figures, has been accepted by ACL 2023 main conference ",
    "url": "https://arxiv.org/abs/2305.02177",
    "authors": [
      "Xu Yang",
      "Jiawei Peng",
      "Zihua Wang",
      "Haiyang Xu",
      "Qinghao Ye",
      "Chenliang Li",
      "Ming Yan",
      "Fei Huang",
      "Zhangzikang Li",
      "Yu Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]