[
  {
    "id": "arXiv:2109.03344",
    "title": "SoMIAP: Social media images analysis and prediction framework",
    "abstract": "The personal photos captured and submitted by users on social networks can provide several interesting insights about the location of the user, which is a key indicator of their daily activities. This information is invaluable for security organisations, especially for security monitoring and tracking criminal activities. Hence, we propose in this paper a novel approach for location prediction based on the image analysis of the photos posted on social media. Our approach combines two main methods to perform the image analysis, place and face recognition. The first method is used to determine the location area in the analysed image. The second is used to identify people in the analysed image, by locating a face in the image and comparing it with a dataset of images that have been collected from different social platforms. The effectiveness of the proposed approach is demonstrated through performance analysis and experimental results. ",
    "url": "https://arxiv.org/abs/2109.03344",
    "authors": [
      "Yonghao Shi",
      "Gueltoum Bendiab",
      "Stavros Shiaeles",
      "Nick Savage"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2109.03454",
    "title": "Signal-domain representation of symbolic music for learning embedding  spaces",
    "abstract": "A key aspect of machine learning models lies in their ability to learn efficient intermediate features. However, the input representation plays a crucial role in this process, and polyphonic musical scores remain a particularly complex type of information. In this paper, we introduce a novel representation of symbolic music data, which transforms a polyphonic score into a continuous signal. We evaluate the ability to learn meaningful features from this representation from a musical point of view. Hence, we introduce an evaluation method relying on principled generation of synthetic data. Finally, to test our proposed representation we conduct an extensive benchmark against recent polyphonic symbolic representations. We show that our signal-like representation leads to better reconstruction and disentangled features. This improvement is reflected in the metric properties and in the generation ability of the space learned from our signal-like representation according to music theory properties. ",
    "url": "https://arxiv.org/abs/2109.03454",
    "authors": [
      "Mathieu Prang",
      "Philippe Esling"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2109.03744",
    "title": "Approximately counting independent sets in bipartite graphs via graph  containers",
    "abstract": "By implementing algorithmic versions of Sapozhenko's graph container methods, we give new algorithms for approximating the number of independent sets in bipartite graphs. Our first algorithm applies to $d$-regular, bipartite graphs satisfying a weak expansion condition: when $d$ is constant, and the graph is a bipartite $\\Omega( \\log^2 d/d)$-expander, we obtain an FPTAS for the number of independent sets. Previously such a result for $d>5$ was known only for graphs satisfying the much stronger expansion conditions of random bipartite graphs. The algorithm also applies to weighted independent sets: for a $d$-regular, bipartite $\\alpha$-expander, with $\\alpha>0$ fixed, we give an FPTAS for the hard-core model partition function at fugacity $\\lambda=\\Omega(\\log d / d^{1/4})$. Finally we present an algorithm that applies to all $d$-regular, bipartite graphs, runs in time $\\exp\\left( O\\left( n \\cdot \\frac{ \\log^3 d }{d } \\right) \\right)$, and outputs a $(1 + o(1))$-approximation to the number of independent sets. ",
    "url": "https://arxiv.org/abs/2109.03744",
    "authors": [
      "Matthew Jenssen",
      "Will Perkins",
      "Aditya Potukuchi"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2109.03748",
    "title": "A robust approach for deep neural networks in presence of label noise:  relabelling and filtering instances during training",
    "abstract": "Deep learning has outperformed other machine learning algorithms in a variety of tasks, and as a result, it has become more and more popular and used. However, as other machine learning algorithms, deep learning, and convolutional neural networks (CNNs) in particular, perform worse when the data sets present label noise. Therefore, it is important to develop algorithms that help the training of deep networks and their generalization to noise-free test sets. In this paper, we propose a robust training strategy against label noise, called RAFNI, that can be used with any CNN. This algorithm filters and relabels instances of the training set based on the predictions and their probabilities made by the backbone neural network during the training process. That way, this algorithm improves the generalization ability of the CNN on its own. RAFNI consists of three mechanisms: two mechanisms that filter instances and one mechanism that relabels instances. In addition, it does not suppose that the noise rate is known nor does it need to be estimated. We evaluated our algorithm using different data sets of several sizes and characteristics. We also compared it with state-of-the-art models using the CIFAR10 and CIFAR100 benchmarks under different types and rates of label noise and found that RAFNI achieves better results in most cases. ",
    "url": "https://arxiv.org/abs/2109.03748",
    "authors": [
      "Anabel Gómez-Ríos",
      "Julián Luengo",
      "Francisco Herrera"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2109.03309",
    "title": "CRNNTL: convolutional recurrent neural network and transfer learning for  QSAR modelling",
    "abstract": "In this study, we propose the convolutional recurrent neural network and transfer learning (CRNNTL) for QSAR modelling. The method was inspired by the applications of polyphonic sound detection and electrocardiogram classification. Our strategy takes advantages of both convolutional and recurrent neural networks for feature extraction, as well as the data augmentation method. Herein, CRNNTL is evaluated on 20 benchmark datasets in comparison with baseline methods. In addition, one isomers based dataset is used to elucidate its ability for both local and global feature extraction. Then, knowledge transfer performance of CRNNTL is tested, especially for small biological activity datasets. Finally, different latent representations from other type of AEs were used for versatility study of our model. The results show the effectiveness of CRNNTL using different latent representation. Moreover, efficient knowledge transfer is achieved to overcome data scarcity considering binding site similarity between different targets. ",
    "url": "https://arxiv.org/abs/2109.03309",
    "authors": [
      "Yaqin Li",
      "Yongjin Xu",
      "Yi Yu"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.03351",
    "title": "Capturing the objects of vision with neural networks",
    "abstract": "Human visual perception carves a scene at its physical joints, decomposing the world into objects, which are selectively attended, tracked, and predicted as we engage our surroundings. Object representations emancipate perception from the sensory input, enabling us to keep in mind that which is out of sight and to use perceptual content as a basis for action and symbolic cognition. Human behavioral studies have documented how object representations emerge through grouping, amodal completion, proto-objects, and object files. Deep neural network (DNN) models of visual object recognition, by contrast, remain largely tethered to the sensory input, despite achieving human-level performance at labeling objects. Here, we review related work in both fields and examine how these fields can help each other. The cognitive literature provides a starting point for the development of new experimental tasks that reveal mechanisms of human object perception and serve as benchmarks driving development of deep neural network models that will put the object into object recognition. ",
    "url": "https://arxiv.org/abs/2109.03351",
    "authors": [
      "Benjamin Peters",
      "Nikolaus Kriegeskorte"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.03697",
    "title": "U-FNO -- an enhanced Fourier neural operator based-deep learning model  for multiphase flow",
    "abstract": "Numerical simulation of multiphase flow in porous media is essential for many geoscience applications. However, due to the multi-physics, non-linear, and multi-scale problem nature, these simulations are very expensive at desirable grid resolutions, and the computational cost often impedes rigorous engineering decision-making. Machine learning methods provide faster alternatives to traditional simulators by training neural network models with numerical simulation data mappings. Traditional convolutional neural network (CNN)-based models are accurate yet data-intensive and are prone to overfitting. Here we present a new architecture, U-FNO, an enhanced Fourier neural operator for solving the multiphase flow problem. The U-FNO is designed based on the Fourier neural operator (FNO) that learns an integral kernel in the Fourier space. Through a systematic comparison among a CNN benchmark and three types of FNO variations on a CO2-water multiphase problem in the context of CO2 geological storage, we show that the U-FNO architecture has the advantages of both traditional CNN and original FNO, providing significantly more accurate and efficient performance than previous architectures. The trained U-FNO provides gas saturation and pressure buildup predictions with a 10,000 times speedup compared to traditional numerical simulators while maintaining similar accuracy. ",
    "url": "https://arxiv.org/abs/2109.03697",
    "authors": [
      "Gege Wen",
      "Zongyi Li",
      "Kamyar Azizzadenesheli",
      "Anima Anandkumar",
      "Sally M. Benson"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2004.03010",
    "title": "The multi-objective optimisation of breakwaters using evolutionary  approach",
    "abstract": " Title: The multi-objective optimisation of breakwaters using evolutionary  approach ",
    "url": "https://arxiv.org/abs/2004.03010",
    "authors": [
      "Nikolay O. Nikitin",
      "Iana S. Polonskaia",
      "Anna V. Kalyuzhnaya",
      "Alexander V. Boukhanovsky"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2105.02526",
    "title": "Honeyboost: Boosting honeypot performance with data fusion and anomaly  detection",
    "abstract": " Comments: 26 pages ",
    "url": "https://arxiv.org/abs/2105.02526",
    "authors": [
      "Sevvandi Kandanaarachchi",
      "Hideya Ochiai",
      "Asha Rao"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Applications (stat.AP)"
    ]
  }
]