[
  {
    "id": "arXiv:2107.12547",
    "title": "Probing neural networks with t-SNE, class-specific projections and a  guided tour",
    "abstract": "We use graphical methods to probe neural nets that classify images. Plots of t-SNE outputs at successive layers in a network reveal increasingly organized arrangement of the data points. They can also reveal how a network can diminish or even forget about within-class structure as the data proceeds through layers. We use class-specific analogues of principal components to visualize how succeeding layers separate the classes. These allow us to sort images from a given class from most typical to least typical (in the data) and they also serve as very useful projection coordinates for data visualization. We find them especially useful when defining versions guided tours for animated data visualization. ",
    "url": "https://arxiv.org/abs/2107.12547",
    "authors": [
      "Christopher R. Hoyt",
      "Art B. Owen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.12580",
    "title": "Pointer Value Retrieval: A new benchmark for understanding the limits of  neural network generalization",
    "abstract": "The successes of deep learning critically rely on the ability of neural networks to output meaningful predictions on unseen data -- generalization. Yet despite its criticality, there remain fundamental open questions on how neural networks generalize. How much do neural networks rely on memorization -- seeing highly similar training examples -- and how much are they capable of human-intelligence styled reasoning -- identifying abstract rules underlying the data? In this paper we introduce a novel benchmark, Pointer Value Retrieval (PVR) tasks, that explore the limits of neural network generalization. While PVR tasks can consist of visual as well as symbolic inputs, each with varying levels of difficulty, they all have a simple underlying rule. One part of the PVR task input acts as a pointer, giving the location of a different part of the input, which forms the value (and output). We demonstrate that this task structure provides a rich testbed for understanding generalization, with our empirical study showing large variations in neural network performance based on dataset size, task complexity and model architecture. The interaction of position, values and the pointer rule also allow the development of nuanced tests of generalization, by introducing distribution shift and increasing functional complexity. These reveal both subtle failures and surprising successes, suggesting many promising directions of exploration on this benchmark. ",
    "url": "https://arxiv.org/abs/2107.12580",
    "authors": [
      "Chiyuan Zhang",
      "Maithra Raghu",
      "Jon Kleinberg",
      "Samy Bengio"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.12592",
    "title": "Detection of cybersecurity attacks through analysis of web browsing  activities using principal component analysis",
    "abstract": "Organizations such as government departments and financial institutions provide online service facilities accessible via an increasing number of internet connected devices which make their operational environment vulnerable to cyber attacks. Consequently, there is a need to have mechanisms in place to detect cyber security attacks in a timely manner. A variety of Network Intrusion Detection Systems (NIDS) have been proposed and can be categorized into signature-based NIDS and anomaly-based NIDS. The signature-based NIDS, which identify the misuse through scanning the activity signature against the list of known attack activities, are criticized for their inability to identify new attacks (never-before-seen attacks). Among anomaly-based NIDS, which declare a connection anomalous if it expresses deviation from a trained model, the unsupervised learning algorithms circumvent this issue since they have the ability to identify new attacks. In this study, we use an unsupervised learning algorithm based on principal component analysis to detect cyber attacks. In the training phase, our approach has the advantage of also identifying outliers in the training dataset. In the monitoring phase, our approach first identifies the affected dimensions and then calculates an anomaly score by aggregating across only those components that are affected by the anomalies. We explore the performance of the algorithm via simulations and through two applications, namely to the UNSW-NB15 dataset recently released by the Australian Centre for Cyber Security and to the well-known KDD'99 dataset. The algorithm is scalable to large datasets in both training and monitoring phases, and the results from both the simulated and real datasets show that the method has promise in detecting suspicious network activities. ",
    "url": "https://arxiv.org/abs/2107.12592",
    "authors": [
      "Insha Ullah",
      "Kerrie Mengersen",
      "Rob J Hyndman",
      "James McGree"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2107.12740",
    "title": "Edge service resource allocation strategy based on intelligent  prediction",
    "abstract": "Artificial intelligence is one of the important technologies for industrial applications, but it requires a lot of computing resources and sensor data to support it. With the development of edge computing and the Internet of Things, artificial intelligence are playing an increasingly important role in the field of edge services. Therefore, how to make intelligent algorithms provide better services and the development of the Internet of Things has become an increasingly important topic. This paper focuses on the application of edge service distribution strategy, and proposes an edge service distribution strategy based on intelligent prediction, which reduces the bandwidth consumption of edge service providers and minimizes the cost of edge service providers. In addition, this article uses the real data provided by the Wangsu Technology Company and an improved long and short term memory prediction method to dynamically change the bandwidth, and achieves better optimization of resources allocation comparing with actual industrial applications.The simulation results show that our intelligent prediction can achieve good results, and the mechanism can achieve higher resource utilization. ",
    "url": "https://arxiv.org/abs/2107.12740",
    "authors": [
      "Yujie Wamg",
      "Xin Du",
      "Xuzhao Chen",
      "Zhihui Lu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2107.12778",
    "title": "Assessing the performance of smart grid communication networks under  both time and budget constraints",
    "abstract": "The smart grid concept has emerged to address the existing problems in the traditional electric grid, which has been functioning for more than a hundred years. The most crucial difference between traditional grids and smart grids is the communication infrastructure applied to the latter. However, coupling between these networks can increase the risk of significant failures. Hence, assessing the performance of the smart grid communication networks is of great importance and thus is considered here. As transmission time and cost play essential roles in many real-world communication networks, both time and budget constraints are considered in this work. To evaluate the performance of communication networks, we assume that the data is transmitted from a source to a destination through a single path. We propose an algorithm that computes the exact probability of transmitting d units of data from the source to the destination within T units of time and the budget of b. The algorithm is illustrated through a benchmark network example. The complexity results are also provided. A rather large-size benchmark, that is, Pan European topology, along with one thousand randomly generated test problems are used to generate the experimental results which show clearly the superiority of our proposed algorithms to some existing algorithm in the literature. ",
    "url": "https://arxiv.org/abs/2107.12778",
    "authors": [
      "Majid Forghani-elahabad"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2107.12977",
    "title": "The social dilemma in AI development and why we have to solve it",
    "abstract": "While the demand for ethical artificial intelligence (AI) systems increases, the number of unethical uses of AI accelerates, even though there is no shortage of ethical guidelines. We argue that a main underlying cause for this is that AI developers face a social dilemma in AI development ethics, preventing the widespread adaptation of ethical best practices. We define the social dilemma for AI development and describe why the current crisis in AI development ethics cannot be solved without relieving AI developers of their social dilemma. We argue that AI development must be professionalised to overcome the social dilemma, and discuss how medicine can be used as a template in this process. ",
    "url": "https://arxiv.org/abs/2107.12977",
    "authors": [
      "Inga Strümke",
      "Marija Slavkovik",
      "Vince I. Madai"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.12395",
    "title": "Constraining dark matter annihilation with cosmic ray antiprotons using  neural networks",
    "abstract": "The interpretation of data from indirect detection experiments searching for dark matter annihilations requires computationally expensive simulations of cosmic-ray propagation. In this work we present a new method based on Recurrent Neural Networks that significantly accelerates simulations of secondary and dark matter Galactic cosmic ray antiprotons while achieving excellent accuracy. This approach allows for an efficient profiling or marginalisation over the nuisance parameters of a cosmic ray propagation model in order to perform parameter scans for a wide range of dark matter models. We identify importance sampling as particularly suitable for ensuring that the network is only evaluated in well-trained parameter regions. We present resulting constraints using the most recent AMS-02 antiproton data on several models of Weakly Interacting Massive Particles. The fully trained networks are released as DarkRayNet together with this work and achieve a speed-up of the runtime by at least two orders of magnitude compared to conventional approaches. ",
    "url": "https://arxiv.org/abs/2107.12395",
    "authors": [
      "Felix Kahlhoefer",
      "Michael Korsmeier",
      "Michael Krämer",
      "Silvia Manconi",
      "Kathrin Nippel"
    ],
    "subjectives": [
      "High Energy Astrophysical Phenomena (astro-ph.HE)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)"
    ]
  },
  {
    "id": "arXiv:2107.12695",
    "title": "Orientations and matrix function-based centralities in multiplex network  analysis of urban public transport",
    "abstract": "We study urban public transport systems by means of multiplex networks in which stops are represented as nodes and each line is represented by a layer. We determine and visualize public transport network orientations and compare them with street network orientations of the $36$ largest German as well as $18$ selected major European cities. We find that German urban public transport networks are mainly oriented in a direction close to the cardinal east-west axis, which usually coincides with one of two orthogonal preferential directions of the corresponding street network. While this behavior is present in only a subset of the considered European cities it remains true that none but one considered public transport network has a distinct north-south-like preferential orientation. Furthermore, we study the applicability of the class of matrix function-based centrality measures, which has recently been generalized from single-layer networks to layer-coupled multiplex networks, to our more general urban multiplex framework. Numerical experiments based on highly efficient and scalable methods from numerical linear algebra show promising results, which are in line with previous studies. We comment on advantages over existing methodology, elaborate on the comparison of different measures and weight models, and present detailed hyper-parameter studies. All results are illustrated by demonstrative graphical representations. ",
    "url": "https://arxiv.org/abs/2107.12695",
    "authors": [
      "Kai Bergermann",
      "Martin Stoll"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2107.12970",
    "title": "A Data-driven feature selection and machine-learning model benchmark for  the prediction of longitudinal dispersion coefficient",
    "abstract": "Longitudinal Dispersion(LD) is the dominant process of scalar transport in natural streams. An accurate prediction on LD coefficient(Dl) can produce a performance leap in related simulation. The emerging machine learning(ML) techniques provide a self-adaptive tool for this problem. However, most of the existing studies utilize an unproved quaternion feature set, obtained through simple theoretical deduction. Few studies have put attention on its reliability and rationality. Besides, due to the lack of comparative comparison, the proper choice of ML models in different scenarios still remains unknown. In this study, the Feature Gradient selector was first adopted to distill the local optimal feature sets directly from multivariable data. Then, a global optimal feature set (the channel width, the flow velocity, the channel slope and the cross sectional area) was proposed through numerical comparison of the distilled local optimums in performance with representative ML models. The channel slope is identified to be the key parameter for the prediction of LDC. Further, we designed a weighted evaluation metric which enables comprehensive model comparison. With the simple linear model as the baseline, a benchmark of single and ensemble learning models was provided. Advantages and disadvantages of the methods involved were also discussed. Results show that the support vector machine has significantly better performance than other models. Decision tree is not suitable for this problem due to poor generalization ability. Notably, simple models show superiority over complicated model on this low-dimensional problem, for their better balance between regression and generalization. ",
    "url": "https://arxiv.org/abs/2107.12970",
    "authors": [
      "Yifeng Zhao",
      "Pei Zhang",
      "S.A. Galindo-Torres",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.12974",
    "title": "Practical quantum multiparty signatures using quantum key distribution  networks",
    "abstract": "Digital signatures are widely used for providing security of communications. At the same time, the security of currently deployed digital signature protocols is based on unproven computational assumptions. An efficient way to ensure an unconditional (information-theoretic) security of communication is to use quantum key distribution (QKD), whose security is based on laws of quantum mechanics. In this work, we develop an unconditionally secure signatures (USS) scheme that guarantees authenticity and transferability of arbitrary length messages in a QKD network. In the proposed setup, the QKD network consists of two subnetworks: (i) the internal network that includes the signer and with limitation on the number of malicious nodes, and (ii) the external one that has no assumptions on the number of malicious nodes. A price of the absence of the trust assumption in the external subnetwork is a necessity of the assistance from internal subnetwork recipients for the verification of message-signature pairs by external subnetwork recipients. We provide a comprehensive security analysis of the developed scheme, perform an optimization of the scheme parameters with respect to the secret key consumption, and demonstrate that the developed scheme is compatible with the capabilities of currently available QKD devices. ",
    "url": "https://arxiv.org/abs/2107.12974",
    "authors": [
      "E.O. Kiktenko",
      "A.S. Zelenetsky",
      "A.K. Fedorov"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2007.00410",
    "title": "A time adaptive multirate Dirichlet-Neumann waveform relaxation method  for heterogeneous coupled heat equations",
    "abstract": " Title: A time adaptive multirate Dirichlet-Neumann waveform relaxation method  for heterogeneous coupled heat equations ",
    "url": "https://arxiv.org/abs/2007.00410",
    "authors": [
      "Peter Meisrimel",
      "Azahar Monge",
      "Philipp Birken"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2009.03575",
    "title": "NC-MOPSO: Network centrality guided multi-objective particle swarm  optimization for transport optimization on networks",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2009.03575",
    "authors": [
      "Jiexin Wu",
      "Cunlai Pu",
      "Shuxin Ding",
      "Guo Cao",
      "Panos M. Pardalos"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2011.12423",
    "title": "Stochastic sparse adversarial attacks",
    "abstract": " Comments: The link to the codes is given: this https URL ",
    "url": "https://arxiv.org/abs/2011.12423",
    "authors": [
      "Manon Césaire",
      "Hatem Hajri",
      "Sylvain Lamprier",
      "Patrick Gallinari"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2012.12972",
    "title": "A triangle process on regular graphs",
    "abstract": " Comments: 19 pages, 17 figures ",
    "url": "https://arxiv.org/abs/2012.12972",
    "authors": [
      "Colin Cooper",
      "Martin Dyer",
      "Catherine Greenhill"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2102.00473",
    "title": "Information fusion between knowledge and data in Bayesian network  structure learning",
    "abstract": " Title: Information fusion between knowledge and data in Bayesian network  structure learning ",
    "url": "https://arxiv.org/abs/2102.00473",
    "authors": [
      "Anthony C. Constantinou",
      "Zhigao Guo",
      "Neville K. Kitson"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.12827",
    "title": "Learning-based decentralized offloading decision making in an  adversarial environment",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2104.12827",
    "authors": [
      "Byungjin Cho",
      "Yu Xiao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2107.11403",
    "title": "A principled (and practical) test for network comparison",
    "abstract": " Title: A principled (and practical) test for network comparison ",
    "url": "https://arxiv.org/abs/2107.11403",
    "authors": [
      "Gecia Bravo-Hermsdorff",
      "Lee M. Gunderson",
      "Pierre-André Maugis",
      "Carey E. Priebe"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Discrete Mathematics (cs.DM)",
      "Statistics Theory (math.ST)"
    ]
  }
]