[
  {
    "id": "arXiv:2108.04907",
    "title": "Flow-based SVDD for anomaly detection",
    "abstract": "We propose FlowSVDD -- a flow-based one-class classifier for anomaly/outliers detection that realizes a well-known SVDD principle using deep learning tools. Contrary to other approaches to deep SVDD, the proposed model is instantiated using flow-based models, which naturally prevents from collapsing of bounding hypersphere into a single point. Experiments show that FlowSVDD achieves comparable results to the current state-of-the-art methods and significantly outperforms related deep SVDD methods on benchmark datasets. ",
    "url": "https://arxiv.org/abs/2108.04907",
    "authors": [
      "Marcin Sendera",
      "Marek Śmieja",
      "Łukasz Maziarka",
      "Łukasz Struski",
      "Przemysław Spurek",
      "Jacek Tabor"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.04921",
    "title": "How near-duplicate detection improves editors' and authors' publishing  experience",
    "abstract": "We describe a system that helps identify manuscripts submitted to multiple journals at the same time. Also, we discuss potential applications of the near-duplicate detection technology when run with manuscript text content, including identification of simultaneous submissions, prevention of duplicate published articles, and improving article transfer service. ",
    "url": "https://arxiv.org/abs/2108.04921",
    "authors": [
      "Yury Kashnitsky",
      "Vaishnavi Kandala",
      "Egbert van Wezenbeek",
      "IJsbrand Jan Aalbersberg",
      "Catriona Fennell",
      "Georgios Tsatsaronis"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)"
    ]
  },
  {
    "id": "arXiv:2108.04979",
    "title": "Simple black-box universal adversarial attacks on medical image  classification based on deep neural networks",
    "abstract": "Universal adversarial attacks, which hinder most deep neural network (DNN) tasks using only a small single perturbation called a universal adversarial perturbation (UAP), is a realistic security threat to the practical application of a DNN. In particular, such attacks cause serious problems in medical imaging. Given that computer-based systems are generally operated under a black-box condition in which only queries on inputs are allowed and outputs are accessible, the impact of UAPs seems to be limited because well-used algorithms for generating UAPs are limited to a white-box condition in which adversaries can access the model weights and loss gradients. Nevertheless, we demonstrate that UAPs are easily generatable using a relatively small dataset under black-box conditions. In particular, we propose a method for generating UAPs using a simple hill-climbing search based only on DNN outputs and demonstrate the validity of the proposed method using representative DNN-based medical image classifications. Black-box UAPs can be used to conduct both non-targeted and targeted attacks. Overall, the black-box UAPs showed high attack success rates (40% to 90%), although some of them had relatively low success rates because the method only utilizes limited information to generate UAPs. The vulnerability of black-box UAPs was observed in several model architectures. The results indicate that adversaries can also generate UAPs through a simple procedure under the black-box condition to foil or control DNN-based medical image diagnoses, and that UAPs are a more realistic security threat. ",
    "url": "https://arxiv.org/abs/2108.04979",
    "authors": [
      "Kazuki Koga",
      "Kazuhiro Takemoto"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.05020",
    "title": "Frequency-based tension assessment of an inclined cable with complex  boundary conditions using the PSO algorithm",
    "abstract": "The frequency-based method is the most commonly used method for measuring cable tension. However, the calculation formulas for the conventional frequency-based method are generally based on the ideally hinged or fixed boundary conditions without a comprehensive consideration of the inclination angle, sag-extensibility, and flexural stiffness of cables, leading to a significant error in cable tension identification. This study aimed to propose a frequency-based method of cable tension identification considering the complex boundary conditions at the two ends of cables using the particle swarm optimization (PSO) algorithm. First, the refined stay cable model was established considering the inclination angle, flexural stiffness, and sag-extensibility, as well as the rotational constraint stiffness and lateral support stiffness for the unknown boundaries of cables. The vibration mode equation of the stay cable model was discretized and solved using the finite difference method. Then, a multiparameter identification method based on the PSO algorithm was proposed. This method was able to identify the tension, flexural stiffness, axial stiffness, boundary rotational constraint stiffness, and boundary lateral support stiffness according to the measured multiorder frequencies in a synchronous manner. The feasibility and accuracy of this method were validated through numerical cases. Finally, the proposed approach was applied to the tension identification of the anchor span strands of a suspension bridge (Jindong Bridge) in China. The results of cable tension identification using the proposed method and the existing methods discussed in previous studies were compared with the on-site pressure ring measurement results. The comparison showed that the proposed approach had a high accuracy in cable tension identification. ",
    "url": "https://arxiv.org/abs/2108.05020",
    "authors": [
      "Wen-ming Zhang",
      "Zhi-wei Wang",
      "Dan-dian Feng",
      "Zhao Liu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2108.05038",
    "title": "Parallel algorithms for mining of frequent itemsets",
    "abstract": "In the recent decade companies started collecting of large amount of data. Without a proper analyse, the data are usually useless. The field of analysing the data is called data mining. Unfortunately, the amount of data is quite large: the data do not fit into main memory and the processing time can become quite huge. Therefore, we need parallel data mining algorithms. One of the popular and important data mining algorithm is the algorithm for generation of so called frequent itemsets. The problem of mining of frequent itemsets can be explained on the following example: customers goes in a store put into theirs baskets some goods; the owner of the store collects the baskets and wants to know the set of goods that are bought together in at least p% of the baskets. Currently, the sequential algorithms for mining of frequent itemsets are quite good in the means of performance. However, the parallel algorithms for mining of frequent itemsets still do not achieve good speedup. In this thesis, we develop a parallel method for mining of frequent itemsets that can be used for an arbitrary depth first search sequential algorithms on a distributed memory parallel computer. Our method achieves speedup of ~ 6 on 10 processors. The method is based on an approximate estimation of processor load from a database sample - however it always computes the set of frequent itemsets from the whole database. In this thesis, we show a theory underlying our method and show the performance of the estimation process. ",
    "url": "https://arxiv.org/abs/2108.05038",
    "authors": [
      "Robert Kessl"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.05230",
    "title": "A novel method for robust and efficient prediction of ice shedding from  rotorcraft blades",
    "abstract": "The safety of rotorcraft operating in cold environments is jeopardised by the possibility of ice accretion on the rotor blades. Eventually, ice can shed from the blade due to the high centrifugal forces and impact other parts of the rotorcraft or unbalance the rotor. To establish the shedding time and location for rotorcraft, a robust and efficent numerical multi-step icing simulations tool is presented here for predicting the shedding phenomenon. A volume-mesh based approach is used to allow for representing the ice shape. In order to increase the robustness of the method, an interpolation procedure is implemented which establishes the possible occurrence of the shedding event and restricts the search domain. Ice shapes along the blades are computed by means of two-dimensional ice accretion simulations: ice shapes are then interpolated over the blade span. Numerical results compares fairly well, in terms of shedding time and location, to the experimental ones obtained in the AERTS test facility, thus demonstrating the soundness of the present approach. ",
    "url": "https://arxiv.org/abs/2108.05230",
    "authors": [
      "Andrea Rausa",
      "Myles Morelli",
      "Alberto Guardone"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2108.05318",
    "title": "Composing games into complex institutions",
    "abstract": "Game theory is used by all behavioral sciences, but its development has long centered around tools for relatively simple games and toy systems, such as the economic interpretation of equilibrium outcomes. Our contribution, compositional game theory, permits another approach of equally general appeal: the high-level design of large games for expressing complex architectures and representing real-world institutions faithfully. Compositional game theory, grounded in the mathematics underlying programming languages, and introduced here as a general computational framework, increases the parsimony of game representations with abstraction and modularity, accelerates search and design, and helps theorists across disciplines express real-world institutional complexity in well-defined ways. ",
    "url": "https://arxiv.org/abs/2108.05318",
    "authors": [
      "Seth Frey",
      "Jules Hedges",
      "Joshua Tan",
      "Philipp Zahn"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2108.04819",
    "title": "Quantifying power use in silicon photonic neural networks",
    "abstract": "Due to challenging efficiency limits facing conventional and unconventional electronic architectures, information processors based on photonics have attracted renewed interest. Research communities have yet to settle on definitive techniques to describe the performance of this class of information processors. Photonic systems are different from electronic ones, so the existing concepts of computer performance measurement cannot necessarily apply. In this manuscript, we attempt to quantify the power use of photonic neural networks with state-of-the-art and future hardware. We derive scaling laws, physical limits, and new platform performance metrics. We find that overall performance is regime-like, which means that energy efficiency characteristics of a photonic processor can be completely described by no less than seven performance numbers. The introduction of these analytical strategies provides a much needed foundation for quantitative roadmapping and commercial value assignment for silicon photonic neural networks. ",
    "url": "https://arxiv.org/abs/2108.04819",
    "authors": [
      "Alexander N. Tait"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2108.04964",
    "title": "Linear approximability of two-layer neural networks: A comprehensive  analysis based on spectral decay",
    "abstract": "In this paper, we present a spectral-based approach to study the linear approximation of two-layer neural networks. We first consider the case of single neuron and show that the linear approximability, quantified by the Kolmogorov width, is controlled by the eigenvalue decay of an associate kernel. Then, we show that similar results also hold for two-layer neural networks. This spectral-based approach allows us to obtain upper bounds, lower bounds, and explicit hard examples in a united manner. In particular, these bounds imply that for networks activated by smooth functions, restricting the norms of inner-layer weights may significantly impair the expressiveness. By contrast, for non-smooth activation functions, such as ReLU, the network expressiveness is independent of the inner-layer weight norms. In addition, we prove that for a family of non-smooth activation functions, including ReLU, approximating any single neuron with random features suffers from the \\emph{curse of dimensionality}. This provides an explicit separation of expressiveness between neural networks and random feature models. ",
    "url": "https://arxiv.org/abs/2108.04964",
    "authors": [
      "Jihao Long",
      "Lei Wu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1910.06539",
    "title": "Challenges in Markov chain Monte Carlo for Bayesian neural networks",
    "abstract": " Title: Challenges in Markov chain Monte Carlo for Bayesian neural networks ",
    "url": "https://arxiv.org/abs/1910.06539",
    "authors": [
      "Theodore Papamarkou",
      "Jacob Hinkle",
      "M. Todd Young",
      "David Womble"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2007.12141",
    "title": "Dimension reduction in recurrent networks by canonicalization",
    "abstract": " Comments: 31 pages ",
    "url": "https://arxiv.org/abs/2007.12141",
    "authors": [
      "Lyudmila Grigoryeva",
      "Juan-Pablo Ortega"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2104.06752",
    "title": "Influence of individual nodes for continuous-time  Susceptible-Infected-Susceptible dynamics on synthetic and real-world  networks",
    "abstract": " Comments: 13 pages, 22 figures, final version ",
    "url": "https://arxiv.org/abs/2104.06752",
    "authors": [
      "Alfredo De Bellis",
      "Romualdo Pastor-Satorras",
      "Claudio Castellano"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Social and Information Networks (cs.SI)"
    ]
  }
]