[
  {
    "id": "arXiv:2205.02232",
    "title": "Minimum Cost Intervention Design for Causal Effect Identification",
    "abstract": "Pearl's do calculus is a complete axiomatic approach to learn the identifiable causal effects from observational data. When such an effect is not identifiable, it is necessary to perform a collection of often costly interventions in the system to learn the causal effect. In this work, we consider the problem of designing the collection of interventions with the minimum cost to identify the desired effect. First, we prove that this problem is NP-hard, and subsequently propose an algorithm that can either find the optimal solution or a logarithmic-factor approximation of it. This is done by establishing a connection between our problem and the minimum hitting set problem. Additionally, we propose several polynomial-time heuristic algorithms to tackle the computational complexity of the problem. Although these algorithms could potentially stumble on sub-optimal solutions, our simulations show that they achieve small regrets on random graphs. ",
    "url": "https://arxiv.org/abs/2205.02232",
    "authors": [
      "Sina Akbari",
      "Jalal Etesami",
      "Negar Kiyavash"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2205.02270",
    "title": "VWA: Hardware Efficient Vectorwise Accelerator for Convolutional Neural  Network",
    "abstract": "Hardware accelerators for convolution neural networks (CNNs) enable real-time applications of artificial intelligence technology. However, most of the existing designs suffer from low hardware utilization or high area cost due to complex dataflow. This paper proposes a hardware efficient vectorwise CNN accelerator that adopts a 3$\\times$3 filter optimized systolic array using 1-D broadcast dataflow to generate partial sum. This enables easy reconfiguration for different kinds of kernels with interleaved input or elementwise input dataflow. This simple and regular data flow results in low area cost while attains high hardware utilization. The presented design achieves 99\\%, 97\\%, 93.7\\%, 94\\% hardware utilization for VGG-16, ResNet-34, GoogLeNet, and Mobilenet, respectively. Hardware implementation with TSMC 40nm technology takes 266.9K NAND gate count and 191KB SRAM to support 168GOPS throughput and consumes only 154.98mW when running at 500MHz operating frequency, which has superior area and power efficiency than other designs. ",
    "url": "https://arxiv.org/abs/2205.02270",
    "authors": [
      "Kuo-Wei Chang",
      "Tian-Sheuan Chang"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2205.02271",
    "title": "VSCNN: Convolution Neural Network Accelerator With Vector Sparsity",
    "abstract": "Hardware accelerator for convolution neural network (CNNs) enables real time applications of artificial intelligence technology. However, most of the accelerators only support dense CNN computations or suffers complex control to support fine grained sparse networks. To solve above problem, this paper presents an efficient CNN accelerator with 1-D vector broadcasted input to support both dense network as well as vector sparse network with the same hardware and low overhead. The presented design achieves 1.93X speedup over the dense CNN computations. ",
    "url": "https://arxiv.org/abs/2205.02271",
    "authors": [
      "Kuo-Wei Chang",
      "Tian-Sheuan Chang"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2205.02293",
    "title": "Original or Translated? A Causal Analysis of the Impact of  Translationese on Machine Translation Performance",
    "abstract": "Human-translated text displays distinct features from naturally written text in the same language. This phenomena, known as translationese, has been argued to confound the machine translation (MT) evaluation. Yet, we find that existing work on translationese neglects some important factors and the conclusions are mostly correlational but not causal. In this work, we collect CausalMT, a dataset where the MT training data are also labeled with the human translation directions. We inspect two critical factors, the train-test direction match (whether the human translation directions in the training and test sets are aligned), and data-model direction match (whether the model learns in the same direction as the human translation direction in the dataset). We show that these two factors have a large causal effect on the MT performance, in addition to the test-model direction mismatch highlighted by existing work on the impact of translationese. In light of our findings, we provide a set of suggestions for MT training and evaluation. Our code and data are at https://github.com/EdisonNi-hku/CausalMT ",
    "url": "https://arxiv.org/abs/2205.02293",
    "authors": [
      "Jingwei Ni",
      "Zhijing Jin",
      "Markus Freitag",
      "Mrinmaya Sachan",
      "Bernhard Schölkopf"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02298",
    "title": "Zero Day Threat Detection Using Graph and Flow Based Security Telemetry",
    "abstract": "Zero Day Threats (ZDT) are novel methods used by malicious actors to attack and exploit information technology (IT) networks or infrastructure. In the past few years, the number of these threats has been increasing at an alarming rate and have been costing organizations millions of dollars to remediate. The increasing expansion of network attack surfaces and the exponentially growing number of assets on these networks necessitate the need for a robust AI-based Zero Day Threat detection model that can quickly analyze petabyte-scale data for potentially malicious and novel activity. In this paper, the authors introduce a deep learning based approach to Zero Day Threat detection that can generalize, scale, and effectively identify threats in near real-time. The methodology utilizes network flow telemetry augmented with asset-level graph features, which are passed through a dual-autoencoder structure for anomaly and novelty detection respectively. The models have been trained and tested on four large scale datasets that are representative of real-world organizational networks and they produce strong results with high precision and recall values. The models provide a novel methodology to detect complex threats with low false-positive rates that allow security operators to avoid alert fatigue while drastically reducing their mean time to response with near-real-time detection. Furthermore, the authors also provide a novel, labelled, cyber attack dataset generated from adversarial activity that can be used for validation or training of other models. With this paper, the authors' overarching goal is to provide a novel architecture and training methodology for cyber anomaly detectors that can generalize to multiple IT networks with minimal to no retraining while still maintaining strong performance. ",
    "url": "https://arxiv.org/abs/2205.02298",
    "authors": [
      "Christopher Redino",
      "Dhruv Nandakumar",
      "Robert Schiller",
      "Kevin Choi",
      "Abdul Rahman",
      "Edward Bowen",
      "Matthew Weeks",
      "Aaron Shaha",
      "Joe Nehila"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02303",
    "title": "Analysing the Robustness of Dual Encoders for Dense Retrieval Against  Misspellings",
    "abstract": "Dense retrieval is becoming one of the standard approaches for document and passage ranking. The dual-encoder architecture is widely adopted for scoring question-passage pairs due to its efficiency and high performance. Typically, dense retrieval models are evaluated on clean and curated datasets. However, when deployed in real-life applications, these models encounter noisy user-generated text. That said, the performance of state-of-the-art dense retrievers can substantially deteriorate when exposed to noisy text. In this work, we study the robustness of dense retrievers against typos in the user question. We observe a significant drop in the performance of the dual-encoder model when encountering typos and explore ways to improve its robustness by combining data augmentation with contrastive learning. Our experiments on two large-scale passage ranking and open-domain question answering datasets show that our proposed approach outperforms competing approaches. Additionally, we perform a thorough analysis on robustness. Finally, we provide insights on how different typos affect the robustness of embeddings differently and how our method alleviates the effect of some typos but not of others. ",
    "url": "https://arxiv.org/abs/2205.02303",
    "authors": [
      "Georgios Sidiropoulos",
      "Evangelos Kanoulas"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2205.02309",
    "title": "Towards Robust and Semantically Organised Latent Representations for  Unsupervised Text Style Transfer",
    "abstract": "Recent studies show that auto-encoder based approaches successfully perform language generation, smooth sentence interpolation, and style transfer over unseen attributes using unlabelled datasets in a zero-shot manner. The latent space geometry of such models is organised well enough to perform on datasets where the style is \"coarse-grained\" i.e. a small fraction of words alone in a sentence are enough to determine the overall style label. A recent study uses a discrete token-based perturbation approach to map \"similar\" sentences (\"similar\" defined by low Levenshtein distance/ high word overlap) close by in latent space. This definition of \"similarity\" does not look into the underlying nuances of the constituent words while mapping latent space neighbourhoods and therefore fails to recognise sentences with different style-based semantics while mapping latent neighbourhoods. We introduce EPAAEs (Embedding Perturbed Adversarial AutoEncoders) which completes this perturbation model, by adding a finely adjustable noise component on the continuous embeddings space. We empirically show that this (a) produces a better organised latent space that clusters stylistically similar sentences together, (b) performs best on a diverse set of text style transfer tasks than similar denoising-inspired baselines, and (c) is capable of fine-grained control of Style Transfer strength. We also extend the text style transfer tasks to NLI datasets and show that these more complex definitions of style are learned best by EPAAE. To the best of our knowledge, extending style transfer to NLI tasks has not been explored before. ",
    "url": "https://arxiv.org/abs/2205.02309",
    "authors": [
      "Sharan Narasimhan",
      "Suvodip Dey",
      "Maunendra Sankar Desarkar"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.02343",
    "title": "Convolutional and Residual Networks Provably Contain Lottery Tickets",
    "abstract": "The Lottery Ticket Hypothesis continues to have a profound practical impact on the quest for small scale deep neural networks that solve modern deep learning tasks at competitive performance. These lottery tickets are identified by pruning large randomly initialized neural networks with architectures that are as diverse as their applications. Yet, theoretical insights that attest their existence have been mostly focused on deep fully-connected feed forward networks with ReLU activation functions. We prove that also modern architectures consisting of convolutional and residual layers that can be equipped with almost arbitrary activation functions can contain lottery tickets with high probability. ",
    "url": "https://arxiv.org/abs/2205.02343",
    "authors": [
      "Rebekka Burkholz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02347",
    "title": "Rooted America: Immobility and Segregation of the Inter-county Migration  Networks",
    "abstract": "Despite the popular narrative that the United States is a \"land of mobility,\" its internal migration rates have declined for decades, and reached a historical low. Economic and related factors were able to account for a portion of this trend, but the bulk has remained unexplained. Here, we propose a systemic, relational model of internal migration in the U.S., combining demographic, economic, political, and geographical factors with endogenous social mechanisms, with the objective of identifying factors limiting migration rates. We implement this model using valued temporal exponential-family random graph models, allowing us to calibrate it to the (valued) network of intercounty U.S. migration flows during the 2011-2015 period. Our analysis reveals a pattern of segmented immobility, where fewer people migrate between counties with dissimilar political contexts, levels of urbanization, and racial compositions. Probing our model using \"knockout\" experiments suggests that one would have observed approximately 3 million (17%) more intercounty migrants over the study period were the segmented immobility mechanisms inoperative. This analysis suggests that internal migration in the current era is driven not only by demographic and economic factors, but also cultural and political ones. It also reveals social and political cleavages that underlie geographical immobility in America. ",
    "url": "https://arxiv.org/abs/2205.02347",
    "authors": [
      "Peng Huang",
      "Carter T. Butts"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2205.02357",
    "title": "Hybrid Transformer with Multi-level Fusion for Multimodal Knowledge  Graph Completion",
    "abstract": "Multimodal Knowledge Graphs (MKGs), which organize visual-text factual knowledge, have recently been successfully applied to tasks such as information retrieval, question answering, and recommendation system. Since most MKGs are far from complete, extensive knowledge graph completion studies have been proposed focusing on the multimodal entity, relation extraction and link prediction. However, different tasks and modalities require changes to the model architecture, and not all images/objects are relevant to text input, which hinders the applicability to diverse real-world scenarios. In this paper, we propose a hybrid transformer with multi-level fusion to address those issues. Specifically, we leverage a hybrid transformer architecture with unified input-output for diverse multimodal knowledge graph completion tasks. Moreover, we propose multi-level fusion, which integrates visual and text representation via coarse-grained prefix-guided interaction and fine-grained correlation-aware fusion modules. We conduct extensive experiments to validate that our MKGformer can obtain SOTA performance on four datasets of multimodal link prediction, multimodal RE, and multimodal NER. Code is available in https://github.com/zjunlp/MKGformer. ",
    "url": "https://arxiv.org/abs/2205.02357",
    "authors": [
      "Xiang Chen",
      "Ningyu Zhang",
      "Lei Li",
      "Shumin Deng",
      "Chuanqi Tan",
      "Changliang Xu",
      "Fei Huang",
      "Luo Si",
      "Huajun Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.02361",
    "title": "ShoeRinsics: Shoeprint Prediction for Forensics with Intrinsic  Decomposition",
    "abstract": "Shoe tread impressions are one of the most common types of evidence left at crime scenes. However, the utility of such evidence is limited by the lack of databases of footwear impression patterns that cover the huge and growing number of distinct shoe models. We propose to address this gap by leveraging shoe tread photographs collected by online retailers. The core challenge is to predict the impression pattern from the shoe photograph since ground-truth impressions or 3D shapes of tread patterns are not available. We develop a model that performs intrinsic image decomposition (predicting depth, normal, albedo, and lighting) from a single tread photo. Our approach, which we term ShoeRinsics, combines domain adaptation and re-rendering losses in order to leverage a mix of fully supervised synthetic data and unsupervised retail image data. To validate model performance, we also collected a set of paired shoe-sole images and corresponding prints, and define a benchmarking protocol to quantify the accuracy of predicted impressions. On this benchmark, ShoeRinsics outperforms existing methods for depth prediction and synthetic-to-real domain adaptation. ",
    "url": "https://arxiv.org/abs/2205.02361",
    "authors": [
      "Samia Shafique",
      "Bailey Kong",
      "Shu Kong",
      "Charless C. Fowlkes"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02367",
    "title": "Time-multiplexed Neural Holography: A flexible framework for holographic  near-eye displays with fast heavily-quantized spatial light modulators",
    "abstract": "Holographic near-eye displays offer unprecedented capabilities for virtual and augmented reality systems, including perceptually important focus cues. Although artificial intelligence--driven algorithms for computer-generated holography (CGH) have recently made much progress in improving the image quality and synthesis efficiency of holograms, these algorithms are not directly applicable to emerging phase-only spatial light modulators (SLM) that are extremely fast but offer phase control with very limited precision. The speed of these SLMs offers time multiplexing capabilities, essentially enabling partially-coherent holographic display modes. Here we report advances in camera-calibrated wave propagation models for these types of holographic near-eye displays and we develop a CGH framework that robustly optimizes the heavily quantized phase patterns of fast SLMs. Our framework is flexible in supporting runtime supervision with different types of content, including 2D and 2.5D RGBD images, 3D focal stacks, and 4D light fields. Using our framework, we demonstrate state-of-the-art results for all of these scenarios in simulation and experiment. ",
    "url": "https://arxiv.org/abs/2205.02367",
    "authors": [
      "Suyeon Choi",
      "Manu Gopakumar",
      "Yifan",
      "Peng",
      "Jonghyun Kim",
      "Matthew O'Toole",
      "Gordon Wetzstein"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Artificial Intelligence (cs.AI)",
      "Computational Physics (physics.comp-ph)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2205.02371",
    "title": "A Bayesian Detect to Track System for Robust Visual Object Tracking and  Semi-Supervised Model Learning",
    "abstract": "Object tracking is one of the fundamental problems in visual recognition tasks and has achieved significant improvements in recent years. The achievements often come with the price of enormous hardware consumption and expensive labor effort for consecutive labeling. A missing ingredient for robust tracking is achieving performance with minimal modification on network structure and semi-supervised learning intermittent labeled frames. In this paper, we ad-dress these problems in a Bayesian tracking and detection framework parameterized by neural network outputs. In our framework, the tracking and detection process is formulated in a probabilistic way as multi-objects dynamics and network detection uncertainties. With our formulation, we propose a particle filter-based approximate sampling algorithm for tracking object state estimation. Based on our particle filter inference algorithm, a semi-supervised learn-ing algorithm is utilized for learning tracking network on intermittent labeled frames by variational inference. In our experiments, we provide both mAP and probability-based detection measurements for comparison between our algorithm with non-Bayesian solutions. We also train a semi-supervised tracking network on M2Cai16-Tool-Locations Dataset and compare our results with supervised learning on fully labeled frames. ",
    "url": "https://arxiv.org/abs/2205.02371",
    "authors": [
      "Yan Shen",
      "Zhanghexuan Ji",
      "Chunwei Ma",
      "Mingchen Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02375",
    "title": "Response Component Analysis for Sea State Estimation Using Artificial  Neural Networks and Vessel Response Spectral Data",
    "abstract": "The use of the `ship as a wave buoy analogy' (SAWB) provides a novel means to estimate sea states, where relationships are established between causal wave properties and vessel motion response information. This study focuses on a model-free machine learning approach to SAWB-based sea state estimation (SSE), using neural networks (NNs) to map vessel response spectral data to statistical wave properties. Results showed a strong correlation between heave responses and significant wave height estimates, whilst the accuracy of mean wave period and wave heading predictions were observed to improve considerably when data from multiple vessel degrees of freedom (DOFs) was utilized. Overall, 3-DOF (heave, pitch and roll) NNs for SSE were shown to perform well when compared to existing SSE approaches that use similar simulation setups. Given the information-dense statistical representation of vessel motion responses in spectral form, as well as the ability of NNs to effectively model complex relationships between variables, the designed SSE method shows promise for future adaptation to mobile SSE systems using the SAWB approach. ",
    "url": "https://arxiv.org/abs/2205.02375",
    "authors": [
      "Nathan K. Long",
      "Daniel Sgarioto",
      "Matthew Garratt",
      "Karl Sammut"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.02376",
    "title": "Uncertainty-Based Non-Parametric Active Peak Detection",
    "abstract": "Active, non-parametric peak detection is considered. As a use case, active source localization is examined and an uncertainty-based sampling scheme algorithm to effectively localize the peak from a few energy measurements is designed. It is shown that under very mild conditions, the source localization error with $m$ actively chosen energy measurements scales as $O(\\log^2 m/m)$. Numerically, it is shown that in low-sample regimes, the proposed method enjoys superior performance on several types of data and outperforms the state-of-the-art passive source localization approaches and in the low sample regime, can outperform greedy methods as well. ",
    "url": "https://arxiv.org/abs/2205.02376",
    "authors": [
      "Praneeth Narayanamurthy",
      "Urbashi Mitra"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.02392",
    "title": "Robust Conversational Agents against Imperceptible Toxicity Triggers",
    "abstract": "Warning: this paper contains content that maybe offensive or upsetting. Recent research in Natural Language Processing (NLP) has advanced the development of various toxicity detection models with the intention of identifying and mitigating toxic language from existing systems. Despite the abundance of research in this area, less attention has been given to adversarial attacks that force the system to generate toxic language and the defense against them. Existing work to generate such attacks is either based on human-generated attacks which is costly and not scalable or, in case of automatic attacks, the attack vector does not conform to human-like language, which can be detected using a language model loss. In this work, we propose attacks against conversational agents that are imperceptible, i.e., they fit the conversation in terms of coherency, relevancy, and fluency, while they are effective and scalable, i.e., they can automatically trigger the system into generating toxic language. We then propose a defense mechanism against such attacks which not only mitigates the attack but also attempts to maintain the conversational flow. Through automatic and human evaluations, we show that our defense is effective at avoiding toxic language generation even against imperceptible toxicity triggers while the generated language fits the conversation in terms of coherency and relevancy. Lastly, we establish the generalizability of such a defense mechanism on language generation models beyond conversational agents. ",
    "url": "https://arxiv.org/abs/2205.02392",
    "authors": [
      "Ninareh Mehrabi",
      "Ahmad Beirami",
      "Fred Morstatter",
      "Aram Galstyan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02411",
    "title": "Relational Representation Learning in Visually-Rich Documents",
    "abstract": "Relational understanding is critical for a number of visually-rich documents (VRDs) understanding tasks. Through multi-modal pre-training, recent studies provide comprehensive contextual representations and exploit them as prior knowledge for downstream tasks. In spite of their impressive results, we observe that the widespread relational hints (e.g., relation of key/value fields on receipts) built upon contextual knowledge are not excavated yet. To mitigate this gap, we propose DocReL, a Document Relational Representation Learning framework. The major challenge of DocReL roots in the variety of relations. From the simplest pairwise relation to the complex global structure, it is infeasible to conduct supervised training due to the definition of relation varies and even conflicts in different tasks. To deal with the unpredictable definition of relations, we propose a novel contrastive learning task named Relational Consistency Modeling (RCM), which harnesses the fact that existing relations should be consistent in differently augmented positive views. RCM provides relational representations which are more compatible to the urgent need of downstream tasks, even without any knowledge about the exact definition of relation. DocReL achieves better performance on a wide variety of VRD relational understanding tasks, including table structure recognition, key information extraction and reading order detection. ",
    "url": "https://arxiv.org/abs/2205.02411",
    "authors": [
      "Xin Li",
      "Yan Zheng",
      "Yiqing Hu",
      "Haoyu Cao",
      "Yunfei Wu",
      "Deqiang Jiang",
      "Yinsong Liu",
      "Bo Ren"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.02414",
    "title": "Subverting Fair Image Search with Generative Adversarial Perturbations",
    "abstract": "In this work we explore the intersection fairness and robustness in the context of ranking: \\textit{when a ranking model has been calibrated to achieve some definition of fairness, is it possible for an external adversary to make the ranking model behave unfairly without having access to the model or training data?} To investigate this question, we present a case study in which we develop and then attack a state-of-the-art, fairness-aware image search engine using images that have been maliciously modified using a Generative Adversarial Perturbation (GAP) model. These perturbations attempt to cause the fair re-ranking algorithm to unfairly boost the rank of images containing people from an adversary-selected subpopulation. We present results from extensive experiments demonstrating that our attacks can successfully confer significant unfair advantage to people from the majority class relative to fairly-ranked baseline search results. We demonstrate that our attacks are robust across a number of variables, that they have close to zero impact on the relevance of search results, and that they succeed under a strict threat model. Our findings highlight the danger of deploying fair machine learning algorithms in-the-wild when (1) the data necessary to achieve fairness may be adversarially manipulated, and (2) the models themselves are not robust against attacks. ",
    "url": "https://arxiv.org/abs/2205.02414",
    "authors": [
      "Avijit Ghosh",
      "Matthew Jagielski",
      "Christo Wilson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2205.02421",
    "title": "Towards Real-time Traffic Sign and Traffic Light Detection on Embedded  Systems",
    "abstract": "Recent work done on traffic sign and traffic light detection focus on improving detection accuracy in complex scenarios, yet many fail to deliver real-time performance, specifically with limited computational resources. In this work, we propose a simple deep learning based end-to-end detection framework, which effectively tackles challenges inherent to traffic sign and traffic light detection such as small size, large number of classes and complex road scenarios. We optimize the detection models using TensorRT and integrate with Robot Operating System to deploy on an Nvidia Jetson AGX Xavier as our embedded device. The overall system achieves a high inference speed of 63 frames per second, demonstrating the capability of our system to perform in real-time. Furthermore, we introduce CeyRo, which is the first ever large-scale traffic sign and traffic light detection dataset for the Sri Lankan context. Our dataset consists of 7984 total images with 10176 traffic sign and traffic light instances covering 70 traffic sign and 5 traffic light classes. The images have a high resolution of 1920 x 1080 and capture a wide range of challenging road scenarios with different weather and lighting conditions. Our work is publicly available at https://github.com/oshadajay/CeyRo. ",
    "url": "https://arxiv.org/abs/2205.02421",
    "authors": [
      "Oshada Jayasinghe",
      "Sahan Hemachandra",
      "Damith Anhettigama",
      "Shenali Kariyawasam",
      "Tharindu Wickremasinghe",
      "Chalani Ekanayake",
      "Ranga Rodrigo",
      "Peshala Jayasekara"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02427",
    "title": "Ultra-Reliable Distributed Cloud Network Control with End-to-End Latency  Constraints",
    "abstract": "We are entering a rapidly unfolding future driven by the delivery of real-time computation services, such as industrial automation and augmented reality, collectively referred to as AgI services, over highly distributed cloud/edge computing networks. The interaction intensive nature of AgI services is accelerating the need for networking solutions that provide strict latency guarantees. In contrast to most existing studies that can only characterize average delay performance, we focus on the critical goal of delivering AgI services ahead of corresponding deadlines on a per-packet basis, while minimizing overall cloud network operational cost. To this end, we design a novel queuing system able to track data packets' lifetime and formalize the delay-constrained least-cost dynamic network control problem. To address this challenging problem, we first study the setting with average capacity (or resource budget) constraints, for which we characterize the delay-constrained stability region and design a near-optimal control policy leveraging Lyapunov optimization theory on an equivalent virtual network. Guided by the same principle, we tackle the peak capacity constrained scenario by developing the reliable cloud network control (RCNC) algorithm, which employs a two-way optimization method to make actual and virtual network flow solutions converge in an iterative manner. Extensive numerical results show the superior performance of the proposed control policy compared with the state-of-the-art cloud network control algorithm, and the value of guaranteeing strict end-to-end deadlines for the delivery of next-generation AgI services. ",
    "url": "https://arxiv.org/abs/2205.02427",
    "authors": [
      "Yang Cai",
      "Jaime Llorca",
      "Antonia M. Tulino",
      "Andreas F. Molisch"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.02435",
    "title": "FAITH: Few-Shot Graph Classification with Hierarchical Task Graphs",
    "abstract": "Few-shot graph classification aims at predicting classes for graphs, given limited labeled graphs for each class. To tackle the bottleneck of label scarcity, recent works propose to incorporate few-shot learning frameworks for fast adaptations to graph classes with limited labeled graphs. Specifically, these works propose to accumulate meta-knowledge across diverse meta-training tasks, and then generalize such meta-knowledge to the target task with a disjoint label set. However, existing methods generally ignore task correlations among meta-training tasks while treating them independently. Nevertheless, such task correlations can advance the model generalization to the target task for better classification performance. On the other hand, it remains non-trivial to utilize task correlations due to the complex components in a large number of meta-training tasks. To deal with this, we propose a novel few-shot learning framework FAITH that captures task correlations via constructing a hierarchical task graph at different granularities. Then we further design a loss-based sampling strategy to select tasks with more correlated classes. Moreover, a task-specific classifier is proposed to utilize the learned task correlations for few-shot classification. Extensive experiments on four prevalent few-shot graph classification datasets demonstrate the superiority of FAITH over other state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2205.02435",
    "authors": [
      "Song Wang",
      "Yushun Dong",
      "Xiao Huang",
      "Chen Chen",
      "Jundong Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02447",
    "title": "A Deep Learning Approach to Dst Index Prediction",
    "abstract": "The disturbance storm time (Dst) index is an important and useful measurement in space weather research. It has been used to characterize the size and intensity of a geomagnetic storm. A negative Dst value means that the Earth's magnetic field is weakened, which happens during storms. In this paper, we present a novel deep learning method, called the Dst Transformer, to perform short-term, 1-6 hour ahead, forecasting of the Dst index based on the solar wind parameters provided by the NASA Space Science Data Coordinated Archive. The Dst Transformer combines a multi-head attention layer with Bayesian inference, which is capable of quantifying both aleatoric uncertainty and epistemic uncertainty when making Dst predictions. Experimental results show that the proposed Dst Transformer outperforms related machine learning methods in terms of the root mean square error and R-squared. Furthermore, the Dst Transformer can produce both data and model uncertainty quantification results, which can not be done by the existing methods. To our knowledge, this is the first time that Bayesian deep learning has been used for Dst index forecasting. ",
    "url": "https://arxiv.org/abs/2205.02447",
    "authors": [
      "Yasser Abduallah",
      "Jason T. L. Wang",
      "Prianka Bose",
      "Genwei Zhang",
      "Firas Gerges",
      "Haimin Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02455",
    "title": "COGMEN: COntextualized GNN based Multimodal Emotion recognitioN",
    "abstract": "Emotions are an inherent part of human interactions, and consequently, it is imperative to develop AI systems that understand and recognize human emotions. During a conversation involving various people, a person's emotions are influenced by the other speaker's utterances and their own emotional state over the utterances. In this paper, we propose COntextualized Graph Neural Network based Multimodal Emotion recognitioN (COGMEN) system that leverages local information (i.e., inter/intra dependency between speakers) and global information (context). The proposed model uses Graph Neural Network (GNN) based architecture to model the complex dependencies (local and global information) in a conversation. Our model gives state-of-the-art (SOTA) results on IEMOCAP and MOSEI datasets, and detailed ablation experiments show the importance of modeling information at both levels. ",
    "url": "https://arxiv.org/abs/2205.02455",
    "authors": [
      "Abhinav Joshi",
      "Ashwani Bhat",
      "Ayush Jain",
      "Atin Vikram Singh",
      "Ashutosh Modi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02460",
    "title": "KGTuner: Efficient Hyper-parameter Search for Knowledge Graph Learning",
    "abstract": "While hyper-parameters (HPs) are important for knowledge graph (KG) learning, existing methods fail to search them efficiently. To solve this problem, we first analyze the properties of different HPs and measure the transfer ability from small subgraph to the full graph. Based on the analysis, we propose an efficient two-stage search algorithm KGTuner, which efficiently explores HP configurations on small subgraph at the first stage and transfers the top-performed configurations for fine-tuning on the large full graph at the second stage. Experiments show that our method can consistently find better HPs than the baseline algorithms within the same time budget, which achieves {9.1\\%} average relative improvement for four embedding models on the large-scale KGs in open graph benchmark. ",
    "url": "https://arxiv.org/abs/2205.02460",
    "authors": [
      "Yongqi Zhang",
      "Zhanke Zhou",
      "Quanming Yao",
      "Yong Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02466",
    "title": "Optimal Algorithms for Mean Estimation under Local Differential Privacy",
    "abstract": "We study the problem of mean estimation of $\\ell_2$-bounded vectors under the constraint of local differential privacy. While the literature has a variety of algorithms that achieve the asymptotically optimal rates for this problem, the performance of these algorithms in practice can vary significantly due to varying (and often large) hidden constants. In this work, we investigate the question of designing the protocol with the smallest variance. We show that PrivUnit (Bhowmick et al. 2018) with optimized parameters achieves the optimal variance among a large family of locally private randomizers. To prove this result, we establish some properties of local randomizers, and use symmetrization arguments that allow us to write the optimal randomizer as the optimizer of a certain linear program. These structural results, which should extend to other problems, then allow us to show that the optimal randomizer belongs to the PrivUnit family. We also develop a new variant of PrivUnit based on the Gaussian distribution which is more amenable to mathematical analysis and enjoys the same optimality guarantees. This allows us to establish several useful properties on the exact constants of the optimal error as well as to numerically estimate these constants. ",
    "url": "https://arxiv.org/abs/2205.02466",
    "authors": [
      "Hilal Asi",
      "Vitaly Feldman",
      "Kunal Talwar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.02468",
    "title": "Alignahead: Online Cross-Layer Knowledge Extraction on Graph Neural  Networks",
    "abstract": "Existing knowledge distillation methods on graph neural networks (GNNs) are almost offline, where the student model extracts knowledge from a powerful teacher model to improve its performance. However, a pre-trained teacher model is not always accessible due to training cost, privacy, etc. In this paper, we propose a novel online knowledge distillation framework to resolve this problem. Specifically, each student GNN model learns the extracted local structure from another simultaneously trained counterpart in an alternating training procedure. We further develop a cross-layer distillation strategy by aligning ahead one student layer with the layer in different depth of another student model, which theoretically makes the structure information spread over all layers. Experimental results on five datasets including PPI, Coauthor-CS/Physics and Amazon-Computer/Photo demonstrate that the student performance is consistently boosted in our collaborative training framework without the supervision of a pre-trained teacher model. In addition, we also find that our alignahead technique can accelerate the model convergence speed and its effectiveness can be generally improved by increasing the student numbers in training. Code is available: https://github.com/GuoJY-eatsTG/Alignahead ",
    "url": "https://arxiv.org/abs/2205.02468",
    "authors": [
      "Jiongyu Guo",
      "Defang Chen",
      "Can Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02474",
    "title": "Scheduling Coflows with Precedence Constraints for Minimizing the Total  Weighted Completion Time in Identical Parallel Networks",
    "abstract": "Coflow is a recently proposed network abstraction for data-parallel computing applications. This paper considers scheduling coflows with precedence constraints in identical parallel networks, such as to minimize the total weighted completion time of coflows. The identical parallel network is an architecture based on multiple network cores running in parallel. In the divisible coflow scheduling problem, the proposed algorithm achieves $(6-\\frac{2}{m})\\mu$ and $(5-\\frac{2}{m})\\mu$ approximate ratios for arbitrary release time and zero release time, respectively, where $m$ is the number of network cores and $\\mu$ is the coflow number of the longest path in the precedence graph. In the indivisible coflow scheduling problem, the proposed algorithm achieves $(7-\\frac{2}{m})\\mu$ and $(6-\\frac{2}{m})\\mu$ approximate ratios for arbitrary release time and zero release time, respectively. In the single network core scheduling problem, we propose a $5\\mu$-approximation algorithm with arbitrary release times, and a $4\\mu$-approximation without release time. Moreover, the proposed algorithm can be modified to solve the coflows of multi-stage jobs scheduling problem. In multi-stage jobs, coflow is transferred between servers to enable starting of next stage. This means that there are precedence constraints between coflows of job. Our result represents an improvement upon the previous best approximation ratio of $O(\\tilde{\\mu} \\log(N)/ \\log(\\log(N)))$ where $\\tilde{\\mu}$ is the maximum number of coflows in a job and $N$ is the number of servers. ",
    "url": "https://arxiv.org/abs/2205.02474",
    "authors": [
      "Chi-Yeh Chen"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2205.02485",
    "title": "Generating Simple Directed Social Network Graphs for Information  Spreading",
    "abstract": "Online social networks are a dominant medium in everyday life to stay in contact with friends and to share information. In Twitter, users can connect with other users by following them, who in turn can follow back. In recent years, researchers studied several properties of social networks and designed random graph models to describe them. Many of these approaches either focus on the generation of undirected graphs or on the creation of directed graphs without modeling the dependencies between reciprocal (i.e., two directed edges of opposite direction between two nodes) and directed edges. We propose an approach to generate directed social network graphs that creates reciprocal and directed edges and considers the correlation between the respective degree sequences. Our model relies on crawled directed graphs in Twitter, on which information w.r.t. a topic is exchanged or disseminated. While these graphs exhibit a high clustering coefficient and small average distances between random node pairs (which is typical in real-world networks), their degree sequences seem to follow a $\\chi^2$-distribution rather than power law. To achieve high clustering coefficients, we apply an edge rewiring procedure that preserves the node degrees. We compare the crawled and the created graphs, and simulate certain algorithms for information dissemination and epidemic spreading on them. The results show that the created graphs exhibit very similar topological and algorithmic properties as the real-world graphs, providing evidence that they can be used as surrogates in social network analysis. Furthermore, our model is highly scalable, which enables us to create graphs of arbitrary size with almost the same properties as the corresponding real-world networks. ",
    "url": "https://arxiv.org/abs/2205.02485",
    "authors": [
      "Christoph Schweimer",
      "Christine Gfrerer",
      "Florian Lugstein",
      "David Pape",
      "Jan A. Velimsky",
      "Robert Elsässer",
      "Bernhard C. Geiger"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2205.02490",
    "title": "FastRE: Towards Fast Relation Extraction with Convolutional Encoder and  Improved Cascade Binary Tagging Framework",
    "abstract": "Recent work for extracting relations from texts has achieved excellent performance. However, most existing methods pay less attention to the efficiency, making it still challenging to quickly extract relations from massive or streaming text data in realistic scenarios. The main efficiency bottleneck is that these methods use a Transformer-based pre-trained language model for encoding, which heavily affects the training speed and inference speed. To address this issue, we propose a fast relation extraction model (FastRE) based on convolutional encoder and improved cascade binary tagging framework. Compared to previous work, FastRE employs several innovations to improve efficiency while also keeping promising performance. Concretely, FastRE adopts a novel convolutional encoder architecture combined with dilated convolution, gated unit and residual connection, which significantly reduces the computation cost of training and inference, while maintaining the satisfactory performance. Moreover, to improve the cascade binary tagging framework, FastRE first introduces a type-relation mapping mechanism to accelerate tagging efficiency and alleviate relation redundancy, and then utilizes a position-dependent adaptive thresholding strategy to obtain higher tagging accuracy and better model generalization. Experimental results demonstrate that FastRE is well balanced between efficiency and performance, and achieves 3-10x training speed, 7-15x inference speed faster, and 1/100 parameters compared to the state-of-the-art models, while the performance is still competitive. ",
    "url": "https://arxiv.org/abs/2205.02490",
    "authors": [
      "Guozheng Li",
      "Xu Chen",
      "Peng Wang",
      "Jiafeng Xie",
      "Qiqing Luo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02517",
    "title": "A Simple Contrastive Learning Objective for Alleviating Neural Text  Degeneration",
    "abstract": "The cross-entropy objective has proved to be an all-purpose training objective for autoregressive language models (LMs). However, without considering the penalization of problematic tokens, LMs trained using cross-entropy exhibit text degeneration. To address this, unlikelihood training has been proposed to force unlikely tokens to be assigned a low probability by a LM. But unlikelihood does not consider the relationship between the label tokens and the unlikely token candidates, thus showing marginal improvements in degeneration. We propose a new contrastive token learning objective that inherits the advantages of cross-entropy and unlikelihood training and avoids their limitations. The key idea is to force a LM to generate high probabilities for label tokens at each step while low probabilities of negative candidates. Comprehensive experiments on language modeling and open-domain dialogue generation tasks show that the proposed contrastive token objective yields less repetitive texts, with a higher generation quality than unlikelihood training, achieving the new state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2205.02517",
    "authors": [
      "Shaojie Jiang",
      "Ruqing Zhang",
      "Svitlana Vakulenko",
      "Maarten de Rijke"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.02524",
    "title": "M2R2: Missing-Modality Robust emotion Recognition framework with  iterative data augmentation",
    "abstract": "This paper deals with the utterance-level modalities missing problem with uncertain patterns on emotion recognition in conversation (ERC) task. Present models generally predict the speaker's emotions by its current utterance and context, which is degraded by modality missing considerably. Our work proposes a framework Missing-Modality Robust emotion Recognition (M2R2), which trains emotion recognition model with iterative data augmentation by learned common representation. Firstly, a network called Party Attentive Network (PANet) is designed to classify emotions, which tracks all the speakers' states and context. Attention mechanism between speaker with other participants and dialogue topic is used to decentralize dependence on multi-time and multi-party utterances instead of the possible incomplete one. Moreover, the Common Representation Learning (CRL) problem is defined for modality-missing problem. Data imputation methods improved by the adversarial strategy are used here to construct extra features to augment data. Extensive experiments and case studies validate the effectiveness of our methods over baselines for modality-missing emotion recognition on two different datasets. ",
    "url": "https://arxiv.org/abs/2205.02524",
    "authors": [
      "Ning Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2205.02528",
    "title": "On inherent robustness and performance limitations of a class of  prescribed-time algorithms",
    "abstract": "Prescribed-time algorithms based on time-varying gains have remarkable properties, such as finite-time regulation in a time prescribed by the user, that is the same for every nonzero initial condition, and that holds even under matched disturbances. However, at the same time, prescribed-time algorithms are also known to lack robustness to measurement noise. In this note, it is shown that in the non-scalar case the lack of robustness of some prescribed-time algorithms is of an extreme form. Specifically, arbitrarily small measurement noise can cause considerable deviations, divergence, and other detrimental consequences. ",
    "url": "https://arxiv.org/abs/2205.02528",
    "authors": [
      "Rodrigo Aldana-López",
      "Richard Seeber",
      "Hernan Haimovich",
      "David Gómez-Gutiérrez"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.02551",
    "title": "Biologically inspired deep residual networks for computer vision  applications",
    "abstract": "Deep neural network has been ensured as a key technology in the field of many challenging and vigorously researched computer vision tasks. Furthermore, classical ResNet is thought to be a state-of-the-art convolutional neural network (CNN) and was observed to capture features which can have good generalization ability. In this work, we propose a biologically inspired deep residual neural network where the hexagonal convolutions are introduced along the skip connections. The performance of different ResNet variants using square and hexagonal convolution are evaluated with the competitive training strategy mentioned by [1]. We show that the proposed approach advances the baseline image classification accuracy of vanilla ResNet architectures on CIFAR-10 and the same was observed over multiple subsets of the ImageNet 2012 dataset. We observed an average improvement by 1.35% and 0.48% on baseline top-1 accuracies for ImageNet 2012 and CIFAR-10, respectively. The proposed biologically inspired deep residual networks were observed to have improved generalized performance and this could be a potential research direction to improve the discriminative ability of state-of-the-art image classification networks. ",
    "url": "https://arxiv.org/abs/2205.02551",
    "authors": [
      "Prathibha Varghese",
      "Dr. G. Arockia Selva Saroja"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2205.02573",
    "title": "Intra and Cross-spectrum Iris Presentation Attack Detection in the NIR  and Visible Domains Using Attention-based and Pixel-wise Supervised Learning",
    "abstract": "Iris Presentation Attack Detection (PAD) is essential to secure iris recognition systems. Recent iris PAD solutions achieved good performance by leveraging deep learning techniques. However, most results were reported under intra-database scenarios and it is unclear if such solutions can generalize well across databases and capture spectra. These PAD methods run the risk of overfitting because of the binary label supervision during the network training, which serves global information learning but weakens the capture of local discriminative features. This chapter presents a novel attention-based deep pixel-wise binary supervision (A-PBS) method. A-PBS utilizes pixel-wise supervision to capture the fine-grained pixel/patch-level cues and attention mechanism to guide the network to automatically find regions where most contribute to an accurate PAD decision. Extensive experiments are performed on six NIR and one visible-light iris databases to show the effectiveness and robustness of proposed A-PBS methods. We additionally conduct extensive experiments under intra-/cross-database and intra-/cross-spectrum for detailed analysis. The results of our experiments indicates the generalizability of the A-PBS iris PAD approach. ",
    "url": "https://arxiv.org/abs/2205.02573",
    "authors": [
      "Meiling Fang",
      "Fadi Boutros",
      "Naser Damer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02589",
    "title": "A Temporal-Pattern Backdoor Attack to Deep Reinforcement Learning",
    "abstract": "Deep reinforcement learning (DRL) has made significant achievements in many real-world applications. But these real-world applications typically can only provide partial observations for making decisions due to occlusions and noisy sensors. However, partial state observability can be used to hide malicious behaviors for backdoors. In this paper, we explore the sequential nature of DRL and propose a novel temporal-pattern backdoor attack to DRL, whose trigger is a set of temporal constraints on a sequence of observations rather than a single observation, and effect can be kept in a controllable duration rather than in the instant. We validate our proposed backdoor attack to a typical job scheduling task in cloud computing. Numerous experimental results show that our backdoor can achieve excellent effectiveness, stealthiness, and sustainability. Our backdoor's average clean data accuracy and attack success rate can reach 97.8% and 97.5%, respectively. ",
    "url": "https://arxiv.org/abs/2205.02589",
    "authors": [
      "Yinbo Yu",
      "Jiajia Liu",
      "Shouqing Li",
      "Kepu Huang",
      "Xudong Feng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02604",
    "title": "Holistic Approach to Measure Sample-level Adversarial Vulnerability and  its Utility in Building Trustworthy Systems",
    "abstract": "Adversarial attack perturbs an image with an imperceptible noise, leading to incorrect model prediction. Recently, a few works showed inherent bias associated with such attack (robustness bias), where certain subgroups in a dataset (e.g. based on class, gender, etc.) are less robust than others. This bias not only persists even after adversarial training, but often results in severe performance discrepancies across these subgroups. Existing works characterize the subgroup's robustness bias by only checking individual sample's proximity to the decision boundary. In this work, we argue that this measure alone is not sufficient and validate our argument via extensive experimental analysis. It has been observed that adversarial attacks often corrupt the high-frequency components of the input image. We, therefore, propose a holistic approach for quantifying adversarial vulnerability of a sample by combining these different perspectives, i.e., degree of model's reliance on high-frequency features and the (conventional) sample-distance to the decision boundary. We demonstrate that by reliably estimating adversarial vulnerability at the sample level using the proposed holistic metric, it is possible to develop a trustworthy system where humans can be alerted about the incoming samples that are highly likely to be misclassified at test time. This is achieved with better precision when our holistic metric is used over individual measures. To further corroborate the utility of the proposed holistic approach, we perform knowledge distillation in a limited-sample setting. We observe that the student network trained with the subset of samples selected using our combined metric performs better than both the competing baselines, viz., where samples are selected randomly or based on their distances to the decision boundary. ",
    "url": "https://arxiv.org/abs/2205.02604",
    "authors": [
      "Gaurav Kumar Nayak",
      "Ruchit Rawal",
      "Rohit Lal",
      "Himanshu Patil",
      "Anirban Chakraborty"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.02620",
    "title": "Heterogeneous Semantic and Bit Communications: A Semi-NOMA Scheme",
    "abstract": "Multiple access (MA) design is investigated for facilitating the coexistence of the emerging semantic transmission and the conventional bit-based transmission in future networks. The semantic rate is considered for measuring the performance of the semantic transmission. However, a key challenge is that there is a lack of a closed-form expression for a key parameter, namely the semantic similarity, which characterizes the sentence similarity between an original sentence and the corresponding recovered sentence. To overcome this challenge, we propose a data regression method, where the semantic similarity is approximated by a generalized logistic function. Using the obtained tractable function, we propose a heterogeneous semantic and bit communication framework, where an access point simultaneously sends the semantic and bit streams to one semantics-interested user (S-user) and one bit-interested user (B-user). To realize this heterogeneous semantic and bit transmission in multi-user networks, three MA schemes are proposed, namely orthogonal multiple access (OMA), non-orthogonal multiple access (NOMA), and semi-NOMA. More specifically, the bit stream in semi-NOMA is split into two streams, one is transmitted with the semantic stream over the shared frequency sub-band and the other is transmitted over the separate orthogonal frequency sub-band. To study the fundamental performance limits of the three proposed MA schemes, the semantic-versus-bit (SvB) rate region and the power region are defined. An optimal resource allocation procedure is then derived for characterizing the boundary of the SvB rate region and the power region achieved by each MA scheme. The structures of the derived solutions demonstrate that semi-NOMA is superior to both NOMA and OMA given its highly flexible transmission policy. Our numerical results validate the analysis and show the superiority of semi-NOMA. ",
    "url": "https://arxiv.org/abs/2205.02620",
    "authors": [
      "Xidong Mu",
      "Yuanwei Liu",
      "Li Guo",
      "Naofal Al-Dhahir"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2205.02625",
    "title": "GANimator: Neural Motion Synthesis from a Single Sequence",
    "abstract": "We present GANimator, a generative model that learns to synthesize novel motions from a single, short motion sequence. GANimator generates motions that resemble the core elements of the original motion, while simultaneously synthesizing novel and diverse movements. Existing data-driven techniques for motion synthesis require a large motion dataset which contains the desired and specific skeletal structure. By contrast, GANimator only requires training on a single motion sequence, enabling novel motion synthesis for a variety of skeletal structures e.g., bipeds, quadropeds, hexapeds, and more. Our framework contains a series of generative and adversarial neural networks, each responsible for generating motions in a specific frame rate. The framework progressively learns to synthesize motion from random noise, enabling hierarchical control over the generated motion content across varying levels of detail. We show a number of applications, including crowd simulation, key-frame editing, style transfer, and interactive control, which all learn from a single input sequence. Code and data for this paper are at https://peizhuoli.github.io/ganimator. ",
    "url": "https://arxiv.org/abs/2205.02625",
    "authors": [
      "Peizhuo Li",
      "Kfir Aberman",
      "Zihan Zhang",
      "Rana Hanocka",
      "Olga Sorkine-Hornung"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02626",
    "title": "Perron communicability and sensitivity of multilayer networks",
    "abstract": "Modeling complex systems that consist of different types of objects leads to multilayer networks, where nodes in the different layers represent different kind of objects. Nodes are connected by edges, which have positive weights. A multilayer network is associated with a supra-adjacency matrix. This paper investigates the sensitivity of the communicability in a multilayer network to perturbations of the network by studying the sensitivity of the Perron root of the supra-adjacency matrix. Our analysis sheds light on which edge weights to make larger to increase the communicability of the network, and which edge weights can be made smaller or set to zero without affecting the communicability significantly. ",
    "url": "https://arxiv.org/abs/2205.02626",
    "authors": [
      "Smahane El-Halouy",
      "Silvia Noschese",
      "Lothar Reichel"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2205.02648",
    "title": "Multi-Freq-LDPy: Multiple Frequency Estimation Under Local Differential  Privacy in Python",
    "abstract": "This paper introduces the \\texttt{multi-freq-ldpy} Python package for multiple frequency estimation under Local Differential Privacy (LDP) guarantees. LDP is a gold standard for achieving local privacy with several real-world implementations by big tech companies such as Google, Apple, and Microsoft. The primary application of LDP is frequency (or histogram) estimation, in which the aggregator estimates the number of times each value has been reported. The presented package provides an easy-to-use and fast implementation of state-of-the-art solutions and LDP protocols for frequency estimation of: multiple attributes (i.e., multidimensional data), multiple collections (i.e., longitudinal data), and both multiple attributes/collections. Multi-Freq-LDPy is built on the well-established \\textit{Numpy} package -- a \\textit{de facto} standard for scientific computing in Python -- and the \\textit{Numba} package for fast execution. These features are illustrated in this demo paper with different tutorial-like case studies. This package is open-source and publicly available under an MIT license via GitHub https://github.com/hharcolezi/multi-freq-ldpy and can be installed via PyPi. ",
    "url": "https://arxiv.org/abs/2205.02648",
    "authors": [
      "Héber H. Arcolezi",
      "Jean-François Couchot",
      "Sébastien Gambs",
      "Catuscia Palamidessi",
      "Majid Zolfaghari"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.02652",
    "title": "Can collaborative learning be private, robust and scalable?",
    "abstract": "We investigate the effectiveness of combining differential privacy, model compression and adversarial training to improve the robustness of models against adversarial samples in train- and inference-time attacks. We explore the applications of these techniques as well as their combinations to determine which method performs best, without a significant utility trade-off. Our investigation provides a practical overview of various methods that allow one to achieve a competitive model performance, a significant reduction in model's size and an improved empirical adversarial robustness without a severe performance degradation. ",
    "url": "https://arxiv.org/abs/2205.02652",
    "authors": [
      "Dmitrii Usynin",
      "Helena Klause",
      "Daniel Rueckert",
      "Georgios Kaissis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.02659",
    "title": "Text Detection on Technical Drawings for the Digitization of Brown-field  Processes",
    "abstract": "This paper addresses the issue of autonomously detecting text on technical drawings. The detection of text on technical drawings is a critical step towards autonomous production machines, especially for brown-field processes, where no closed CAD-CAM solutions are available yet. Automating the process of reading and detecting text on technical drawings reduces the effort for handling inefficient media interruptions due to paper-based processes, which are often todays quasi-standard in brown-field processes. However, there are no reliable methods available yet to solve the issue of automatically detecting text on technical drawings. The unreliable detection of the contents on technical drawings using classical detection and object character recognition (OCR) tools is mainly due to the limited number of technical drawings and the captcha-like structure of the contents. Text is often combined with unknown symbols and interruptions by lines. Additionally, due to intellectual property rights and technical know-how issues, there are no out-of-the box training datasets available in the literature to train such models. This paper combines a domain knowledge-based generator to generate realistic technical drawings with a state-of-the-art object detection model to solve the issue of detecting text on technical drawings. The generator yields artificial technical drawings in a large variety and can be considered as a data augmentation generator. These artificial drawings are used for training, while the model is tested on real data. The authors show that artificially generated data of technical drawings improve the detection quality with an increasing number of drawings. ",
    "url": "https://arxiv.org/abs/2205.02659",
    "authors": [
      "Tobias Schlagenhauf",
      "Markus Netzer",
      "Jan Hillinger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02679",
    "title": "KnitCity: a machine learning-based, game-theoretical framework for  prediction assessment and seismic risk policy design",
    "abstract": "Knitted fabric exhibits avalanche-like events when deformed: by analogy with eathquakes, we are interested in predicting these \"knitquakes\". However, as in most analogous seismic models, the peculiar statistics of the corresponding time-series severely jeopardize this endeavour, due to the time intermittence and scale-invariance of these events. But more importantly, such predictions are hard to {\\it assess}: depending on the choice of what to predict, the results can be very different and not easily compared. Furthermore, forecasting models may be trained with various generic metrics which ignore some important specificities of the problem at hand, in our case seismic risk. Finally, these models often do not provide a clear strategy regarding the best way to use these predictions in practice. Here we introduce a framework that allows to design, evaluate and compare not only predictors but also decision-making policies: a model seismically active {\\it city} subjected to the crackling dynamics observed in the mechanical response of knitted fabric. We thus proceed to study the population of KnitCity, introducing a policy through which the mayor of the town can decide to either keep people in, which in case of large events cause human loss, or evacuate the city, which costs a daily fee. The policy only relies on past seismic observations. We construct efficient policies using a reinforcement learning environment and various time-series predictors based on artificial neural networks. By inducing a physically motivated metric on the predictors, this mechanism allows quantitative assessment and comparison of their relevance in the decision-making process. ",
    "url": "https://arxiv.org/abs/2205.02679",
    "authors": [
      "Adèle Douin",
      "J. P. Bruneton",
      "Frédéric Lechenault"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2205.02689",
    "title": "Hardware System Implementation for Human Detection using HOG and SVM  Algorithm",
    "abstract": "Human detection is a popular issue and has been widely used in many applications. However, including complexities in computation, leading to the human detection system implemented hardly in real-time applications. This paper presents the architecture of hardware, a human detection system that was simulated in the ModelSim tool. As a co-processor, this system was built to off-load to Central Processor Unit (CPU) and speed up the computation timing. The 130x66 RGB pixels of static input image attracted features and classify by using the Histogram of Oriented Gradient (HOG) algorithm and Support Vector Machine (SVM) algorithm, respectively. As a result, the accuracy rate of this system reaches 84.35 percent. And the timing for detection decreases to 0.757 ms at 50MHz frequency (54 times faster when this system was implemented in software by using the Matlab tool). ",
    "url": "https://arxiv.org/abs/2205.02689",
    "authors": [
      "Van-Cam Nguyen",
      "Hong-Tuan-Dinh Le",
      "Huu-Thuan Huynh"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02706",
    "title": "Sound Event Classification in an Industrial Environment: Pipe Leakage  Detection Use Case",
    "abstract": "In this work, a multi-stage Machine Learning (ML) pipeline is proposed for pipe leakage detection in an industrial environment. As opposed to other industrial and urban environments, the environment under study includes many interfering background noises, complicating the identification of leaks. Furthermore, the harsh environmental conditions limit the amount of data collected and impose the use of low-complexity algorithms. To address the environment's constraints, the developed ML pipeline applies multiple steps, each addressing the environment's challenges. The proposed ML pipeline first reduces the data dimensionality by feature selection techniques and then incorporates time correlations by extracting time-based features. The resultant features are fed to a Support Vector Machine (SVM) of low-complexity that generalizes well to a small amount of data. An extensive experimental procedure was carried out on two datasets, one with background industrial noise and one without, to evaluate the validity of the proposed pipeline. The SVM hyper-parameters and parameters specific to the pipeline steps were tuned as part of the experimental procedure. The best models obtained from the dataset with industrial noise and leaks were applied to datasets without noise and with and without leaks to test their generalizability. The results show that the model produces excellent results with 99\\% accuracy and an F1-score of 0.93 and 0.9 for the respective datasets. ",
    "url": "https://arxiv.org/abs/2205.02706",
    "authors": [
      "Ibrahim Shaer",
      "Abdallah Shami"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2205.02714",
    "title": "Neural Rendering in a Room: Amodal 3D Understanding and Free-Viewpoint  Rendering for the Closed Scene Composed of Pre-Captured Objects",
    "abstract": "We, as human beings, can understand and picture a familiar scene from arbitrary viewpoints given a single image, whereas this is still a grand challenge for computers. We hereby present a novel solution to mimic such human perception capability based on a new paradigm of amodal 3D scene understanding with neural rendering for a closed scene. Specifically, we first learn the prior knowledge of the objects in a closed scene via an offline stage, which facilitates an online stage to understand the room with unseen furniture arrangement. During the online stage, given a panoramic image of the scene in different layouts, we utilize a holistic neural-rendering-based optimization framework to efficiently estimate the correct 3D scene layout and deliver realistic free-viewpoint rendering. In order to handle the domain gap between the offline and online stage, our method exploits compositional neural rendering techniques for data augmentation in the offline training. The experiments on both synthetic and real datasets demonstrate that our two-stage design achieves robust 3D scene understanding and outperforms competing methods by a large margin, and we also show that our realistic free-viewpoint rendering enables various applications, including scene touring and editing. Code and data are available on the project webpage: https://zju3dv.github.io/nr_in_a_room/. ",
    "url": "https://arxiv.org/abs/2205.02714",
    "authors": [
      "Bangbang Yang",
      "Yinda Zhang",
      "Yijin Li",
      "Zhaopeng Cui",
      "Sean Fanello",
      "Hujun Bao",
      "Guofeng Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2205.02717",
    "title": "BasicTAD: an Astounding RGB-Only Baseline for Temporal Action Detection",
    "abstract": "Temporal action detection (TAD) is extensively studied in the video understanding community by following the object detection pipelines in images. However, complex designs are not uncommon in TAD, such as two-stream feature extraction, multi-stage training, complex temporal modeling, and global context fusion. In this paper, we do not aim to introduce any novel technique for TAD. Instead, we study a simple, straightforward, yet must-known baseline given the current status of complex design and low efficiency in TAD. In our simple baseline (BasicTAD), we decompose the TAD pipeline into several essential components: data sampling, backbone design, neck construction, and detection head. We empirically investigate the existing techniques in each component for this baseline and, more importantly, perform end-to-end training over the entire pipeline thanks to the simplicity in design. Our BasicTAD yields an astounding RGB-Only baseline very close to the state-of-the-art methods with two-stream inputs. In addition, we further improve the BasicTAD by preserving more temporal and spatial information in network representation (termed as BasicTAD Plus). Empirical results demonstrate that our BasicTAD Plus is very efficient and significantly outperforms the previous methods on the datasets of THUMOS14 and FineAction. Our approach can serve as a strong baseline for TAD. The code will be released at https://github.com/MCG-NJU/BasicTAD. ",
    "url": "https://arxiv.org/abs/2205.02717",
    "authors": [
      "Min Yang",
      "Guo Chen",
      "Yin-Dong Zheng",
      "Tong Lu",
      "Limin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02741",
    "title": "Based-CE white-box adversarial attack will not work using super-fitting",
    "abstract": "Deep Neural Networks (DNN) are widely used in various fields due to their powerful performance, but recent studies have shown that deep learning models are vulnerable to adversarial attacks-by adding a slight perturbation to the input, the model will get wrong results. It is especially dangerous for some systems with high security requirements, so this paper proposes a new defense method by using the model super-fitting status. Model's adversarial robustness (i.e., the accuracry under adversarial attack) has been greatly improved in this status. This paper mathematically proves the effectiveness of super-fitting, and proposes a method to make the model reach this status quickly-minimaze unrelated categories scores (MUCS). Theoretically, super-fitting can resist any existing (even future) Based on CE white-box adversarial attack. In addition, this paper uses a variety of powerful attack algorithms to evaluate the adversarial robustness of super-fitting and other nearly 50 defense models from recent conferences. The experimental results show that super-fitting method in this paper can make the trained model obtain the highest adversarial performance robustness. ",
    "url": "https://arxiv.org/abs/2205.02741",
    "authors": [
      "Youhuan Yang",
      "Lei Sun",
      "Leyu Dai",
      "Song Guo",
      "Xiuqing Mao",
      "Xiaoqin Wang",
      "Bayi Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.02743",
    "title": "Rethinking Classifier And Adversarial Attack",
    "abstract": "Various defense models have been proposed to resist adversarial attack algorithms, but existing adversarial robustness evaluation methods always overestimate the adversarial robustness of these models (i.e. not approaching the lower bound of robustness). To solve this problem, this paper first uses the Decouple Space method to divide the classifier into two parts: non-linear and linear. On this basis, this paper defines the representation vector of original example (and its space, i.e., the representation space) and uses Absolute Classification Boundaries Initialization (ACBI) iterative optimization to obtain a better attack starting point (i.e. attacking from this point can approach the lower bound of robustness faster). Particularly, this paper apply ACBI to nearly 50 widely-used defense models (including 8 architectures). Experimental results show that ACBI achieves lower robust accuracy in all cases. ",
    "url": "https://arxiv.org/abs/2205.02743",
    "authors": [
      "Youhuan Yang",
      "Lei Sun",
      "Leyu Dai",
      "Song Guo",
      "Xiuqing Mao",
      "Xiaoqin Wang",
      "Bayi Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.02767",
    "title": "Spiking Graph Convolutional Networks",
    "abstract": "Graph Convolutional Networks (GCNs) achieve an impressive performance due to the remarkable representation ability in learning the graph information. However, GCNs, when implemented on a deep network, require expensive computation power, making them difficult to be deployed on battery-powered devices. In contrast, Spiking Neural Networks (SNNs), which perform a bio-fidelity inference process, offer an energy-efficient neural architecture. In this work, we propose SpikingGCN, an end-to-end framework that aims to integrate the embedding of GCNs with the biofidelity characteristics of SNNs. The original graph data are encoded into spike trains based on the incorporation of graph convolution. We further model biological information processing by utilizing a fully connected layer combined with neuron nodes. In a wide range of scenarios (e.g. citation networks, image graph classification, and recommender systems), our experimental results show that the proposed method could gain competitive performance against state-of-the-art approaches. Furthermore, we show that SpikingGCN on a neuromorphic chip can bring a clear advantage of energy efficiency into graph data analysis, which demonstrates its great potential to construct environment-friendly machine learning models. ",
    "url": "https://arxiv.org/abs/2205.02767",
    "authors": [
      "Zulun Zhu",
      "Jiaying Peng",
      "Jintang Li",
      "Liang Chen",
      "Qi Yu",
      "Siqiang Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02795",
    "title": "Diversifying Neural Dialogue Generation via Negative Distillation",
    "abstract": "Generative dialogue models suffer badly from the generic response problem, limiting their applications to a few toy scenarios. Recently, an interesting approach, namely negative training, has been proposed to alleviate this problem by reminding the model not to generate high-frequency responses during training. However, its performance is hindered by two issues, ignoring low-frequency but generic responses and bringing low-frequency but meaningless responses. In this paper, we propose a novel negative training paradigm, called negative distillation, to keep the model away from the undesirable generic responses while avoiding the above problems. First, we introduce a negative teacher model that can produce query-wise generic responses, and then the student model is required to maximize the distance with multi-level negative knowledge. Empirical results show that our method outperforms previous negative training methods significantly. ",
    "url": "https://arxiv.org/abs/2205.02795",
    "authors": [
      "Yiwei Li",
      "Shaoxiong Feng",
      "Bin Sun",
      "Kan Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02805",
    "title": "Activity Detection in Long Surgical Videos using Spatio-Temporal Models",
    "abstract": "Automatic activity detection is an important component for developing technologies that enable next generation surgical devices and workflow monitoring systems. In many application, the videos of interest are long and include several activities; hence, the deep models designed for such purposes consist of a backbone and a temporal sequence modeling architecture. In this paper, we investigate both the state-of-the-art activity recognition and temporal models to find the architectures that yield the highest performance. We first benchmark these models on a large-scale activity recognition dataset in the operating room with over 800 full-length surgical videos. However, since most other medical applications lack such a large dataset, we further evaluate our models on the Cholec80 surgical phase segmentation dataset, consisting of only 40 training videos. For backbone architectures, we investigate both 3D ConvNets and most recent transformer-based models; for temporal modeling, we include temporal ConvNets, RNNs, and transformer models for a comprehensive and thorough study. We show that even in the case of limited labeled data, we can outperform the existing work by benefiting from models pre-trained on other tasks. ",
    "url": "https://arxiv.org/abs/2205.02805",
    "authors": [
      "Aidean Sharghi",
      "Zooey He",
      "Omid Mohareri"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02825",
    "title": "Dual Octree Graph Networks for Learning Adaptive Volumetric Shape  Representations",
    "abstract": "We present an adaptive deep representation of volumetric fields of 3D shapes and an efficient approach to learn this deep representation for high-quality 3D shape reconstruction and auto-encoding. Our method encodes the volumetric field of a 3D shape with an adaptive feature volume organized by an octree and applies a compact multilayer perceptron network for mapping the features to the field value at each 3D position. An encoder-decoder network is designed to learn the adaptive feature volume based on the graph convolutions over the dual graph of octree nodes. The core of our network is a new graph convolution operator defined over a regular grid of features fused from irregular neighboring octree nodes at different levels, which not only reduces the computational and memory cost of the convolutions over irregular neighboring octree nodes, but also improves the performance of feature learning. Our method effectively encodes shape details, enables fast 3D shape reconstruction, and exhibits good generality for modeling 3D shapes out of training categories. We evaluate our method on a set of reconstruction tasks of 3D shapes and scenes and validate its superiority over other existing approaches. Our code, data, and trained models are available at https://wang-ps.github.io/dualocnn. ",
    "url": "https://arxiv.org/abs/2205.02825",
    "authors": [
      "Peng-Shuai Wang",
      "Yang Liu",
      "Xin Tong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02834",
    "title": "Fixing Malfunctional Objects With Learned Physical Simulation and  Functional Prediction",
    "abstract": "This paper studies the problem of fixing malfunctional 3D objects. While previous works focus on building passive perception models to learn the functionality from static 3D objects, we argue that functionality is reckoned with respect to the physical interactions between the object and the user. Given a malfunctional object, humans can perform mental simulations to reason about its functionality and figure out how to fix it. Inspired by this, we propose FixIt, a dataset that contains about 5k poorly-designed 3D physical objects paired with choices to fix them. To mimic humans' mental simulation process, we present FixNet, a novel framework that seamlessly incorporates perception and physical dynamics. Specifically, FixNet consists of a perception module to extract the structured representation from the 3D point cloud, a physical dynamics prediction module to simulate the results of interactions on 3D objects, and a functionality prediction module to evaluate the functionality and choose the correct fix. Experimental results show that our framework outperforms baseline models by a large margin, and can generalize well to objects with similar interaction types. ",
    "url": "https://arxiv.org/abs/2205.02834",
    "authors": [
      "Yining Hong",
      "Kaichun Mo",
      "Li Yi",
      "Leonidas J. Guibas",
      "Antonio Torralba",
      "Joshua B. Tenenbaum",
      "Chuang Gan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2205.02836",
    "title": "Neural 3D Scene Reconstruction with the Manhattan-world Assumption",
    "abstract": "This paper addresses the challenge of reconstructing 3D indoor scenes from multi-view images. Many previous works have shown impressive reconstruction results on textured objects, but they still have difficulty in handling low-textured planar regions, which are common in indoor scenes. An approach to solving this issue is to incorporate planer constraints into the depth map estimation in multi-view stereo-based methods, but the per-view plane estimation and depth optimization lack both efficiency and multi-view consistency. In this work, we show that the planar constraints can be conveniently integrated into the recent implicit neural representation-based reconstruction methods. Specifically, we use an MLP network to represent the signed distance function as the scene geometry. Based on the Manhattan-world assumption, planar constraints are employed to regularize the geometry in floor and wall regions predicted by a 2D semantic segmentation network. To resolve the inaccurate segmentation, we encode the semantics of 3D points with another MLP and design a novel loss that jointly optimizes the scene geometry and semantics in 3D space. Experiments on ScanNet and 7-Scenes datasets show that the proposed method outperforms previous methods by a large margin on 3D reconstruction quality. The code is available at https://zju3dv.github.io/manhattan_sdf. ",
    "url": "https://arxiv.org/abs/2205.02836",
    "authors": [
      "Haoyu Guo",
      "Sida Peng",
      "Haotong Lin",
      "Qianqian Wang",
      "Guofeng Zhang",
      "Hujun Bao",
      "Xiaowei Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.02260",
    "title": "Multivariate Prediction Intervals for Random Forests",
    "abstract": "Accurate uncertainty estimates can significantly improve the performance of iterative design of experiments, as in Sequential and Reinforcement learning. For many such problems in engineering and the physical sciences, the design task depends on multiple correlated model outputs as objectives and/or constraints. To better solve these problems, we propose a recalibrated bootstrap method to generate multivariate prediction intervals for bagged models and show that it is well-calibrated. We apply the recalibrated bootstrap to a simulated sequential learning problem with multiple objectives and show that it leads to a marked decrease in the number of iterations required to find a satisfactory candidate. This indicates that the recalibrated bootstrap could be a valuable tool for practitioners using machine learning to optimize systems with multiple competing targets. ",
    "url": "https://arxiv.org/abs/2205.02260",
    "authors": [
      "Brendan Folie",
      "Maxwell Hutchinson"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02350",
    "title": "A Fully Adaptive Strategy for Hamiltonian Cycles in the Semi-Random  Graph Process",
    "abstract": "The semi-random graph process is a single player game in which the player is initially presented an empty graph on $n$ vertices. In each round, a vertex $u$ is presented to the player independently and uniformly at random. The player then adaptively selects a vertex $v$, and adds the edge $uv$ to the graph. For a fixed monotone graph property, the objective of the player is to force the graph to satisfy this property with high probability in as few rounds as possible. We focus on the problem of constructing a Hamiltonian cycle in as few rounds as possible. In particular, we present an adaptive strategy for the player which achieves it in $\\alpha n$ rounds, where $\\alpha < 2.01678$ is derived from the solution to some system of differential equations. We also show that the player cannot achieve the desired property in less than $\\beta n$ rounds, where $\\beta > 1.26575$. These results improve the previously best known bounds and, as a result, the gap between the upper and lower bounds is decreased from 1.39162 to 0.75102. ",
    "url": "https://arxiv.org/abs/2205.02350",
    "authors": [
      "Pu Gao",
      "Calum MacRury",
      "Pawel Pralat"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2205.02410",
    "title": "Dynamic Bayesian Network Auxiliary ABC-SMC for Hybrid Model Bayesian  Inference to Accelerate Biomanufacturing Process Mechanism Learning and  Robust Control",
    "abstract": "Driven by the critical needs of biomanufacturing 4.0, we present a probabilistic knowledge graph hybrid model characterizing complex spatial-temporal causal interdependencies of underlying bioprocessing mechanisms. It can faithfully capture the important properties, including nonlinear reactions, partially observed state, and nonstationary dynamics. Given limited process observations, we derive a posterior distribution quantifying model uncertainty, which can facilitate mechanism learning and support robust process control. To avoid evaluation of intractable likelihood, Approximate Bayesian Computation sampling with Sequential Monte Carlo (ABC-SMC) is developed to approximate the posterior distribution. Given high stochastic and model uncertainties, it is computationally expensive to match process output trajectories. Therefore, we propose a linear Gaussian dynamic Bayesian network (LG-DBN) auxiliary likelihood-based ABC-SMC algorithm. Through matching observed and simulated summary statistics, the proposed approach can dramatically reduce the computation cost and accelerate the posterior approximation convergence. ",
    "url": "https://arxiv.org/abs/2205.02410",
    "authors": [
      "Wei Xie",
      "Keqi Wang",
      "Hua Zheng",
      "Ben Feng"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02592",
    "title": "Investigating molecular transport in the human brain from MRI with  physics-informed neural networks",
    "abstract": "In recent years, a plethora of methods combining deep neural networks and partial differential equations have been developed. A widely known and popular example are physics-informed neural networks. They solve forward and inverse problems involving partial differential equations in terms of a neural network training problem. We apply physics-informed neural networks as well as the finite element method to estimate the diffusion coefficient governing the long term, i.e. over days, spread of molecules in the human brain from a novel magnetic resonance imaging technique. Synthetic testcases are created to demonstrate that the standard formulation of the physics-informed neural network faces challenges with noisy measurements in our application. Our numerical results demonstrate that the residual of the partial differential equation after training needs to be small in order to obtain accurate recovery of the diffusion coefficient. To achieve this, we apply several strategies such as tuning the weights and the norms used in the loss function as well as residual based adaptive refinement and exchange of residual training points. We find that the diffusion coefficient estimated with PINNs from magnetic resonance images becomes consistent with results from a finite element based approach when the residuum after training becomes small. The observations presented in this work are an important first step towards solving inverse problems on observations from large cohorts of patients in a semi-automated fashion with physics-informed neural networks. ",
    "url": "https://arxiv.org/abs/2205.02592",
    "authors": [
      "Bastian Zapf",
      "Johannes Haubner",
      "Miroslav Kuchta",
      "Geir Ringstad",
      "Per Kristian Eide",
      "Kent-Andre Mardal"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2205.02637",
    "title": "Towards Fast Simulation of Environmental Fluid Mechanics with  Multi-Scale Graph Neural Networks",
    "abstract": "Numerical simulators are essential tools in the study of natural fluid-systems, but their performance often limits application in practice. Recent machine-learning approaches have demonstrated their ability to accelerate spatio-temporal predictions, although, with only moderate accuracy in comparison. Here we introduce MultiScaleGNN, a novel multi-scale graph neural network model for learning to infer unsteady continuum mechanics in problems encompassing a range of length scales and complex boundary geometries. We demonstrate this method on advection problems and incompressible fluid dynamics, both fundamental phenomena in oceanic and atmospheric processes. Our results show good extrapolation to new domain geometries and parameters for long-term temporal simulations. Simulations obtained with MultiScaleGNN are between two and four orders of magnitude faster than those on which it was trained. ",
    "url": "https://arxiv.org/abs/2205.02637",
    "authors": [
      "Mario Lino",
      "Stathi Fotiadis",
      "Anil A. Bharath",
      "Chris Cantwell"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.02666",
    "title": "LAWS: Look Around and Warm-Start Natural Gradient Descent for Quantum  Neural Networks",
    "abstract": "Variational quantum algorithms (VQAs) have recently received significant attention from the research community due to their promising performance in Noisy Intermediate-Scale Quantum computers (NISQ). However, VQAs run on parameterized quantum circuits (PQC) with randomly initialized parameters are characterized by barren plateaus (BP) where the gradient vanishes exponentially in the number of qubits. In this paper, we first review quantum natural gradient (QNG), which is one of the most popular algorithms used in VQA, from the classical first-order optimization point of view. Then, we proposed a \\underline{L}ook \\underline{A}round \\underline{W}arm-\\underline{S}tart QNG (LAWS) algorithm to mitigate the widespread existing BP issues. LAWS is a combinatorial optimization strategy taking advantage of model parameter initialization and fast convergence of QNG. LAWS repeatedly reinitializes parameter search space for the next iteration parameter update. The reinitialized parameter search space is carefully chosen by sampling the gradient close to the current optimal. Moreover, we present a unified framework (WS-SGD) for integrating parameter initialization techniques into the optimizer. We provide the convergence proof of the proposed framework for both convex and non-convex objective functions based on Polyak-Lojasiewicz (PL) condition. Our experiment results show that the proposed algorithm could mitigate the BP and have better generalization ability in quantum classification problems. ",
    "url": "https://arxiv.org/abs/2205.02666",
    "authors": [
      "Zeyi Tao",
      "Jindi Wu",
      "Qi Xia",
      "Qun Li"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1909.11387",
    "title": "Motion Estimation in Occupancy Grid Maps in Stationary Settings Using  Recurrent Neural Networks",
    "abstract": " Title: Motion Estimation in Occupancy Grid Maps in Stationary Settings Using  Recurrent Neural Networks ",
    "url": "https://arxiv.org/abs/1909.11387",
    "authors": [
      "Marcel Schreiber",
      "Vasileios Belagiannis",
      "Claudius Glaeser",
      "Klaus Dietmayer"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2011.08659",
    "title": "Dynamic Occupancy Grid Mapping with Recurrent Neural Networks",
    "abstract": " Title: Dynamic Occupancy Grid Mapping with Recurrent Neural Networks ",
    "url": "https://arxiv.org/abs/2011.08659",
    "authors": [
      "Marcel Schreiber",
      "Vasileios Belagiannis",
      "Claudius Gläser",
      "Klaus Dietmayer"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2101.04269",
    "title": "Pneumonia Detection on Chest X-ray using Radiomic Features and  Contrastive Learning",
    "abstract": " Comments: Accepted for ISBI 2021 ",
    "url": "https://arxiv.org/abs/2101.04269",
    "authors": [
      "Yan Han",
      "Chongyan Chen",
      "Ahmed H Tewfik",
      "Ying Ding",
      "Yifan Peng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2102.11010",
    "title": "Resilience of Bayesian Layer-Wise Explanations under Adversarial Attacks",
    "abstract": " Title: Resilience of Bayesian Layer-Wise Explanations under Adversarial Attacks ",
    "url": "https://arxiv.org/abs/2102.11010",
    "authors": [
      "Ginevra Carbone",
      "Guido Sanguinetti",
      "Luca Bortolussi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2102.13167",
    "title": "Images, Emotions, and Credibility: Effect of Emotional Facial Images on  Perceptions of News Content Bias and Source Credibility in Social Media",
    "abstract": " Comments: 12 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2102.13167",
    "authors": [
      "Alireza Karduni",
      "Ryan Wesslen",
      "Douglas Markant",
      "Wenwen Dou"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2103.06257",
    "title": "Maximum Entropy RL (Provably) Solves Some Robust RL Problems",
    "abstract": " Comments: Published at ICLR 2022. Blog post and videos: this https URL arXiv admin note: text overlap with arXiv:1910.01913 ",
    "url": "https://arxiv.org/abs/2103.06257",
    "authors": [
      "Benjamin Eysenbach",
      "Sergey Levine"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2104.04066",
    "title": "Synchronization in Electric Power Networks with Inherent Heterogeneity  Up to 100% Inverter-Based Renewable Generation",
    "abstract": " Title: Synchronization in Electric Power Networks with Inherent Heterogeneity  Up to 100% Inverter-Based Renewable Generation ",
    "url": "https://arxiv.org/abs/2104.04066",
    "authors": [
      "Amirhossein Sajadi",
      "Rick Wallace Kenyon",
      "Bri-Mathias Hodge"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2104.09083",
    "title": "Multi-fold Correlation Attention Network for Predicting Traffic Speeds  with Heterogeneous Frequency",
    "abstract": " Title: Multi-fold Correlation Attention Network for Predicting Traffic Speeds  with Heterogeneous Frequency ",
    "url": "https://arxiv.org/abs/2104.09083",
    "authors": [
      "Yidan Sun",
      "Guiyuan Jiang",
      "Siew-Kei Lam",
      "Peilan He",
      "Fangxin Ning"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2104.12710",
    "title": "Optimal Algorithm Allocation for Robotic Network Cloud Systems",
    "abstract": " Comments: This work is accepted for publication in the Elsevier Journal of Robotics and Autonomous Systems. Personal use of this material is permitted. Permission from Elsevier must be obtained for all other uses ",
    "url": "https://arxiv.org/abs/2104.12710",
    "authors": [
      "Saeid Alirezazadeh",
      "André Correia",
      "Luís A. Alexandre"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2106.06017",
    "title": "Cross-lingual Emotion Detection",
    "abstract": " Title: Cross-lingual Emotion Detection ",
    "url": "https://arxiv.org/abs/2106.06017",
    "authors": [
      "Sabit Hassan",
      "Shaden Shaar",
      "Kareem Darwish"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2108.08230",
    "title": "Predicting Basin Stability of Power Grids using Graph Neural Networks",
    "abstract": " Comments: 17 pages, 25 pages including appendix, 18 pictures plus tikz pictures ",
    "url": "https://arxiv.org/abs/2108.08230",
    "authors": [
      "Christian Nauck",
      "Michael Lindner",
      "Konstantin Schürholt",
      "Haoming Zhang",
      "Paul Schultz",
      "Jürgen Kurths",
      "Ingrid Isenhardt",
      "Frank Hellmann"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2108.09228",
    "title": "Dual-Neighborhood Deep Fusion Network for Point Cloud Analysis",
    "abstract": " Comments: ICMEW2022 ",
    "url": "https://arxiv.org/abs/2108.09228",
    "authors": [
      "Guoquan Xu",
      "Hezhi Cao",
      "Yifan Zhang",
      "Jianwei Wan",
      "Ke Xu",
      "Yanxin Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.03697",
    "title": "U-FNO -- An enhanced Fourier neural operator-based deep-learning model  for multiphase flow",
    "abstract": " Title: U-FNO -- An enhanced Fourier neural operator-based deep-learning model  for multiphase flow ",
    "url": "https://arxiv.org/abs/2109.03697",
    "authors": [
      "Gege Wen",
      "Zongyi Li",
      "Kamyar Azizzadenesheli",
      "Anima Anandkumar",
      "Sally M. Benson"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.04223",
    "title": "KELM: Knowledge Enhanced Pre-Trained Language Representations with  Message Passing on Hierarchical Relational Graphs",
    "abstract": " Comments: ICLR 2022 on DLG4NLP ",
    "url": "https://arxiv.org/abs/2109.04223",
    "authors": [
      "Yinquan Lu",
      "Haonan Lu",
      "Guirong Fu",
      "Qun Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2110.07732",
    "title": "The Neural Data Router: Adaptive Control Flow in Transformers Improves  Systematic Generalization",
    "abstract": " Comments: Accepted to ICLR 2022 ",
    "url": "https://arxiv.org/abs/2110.07732",
    "authors": [
      "Róbert Csordás",
      "Kazuki Irie",
      "Jürgen Schmidhuber"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2110.09060",
    "title": "Discovery-and-Selection: Towards Optimal Multiple Instance Learning for  Weakly Supervised Object Detection",
    "abstract": " Title: Discovery-and-Selection: Towards Optimal Multiple Instance Learning for  Weakly Supervised Object Detection ",
    "url": "https://arxiv.org/abs/2110.09060",
    "authors": [
      "Shiwei Zhang",
      "Wei Ke",
      "Lin Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.12796",
    "title": "Data-Driven Demand-Side Flexibility Quantification: Prediction and  Approximation of Flexibility Envelopes",
    "abstract": " Title: Data-Driven Demand-Side Flexibility Quantification: Prediction and  Approximation of Flexibility Envelopes ",
    "url": "https://arxiv.org/abs/2110.12796",
    "authors": [
      "Nami Hekmat",
      "Hanmin Cai",
      "Thierry Zufferey",
      "Gabriela Hug",
      "Philipp Heer"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2110.14748",
    "title": "Context-Tree-Based Lossy Compression and Its Application to CSI  Representation",
    "abstract": " Comments: 12 pages, 9 figures. Accepted for publication in the IEEE Transactions on Communications ",
    "url": "https://arxiv.org/abs/2110.14748",
    "authors": [
      "Henrique K. Miyamoto",
      "Sheng Yang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2110.14993",
    "title": "Using Time-Series Privileged Information for Provably Efficient Learning  of Prediction Models",
    "abstract": " Title: Using Time-Series Privileged Information for Provably Efficient Learning  of Prediction Models ",
    "url": "https://arxiv.org/abs/2110.14993",
    "authors": [
      "Rickard K.A. Karlsson",
      "Martin Willbo",
      "Zeshan Hussain",
      "Rahul G. Krishnan",
      "David Sontag",
      "Fredrik D. Johansson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2111.06015",
    "title": "Uformer: A Unet based dilated complex & real dual-path conformer network  for simultaneous speech enhancement and dereverberation",
    "abstract": " Comments: Accepted by ICASSP 2022 ",
    "url": "https://arxiv.org/abs/2111.06015",
    "authors": [
      "Yihui Fu",
      "Yun Liu",
      "Jingdong Li",
      "Dawei Luo",
      "Shubo Lv",
      "Yukai Jv",
      "Lei Xie"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2112.01797",
    "title": "Detection of Large Vessel Occlusions using Deep Learning by Deforming  Vessel Tree Segmentations",
    "abstract": " Comments: 7 pages. Accepted at BVM-Workshop 2022, Springer ",
    "url": "https://arxiv.org/abs/2112.01797",
    "authors": [
      "Florian Thamm",
      "Oliver Taubmann",
      "Markus Jürgens",
      "Hendrik Ditt",
      "Andreas Maier"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.06887",
    "title": "Nonideality-Aware Training for Accurate and Robust Low-Power Memristive  Neural Networks",
    "abstract": " Comments: 32 pages, 20 figures, 4 tables ",
    "url": "https://arxiv.org/abs/2112.06887",
    "authors": [
      "Dovydas Joksas",
      "Erwei Wang",
      "Nikolaos Barmpatsalos",
      "Wing H. Ng",
      "Anthony J. Kenyon",
      "George A. Constantinides",
      "Adnan Mehonic"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2112.07610",
    "title": "Improving Compositional Generalization with Latent Structure and Data  Augmentation",
    "abstract": " Comments: NAACL 2022 ",
    "url": "https://arxiv.org/abs/2112.07610",
    "authors": [
      "Linlu Qiu",
      "Peter Shaw",
      "Panupong Pasupat",
      "Paweł Krzysztof Nowak",
      "Tal Linzen",
      "Fei Sha",
      "Kristina Toutanova"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.11644",
    "title": "Reconstructing social sensitivity from evolution of content volume in  Twitter",
    "abstract": " Title: Reconstructing social sensitivity from evolution of content volume in  Twitter ",
    "url": "https://arxiv.org/abs/2112.11644",
    "authors": [
      "Sebastián Pinto",
      "Marcos Trevisan",
      "Pablo Balenzuela"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2112.13399",
    "title": "The Communication Complexity of Subsequence Detection",
    "abstract": " Comments: Updated to remove results already present in [BC18] ",
    "url": "https://arxiv.org/abs/2112.13399",
    "authors": [
      "Mason DiCicco",
      "Daniel Reichman"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2112.14265",
    "title": "Learning in Repeated Interactions on Networks",
    "abstract": " Comments: 19 pages ",
    "url": "https://arxiv.org/abs/2112.14265",
    "authors": [
      "Wanying Huang",
      "Philipp Strack",
      "Omer Tamuz"
    ],
    "subjectives": [
      "Theoretical Economics (econ.TH)",
      "Computer Science and Game Theory (cs.GT)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2112.14838",
    "title": "Facial Input Decompositions for Robust Peak and Reachable Set Estimation  under Polyhedral Uncertainty",
    "abstract": " Comments: 18 pages, 10 figures, 1 table ",
    "url": "https://arxiv.org/abs/2112.14838",
    "authors": [
      "Jared Miller",
      "Mario Sznaier"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2112.14843",
    "title": "A Graph Attention Learning Approach to Antenna Tilt Optimization",
    "abstract": " Title: A Graph Attention Learning Approach to Antenna Tilt Optimization ",
    "url": "https://arxiv.org/abs/2112.14843",
    "authors": [
      "Yifei Jin",
      "Filippo Vannella",
      "Maxime Bouton",
      "Jaeseong Jeong",
      "Ezeddin Al Hakim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.15348",
    "title": "Training Recurrent Neural Networks by Sequential Least Squares and the  Alternating Direction Method of Multipliers",
    "abstract": " Comments: 15 pages, 3 figures. Submitted for publication ",
    "url": "https://arxiv.org/abs/2112.15348",
    "authors": [
      "Alberto Bemporad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2201.05848",
    "title": "TWikiL -- The Twitter Wikipedia Link Dataset",
    "abstract": " Title: TWikiL -- The Twitter Wikipedia Link Dataset ",
    "url": "https://arxiv.org/abs/2201.05848",
    "authors": [
      "Florian Meier"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2201.11147",
    "title": "OntoProtein: Protein Pretraining With Gene Ontology Embedding",
    "abstract": " Comments: Accepted by ICLR 2022 ",
    "url": "https://arxiv.org/abs/2201.11147",
    "authors": [
      "Ningyu Zhang",
      "Zhen Bi",
      "Xiaozhuan Liang",
      "Siyuan Cheng",
      "Haosen Hong",
      "Shumin Deng",
      "Jiazhang Lian",
      "Qiang Zhang",
      "Huajun Chen"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04461",
    "title": "A Multi-Task Recurrent Neural Network for End-to-End Dynamic Occupancy  Grid Mapping",
    "abstract": " Comments: Accepted for presentation at the 2022 33rd IEEE Intelligent Vehicles Symposium (IV) (IV 2022), June 5-9, 2022, in Aachen, Germany ",
    "url": "https://arxiv.org/abs/2202.04461",
    "authors": [
      "Marcel Schreiber",
      "Vasileios Belagiannis",
      "Claudius Gläser",
      "Klaus Dietmayer"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2202.05258",
    "title": "Hardness of Noise-Free Learning for Two-Hidden-Layer Neural Networks",
    "abstract": " Comments: 34 pages, v2: fixed bug in proof from v1 ",
    "url": "https://arxiv.org/abs/2202.05258",
    "authors": [
      "Sitan Chen",
      "Aravind Gollakota",
      "Adam R. Klivans",
      "Raghu Meka"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Complexity (cs.CC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2202.09403",
    "title": "Multiple Ancillary Services Provision by Distributed Energy Resources in  Active Distribution Networks",
    "abstract": " Title: Multiple Ancillary Services Provision by Distributed Energy Resources in  Active Distribution Networks ",
    "url": "https://arxiv.org/abs/2202.09403",
    "authors": [
      "Ognjen Stanojev",
      "Yi Guo",
      "Petros Aristidou",
      "Gabriela Hug"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2202.13569",
    "title": "On the Application of Quasi-Degradation to Network NOMA in Downlink CoMP  Systems",
    "abstract": " Title: On the Application of Quasi-Degradation to Network NOMA in Downlink CoMP  Systems ",
    "url": "https://arxiv.org/abs/2202.13569",
    "authors": [
      "Yanshi Sun",
      "Zhiguo Ding",
      "Xuchu Dai",
      "Momiao Zhou",
      "Zhizhong Ding"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2203.00007",
    "title": "GCN-Transformer for short-term passenger flow prediction on holidays in  urban rail transit systems",
    "abstract": " Comments: 26 pages, 10 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2203.00007",
    "authors": [
      "Shuxin Zhang",
      "Jinlei Zhang",
      "Lixing Yang",
      "Jiateng Yin",
      "Ziyou Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.05241",
    "title": "Theory of Network Wave (On a Primary Path)",
    "abstract": " Title: Theory of Network Wave (On a Primary Path) ",
    "url": "https://arxiv.org/abs/2203.05241",
    "authors": [
      "Bo Li",
      "Mao Yang",
      "Zhongjiang Yan"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.08777",
    "title": "Object discovery and representation networks",
    "abstract": " Comments: Technical report ",
    "url": "https://arxiv.org/abs/2203.08777",
    "authors": [
      "Olivier J. Hénaff",
      "Skanda Koppula",
      "Evan Shelhamer",
      "Daniel Zoran",
      "Andrew Jaegle",
      "Andrew Zisserman",
      "João Carreira",
      "Relja Arandjelović"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.15806",
    "title": "Bayesian Photonic Accelerators for Energy Efficient and Noise Robust  Neural Processing",
    "abstract": " Comments: 10 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2203.15806",
    "authors": [
      "George Sarantoglou",
      "Adonis Bogris",
      "Charis Mesaritakis",
      "Sergios Theodoridis"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2204.01349",
    "title": "MGRR-Net: Multi-level Graph Relational Reasoning Network for Facial  Action Units Detection",
    "abstract": " Comments: 10 pages, 4 figures, 8 tables; submitted to IEEE TCyb for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2204.01349",
    "authors": [
      "Xuri Ge",
      "Joemon M. Jose",
      "Songpei Xu",
      "Xiao Liu",
      "Hu Han"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.04009",
    "title": "On Projectivity in Markov Logic Networks",
    "abstract": " Comments: Added formal comparison to previous projective fragments. Added a proof for transforming RBM to MLN. For the most updated version please visit : this https URL ",
    "url": "https://arxiv.org/abs/2204.04009",
    "authors": [
      "Sagar Malhotra",
      "Luciano Serafini"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.04952",
    "title": "MGIMN: Multi-Grained Interactive Matching Network for Few-shot Text  Classification",
    "abstract": " Comments: 10 pages, 2 figures, 6 tabels ",
    "url": "https://arxiv.org/abs/2204.04952",
    "authors": [
      "Jianhai Zhang",
      "Mieradilijiang Maimaiti",
      "Xing Gao",
      "Yuanhang Zheng",
      "Ji Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.05084",
    "title": "XMP-Font: Self-Supervised Cross-Modality Pre-training for Few-Shot Font  Generation",
    "abstract": " Comments: Accepted by CVPR2022 ",
    "url": "https://arxiv.org/abs/2204.05084",
    "authors": [
      "Wei Liu",
      "Fangyue Liu",
      "Fei Ding",
      "Qian He",
      "Zili Yi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08198",
    "title": "UTNLP at SemEval-2022 Task 6: A Comparative Analysis of Sarcasm  Detection using generative-based and mutation-based data augmentation",
    "abstract": " Comments: 6 pages, 2 figures, International Workshop on Semantic Evaluation co-located with NAACL ",
    "url": "https://arxiv.org/abs/2204.08198",
    "authors": [
      "Amirhossein Abaskohi",
      "Arash Rasouli",
      "Tanin Zeraati",
      "Behnam Bahrak"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.11640",
    "title": "Hybrid ISTA: Unfolding ISTA With Convergence Guarantees Using Free-Form  Deep Neural Networks",
    "abstract": " Comments: 109 pages, 16 figures; this is a draft and the final version has been accepted by TPAMI (DOI: 10.1109/TPAMI.2022.3172214) ",
    "url": "https://arxiv.org/abs/2204.11640",
    "authors": [
      "Ziyang Zheng",
      "Wenrui Dai",
      "Duoduo Xue",
      "Chenglin Li",
      "Junni Zou",
      "Hongkai Xiong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.12037",
    "title": "Causal Reasoning with Spatial-temporal Representation Learning: A  Prospective Study",
    "abstract": " Comments: This work has been submitted to Machine Intelligence Research ",
    "url": "https://arxiv.org/abs/2204.12037",
    "authors": [
      "Yang Liu",
      "Yushen Wei",
      "Hong Yan",
      "Guanbin Li",
      "Liang Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2204.13278",
    "title": "Sums of Distances on Graphs and Embeddings into Euclidean Space",
    "abstract": " Title: Sums of Distances on Graphs and Embeddings into Euclidean Space ",
    "url": "https://arxiv.org/abs/2204.13278",
    "authors": [
      "Stefan Steinerberger"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2204.13822",
    "title": "HashNWalk: Hash and Random Walk Based Anomaly Detection in Hyperedge  Streams",
    "abstract": " Comments: To be published in IJCAI 2022 ",
    "url": "https://arxiv.org/abs/2204.13822",
    "authors": [
      "Geon Lee",
      "Minyoung Choe",
      "Kijung Shin"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2204.13957",
    "title": "PIE: a Parameter and Inference Efficient Solution for Large Scale  Knowledge Graph Embedding Reasoning",
    "abstract": " Title: PIE: a Parameter and Inference Efficient Solution for Large Scale  Knowledge Graph Embedding Reasoning ",
    "url": "https://arxiv.org/abs/2204.13957",
    "authors": [
      "Linlin Chao",
      "Xiexiong Lin",
      "Taifeng Wang",
      "Wei Chu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.01051",
    "title": "RANG: A Residual-based Adaptive Node Generation Method for  Physics-Informed Neural Networks",
    "abstract": " Title: RANG: A Residual-based Adaptive Node Generation Method for  Physics-Informed Neural Networks ",
    "url": "https://arxiv.org/abs/2205.01051",
    "authors": [
      "Wei Peng",
      "Weien Zhou",
      "Xiaoya Zhang",
      "Wen Yao",
      "Zheliang Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2205.01054",
    "title": "A Change Dynamic Model for the Online Detection of Gradual Change",
    "abstract": " Title: A Change Dynamic Model for the Online Detection of Gradual Change ",
    "url": "https://arxiv.org/abs/2205.01054",
    "authors": [
      "Chris Browne"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2205.01142",
    "title": "Cost-Aware Evaluation and Model Scaling for LiDAR-Based 3D Object  Detection",
    "abstract": " Title: Cost-Aware Evaluation and Model Scaling for LiDAR-Based 3D Object  Detection ",
    "url": "https://arxiv.org/abs/2205.01142",
    "authors": [
      "Xiaofang Wang",
      "Kris M. Kitani"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.01906",
    "title": "ASE: Large-Scale Reusable Adversarial Skill Embeddings for Physically  Simulated Characters",
    "abstract": " Title: ASE: Large-Scale Reusable Adversarial Skill Embeddings for Physically  Simulated Characters ",
    "url": "https://arxiv.org/abs/2205.01906",
    "authors": [
      "Xue Bin Peng",
      "Yunrong Guo",
      "Lina Halper",
      "Sergey Levine",
      "Sanja Fidler"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.01975",
    "title": "Aligning to Social Norms and Values in Interactive Narratives",
    "abstract": " Comments: In Proceedings of NAACL-2022 ",
    "url": "https://arxiv.org/abs/2205.01975",
    "authors": [
      "Prithviraj Ammanabrolu",
      "Liwei Jiang",
      "Maarten Sap",
      "Hannaneh Hajishirzi",
      "Yejin Choi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02105",
    "title": "Neuroevolutionary Multi-objective approaches to Trajectory Prediction in  Autonomous Vehicles",
    "abstract": " Comments: 4 pages, 1 figure, 6 tables ",
    "url": "https://arxiv.org/abs/2205.02105",
    "authors": [
      "Fergal Stapleton",
      "Edgar Galván",
      "Ganesh Sistu",
      "Senthil Yogamani"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]