[
  {
    "id": "arXiv:2204.12495",
    "title": "Enhancing Privacy against Inversion Attacks in Federated Learning by  using Mixing Gradients Strategies",
    "abstract": "Federated learning reduces the risk of information leakage, but remains vulnerable to attacks. We investigate how several neural network design decisions can defend against gradients inversion attacks. We show that overlapping gradients provides numerical resistance to gradient inversion on the highly vulnerable dense layer. Specifically, we propose to leverage batching to maximise mixing of gradients by choosing an appropriate loss function and drawing identical labels. We show that otherwise it is possible to directly recover all vectors in a mini-batch without any numerical optimisation due to the de-mixing nature of the cross entropy loss. To accurately assess data recovery, we introduce an absolute variation distance (AVD) metric for information leakage in images, derived from total variation. In contrast to standard metrics, e.g. Mean Squared Error or Structural Similarity Index, AVD offers a continuous metric for extracting information in noisy images. Finally, our empirical results on information recovery from various inversion attacks and training performance supports our defense strategies. These strategies are also shown to be useful for deep convolutional neural networks such as LeNET for image recognition. We hope that this study will help guide the development of further strategies that achieve a trustful federation policy. ",
    "url": "https://arxiv.org/abs/2204.12495",
    "authors": [
      "Shaltiel Eloul",
      "Fran Silavong",
      "Sanket Kamthe",
      "Antonios Georgiadis",
      "Sean J. Moran"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2204.12496",
    "title": "Self-Supervised Information Bottleneck for Deep Multi-View Subspace  Clustering",
    "abstract": "In this paper, we explore the problem of deep multi-view subspace clustering framework from an information-theoretic point of view. We extend the traditional information bottleneck principle to learn common information among different views in a self-supervised manner, and accordingly establish a new framework called Self-supervised Information Bottleneck based Multi-view Subspace Clustering (SIB-MSC). Inheriting the advantages from information bottleneck, SIB-MSC can learn a latent space for each view to capture common information among the latent representations of different views by removing superfluous information from the view itself while retaining sufficient information for the latent representations of other views. Actually, the latent representation of each view provides a kind of self-supervised signal for training the latent representations of other views. Moreover, SIB-MSC attempts to learn the other latent space for each view to capture the view-specific information by introducing mutual information based regularization terms, so as to further improve the performance of multi-view subspace clustering. To the best of our knowledge, this is the first work to explore information bottleneck for multi-view subspace clustering. Extensive experiments on real-world multi-view data demonstrate that our method achieves superior performance over the related state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2204.12496",
    "authors": [
      "Shiye Wang",
      "Changsheng Li",
      "Yanming Li",
      "Ye Yuan",
      "Guoren Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.12533",
    "title": "A Gaussian Process Model for Opponent Prediction in Autonomous Racing",
    "abstract": "In head-to-head racing, performing tightly constrained, but highly rewarding maneuvers, such as overtaking, require an accurate model of interactive behavior of the opposing target vehicle (TV). However, such information is not typically made available in competitive scenarios, we therefore propose to construct a prediction and uncertainty model given data of the TV from previous races. In particular, a one-step Gaussian Process (GP) model is trained on closed-loop interaction data to learn the behavior of a TV driven by an unknown policy. Predictions of the nominal trajectory and associated uncertainty are rolled out via a sampling-based approach and are used in a model predictive control (MPC) policy for the ego vehicle in order to intelligently trade-off between safety and performance when attempting overtaking maneuvers against a TV. We demonstrate the GP-based predictor in closed loop with the MPC policy in simulation races and compare its performance against several predictors from literature. In a Monte Carlo study, we observe that the GP-based predictor achieves similar win rates while maintaining safety in up to 3x more races. We finally demonstrate the prediction and control framework in real-time on hardware experiments. ",
    "url": "https://arxiv.org/abs/2204.12533",
    "authors": [
      "Finn Lukas Busch",
      "Jake Johnson",
      "Edward L. Zhu",
      "Francesco Borrelli"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.12535",
    "title": "Building Change Detection using Multi-Temporal Airborne LiDAR Data",
    "abstract": "Building change detection is essential for monitoring urbanization, disaster assessment, urban planning and frequently updating the maps. 3D structure information from airborne light detection and ranging (LiDAR) is very effective for detecting urban changes. But the 3D point cloud from airborne LiDAR(ALS) holds an enormous amount of unordered and irregularly sparse information. Handling such data is tricky and consumes large memory for processing. Most of this information is not necessary when we are looking for a particular type of urban change. In this study, we propose an automatic method that reduces the 3D point clouds into a much smaller representation without losing the necessary information required for detecting Building changes. The method utilizes the Deep Learning(DL) model U-Net for segmenting the buildings from the background. Produced segmentation maps are then processed further for detecting changes and the results are refined using morphological methods. For the change detection task, we used multi-temporal airborne LiDAR data. The data is acquired over Stockholm in the years 2017 and 2019. The changes in buildings are classified into four types: 'newly built', 'demolished', 'taller' and 'shorter'. The detected changes are visualized in one map for better interpretation. ",
    "url": "https://arxiv.org/abs/2204.12535",
    "authors": [
      "Ritu Yadav",
      "Andrea Nascetti",
      "Yifang Ban"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.12540",
    "title": "Personalized Driving Behaviors and Fuel Economy over Realistic Commute  Traffic: Modeling, Correlation, and Prediction",
    "abstract": "Drivers have distinctively diverse behaviors when operating vehicles in natural traffic flow, such as preferred pedal position, car-following distance, preview time headway, etc. These highly personalized behavioral variations are known to impact vehicle fuel economy qualitatively. Nevertheless, the quantitative relationship between driving behaviors and vehicle fuel consumption remains obscure. Addressing this critical missing link will contribute to the improvement of transportation sustainability, as well as understanding drivers' behavioral diversity. This study proposed an integrated microscopic driver behavior and fuel consumption model to assess and predict vehicle fuel economy with naturalistic highway and local commuting traffic data. Through extensive Monte Carlo simulations, significant correlation results are revealed between specific individual driving preferences and fuel economy over drivers' frequent commuting routes. Correlation results indicate that the differences in fuel consumption incurred by various driving behaviors, even in the same traffic conditions, can be as much as 29% for a light-duty truck and 15% for a passenger car. A Gaussian Process Regression model is further trained, validated, and tested under different traffic and vehicle conditions to predict fuel consumption based on drivers' personalized behaviors. Such a quantitative and personalized model can be used to identify and recommend fuel-friendly driving behaviors and routes, demonstrating a strong incentive for relevant stakeholders. ",
    "url": "https://arxiv.org/abs/2204.12540",
    "authors": [
      "Yao Ma",
      "Junmin Wang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.12543",
    "title": "Data Bootstrapping Approaches to Improve Low Resource Abusive Language  Detection for Indic Languages",
    "abstract": "Abusive language is a growing concern in many social media platforms. Repeated exposure to abusive speech has created physiological effects on the target users. Thus, the problem of abusive language should be addressed in all forms for online peace and safety. While extensive research exists in abusive speech detection, most studies focus on English. Recently, many smearing incidents have occurred in India, which provoked diverse forms of abusive speech in online space in various languages based on the geographic location. Therefore it is essential to deal with such malicious content. In this paper, to bridge the gap, we demonstrate a large-scale analysis of multilingual abusive speech in Indic languages. We examine different interlingual transfer mechanisms and observe the performance of various multilingual models for abusive speech detection for eight different Indic languages. We also experiment to show how robust these models are on adversarial attacks. Finally, we conduct an in-depth error analysis by looking into the models' misclassified posts across various settings. We have made our code and models public for other researchers. ",
    "url": "https://arxiv.org/abs/2204.12543",
    "authors": [
      "Mithun Das",
      "Somnath Banerjee",
      "Animesh Mukherjee"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12556",
    "title": "SoFaiR: Single Shot Fair Representation Learning",
    "abstract": "To avoid discriminatory uses of their data, organizations can learn to map them into a representation that filters out information related to sensitive attributes. However, all existing methods in fair representation learning generate a fairness-information trade-off. To achieve different points on the fairness-information plane, one must train different models. In this paper, we first demonstrate that fairness-information trade-offs are fully characterized by rate-distortion trade-offs. Then, we use this key result and propose SoFaiR, a single shot fair representation learning method that generates with one trained model many points on the fairness-information plane. Besides its computational saving, our single-shot approach is, to the extent of our knowledge, the first fair representation learning method that explains what information is affected by changes in the fairness / distortion properties of the representation. Empirically, we find on three datasets that SoFaiR achieves similar fairness-information trade-offs as its multi-shot counterparts. ",
    "url": "https://arxiv.org/abs/2204.12556",
    "authors": [
      "Xavier Gitiaux",
      "Huzefa Rangwala"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2204.12560",
    "title": "Process Knowledge-infused Learning for Suicidality Assessment on Social  Media",
    "abstract": "Improving the performance and natural language explanations of deep learning algorithms is a priority for adoption by humans in the real world. In several domains, such as healthcare, such technology has significant potential to reduce the burden on humans by providing quality assistance at scale. However, current methods rely on the traditional pipeline of predicting labels from data, thus completely ignoring the process and guidelines used to obtain the labels. Furthermore, post hoc explanations on the data to label prediction using explainable AI (XAI) models, while satisfactory to computer scientists, leave much to be desired to the end-users due to lacking explanations of the process in terms of human-understandable concepts. We \\textit{introduce}, \\textit{formalize}, and \\textit{develop} a novel Artificial Intelligence (A) paradigm -- Process Knowledge-infused Learning (PK-iL). PK-iL utilizes a structured process knowledge that explicitly explains the underlying prediction process that makes sense to end-users. The qualitative human evaluation confirms through a annotator agreement of 0.72, that humans are understand explanations for the predictions. PK-iL also performs competitively with the state-of-the-art (SOTA) baselines. ",
    "url": "https://arxiv.org/abs/2204.12560",
    "authors": [
      "Kaushik Roy",
      "Manas Gaur",
      "Qi Zhang",
      "Amit Sheth"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12575",
    "title": "Wasmati: An Efficient Static Vulnerability Scanner for WebAssembly",
    "abstract": "WebAssembly is a new binary instruction format that allows targeted compiled code written in high-level languages to be executed with near-native speed by the browser's JavaScript engine. However, given that WebAssembly binaries can be compiled from unsafe languages like C/C++, classical code vulnerabilities such as buffer overflows or format strings can be transferred over from the original programs down to the cross-compiled binaries. As a result, this possibility of incorporating vulnerabilities in WebAssembly modules has widened the attack surface of modern web applications. This paper presents Wasmati, a static analysis tool for finding security vulnerabilities in WebAssembly binaries. It is based on the generation of a code property graph (CPG), a program representation previously adopted for detecting vulnerabilities in various languages but hitherto unapplied to WebAssembly. We formalize the definition of CPG for WebAssembly, introduce techniques to generate CPG for complex WebAssembly, and present four different query specification languages for finding vulnerabilities by traversing a program's CPG. We implemented ten queries capturing different vulnerability types and extensively tested Wasmati on four heterogeneous datasets. We show that Wasmati can scale the generation of CPGs for large real-world applications and can efficiently find vulnerabilities for all our query types. We have also tested our tool on WebAssembly binaries collected in the wild and identified several potential vulnerabilities, some of which we have manually confirmed to exist unless the enclosing application properly sanitizes the interaction with such affected binaries. ",
    "url": "https://arxiv.org/abs/2204.12575",
    "authors": [
      "Tiago Brito",
      "Pedro Lopes",
      "Nuno Santos",
      "José Fragoso Santos"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.12577",
    "title": "Novel Applications for VAE-based Anomaly Detection Systems",
    "abstract": "The recent rise in deep learning technologies fueled innovation and boosted scientific research. Their achievements enabled new research directions for deep generative modeling (DGM), an increasingly popular approach that can create novel and unseen data, starting from a given data set. As the technology shows promising applications, many ethical issues also arise. For example, their misuse can enable disinformation campaigns and powerful phishing attempts. Research also indicates different biases affect deep learning models, leading to social issues such as misrepresentation. In this work, we formulate a novel setting to deal with similar problems, showing that a repurposed anomaly detection system effectively generates novel data, avoiding generating specified unwanted data. We propose Variational Auto-encoding Binary Classifiers (V-ABC): a novel model that repurposes and extends the Auto-encoding Binary Classifier (ABC) anomaly detector, using the Variational Auto-encoder (VAE). We survey the limitations of existing approaches and explore many tools to show the model's inner workings in an interpretable way. This proposal has excellent potential for generative applications: models that rely on user-generated data could automatically filter out unwanted content, such as offensive language, obscene images, and misleading information. ",
    "url": "https://arxiv.org/abs/2204.12577",
    "authors": [
      "Luca Bergamin",
      "Tommaso Carraro",
      "Mirko Polato",
      "Fabio Aiolli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12581",
    "title": "RAMBO-RL: Robust Adversarial Model-Based Offline Reinforcement Learning",
    "abstract": "Offline reinforcement learning (RL) aims to find near-optimal policies from logged data without further environment interaction. Model-based algorithms, which learn a model of the environment from the dataset and perform conservative policy optimisation within that model, have emerged as a promising approach to this problem. In this work, we present Robust Adversarial Model-Based Offline RL (RAMBO), a novel approach to model-based offline RL. To achieve conservatism, we formulate the problem as a two-player zero sum game against an adversarial environment model. The model is trained minimise the value function while still accurately predicting the transitions in the dataset, forcing the policy to act conservatively in areas not covered by the dataset. To approximately solve the two-player game, we alternate between optimising the policy and optimising the model adversarially. The problem formulation that we address is theoretically grounded, resulting in a PAC performance guarantee and a pessimistic value function which lower bounds the value function in the true environment. We evaluate our approach on widely studied offline RL benchmarks, and demonstrate that our approach achieves state of the art performance. ",
    "url": "https://arxiv.org/abs/2204.12581",
    "authors": [
      "Marc Rigter",
      "Bruno Lacerda",
      "Nick Hawes"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.12584",
    "title": "Fast Aquatic Swimmer Optimization with Differentiable Projective  Dynamics and Neural Network Hydrodynamic Models",
    "abstract": "Aquatic locomotion is a classic fluid-structure interaction (FSI) problem of interest to biologists and engineers. Solving the fully coupled FSI equations for incompressible Navier-Stokes and finite elasticity is computationally expensive. Optimizing robotic swimmer design within such a system generally involves cumbersome, gradient-free procedures on top of the already costly simulation. To address this challenge we present a novel, fully differentiable hybrid approach to FSI that combines a 2D direct numerical simulation for the deformable solid structure of the swimmer and a physics-constrained neural network surrogate to capture hydrodynamic effects of the fluid. For the deformable simulation of the swimmer's body, we use state-of-the-art techniques from the field of computer graphics to speed up the finite-element method (FEM). For the fluid simulation, we use a U-Net architecture trained with a physics-based loss function to predict the flow field at each time step. The pressure and velocity field outputs from the neural network are sampled around the boundary of our swimmer using an immersed boundary method (IBM) to compute its swimming motion accurately and efficiently. We demonstrate the computational efficiency and differentiability of our hybrid simulator on a 2D carangiform swimmer. Since both the solid simulator and the hydrodynamics model are automatically differentiable, we obtain a fully differentiable FSI simulator that can be used for computational co-design of geometry and controls for rigid and soft bodies immersed in fluids, such as minimizing drag, maximizing speed, or maximizing efficiency via direct gradient-based optimization. ",
    "url": "https://arxiv.org/abs/2204.12584",
    "authors": [
      "Elvis Nava",
      "John Zhang",
      "Mike Yan Michelis",
      "Tao Du",
      "Pingchuan Ma",
      "Benjamin Grewe",
      "Wojciech Matusik",
      "Robert Katzschmann"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2204.12585",
    "title": "Surrogate Assisted Evolutionary Multi-objective Optimisation applied to  a Pressure Swing Adsorption system",
    "abstract": "Chemical plant design and optimisation have proven challenging due to the complexity of these real-world systems. The resulting complexity translates into high computational costs for these systems' mathematical formulations and simulation models. Research has illustrated the benefits of using machine learning surrogate models as substitutes for computationally expensive models during optimisation. This paper extends recent research into optimising chemical plant design and operation. The study further explores Surrogate Assisted Genetic Algorithms (SA-GA) in more complex variants of the original plant design and optimisation problems, such as the inclusion of parallel and feedback components. The novel extension to the original algorithm proposed in this study, Surrogate Assisted NSGA-\\Romannum{2} (SA-NSGA), was tested on a popular literature case, the Pressure Swing Adsorption (PSA) system. We further provide extensive experimentation, comparing various meta-heuristic optimisation techniques and numerous machine learning models as surrogates. The results for both sets of systems illustrate the benefits of using Genetic Algorithms as an optimisation framework for complex chemical plant system design and optimisation for both single and multi-objective scenarios. We confirm that Random Forest surrogate assisted Evolutionary Algorithms can be scaled to increasingly complex chemical systems with parallel and feedback components. We further find that combining a Genetic Algorithm framework with Machine Learning Surrogate models as a substitute for long-running simulation models yields significant computational efficiency improvements, 1.7 - 1.84 times speedup for the increased complexity examples and a 2.7 times speedup for the Pressure Swing Adsorption system. ",
    "url": "https://arxiv.org/abs/2204.12585",
    "authors": [
      "Liezl Stander",
      "Matthew Woolway",
      "Terence L. Van Zyl"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12589",
    "title": "Self-scalable Tanh (Stan): Faster Convergence and Better Generalization  in Physics-informed Neural Networks",
    "abstract": "Physics-informed Neural Networks (PINNs) are gaining attention in the engineering and scientific literature for solving a range of differential equations with applications in weather modeling, healthcare, manufacturing, and so on. Poor scalability is one of the barriers to utilizing PINNs for many real-world problems. To address this, a Self-scalable tanh (Stan) activation function is proposed for the PINNs. The proposed Stan function is smooth, non-saturating, and has a trainable parameter. During training, it can allow easy flow of gradients to compute the required derivatives and also enable systematic scaling of the input-output mapping. It is also shown theoretically that the PINN with the proposed Stan function has no spurious stationary points when using gradient descent algorithms. The proposed Stan is tested on a couple of numerical studies involving general regression problems. It is subsequently used for solving multiple forward problems, which involve second-order derivatives and multiple dimensions, and an inverse problem where the thermal diffusivity is predicted through heat conduction in a rod. Our results of these case studies establish empirically that the Stan activation function can achieve better training and more accurate predictions than the state-of-the-art activation functions. ",
    "url": "https://arxiv.org/abs/2204.12589",
    "authors": [
      "Raghav Gnanasambandam",
      "Bo Shen",
      "Jihoon Chung",
      "Xubo Yue",
      "Zhenyu",
      "Kong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.12591",
    "title": "The Influence of the Other-Race Effect on Susceptibility to Face  Morphing Attacks",
    "abstract": "Facial morphs created between two identities resemble both of the faces used to create the morph. Consequently, humans and machines are prone to mistake morphs made from two identities for either of the faces used to create the morph. This vulnerability has been exploited in \"morph attacks\" in security scenarios. Here, we asked whether the \"other-race effect\" (ORE) -- the human advantage for identifying own- vs. other-race faces -- exacerbates morph attack susceptibility for humans. We also asked whether face-identification performance in a deep convolutional neural network (DCNN) is affected by the race of morphed faces. Caucasian (CA) and East-Asian (EA) participants performed a face-identity matching task on pairs of CA and EA face images in two conditions. In the morph condition, different-identity pairs consisted of an image of identity \"A\" and a 50/50 morph between images of identity \"A\" and \"B\". In the baseline condition, morphs of different identities never appeared. As expected, morphs were identified mistakenly more often than original face images. Moreover, CA participants showed an advantage for CA faces in comparison to EA faces (a partial ORE). Of primary interest, morph identification was substantially worse for cross-race faces than for own-race faces. Similar to humans, the DCNN performed more accurately for original face images than for morphed image pairs. Notably, the deep network proved substantially more accurate than humans in both cases. The results point to the possibility that DCNNs might be useful for improving face identification accuracy when morphed faces are presented. They also indicate the significance of the ORE in morph attack susceptibility in applied settings. ",
    "url": "https://arxiv.org/abs/2204.12591",
    "authors": [
      "Snipta Mallick",
      "Geraldine Jeckeln",
      "Connor J. Parde",
      "Carlos D. Castillo",
      "Alice J. O'Toole"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12605",
    "title": "Zero-Touch Network on Industrial IoT: An End-to-End Machine Learning  Approach",
    "abstract": "Industry 4.0-enabled smart factory is expected to realize the next revolution for manufacturers. Although artificial intelligence (AI) technologies have improved productivity, current use cases belong to small-scale and single-task operations. To unbound the potential of smart factory, this paper develops zero-touch network systems for intelligent manufacturing and facilitates distributed AI applications in both training and inferring stages in a large-scale manner. The open radio access network (O-RAN) architecture is first introduced for the zero-touch platform to enable globally controlling communications and computation infrastructure capability in the field. The designed serverless framework allows intelligent and efficient learning assignments and resource allocations. Hence, requested learning tasks can be assigned to appropriate robots, and the underlying infrastructure can be used to support the learning tasks without expert knowledge. Moreover, due to the proposed network system's flexibility, powerful AI-enabled networking algorithms can be utilized to ensure service-level agreements and superior performances for factory workloads. Finally, three open research directions of backward compatibility, end-to-end enhancements, and cybersecurity are discussed for zero-touch smart factory. ",
    "url": "https://arxiv.org/abs/2204.12605",
    "authors": [
      "Shih-Chun Lin",
      "Chia-Hung Lin",
      "Wei-Chi Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.12637",
    "title": "Meta-Learning Based Early Fault Detection for Rolling Bearings via  Few-Shot Anomaly Detection",
    "abstract": "Early fault detection (EFD) of rolling bearings can recognize slight deviation of the health states and contribute to the stability of mechanical systems. In practice, very limited target bearing data are available to conduct EFD, which makes it hard to adapt to the EFD task of new bearings. To address this problem, many transfer learning based EFD methods utilize historical data to learn transferable domain knowledge and conduct early fault detection on new target bearings. However, most existing methods only consider the distribution drift across different working conditions but ignore the difference between bearings under the same working condition, which is called Unit-to-Unit Variability (UtUV). The setting of EFD with limited target data considering UtUV can be formulated as a Few-shot Anomaly Detection task. Therefore, this paper proposes a novel EFD method based on meta-learning considering UtUV. The proposed method can learn a generic metric based on Relation Network (RN) to measure the similarity between normal data and the new arrival target bearing data. Besides, the proposed method utilizes a health state embedding strategy to decrease false alarms. The performance of proposed method is tested on two bearing datasets. The results show that the proposed method can detect incipient faults earlier than the baselines with lower false alarms. ",
    "url": "https://arxiv.org/abs/2204.12637",
    "authors": [
      "Wenbin Song",
      "Di Wu",
      "Weiming Shen",
      "Benoit Boulet"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12656",
    "title": "SCGC : Self-Supervised Contrastive Graph Clustering",
    "abstract": "Graph clustering discovers groups or communities within networks. Deep learning methods such as autoencoders (AE) extract effective clustering and downstream representations but cannot incorporate rich structural information. While Graph Neural Networks (GNN) have shown great success in encoding graph structure, typical GNNs based on convolution or attention variants suffer from over-smoothing, noise, heterophily, are computationally expensive and typically require the complete graph being present. Instead, we propose Self-Supervised Contrastive Graph Clustering (SCGC), which imposes graph-structure via contrastive loss signals to learn discriminative node representations and iteratively refined soft cluster labels. We also propose SCGC*, with a more effective, novel, Influence Augmented Contrastive (IAC) loss to fuse richer structural information, and half the original model parameters. SCGC(*) is faster with simple linear units, completely eliminate convolutions and attention of traditional GNNs, yet efficiently incorporates structure. It is impervious to layer depth and robust to over-smoothing, incorrect edges and heterophily. It is scalable by batching, a limitation in many prior GNN models, and trivially parallelizable. We obtain significant improvements over state-of-the-art on a wide range of benchmark graph datasets, including images, sensor data, text, and citation networks efficiently. Specifically, 20% on ARI and 18% on NMI for DBLP; overall 55% reduction in training time and overall, 81% reduction on inference time. Our code is available at : https://github.com/gayanku/SCGC ",
    "url": "https://arxiv.org/abs/2204.12656",
    "authors": [
      "Gayan K. Kulatilleke",
      "Marius Portmann",
      "Shekhar S. Chandra"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2204.12662",
    "title": "Better Query Graph Selection for Knowledge Base Question Answering",
    "abstract": "This paper presents a novel approach based on semantic parsing to improve the performance of Knowledge Base Question Answering (KBQA). Specifically, we focus on how to select an optimal query graph from a candidate set so as to retrieve the answer from knowledge base (KB). In our approach, we first propose to linearize the query graph into a sequence, which is used to form a sequence pair with the question. It allows us to use mature sequence modeling, such as BERT, to encode the sequence pair. Then we use a ranking method to sort candidate query graphs. In contrast to the previous studies, our approach can efficiently model semantic interactions between the graph and the question as well as rank the candidate graphs from a global view. The experimental results show that our system achieves the top performance on ComplexQuestions and the second best performance on WebQuestions. ",
    "url": "https://arxiv.org/abs/2204.12662",
    "authors": [
      "Yonghui Jia",
      "Wenliang Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.12676",
    "title": "The Multimarginal Optimal Transport Formulation of Adversarial  Multiclass Classification",
    "abstract": "We study a family of adversarial multiclass classification problems and provide equivalent reformulations in terms of: 1) a family of generalized barycenter problems introduced in the paper and 2) a family of multimarginal optimal transport problems where the number of marginals is equal to the number of classes in the original classification problem. These new theoretical results reveal a rich geometric structure of adversarial learning problems in multiclass classification and extend recent results restricted to the binary classification setting. A direct computational implication of our results is that by solving either the barycenter problem and its dual, or the MOT problem and its dual, we can recover the optimal robust classification rule and the optimal adversarial strategy for the original adversarial problem. Examples with synthetic and real data illustrate our results. ",
    "url": "https://arxiv.org/abs/2204.12676",
    "authors": [
      "Nicolas Garcia Trillos",
      "Matt Jacobs",
      "Jakwang Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Analysis of PDEs (math.AP)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.12680",
    "title": "Improving the Transferability of Adversarial Examples with Restructure  Embedded Patches",
    "abstract": "Vision transformers (ViTs) have demonstrated impressive performance in various computer vision tasks. However, the adversarial examples generated by ViTs are challenging to transfer to other networks with different structures. Recent attack methods do not consider the specificity of ViTs architecture and self-attention mechanism, which leads to poor transferability of the generated adversarial samples by ViTs. We attack the unique self-attention mechanism in ViTs by restructuring the embedded patches of the input. The restructured embedded patches enable the self-attention mechanism to obtain more diverse patches connections and help ViTs keep regions of interest on the object. Therefore, we propose an attack method against the unique self-attention mechanism in ViTs, called Self-Attention Patches Restructure (SAPR). Our method is simple to implement yet efficient and applicable to any self-attention based network and gradient transferability-based attack methods. We evaluate attack transferability on black-box models with different structures. The result show that our method generates adversarial examples on white-box ViTs with higher transferability and higher image quality. Our research advances the development of black-box transfer attacks on ViTs and demonstrates the feasibility of using white-box ViTs to attack other black-box models. ",
    "url": "https://arxiv.org/abs/2204.12680",
    "authors": [
      "Huipeng Zhou",
      "Yu-an Tan",
      "Yajie Wang",
      "Haoran Lyu",
      "Shangbo Wu",
      "Yuanzhang Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12681",
    "title": "$G^2$: Enhance Knowledge Grounded Dialogue via Ground Graph",
    "abstract": "Knowledge grounded dialogue system is designed to generate responses that convey information from given knowledge documents. However, it's a challenge for the current Seq2Seq model to acquire knowledge from complex documents and integrate it to perform correct responses without the aid of an explicit semantic structure. To address these issues, we present a novel graph structure, Ground Graph ($G^2$), which models the semantic structure of both dialogue contexts and knowledge documents to facilitate knowledge selection and integration for the task. Besides, a Ground Graph Aware Transformer ($G^2AT$) is proposed to enhance knowledge grounded response generation. Empirical results show that our proposed model outperforms previous state-of-the-art methods with more than 10\\% and 20\\% gains on response generation and factual consistency. Furthermore, our structure-aware approach shows excellent generalization ability in resource-limited situations. ",
    "url": "https://arxiv.org/abs/2204.12681",
    "authors": [
      "Yizhe Yang",
      "Yang Gao",
      "Jiawei Li",
      "Heyan Huang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.12685",
    "title": "Robust Face Anti-Spoofing with Dual Probabilistic Modeling",
    "abstract": "The field of face anti-spoofing (FAS) has witnessed great progress with the surge of deep learning. Due to its data-driven nature, existing FAS methods are sensitive to the noise in the dataset, which will hurdle the learning process. However, very few works consider noise modeling in FAS. In this work, we attempt to fill this gap by automatically addressing the noise problem from both label and data perspectives in a probabilistic manner. Specifically, we propose a unified framework called Dual Probabilistic Modeling (DPM), with two dedicated modules, DPM-LQ (Label Quality aware learning) and DPM-DQ (Data Quality aware learning). Both modules are designed based on the assumption that data and label should form coherent probabilistic distributions. DPM-LQ is able to produce robust feature representations without overfitting to the distribution of noisy semantic labels. DPM-DQ can eliminate data noise from `False Reject' and `False Accept' during inference by correcting the prediction confidence of noisy data based on its quality distribution. Both modules can be incorporated into existing deep networks seamlessly and efficiently. Furthermore, we propose the generalized DPM to address the noise problem in practical usage without the need of semantic annotations. Extensive experiments demonstrate that this probabilistic modeling can 1) significantly improve the accuracy, and 2) make the model robust to the noise in real-world datasets. Without bells and whistles, our proposed DPM achieves state-of-the-art performance on multiple standard FAS benchmarks. ",
    "url": "https://arxiv.org/abs/2204.12685",
    "authors": [
      "Yuanhan Zhang",
      "Yichao Wu",
      "Zhenfei Yin",
      "Jing Shao",
      "Ziwei Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12694",
    "title": "Model predictive control of agro-hydrological systems based on a  two-layer neural network modeling framework",
    "abstract": "Water scarcity is an urgent issue to be resolved and improving irrigation water-use efficiency through closed-loop control is essential. The complex agro-hydrological system dynamics, however, often pose challenges in closed-loop control applications. In this work, we propose a two-layer neural network (NN) framework to approximate the dynamics of the agro-hydrological system. To minimize the prediction error, a linear bias correction is added to the proposed model. The model is employed by a model predictive controller with zone tracking (ZMPC), which aims to keep the root zone soil moisture in the target zone while minimizing the total amount of irrigation. The performance of the proposed approximation model framework is shown to be better compared to a benchmark long-short-term-memory (LSTM) model for both open-loop and closed-loop applications. Significant computational cost reduction of the ZMPC is achieved with the proposed framework. To handle the tracking offset caused by the plant-model-mismatch of the proposed NN framework, a shrinking target zone is proposed for the ZMPC. Different hyper-parameters of the shrinking zone in the presence of noise and weather disturbances are investigated, of which the control performance is compared to a ZMPC with a time-invariant target zone. ",
    "url": "https://arxiv.org/abs/2204.12694",
    "authors": [
      "Zhiyinan Huang",
      "Jinfeng Liu",
      "Biao Huang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2204.12703",
    "title": "Heterogeneous Ensemble Knowledge Transfer for Training Large Models in  Federated Learning",
    "abstract": "Federated learning (FL) enables edge-devices to collaboratively learn a model without disclosing their private data to a central aggregating server. Most existing FL algorithms require models of identical architecture to be deployed across the clients and server, making it infeasible to train large models due to clients' limited system resources. In this work, we propose a novel ensemble knowledge transfer method named Fed-ET in which small models (different in architecture) are trained on clients, and used to train a larger model at the server. Unlike in conventional ensemble learning, in FL the ensemble can be trained on clients' highly heterogeneous data. Cognizant of this property, Fed-ET uses a weighted consensus distillation scheme with diversity regularization that efficiently extracts reliable consensus from the ensemble while improving generalization by exploiting the diversity within the ensemble. We show the generalization bound for the ensemble of weighted models trained on heterogeneous datasets that supports the intuition of Fed-ET. Our experiments on image and language tasks show that Fed-ET significantly outperforms other state-of-the-art FL algorithms with fewer communicated parameters, and is also robust against high data-heterogeneity. ",
    "url": "https://arxiv.org/abs/2204.12703",
    "authors": [
      "Yae Jee Cho",
      "Andre Manoel",
      "Gauri Joshi",
      "Robert Sim",
      "Dimitrios Dimitriadis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12711",
    "title": "Towards Exploring the Code Reuse from Stack Overflow during Software  Development",
    "abstract": "As one of the most well-known programmer Q&A websites, Stack Overflow (i.e., SO) is serving tens of thousands of developers every day. Previous work has shown that many developers reuse the code snippets on SO when they find an answer (from SO) that functionally matches the programming problem they encounter in their development activities. To study how programmers reuse code on SO during project development, we conduct a comprehensive empirical study. First, to capture the development activities of programmers, we collect 342,148 modified code snippets in commits from 793 open-source Java projects, and these modified code can reflect the programming problems encountered during development. We also collect the code snippets from 1,355,617 posts on SO. Then, we employ CCFinder to detect the code clone between the modified code from commits and the code from SO, and further analyze the code reuse when programmer solves a programming problem during development. We count the code reuse ratios of the modified code snippets in the commits of each project in different years, the results show that the average code reuse ratio is 6.32%, and the maximum is 8.38%. The code reuse ratio in project commits has increased year by year, and the proportion of code reuse in the newly established project is higher than that of old projects. We also find that some projects reuse the code snippets from many years ago. Additionally, we find that experienced developers seem to be more likely to reuse the knowledge on SO. Moreover, we find that the code reuse ratio in bug-related commits (6.67%) is slightly higher than that of in non-bug-related commits (6.59%). Furthermore, we also find that the code reuse ratio (14.44%) in Java class files that have undergone multiple modifications is more than double the overall code reuse ratio (6.32%). ",
    "url": "https://arxiv.org/abs/2204.12711",
    "authors": [
      "Yuan Huang",
      "Furen Xu",
      "Haojie Zhou",
      "Xiangping Chen",
      "Xiaocong Zhou",
      "Tong Wang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.12716",
    "title": "UBERT: A Novel Language Model for Synonymy Prediction at Scale in the  UMLS Metathesaurus",
    "abstract": "The UMLS Metathesaurus integrates more than 200 biomedical source vocabularies. During the Metathesaurus construction process, synonymous terms are clustered into concepts by human editors, assisted by lexical similarity algorithms. This process is error-prone and time-consuming. Recently, a deep learning model (LexLM) has been developed for the UMLS Vocabulary Alignment (UVA) task. This work introduces UBERT, a BERT-based language model, pretrained on UMLS terms via a supervised Synonymy Prediction (SP) task replacing the original Next Sentence Prediction (NSP) task. The effectiveness of UBERT for UMLS Metathesaurus construction process is evaluated using the UMLS Vocabulary Alignment (UVA) task. We show that UBERT outperforms the LexLM, as well as biomedical BERT-based models. Key to the performance of UBERT are the synonymy prediction task specifically developed for UBERT, the tight alignment of training data to the UVA task, and the similarity of the models used for pretrained UBERT. ",
    "url": "https://arxiv.org/abs/2204.12716",
    "authors": [
      "Thilini Wijesiriwardene",
      "Vinh Nguyen",
      "Goonmeet Bajaj",
      "Hong Yung Yip",
      "Vishesh Javangula",
      "Yuqing Mao",
      "Kin Wah Fung",
      "Srinivasan Parthasarathy",
      "Amit P. Sheth",
      "Olivier Bodenreider"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.12717",
    "title": "Dataset for Robust and Accurate Leading Vehicle Velocity Recognition",
    "abstract": "Recognition of the surrounding environment using a camera is an important technology in Advanced Driver-Assistance Systems and Autonomous Driving, and recognition technology is often solved by machine learning approaches such as deep learning in recent years. Machine learning requires datasets for learning and evaluation. To develop robust recognition technology in the real world, in addition to normal driving environment, data in environments that are difficult for cameras such as rainy weather or nighttime are essential. We have constructed a dataset that one can benchmark the technology, targeting the velocity recognition of the leading vehicle. This task is an important one for the Advanced Driver-Assistance Systems and Autonomous Driving. The dataset is available at https://signate.jp/competitions/657 ",
    "url": "https://arxiv.org/abs/2204.12717",
    "authors": [
      "Genya Ogawa",
      "Toru Saito",
      "Noriyuki Aoi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12726",
    "title": "PRE-NAS: Predictor-assisted Evolutionary Neural Architecture Search",
    "abstract": "Neural architecture search (NAS) aims to automate architecture engineering in neural networks. This often requires a high computational overhead to evaluate a number of candidate networks from the set of all possible networks in the search space during the search. Prediction of the networks' performance can alleviate this high computational overhead by mitigating the need for evaluating every candidate network. Developing such a predictor typically requires a large number of evaluated architectures which may be difficult to obtain. We address this challenge by proposing a novel evolutionary-based NAS strategy, Predictor-assisted E-NAS (PRE-NAS), which can perform well even with an extremely small number of evaluated architectures. PRE-NAS leverages new evolutionary search strategies and integrates high-fidelity weight inheritance over generations. Unlike one-shot strategies, which may suffer from bias in the evaluation due to weight sharing, offspring candidates in PRE-NAS are topologically homogeneous, which circumvents bias and leads to more accurate predictions. Extensive experiments on NAS-Bench-201 and DARTS search spaces show that PRE-NAS can outperform state-of-the-art NAS methods. With only a single GPU searching for 0.6 days, competitive architecture can be found by PRE-NAS which achieves 2.40% and 24% test error rates on CIFAR-10 and ImageNet respectively. ",
    "url": "https://arxiv.org/abs/2204.12726",
    "authors": [
      "Yameng Peng",
      "Andy Song",
      "Vic Ciesielski",
      "Haytham M. Fayek",
      "Xiaojun Chang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12729",
    "title": "Human-Centered Prior-Guided and Task-Dependent Multi-Task Representation  Learning for Action Recognition Pre-Training",
    "abstract": "Recently, much progress has been made for self-supervised action recognition. Most existing approaches emphasize the contrastive relations among videos, including appearance and motion consistency. However, two main issues remain for existing pre-training methods: 1) the learned representation is neutral and not informative for a specific task; 2) multi-task learning-based pre-training sometimes leads to sub-optimal solutions due to inconsistent domains of different tasks. To address the above issues, we propose a novel action recognition pre-training framework, which exploits human-centered prior knowledge that generates more informative representation, and avoids the conflict between multiple tasks by using task-dependent representations. Specifically, we distill knowledge from a human parsing model to enrich the semantic capability of representation. In addition, we combine knowledge distillation with contrastive learning to constitute a task-dependent multi-task framework. We achieve state-of-the-art performance on two popular benchmarks for action recognition task, i.e., UCF101 and HMDB51, verifying the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2204.12729",
    "authors": [
      "Guanhong Wang",
      "Keyu Lu",
      "Yang Zhou",
      "Zhanhao He",
      "Gaoang Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12732",
    "title": "Propose-and-Refine: A Two-Stage Set Prediction Network for Nested Named  Entity Recognition",
    "abstract": "Nested named entity recognition (nested NER) is a fundamental task in natural language processing. Various span-based methods have been proposed to detect nested entities with span representations. However, span-based methods do not consider the relationship between a span and other entities or phrases, which is helpful in the NER task. Besides, span-based methods have trouble predicting long entities due to limited span enumeration length. To mitigate these issues, we present the Propose-and-Refine Network (PnRNet), a two-stage set prediction network for nested NER. In the propose stage, we use a span-based predictor to generate some coarse entity predictions as entity proposals. In the refine stage, proposals interact with each other, and richer contextual information is incorporated into the proposal representations. The refined proposal representations are used to re-predict entity boundaries and classes. In this way, errors in coarse proposals can be eliminated, and the boundary prediction is no longer constrained by the span enumeration length limitation. Additionally, we build multi-scale sentence representations, which better model the hierarchical structure of sentences and provide richer contextual information than token-level representations. Experiments show that PnRNet achieves state-of-the-art performance on four nested NER datasets and one flat NER dataset. ",
    "url": "https://arxiv.org/abs/2204.12732",
    "authors": [
      "Shuhui Wu",
      "Yongliang Shen",
      "Zeqi Tan",
      "Weiming Lu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.12736",
    "title": "A Multi-Head Convolutional Neural Network With Multi-path Attention  improves Image Denoising",
    "abstract": "Recently, convolutional neural networks (CNNs) and attention mechanisms have been widely used in image denoising and achieved satisfactory performance. However, the previous works mostly use a single head to receive the noisy image, limiting the richness of extracted features. Therefore, a novel CNN with multiple heads (MH) named MHCNN is proposed in this paper, whose heads will receive the input images rotated by different rotation angles. MH makes MHCNN simultaneously utilize features of rotated images to remove noise. We also present a novel multi-path attention mechanism (MPA) to integrate these features effectively. Unlike previous attention mechanisms that handle pixel-level, channel-level, and patch-level features, MPA focuses on features at the image level. Experiments show MHCNN surpasses other state-of-the-art CNN models on additive white Gaussian noise (AWGN) denoising and real-world image denoising. Its peak signal-to-noise ratio (PSNR) results are higher than other networks, such as DnCNN, BRDNet, RIDNet, PAN-Net, and CSANN. It is also demonstrated that the proposed MH with MPA mechanism can be used as a pluggable component. ",
    "url": "https://arxiv.org/abs/2204.12736",
    "authors": [
      "Jiahong Zhang",
      "Meijun Qu",
      "Ye Wang",
      "Lihong Cao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.12743",
    "title": "Self-Supervised Text Erasing with Controllable Image Synthesis",
    "abstract": "Recent efforts on scene text erasing have shown promising results. However, existing methods require rich yet costly label annotations to obtain robust models, which limits the use for practical applications. To this end, we study an unsupervised scenario by proposing a novel Self-supervised Text Erasing (STE) framework that jointly learns to synthesize training images with erasure ground-truth and accurately erase texts in the real world. We first design a style-aware image synthesis function to generate synthetic images with diverse styled texts based on two synthetic mechanisms. To bridge the text style gap between the synthetic and real-world data, a policy network is constructed to control the synthetic mechanisms by picking style parameters with the guidance of two specifically designed rewards. The synthetic training images with erasure ground-truth are then fed to train a coarse-to-fine erasing network. To produce better erasing outputs, a triplet erasure loss is designed to enforce the refinement stage to recover background textures. Moreover, we provide a new dataset (called PosterErase), which contains 60K high-resolution posters with texts and is more challenging for the text erasing task. The proposed method has been extensively evaluated with both PosterErase and the widely-used SCUT-Enstext dataset. Notably, on PosterErase, our unsupervised method achieves 5.07 in terms of FID, with a relative performance of 20.9% over existing supervised baselines. ",
    "url": "https://arxiv.org/abs/2204.12743",
    "authors": [
      "Gangwei Jiang",
      "Shiyao Wang",
      "Tiezheng Ge",
      "Yuning Jiang",
      "Ying Wei",
      "Defu Lian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.12749",
    "title": "Control Globally, Understand Locally: A Global-to-Local Hierarchical  Graph Network for Emotional Support Conversation",
    "abstract": "Emotional support conversation aims at reducing the emotional distress of the help-seeker, which is a new and challenging task. It requires the system to explore the cause of help-seeker's emotional distress and understand their psychological intention to provide supportive responses. However, existing methods mainly focus on the sequential contextual information, ignoring the hierarchical relationships with the global cause and local psychological intention behind conversations, thus leads to a weak ability of emotional support. In this paper, we propose a Global-to-Local Hierarchical Graph Network to capture the multi-source information (global cause, local intentions and dialog history) and model hierarchical relationships between them, which consists of a multi-source encoder, a hierarchical graph reasoner, and a global-guide decoder. Furthermore, a novel training objective is designed to monitor semantic information of the global cause. Experimental results on the emotional support conversation dataset, ESConv, confirm that the proposed GLHG has achieved the state-of-the-art performance on the automatic and human evaluations. ",
    "url": "https://arxiv.org/abs/2204.12749",
    "authors": [
      "Wei Peng",
      "Yue Hu",
      "Luxi Xing",
      "Yuqiang Xie",
      "Yajing Sun",
      "Yunpeng Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.12756",
    "title": "Talking Head Generation Driven by Speech-Related Facial Action Units and  Audio- Based on Multimodal Representation Fusion",
    "abstract": "Talking head generation is to synthesize a lip-synchronized talking head video by inputting an arbitrary face image and corresponding audio clips. Existing methods ignore not only the interaction and relationship of cross-modal information, but also the local driving information of the mouth muscles. In this study, we propose a novel generative framework that contains a dilated non-causal temporal convolutional self-attention network as a multimodal fusion module to promote the relationship learning of cross-modal features. In addition, our proposed method uses both audio- and speech-related facial action units (AUs) as driving information. Speech-related AU information can guide mouth movements more accurately. Because speech is highly correlated with speech-related AUs, we propose an audio-to-AU module to predict speech-related AU information. We utilize pre-trained AU classifier to ensure that the generated images contain correct AU information. We verify the effectiveness of the proposed model on the GRID and TCD-TIMIT datasets. An ablation study is also conducted to verify the contribution of each component. The results of quantitative and qualitative experiments demonstrate that our method outperforms existing methods in terms of both image quality and lip-sync accuracy. ",
    "url": "https://arxiv.org/abs/2204.12756",
    "authors": [
      "Sen Chen",
      "Zhilei Liu",
      "Jiaxing Liu",
      "Longbiao Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2204.12764",
    "title": "Bounded Memory Adversarial Bandits with Composite Anonymous Delayed  Feedback",
    "abstract": "We study the adversarial bandit problem with composite anonymous delayed feedback. In this setting, losses of an action are split into $d$ components, spreading over consecutive rounds after the action is chosen. And in each round, the algorithm observes the aggregation of losses that come from the latest $d$ rounds. Previous works focus on oblivious adversarial setting, while we investigate the harder non-oblivious setting. We show non-oblivious setting incurs $\\Omega(T)$ pseudo regret even when the loss sequence is bounded memory. However, we propose a wrapper algorithm which enjoys $o(T)$ policy regret on many adversarial bandit problems with the assumption that the loss sequence is bounded memory. Especially, for $K$-armed bandit and bandit convex optimization, we have $\\mathcal{O}(T^{2/3})$ policy regret bound. We also prove a matching lower bound for $K$-armed bandit. Our lower bound works even when the loss sequence is oblivious but the delay is non-oblivious. It answers the open problem proposed in \\cite{wang2021adaptive}, showing that non-oblivious delay is enough to incur $\\tilde{\\Omega}(T^{2/3})$ regret. ",
    "url": "https://arxiv.org/abs/2204.12764",
    "authors": [
      "Zongqi Wan",
      "Xiaoming Sun",
      "Jialin Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.12765",
    "title": "Why does Self-Supervised Learning for Speech Recognition Benefit Speaker  Recognition?",
    "abstract": "Recently, self-supervised learning (SSL) has demonstrated strong performance in speaker recognition, even if the pre-training objective is designed for speech recognition. In this paper, we study which factor leads to the success of self-supervised learning on speaker-related tasks, e.g. speaker verification (SV), through a series of carefully designed experiments. Our empirical results on the Voxceleb-1 dataset suggest that the benefit of SSL to SV task is from a combination of mask speech prediction loss, data scale, and model size, while the SSL quantizer has a minor impact. We further employ the integrated gradients attribution method and loss landscape visualization to understand the effectiveness of self-supervised learning for speaker recognition performance. ",
    "url": "https://arxiv.org/abs/2204.12765",
    "authors": [
      "Sanyuan Chen",
      "Yu Wu",
      "Chengyi Wang",
      "Shujie Liu",
      "Zhuo Chen",
      "Peidong Wang",
      "Gang Liu",
      "Jinyu Li",
      "Jian Wu",
      "Xiangzhan Yu",
      "Furu Wei"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.12768",
    "title": "Masked Spectrogram Prediction For Self-Supervised Audio Pre-Training",
    "abstract": "Transformer-based models attain excellent results and generalize well when trained on sufficient amounts of data. However, constrained by the limited data available in the audio domain, most transformer-based models for audio tasks are finetuned from pre-trained models in other domains (e.g. image), which has a notable gap with the audio domain. Other methods explore the self-supervised learning approaches directly in the audio domain but currently do not perform well in the downstream tasks. In this paper, we present a novel self-supervised learning method for transformer-based audio models, called masked spectrogram prediction (MaskSpec), to learn powerful audio representations from unlabeled audio data (AudioSet used in this paper). Our method masks random patches of the input spectrogram and reconstructs the masked regions with an encoder-decoder architecture. Without using extra model weights or supervision, experimental results on multiple downstream datasets demonstrate MaskSpec achieves a significant performance gain against the supervised methods and outperforms the previous pre-trained models. In particular, our best model reaches the performance of 0.471 (mAP) on AudioSet, 0.854 (mAP) on OpenMIC2018, 0.982 (accuracy) on ESC-50, 0.976 (accuracy) on SCV2, and 0.823 (accuracy) on DCASE2019 Task1A respectively. ",
    "url": "https://arxiv.org/abs/2204.12768",
    "authors": [
      "Dading Chong",
      "Helin Wang",
      "Peilin Zhou",
      "Qingcheng Zeng"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.12769",
    "title": "Dynamic Registration: Joint Ego Motion Estimation and 3D Moving Object  Detection in Dynamic Environment",
    "abstract": "Localization in a dynamic environment suffers from moving objects. Removing dynamic object is crucial in this situation but become tricky when ego-motion is coupled. In this paper, instead of proposing a new slam framework, we aim at a more general strategy for a localization scenario. In that case, Dynamic Registration is available for integrating with any lidar slam system. We utilize 3D object detection to obtain potential moving objects and remove them temporarily. Then we proposed Dynamic Registration, to iteratively estimate ego-motion and segment moving objects until no static object generates. Static objects are merged with the environment. Finally, we successfully segment dynamic objects, static environments with static objects, and ego-motion estimation in a dynamic environment. We evaluate the performance of our proposed method on KITTI Tracking datasets. Results show stable and consistent improvements based on other classical registration algorithms. ",
    "url": "https://arxiv.org/abs/2204.12769",
    "authors": [
      "Wenyu Li",
      "Xinyu Zhang",
      "Zijun Wang",
      "Shichun Guo",
      "Nan Qiu",
      "Jun Li"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.12784",
    "title": "Learn from Structural Scope: Improving Aspect-Level Sentiment Analysis  with Hybrid Graph Convolutional Networks",
    "abstract": "Aspect-level sentiment analysis aims to determine the sentiment polarity towards a specific target in a sentence. The main challenge of this task is to effectively model the relation between targets and sentiments so as to filter out noisy opinion words from irrelevant targets. Most recent efforts capture relations through target-sentiment pairs or opinion spans from a word-level or phrase-level perspective. Based on the observation that targets and sentiments essentially establish relations following the grammatical hierarchy of phrase-clause-sentence structure, it is hopeful to exploit comprehensive syntactic information for better guiding the learning process. Therefore, we introduce the concept of Scope, which outlines a structural text region related to a specific target. To jointly learn structural Scope and predict the sentiment polarity, we propose a hybrid graph convolutional network (HGCN) to synthesize information from constituency tree and dependency tree, exploring the potential of linking two syntax parsing methods to enrich the representation. Experimental results on four public datasets illustrate that our HGCN model outperforms current state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2204.12784",
    "authors": [
      "Lvxiaowei Xu",
      "Xiaoxuan Pang",
      "Jianwang Wu",
      "Ming Cai",
      "Jiawei Peng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.12786",
    "title": "Machines of finite depth: towards a formalization of neural networks",
    "abstract": "We provide a unifying framework where artificial neural networks and their architectures can be formally described as particular cases of a general mathematical construction--machines of finite depth. Unlike neural networks, machines have a precise definition, from which several properties follow naturally. Machines of finite depth are modular (they can be combined), efficiently computable and differentiable. The backward pass of a machine is again a machine and can be computed without overhead using the same procedure as the forward pass. We prove this statement theoretically and practically, via a unified implementation that generalizes several classical architectures--dense, convolutional, and recurrent neural networks with a rich shortcut structure--and their respective backpropagation rules. ",
    "url": "https://arxiv.org/abs/2204.12786",
    "authors": [
      "Pietro Vertechi",
      "Mattia G. Bergomi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2204.12796",
    "title": "Supervised Contrastive CSI Representation Learning for Massive MIMO  Positioning",
    "abstract": "Similarity metric is crucial for massive MIMO positioning utilizing channel state information~(CSI). In this letter, we propose a novel massive MIMO CSI similarity learning method via deep convolutional neural network~(DCNN) and contrastive learning. A contrastive loss function is designed considering multiple positive and negative CSI samples drawn from a training dataset. The DCNN encoder is trained using the loss so that positive samples are mapped to points close to the anchor's encoding, while encodings of negative samples are kept away from the anchor's in the representation space. Evaluation results of fingerprint-based positioning on a real-world CSI dataset show that the learned similarity metric improves positioning accuracy significantly compared with other known state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2204.12796",
    "authors": [
      "Junquan Deng",
      "Wei Shi",
      "Jianzhao Zhang",
      "Xianyu Zhang",
      "Chuan Zhang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12802",
    "title": "GTNet: A Tree-Based Deep Graph Learning Architecture",
    "abstract": "We propose Graph Tree Networks (GTNets), a deep graph learning architecture with a new general message passing scheme that originates from the tree representation of graphs. In the tree representation, messages propagate upward from the leaf nodes to the root node, and each node preserves its initial information prior to receiving information from its child nodes (neighbors). We formulate a general propagation rule following the nature of message passing in the tree to update a node's feature by aggregating its initial feature and its neighbor nodes' updated features. Two graph representation learning models are proposed within this GTNet architecture - Graph Tree Attention Network (GTAN) and Graph Tree Convolution Network (GTCN), with experimentally demonstrated state-of-the-art performance on several popular benchmark datasets. Unlike the vanilla Graph Attention Network (GAT) and Graph Convolution Network (GCN) which have the \"over-smoothing\" issue, the proposed GTAN and GTCN models can go deep as demonstrated by comprehensive experiments and rigorous theoretical analysis. ",
    "url": "https://arxiv.org/abs/2204.12802",
    "authors": [
      "Nan Wu",
      "Chaofan Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.12808",
    "title": "A Method of Query Graph Reranking for Knowledge Base Question Answering",
    "abstract": "This paper presents a novel reranking method to better choose the optimal query graph, a sub-graph of knowledge graph, to retrieve the answer for an input question in Knowledge Base Question Answering (KBQA). Existing methods suffer from a severe problem that there is a significant gap between top-1 performance and the oracle score of top-n results. To address this problem, our method divides the choosing procedure into two steps: query graph ranking and query graph reranking. In the first step, we provide top-n query graphs for each question. Then we propose to rerank the top-n query graphs by combining with the information of answer type. Experimental results on two widely used datasets show that our proposed method achieves the best results on the WebQuestions dataset and the second best on the ComplexQuestions dataset. ",
    "url": "https://arxiv.org/abs/2204.12808",
    "authors": [
      "Yonghui Jia",
      "Wenliang Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.12816",
    "title": "The MeVer DeepFake Detection Service: Lessons Learnt from Developing and  Deploying in the Wild",
    "abstract": "Enabled by recent improvements in generation methodologies, DeepFakes have become mainstream due to their increasingly better visual quality, the increase in easy-to-use generation tools and the rapid dissemination through social media. This fact poses a severe threat to our societies with the potential to erode social cohesion and influence our democracies. To mitigate the threat, numerous DeepFake detection schemes have been introduced in the literature but very few provide a web service that can be used in the wild. In this paper, we introduce the MeVer DeepFake detection service, a web service detecting deep learning manipulations in images and video. We present the design and implementation of the proposed processing pipeline that involves a model ensemble scheme, and we endow the service with a model card for transparency. Experimental results show that our service performs robustly on the three benchmark datasets while being vulnerable to Adversarial Attacks. Finally, we outline our experience and lessons learned when deploying a research system into production in the hopes that it will be useful to other academic and industry teams. ",
    "url": "https://arxiv.org/abs/2204.12816",
    "authors": [
      "Spyridon Baxevanakis",
      "Giorgos Kordopatis-Zilos",
      "Panagiotis Galopoulos",
      "Lazaros Apostolidis",
      "Killian Levacher",
      "Ipek B. Schlicht",
      "Denis Teyssou",
      "Ioannis Kompatsiaris",
      "Symeon Papadopoulos"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2204.12825",
    "title": "Uncertainty-Aware Prediction of Battery Energy Consumption for Hybrid  Electric Vehicles",
    "abstract": "The usability of vehicles is highly dependent on their energy consumption. In particular, one of the main factors hindering the mass adoption of electric (EV), hybrid (HEV), and plug-in hybrid (PHEV) vehicles is range anxiety, which occurs when a driver is uncertain about the availability of energy for a given trip. To tackle this problem, we propose a machine learning approach for modeling the battery energy consumption. By reducing predictive uncertainty, this method can help increase trust in the vehicle's performance and thus boost its usability. Most related work focuses on physical and/or chemical models of the battery that affect the energy consumption. We propose a data-driven approach which relies on real-world datasets including battery related attributes. Our approach showed an improvement in terms of predictive uncertainty as well as in accuracy compared to traditional methods. ",
    "url": "https://arxiv.org/abs/2204.12825",
    "authors": [
      "Jihed Khiari",
      "Cristina Olaverri-Monreal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.12831",
    "title": "The Revisiting Problem in Simultaneous Localization and Mapping: A  Survey on Visual Loop Closure Detection",
    "abstract": "Where am I? This is one of the most critical questions that any intelligent system should answer to decide whether it navigates to a previously visited area. This problem has long been acknowledged for its challenging nature in simultaneous localization and mapping (SLAM), wherein the robot needs to correctly associate the incoming sensory data to the database allowing consistent map generation. The significant advances in computer vision achieved over the last 20 years, the increased computational power, and the growing demand for long-term exploration contributed to efficiently performing such a complex task with inexpensive perception sensors. In this article, visual loop closure detection, which formulates a solution based solely on appearance input data, is surveyed. We start by briefly introducing place recognition and SLAM concepts in robotics. Then, we describe a loop closure detection system's structure, covering an extensive collection of topics, including the feature extraction, the environment representation, the decision-making step, and the evaluation process. We conclude by discussing open and new research challenges, particularly concerning the robustness in dynamic environments, the computational complexity, and scalability in long-term operations. The article aims to serve as a tutorial and a position paper for newcomers to visual loop closure detection. ",
    "url": "https://arxiv.org/abs/2204.12831",
    "authors": [
      "Konstantinos A. Tsintotas",
      "Loukas Bampis",
      "Antonios Gasteratos"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.12837",
    "title": "A Task Programming Implementation for the Particle in Cell Code Smilei",
    "abstract": "An implementation of the electromagnetic Particle in Cell loop in the code Smilei using task programming is presented. Through OpenMP, the macro-particles operations are formulated in terms of tasks. This formulation allows asynchronous execution respecting the data dependencies of the macro-particle operations, the most time-consuming part of the code in simulations of interest for plasma physics. Through some benchmarks it is shown that this formulation can help mitigating the load imbalance of these operations at the OpenMP thread level. The improvements in strong scaling for load-imbalanced physical cases are discussed. ",
    "url": "https://arxiv.org/abs/2204.12837",
    "authors": [
      "Francesco Massimo",
      "Mathieu Lobet",
      "Julien Derouillat",
      "Arnaud Beck",
      "Guillaume Bouchard",
      "Mickael Grech",
      "Frédéric Pérez",
      "Tommaso Vinci"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computational Physics (physics.comp-ph)",
      "Plasma Physics (physics.plasm-ph)"
    ]
  },
  {
    "id": "arXiv:2204.12841",
    "title": "BBBD: Bounding Box Based Detector for Occlusion Detection and Order  Recovery",
    "abstract": "Occlusion handling is one of the challenges of object detection and segmentation, and scene understanding. Because objects appear differently when they are occluded in varying degree, angle, and locations. Therefore, determining the existence of occlusion between objects and their order in a scene is a fundamental requirement for semantic understanding. Existing works mostly use deep learning based models to retrieve the order of the instances in an image or for occlusion detection. This requires labelled occluded data and it is time consuming. In this paper, we propose a simpler and faster method that can perform both operations without any training and only requires the modal segmentation masks. For occlusion detection, instead of scanning the two objects entirely, we only focus on the intersected area between their bounding boxes. Similarly, we use the segmentation mask inside the same area to recover the depth-ordering. When tested on COCOA dataset, our method achieves +8% and +5% more accuracy than the baselines in order recovery and occlusion detection respectively. ",
    "url": "https://arxiv.org/abs/2204.12841",
    "authors": [
      "Kaziwa Saleh",
      "Zoltan Vamossy"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12847",
    "title": "Query2Particles: Knowledge Graph Reasoning with Particle Embeddings",
    "abstract": "Answering complex logical queries on incomplete knowledge graphs (KGs) with missing edges is a fundamental and important task for knowledge graph reasoning. The query embedding method is proposed to answer these queries by jointly encoding queries and entities to the same embedding space. Then the answer entities are selected according to the similarities between the entity embeddings and the query embedding. As the answers to a complex query are obtained from a combination of logical operations over sub-queries, the embeddings of the answer entities may not always follow a uni-modal distribution in the embedding space. Thus, it is challenging to simultaneously retrieve a set of diverse answers from the embedding space using a single and concentrated query representation such as a vector or a hyper-rectangle. To better cope with queries with diversified answers, we propose Query2Particles (Q2P), a complex KG query answering method. Q2P encodes each query into multiple vectors, named particle embeddings. By doing so, the candidate answers can be retrieved from different areas over the embedding space using the maximal similarities between the entity embeddings and any of the particle embeddings. Meanwhile, the corresponding neural logic operations are defined to support its reasoning over arbitrary first-order logic queries. The experiments show that Query2Particles achieves state-of-the-art performance on the complex query answering tasks on FB15k, FB15K-237, and NELL knowledge graphs. ",
    "url": "https://arxiv.org/abs/2204.12847",
    "authors": [
      "Jiaxin Bai",
      "Zihao Wang",
      "Hongming Zhang",
      "Yangqiu Song"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.12848",
    "title": "Detecting Backdoor Poisoning Attacks on Deep Neural Networks by Heatmap  Clustering",
    "abstract": "Predicitions made by neural networks can be fraudulently altered by so-called poisoning attacks. A special case are backdoor poisoning attacks. We study suitable detection methods and introduce a new method called Heatmap Clustering. There, we apply a $k$-means clustering algorithm on heatmaps produced by the state-of-the-art explainable AI method Layer-wise relevance propagation. The goal is to separate poisoned from un-poisoned data in the dataset. We compare this method with a similar method, called Activation Clustering, which also uses $k$-means clustering but applies it on the activation of certain hidden layers of the neural network as input. We test the performance of both approaches for standard backdoor poisoning attacks, label-consistent poisoning attacks and label-consistent poisoning attacks with reduced amplitude stickers. We show that Heatmap Clustering consistently performs better than Activation Clustering. However, when considering label-consistent poisoning attacks, the latter method also yields good detection performance. ",
    "url": "https://arxiv.org/abs/2204.12848",
    "authors": [
      "Lukas Schulth",
      "Christian Berghoff",
      "Matthias Neu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.12855",
    "title": "Prediction Approach against DDoS Attack based on Machine Learning  Multiclassfier",
    "abstract": "DDoS attacks, also known as distributed denial of service (DDoS) attacks, have emerged as one of the most serious and fastest-growing threats on the Internet. Denial-of-service (DDoS) attacks are an example of cyber attacks that target a specific system or network in an attempt to render it inaccessible or unusable for a period of time. As a result, improving the detection of diverse types of DDoS cyber threats with better algorithms and higher accuracy while keeping the computational cost under control has become the most significant component of detecting DDoS cyber threats. In order to properly defend the targeted network or system, it is critical to first determine the sort of DDoS assault that has been launched against it. A number of ensemble classification techniques are presented in this paper, which combines the performance of various algorithms. They are then compared to existing Machine Learning Algorithms in terms of their effectiveness in detecting different types of DDoS attacks using accuracy, F1 scores, and ROC curves. The results show high accuracy and good performance. ",
    "url": "https://arxiv.org/abs/2204.12855",
    "authors": [
      "Anupama Mishra"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.12881",
    "title": "LiftPool: Lifting-based Graph Pooling for Hierarchical Graph  Representation Learning",
    "abstract": "Graph pooling has been increasingly considered for graph neural networks (GNNs) to facilitate hierarchical graph representation learning. Existing graph pooling methods commonly consist of two stages, i.e., selecting the top-ranked nodes and removing the rest nodes to construct a coarsened graph representation. However, local structural information of the removed nodes would be inevitably dropped in these methods, due to the inherent coupling of nodes (location) and their features (signals). In this paper, we propose an enhanced three-stage method via lifting, named LiftPool, to improve hierarchical graph representation by maximally preserving the local structural information in graph pooling. LiftPool introduces an additional stage of graph lifting before graph coarsening to preserve the local information of the removed nodes and decouple the processes of node removing and feature reduction. Specifically, for each node to be removed, its local information is obtained by subtracting the global information aggregated from its neighboring preserved nodes. Subsequently, this local information is aligned and propagated to the preserved nodes to alleviate information loss in graph coarsening. Furthermore, we demonstrate that the proposed LiftPool is localized and permutation-invariant. The proposed graph lifting structure is general to be integrated with existing downsampling-based graph pooling methods. Evaluations on benchmark graph datasets show that LiftPool substantially outperforms the state-of-the-art graph pooling methods in the task of graph classification. ",
    "url": "https://arxiv.org/abs/2204.12881",
    "authors": [
      "Mingxing Xu",
      "Wenrui Dai",
      "Chenglin Li",
      "Junni Zou",
      "Hongkai Xiong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12893",
    "title": "Beyond Duplicates: Towards Understanding and Predicting Link Types in  Issue Tracking Systems",
    "abstract": "Software projects use Issue Tracking Systems (ITS) like JIRA to track issues and organize the workflows around them. Issues are often inter-connected via different links such as the default JIRA link types Duplicate, Relate, Block, or Subtask. While previous research has mostly focused on analyzing and predicting duplication links, this work aims at understanding the various other link types, their prevalence, and characteristics towards a more reliable link type prediction. For this, we studied 607,208 links connecting 698,790 issues in 15 public JIRA repositories. Besides the default types, the custom types Depend, Incorporate, Split, and Cause were also common. We manually grouped all 75 link types used in the repositories into five general categories: General Relation, Duplication, Composition, Temporal / Causal, and Workflow. Comparing the structures of the corresponding graphs, we observed several trends. For instance, Duplication links tend to represent simpler issue graphs often with two components and Composition links present the highest amount of hierarchical tree structures (97.7%). Surprisingly, General Relation links have a significantly higher transitivity score than Duplication and Temporal / Causal links. Motivated by the differences between the link types and by their popularity, we evaluated the robustness of two state-of-the-art duplicate detection approaches from the literature on the JIRA dataset. We found that current deep-learning approaches confuse between Duplication and other links in almost all repositories. On average, the classification accuracy dropped by 6% for one approach and 12% for the other. Extending the training sets with other link types seems to partly solve this issue. We discuss our findings and their implications for research and practice. ",
    "url": "https://arxiv.org/abs/2204.12893",
    "authors": [
      "Clara Marie Lüders",
      "Abir Bouraffa",
      "Walid Maalej"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.12900",
    "title": "Global Trajectory Helps Person Retrieval in a Camera Network",
    "abstract": "We are concerned about retrieving a query person from the videos taken by a non-overlapping camera network. Existing methods often rely on pure visual matching or consider temporal constraint, but ignore the spatial information of the camera network. To address this problem, we propose a framework of person retrieval based on cross-camera trajectory generation which integrates both temporal and spatial information. To obtain the pedestrian trajectories, we propose a new cross-camera spatio-temporal model that integrates the walking habits of pedestrians and the path layout between cameras, forming a joint probability distribution. Such a spatio-temporal model among a camera network can be specified using sparsely sampled pedestrian data. Based on the spatio-temporal model, the cross-camera trajectories of a specific pedestrian can be extracted by the conditional random field model, and further optimized by the restricted nonnegative matrix factorization. Finally, a trajectory re-ranking technology is proposed to improve the person retrieval results. To verify the effectiveness of our approach, we build the first dataset of cross-camera pedestrian trajectories over an actual monitoring scenario, namely the Person Trajectory Dataset. Extensive experiments have verified the effectiveness and robustness of the proposed method. ",
    "url": "https://arxiv.org/abs/2204.12900",
    "authors": [
      "Xin Zhang",
      "Xiaohua Xie",
      "Jianhuang Lai",
      "Wei-Shi Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.12902",
    "title": "A Graph Diffusion Scheme for Decentralized Content Search based on  Personalized PageRank",
    "abstract": "Decentralization is emerging as a key feature of the future Internet. However, effective algorithms for search are missing from state-of-the-art decentralized technologies, such as distributed hash tables and blockchain. This is surprising, since decentralized search has been studied extensively in earlier peer-to-peer (P2P) literature. In this work, we adopt a fresh outlook for decentralized search in P2P networks that is inspired by advancements in dense information retrieval and graph signal processing. In particular, we generate latent representations of P2P nodes based on their stored documents and diffuse them to the rest of the network with graph filters, such as personalized PageRank. We then use the diffused representations to guide search queries towards relevant content. Our preliminary approach is successful in locating relevant documents in nearby nodes but the accuracy declines sharply with the number of stored documents, highlighting the need for more sophisticated techniques. ",
    "url": "https://arxiv.org/abs/2204.12902",
    "authors": [
      "Nikolaos Giatsoglou",
      "Emmanouil Krasanakis",
      "Symeon Papadopoulos",
      "Ioannis Kompatsiaris"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.12903",
    "title": "Spending Privacy Budget Fairly and Wisely",
    "abstract": "Differentially private (DP) synthetic data generation is a practical method for improving access to data as a means to encourage productive partnerships. One issue inherent to DP is that the \"privacy budget\" is generally \"spent\" evenly across features in the data set. This leads to good statistical parity with the real data, but can undervalue the conditional probabilities and marginals that are critical for predictive quality of synthetic data. Further, loss of predictive quality may be non-uniform across the data set, with subsets that correspond to minority groups potentially suffering a higher loss. In this paper, we develop ensemble methods that distribute the privacy budget \"wisely\" to maximize predictive accuracy of models trained on DP data, and \"fairly\" to bound potential disparities in accuracy across groups and reduce inequality. Our methods are based on the insights that feature importance can inform how privacy budget is allocated, and, further, that per-group feature importance and fairness-related performance objectives can be incorporated in the allocation. These insights make our methods tunable to social contexts, allowing data owners to produce balanced synthetic data for predictive analysis. ",
    "url": "https://arxiv.org/abs/2204.12903",
    "authors": [
      "Lucas Rosenblatt",
      "Joshua Allen",
      "Julia Stoyanovich"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.12916",
    "title": "GypSum: Learning Hybrid Representations for Code Summarization",
    "abstract": "Code summarization with deep learning has been widely studied in recent years. Current deep learning models for code summarization generally follow the principle in neural machine translation and adopt the encoder-decoder framework, where the encoder learns the semantic representations from source code and the decoder transforms the learnt representations into human-readable text that describes the functionality of code snippets. Despite they achieve the new state-of-the-art performance, we notice that current models often either generate less fluent summaries, or fail to capture the core functionality, since they usually focus on a single type of code representations. As such we propose GypSum, a new deep learning model that learns hybrid representations using graph attention neural networks and a pre-trained programming and natural language model. We introduce particular edges related to the control flow of a code snippet into the abstract syntax tree for graph construction, and design two encoders to learn from the graph and the token sequence of source code, respectively. We modify the encoder-decoder sublayer in the Transformer's decoder to fuse the representations and propose a dual-copy mechanism to facilitate summary generation. Experimental results demonstrate the superior performance of GypSum over existing code summarization models. ",
    "url": "https://arxiv.org/abs/2204.12916",
    "authors": [
      "Yu Wang",
      "Yu Dong",
      "Xuesong Lu",
      "Aoying Zhou"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.12917",
    "title": "LINA -- A social augmented reality game around mental health, supporting  real-world connection and sense of belonging for early adolescents",
    "abstract": "Early adolescence is a time of major social change; a strong sense of belonging and peer connectedness is an essential protective factor in mental health during that period. In this paper we introduce LINA, an augmented reality (AR) smartphone-based serious game played in school by an entire class (age 10+) together with their teacher, which aims to facilitate and improve peer interaction, sense of belonging and class climate, while creating a safe space to reflect on mental health and external stressors related to family circumstance. LINA was developed through an interdisciplinary collaboration involving a playwright, software developers, psychologists, and artists, via an iterative co-development process with young people. A prototype has been evaluated quantitatively for usability and qualitatively for efficacy in a study with 91 early adolescents (agemean=11.41). Results from the Game User Experience Satisfaction Scale (GUESS-18) and data from qualitative focus groups showed high acceptability and preliminary efficacy of the game. Using AR, a shared immersive narrative and collaborative gameplay in a shared physical space offers an opportunity to harness adolescent affinity for digital technology towards improving real-world social connection and sense of belonging. ",
    "url": "https://arxiv.org/abs/2204.12917",
    "authors": [
      "Gloria Mittmann",
      "Adam Barnard",
      "Ina Krammer",
      "Diogo Martins",
      "João Dias"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2204.12919",
    "title": "Topological Data Analysis for Anomaly Detection in Host-Based Logs",
    "abstract": "Topological Data Analysis (TDA) gives practioners the ability to analyse the global structure of cybersecurity data. We use TDA for anomaly detection in host-based logs collected with the open-source Logging Made Easy (LME) project. We present an approach that builds a filtration of simplicial complexes directly from Windows logs, enabling analysis of their intrinsic structure using topological tools. We compare the efficacy of persistent homology and the spectrum of graph and hypergraph Laplacians as feature vectors against a standard log embedding that counts events, and find that topological and spectral embeddings of computer logs contain discriminative information for classifying anomalous logs that is complementary to standard embeddings. We end by discussing the potential for our methods to be used as part of an explainable framework for anomaly detection. ",
    "url": "https://arxiv.org/abs/2204.12919",
    "authors": [
      "Thomas Davies"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.12922",
    "title": "Using the Projected Belief Network at High Dimensions",
    "abstract": "The projected belief network (PBN) is a layered generative network (LGN) with tractable likelihood function, and is based on a feed-forward neural network (FFNN). There are two versions of the PBN: stochastic and deterministic (D-PBN), and each has theoretical advantages over other LGNs. However, implementation of the PBN requires an iterative algorithm that includes the inversion of a symmetric matrix of size M X M in each layer, where M is the layer output dimension. This, and the fact that the network must be always dimension-reducing in each layer, can limit the types of problems where the PBN can be applied. In this paper, we describe techniques to avoid or mitigate these restrictions and use the PBN effectively at high dimension. We apply the discriminatively aligned PBN (PBN-DA) to classifying and auto-encoding high-dimensional spectrograms of acoustic events. We also present the discriminatively aligned D-PBN for the first time. ",
    "url": "https://arxiv.org/abs/2204.12922",
    "authors": [
      "Paul M Baggenstoss"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.12927",
    "title": "A Bayesian Approach To Graph Partitioning",
    "abstract": "A new algorithm based on bayesian inference for learning local graph conductance based on Gaussian Process(GP) is given that uses advanced MCMC convergence ideas to create a scalable and fast algorithm for convergence to stationary distribution which is provided to learn the bahavior of conductance when traversing the indirected weighted graph. First metric embedding is used to represent the vertices of the graph. Then, uniform induced conductance is calculated for training points. Finally, in the learning step, a gaussian process is used to approximate the uniform induced conductance. MCMC is used to measure uncertainty of estimated hyper-parameters. ",
    "url": "https://arxiv.org/abs/2204.12927",
    "authors": [
      "Farshad Noravesh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12954",
    "title": "Dashlet: Taming Swipe Uncertainty for Robust Short Video Streaming",
    "abstract": "Short video streaming applications have recently gained substantial traction, but the non-linear video presentation they afford swiping users fundamentally changes the problem of maximizing user quality of experience in the face of the vagaries of network throughput and user swipe timing. This paper describes the design and implementation of Dashlet, a system tailored for high quality of experience in short video streaming applications. With the insights we glean from an in-the-wild TikTok performance study and a user study focused on swipe patterns, Dashlet proposes a novel out-of-order video chunk pre-buffering mechanism that leverages a simple, non machine learning-based model of users' swipe statistics to determine the pre-buffering order and bitrate. The net result is a system that achieves 77-99% of an oracle system's QoE and outperforms TikTok by 43.9-45.1x, while also reducing by 30% the number of bytes wasted on downloaded video that is never watched. ",
    "url": "https://arxiv.org/abs/2204.12954",
    "authors": [
      "Zhuqi Li",
      "Yaxiong Xie",
      "Ravi Netravali",
      "Kyle Jamieson"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2204.12956",
    "title": "Towards assessing agricultural land suitability with causal machine  learning",
    "abstract": "Understanding the suitability of agricultural land for applying specific management practices is of great importance for sustainable and resilient agriculture against climate change. Recent developments in the field of causal machine learning enable the estimation of intervention impacts on an outcome of interest, for samples described by a set of observed characteristics. We introduce an extensible data-driven framework that leverages earth observations and frames agricultural land suitability as a geospatial impact assessment problem, where the estimated effects of agricultural practices on agroecosystems serve as a land suitability score and guide decision making. We formulate this as a causal machine learning task and discuss how this approach can be used for agricultural planning in a changing climate. Specifically, we extract the agricultural management practices of \"crop rotation\" and \"landscape crop diversity\" from crop type maps, account for climate and land use data, and use double machine learning to estimate their heterogeneous effect on Net Primary Productivity (NPP), within the Flanders region of Belgium from 2010 to 2020. We find that the effect of crop rotation was insignificant, while landscape crop diversity had a small negative effect on NPP. Finally, we observe considerable effect heterogeneity in space for both practices and analyze it. ",
    "url": "https://arxiv.org/abs/2204.12956",
    "authors": [
      "Georgios Giannarakis",
      "Vasileios Sitokonstantinou",
      "Roxanne Suzette Lorilla",
      "Charalampos Kontoes"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.12970",
    "title": "Blending Data and Physics Against False Data Injection Attack: An  Event-Triggered Moving Target Defence Approach",
    "abstract": "Recently, data-driven detectors and physics-based Moving Target Defences (MTD) have been proposed to detect false data injection (FDI) attacks on power system state estimation. However, the uncontrollable false positive rate of the data-driven detector and the extra cost of frequent MTD usage limit their wide applications. Few works have explored the overlap between these two areas to collaboratively detect FDI attacks. To fill the gap, this paper proposes blending data-driven and physics-based approaches to enhance the detection of FDI attacks. To start, a physics-informed data-driven attack detection and identification algorithm is proposed. Following this, an MTD protocol is triggered by a positive signal from the data-driven detector and is formulated as a bilevel optimisation to robustly guarantee the effectiveness of MTD against the worst-case attack around the identified attack vector while maximising the hiddenness of MTD. To guarantee the feasibility and convergence, the bilevel nonconvex optimisation is separated into two stages, and for each stage, a semidefinite programming is derived through duality and linear matrix inequality. The simulation results verify that by blending data and physics, it can significantly enhance the detection performance while simultaneously reducing the false positive rate of the data-driven detector and the usage of MTD. ",
    "url": "https://arxiv.org/abs/2204.12970",
    "authors": [
      "Wangkun Xu",
      "Martin Higgins",
      "Jianhong Wang",
      "Imad M. Jaimoukha",
      "Fei Teng"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.12972",
    "title": "Multi-Objective Physics-Guided Recurrent Neural Networks for Identifying  Non-Autonomous Dynamical Systems",
    "abstract": "While trade-offs between modeling effort and model accuracy remain a major concern with system identification, resorting to data-driven methods often leads to a complete disregard for physical plausibility. To address this issue, we propose a physics-guided hybrid approach for modeling non-autonomous systems under control. Starting from a traditional physics-based model, this is extended by a recurrent neural network and trained using a sophisticated multi-objective strategy yielding physically plausible models. While purely data-driven methods fail to produce satisfying results, experiments conducted on real data reveal substantial accuracy improvements by our approach compared to a physics-based model. ",
    "url": "https://arxiv.org/abs/2204.12972",
    "authors": [
      "Oliver Schön",
      "Ricarda-Samantha Götte",
      "Julia Timmermann"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.13004",
    "title": "Defending Against Person Hiding Adversarial Patch Attack with a  Universal White Frame",
    "abstract": "Object detection has attracted great attention in the computer vision area and has emerged as an indispensable component in many vision systems. In the era of deep learning, many high-performance object detection networks have been proposed. Although these detection networks show high performance, they are vulnerable to adversarial patch attacks. Changing the pixels in a restricted region can easily fool the detection network in the physical world. In particular, person-hiding attacks are emerging as a serious problem in many safety-critical applications such as autonomous driving and surveillance systems. Although it is necessary to defend against an adversarial patch attack, very few efforts have been dedicated to defending against person-hiding attacks. To tackle the problem, in this paper, we propose a novel defense strategy that mitigates a person-hiding attack by optimizing defense patterns, while previous methods optimize the model. In the proposed method, a frame-shaped pattern called a 'universal white frame' (UWF) is optimized and placed on the outside of the image. To defend against adversarial patch attacks, UWF should have three properties (i) suppressing the effect of the adversarial patch, (ii) maintaining its original prediction, and (iii) applicable regardless of images. To satisfy the aforementioned properties, we propose a novel pattern optimization algorithm that can defend against the adversarial patch. Through comprehensive experiments, we demonstrate that the proposed method effectively defends against the adversarial patch attack. ",
    "url": "https://arxiv.org/abs/2204.13004",
    "authors": [
      "Youngjoon Yu",
      "Hong Joo Lee",
      "Hakmin Lee",
      "Yong Man Ro"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.13009",
    "title": "Extremal GloVe: Theoretically Accurate Distributed Word Embedding by  Tail Inference",
    "abstract": "Distributed word embeddings such as Word2Vec and GloVe have been widely adopted in industrial context settings. Major technical applications of GloVe include recommender systems and natural language processing. The fundamental theory behind GloVe relies on the selection of a weighting function in the weighted least squres formulation that computes the powered ratio of word occurrence count and the maximum word count in the corpus. However, the initial formulation of GloVe is not theoretically sound in two aspects, namely the selection of the weighting function and its power exponent is ad-hoc. In this paper, we utilize the theory of extreme value analysis and propose a theoretically accurate version of GloVe. By reformulating the weighted least squares loss function as the expected loss function and accurately choosing the power exponent, we create a theoretically accurate version of GloVe. We demonstrate the competitiveness of our algorithm and show that the initial formulation of GloVe with the suggested optimal parameter can be viewed as a special case of our paradigm. ",
    "url": "https://arxiv.org/abs/2204.13009",
    "authors": [
      "Hao Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.13016",
    "title": "RankMat : Matrix Factorization with Calibrated Distributed Embedding and  Fairness Enhancement",
    "abstract": "Matrix Factorization is a widely adopted technique in the field of recommender system. Matrix Factorization techniques range from SVD, LDA, pLSA, SVD++, MatRec, Zipf Matrix Factorization and Item2Vec. In recent years, distributed word embeddings have inspired innovation in the area of recommender systems. Word2vec and GloVe have been especially emphasized in many industrial application scenario such as Xiaomi's recommender system. In this paper, we propose a new matrix factorization inspired by the theory of power law and GloVe. Instead of the exponential nature of GloVe model, we take advantage of Pareto Distribution to model our loss function. Our method is explainable in theory and easy-to-implement in practice. In the experiment section, we prove our approach is superior to vanilla matrix factorization technique and comparable with GloVe-based model in both accuracy and fairness metrics. ",
    "url": "https://arxiv.org/abs/2204.13016",
    "authors": [
      "Hao Wang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2204.13054",
    "title": "Systematic Literature Review: Anti-Phishing Defences and Their  Application to Before-the-click Phishing Email Detection",
    "abstract": "Most research into anti-phishing defence assumes that the mal-actor is attempting to harvest end-users' personally identifiable information or login credentials and, hence, focuses on detecting phishing websites. The defences for this type of attack are usually activated after the end-user clicks on a link, at which point the link is checked. This is known as after-the-click detection. However, more sophisticated phishing attacks (such as spear-phishing and whaling) are rarely designed to get the end-user to visit a website. Instead, they attempt to get the end-user to perform some other action, for example, transferring money from their bank account to the mal-actors account. These attacks are rarer, and before-the-click defence has been investigated less than after-the-click defence. To better integrate and contextualize these studies in the overall anti-phishing research, this paper presents a systematic literature review of proposed anti-phishing defences. From a total of 6330 papers, 21 primary studies and 335 secondary studies were identified and examined. The current research was grouped into six primary categories, blocklist/allowlist, heuristics, content, visual, artificial intelligence/machine learning and proactive, with an additional category of \"other\" for detection techniques that do not fit into any of the primary categories. It then discusses the performance and suitability of using these techniques for detecting phishing emails before the end-user even reads the email. Finally, it suggests some promising areas for further research. ",
    "url": "https://arxiv.org/abs/2204.13054",
    "authors": [
      "Trevor Wood",
      "Vitor Basto-Fernandes",
      "Eerke Boiten",
      "Iryna Yevseyeva"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.13062",
    "title": "Collaborative Learning for Hand and Object Reconstruction with  Attention-guided Graph Convolution",
    "abstract": "Estimating the pose and shape of hands and objects under interaction finds numerous applications including augmented and virtual reality. Existing approaches for hand and object reconstruction require explicitly defined physical constraints and known objects, which limits its application domains. Our algorithm is agnostic to object models, and it learns the physical rules governing hand-object interaction. This requires automatically inferring the shapes and physical interaction of hands and (potentially unknown) objects. We seek to approach this challenging problem by proposing a collaborative learning strategy where two-branches of deep networks are learning from each other. Specifically, we transfer hand mesh information to the object branch and vice versa for the hand branch. The resulting optimisation (training) problem can be unstable, and we address this via two strategies: (i) attention-guided graph convolution which helps identify and focus on mutual occlusion and (ii) unsupervised associative loss which facilitates the transfer of information between the branches. Experiments using four widely-used benchmarks show that our framework achieves beyond state-of-the-art accuracy in 3D pose estimation, as well as recovers dense 3D hand and object shapes. Each technical component above contributes meaningfully in the ablation study. ",
    "url": "https://arxiv.org/abs/2204.13062",
    "authors": [
      "Tze Ho Elden Tse",
      "Kwang In Kim",
      "Ales Leonardis",
      "Hyung Jin Chang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.13096",
    "title": "3D Magic Mirror: Clothing Reconstruction from a Single Image via a  Causal Perspective",
    "abstract": "This research aims to study a self-supervised 3D clothing reconstruction method, which recovers the geometry shape, and texture of human clothing from a single 2D image. Compared with existing methods, we observe that three primary challenges remain: (1) the conventional template-based methods are limited to modeling non-rigid clothing objects, e.g., handbags and dresses, which are common in fashion images; (2) 3D ground-truth meshes of clothing are usually inaccessible due to annotation difficulties and time costs. (3) It remains challenging to simultaneously optimize four reconstruction factors, i.e., camera viewpoint, shape, texture, and illumination. The inherent ambiguity compromises the model training, such as the dilemma between a large shape with a remote camera or a small shape with a close camera. In an attempt to address the above limitations, we propose a causality-aware self-supervised learning method to adaptively reconstruct 3D non-rigid objects from 2D images without 3D annotations. In particular, to solve the inherent ambiguity among four implicit variables, i.e., camera position, shape, texture, and illumination, we study existing works and introduce an explainable structural causal map (SCM) to build our model. The proposed model structure follows the spirit of the causal map, which explicitly considers the prior template in the camera estimation and shape prediction. When optimization, the causality intervention tool, i.e., two expectation-maximization loops, is deeply embedded in our algorithm to (1) disentangle four encoders and (2) help the prior template update. Extensive experiments on two 2D fashion benchmarks, e.g., ATR, and Market-HQ, show that the proposed method could yield high-fidelity 3D reconstruction. Furthermore, we also verify the scalability of the proposed method on a fine-grained bird dataset, i.e., CUB. ",
    "url": "https://arxiv.org/abs/2204.13096",
    "authors": [
      "Zhedong Zheng",
      "Jiayin Zhu",
      "Wei Ji",
      "Yi Yang",
      "Tat-Seng Chua"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.13097",
    "title": "Learning to Borrow -- Relation Representation for Without-Mention  Entity-Pairs for Knowledge Graph Completion",
    "abstract": "Prior work on integrating text corpora with knowledge graphs (KGs) to improve Knowledge Graph Embedding (KGE) have obtained good performance for entities that co-occur in sentences in text corpora. Such sentences (textual mentions of entity-pairs) are represented as Lexicalised Dependency Paths (LDPs) between two entities. However, it is not possible to represent relations between entities that do not co-occur in a single sentence using LDPs. In this paper, we propose and evaluate several methods to address this problem, where we borrow LDPs from the entity pairs that co-occur in sentences in the corpus (i.e. with mention entity pairs) to represent entity pairs that do not co-occur in any sentence in the corpus (i.e. without mention entity pairs). We propose a supervised borrowing method, SuperBorrow, that learns to score the suitability of an LDP to represent a without-mention entity pair using pre-trained entity embeddings and contextualised LDP representations. Experimental results show that SuperBorrow improves the link prediction performance of multiple widely-used prior KGE methods such as TransE, DistMult, ComplEx and RotatE. ",
    "url": "https://arxiv.org/abs/2204.13097",
    "authors": [
      "Huda Hakami",
      "Mona Hakami",
      "Angrosh Mandya",
      "Danushka Bollegala"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.13101",
    "title": "Self-Supervised Learning of Object Parts for Semantic Segmentation",
    "abstract": "Progress in self-supervised learning has brought strong general image representation learning methods. Yet so far, it has mostly focused on image-level learning. In turn, tasks such as unsupervised image segmentation have not benefited from this trend as they require spatially-diverse representations. However, learning dense representations is challenging, as in the unsupervised context it is not clear how to guide the model to learn representations that correspond to various potential object categories. In this paper, we argue that self-supervised learning of object parts is a solution to this issue. Object parts are generalizable: they are a priori independent of an object definition, but can be grouped to form objects a posteriori. To this end, we leverage the recently proposed Vision Transformer's capability of attending to objects and combine it with a spatially dense clustering task for fine-tuning the spatial tokens. Our method surpasses the state-of-the-art on three semantic segmentation benchmarks by 17%-3%, showing that our representations are versatile under various object definitions. Finally, we extend this to fully unsupervised segmentation - which refrains completely from using label information even at test-time - and demonstrate that a simple method for automatically merging discovered object parts based on community detection yields substantial gains. ",
    "url": "https://arxiv.org/abs/2204.13101",
    "authors": [
      "Adrian Ziegler",
      "Yuki M. Asano"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.13103",
    "title": "FlowGNN: A Dataflow Architecture for Universal Graph Neural Network  Inference via Multi-Queue Streaming",
    "abstract": "Graph neural networks (GNNs) have recently exploded in popularity thanks to their broad applicability to graph-related problems such as quantum chemistry, drug discovery, and high energy physics. However, meeting demand for novel GNN models and fast inference simultaneously is challenging because of the gap between developing efficient accelerators and the rapid creation of new GNN models. Prior art focuses on the acceleration of specific classes of GNNs, such as Graph Convolutional Network (GCN), but lacks the generality to support a wide range of existing or new GNN models. Meanwhile, most work rely on graph pre-processing to exploit data locality, making them unsuitable for real-time applications. To address these limitations, in this work, we propose a generic dataflow architecture for GNN acceleration, named FlowGNN, which can flexibly support the majority of message-passing GNNs. The contributions are three-fold. First, we propose a novel and scalable dataflow architecture, which flexibly supports a wide range of GNN models with message-passing mechanism. The architecture features a configurable dataflow optimized for simultaneous computation of node embedding, edge embedding, and message passing, which is generally applicable to all models. We also propose a rich library of model-specific components. Second, we deliver ultra-fast real-time GNN inference without any graph pre-processing, making it agnostic to dynamically changing graph structures. Third, we verify our architecture on the Xilinx Alveo U50 FPGA board and measure the on-board end-to-end performance. We achieve a speed-up of up to 51-254x against CPU (6226R) and 1.3-477x against GPU (A6000) (with batch sizes 1 through 1024); we also outperform the SOTA GNN accelerator I-GCN by 1.03x and 1.25x across two datasets. Our implementation code and on-board measurement are publicly available on GitHub. ",
    "url": "https://arxiv.org/abs/2204.13103",
    "authors": [
      "Rishov Sarkar",
      "Stefan Abi-Karam",
      "Yuqi He",
      "Lakshmi Sathidevi",
      "Cong Hao"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12541",
    "title": "Multi stain graph fusion for multimodal integration in pathology",
    "abstract": "In pathology, tissue samples are assessed using multiple staining techniques to enhance contrast in unique histologic features. In this paper, we introduce a multimodal CNN-GNN based graph fusion approach that leverages complementary information from multiple non-registered histopathology images to predict pathologic scores. We demonstrate this approach in nonalcoholic steatohepatitis (NASH) by predicting CRN fibrosis stage and NAFLD Activity Score (NAS). Primary assessment of NASH typically requires liver biopsy evaluation on two histological stains: Trichrome (TC) and hematoxylin and eosin (H&E). Our multimodal approach learns to extract complementary information from TC and H&E graphs corresponding to each stain while simultaneously learning an optimal policy to combine this information. We report up to 20% improvement in predicting fibrosis stage and NAS component grades over single-stain modeling approaches, measured by computing linearly weighted Cohen's kappa between machine-derived vs. pathologist consensus scores. Broadly, this paper demonstrates the value of leveraging diverse pathology images for improved ML-powered histologic assessment. ",
    "url": "https://arxiv.org/abs/2204.12541",
    "authors": [
      "Chaitanya Dwivedi",
      "Shima Nofallah",
      "Maryam Pouryahya",
      "Janani Iyer",
      "Kenneth Leidal",
      "Chuhan Chung",
      "Timothy Watkins",
      "Andrew Billin",
      "Robert Myers",
      "John Abel",
      "Ali Behrooz"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12586",
    "title": "Protein 3D structure-based neural networks highly improve the accuracy  in compound-protein binding affinity prediction",
    "abstract": "Theoretically, the accuracy of computational models in predicting compound-protein binding affinities (CPAs) could be improved by the introduction of protein 3D structure information. However, most of these models still suffer from a low accuracy due to the lack of an efficient approach to encode informative protein features. The major challenge is how to combine the multi-modal information such as the residue sequence of the protein, residue atom coordinates and the torsion angles. To tackle this problem, we develop Fast Evolutional Attention and Thoroughgoing-graph Neural Networks (FeatNN) to facilitate the application of protein 3D structure information for predicting CPAs. Specifically, we established a novel end-to-end architecture to jointly embed torsion matrix, discrete distance matrix, and sequence information of protein and extract compound features with deep graph convolution layers. In addition, a new pairwise mapping attention mechanism is introduced to comprehensively learn potential interaction information between proteins and compounds. FeatNN considerably outperforms various state-of-the-art baselines in CPA prediction with the Pearson value elevated by about 35.7%. Thus, FeatNN provides an outstanding method for highly accurate CPA prediction and facilitates high-throughput virtual screening of drug candidates. ",
    "url": "https://arxiv.org/abs/2204.12586",
    "authors": [
      "Binjie Guo",
      "Hanyu Zheng",
      "Huan Huang",
      "Haohan Jiang",
      "Xiaodan Li",
      "Naiyu Guan",
      "Yanming Zuo",
      "Yicheng Zhang",
      "Hengfu Yang",
      "Xuhua Wang"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12629",
    "title": "Gaussian Kernel Variance For an Adaptive Learning Method on Signals Over  Graphs",
    "abstract": "This paper discusses a special kind of a simple yet possibly powerful algorithm, called single-kernel Gradraker (SKG), which is an adaptive learning method predicting unknown nodal values in a network using known nodal values and the network structure. We aim to find out how to configure the special kind of the model in applying the algorithm. To be more specific, we focus on SKG with a Gaussian kernel and specify how to find a suitable variance for the kernel. To do so, we introduce two variables with which we are able to set up requirements on the variance of the Gaussian kernel to achieve (near-) optimal performance and can better understand how SKG works. Our contribution is that we introduce two variables as analysis tools, illustrate how predictions will be affected under different Gaussian kernels, and provide an algorithm finding a suitable Gaussian kernel for SKG with knowledge about the training network. Simulation results on real datasets are provided. ",
    "url": "https://arxiv.org/abs/2204.12629",
    "authors": [
      "Yue Zhao",
      "Ender Ayanoglu"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12687",
    "title": "Multiresolution community analysis of international trade networks",
    "abstract": "The international trade network is a complex system where multiple trade blocs with varying sizes coexist and overlap with each other. However, the resulting structures of community detection in trade networks are often inconsistent and fails to capture the complex landscape of international trade. To address these problems, we propose a multiresolution framework that aggregates all the configuration information from a range of resolutions. This allows us to consider trade communities of different sizes and illuminate the underlying hierarchical structure of trade networks and its constituting blocks. Furthermore, by measuring membership inconsistency (MeI) of each country and conducting multiple regression analysis with various economic and political indicators, we demonstrate that there exists a positive correlation between the external instability of countries and their structural inconsistency in terms of network topology. ",
    "url": "https://arxiv.org/abs/2204.12687",
    "authors": [
      "Wonguk Cho",
      "Daekyung Lee",
      "Beom Jun Kim"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.12904",
    "title": "Epicardial Adipose Tissue Segmentation from CT Images with A Semi-3D  Neural Network",
    "abstract": "Epicardial adipose tissue is a type of adipose tissue located between the heart wall and a protective layer around the heart called the pericardium. The volume and thickness of epicardial adipose tissue are linked to various cardiovascular diseases. It is shown to be an independent cardiovascular disease risk factor. Fully automatic and reliable measurements of epicardial adipose tissue from CT scans could provide better disease risk assessment and enable the processing of large CT image data sets for a systemic epicardial adipose tissue study. This paper proposes a method for fully automatic semantic segmentation of epicardial adipose tissue from CT images using a deep neural network. The proposed network uses a U-Net-based architecture with slice depth information embedded in the input image to segment a pericardium region of interest, which is used to obtain an epicardial adipose tissue segmentation. Image augmentation is used to increase model robustness. Cross-validation of the proposed method yields a Dice score of 0.86 on the CT scans of 20 patients. ",
    "url": "https://arxiv.org/abs/2204.12904",
    "authors": [
      "Marin Benčević",
      "Marija Habijan",
      "Irena Galić"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12914",
    "title": "Forecasting Foreign Exchange Rates With Parameter-Free Regression  Networks Tuned By Bayesian Optimization",
    "abstract": "The article is concerned with the problem of multi-step financial time series forecasting of Foreign Exchange (FX) rates. To address this problem, we introduce a parameter-free regression network termed RegPred Net. The exchange rate to forecast is treated as a stochastic process. It is assumed to follow a generalization of Brownian motion and the mean-reverting process referred to as the generalized Ornstein-Uhlenbeck (OU) process, with time-dependent coefficients. Using past observed values of the input time series, these coefficients can be regressed online by the cells of the first half of the network (Reg). The regressed coefficients depend only on - but are very sensitive to - a small number of hyperparameters required to be set by a global optimization procedure for which, Bayesian optimization is an adequate heuristic. Thanks to its multi-layered architecture, the second half of the regression network (Pred) can project time-dependent values for the OU process coefficients and generate realistic trajectories of the time series. Predictions can be easily derived in the form of expected values estimated by averaging values obtained by Monte Carlo simulation. The forecasting accuracy on a 100 days horizon is evaluated for several of the most important FX rates such as EUR/USD, EUR/CNY, and EUR/GBP. Our experimental results show that the RegPred Net significantly outperforms ARMA, ARIMA, LSTMs, and Autoencoder-LSTM models in this task. ",
    "url": "https://arxiv.org/abs/2204.12914",
    "authors": [
      "Linwei Li",
      "Paul-Amaury Matt",
      "Christian Heumann"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.12928",
    "title": "Causal Analysis of Generic Time Series Data Applied for Market  Prediction",
    "abstract": "We explore the applicability of the causal analysis based on temporally shifted (lagged) Pearson correlation applied to diverse time series of different natures in context of the problem of financial market prediction. Theoretical discussion is followed by description of the practical approach for specific environment of time series data with diverse nature and sparsity, as applied for environments of financial markets. The data involves various financial metrics computable from raw market data such as real-time trades and snapshots of the limit order book as well as metrics determined upon social media news streams such as sentiment and different cognitive distortions. The approach is backed up with presentation of algorithmic framework for data acquisition and analysis, concluded with experimental results, and summary pointing out at the possibility to discriminate causal connections between different sorts of real field market data with further discussion on present issues and possible directions of the following work. ",
    "url": "https://arxiv.org/abs/2204.12928",
    "authors": [
      "Anton Kolonin",
      "Ali Raheman",
      "Mukul Vishwas",
      "Ikram Ansari",
      "Juan Pinzon",
      "Alice Ho"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Artificial Intelligence (cs.AI)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2204.12929",
    "title": "Sequence-Based Target Coin Prediction for Cryptocurrency Pump-and-Dump",
    "abstract": "As the pump-and-dump schemes (P&Ds) proliferate in the cryptocurrency market, it becomes imperative to detect such fraudulent activities in advance, to inform potentially susceptible investors before they become victims. In this paper, we focus on the target coin prediction task, i.e., to predict the pump probability of all coins listed in the target exchange before a pump. We conduct a comprehensive study of the latest P&Ds, investigate 709 events organized in Telegram channels from Jan. 2019 to Jan. 2022, and unearth some abnormal yet interesting patterns of P&Ds. Empirical analysis demonstrates that pumped coins exhibit intra-channel homogeneity and inter-channel heterogeneity, which inspires us to develop a novel sequence-based neural network named SNN. Specifically, SNN encodes each channel's pump history as a sequence representation via a positional attention mechanism, which filters useful information and alleviates the noise introduced when the sequence length is long. We also identify and address the coin-side cold-start problem in a practical setting. Extensive experiments show a lift of 1.6% AUC and 41.0% Hit Ratio@3 brought by our method, making it well-suited for real-world application. As a side contribution, we release the source code of our entire data science pipeline on GitHub, along with the dataset tailored for studying the latest P&Ds. ",
    "url": "https://arxiv.org/abs/2204.12929",
    "authors": [
      "Sihao Hu",
      "Zhen Zhang",
      "Shengliang Lu",
      "Bingsheng He",
      "Zhao Li"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.12932",
    "title": "NFT Appraisal Prediction: Utilizing Search Trends, Public Market Data,  Linear Regression and Recurrent Neural Networks",
    "abstract": "In this paper we investigate the correlation between NFT valuations and various features from three primary categories: public market data, NFT metadata, and social trends data. ",
    "url": "https://arxiv.org/abs/2204.12932",
    "authors": [
      "Shrey Jain",
      "Camille Bruckmann",
      "Chase McDougall"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.13048",
    "title": "TERMinator: A Neural Framework for Structure-Based Protein Design using  Tertiary Repeating Motifs",
    "abstract": "Computational protein design has the potential to deliver novel molecular structures, binders, and catalysts for myriad applications. Recent neural graph-based models that use backbone coordinate-derived features show exceptional performance on native sequence recovery tasks and are promising frameworks for design. A statistical framework for modeling protein sequence landscapes using Tertiary Motifs (TERMs), compact units of recurring structure in proteins, has also demonstrated good performance on protein design tasks. In this work, we investigate the use of TERM-derived data as features in neural protein design frameworks. Our graph-based architecture, TERMinator, incorporates TERM-based and coordinate-based information and outputs a Potts model over sequence space. TERMinator outperforms state-of-the-art models on native sequence recovery tasks, suggesting that utilizing TERM-based and coordinate-based features together is beneficial for protein design. ",
    "url": "https://arxiv.org/abs/2204.13048",
    "authors": [
      "Alex J. Li",
      "Vikram Sundar",
      "Gevorg Grigoryan",
      "Amy E. Keating"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.13089",
    "title": "Variational Kalman Filtering with Hinf-Based Correction for Robust  Bayesian Learning in High Dimensions",
    "abstract": "In this paper, we address the problem of convergence of sequential variational inference filter (VIF) through the application of a robust variational objective and Hinf-norm based correction for a linear Gaussian system. As the dimension of state or parameter space grows, performing the full Kalman update with the dense covariance matrix for a large scale system requires increased storage and computational complexity, making it impractical. The VIF approach, based on mean-field Gaussian variational inference, reduces this burden through the variational approximation to the covariance usually in the form of a diagonal covariance approximation. The challenge is to retain convergence and correct for biases introduced by the sequential VIF steps. We desire a framework that improves feasibility while still maintaining reasonable proximity to the optimal Kalman filter as data is assimilated. To accomplish this goal, a Hinf-norm based optimization perturbs the VIF covariance matrix to improve robustness. This yields a novel VIF- Hinf recursion that employs consecutive variational inference and Hinf based optimization steps. We explore the development of this method and investigate a numerical example to illustrate the effectiveness of the proposed filter. ",
    "url": "https://arxiv.org/abs/2204.13089",
    "authors": [
      "Niladri Das",
      "Jed A. Duersch",
      "Thomas A. Catanach"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:1810.08498",
    "title": "Network Classification Based Structural Analysis of Real Networks and  their Model-Generated Counterparts",
    "abstract": " Comments: 29 pages ",
    "url": "https://arxiv.org/abs/1810.08498",
    "authors": [
      "Marcell Nagy",
      "Roland Molontay"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Discrete Mathematics (cs.DM)",
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:1911.06400",
    "title": "Tracking the circulation routes of fresh coins in Bitcoin: A way of  identifying coin miners with transaction network structural properties",
    "abstract": " Comments: an English version of the journal article published in Chinese ",
    "url": "https://arxiv.org/abs/1911.06400",
    "authors": [
      "Zeng-Xian Lin",
      "Xiao Fan Liu"
    ],
    "subjectives": [
      "General Finance (q-fin.GN)",
      "Cryptography and Security (cs.CR)",
      "Information Retrieval (cs.IR)",
      "General Economics (econ.GN)"
    ]
  },
  {
    "id": "arXiv:2008.00397",
    "title": "SeqDialN: Sequential Visual Dialog Networks in Joint Visual-Linguistic  Representation Space",
    "abstract": " Comments: This submission has been withdrawn by arXiv administrators due to an unresolvable authorship dispute ",
    "url": "https://arxiv.org/abs/2008.00397",
    "authors": [
      "Liu Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.07955",
    "title": "LAI Estimation of Cucumber Crop Based on Improved Fully Convolutional  Network",
    "abstract": " Comments: There are some problems with this paper ",
    "url": "https://arxiv.org/abs/2104.07955",
    "authors": [
      "Weiqi Shu",
      "Ling Wang",
      "Bolong Liu",
      "Jie Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2104.08388",
    "title": "Neural String Edit Distance",
    "abstract": " Comments: 14 pages, 5 figures; Workshop on Structured Prediction for NLP @ACL 2022, camera-ready ",
    "url": "https://arxiv.org/abs/2104.08388",
    "authors": [
      "Jindřich Libovický",
      "Alexander Fraser"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.09791",
    "title": "B-PROP: Bootstrapped Pre-training with Representative Words Prediction  for Ad-hoc Retrieval",
    "abstract": " Comments: Accepted by SIGIR 2021 ",
    "url": "https://arxiv.org/abs/2104.09791",
    "authors": [
      "Xinyu Ma",
      "Jiafeng Guo",
      "Ruqing Zhang",
      "Yixing Fan",
      "Yingyan Li",
      "Xueqi Cheng"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2105.02110",
    "title": "Essentiality of the Non-stoquastic Hamiltonians and Driver Graph Design  in Quantum Optimization Annealing",
    "abstract": " Comments: 35 pages, 14 figures; add necessary conditions for the formation of an anti-crossing; generalize a clique of vertices to a clique of partites ",
    "url": "https://arxiv.org/abs/2105.02110",
    "authors": [
      "Vicky Choi"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2105.13634",
    "title": "Saudi Parents' Privacy Concerns about Their Children's Smart Device  Applications",
    "abstract": " Comments: This is the author's version of the accepted manuscript at the International Journal of Child-Computer Interaction. This is version 3 which is similar to version 2 in content (we only removed redundant png images). Version 2 and 3 contain major changes over version 1 ",
    "url": "https://arxiv.org/abs/2105.13634",
    "authors": [
      "Eman Alashwali",
      "Fatimah Alashwali"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2106.11180",
    "title": "Generalization Bounds with Minimal Dependency on Hypothesis Class via  Distributionally Robust Optimization",
    "abstract": " Title: Generalization Bounds with Minimal Dependency on Hypothesis Class via  Distributionally Robust Optimization ",
    "url": "https://arxiv.org/abs/2106.11180",
    "authors": [
      "Yibo Zeng",
      "Henry Lam"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2106.12891",
    "title": "Encoding Involutory Invariances in Neural Networks",
    "abstract": " Comments: Accepted in IJCNN 2022 ",
    "url": "https://arxiv.org/abs/2106.12891",
    "authors": [
      "Anwesh Bhattacharya",
      "Marios Mattheakis",
      "Pavlos Protopapas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2106.14432",
    "title": "Certified Robustness via Randomized Smoothing over Multiplicative  Parameters",
    "abstract": " Title: Certified Robustness via Randomized Smoothing over Multiplicative  Parameters ",
    "url": "https://arxiv.org/abs/2106.14432",
    "authors": [
      "Nikita Muravev",
      "Aleksandr Petiushko"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.15814",
    "title": "Discovering Collaborative Signals for Next POI Recommendation with  Iterative Seq2Graph Augmentation",
    "abstract": " Title: Discovering Collaborative Signals for Next POI Recommendation with  Iterative Seq2Graph Augmentation ",
    "url": "https://arxiv.org/abs/2106.15814",
    "authors": [
      "Yang Li",
      "Tong Chen",
      "Yadan Luo",
      "Hongzhi Yin",
      "Zi Huang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2107.14122",
    "title": "Safest Nearby Neighbor Queries in Road Networks (Full Version)",
    "abstract": " Title: Safest Nearby Neighbor Queries in Road Networks (Full Version) ",
    "url": "https://arxiv.org/abs/2107.14122",
    "authors": [
      "Punam Biswas",
      "Tanzima Hashem",
      "Muhammad Aamir Cheema"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2107.14457",
    "title": "Maximum Entropy Dueling Network Architecture in Atari Domain",
    "abstract": " Title: Maximum Entropy Dueling Network Architecture in Atari Domain ",
    "url": "https://arxiv.org/abs/2107.14457",
    "authors": [
      "Alireza Nadali",
      "Mohammad Mehdi Ebadzadeh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2108.11954",
    "title": "Cascading Neural Network Methodology for Artificial  Intelligence-Assisted Radiographic Detection and Classification of Lead-Less  Implanted Electronic Devices within the Chest",
    "abstract": " Comments: 23 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2108.11954",
    "authors": [
      "Mutlu Demirer",
      "Richard D. White",
      "Vikash Gupta",
      "Ronnie A. Sebro",
      "Barbaros S. Erdal"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.05740",
    "title": "Data Preparation for Software Vulnerability Prediction: A Systematic  Literature Review",
    "abstract": " Comments: Accepted for publication in TSE ",
    "url": "https://arxiv.org/abs/2109.05740",
    "authors": [
      "Roland Croft",
      "Yongzheng Xie",
      "M. Ali Babar"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2109.08371",
    "title": "Bio-Inspired Audio-Visual Cues Integration for Visual Attention  Prediction",
    "abstract": " Comments: Withdrawn due to conflict of interest among authors ",
    "url": "https://arxiv.org/abs/2109.08371",
    "authors": [
      "Yuan Yuan",
      "Hailong Ning",
      "Bin Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2109.12523",
    "title": "A Study of Fake News Reading and Annotating in Social Media Context",
    "abstract": " Title: A Study of Fake News Reading and Annotating in Social Media Context ",
    "url": "https://arxiv.org/abs/2109.12523",
    "authors": [
      "Jakub Simko",
      "Patrik Racsko",
      "Matus Tomlein",
      "Martin Hanakova",
      "Robert Moro",
      "Maria Bielikova"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2110.12399",
    "title": "BINAS: Bilinear Interpretable Neural Architecture Search",
    "abstract": " Comments: The full code is released at this https URL ",
    "url": "https://arxiv.org/abs/2110.12399",
    "authors": [
      "Niv Nayman",
      "Yonathan Aflalo",
      "Asaf Noy",
      "Rong Jin",
      "Lihi Zelnik-Manor"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2111.00524",
    "title": "Intermodulation Interference Detection in 6G Networks: A Machine  Learning Approach",
    "abstract": " Comments: 6 pages, 5 figures. Invited paper to IEEE 95th Vehicular Technology Conference Workshops (VTC2022-Spring), to appear ",
    "url": "https://arxiv.org/abs/2111.00524",
    "authors": [
      "Faris B. Mismar"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2111.07970",
    "title": "Triggerless Backdoor Attack for NLP Tasks with Clean Labels",
    "abstract": " Comments: Accepted to appear at the main conference of NAACL 2022 ",
    "url": "https://arxiv.org/abs/2111.07970",
    "authors": [
      "Leilei Gan",
      "Jiwei Li",
      "Tianwei Zhang",
      "Xiaoya Li",
      "Yuxian Meng",
      "Fei Wu",
      "Yi Yang",
      "Shangwei Guo",
      "Chun Fan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2111.08374",
    "title": "Literature-Augmented Clinical Outcome Prediction",
    "abstract": " Comments: To appear in Findings of NAACL 2022. Code available at: this https URL ",
    "url": "https://arxiv.org/abs/2111.08374",
    "authors": [
      "Aakanksha Naik",
      "Sravanthi Parasa",
      "Sergey Feldman",
      "Lucy Lu Wang",
      "Tom Hope"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2112.05121",
    "title": "Self-Supervised Keypoint Discovery in Behavioral Videos",
    "abstract": " Comments: CVPR 2022. Code: this https URL Project page: this https URL ",
    "url": "https://arxiv.org/abs/2112.05121",
    "authors": [
      "Jennifer J. Sun",
      "Serim Ryou",
      "Roni Goldshmid",
      "Brandon Weissbourd",
      "John Dabiri",
      "David J. Anderson",
      "Ann Kennedy",
      "Yisong Yue",
      "Pietro Perona"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.07637",
    "title": "Exploring Neural Models for Query-Focused Summarization",
    "abstract": " Comments: Findings of NAACL 2022 ",
    "url": "https://arxiv.org/abs/2112.07637",
    "authors": [
      "Jesse Vig",
      "Alexander R. Fabbri",
      "Wojciech Kryściński",
      "Chien-Sheng Wu",
      "Wenhao Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.08055",
    "title": "Building separable approximations for quantum states via neural networks",
    "abstract": " Comments: 13 pages, 7 figures We welcome any comments on references for Tables 1 and 2. Comments on update #1: added more results to the figures, more precise numerical results in table 1 and 2, added references and comparison with previous work. Comments on update #2: added more analytical and numerical results ",
    "url": "https://arxiv.org/abs/2112.08055",
    "authors": [
      "Antoine Girardin",
      "Nicolas Brunner",
      "Tamás Kriváchy"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.00129",
    "title": "A Surrogate-Assisted Controller for Expensive Evolutionary Reinforcement  Learning",
    "abstract": " Title: A Surrogate-Assisted Controller for Expensive Evolutionary Reinforcement  Learning ",
    "url": "https://arxiv.org/abs/2201.00129",
    "authors": [
      "Yuxing Wang",
      "Tiantian Zhang",
      "Yongzhe Chang",
      "Bin Liang",
      "Xueqian Wang",
      "Bo Yuan"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2201.05510",
    "title": "Anomalous Sound Detection using Spectral-Temporal Information Fusion",
    "abstract": " Comments: To appear at ICASSP 2022 ",
    "url": "https://arxiv.org/abs/2201.05510",
    "authors": [
      "Youde Liu",
      "Jian Guan",
      "Qiaoxi Zhu",
      "Wenwu Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2201.05762",
    "title": "Variance-Reduced Heterogeneous Federated Learning via Stratified Client  Selection",
    "abstract": " Comments: there is something wrong in the experiment ",
    "url": "https://arxiv.org/abs/2201.05762",
    "authors": [
      "Guangyuan Shen",
      "Dehong Gao",
      "Libin Yang",
      "Fang Zhou",
      "Duanxiao Song",
      "Wei Lou",
      "Shirui Pan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2201.07309",
    "title": "OSSID: Online Self-Supervised Instance Detection by (and for) Pose  Estimation",
    "abstract": " Comments: 10 pages, 6 figures. RA-L and ICRA 2022 ",
    "url": "https://arxiv.org/abs/2201.07309",
    "authors": [
      "Qiao Gu",
      "Brian Okorn",
      "David Held"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2201.07984",
    "title": "AstBERT: Enabling Language Model for Financial Code Understanding with  Abstract Syntax Trees",
    "abstract": " Title: AstBERT: Enabling Language Model for Financial Code Understanding with  Abstract Syntax Trees ",
    "url": "https://arxiv.org/abs/2201.07984",
    "authors": [
      "Rong Liang",
      "Yujie Lu",
      "Tiehua Zhang",
      "Zhen Huang",
      "Yuze Liu",
      "Xin Chen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.13290",
    "title": "Model-Based Engineering of CPPS Functions and Code Generation for Skills",
    "abstract": " Title: Model-Based Engineering of CPPS Functions and Code Generation for Skills ",
    "url": "https://arxiv.org/abs/2201.13290",
    "authors": [
      "Aljosha Köcher",
      "Alexander Hayward",
      "Alexander Fay"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2202.00232",
    "title": "ISNet: Costless and Implicit Image Segmentation for Deep Classifiers,  with Application in COVID-19 Detection",
    "abstract": " Comments: Replaced COVID-19 X-ray dataset for a larger one. Included a second application, facial attribute estimation, to highlight the new architecture's general applicability ",
    "url": "https://arxiv.org/abs/2202.00232",
    "authors": [
      "Pedro R.A.S. Bassi",
      "Andrea Cavalli"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.05183",
    "title": "Discovering Quantum Phase Transitions with Fermionic Neural Networks",
    "abstract": " Comments: 12 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2202.05183",
    "authors": [
      "G. Cassella",
      "H. Sutterud",
      "S. Azadi",
      "N. D. Drummond",
      "D. Pfau",
      "J. S. Spencer",
      "W. M. C. Foulkes"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Other Condensed Matter (cond-mat.other)",
      "Strongly Correlated Electrons (cond-mat.str-el)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.08758",
    "title": "A Wavelet-based Dual-stream Network for Underwater Image Enhancement",
    "abstract": " Title: A Wavelet-based Dual-stream Network for Underwater Image Enhancement ",
    "url": "https://arxiv.org/abs/2202.08758",
    "authors": [
      "Ziyin Ma",
      "Changjae Oh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2202.10379",
    "title": "(Dis)assortative Partitions on Random Regular Graphs",
    "abstract": " Comments: 21 pages ",
    "url": "https://arxiv.org/abs/2202.10379",
    "authors": [
      "Freya Behrens",
      "Gabriel Arpino",
      "Yaroslav Kivva",
      "Lenka Zdeborová"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Discrete Mathematics (cs.DM)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2202.11161",
    "title": "Impact of Channel Correlation on Subspace-Based Activity Detection in  Grant-Free NOMA",
    "abstract": " Comments: Accepted for publication at IEEE VTC2022-Spring ",
    "url": "https://arxiv.org/abs/2202.11161",
    "authors": [
      "Bashar Tahir",
      "Stefan Schwarz",
      "Markus Rupp"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2202.13097",
    "title": "Language-Independent Speaker Anonymization Approach using  Self-Supervised Pre-Trained Models",
    "abstract": " Title: Language-Independent Speaker Anonymization Approach using  Self-Supervised Pre-Trained Models ",
    "url": "https://arxiv.org/abs/2202.13097",
    "authors": [
      "Xiaoxiao Miao",
      "Xin Wang",
      "Erica Cooper",
      "Junichi Yamagishi",
      "Natalia Tomashenko"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.01913",
    "title": "NeRF-Supervision: Learning Dense Object Descriptors from Neural Radiance  Fields",
    "abstract": " Comments: ICRA 2022, Website: this https URL ",
    "url": "https://arxiv.org/abs/2203.01913",
    "authors": [
      "Lin Yen-Chen",
      "Pete Florence",
      "Jonathan T. Barron",
      "Tsung-Yi Lin",
      "Alberto Rodriguez",
      "Phillip Isola"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.07736",
    "title": "CSRS: Code Search with Relevance Matching and Semantic Matching",
    "abstract": " Title: CSRS: Code Search with Relevance Matching and Semantic Matching ",
    "url": "https://arxiv.org/abs/2203.07736",
    "authors": [
      "Yi Cheng",
      "Li Kuang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2203.13430",
    "title": "Plagiarism Detection in the Bengali Language: A Text Similarity-Based  Approach",
    "abstract": " Comments: ACCEPTED AT 3RD INTERNATIONAL CONFERENCE ON ENGINEERING AND ADVANCEMENT IN TECHNOLOGY (ICEAT 2022) ",
    "url": "https://arxiv.org/abs/2203.13430",
    "authors": [
      "Satyajit Ghosh",
      "Aniruddha Ghosh",
      "Bittaswer Ghosh",
      "Abhishek Roy"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.02626",
    "title": "A Weakly Supervised Propagation Model for Rumor Verification and Stance  Detection with Multiple Instance Learning",
    "abstract": " Comments: Accepted by SIGIR 2022 ",
    "url": "https://arxiv.org/abs/2204.02626",
    "authors": [
      "Ruichao Yang",
      "Jing Ma",
      "Hongzhan Lin",
      "Wei Gao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.03299",
    "title": "On the Impact of Social Media Recommendations on Opinion Consensus",
    "abstract": " Comments: A previous version of this work was published at conference AIxIA 2021. The conference paper will be published in Proceedings Volume: \"AIxIA 2021 - Advances in Artificial Intelligence - XXth International Conference of the Italian Association for Artificial Intelligence, Virtual Event, December 1-3, Revised Selected Papers\" ",
    "url": "https://arxiv.org/abs/2204.03299",
    "authors": [
      "Vincenzo Auletta",
      "Antonio Coppola",
      "Diodato Ferraioli"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2204.05533",
    "title": "How does fake news use a thumbnail? CLIP-based Multimodal Detection on  the Unrepresentative News Image",
    "abstract": " Comments: 9 pages, 8 figures including appendix figure, 2 tables. Published in Findings of ACL workshop, CONSTRAINT 2022 (Long paper). The manuscript is slightly revised after the camera ready version ",
    "url": "https://arxiv.org/abs/2204.05533",
    "authors": [
      "Hyewon Choi",
      "Yejun Yoon",
      "Seunghyun Yoon",
      "Kunwoo Park"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.06718",
    "title": "Learning Convolutional Neural Networks in the Frequency Domain",
    "abstract": " Comments: Submitted to NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2204.06718",
    "authors": [
      "Hengyue Pan",
      "Yixin Chen",
      "Xin Niu",
      "Wenbo Zhou",
      "Dongsheng Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.08084",
    "title": "Learning 3D Semantics from Pose-Noisy 2D Images with Hierarchical Full  Attention Network",
    "abstract": " Comments: 3D Point Cloud Semantic Segmentation, Semantic Aggregation from Images, Pose Noise ",
    "url": "https://arxiv.org/abs/2204.08084",
    "authors": [
      "Yuhang He",
      "Lin Chen",
      "Junkun Xie",
      "Long Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.08735",
    "title": "Neural Collapse Inspired Attraction-Repulsion-Balanced Loss for  Imbalanced Learning",
    "abstract": " Comments: 25 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2204.08735",
    "authors": [
      "Liang Xie",
      "Yibo Yang",
      "Deng Cai",
      "Xiaofei He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2204.09914",
    "title": "CPGNet: Cascade Point-Grid Fusion Network for Real-Time LiDAR Semantic  Segmentation",
    "abstract": " Comments: Accepted in the 2022 IEEE International Conference on Robotics and Automation (ICRA 2022) ",
    "url": "https://arxiv.org/abs/2204.09914",
    "authors": [
      "Xiaoyan Li",
      "Gang Zhang",
      "Hongyu Pan",
      "Zhenhua Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.10383",
    "title": "Autonomous Vehicle Parking in Dynamic Environments: An Integrated System  with Prediction and Motion Planning",
    "abstract": " Title: Autonomous Vehicle Parking in Dynamic Environments: An Integrated System  with Prediction and Motion Planning ",
    "url": "https://arxiv.org/abs/2204.10383",
    "authors": [
      "Jessica Leu",
      "Yebin Wang",
      "Masayoshi Tomizuka",
      "Stefano Di Cairano"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.10740",
    "title": "Embracing AWKWARD! Real-time Adjustment of Reactive Plans Using Social  Norms",
    "abstract": " Comments: 18 pages, 2 figures, 3 Tables, 4 Formalisms, Submitted to COINE 2022 Workshop ",
    "url": "https://arxiv.org/abs/2204.10740",
    "authors": [
      "Leila Methnani",
      "Andreas Antoniades",
      "Andreas Theodorou"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.11028",
    "title": "Reinforced Causal Explainer for Graph Neural Networks",
    "abstract": " Comments: IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) ",
    "url": "https://arxiv.org/abs/2204.11028",
    "authors": [
      "Xiang Wang",
      "Yingxin Wu",
      "An Zhang",
      "Fuli Feng",
      "Xiangnan He",
      "Tat-Seng Chua"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.11406",
    "title": "Robust Self-Augmentation for Named Entity Recognition with Meta  Reweighting",
    "abstract": " Comments: Accepted by NAACL 2022 ",
    "url": "https://arxiv.org/abs/2204.11406",
    "authors": [
      "Linzhi Wu",
      "Pengjun Xie",
      "Jie Zhou",
      "Meishan Zhang",
      "Chunping Ma",
      "Guangwei Xu",
      "Min Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.11479",
    "title": "End-to-End Audio Strikes Back: Boosting Augmentations Towards An  Efficient Audio Classification Network",
    "abstract": " Title: End-to-End Audio Strikes Back: Boosting Augmentations Towards An  Efficient Audio Classification Network ",
    "url": "https://arxiv.org/abs/2204.11479",
    "authors": [
      "Avi Gazneli",
      "Gadi Zimerman",
      "Tal Ridnik",
      "Gilad Sharir",
      "Asaf Noy"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.11590",
    "title": "Unsupervised Domain Adaptation for Monocular 3D Object Detection via  Self-Training",
    "abstract": " Title: Unsupervised Domain Adaptation for Monocular 3D Object Detection via  Self-Training ",
    "url": "https://arxiv.org/abs/2204.11590",
    "authors": [
      "Zhenyu Li",
      "Zehui Chen",
      "Ang Li",
      "Liangji Fang",
      "Qinhong Jiang",
      "Xianming Liu",
      "Junjun Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.11795",
    "title": "Performer: A Novel PPG to ECG Reconstruction Transformer For a Digital  Biomarker of Cardiovascular Disease Detection",
    "abstract": " Comments: 10 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2204.11795",
    "authors": [
      "Ella Lan"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2204.11956",
    "title": "Spontaneous Emergence of Computation in Network Cascades",
    "abstract": " Comments: 11 pages, 7 figures, 1 table, includes supplementary information ",
    "url": "https://arxiv.org/abs/2204.11956",
    "authors": [
      "Galen Wilkerson",
      "Sotiris Moschoyiannis",
      "Henrik Jeldtoft Jensen"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Artificial Intelligence (cs.AI)",
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2204.12007",
    "title": "Assessing the ability of generative adversarial networks to learn  canonical medical image statistics",
    "abstract": " Title: Assessing the ability of generative adversarial networks to learn  canonical medical image statistics ",
    "url": "https://arxiv.org/abs/2204.12007",
    "authors": [
      "Varun A. Kelkar",
      "Dimitrios S. Gotsis",
      "Frank J. Brooks",
      "Prabhat KC",
      "Kyle J. Myers",
      "Rongping Zeng",
      "Mark A. Anastasio"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2204.12063",
    "title": "A Review-aware Graph Contrastive Learning Framework for Recommendation",
    "abstract": " Comments: Accepted by SIGIR 2022 ",
    "url": "https://arxiv.org/abs/2204.12063",
    "authors": [
      "Jie Shuai",
      "Kun Zhang",
      "Le Wu",
      "Peijie Sun",
      "Richang Hong",
      "Meng Wang",
      "Yong Li"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2204.12451",
    "title": "Understanding The Robustness in Vision Transformers",
    "abstract": " Title: Understanding The Robustness in Vision Transformers ",
    "url": "https://arxiv.org/abs/2204.12451",
    "authors": [
      "Daquan Zhou",
      "Zhiding Yu",
      "Enze Xie",
      "Chaowei Xiao",
      "Anima Anandkumar",
      "Jiashi Feng",
      "Jose M. Alvarez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]