[
  {
    "id": "arXiv:2109.11048",
    "title": "Towards practical object detection for weed spraying in precision  agriculture",
    "abstract": "The evolution of smaller, faster processors and cheaper digital storage mechanisms across the last 4-5 decades has vastly increased the opportunity to integrate intelligent technologies in a wide range of practical environments to address a broad spectrum of tasks. One exciting application domain for such technologies is precision agriculture, where the ability to integrate on-board machine vision with data-driven actuation means that farmers can make decisions about crop care and harvesting at the level of the individual plant rather than the whole field. This makes sense both economically and environmentally. However, the key driver for this capability is fast and robust machine vision -- typically driven by machine learning (ML) solutions and dependent on accurate modelling. One critical challenge is that the bulk of ML-based vision research considers only metrics that evaluate the accuracy of object detection and do not assess practical factors. This paper introduces three metrics that highlight different aspects relevant for real-world deployment of precision weeding and demonstrates their utility through experimental results. ",
    "url": "https://arxiv.org/abs/2109.11048",
    "authors": [
      "Adrian Salazar-Gomez",
      "Madeleine Darbyshire",
      "Junfeng Gao",
      "Elizabeth I Sklar",
      "Simon Parsons"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2109.11231",
    "title": "Dynamic inference of user context through social tag embedding for music  recommendation",
    "abstract": "Music listening preferences at a given time depend on a wide range of contextual factors, such as user emotional state, location and activity at listening time, the day of the week, the time of the day, etc. It is therefore of great importance to take them into account when recommending music. However, it is very difficult to develop context-aware recommender systems that consider these factors, both because of the difficulty of detecting some of them, such as emotional state, and because of the drawbacks derived from the inclusion of many factors, such as sparsity problems in contextual pre-filtering. This work involves the proposal of a method for the detection of the user contextual state when listening to music based on the social tags of music items. The intrinsic characteristics of social tagging that allow for the description of items in multiple dimensions can be exploited to capture many contextual dimensions in the user listening sessions. The embeddings of the tags of the first items played in each session are used to represent the context of that session. Recommendations are then generated based on both user preferences and the similarity of the items computed from tag embeddings. Social tags have been used extensively in many recommender systems, however, to our knowledge, they have been hardly used to dynamically infer contextual states. ",
    "url": "https://arxiv.org/abs/2109.11231",
    "authors": [
      "Diego Sánchez-Moreno",
      "Álvaro Lozano Murciego",
      "Vivian F. López Batista",
      "María Dolores Muñoz Vicente",
      "María N. Moreno-García"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2109.11244",
    "title": "An algorithm for reconstructing level-2 phylogenetic networks from  trinets",
    "abstract": "Evolutionary histories for species that cross with one another or exchange genetic material can be represented by leaf-labelled, directed graphs called phylogenetic networks. A major challenge in the burgeoning area of phylogenetic networks is to develop algorithms for building such networks by amalgamating small networks into a single large network. The level of a phylogenetic network is a measure of its deviation from being a tree; the higher the level of network, the less treelike it becomes. Various algorithms have been developed for building level-1 networks from small networks. However, level-1 networks may not be able to capture the complexity of some data sets. In this paper, we present a polynomial-time algorithm for constructing a rooted binary level-2 phylogenetic network from a collection of 3-leaf networks or trinets. Moreover, we prove that the algorithm will correctly reconstruct such a network if it is given all of the trinets in the network as input. The algorithm runs in time $O(t\\cdot n+n^4)$ with $t$ the number of input trinets and $n$ the number of leaves. We also show that there is a fundamental obstruction to constructing level-3 networks from trinets, and so new approaches will need to be developed for constructing level-3 and higher level-networks. ",
    "url": "https://arxiv.org/abs/2109.11244",
    "authors": [
      "Leo van Iersel",
      "Sjors Kole",
      "Vincent Moulton",
      "Leonie Nipius"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Populations and Evolution (q-bio.PE)"
    ]
  },
  {
    "id": "arXiv:2109.11386",
    "title": "Energy efficient distributed analytics at the edge of the network for  IoT environments",
    "abstract": "Due to the pervasive diffusion of personal mobile and IoT devices, many \"smart environments\" (e.g., smart cities and smart factories) will be, generators of huge amounts of data. Currently, analysis of this data is typically achieved through centralised cloud-based services. However, according to many studies, this approach may present significant issues from the standpoint of data ownership, as well as wireless network capacity. In this paper, we exploit the fog computing paradigm to move computation close to where data is produced. We exploit a well-known distributed machine learning framework (Hypothesis Transfer Learning), and perform data analytics on mobile nodes passing by IoT devices, in addition to fog gateways at the edge of the network infrastructure. We analyse the performance of different configurations of the distributed learning framework, in terms of (i) accuracy obtained in the learning task and (ii) energy spent to send data between the involved nodes. Specifically, we consider reference wireless technologies for communication between the different types of nodes we consider, e.g. LTE, Nb-IoT, 802.15.4, 802.11, etc. Our results show that collecting data through the mobile nodes and executing the distributed analytics using short-range communication technologies, such as 802.15.4 and 802.11, allows to strongly reduce the energy consumption of the system up to $94\\%$ with a loss in accuracy w.r.t. a centralised cloud solution up to $2\\%$. ",
    "url": "https://arxiv.org/abs/2109.11386",
    "authors": [
      "Lorenzo Valerio",
      "Marco Conti",
      "Andrea Passarella"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2109.11523",
    "title": "How much \"human-like\" visual experience do current self-supervised  learning algorithms need to achieve human-level object recognition?",
    "abstract": "This paper addresses a fundamental question: how good are our current self-supervised visual representation learning algorithms relative to humans? More concretely, how much \"human-like\", natural visual experience would these algorithms need in order to reach human-level performance in a complex, realistic visual object recognition task such as ImageNet? Using a scaling experiment, here we estimate that the answer is on the order of a million years of natural visual experience, in other words several orders of magnitude longer than a human lifetime. However, this estimate is quite sensitive to some underlying assumptions, underscoring the need to run carefully controlled human experiments. We discuss the main caveats surrounding our estimate and the implications of this rather surprising result. ",
    "url": "https://arxiv.org/abs/2109.11523",
    "authors": [
      "A. Emin Orhan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2109.10990",
    "title": "A new threshold model based on tropical mathematics reveals network  backbones",
    "abstract": "Maxmin-$\\omega$ is a new threshold model, where each node in a network waits for the arrival of states from a fraction $\\omega$ of neighborhood nodes before processing its own state, and subsequently transmitting it to downstream nodes. Repeating this sequence of events leads to periodic behavior. We show that maxmin-$\\omega$ reduces to a smaller, simpler, system represented by tropical mathematics, which forges a useful link between the nodal state update times and circuits in the network. Thus, the behavior of the system can be analyzed directly from the smaller network structure and is computationally faster. We further show that these reduced networks: (i) are not unique; they are dependent on the initialisation time, (ii) tend towards periodic orbits of networks -- \"attractor networks.\" In light of these features, we vary the initial condition and $\\omega$ to obtain statistics on types of attractor networks. The results suggest the case $\\omega =0.5$ to give the most stable system. We propose that the most prominent attractor networks of nodes and edges may be seen as a 'backbone' of the original network. We subsequently provide an algorithm to construct attractor networks, the main result being that they must necessarily contain circuits that are deemed critical and that can be identified without running the maxmin-$\\omega$ system. Finally, we apply this work to the C. elegans neuron network, giving insight into its function and similar networks. This novel area of application for tropical mathematics adds to its theory, and provides a new way to identify important edges and circuits of a network. ",
    "url": "https://arxiv.org/abs/2109.10990",
    "authors": [
      "Ebrahim L. Patel"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2109.11128",
    "title": "Peg solitaire and Conway's soldiers on infinite graphs",
    "abstract": "Peg solitaire is traditionally a one-player game played on a grid board filled with pegs. The goal of the game is to have a single peg remaining on the board by sequentially jumping a peg over an adjacent peg onto an empty square while eliminating the jumped peg. Conway's soldiers is a related game played on $\\mathbb{Z}^2$ with pegs initially located on the half-space $y \\le 0$. The goal is to bring a peg as far as possible on the board using peg solitaire jumps. Conway showed that bringing a peg to the line $y = 5$ is impossible with finitely many jumps. Applying Conway's approach, we prove an analogous impossibility property on graphs. In addition, we generalize peg solitaire on finite graphs as introduced by Beeler and Hoilman (2011) to an infinite game played on countably infinite graphs. ",
    "url": "https://arxiv.org/abs/2109.11128",
    "authors": [
      "Valentino Vito"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2109.11438",
    "title": "A special case of Vu's conjecture: Coloring nearly disjoint graphs of  bounded maximum degree",
    "abstract": "A collection of graphs is \\textit{nearly disjoint} if every pair of them intersects in at most one vertex. We prove that if $G_1, \\dots, G_m$ are nearly disjoint graphs of maximum degree at most $D$, then the following holds. For every fixed $C$, if each vertex $v \\in \\bigcup_{i=1}^m V(G_i)$ is contained in at most $C$ of the graphs $G_1, \\dots, G_m$, then the (list) chromatic number of $\\bigcup_{i=1}^m G_i$ is at most $D + o(D)$. This result confirms a special case of a conjecture of Vu and generalizes Kahn's bound on the list chromatic index of linear uniform hypergraphs of bounded maximum degree. In fact, this result holds for the correspondence (or DP) chromatic number and thus implies a recent result of Molloy, and we derive this result from a more general list coloring result in the setting of `color degrees' that also implies a result of Reed and Sudakov. ",
    "url": "https://arxiv.org/abs/2109.11438",
    "authors": [
      "Tom Kelly",
      "Daniela Kühn",
      "Deryk Osthus"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2109.11498",
    "title": "Partitioning an interval graph into subgraphs with small claws",
    "abstract": "The claw number of a graph $G$ is the largest number $v$ such that $K_{1,v}$ is an induced subgraph of $G$. Interval graphs with claw number at most $v$ are cluster graphs when $v = 1$, and are proper interval graphs when $v = 2$. Let $\\kappa(n,v)$ be the smallest number $k$ such that every interval graph with $n$ vertices admits a vertex partition into $k$ induced subgraphs with claw number at most $v$. Let $\\check\\kappa(w,v)$ be the smallest number $k$ such that every interval graph with claw number $w$ admits a vertex partition into $k$ induced subgraphs with claw number at most $v$. We show that $\\kappa(n,v) = \\lfloor\\log_{v+1} (n v + 1)\\rfloor$, and that $\\lfloor\\log_{v+1} w\\rfloor + 1 \\le \\check\\kappa(w,v) \\le \\lfloor\\log_{v+1} w\\rfloor + 3$. Besides the combinatorial bounds, we also present a simple approximation algorithm for partitioning an interval graph into the minimum number of induced subgraphs with claw number at most $v$, with approximation ratio $3$ when $1 \\le v \\le 2$, and $2$ when $v \\ge 3$. ",
    "url": "https://arxiv.org/abs/2109.11498",
    "authors": [
      "Rain Jiang",
      "Kai Jiang",
      "Minghui Jiang"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2109.11532",
    "title": "Many nodal domains in random regular graphs",
    "abstract": "Let $G$ be a random $d$-regular graph. We prove that for every constant $\\alpha > 0$, with high probability every eigenvector of the adjacency matrix of $G$ with eigenvalue less than $-2\\sqrt{d-2}-\\alpha$ has $\\Omega(n/$polylog$(n))$ nodal domains. ",
    "url": "https://arxiv.org/abs/2109.11532",
    "authors": [
      "Shirshendu Ganguly",
      "Theo McKenzie",
      "Sidhanth Mohanty",
      "Nikhil Srivastava"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Discrete Mathematics (cs.DM)",
      "Mathematical Physics (math-ph)",
      "Combinatorics (math.CO)",
      "Spectral Theory (math.SP)"
    ]
  },
  {
    "id": "arXiv:1905.13695",
    "title": "RKHSMetaMod: An R package to estimate the Hoeffding decomposition of a  complex model by solving RKHS ridge group sparse optimization problem",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:1701.04671 ",
    "url": "https://arxiv.org/abs/1905.13695",
    "authors": [
      "Halaleh Kamari",
      "Sylvie Huet",
      "Marie-Luce Taupin"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:1907.01257",
    "title": "A robust graph-based approach to observational equivalence",
    "abstract": " Comments: 81 pages, 70 figures ",
    "url": "https://arxiv.org/abs/1907.01257",
    "authors": [
      "Dan R. Ghica",
      "Koko Muroya",
      "Todd Waugh Ambridge"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2010.03002",
    "title": "OneFlow: One-class flow for anomaly detection based on a minimal volume  region",
    "abstract": " Title: OneFlow: One-class flow for anomaly detection based on a minimal volume  region ",
    "url": "https://arxiv.org/abs/2010.03002",
    "authors": [
      "Łukasz Maziarka",
      "Marek Śmieja",
      "Marcin Sendera",
      "Łukasz Struski",
      "Jacek Tabor",
      "Przemysław Spurek"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2101.05047",
    "title": "PID passivity-based droop control of power converters: Large-signal  stability, robustness and performance",
    "abstract": " Comments: 26 pages, 11 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2101.05047",
    "authors": [
      "Daniele Zonetti",
      "Gilbert Bergna-Diaz",
      "Romeo Ortega",
      "Nima Monshizadeh"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2103.11851",
    "title": "Data-driven output synchronization of heterogeneous leader-follower  multi-agent systems",
    "abstract": " Comments: 6 pages, 2 figures. This paper has been accepted by IEEE CDC 2021 ",
    "url": "https://arxiv.org/abs/2103.11851",
    "authors": [
      "Junjie Jiao",
      "Henk J. van Waarde",
      "Harry L. Trentelman",
      "M. Kanat Camlibel",
      "Sandra Hirche"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2106.12322",
    "title": "Distributed coloring and the local structure of unit-disk graphs",
    "abstract": " Comments: 24 pages, v2: revised according to the referee reports of the conference version. A preliminary version of this work appeared in the proceedings of the 17th International Symposium on Algorithms and Experiments for Wireless Sensor Networks (ALGOSENSORS 2021) ",
    "url": "https://arxiv.org/abs/2106.12322",
    "authors": [
      "Louis Esperet",
      "Sébastien Julliot",
      "Arnaud de Mesmay"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computational Geometry (cs.CG)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2109.10474",
    "title": "Rapid detection and recognition of whole brain activity in a freely  behaving Caenorhabditis elegans",
    "abstract": " Title: Rapid detection and recognition of whole brain activity in a freely  behaving Caenorhabditis elegans ",
    "url": "https://arxiv.org/abs/2109.10474",
    "authors": [
      "Yuxiang Wu",
      "Shang Wu",
      "Xin Wang",
      "Chengtian Lang",
      "Quanshi Zhang",
      "Quan Wen",
      "Tianqi Xu"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]