[
  {
    "id": "arXiv:2203.16536",
    "title": "Recent improvements of ASR models in the face of adversarial attacks",
    "abstract": "Like many other tasks involving neural networks, Speech Recognition models are vulnerable to adversarial attacks. However recent research has pointed out differences between attacks and defenses on ASR models compared to image models. Improving the robustness of ASR models requires a paradigm shift from evaluating attacks on one or a few models to a systemic approach in evaluation. We lay the ground for such research by evaluating on various architectures a representative set of adversarial attacks: targeted and untargeted, optimization and speech processing-based, white-box, black-box and targeted attacks. Our results show that the relative strengths of different attack algorithms vary considerably when changing the model architecture, and that the results of some attacks are not to be blindly trusted. They also indicate that training choices such as self-supervised pretraining can significantly impact robustness by enabling transferable perturbations. We release our source code as a package that should help future research in evaluating their attacks and defenses. ",
    "url": "https://arxiv.org/abs/2203.16536",
    "authors": [
      "Raphael Olivier",
      "Bhiksha Raj"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16538",
    "title": "Machine Learning Approaches for Non-Intrusive Home Absence Detection  Based on Appliance Electrical Use",
    "abstract": "Home absence detection is an emerging field on smart home installations. Identifying whether or not the residents of the house are present, is important in numerous scenarios. Possible scenarios include but are not limited to: elderly people living alone, people suffering from dementia, home quarantine. The majority of published papers focus on either pressure / door sensors or cameras in order to detect outing events. Although the aforementioned approaches provide solid results, they are intrusive and require modifications for sensor placement. In our work, appliance electrical use is investigated as a means for detecting the presence or absence of residents. The energy use is the result of power disaggregation, a non intrusive / non invasive sensing method. Since a dataset providing energy data and ground truth for home absence is not available, artificial outing events were introduced on the UK-DALE dataset, a well known dataset for Non Intrusive Load Monitoring (NILM). Several machine learning algorithms were evaluated using the generated dataset. Benchmark results have shown that home absence detection using appliance power consumption is feasible. ",
    "url": "https://arxiv.org/abs/2203.16538",
    "authors": [
      "Athanasios Lentzas",
      "Dimitris Vrakas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.16574",
    "title": "Graph Refinement for Coreference Resolution",
    "abstract": "The state-of-the-art models for coreference resolution are based on independent mention pair-wise decisions. We propose a modelling approach that learns coreference at the document-level and takes global decisions. For this purpose, we model coreference links in a graph structure where the nodes are tokens in the text, and the edges represent the relationship between them. Our model predicts the graph in a non-autoregressive manner, then iteratively refines it based on previous predictions, allowing global dependencies between decisions. The experimental results show improvements over various baselines, reinforcing the hypothesis that document-level information improves conference resolution. ",
    "url": "https://arxiv.org/abs/2203.16574",
    "authors": [
      "Lesly Miculicich",
      "James Henderson"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16577",
    "title": "Calibrating constitutive models with full-field data via physics  informed neural networks",
    "abstract": "The calibration of solid constitutive models with full-field experimental data is a long-standing challenge, especially in materials which undergo large deformation. In this paper, we propose a physics-informed deep-learning framework for the discovery of constitutive model parameterizations given full-field displacement data and global force-displacement data. Contrary to the majority of recent literature in this field, we work with the weak form of the governing equations rather than the strong form to impose physical constraints upon the neural network predictions. The approach presented in this paper is computationally efficient, suitable for irregular geometric domains, and readily ingests displacement data without the need for interpolation onto a computational grid. A selection of canonical hyperelastic materials models suitable for different material classes is considered including the Neo-Hookean, Gent, and Blatz-Ko constitutive models as exemplars for general hyperelastic behavior, polymer behavior with lock-up, and compressible foam behavior respectively. We demonstrate that physics informed machine learning is an enabling technology and may shift the paradigm of how full-field experimental data is utilized to calibrate constitutive models under finite deformations. ",
    "url": "https://arxiv.org/abs/2203.16577",
    "authors": [
      "Craig M. Hamel",
      "Kevin N. Long",
      "Sharlotte L.B. Kramer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16578",
    "title": "Code Switched and Code Mixed Speech Recognition for Indic languages",
    "abstract": "Training multilingual automatic speech recognition (ASR) systems is challenging because acoustic and lexical information is typically language specific. Training multilingual system for Indic languages is even more tougher due to lack of open source datasets and results on different approaches. We compare the performance of end to end multilingual speech recognition system to the performance of monolingual models conditioned on language identification (LID). The decoding information from a multilingual model is used for language identification and then combined with monolingual models to get an improvement of 50% WER across languages. We also propose a similar technique to solve the Code Switched problem and achieve a WER of 21.77 and 28.27 over Hindi-English and Bengali-English respectively. Our work talks on how transformer based ASR especially wav2vec 2.0 can be applied in developing multilingual ASR and code switched ASR for Indic languages. ",
    "url": "https://arxiv.org/abs/2203.16578",
    "authors": [
      "Harveen Singh Chadha",
      "Priyanshi Shah",
      "Ankur Dhuriya",
      "Neeraj Chhimwal",
      "Anirudh Gupta",
      "Vivek Raghavan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16616",
    "title": "Knowledge-based Entity Prediction for Improved Machine Perception in  Autonomous Systems",
    "abstract": "Knowledge-based entity prediction (KEP) is a novel task that aims to improve machine perception in autonomous systems. KEP leverages relational knowledge from heterogeneous sources in predicting potentially unrecognized entities. In this paper, we provide a formal definition of KEP as a knowledge completion task. Three potential solutions are then introduced, which employ several machine learning and data mining techniques. Finally, the applicability of KEP is demonstrated on two autonomous systems from different domains; namely, autonomous driving and smart manufacturing. We argue that in complex real-world systems, the use of KEP would significantly improve machine perception while pushing the current technology one step closer to achieving the full autonomy. ",
    "url": "https://arxiv.org/abs/2203.16616",
    "authors": [
      "Ruwan Wickramarachchi",
      "Cory Henson",
      "Amit Sheth"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16620",
    "title": "Quantifying the presence/absence of meso-scale structures in networks",
    "abstract": "Meso-scale structures are network features where nodes with similar properties are grouped together instead of being treated individually. In this work, we provide formal and mathematical definitions of three such structures: assortative communities, disassortative communities and core-periphery. We then leverage these definitions and a Bayesian framework to quantify the presence/absence of each structure in a network. This allows for probabilistic statements about the network structure as well as uncertainty estimates of the group labels and edge probabilities. The method is applied to real-world networks, yielding provocative results about well-known network data sets. ",
    "url": "https://arxiv.org/abs/2203.16620",
    "authors": [
      "Eric Yanchenko"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2203.16626",
    "title": "DDNeRF: Depth Distribution Neural Radiance Fields",
    "abstract": "In recent years, the field of implicit neural representation has progressed significantly. Models such as neural radiance fields (NeRF), which uses relatively small neural networks, can represent high-quality scenes and achieve state-of-the-art results for novel view synthesis. Training these types of networks, however, is still computationally very expensive. We present depth distribution neural radiance field (DDNeRF), a new method that significantly increases sampling efficiency along rays during training while achieving superior results for a given sampling budget. DDNeRF achieves this by learning a more accurate representation of the density distribution along rays. More specifically, we train a coarse model to predict the internal distribution of the transparency of an input volume in addition to the volume's total density. This finer distribution then guides the sampling procedure of the fine model. This method allows us to use fewer samples during training while reducing computational resources. ",
    "url": "https://arxiv.org/abs/2203.16626",
    "authors": [
      "David Dadon",
      "Ohad Fried",
      "Yacov Hel-Or"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2203.16632",
    "title": "Controllable Augmentations for Video Representation Learning",
    "abstract": "This paper focuses on self-supervised video representation learning. Most existing approaches follow the contrastive learning pipeline to construct positive and negative pairs by sampling different clips. However, this formulation tends to bias to static background and have difficulty establishing global temporal structures. The major reason is that the positive pairs, i.e., different clips sampled from the same video, have limited temporal receptive field, and usually share similar background but differ in motions. To address these problems, we propose a framework to jointly utilize local clips and global videos to learn from detailed region-level correspondence as well as general long-term temporal relations. Based on a set of controllable augmentations, we achieve accurate appearance and motion pattern alignment through soft spatio-temporal region contrast. Our formulation is able to avoid the low-level redundancy shortcut by mutual information minimization to improve the generalization. We also introduce local-global temporal order dependency to further bridge the gap between clip-level and video-level representations for robust temporal modeling. Extensive experiments demonstrate that our framework is superior on three video benchmarks in action recognition and video retrieval, capturing more accurate temporal dynamics. ",
    "url": "https://arxiv.org/abs/2203.16632",
    "authors": [
      "Rui Qian",
      "Weiyao Lin",
      "John See",
      "Dian Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16637",
    "title": "Hybrid Handcrafted and Learnable Audio Representation for Analysis of  Speech Under Cognitive and Physical Load",
    "abstract": "As a neurophysiological response to threat or adverse conditions, stress can affect cognition, emotion and behaviour with potentially detrimental effects on health in the case of sustained exposure. Since the affective content of speech is inherently modulated by an individual's physical and mental state, a substantial body of research has been devoted to the study of paralinguistic correlates of stress-inducing task load. Historically, voice stress analysis (VSA) has been conducted using conventional digital signal processing (DSP) techniques. Despite the development of modern methods based on deep neural networks (DNNs), accurately detecting stress in speech remains difficult due to the wide variety of stressors and considerable variability in the individual stress perception. To that end, we introduce a set of five datasets for task load detection in speech. The voice recordings were collected as either cognitive or physical stress was induced in the cohort of volunteers, with a cumulative number of more than a hundred speakers. We used the datasets to design and evaluate a novel self-supervised audio representation that leverages the effectiveness of handcrafted features (DSP-based) and the complexity of data-driven DNN representations. Notably, the proposed approach outperformed both extensive handcrafted feature sets and novel DNN-based audio representation learning approaches. ",
    "url": "https://arxiv.org/abs/2203.16637",
    "authors": [
      "Gasser Elbanna",
      "Alice Biryukov",
      "Neil Scheidwasser-Clow",
      "Lara Orlandic",
      "Pablo Mainar",
      "Mikolaj Kegler",
      "Pierre Beckmann",
      "Milos Cernak"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16646",
    "title": "Generation of Speaker Representations Using Heterogeneous Training Batch  Assembly",
    "abstract": "In traditional speaker diarization systems, a well-trained speaker model is a key component to extract representations from consecutive and partially overlapping segments in a long speech session. To be more consistent with the back-end segmentation and clustering, we propose a new CNN-based speaker modeling scheme, which takes into account the heterogeneity of the speakers in each training segment and batch. We randomly and synthetically augment the training data into a set of segments, each of which contains more than one speaker and some overlapping parts. A soft label is imposed on each segment based on its speaker occupation ratio, and the standard cross entropy loss is implemented in model training. In this way, the speaker model should have the ability to generate a geometrically meaningful embedding for each multi-speaker segment. Experimental results show that our system is superior to the baseline system using x-vectors in two speaker diarization tasks. In the CALLHOME task trained on the NIST SRE and Switchboard datasets, our system achieves a relative reduction of 12.93% in DER. In Track 2 of CHiME-6, our system provides 13.24%, 12.60%, and 5.65% relative reductions in DER, JER, and WER, respectively. ",
    "url": "https://arxiv.org/abs/2203.16646",
    "authors": [
      "Yu-Huai Peng",
      "Hung-Shin Lee",
      "Pin-Tuan Huang",
      "Hsin-Min Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16650",
    "title": "Robust Beamforming for Localization-Aided Millimeter Wave Communication  Systems",
    "abstract": "In this letter, we investigate a robust beamforming problem for localization-aided millimeter wave (mmWave) communication systems. To handle this problem, we propose a novel restriction and relaxation (R&R) method. The proposed R&R method aims at minimizing the total transmit power while the positioning error follows a Gaussian distribution. Specifically, in the restriction phase of R&R, the probabilistic constraint is transformed into the deterministic form by using the Bernsteintype inequality. In the relaxation phase of R&R, the non-convex optimization problem is reformulated into a convex semidefinite program (SDP) by using semidefinite relaxation (SDR) and firstorder Taylor expansion methods. To the best of our knowledge, we first consider the impact of the distribution of the positioning error on the channel state information (CSI), which further influences the data rate. Numerical results present the trade-off of the beamforming between the communication and positioning. ",
    "url": "https://arxiv.org/abs/2203.16650",
    "authors": [
      "Junchang Sun",
      "Shuai Ma",
      "Shiyin Li",
      "Ruixin Yang",
      "Minghui Min",
      "Gonzalo Seco-Granados"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.16657",
    "title": "Community Integration Algorithms (CIAs) for Dynamical Systems on  Networks",
    "abstract": "Dynamics of large-scale network processes underlies crucial phenomena ranging across all sciences. Forward simulation of large network models is often computationally prohibitive. Yet, most networks have intrinsic community structure. We exploit these communities and propose a fast simulation algorithm for network dynamics. In particular, aggregating the inputs a node receives constitutes the limiting factor in numerically simulating large-scale network dynamics. We develop community integration algorithms (CIAs) significantly reducing function-evaluations. We obtain a substantial reduction from polynomial to linear computational complexity. We illustrate our results in multiple applications including classical and higher-order Kuramoto-type systems for synchronisation and Cucker--Smale systems exhibiting flocking behaviour on synthetic as well as real-world networks. Numerical comparison and theoretical analysis confirm the robustness and efficiency of CIAs. ",
    "url": "https://arxiv.org/abs/2203.16657",
    "authors": [
      "Tobias Böhle",
      "Mechthild Thalhammer",
      "Christian Kuehn"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2203.16660",
    "title": "On The Role of Social Identity in the Market for (Mis)information",
    "abstract": "Motivated by recent works in the communication and psychology literature, we model and study the role social identity -- a person's sense of belonging to a group -- plays in human information consumption. A hallmark of Social Identity Theory (SIT) is the notion of 'status', i.e., an individual's desire to enhance their and their 'in-group's' utility relative to that of an 'out-group'. In the context of belief formation, this comes off as a desire to believe positive news about the in-group and negative news about the out-group, which has been empirically shown to support belief in misinformation and false news. We model this phenomenon as a Stackelberg game being played over an information channel between a news-source (sender) and news-consumer (receiver), with the receiver incorporating the 'status' associated with social identity in their utility, in addition to accuracy. We characterize the strategy that must be employed by the sender to ensure that its message is trusted by receivers of all identities while maximizing their overall quality of information. We show that, as a rule, this optimal quality of information at equilibrium decreases when a receiver's sense of identity increases. We further demonstrate how extensions of our model can be used to quantitatively estimate the level of importance given to identity in a population. ",
    "url": "https://arxiv.org/abs/2203.16660",
    "authors": [
      "Vijeth Hebbar",
      "Cedric Langbort"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.16663",
    "title": "Robust Reputation Independence in Ranking Systems for Multiple Sensitive  Attributes",
    "abstract": "Ranking systems have an unprecedented influence on how and what information people access, and their impact on our society is being analyzed from different perspectives, such as users' discrimination. A notable example is represented by reputation-based ranking systems, a class of systems that rely on users' reputation to generate a non-personalized item-ranking, proved to be biased against certain demographic classes. To safeguard that a given sensitive user's attribute does not systematically affect the reputation of that user, prior work has operationalized a reputation independence constraint on this class of systems. In this paper, we uncover that guaranteeing reputation independence for a single sensitive attribute is not enough. When mitigating biases based on one sensitive attribute (e.g., gender), the final ranking might still be biased against certain demographic groups formed based on another attribute (e.g., age). Hence, we propose a novel approach to introduce reputation independence for multiple sensitive attributes simultaneously. We then analyze the extent to which our approach impacts on discrimination and other important properties of the ranking system, such as its quality and robustness against attacks. Experiments on two real-world datasets show that our approach leads to less biased rankings with respect to multiple users' sensitive attributes, without affecting the system's quality and robustness. ",
    "url": "https://arxiv.org/abs/2203.16663",
    "authors": [
      "Guilherme Ramos",
      "Ludovico Boratto",
      "Mirko Marras"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2203.16668",
    "title": "Flexible and Efficient Contextual Bandits with Heterogeneous Treatment  Effect Oracle",
    "abstract": "Many popular contextual bandit algorithms estimate reward models to inform decision making. However, true rewards can contain action-independent redundancies that are not relevant for decision making and only increase the statistical complexity of accurate estimation. It is sufficient and more data-efficient to estimate the simplest function that explains the reward differences between actions, that is, the heterogeneous treatment effect, commonly understood to be more structured and simpler than the reward. Motivated by this observation, building on recent work on oracle-based algorithms, we design a statistically optimal and computationally efficient algorithm using heterogeneous treatment effect estimation oracles. Our results provide the first universal reduction of contextual bandits to a general-purpose heterogeneous treatment effect estimation method. We show that our approach is more robust to model misspecification than reward estimation methods based on squared error regression oracles. Experimentally, we show the benefits of heterogeneous treatment effect estimation in contextual bandits over reward estimation. ",
    "url": "https://arxiv.org/abs/2203.16668",
    "authors": [
      "Aldo Gael Carranza",
      "Sanath Kumar Krishnamurthy",
      "Susan Athey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.16669",
    "title": "Escaping Data Scarcity for High-Resolution Heterogeneous Face  Hallucination",
    "abstract": "In Heterogeneous Face Recognition (HFR), the objective is to match faces across two different domains such as visible and thermal. Large domain discrepancy makes HFR a difficult problem. Recent methods attempting to fill the gap via synthesis have achieved promising results, but their performance is still limited by the scarcity of paired training data. In practice, large-scale heterogeneous face data are often inaccessible due to the high cost of acquisition and annotation process as well as privacy regulations. In this paper, we propose a new face hallucination paradigm for HFR, which not only enables data-efficient synthesis but also allows to scale up model training without breaking any privacy policy. Unlike existing methods that learn face synthesis entirely from scratch, our approach is particularly designed to take advantage of rich and diverse facial priors from visible domain for more faithful hallucination. On the other hand, large-scale training is enabled by introducing a new federated learning scheme to allow institution-wise collaborations while avoiding explicit data sharing. Extensive experiments demonstrate the advantages of our approach in tackling HFR under current data limitations. In a unified framework, our method yields the state-of-the-art hallucination results on multiple HFR datasets. ",
    "url": "https://arxiv.org/abs/2203.16669",
    "authors": [
      "Yiqun Mei",
      "Pengfei Guo",
      "Vishal M. Patel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16670",
    "title": "PIE-Net: Photometric Invariant Edge Guided Network for Intrinsic Image  Decomposition",
    "abstract": "Intrinsic image decomposition is the process of recovering the image formation components (reflectance and shading) from an image. Previous methods employ either explicit priors to constrain the problem or implicit constraints as formulated by their losses (deep learning). These methods can be negatively influenced by strong illumination conditions causing shading-reflectance leakages. Therefore, in this paper, an end-to-end edge-driven hybrid CNN approach is proposed for intrinsic image decomposition. Edges correspond to illumination invariant gradients. To handle hard negative illumination transitions, a hierarchical approach is taken including global and local refinement layers. We make use of attention layers to further strengthen the learning process. An extensive ablation study and large scale experiments are conducted showing that it is beneficial for edge-driven hybrid IID networks to make use of illumination invariant descriptors and that separating global and local cues helps in improving the performance of the network. Finally, it is shown that the proposed method obtains state of the art performance and is able to generalise well to real world images. The project page with pretrained models, finetuned models and network code can be found at https://ivi.fnwi.uva.nl/cv/pienet/. ",
    "url": "https://arxiv.org/abs/2203.16670",
    "authors": [
      "Partha Das",
      "Sezer Karaoglu",
      "Theo Gevers"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16699",
    "title": "Excitation and Measurement Patterns for the Identifiability of Directed  Acyclic Graphs",
    "abstract": "This paper deals with the design of Excitation and Measurement Patterns (EMP) for the identification of a class of dynamical networks whose topology has the structure of a Directed Acyclic Graph (DAG). In addition to the by now well known condition that the identifiabiltiy of any dynamical network requires that the sources be excited, the sinks be measured, and all other nodes be either excited or measured, we show that for DAGs two other types of nodes have special excitation and measurement requirements. Armed with this result, we propose a systematic procedure for the design of EMPs that guarantee identifiability of a network with DAG topology. ",
    "url": "https://arxiv.org/abs/2203.16699",
    "authors": [
      "Eduardo Mapurunga",
      "Michel Gevers",
      "Alexandre S. Bazanella"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2203.16701",
    "title": "Towards Differential Relational Privacy and its use in Question  Answering",
    "abstract": "Memorization of the relation between entities in a dataset can lead to privacy issues when using a trained model for question answering. We introduce Relational Memorization (RM) to understand, quantify and control this phenomenon. While bounding general memorization can have detrimental effects on the performance of a trained model, bounding RM does not prevent effective learning. The difference is most pronounced when the data distribution is long-tailed, with many queries having only few training examples: Impeding general memorization prevents effective learning, while impeding only relational memorization still allows learning general properties of the underlying concepts. We formalize the notion of Relational Privacy (RP) and, inspired by Differential Privacy (DP), we provide a possible definition of Differential Relational Privacy (DrP). These notions can be used to describe and compute bounds on the amount of RM in a trained model. We illustrate Relational Privacy concepts in experiments with large-scale models for Question Answering. ",
    "url": "https://arxiv.org/abs/2203.16701",
    "authors": [
      "Simone Bombari",
      "Alessandro Achille",
      "Zijian Wang",
      "Yu-Xiang Wang",
      "Yusheng Xie",
      "Kunwar Yashraj Singh",
      "Srikar Appalaraju",
      "Vijay Mahadevan",
      "Stefano Soatto"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.16715",
    "title": "Cyberattack Detection for Nonlinear Leader-Following Multi-Agent Systems  Using Set-Membership Fuzzy Filtering",
    "abstract": "This paper is concerned with cyberattack detection in discrete-time, leader-following, nonlinear, multi-agent systems subject to unknown but bounded (UBB) system noises. The Takagi-Sugeno (T-S) fuzzy model is employed to approximate the nonlinear systems over the true value of the state. A distributed cyberattack detection method, based on a new fuzzy set-membership filtering method, which consists of two steps, namely a prediction step and a measurement update step, is developed for each agent to identify two types of cyberattacks at the time of their occurrence. The attacks are replay attacks and false data injection attacks affecting the leader-following consensus. We calculate an estimation ellipsoid set by updating the prediction ellipsoid set with the current sensor measurement data. Two criteria are provided to detect cyberattacks based on the intersection between the ellipsoid sets. If there is no intersection between the prediction set and the estimation set of an agent at the current time instant, a cyberattack on its sensors is declared. Control signal or communication signal data of an agent are under a cyberattack if its prediction set has no intersection with the estimation set updated at the previous time instant. Recursive algorithms for solving the consensus protocol and calculating the two ellipsoid sets for detecting attacks are proposed. Simulation results are provided to demonstrate the effectiveness of the proposed method. ",
    "url": "https://arxiv.org/abs/2203.16715",
    "authors": [
      "Mahshid Rahimifard",
      "Amir M. Moradi Sizkouhi",
      "Rastko R. Selmic"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.16718",
    "title": "A Large-Scale Comparison of Python Code in Jupyter Notebooks and Scripts",
    "abstract": "In recent years, Jupyter notebooks have grown in popularity in several domains of software engineering, such as data science, machine learning, and computer science education. Their popularity has to do with their rich features for presenting and visualizing data, however, recent studies show that notebooks also share a lot of drawbacks: high number of code clones, low reproducibility, etc. In this work, we carry out a comparison between Python code written in Jupyter Notebooks and in traditional Python scripts. We compare the code from two perspectives: structural and stylistic. In the first part of the analysis, we report the difference in the number of lines, the usage of functions, as well as various complexity metrics. In the second part, we show the difference in the number of stylistic issues and provide an extensive overview of the 15 most frequent stylistic issues in the studied mediums. Overall, we demonstrate that notebooks are characterized by the lower code complexity, however, their code could be perceived as more entangled than in the scripts. As for the style, notebooks tend to have 1.4 times more stylistic issues, but at the same time, some of them are caused by specific coding practices in notebooks and should be considered as false positives. With this research, we want to pave the way to studying specific problems of notebooks that should be addressed by the development of notebook-specific tools, and provide various insights that can be useful in this regard. ",
    "url": "https://arxiv.org/abs/2203.16718",
    "authors": [
      "Konstantin Grotov",
      "Sergey Titov",
      "Vladimir Sotnikov",
      "Yaroslav Golubev",
      "Timofey Bryksin"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2203.16732",
    "title": "Deep Reinforcement Learning with Graph ConvNets for Distribution Network  Voltage Control",
    "abstract": "This paper proposes a model-free Volt-VAR control (VVC) algorithm via the spatio-temporal graph ConvNet-based deep reinforcement learning (STGCN-DRL) framework, whose goal is to control smart inverters in an unbalanced distribution system. We first identify the graph shift operator (GSO) based on the power flow equations. Then, we develop a spatio-temporal graph ConvNet (STGCN), testing both recurrent graph ConvNets (RGCN) and convolutional graph ConvNets (CGCN) architectures, aimed at capturing the spatiotemporal correlation of voltage phasors. The STGCN layer performs the feature extraction task for the policy function and the value function of the reinforcement learning architecture, and then we utilize the proximal policy optimization (PPO) to search the action spaces for an optimum policy function and to approximate an optimum value function. We further utilize the low-pass property of voltage graph signal to introduce an GCN architecture for the the policy whose input is a decimated state vector, i.e. a partial observation. Case studies on the unbalanced 123-bus systems validate the excellent performance of the proposed method in mitigating instabilities and maintaining nodal voltage profiles within a desirable range. ",
    "url": "https://arxiv.org/abs/2203.16732",
    "authors": [
      "Tong Wu",
      "Ignacio Losada Carreno",
      "Anna Scaglione",
      "Daniel Arnold"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.16751",
    "title": "An unsupervised cluster-level based method for learning node  representations of heterogeneous graphs in scientific papers",
    "abstract": "Learning knowledge representation of scientific paper data is a problem to be solved, and how to learn the representation of paper nodes in scientific paper heterogeneous network is the core to solve this problem. This paper proposes an unsupervised cluster-level scientific paper heterogeneous graph node representation learning method (UCHL), aiming at obtaining the representation of nodes (authors, institutions, papers, etc.) in the heterogeneous graph of scientific papers. Based on the heterogeneous graph representation, this paper performs link prediction on the entire heterogeneous graph and obtains the relationship between the edges of the nodes, that is, the relationship between papers and papers. Experiments results show that the proposed method achieves excellent performance on multiple evaluation metrics on real scientific paper datasets. ",
    "url": "https://arxiv.org/abs/2203.16751",
    "authors": [
      "Jie Song",
      "Meiyu Liang",
      "Zhe Xue",
      "Junping Du",
      "Kou Feifei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.16775",
    "title": "Bangla hate speech detection on social media using attention-based  recurrent neural network",
    "abstract": "Hate speech has spread more rapidly through the daily use of technology and, most notably, by sharing your opinions or feelings on social media in a negative aspect. Although numerous works have been carried out in detecting hate speeches in English, German, and other languages, very few works have been carried out in the context of the Bengali language. In contrast, millions of people communicate on social media in Bengali. The few existing works that have been carried out need improvements in both accuracy and interpretability. This article proposed encoder decoder based machine learning model, a popular tool in NLP, to classify user's Bengali comments on Facebook pages. A dataset of 7,425 Bengali comments, consisting of seven distinct categories of hate speeches, was used to train and evaluate our model. For extracting and encoding local features from the comments, 1D convolutional layers were used. Finally, the attention mechanism, LSTM, and GRU based decoders have been used for predicting hate speech categories. Among the three encoder decoder algorithms, the attention-based decoder obtained the best accuracy (77%). ",
    "url": "https://arxiv.org/abs/2203.16775",
    "authors": [
      "Amit Kumar Das",
      "Abdullah Al Asif",
      "Anik Paul",
      "Md. Nur Hossain"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16781",
    "title": "Misogynistic Meme Detection using Early Fusion Model with Graph Network",
    "abstract": "In recent years , there has been an upsurge in a new form of entertainment medium called memes. These memes although seemingly innocuous have transcended onto the boundary of online harassment against women and created an unwanted bias against them . To help alleviate this problem , we propose an early fusion model for prediction and identification of misogynistic memes and its type in this paper for which we participated in SemEval-2022 Task 5 . The model receives as input meme image with its text transcription with a target vector. Given that a key challenge with this task is the combination of different modalities to predict misogyny, our model relies on pretrained contextual representations from different state-of-the-art transformer-based language models and pretrained image pretrained models to get an effective image representation. Our model achieved competitive results on both SubTask-A and SubTask-B with the other competition teams and significantly outperforms the baselines. ",
    "url": "https://arxiv.org/abs/2203.16781",
    "authors": [
      "Harshvardhan Srivastava"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.16782",
    "title": "Weakly Supervised Patch Label Inference Networks for Efficient Pavement  Distress Detection and Recognition in the Wild",
    "abstract": "Automatic image-based pavement distress detection and recognition are vital for pavement maintenance and management. However, existing deep learning-based methods largely omit the specific characteristics of pavement images, such as high image resolution and low distress area ratio, and are not end-to-end trainable. In this paper, we present a series of simple yet effective end-to-end deep learning approaches named Weakly Supervised Patch Label Inference Networks (WSPLIN) for efficiently addressing these tasks under various application settings. To fully exploit the resolution and scale information, WSPLIN first divides the pavement image under different scales into patches with different collection strategies and then employs a Patch Label Inference Network (PLIN) to infer the labels of these patches. Notably, we design a patch label sparsity constraint based on the prior knowledge of distress distribution, and leverage the Comprehensive Decision Network (CDN) to guide the training of PLIN in a weakly supervised way. Therefore, the patch labels produced by PLIN provide interpretable intermediate information, such as the rough location and the type of distress. We evaluate our method on a large-scale bituminous pavement distress dataset named CQU-BPDD. Extensive results demonstrate the superiority of our method over baselines in both performance and efficiency. ",
    "url": "https://arxiv.org/abs/2203.16782",
    "authors": [
      "Sheng Huang",
      "Wenhao Tang",
      "Guixin Huang",
      "Luwen Huangfu",
      "Dan Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16784",
    "title": "Video-Text Representation Learning via Differentiable Weak Temporal  Alignment",
    "abstract": "Learning generic joint representations for video and text by a supervised method requires a prohibitively substantial amount of manually annotated video datasets. As a practical alternative, a large-scale but uncurated and narrated video dataset, HowTo100M, has recently been introduced. But it is still challenging to learn joint embeddings of video and text in a self-supervised manner, due to its ambiguity and non-sequential alignment. In this paper, we propose a novel multi-modal self-supervised framework Video-Text Temporally Weak Alignment-based Contrastive Learning (VT-TWINS) to capture significant information from noisy and weakly correlated data using a variant of Dynamic Time Warping (DTW). We observe that the standard DTW inherently cannot handle weakly correlated data and only considers the globally optimal alignment path. To address these problems, we develop a differentiable DTW which also reflects local information with weak temporal alignment. Moreover, our proposed model applies a contrastive learning scheme to learn feature representations on weakly correlated data. Our extensive experiments demonstrate that VT-TWINS attains significant improvements in multi-modal representation learning and outperforms various challenging downstream tasks. Code is available at https://github.com/mlvlab/VT-TWINS. ",
    "url": "https://arxiv.org/abs/2203.16784",
    "authors": [
      "Dohwan Ko",
      "Joonmyung Choi",
      "Juyeon Ko",
      "Shinyeong Noh",
      "Kyoung-Woon On",
      "Eun-Sol Kim",
      "Hyunwoo J. Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16786",
    "title": "Latent Sub-structural Resilience Mechanisms in Temporal Human Mobility  Networks during Urban Flooding",
    "abstract": "In studying resilience in temporal human networks, relying solely on global network measures would be inadequate; latent sub-structural network mechanisms need to be examined to determine the extent of impact and recovery of these networks during perturbations, such as urban flooding. In this study, we utilized high-resolution aggregated location-based disaster related data to construct temporal human mobility networks. Using the constructed temporal network models, we examined characteristics such as motif distribution, motif persistence and temporal stability, and motif attributes to reveal latent sub-structural mechanisms related to the resilience of human mobility networks during disaster-induced perturbations. The results show that urban flood impacts persists in human mobility networks at the sub-structure level for several weeks. The impact extent and recovery duration is heterogeneous across different network types. Also, perturbation impacts persist at the sub-structure level while global topological network properties might indicate the network has recovered. The findings highlight the importance of examining the microstructures and their dynamic processes and attributes in understanding the resilience of temporal human mobility networks (and other temporal networks), it is essential to examine the microstructures and their perturbation impacts and recovery. The findings can also provide disaster managers, public officials, and transportation planners with insights to better evaluate impacts and to monitor recovery in affected communities based on the patterns of impact and recovery in human mobility networks at both sub-structure and global-network levels. ",
    "url": "https://arxiv.org/abs/2203.16786",
    "authors": [
      "Akhil Anil Rajput",
      "Ali Mostafavi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2203.16787",
    "title": "Reflection and Rotation Symmetry Detection via Equivariant Learning",
    "abstract": "The inherent challenge of detecting symmetries stems from arbitrary orientations of symmetry patterns; a reflection symmetry mirrors itself against an axis with a specific orientation while a rotation symmetry matches its rotated copy with a specific orientation. Discovering such symmetry patterns from an image thus benefits from an equivariant feature representation, which varies consistently with reflection and rotation of the image. In this work, we introduce a group-equivariant convolutional network for symmetry detection, dubbed EquiSym, which leverages equivariant feature maps with respect to a dihedral group of reflection and rotation. The proposed network is built end-to-end with dihedrally-equivariant layers and trained to output a spatial map for reflection axes or rotation centers. We also present a new dataset, DENse and DIverse symmetry (DENDI), which mitigates limitations of existing benchmarks for reflection and rotation symmetry detection. Experiments show that our method achieves the state of the arts in symmetry detection on LDRS and DENDI datasets. ",
    "url": "https://arxiv.org/abs/2203.16787",
    "authors": [
      "Ahyun Seo",
      "Byungjin Kim",
      "Suha Kwak",
      "Minsu Cho"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16796",
    "title": "Delays have Dangerous Ends: Slow HTTP/2 DoS attacks into the Wild and  their Real-Time Detection using Event Sequence Analysis",
    "abstract": "The robustness principle, written by Jon Postel in an early version of TCP implementation, states that the communicating entities should be liberal while accepting the data. Several entities on the Internet do follow this principle. For instance, in this work, we show that many popular web servers on the Internet are generous as they wait for a substantial time period to receive the remaining portion of an incomplete web request. Unfortunately, this behavior also makes them vulnerable to a class of cyber attacks, commonly known as Slow Rate DoS attacks. HTTP/2, the recent version of HTTP, is recently found vulnerable to these attacks. However, the impact of Slow HTTP/2 DoS attacks on real web servers on the Internet has not been studied yet. Also, to the best of our knowledge, there is no defense scheme known to detect Slow Rate DoS attacks against HTTP/2 in real-time. To bridge these gaps, we first test the behavior of HTTP/2 supporting web servers on the Internet against Slow HTTP/2 DoS attacks. Subsequently, we propose a scheme to detect these attacks in real-time. We show that the proposed detection scheme can detect attacks in real-time with high accuracy and marginal computational overhead. ",
    "url": "https://arxiv.org/abs/2203.16796",
    "authors": [
      "Nikhil Tripathi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.16801",
    "title": "Robust Meta-Reinforcement Learning with Curriculum-Based Task Sampling",
    "abstract": "Meta-reinforcement learning (meta-RL) acquires meta-policies that show good performance for tasks in a wide task distribution. However, conventional meta-RL, which learns meta-policies by randomly sampling tasks, has been reported to show meta-overfitting for certain tasks, especially for easy tasks where an agent can easily get high scores. To reduce effects of the meta-overfitting, we considered meta-RL with curriculum-based task sampling. Our method is Robust Meta Reinforcement Learning with Guided Task Sampling (RMRL-GTS), which is an effective method that restricts task sampling based on scores and epochs. We show that in order to achieve robust meta-RL, it is necessary not only to intensively sample tasks with poor scores, but also to restrict and expand the task regions of the tasks to be sampled. ",
    "url": "https://arxiv.org/abs/2203.16801",
    "authors": [
      "Morio Matsumoto",
      "Hiroya Matsuba",
      "Toshihiro Kujirai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16802",
    "title": "SIERRA: Ranking Anomalous Activities in Enterprise Networks",
    "abstract": "An enterprise today deploys multiple security middleboxes such as firewalls, IDS, IPS, etc. in its network to collect different kinds of events related to threats and attacks. These events are streamed into a SIEM (Security Information and Event Management) system for analysts to investigate and respond quickly with appropriate actions. However, the number of events collected for a single enterprise can easily run into hundreds of thousands per day, much more than what analysts can investigate under a given budget constraint (time). In this work, we look into the problem of prioritizing suspicious events or anomalies to analysts for further investigation. We develop SIERRA, a system that processes event logs from multiple and diverse middleboxes to detect and rank anomalous activities. SIERRA takes an unsupervised approach and therefore has no dependence on ground truth data. Different from other works, SIERRA defines contexts, that help it to provide visual explanations of highly-ranked anomalous points to analysts, despite employing unsupervised models. We evaluate SIERRA using months of logs from multiple security middleboxes of an enterprise network. The evaluations demonstrate the capability of SIERRA to detect top anomalies in a network while outperforming naive application of existing anomaly detection algorithms as well as a state-of-the-art SIEM-based anomaly detection solution. ",
    "url": "https://arxiv.org/abs/2203.16802",
    "authors": [
      "Jehyun Lee",
      "Farren Tang",
      "Phyo May Thet",
      "Desmond Yeoh",
      "Mitch Rybczynski",
      "Dinil Mon Divakaran"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.16803",
    "title": "Attack Impact Evaluation by Exact Convexification through State Space  Augmentation",
    "abstract": "We address the attack impact evaluation problem for control system security. We formulate the problem as a Markov decision process with a temporally joint chance constraint that forces the adversary to avoid being detected throughout the considered time period. Owing to the joint constraint, the optimal control policy depends not only on the current state but also on the entire history, which leads to the explosion of the search space and makes the problem generally intractable. It is shown that whether an alarm has been triggered or not, in addition to the current state is sufficient for specifying the optimal decision at each time step. Augmentation of the information to the state space induces an equivalent convex optimization problem, which is tractable using standard solvers. ",
    "url": "https://arxiv.org/abs/2203.16803",
    "authors": [
      "Hampei Sasahara",
      "Takashi Tanaka",
      "Henrik Sandberg"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.16807",
    "title": "Joint Power Allocation and Rate Control for Rate Splitting Multiple  Access Networks with Covert Communications",
    "abstract": "Rate Splitting Multiple Access (RSMA) has recently emerged as a promising technique to enhance the transmission rate for multiple access networks. Unlike conventional multiple access schemes, RSMA requires splitting and transmitting messages at different rates. The joint optimization of the power allocation and rate control at the transmitter is challenging given the uncertainty and dynamics of the environment. Furthermore, securing transmissions in RSMA networks is a crucial problem because the messages transmitted can be easily exposed to adversaries. This work first proposes a stochastic optimization framework that allows the transmitter to adaptively adjust its power and transmission rates allocated to users, and thereby maximizing the sum-rate and fairness of the system under the presence of an adversary. We then develop a highly effective learning algorithm that can help the transmitter to find the optimal policy without requiring complete information about the environment in advance. Extensive simulations show that our proposed scheme can achieve positive covert transmission rates in the finite blocklength regime and non-saturating rates at high SNR values. More significantly, our achievable covert rate can be increased at high SNR values (i.e., 20 dB to 40 dB), compared with saturating rates of a conventional multiple access scheme. ",
    "url": "https://arxiv.org/abs/2203.16807",
    "authors": [
      "Nguyen Quang Hieu",
      "Dinh Thai Hoang",
      "Dusit Niyato",
      "Diep N. Nguyen",
      "Dong In Kim",
      "Abbas Jamalipour"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2203.16828",
    "title": "Rethinking Portrait Matting with Privacy Preserving",
    "abstract": "Recently, there has been an increasing concern about the privacy issue raised by using personally identifiable information in machine learning. However, previous portrait matting methods were all based on identifiable portrait images. To fill the gap, we present P3M-10k in this paper, which is the first large-scale anonymized benchmark for Privacy-Preserving Portrait Matting (P3M). P3M-10k consists of 10,000 high-resolution face-blurred portrait images along with high-quality alpha mattes. We systematically evaluate both trimap-free and trimap-based matting methods on P3M-10k and find that existing matting methods show different generalization abilities under the privacy preserving training setting, i.e., training only on face-blurred images while testing on arbitrary images. Based on the gained insights, we propose a unified matting model named P3M-Net consisting of three carefully designed integration modules that can perform privacy-insensitive semantic perception and detail-reserved matting simultaneously. We further design multiple variants of P3M-Net with different CNN and transformer backbones and identify the difference in their generalization abilities. To further mitigate this issue, we devise a simple yet effective Copy and Paste strategy (P3M-CP) that can borrow facial information from public celebrity images without privacy concerns and direct the network to reacquire the face context at both data and feature levels. P3M-CP only brings a few additional computations during training, while enabling the matting model to process both face-blurred and normal images without extra effort during inference. Extensive experiments on P3M-10k demonstrate the superiority of P3M-Net over state-of-the-art methods and the effectiveness of P3M-CP in improving the generalization ability of P3M-Net, implying a great significance of P3M for future research and real-world applications. ",
    "url": "https://arxiv.org/abs/2203.16828",
    "authors": [
      "Sihan Ma",
      "Jizhizi Li",
      "Jing Zhang",
      "He Zhang",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.16838",
    "title": "NeuFA: Neural Network Based End-to-End Forced Alignment with  Bidirectional Attention Mechanism",
    "abstract": "Although deep learning and end-to-end models have been widely used and shown superiority in automatic speech recognition (ASR) and text-to-speech (TTS) synthesis, state-of-the-art forced alignment (FA) models are still based on hidden Markov model (HMM). HMM has limited view of contextual information and is developed with long pipelines, leading to error accumulation and unsatisfactory performance. Inspired by the capability of attention mechanism in capturing long term contextual information and learning alignments in ASR and TTS, we propose a neural network based end-to-end forced aligner called NeuFA, in which a novel bidirectional attention mechanism plays an essential role. NeuFA integrates the alignment learning of both ASR and TTS tasks in a unified framework by learning bidirectional alignment information from a shared attention matrix in the proposed bidirectional attention mechanism. Alignments are extracted from the learnt attention weights and optimized by the ASR, TTS and FA tasks in a multi-task learning manner. Experimental results demonstrate the effectiveness of our proposed model, with mean absolute error on test set drops from 25.8 ms to 23.7 ms at word level, and from 17.0 ms to 15.7 ms at phoneme level compared with state-of-the-art HMM based model. ",
    "url": "https://arxiv.org/abs/2203.16838",
    "authors": [
      "Jingbei Li",
      "Yi Meng",
      "Zhiyong Wu",
      "Helen Meng",
      "Qiao Tian",
      "Yuping Wang",
      "Yuxuan Wang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16851",
    "title": "Towards Driving-Oriented Metric for Lane Detection Models",
    "abstract": "After the 2017 TuSimple Lane Detection Challenge, its dataset and evaluation based on accuracy and F1 score have become the de facto standard to measure the performance of lane detection methods. While they have played a major role in improving the performance of lane detection methods, the validity of this evaluation method in downstream tasks has not been adequately researched. In this study, we design 2 new driving-oriented metrics for lane detection: End-to-End Lateral Deviation metric (E2E-LD) is directly formulated based on the requirements of autonomous driving, a core downstream task of lane detection; Per-frame Simulated Lateral Deviation metric (PSLD) is a lightweight surrogate metric of E2E-LD. To evaluate the validity of the metrics, we conduct a large-scale empirical study with 4 major types of lane detection approaches on the TuSimple dataset and our newly constructed dataset Comma2k19-LD. Our results show that the conventional metrics have strongly negative correlations ($\\leq$-0.55) with E2E-LD, meaning that some recent improvements purely targeting the conventional metrics may not have led to meaningful improvements in autonomous driving, but rather may actually have made it worse by overfitting to the conventional metrics. As autonomous driving is a security/safety-critical system, the underestimation of robustness hinders the sound development of practical lane detection models. We hope that our study will help the community achieve more downstream task-aware evaluations for lane detection. ",
    "url": "https://arxiv.org/abs/2203.16851",
    "authors": [
      "Takami Sato",
      "Qi Alfred Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16857",
    "title": "Lifeline: Emergency Ad Hoc Network",
    "abstract": "Lifeline is a group of systems designed for mobile phones and battery powered wireless routers for forming emergency Ad hoc networks. Devices installed with Lifeline program can automatically form Ad hoc networks when cellular signal is unavailable or disrupted during natural disasters. For instance, large scale earthquakes can cause extensive damages to land-based telecommunication infrastructures. In such circumstances, mobile phones installed with Lifeline program can be used to send emergency messages by the victims who are trapped under collapsed buildings. In addition, Lifeline also provides a function for the rescuers to estimate the positions of the victims based on network propagation techniques. Lifeline also has the ability to recover from partial crash of network and nodes lost. ",
    "url": "https://arxiv.org/abs/2203.16857",
    "authors": [
      "Se-Hang Cheong",
      "Kai-Ip Lee",
      "Yain-Whar Si",
      "Leong-Hou U"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.16859",
    "title": "Boundary Node Detection and Unfolding of Complex Non-Convex Ad Hoc  Networks",
    "abstract": "Complex non-convex ad hoc networks (CNCAH) contain intersecting polygons and edges. In many instances, the layouts of these networks are not entirely convex in shape. In this article, we propose a Kamada-Kawai-based algorithm called W-KK-MS for boundary node detection problems, which is capable of aligning node positions while achieving high sensitivity, specificity, and accuracy in producing a visual drawing from the input network topology. The algorithm put forward in this article selects and assigns weights to top-k nodes in each iteration to speed up the updating process of nodes. We also propose a novel approach to detect and unfold stacked regions in CNCAH networks. Experimental results show that the proposed algorithms can achieve fast convergence on boundary node detection in CNCAH networks and are able to successfully unfold stacked regions. The design and implementation of a prototype system called ELnet for analyzing CNCAH networks is also described in this article. The ELnet system is capable of generating synthetic networks for testing, integrating with force-directed algorithms, and visualizing and analyzing algorithms' outcomes. ",
    "url": "https://arxiv.org/abs/2203.16859",
    "authors": [
      "Se-Hang Cheong",
      "Yain-Whar Si"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.16864",
    "title": "Saving lives: design and implementation of lifeline emergency ad hoc  network",
    "abstract": "This paper aims to propose a system for automatically forming ad hoc networks using mobile phones and battery-powered wireless routers for emergency situations. The system also provides functions to send emergency messages and identify the location of victims based on the network topology information. Optimized link state routing protocol is used to instantly form an ad hoc emergency network based on WiFi signals from mobile phones of the victims, backup battery-powered wireless routers preinstalled in buildings and mobile devices deployed by search and rescue teams. The proposed system is also designed to recover from partial crash of network and nodes lost. Experimental results demonstrate the effectiveness of the proposed system in terms of battery life, transmission distance and noises. A novel message routing schedule is proposed for conserving battery life. A novel function to estimate the location of a mobile device which sent an emergency message is proposed in this paper. ",
    "url": "https://arxiv.org/abs/2203.16864",
    "authors": [
      "Se-Hang Cheong",
      "Yain-Whar Si",
      "Leong-Hou U"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.16867",
    "title": "Snapshot Visualization of Complex Graphs with Force-Directed Algorithms",
    "abstract": "Force-directed algorithms are widely used for visualizing graphs. However, these algorithms are computationally expensive in producing good quality layouts for complex graphs. The layout quality is largely influenced by execution time and methods' input parameters especially for large complex graphs. The snapshots of visualization generated from these algorithms are useful in presenting the current view or a past state of an information on timeslices. Therefore, researchers often need to make a trade-off between the quality of visualization and the selection of appropriate force-directed algorithms. In this paper, we evaluate the quality of snapshots generated from 7 force-directed algorithms in terms of number of edge crossing and the standard deviations of edge length. Our experimental results showed that KK, FA2 and DH algorithms cannot produce satisfactory visualizations for large graphs within the time limit. KK-MS-DS algorithm can process large and planar graphs but it does not perform well for graphs with low average degrees. KK-MS algorithm produces better visualizations for sparse and non-clustered graphs than KK-MS-DS algorithm. ",
    "url": "https://arxiv.org/abs/2203.16867",
    "authors": [
      "Se-Hang Cheong",
      "Yain-Whar Si"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2203.16871",
    "title": "Ransomware Detection using Process Memory",
    "abstract": "Ransomware attacks have increased significantly in recent years, causing great destruction and damage to critical systems and business operations. Attackers are unfailingly finding innovative ways to bypass detection mechanisms, whichencouraged the adoption of artificial intelligence. However, most research summarizes the general features of AI and induces many false positives, as the behavior of ransomware constantly differs to bypass detection. Focusing on the key indicating features of ransomware becomes vital as this guides the investigator to the inner workings and main function of ransomware itself. By utilizing access privileges in process memory, the main function of the ransomware can be detected more easily and accurately. Furthermore, new signatures and fingerprints of ransomware families can be identified to classify novel ransomware attacks correctly. The current research used the process memory access privileges of the different memory regions of the behavior of an executable to quickly determine its intent before serious harm can occur. To achieve this aim, several well-known machine learning algorithms were explored with an accuracy range of 81.38 to 96.28 percents. The study thus confirms the feasibility of utilizing process memory as a detection mechanism for ransomware. ",
    "url": "https://arxiv.org/abs/2203.16871",
    "authors": [
      "Avinash Singh",
      "Richard Adeyemi Ikuesan",
      "Hein Venter"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16887",
    "title": "Mutual information estimation for graph convolutional neural networks",
    "abstract": "Measuring model performance is a key issue for deep learning practitioners. However, we often lack the ability to explain why a specific architecture attains superior predictive accuracy for a given data set. Often, validation accuracy is used as a performance heuristic quantifying how well a network generalizes to unseen data, but it does not capture anything about the information flow in the model. Mutual information can be used as a measure of the quality of internal representations in deep learning models, and the information plane may provide insights into whether the model exploits the available information in the data. The information plane has previously been explored for fully connected neural networks and convolutional architectures. We present an architecture-agnostic method for tracking a network's internal representations during training, which are then used to create the mutual information plane. The method is exemplified for graph-based neural networks fitted on citation data. We compare how the inductive bias introduced in graph-based architectures changes the mutual information plane relative to a fully connected neural network. ",
    "url": "https://arxiv.org/abs/2203.16887",
    "authors": [
      "Marius C. Landverk",
      "Signe Riemer-Sørensen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16891",
    "title": "A survey of neural models for the automatic analysis of conversation:  Towards a better integration of the social sciences",
    "abstract": "Some exciting new approaches to neural architectures for the analysis of conversation have been introduced over the past couple of years. These include neural architectures for detecting emotion, dialogue acts, and sentiment polarity. They take advantage of some of the key attributes of contemporary machine learning, such as recurrent neural networks with attention mechanisms and transformer-based approaches. However, while the architectures themselves are extremely promising, the phenomena they have been applied to to date are but a small part of what makes conversation engaging. In this paper we survey these neural architectures and what they have been applied to. On the basis of the social science literature, we then describe what we believe to be the most fundamental and definitional feature of conversation, which is its co-construction over time by two or more interlocutors. We discuss how neural architectures of the sort surveyed could profitably be applied to these more fundamental aspects of conversation, and what this buys us in terms of a better analysis of conversation and even, in the longer term, a better way of generating conversation for a conversational system. ",
    "url": "https://arxiv.org/abs/2203.16891",
    "authors": [
      "Chloé Clavel",
      "Matthieu Labeau",
      "Justine Cassell"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16896",
    "title": "CRAFT: Cross-Attentional Flow Transformer for Robust Optical Flow",
    "abstract": "Optical flow estimation aims to find the 2D motion field by identifying corresponding pixels between two images. Despite the tremendous progress of deep learning-based optical flow methods, it remains a challenge to accurately estimate large displacements with motion blur. This is mainly because the correlation volume, the basis of pixel matching, is computed as the dot product of the convolutional features of the two images. The locality of convolutional features makes the computed correlations susceptible to various noises. On large displacements with motion blur, noisy correlations could cause severe errors in the estimated flow. To overcome this challenge, we propose a new architecture \"CRoss-Attentional Flow Transformer\" (CRAFT), aiming to revitalize the correlation volume computation. In CRAFT, a Semantic Smoothing Transformer layer transforms the features of one frame, making them more global and semantically stable. In addition, the dot-product correlations are replaced with transformer Cross-Frame Attention. This layer filters out feature noises through the Query and Key projections, and computes more accurate correlations. On Sintel (Final) and KITTI (foreground) benchmarks, CRAFT has achieved new state-of-the-art performance. Moreover, to test the robustness of different models on large motions, we designed an image shifting attack that shifts input images to generate large artificial motions. Under this attack, CRAFT performs much more robustly than two representative methods, RAFT and GMA. The code of CRAFT is is available at https://github.com/askerlee/craft. ",
    "url": "https://arxiv.org/abs/2203.16896",
    "authors": [
      "Xiuchao Sui",
      "Shaohua Li",
      "Xue Geng",
      "Yan Wu",
      "Xinxing Xu",
      "Yong Liu",
      "Rick Goh",
      "Hongyuan Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16897",
    "title": "Multi-Granularity Alignment Domain Adaptation for Object Detection",
    "abstract": "Domain adaptive object detection is challenging due to distinctive data distribution between source domain and target domain. In this paper, we propose a unified multi-granularity alignment based object detection framework towards domain-invariant feature learning. To this end, we encode the dependencies across different granularity perspectives including pixel-, instance-, and category-levels simultaneously to align two domains. Based on pixel-level feature maps from the backbone network, we first develop the omni-scale gated fusion module to aggregate discriminative representations of instances by scale-aware convolutions, leading to robust multi-scale object detection. Meanwhile, the multi-granularity discriminators are proposed to identify which domain different granularities of samples(i.e., pixels, instances, and categories) come from. Notably, we leverage not only the instance discriminability in different categories but also the category consistency between two domains. Extensive experiments are carried out on multiple domain adaptation scenarios, demonstrating the effectiveness of our framework over state-of-the-art algorithms on top of anchor-free FCOS and anchor-based Faster RCNN detectors with different backbones. ",
    "url": "https://arxiv.org/abs/2203.16897",
    "authors": [
      "Wenzhang Zhou",
      "Dawei Du",
      "Libo Zhang",
      "Tiejian Luo",
      "Yanjun Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16910",
    "title": "End-to-End Trajectory Distribution Prediction Based on Occupancy Grid  Maps",
    "abstract": "In this paper, we aim to forecast a future trajectory distribution of a moving agent in the real world, given the social scene images and historical trajectories. Yet, it is a challenging task because the ground-truth distribution is unknown and unobservable, while only one of its samples can be applied for supervising model learning, which is prone to bias. Most recent works focus on predicting diverse trajectories in order to cover all modes of the real distribution, but they may despise the precision and thus give too much credit to unrealistic predictions. To address the issue, we learn the distribution with symmetric cross-entropy using occupancy grid maps as an explicit and scene-compliant approximation to the ground-truth distribution, which can effectively penalize unlikely predictions. In specific, we present an inverse reinforcement learning based multi-modal trajectory distribution forecasting framework that learns to plan by an approximate value iteration network in an end-to-end manner. Besides, based on the predicted distribution, we generate a small set of representative trajectories through a differentiable Transformer-based network, whose attention mechanism helps to model the relations of trajectories. In experiments, our method achieves state-of-the-art performance on the Stanford Drone Dataset and Intersection Drone Dataset. ",
    "url": "https://arxiv.org/abs/2203.16910",
    "authors": [
      "Ke Guo",
      "Wenxi Liu",
      "Jia Pan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16921",
    "title": "Assessing the risk of re-identification arising from an attack on  anonymised data",
    "abstract": "Objective: The use of routinely-acquired medical data for research purposes requires the protection of patient confidentiality via data anonymisation. The objective of this work is to calculate the risk of re-identification arising from a malicious attack to an anonymised dataset, as described below. Methods: We first present an analytical means of estimating the probability of re-identification of a single patient in a k-anonymised dataset of Electronic Health Record (EHR) data. Second, we generalize this solution to obtain the probability of multiple patients being re-identified. We provide synthetic validation via Monte Carlo simulations to illustrate the accuracy of the estimates obtained. Results: The proposed analytical framework for risk estimation provides re-identification probabilities that are in agreement with those provided by simulation in a number of scenarios. Our work is limited by conservative assumptions which inflate the re-identification probability. Discussion: Our estimates show that the re-identification probability increases with the proportion of the dataset maliciously obtained and that it has an inverse relationship with the equivalence class size. Our recursive approach extends the applicability domain to the general case of a multi-patient re-identification attack in an arbitrary k-anonymisation scheme. Conclusion: We prescribe a systematic way to parametrize the k-anonymisation process based on a pre-determined re-identification probability. We observed that the benefits of a reduced re-identification risk that come with increasing k-size may not be worth the reduction in data granularity when one is considering benchmarking the re-identification probability on the size of the portion of the dataset maliciously obtained by the adversary. ",
    "url": "https://arxiv.org/abs/2203.16921",
    "authors": [
      "Anna Antoniou",
      "Giacomo Dossena",
      "Julia MacMillan",
      "Steven Hamblin",
      "David Clifton",
      "Paula Petrone"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.16922",
    "title": "A Character-level Span-based Model for Mandarin Prosodic Structure  Prediction",
    "abstract": "The accuracy of prosodic structure prediction is crucial to the naturalness of synthesized speech in Mandarin text-to-speech system, but now is limited by widely-used sequence-to-sequence framework and error accumulation from previous word segmentation results. In this paper, we propose a span-based Mandarin prosodic structure prediction model to obtain an optimal prosodic structure tree, which can be converted to corresponding prosodic label sequence. Instead of the prerequisite for word segmentation, rich linguistic features are provided by Chinese character-level BERT and sent to encoder with self-attention architecture. On top of this, span representation and label scoring are used to describe all possible prosodic structure trees, of which each tree has its corresponding score. To find the optimal tree with the highest score for a given sentence, a bottom-up CKY-style algorithm is further used. The proposed method can predict prosodic labels of different levels at the same time and accomplish the process directly from Chinese characters in an end-to-end manner. Experiment results on two real-world datasets demonstrate the excellent performance of our span-based method over all sequence-to-sequence baseline approaches. ",
    "url": "https://arxiv.org/abs/2203.16922",
    "authors": [
      "Xueyuan Chen",
      "Changhe Song",
      "Yixuan Zhou",
      "Zhiyong Wu",
      "Changbin Chen",
      "Zhongqin Wu",
      "Helen Meng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16928",
    "title": "Neural Architecture Search for Speech Emotion Recognition",
    "abstract": "Deep neural networks have brought significant advancements to speech emotion recognition (SER). However, the architecture design in SER is mainly based on expert knowledge and empirical (trial-and-error) evaluations, which is time-consuming and resource intensive. In this paper, we propose to apply neural architecture search (NAS) techniques to automatically configure the SER models. To accelerate the candidate architecture optimization, we propose a uniform path dropout strategy to encourage all candidate architecture operations to be equally optimized. Experimental results of two different neural structures on IEMOCAP show that NAS can improve SER performance (54.89\\% to 56.28\\%) while maintaining model parameter sizes. The proposed dropout strategy also shows superiority over the previous approaches. ",
    "url": "https://arxiv.org/abs/2203.16928",
    "authors": [
      "Xixin Wu",
      "Shoukang Hu",
      "Zhiyong Wu",
      "Xunying Liu",
      "Helen Meng"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16930",
    "title": "WavThruVec: Latent speech representation as intermediate features for  neural speech synthesis",
    "abstract": "Recent advances in neural text-to-speech research have been dominated by two-stage pipelines utilizing low-level intermediate speech representation such as mel-spectrograms. However, such predetermined features are fundamentally limited, because they do not allow to exploit the full potential of a data-driven approach through learning hidden representations. For this reason, several end-to-end methods have been proposed. However, such models are harder to train and require a large number of high-quality recordings with transcriptions. Here, we propose WavThruVec - a two-stage architecture that resolves the bottleneck by using high-dimensional Wav2Vec 2.0 embeddings as intermediate speech representation. Since these hidden activations provide high-level linguistic features, they are more robust to noise. That allows us to utilize annotated speech datasets of a lower quality to train the first-stage module. At the same time, the second-stage component can be trained on large-scale untranscribed audio corpora, as Wav2Vec 2.0 embeddings are time-aligned and speaker-independent. This results in an increased generalization capability to out-of-vocabulary words, as well as to a better generalization to unseen speakers. We show that the proposed model not only matches the quality of state-of-the-art neural models, but also presents useful properties enabling tasks like voice conversion or zero-shot synthesis. ",
    "url": "https://arxiv.org/abs/2203.16930",
    "authors": [
      "Hubert Siuzdak",
      "Piotr Dura",
      "Pol van Rijn",
      "Nori Jacoby"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16931",
    "title": "Towards Robust Rain Removal Against Adversarial Attacks: A Comprehensive  Benchmark Analysis and Beyond",
    "abstract": "Rain removal aims to remove rain streaks from images/videos and reduce the disruptive effects caused by rain. It not only enhances image/video visibility but also allows many computer vision algorithms to function properly. This paper makes the first attempt to conduct a comprehensive study on the robustness of deep learning-based rain removal methods against adversarial attacks. Our study shows that, when the image/video is highly degraded, rain removal methods are more vulnerable to the adversarial attacks as small distortions/perturbations become less noticeable or detectable. In this paper, we first present a comprehensive empirical evaluation of various methods at different levels of attacks and with various losses/targets to generate the perturbations from the perspective of human perception and machine analysis tasks. A systematic evaluation of key modules in existing methods is performed in terms of their robustness against adversarial attacks. From the insights of our analysis, we construct a more robust deraining method by integrating these effective modules. Finally, we examine various types of adversarial attacks that are specific to deraining problems and their effects on both human and machine vision tasks, including 1) rain region attacks, adding perturbations only in the rain regions to make the perturbations in the attacked rain images less visible; 2) object-sensitive attacks, adding perturbations only in regions near the given objects. Code is available at https://github.com/yuyi-sd/Robust_Rain_Removal. ",
    "url": "https://arxiv.org/abs/2203.16931",
    "authors": [
      "Yi Yu",
      "Wenhan Yang",
      "Yap-Peng Tan",
      "Alex C. Kot"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.16932",
    "title": "Probabilistic Map Matching for Robust Inertial Navigation Aiding",
    "abstract": "Robust aiding of inertial navigation systems in GNSS-denied environments is critical for the removal of accumulated navigation error caused by the drift and bias inherent in inertial sensors. One way to perform such an aiding uses matching of geophysical measurements, such as gravimetry, gravity gradiometry or magnetometry, with a known geo-referenced map. Although simple in concept, this map matching procedure is challenging: the measurements themselves are noisy; their associated spatial location is uncertain; and the measurements may match multiple points within the map (i.e. non-unique solution). In this paper, we propose a probabilistic multiple hypotheses tracker to solve the map matching problem and allow robust inertial navigation aiding. Our approach addresses the problem both locally, via probabilistic data association, and temporally by incorporating the underlying platform kinematic constraints into the tracker. The map matching output is then integrated into the navigation system using an unscented Kalman filter. Additionally, we present a statistical measure of local map information density -- the map feature variability -- and use it to weight the output covariance of the proposed algorithm. The effectiveness and robustness of the proposed algorithm are demonstrated using a navigation scenario involving gravitational map matching. ",
    "url": "https://arxiv.org/abs/2203.16932",
    "authors": [
      "Xuezhi Wang",
      "Christopher Gilliam",
      "Allison Kealy",
      "John Close",
      "Bill Moran"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.16939",
    "title": "Hypergraph Convolutional Networks via Equivalency between Hypergraphs  and Undirected Graphs",
    "abstract": "As a powerful tool for modeling complex relationships, hypergraphs are gaining popularity from the graph learning community. However, commonly used frameworks in deep hypergraph learning focus on hypergraphs with \\textit{edge-independent vertex weights}(EIVWs), without considering hypergraphs with \\textit{edge-dependent vertex weights} (EDVWs) that have more modeling power. To compensate for this, in this paper, we present General Hypergraph Spectral Convolution(GHSC), a general learning framework that not only can handle EDVW and EIVW hypergraphs, but more importantly, enables theoretically explicitly utilizing the existing powerful Graph Convolutional Neural Networks (GCNNs) such that largely ease the design of Hypergraph Neural Networks. In this framework, the graph Laplacian of the given undirected GCNNs is replaced with a unified hypergraph Laplacian that incorporates vertex weight information from a random walk perspective by equating our defined generalized hypergraphs with simple undirected graphs. Extensive experiments from various domains including social network analysis, visual objective classification, protein learning demonstrate that the proposed framework can achieve state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2203.16939",
    "authors": [
      "Jiying Zhang",
      "Fuyang Li",
      "Xi Xiao",
      "Tingyang Xu",
      "Yu Rong",
      "Junzhou Huang",
      "Yatao Bian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16941",
    "title": "The ideal data compression and automatic discovery of hidden law using  neural network",
    "abstract": "Recently machine learning using neural networks has been developed, and many new methods have been suggested. On the other hand, a system that has true versatility has not been developed, and there remain many fields in which the human brain has advantages over machine learning. We considered how the human brain recognizes events and memorizes them and succeeded to reproduce the system of the human brain on a machine learning model with a new autoencoder neural network (NN). The previous autoencoders have the problem that they cannot define well what is the features of the input data, and we need to restrict the middle layer of the autoencoder artificially. We solve this problem by defining a new loss function that reflects the information entropy, and it enables the NN to compress the input data ideally and automatically discover the hidden law behind the input data set. The loss function used in our NN is based on the free-energy principle which is known as the unified brain theory, and our study is the first concrete formularization of this principle. The result of this study can be applied to any kind of data analysis and also to cognitive science. ",
    "url": "https://arxiv.org/abs/2203.16941",
    "authors": [
      "Taisuke Katayose"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2203.16945",
    "title": "Semantic Pose Verification for Outdoor Visual Localization with  Self-supervised Contrastive Learning",
    "abstract": "Any city-scale visual localization system has to overcome long-term appearance changes, such as varying illumination conditions or seasonal changes between query and database images. Since semantic content is more robust to such changes, we exploit semantic information to improve visual localization. In our scenario, the database consists of gnomonic views generated from panoramic images (e.g. Google Street View) and query images are collected with a standard field-of-view camera at a different time. To improve localization, we check the semantic similarity between query and database images, which is not trivial since the position and viewpoint of the cameras do not exactly match. To learn similarity, we propose training a CNN in a self-supervised fashion with contrastive learning on a dataset of semantically segmented images. With experiments we showed that this semantic similarity estimation approach works better than measuring the similarity at pixel-level. Finally, we used the semantic similarity scores to verify the retrievals obtained by a state-of-the-art visual localization method and observed that contrastive learning-based pose verification increases top-1 recall value to 0.90 which corresponds to a 2% improvement. ",
    "url": "https://arxiv.org/abs/2203.16945",
    "authors": [
      "Semih Orhan",
      "Jose J. Guerrero",
      "Yalin Bastanlar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16962",
    "title": "A comparative study between linear and nonlinear speech prediction",
    "abstract": "This paper is focused on nonlinear prediction coding, which consists on the prediction of a speech sample based on a nonlinear combination of previous samples. It is known that in the generation of the glottal pulse, the wave equation does not behave linearly [2], [10], and we model these effects by means of a nonlinear prediction of speech based on a parametric neural network model. This work is centred on the neural net weight's quantization and on the compression gain. ",
    "url": "https://arxiv.org/abs/2203.16962",
    "authors": [
      "Marcos Faundez-Zanuy",
      "Enric Monte",
      "Francesc Vallverdú"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16965",
    "title": "PADA: Pruning Assisted Domain Adaptation for Self-Supervised Speech  Representations",
    "abstract": "While self-supervised speech representation learning (SSL) models serve a variety of downstream tasks, these models have been observed to overfit to the domain from which the unlabelled data originates. To alleviate this issue, we propose PADA (Pruning Assisted Domain Adaptation) and zero out redundant weights from models pre-trained on large amounts of out-of-domain (OOD) data. Intuitively, this helps to make space for the target-domain ASR finetuning. The redundant weights can be identified through various pruning strategies which have been discussed in detail as a part of this work. Specifically, we investigate the effect of the recently discovered Task-Agnostic and Task-Aware pruning on PADA and propose a new pruning paradigm based on the latter, which we call Cross-Domain Task-Aware Pruning (CD-TAW). CD-TAW obtains the initial pruning mask from a well fine-tuned OOD model, which makes it starkly different from the rest of the pruning strategies discussed in the paper. Our proposed CD-TAW methodology achieves up to 20.6% relative WER improvement over our baseline when fine-tuned on a 2-hour subset of Switchboard data without language model (LM) decoding. Furthermore, we conduct a detailed analysis to highlight the key design choices of our proposed method. ",
    "url": "https://arxiv.org/abs/2203.16965",
    "authors": [
      "Lodagala V S V Durga Prasad",
      "Sreyan Ghosh",
      "S. Umesh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16973",
    "title": "Analyzing the factors affecting usefulness of Self-Supervised  Pre-trained Representations for Speech Recognition",
    "abstract": "Self-supervised learning (SSL) to learn high-level speech representations has been a popular approach to building Automatic Speech Recognition (ASR) systems in low-resource settings. However, the common assumption made in literature is that a considerable amount of unlabeled data is available for the same domain or language that can be leveraged for SSL pre-training, which we acknowledge is not feasible in a real-world setting. In this paper, as part of the Interspeech Gram Vaani ASR challenge, we try to study the effect of domain, language, dataset size, and other aspects of our upstream pre-training SSL data on the final performance low-resource downstream ASR task. We also build on the continued pre-training paradigm to study the effect of prior knowledge possessed by models trained using SSL. Extensive experiments and studies reveal that the performance of ASR systems is susceptible to the data used for SSL pre-training. Their performance improves with an increase in similarity and volume of pre-training data. We believe our work will be helpful to the speech community in building better ASR systems in low-resource settings and steer research towards improving generalization in SSL-based pre-training for speech systems. ",
    "url": "https://arxiv.org/abs/2203.16973",
    "authors": [
      "Lodagala V S V Durga Prasad",
      "Ashish Seth",
      "Sreyan Ghosh",
      "S. Umesh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16987",
    "title": "Leveraging Predictions from Multiple Repositories to Improve Bot  Detection",
    "abstract": "Contemporary social coding platforms such as GitHub facilitate collaborative distributed software development. Developers engaged in these platforms often use machine accounts (bots) for automating effort-intensive or repetitive activities. Determining whether a contributor corresponds to a bot or a human account is important in socio-technical studies, for example, to assess the positive and negative impact of using bots, analyse the evolution of bots and their usage, identify top human contributors, and so on. BoDeGHa is one of the bot detection tools that have been proposed in the literature. It relies on comment activity within a single repository to predict whether an account is driven by a bot or by a human. This paper presents preliminary results on how the effectiveness of BoDeGHa can be improved by combining the predictions obtained from many repositories at once. We found that doing this not only increases the number of cases for which a prediction can be made but that many diverging predictions can be fixed this way. These promising, albeit preliminary, results suggest that the \"wisdom of the crowd\" principle can improve the effectiveness of bot detection tools. ",
    "url": "https://arxiv.org/abs/2203.16987",
    "authors": [
      "Natarajan Chidambaram",
      "Alexandre Decan",
      "Mehdi Golzadeh"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2203.16988",
    "title": "Acoustic-Net: A Novel Neural Network for Sound Localization and  Quantification",
    "abstract": "Acoustic source localization has been applied in different fields, such as aeronautics and ocean science, generally using multiple microphones array data to reconstruct the source location. However, the model-based beamforming methods fail to achieve the high-resolution of conventional beamforming maps. Deep neural networks are also appropriate to locate the sound source, but in general, these methods with complex network structures are hard to be recognized by hardware. In this paper, a novel neural network, termed the Acoustic-Net, is proposed to locate and quantify the sound source simply using the original signals. The experiments demonstrate that the proposed method significantly improves the accuracy of sound source prediction and the computing speed, which may generalize well to real data. The code and trained models are available at https://github.com/JoaquinChou/Acoustic-Net. ",
    "url": "https://arxiv.org/abs/2203.16988",
    "authors": [
      "Guanxing Zhou",
      "Hao Liang",
      "Xinghao Ding",
      "Yue Huang",
      "Xiaotong Tu",
      "Saqlain Abbas"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16992",
    "title": "Subquadratic Dynamic Path Reporting in Directed Graphs Against an  Adaptive Adversary",
    "abstract": "We study reachability and shortest paths problems in dynamic directed graphs. Whereas algebraic dynamic data structures supporting edge updates and reachability/distance queries have been known for quite a long time, they do not, in general, allow reporting the underlying paths within the same time bounds, especially against an adaptive adversary. In this paper we develop the first known fully dynamic reachability data structures working against an adaptive adversary and supporting edge updates and path queries for two natural variants: (1) point-to-point path reporting, and (2) single-source reachability tree reporting. For point-to-point queries in DAGs, we achieve $O(n^{1.529})$ worst-case update and query bounds, whereas for tree reporting in DAGs, the worst-case bounds are $O(n^{1.765})$. More importantly, we show how to lift these algorithms to work on general graphs at the cost of increasing the bounds to $n^{1+5/6+o(1)}$ and making the update times amortized. On the way to accomplishing that, we obtain two interesting subresults. We give subquadratic fully dynamic algorithms for topological order (in a DAG), and strongly connected components. To the best of our knowledge, such algorithms have not been described before. Additionally, we provide deterministic incremental data structures for reachability and shortest paths that handle edge insertions and report the respective paths within subquadratic worst-case time bounds. For reachability and $(1+\\epsilon)$-approximate shortest paths in weighted digraphs, these bounds match the best known dynamic matrix inverse-based randomized bounds for fully dynamic reachability [v.d.Brand, Nanongkai and Saranurak, FOCS'19]. For exact shortest paths in unweighted graphs, the obtained bounds in the incremental setting polynomially improve upon the respective best known randomized update/distance query bounds in the fully dynamic setting. ",
    "url": "https://arxiv.org/abs/2203.16992",
    "authors": [
      "Adam Karczmarz",
      "Anish Mukherjee",
      "Piotr Sankowski"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2203.16995",
    "title": "Message Passing Neural Networks for Hypergraphs",
    "abstract": "Hypergraph representations are both more efficient and better suited to describe data characterized by relations between two or more objects. In this work, we present the first graph neural network based on message passing capable of processing hypergraph-structured data. We show that the proposed model defines a design space for neural network models for hypergraphs, thus generalizing existing models for hypergraphs. We report experiments on a benchmark dataset for node classification, highlighting the effectiveness of the proposed model with respect to other state-of-the-art methods for graphs and hypergraphs. We also discuss the benefits of using hypergraph representations and, at the same time, highlight the limitation of using equivalent graph representations when the underlying problem has relations among more than two objects. ",
    "url": "https://arxiv.org/abs/2203.16995",
    "authors": [
      "Sajjad Heydari",
      "Lorenzo Livi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16997",
    "title": "Bot Detection in GitHub Repositories",
    "abstract": "Contemporary social coding platforms like GitHub promote collaborative development. Many open-source software repositories hosted in these platforms use machine accounts (bots) to automate and facilitate a wide range of effort-intensive and repetitive activities. Determining if an account corresponds to a bot or a human contributor is important for socio-technical development analytics, for example, to understand how humans collaborate and interact in the presence of bots, to assess the positive and negative impact of using bots, to identify the top project contributors, to identify potential bus factors, and so on. Our project aims to include the trained machine learning (ML) classifier from the BoDeGHa bot detection tool as a plugin to the GrimoireLab software development analytics platform. In this work, we present the procedure to form a pipeline for retrieving contribution and contributor data using Perceval, distinguishing bots from humans using BoDeGHa, and visualising the results using Kibana. ",
    "url": "https://arxiv.org/abs/2203.16997",
    "authors": [
      "Natarajan Chidambaram",
      "Pooya Rostami Mazrae"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2203.17012",
    "title": "A Temporal-oriented Broadcast ResNet for COVID-19 Detection",
    "abstract": "Detecting COVID-19 from audio signals, such as breathing and coughing, can be used as a fast and efficient pre-testing method to reduce the virus transmission. Due to the promising results of deep learning networks in modelling time sequences, and since applications to rapidly identify COVID in-the-wild should require low computational effort, we present a temporal-oriented broadcasting residual learning method that achieves efficient computation and high accuracy with a small model size. Based on the EfficientNet architecture, our novel network, named Temporal-oriented ResNet~(TorNet), constitutes of a broadcasting learning block, i.e. the Alternating Broadcast (AB) Block, which contains several Broadcast Residual Blocks (BC ResBlocks) and a convolution layer. With the AB Block, the network obtains useful audio-temporal features and higher level embeddings effectively with much less computation than Recurrent Neural Networks~(RNNs), typically used to model temporal information. TorNet achieves 72.2% Unweighted Average Recall (UAR) on the INTERPSEECH 2021 Computational Paralinguistics Challenge COVID-19 cough Sub-Challenge, by this showing competitive results with a higher computational efficiency than other state-of-the-art alternatives. ",
    "url": "https://arxiv.org/abs/2203.17012",
    "authors": [
      "Xin Jing",
      "Shuo Liu",
      "Emilia Parada-Cabaleiro",
      "Andreas Triantafyllopoulos",
      "Meishu Song",
      "Zijiang Yang",
      "Björn W. Schuller"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.17020",
    "title": "Logit Normalization for Long-tail Object Detection",
    "abstract": "Real-world data exhibiting skewed distributions pose a serious challenge to existing object detectors. Moreover, the samplers in detectors lead to shifted training label distributions, while the tremendous proportion of background to foreground samples severely harms foreground classification. To mitigate these issues, in this paper, we propose Logit Normalization (LogN), a simple technique to self-calibrate the classified logits of detectors in a similar way to batch normalization. In general, our LogN is training- and tuning-free (i.e. require no extra training and tuning process), model- and label distribution-agnostic (i.e. generalization to different kinds of detectors and datasets), and also plug-and-play (i.e. direct application without any bells and whistles). Extensive experiments on the LVIS dataset demonstrate superior performance of LogN to state-of-the-art methods with various detectors and backbones. We also provide in-depth studies on different aspects of our LogN. Further experiments on ImageNet-LT reveal its competitiveness and generalizability. Our LogN can serve as a strong baseline for long-tail object detection and is expected to inspire future research in this field. Code and trained models will be publicly available at https://github.com/MCG-NJU/LogN. ",
    "url": "https://arxiv.org/abs/2203.17020",
    "authors": [
      "Liang Zhao",
      "Yao Teng",
      "Limin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.17045",
    "title": "Wasserstein Distributionally Robust Control of Partially Observable  Linear Systems: Tractable Approximation and Performance Guarantee",
    "abstract": "Wasserstein distributionally robust control (WDRC) is an effective method for addressing inaccurate distribution information about disturbances in stochastic systems. It provides various salient features, such as an out-of-sample performance guarantee, while most of existing methods use full-state observations. In this paper, we develop a computationally tractable WDRC method for discrete-time partially observable linear-quadratic (LQ) control problems. The key idea is to reformulate the WDRC problem as a novel minimax control problem with an approximate Wasserstein penalty. We derive a closed-form expression of the optimal solution to the approximate problem using a nontrivial Riccati equation. We further show the guaranteed cost property of the resulting controller and identify a provable bound for the optimality gap. Finally, we evaluate the performance of our method through numerical experiments using both Gaussian and non-Gaussian disturbances. ",
    "url": "https://arxiv.org/abs/2203.17045",
    "authors": [
      "Astghik Hakobyan",
      "Insoon Yang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.17054",
    "title": "BEVDet4D: Exploit Temporal Cues in Multi-camera 3D Object Detection",
    "abstract": "Single frame data contains finite information which limits the performance of the existing vision-based multi-camera 3D object detection paradigms. For fundamentally pushing the performance boundary in this area, BEVDet4D is proposed to lift the scalable BEVDet paradigm from the spatial-only 3D space to the spatial-temporal 4D space. We upgrade the framework with a few modifications just for fusing the feature from the previous frame with the corresponding one in the current frame. In this way, with negligible extra computing budget, we enable the algorithm to access the temporal cues by querying and comparing the two candidate features. Beyond this, we also simplify the velocity learning task by removing the factors of ego-motion and time, which equips BEVDet4D with robust generalization performance and reduces the velocity error by 52.8%. This makes vision-based methods, for the first time, become comparable with those relied on LiDAR or radar in this aspect. On challenge benchmark nuScenes, we report a new record of 51.5% NDS with the high-performance configuration dubbed BEVDet4D-Base, which surpasses the previous leading method BEVDet by +4.3% NDS. ",
    "url": "https://arxiv.org/abs/2203.17054",
    "authors": [
      "Junjie Huang",
      "Guan Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.17055",
    "title": "Certified machine learning: A posteriori error estimation for  physics-informed neural networks",
    "abstract": "Physics-informed neural networks (PINNs) are one popular approach to introduce a priori knowledge about physical systems into the learning framework. PINNs are known to be robust for smaller training sets, derive better generalization problems, and are faster to train. In this paper, we show that using PINNs in comparison with purely data-driven neural networks is not only favorable for training performance but allows us to extract significant information on the quality of the approximated solution. Assuming that the underlying differential equation for the PINN training is an ordinary differential equation, we derive a rigorous upper limit on the PINN prediction error. This bound is applicable even for input data not included in the training phase and without any prior knowledge about the true solution. Therefore, our a posteriori error estimation is an essential step to certify the PINN. We apply our error estimator exemplarily to two academic toy problems, whereof one falls in the category of model-predictive control and thereby shows the practical use of the derived results. ",
    "url": "https://arxiv.org/abs/2203.17055",
    "authors": [
      "Birgit Hillebrecht",
      "Benjamin Unger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2203.17072",
    "title": "Manipulation of oral cancer speech using neural articulatory synthesis",
    "abstract": "We present an articulatory synthesis framework for the synthesis and manipulation of oral cancer speech for clinical decision making and alleviation of patient stress. Objective and subjective evaluations demonstrate that the framework has acceptable naturalness and is worth further investigation. A subsequent subjective vowel and consonant identification experiment showed that the articulatory synthesis system can manipulate the articulatory trajectories so that the synthesised speech reproduces problems present in the ground truth oral cancer speech. ",
    "url": "https://arxiv.org/abs/2203.17072",
    "authors": [
      "Bence Mark Halpern",
      "Teja Rebernik",
      "Thomas Tienkamp",
      "Rob van Son",
      "Michiel van den Brekel",
      "Martijn Wieling",
      "Max Witjes",
      "Odette Scharenborg"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.17076",
    "title": "Deep Hyperspectral Unmixing using Transformer Network",
    "abstract": "Currently, this paper is under review in IEEE. Transformers have intrigued the vision research community with their state-of-the-art performance in natural language processing. With their superior performance, transformers have found their way in the field of hyperspectral image classification and achieved promising results. In this article, we harness the power of transformers to conquer the task of hyperspectral unmixing and propose a novel deep unmixing model with transformers. We aim to utilize the ability of transformers to better capture the global feature dependencies in order to enhance the quality of the endmember spectra and the abundance maps. The proposed model is a combination of a convolutional autoencoder and a transformer. The hyperspectral data is encoded by the convolutional encoder. The transformer captures long-range dependencies between the representations derived from the encoder. The data are reconstructed using a convolutional decoder. We applied the proposed unmixing model to three widely used unmixing datasets, i.e., Samson, Apex, and Washington DC mall and compared it with the state-of-the-art in terms of root mean squared error and spectral angle distance. The source code for the proposed model will be made publicly available at \\url{https://github.com/preetam22n/DeepTrans-HSU}. ",
    "url": "https://arxiv.org/abs/2203.17076",
    "authors": [
      "Preetam Ghosh",
      "Swalpa Kumar Roy",
      "Bikram Koirala",
      "Behnood Rasti",
      "Paul Scheunders"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.17085",
    "title": "RobIn: A Robust Interpretable Deep Network for Schizophrenia Diagnosis",
    "abstract": "Schizophrenia is a severe mental health condition that requires a long and complicated diagnostic process. However, early diagnosis is vital to control symptoms. Deep learning has recently become a popular way to analyse and interpret medical data. Past attempts to use deep learning for schizophrenia diagnosis from brain-imaging data have shown promise but suffer from a large training-application gap - it is difficult to apply lab research to the real world. We propose to reduce this training-application gap by focusing on readily accessible data. We collect a data set of psychiatric observations of patients based on DSM-5 criteria. Because similar data is already recorded in all mental health clinics that diagnose schizophrenia using DSM-5, our method could be easily integrated into current processes as a tool to assist clinicians, whilst abiding by formal diagnostic criteria. To facilitate real-world usage of our system, we show that it is interpretable and robust. Understanding how a machine learning tool reaches its diagnosis is essential to allow clinicians to trust that diagnosis. To interpret the framework, we fuse two complementary attention mechanisms, 'squeeze and excitation' and 'self-attention', to determine global attribute importance and attribute interactivity, respectively. The model uses these importance scores to make decisions. This allows clinicians to understand how a diagnosis was reached, improving trust in the model. Because machine learning models often struggle to generalise to data from different sources, we perform experiments with augmented test data to evaluate the model's applicability to the real world. We find that our model is more robust to perturbations, and should therefore perform better in a clinical setting. It achieves 98% accuracy with 10-fold cross-validation. ",
    "url": "https://arxiv.org/abs/2203.17085",
    "authors": [
      "Daniel Organisciak",
      "Hubert P. H. Shum",
      "Ephraim Nwoye",
      "Wai Lok Woo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.17096",
    "title": "Sensor Deception Attacks Against Initial-State Privacy in Supervisory  Control Systems",
    "abstract": "This paper investigates the problem of synthesizing sensor deception attackers against privacy in the context of supervisory control of discrete-event systems (DES). We consider a DES plant controlled by a supervisor, which is subject to sensor deception attacks. Specifically, we consider an active attacker that can tamper with the observations received by the supervisor by, e.g., hacking on the communication channel between the sensors and the supervisor. The privacy requirement of the supervisory control system is to maintain initial-state opacity, i.e., it does not want to reveal the fact that it was initiated from a secret state during its operation. On the other hand, the attacker aims to deceive the supervisor, by tampering with its observations, such that initial-state opacity is violated due to incorrect control actions. In this work, we investigate from the attacker's point of view by presenting an effective approach for synthesizing sensor attack strategies threatening the privacy of the system. To this end, we propose the All Attack Structure (AAS) that records state estimates for both the supervisor and the attacker. This structure serves as a basis for synthesizing a sensor attack strategy. We also discuss how to simplify the synthesis complexity by leveraging the structural property of the initial-state privacy requirement. A running academic example is provided to illustrate the synthesis procedure. ",
    "url": "https://arxiv.org/abs/2203.17096",
    "authors": [
      "Jingshi Yao",
      "Xiang Yin",
      "Shaoyuan Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.17106",
    "title": "A Cooperative Optimal Control Framework for Connected and Automated  Vehicles in Mixed Traffic Using Social Value Orientation",
    "abstract": "In this paper, we develop a socially cooperative optimal control framework for connected and automated vehicles (CAVs) in mixed traffic using social value orientation (SVO). In our approach, we formulate the interaction between a CAV and a human-driven vehicle (HDV) as a simultaneous game to facilitate the derivation of a Nash equilibrium. In the imposed game, each vehicle minimizes a weighted sum of its egoistic objective and a cooperative objective. The SVO angles are used to quantify preferences of the vehicles toward the egoistic and cooperative objectives which lead to an appropriate design of weighting factors in a multi-objective optimal control problem. We prove that by solving the proposed optimal control problem, a Nash equilibrium can be obtained. To estimate the SVO angle of the HDV, we develop a receding horizon estimation based on maximum entropy inverse reinforcement learning. The effectiveness of the proposed approach is demonstrated by numerical simulations at a highway on-ramp merging scenario. ",
    "url": "https://arxiv.org/abs/2203.17106",
    "authors": [
      "Viet-Anh Le",
      "Andreas A. Malikopoulos"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.17109",
    "title": "A Rich Recipe Representation as Plan to Support Expressive Multi Modal  Queries on Recipe Content and Preparation Process",
    "abstract": "Food is not only a basic human necessity but also a key factor driving a society's health and economic well-being. As a result, the cooking domain is a popular use-case to demonstrate decision-support (AI) capabilities in service of benefits like precision health with tools ranging from information retrieval interfaces to task-oriented chatbots. An AI here should understand concepts in the food domain (e.g., recipes, ingredients), be tolerant to failures encountered while cooking (e.g., browning of butter), handle allergy-based substitutions, and work with multiple data modalities (e.g. text and images). However, the recipes today are handled as textual documents which makes it difficult for machines to read, reason and handle ambiguity. This demands a need for better representation of the recipes, overcoming the ambiguity and sparseness that exists in the current textual documents. In this paper, we discuss the construction of a machine-understandable rich recipe representation (R3), in the form of plans, from the recipes available in natural language. R3 is infused with additional knowledge such as information about allergens and images of ingredients, possible failures and tips for each atomic cooking step. To show the benefits of R3, we also present TREAT, a tool for recipe retrieval which uses R3 to perform multi-modal reasoning on the recipe's content (plan objects - ingredients and cooking tools), food preparation process (plan actions and time), and media type (image, text). R3 leads to improved retrieval efficiency and new capabilities that were hither-to not possible in textual representation. ",
    "url": "https://arxiv.org/abs/2203.17109",
    "authors": [
      "Vishal Pallagani",
      "Priyadharsini Ramamurthy",
      "Vedant Khandelwal",
      "Revathy Venkataramanan",
      "Kausik Lakkaraju",
      "Sathyanarayanan N. Aakur",
      "Biplav Srivastava"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.17110",
    "title": "Impact of Acoustic Noise on Alzheimer's Disease Detection from Speech:  Should You Let Baby Cry?",
    "abstract": "Research related to automatically detecting Alzheimer's disease (AD) is important, given the high prevalence of AD and the high cost of traditional methods. Since AD significantly affects the acoustics of spontaneous speech, speech processing and machine learning (ML) provide promising techniques for reliably detecting AD. However, speech audio may be affected by different types of background noise and it is important to understand how the noise influences the accuracy of ML models detecting AD from speech. In this paper, we study the effect of fifteen types of noise from five different categories on the performance of four ML models trained with three types of acoustic representations. We perform a thorough analysis showing how ML models and acoustic features are affected by different types of acoustic noise. We show that acoustic noise is not necessarily harmful - certain types of noise are beneficial for AD detection models and help increasing accuracy by up to 4.8\\%. We provide recommendations on how to utilize acoustic noise in order to achieve the best performance results with the ML models deployed in real world. ",
    "url": "https://arxiv.org/abs/2203.17110",
    "authors": [
      "Jekaterina Novikova"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.17128",
    "title": "Neural Q-learning for solving elliptic PDEs",
    "abstract": "Solving high-dimensional partial differential equations (PDEs) is a major challenge in scientific computing. We develop a new numerical method for solving elliptic-type PDEs by adapting the Q-learning algorithm in reinforcement learning. Our \"Q-PDE\" algorithm is mesh-free and therefore has the potential to overcome the curse of dimensionality. Using a neural tangent kernel (NTK) approach, we prove that the neural network approximator for the PDE solution, trained with the Q-PDE algorithm, converges to the trajectory of an infinite-dimensional ordinary differential equation (ODE) as the number of hidden units $\\rightarrow \\infty$. For monotone PDE (i.e. those given by monotone operators, which may be nonlinear), despite the lack of a spectral gap in the NTK, we then prove that the limit neural network, which satisfies the infinite-dimensional ODE, converges in $L^2$ to the PDE solution as the training time $\\rightarrow \\infty$. More generally, we can prove that any fixed point of the wide-network limit for the Q-PDE algorithm is a solution of the PDE (not necessarily under the monotone condition). The numerical performance of the Q-PDE algorithm is studied for several elliptic PDEs. ",
    "url": "https://arxiv.org/abs/2203.17128",
    "authors": [
      "Samuel N. Cohen",
      "Deqing Jiang",
      "Justin Sirignano"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)",
      "Analysis of PDEs (math.AP)",
      "Probability (math.PR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.17132",
    "title": "Finding Balance-Fair Short Paths in Graphs",
    "abstract": "The computation of short paths in graphs with edge lengths is a pillar of graph algorithmics and network science. In a more diverse world, however, not every short path is equally valuable. We contribute to a broader view on path finding by injecting a natural fairness aspect. Our fairness notion relates to vertex-colored graphs. Herein, we seek to find short paths where all colors should appear with roughly the same frequency. Among other results, we prove the introduced problems to be computationally hard (NP-hard and parameterized hard with respect to the number of colors), while also presenting an encouraging algorithmic result (\"fixed-parameter tractability\") related to the length of the sought solution path. ",
    "url": "https://arxiv.org/abs/2203.17132",
    "authors": [
      "Matthias Bentert",
      "Leon Kellerhals",
      "Rolf Niedermeier"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2203.17149",
    "title": "AEGNN: Asynchronous Event-based Graph Neural Networks",
    "abstract": "The best performing learning algorithms devised for event cameras work by first converting events into dense representations that are then processed using standard CNNs. However, these steps discard both the sparsity and high temporal resolution of events, leading to high computational burden and latency. For this reason, recent works have adopted Graph Neural Networks (GNNs), which process events as \"static\" spatio-temporal graphs, which are inherently \"sparse\". We take this trend one step further by introducing Asynchronous, Event-based Graph Neural Networks (AEGNNs), a novel event-processing paradigm that generalizes standard GNNs to process events as \"evolving\" spatio-temporal graphs. AEGNNs follow efficient update rules that restrict recomputation of network activations only to the nodes affected by each new event, thereby significantly reducing both computation and latency for event-by-event processing. AEGNNs are easily trained on synchronous inputs and can be converted to efficient, \"asynchronous\" networks at test time. We thoroughly validate our method on object classification and detection tasks, where we show an up to a 200-fold reduction in computational complexity (FLOPs), with similar or even better performance than state-of-the-art asynchronous methods. This reduction in computation directly translates to an 8-fold reduction in computational latency when compared to standard GNNs, which opens the door to low-latency event-based processing. ",
    "url": "https://arxiv.org/abs/2203.17149",
    "authors": [
      "Simon Schaefer",
      "Daniel Gehrig",
      "Davide Scaramuzza"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.17156",
    "title": "Adaptive Mean-Residue Loss for Robust Facial Age Estimation",
    "abstract": "Automated facial age estimation has diverse real-world applications in multimedia analysis, e.g., video surveillance, and human-computer interaction. However, due to the randomness and ambiguity of the aging process, age assessment is challenging. Most research work over the topic regards the task as one of age regression, classification, and ranking problems, and cannot well leverage age distribution in representing labels with age ambiguity. In this work, we propose a simple yet effective loss function for robust facial age estimation via distribution learning, i.e., adaptive mean-residue loss, in which, the mean loss penalizes the difference between the estimated age distribution's mean and the ground-truth age, whereas the residue loss penalizes the entropy of age probability out of dynamic top-K in the distribution. Experimental results in the datasets FG-NET and CLAP2016 have validated the effectiveness of the proposed loss. Our code is available at https://github.com/jacobzhaoziyuan/AMR-Loss. ",
    "url": "https://arxiv.org/abs/2203.17156",
    "authors": [
      "Ziyuan Zhao",
      "Peisheng Qian",
      "Yubo Hou",
      "Zeng Zeng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.17159",
    "title": "Preventing Over-Smoothing for Hypergraph Neural Networks",
    "abstract": "In recent years, hypergraph learning has attracted great attention due to its capacity in representing complex and high-order relationships. However, current neural network approaches designed for hypergraphs are mostly shallow, thus limiting their ability to extract information from high-order neighbors. In this paper, we show both theoretically and empirically, that the performance of hypergraph neural networks does not improve as the number of layers increases, which is known as the over-smoothing problem. To tackle this issue, we develop a new deep hypergraph convolutional network called Deep-HGCN, which can maintain the heterogeneity of node representation in deep layers. Specifically, we prove that a $k$-layer Deep-HGCN simulates a polynomial filter of order $k$ with arbitrary coefficients, which can relieve the problem of over-smoothing. Experimental results on various datasets demonstrate the superior performance of the proposed model comparing to the state-of-the-art hypergraph learning approaches. ",
    "url": "https://arxiv.org/abs/2203.17159",
    "authors": [
      "Guanzi Chen",
      "Jiying Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.17178",
    "title": "3D Equivariant Graph Implicit Functions",
    "abstract": "In recent years, neural implicit representations have made remarkable progress in modeling of 3D shapes with arbitrary topology. In this work, we address two key limitations of such representations, in failing to capture local 3D geometric fine details, and to learn from and generalize to shapes with unseen 3D transformations. To this end, we introduce a novel family of graph implicit functions with equivariant layers that facilitates modeling fine local details and guaranteed robustness to various groups of geometric transformations, through local $k$-NN graph embeddings with sparse point set observations at multiple resolutions. Our method improves over the existing rotation-equivariant implicit function from 0.69 to 0.89 (IoU) on the ShapeNet reconstruction task. We also show that our equivariant implicit function can be extended to other types of similarity transformations and generalizes to unseen translations and scaling. ",
    "url": "https://arxiv.org/abs/2203.17178",
    "authors": [
      "Yunlu Chen",
      "Basura Fernando",
      "Hakan Bilen",
      "Matthias Nießner",
      "Efstratios Gavves"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.17205",
    "title": "Leverage Your Local and Global Representations: A New Self-Supervised  Learning Strategy",
    "abstract": "Self-supervised learning (SSL) methods aim to learn view-invariant representations by maximizing the similarity between the features extracted from different crops of the same image regardless of cropping size and content. In essence, this strategy ignores the fact that two crops may truly contain different image information, e.g., background and small objects, and thus tends to restrain the diversity of the learned representations. %To this end, the existing strategies typically employ loss functions that enforces the networks to discard part of valuable information, e.g. background and small objects, and sacrifices the diversity of representation. In this work, we address this issue by introducing a new self-supervised learning strategy, LoGo, that explicitly reasons about {\\bf Lo}cal and {\\bf G}l{\\bf o}bal crops. To achieve view invariance, LoGo encourages similarity between global crops from the same image, as well as between a global and a local crop. However, to correctly encode the fact that the content of smaller crops may differ entirely, LoGo promotes two local crops to have dissimilar representations, while being close to global crops. Our LoGo strategy can easily be applied to existing SSL methods. Our extensive experiments on a variety of datasets and using different self-supervised learning frameworks validate its superiority over existing approaches. Noticeably, we achieve better results than supervised models on transfer learning when using only $1/10$ of the data. ",
    "url": "https://arxiv.org/abs/2203.17205",
    "authors": [
      "Tong Zhang",
      "Congpei Qiu",
      "Wei Ke",
      "Sabine Süsstrunk",
      "Mathieu Salzmann"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.17209",
    "title": "Adversarial Examples in Random Neural Networks with General Activations",
    "abstract": "A substantial body of empirical work documents the lack of robustness in deep learning models to adversarial examples. Recent theoretical work proved that adversarial examples are ubiquitous in two-layers networks with sub-exponential width and ReLU or smooth activations, and multi-layer ReLU networks with sub-exponential width. We present a result of the same type, with no restriction on width and for general locally Lipschitz continuous activations. More precisely, given a neural network $f(\\,\\cdot\\,;{\\boldsymbol \\theta})$ with random weights ${\\boldsymbol \\theta}$, and feature vector ${\\boldsymbol x}$, we show that an adversarial example ${\\boldsymbol x}'$ can be found with high probability along the direction of the gradient $\\nabla_{{\\boldsymbol x}}f({\\boldsymbol x};{\\boldsymbol \\theta})$. Our proof is based on a Gaussian conditioning technique. Instead of proving that $f$ is approximately linear in a neighborhood of ${\\boldsymbol x}$, we characterize the joint distribution of $f({\\boldsymbol x};{\\boldsymbol \\theta})$ and $f({\\boldsymbol x}';{\\boldsymbol \\theta})$ for ${\\boldsymbol x}' = {\\boldsymbol x}-s({\\boldsymbol x})\\nabla_{{\\boldsymbol x}}f({\\boldsymbol x};{\\boldsymbol \\theta})$. ",
    "url": "https://arxiv.org/abs/2203.17209",
    "authors": [
      "Andrea Montanari",
      "Yuchen Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2203.17234",
    "title": "Templates for 3D Object Pose Estimation Revisited: Generalization to New  Objects and Robustness to Occlusions",
    "abstract": "We present a method that can recognize new objects and estimate their 3D pose in RGB images even under partial occlusions. Our method requires neither a training phase on these objects nor real images depicting them, only their CAD models. It relies on a small set of training objects to learn local object representations, which allow us to locally match the input image to a set of \"templates\", rendered images of the CAD models for the new objects. In contrast with the state-of-the-art methods, the new objects on which our method is applied can be very different from the training objects. As a result, we are the first to show generalization without retraining on the LINEMOD and Occlusion-LINEMOD datasets. Our analysis of the failure modes of previous template-based approaches further confirms the benefits of local features for template matching. We outperform the state-of-the-art template matching methods on the LINEMOD, Occlusion-LINEMOD and T-LESS datasets. Our source code and data are publicly available at https://github.com/nv-nguyen/template-pose ",
    "url": "https://arxiv.org/abs/2203.17234",
    "authors": [
      "Van Nguyen Nguyen",
      "Yinlin Hu",
      "Yang Xiao",
      "Mathieu Salzmann",
      "Vincent Lepetit"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.17240",
    "title": "ImpDet: Exploring Implicit Fields for 3D Object Detection",
    "abstract": "Conventional 3D object detection approaches concentrate on bounding boxes representation learning with several parameters, i.e., localization, dimension, and orientation. Despite its popularity and universality, such a straightforward paradigm is sensitive to slight numerical deviations, especially in localization. By exploiting the property that point clouds are naturally captured on the surface of objects along with accurate location and intensity information, we introduce a new perspective that views bounding box regression as an implicit function. This leads to our proposed framework, termed Implicit Detection or ImpDet, which leverages implicit field learning for 3D object detection. Our ImpDet assigns specific values to points in different local 3D spaces, thereby high-quality boundaries can be generated by classifying points inside or outside the boundary. To solve the problem of sparsity on the object surface, we further present a simple yet efficient virtual sampling strategy to not only fill the empty region, but also learn rich semantic features to help refine the boundaries. Extensive experimental results on KITTI and Waymo benchmarks demonstrate the effectiveness and robustness of unifying implicit fields into object detection. ",
    "url": "https://arxiv.org/abs/2203.17240",
    "authors": [
      "Xuelin Qian",
      "Li Wang",
      "Yi Zhu",
      "Li Zhang",
      "Yanwei Fu",
      "Xiangyang Xue"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.17242",
    "title": "Automatic Detection of Expressed Emotion from Five-Minute Speech  Samples: Challenges and Opportunities",
    "abstract": "We present a novel feasibility study on the automatic recognition of Expressed Emotion (EE), a family environment concept based on caregivers speaking freely about their relative/family member. We describe an automated approach for determining the \\textit{degree of warmth}, a key component of EE, from acoustic and text features acquired from a sample of 37 recorded interviews. These recordings, collected over 20 years ago, are derived from a nationally representative birth cohort of 2,232 British twin children and were manually coded for EE. We outline the core steps of extracting usable information from recordings with highly variable audio quality and assess the efficacy of four machine learning approaches trained with different combinations of acoustic and text features. Despite the challenges of working with this legacy data, we demonstrated that the degree of warmth can be predicted with an $F_{1}$-score of \\textbf{61.5\\%}. In this paper, we summarise our learning and provide recommendations for future work using real-world speech samples. ",
    "url": "https://arxiv.org/abs/2203.17242",
    "authors": [
      "Bahman Mirheidari",
      "André Bittar",
      "Nicholas Cummins",
      "Johnny Downs",
      "Helen L. Fisher",
      "Heidi Christensen"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.17256",
    "title": "LEAD1.0: A Large-scale Annotated Dataset for Energy Anomaly Detection in  Commercial Buildings",
    "abstract": "Modern buildings are densely equipped with smart energy meters, which periodically generate a massive amount of time-series data yielding few million data points every day. This data can be leveraged to discover the underlying loads, infer their energy consumption patterns, inter-dependencies on environmental factors, and the building's operational properties. Furthermore, it allows us to simultaneously identify anomalies present in the electricity consumption profiles, which is a big step towards saving energy and achieving global sustainability. However, to date, the lack of large-scale annotated energy consumption datasets hinders the ongoing research in anomaly detection. We contribute to this effort by releasing a well-annotated version of a publicly available ASHRAE Great Energy Predictor III data set containing 1,413 smart electricity meter time series spanning over one year. In addition, we benchmark the performance of eight state-of-the-art anomaly detection methods on our dataset and compare their performance. ",
    "url": "https://arxiv.org/abs/2203.17256",
    "authors": [
      "Manoj Gulati",
      "Pandarasamy Arjunan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.17261",
    "title": "R2L: Distilling Neural Radiance Field to Neural Light Field for  Efficient Novel View Synthesis",
    "abstract": "Recent research explosion on Neural Radiance Field (NeRF) shows the encouraging potential to represent complex scenes with neural networks. One major drawback of NeRF is its prohibitive inference time: Rendering a single pixel requires querying the NeRF network hundreds of times. To resolve it, existing efforts mainly attempt to reduce the number of required sampled points. However, the problem of iterative sampling still exists. On the other hand, Neural Light Field (NeLF) presents a more straightforward representation over NeRF in novel view synthesis -- the rendering of a pixel amounts to one single forward pass without ray-marching. In this work, we present a deep residual MLP network (88 layers) to effectively learn the light field. We show the key to successfully learning such a deep NeLF network is to have sufficient data, for which we transfer the knowledge from a pre-trained NeRF model via data distillation. Extensive experiments on both synthetic and real-world scenes show the merits of our method over other counterpart algorithms. On the synthetic scenes, we achieve 26-35x FLOPs reduction (per camera ray) and 28-31x runtime speedup, meanwhile delivering significantly better (1.4-2.8 dB average PSNR improvement) rendering quality than NeRF without any customized implementation tricks. ",
    "url": "https://arxiv.org/abs/2203.17261",
    "authors": [
      "Huan Wang",
      "Jian Ren",
      "Zeng Huang",
      "Kyle Olszewski",
      "Menglei Chai",
      "Yun Fu",
      "Sergey Tulyakov"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.17270",
    "title": "BEVFormer: Learning Bird's-Eye-View Representation from Multi-Camera  Images via Spatiotemporal Transformers",
    "abstract": "3D visual perception tasks, including 3D detection and map segmentation based on multi-camera images, are essential for autonomous driving systems. In this work, we present a new framework termed BEVFormer, which learns unified BEV representations with spatiotemporal transformers to support multiple autonomous driving perception tasks. In a nutshell, BEVFormer exploits both spatial and temporal information by interacting with spatial and temporal space through predefined grid-shaped BEV queries. To aggregate spatial information, we design a spatial cross-attention that each BEV query extracts the spatial features from the regions of interest across camera views. For temporal information, we propose a temporal self-attention to recurrently fuse the history BEV information. Our approach achieves the new state-of-the-art 56.9\\% in terms of NDS metric on the nuScenes test set, which is 9.0 points higher than previous best arts and on par with the performance of LiDAR-based baselines. We further show that BEVFormer remarkably improves the accuracy of velocity estimation and recall of objects under low visibility conditions. The code will be released at https://github.com/zhiqi-li/BEVFormer. ",
    "url": "https://arxiv.org/abs/2203.17270",
    "authors": [
      "Zhiqi Li",
      "Wenhai Wang",
      "Hongyang Li",
      "Enze Xie",
      "Chonghao Sima",
      "Tong Lu",
      "Qiao Yu",
      "Jifeng Dai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.03379",
    "title": "Application of Ghost-DeblurGAN to Fiducial Marker Detection",
    "abstract": "Feature extraction or localization based on the fiducial marker could fail due to motion blur in real-world robotic applications. To solve this problem, a lightweight generative adversarial network, named Ghost-DeblurGAN, for real-time motion deblurring is developed in this paper. Furthermore, on account that there is no existing deblurring benchmark for such task, a new large-scale dataset, YorkTag, is proposed that provides pairs of sharp/blurred images containing fiducial markers. With the proposed model trained and tested on YorkTag, it is demonstrated that when applied along with fiducial marker systems to motion-blurred images, Ghost-DeblurGAN improves the marker detection significantly. The datasets and codes used in this paper are available at: https://github.com/York-SDCNLab/Ghost-DeblurGAN. ",
    "url": "https://arxiv.org/abs/2109.03379",
    "authors": [
      "Yibo Liu",
      "Amaldev Haridevan",
      "Hunter Schofield",
      "Jinjun Shan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.15937",
    "title": "Improving Mispronunciation Detection with Wav2vec2-based Momentum  Pseudo-Labeling for Accentedness and Intelligibility Assessment",
    "abstract": "Current leading mispronunciation detection and diagnosis (MDD) systems achieve promising performance via end-to-end phoneme recognition. One challenge of such end-to-end solutions is the scarcity of human-annotated phonemes on natural L2 speech. In this work, we leverage unlabeled L2 speech via a pseudo-labeling (PL) procedure and extend the fine-tuning approach based on pre-trained self-supervised learning (SSL) models. Specifically, we use Wav2vec 2.0 as our SSL model, and fine-tune it using original labeled L2 speech samples plus the created pseudo-labeled L2 speech samples. Our pseudo labels are dynamic and are produced by an ensemble of the online model on-the-fly, which ensures that our model is robust to pseudo label noise. We show that fine-tuning with pseudo labels gains a 5.35% phoneme error rate reduction and 2.48% MDD F1 score improvement over a labeled-samples-only fine-tuning baseline. The proposed PL method is also shown to outperform conventional offline PL methods. Compared to the state-of-the-art MDD systems, our MDD solution achieves a more accurate and consistent phonetic error diagnosis. In addition, we conduct an open test on a separate UTD-4Accents dataset, where our system recognition outputs show a strong correlation with human perception, based on accentedness and intelligibility. ",
    "url": "https://arxiv.org/abs/2203.15937",
    "authors": [
      "Mu Yang",
      "Kevin Hirschi",
      "Stephen D. Looney",
      "Okim Kang",
      "John H. L. Hansen"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16587",
    "title": "Spatially Adaptive Online Prediction of Piecewise Regular Functions",
    "abstract": "We consider the problem of estimating piecewise regular functions in an online setting, i.e., the data arrive sequentially and at any round our task is to predict the value of the true function at the next revealed point using the available data from past predictions. We propose a suitably modified version of a recently developed online learning algorithm called the sleeping experts aggregation algorithm. We show that this estimator satisfies oracle risk bounds simultaneously for all local regions of the domain. As concrete instantiations of the expert aggregation algorithm proposed here, we study an online mean aggregation and an online linear regression aggregation algorithm where experts correspond to the set of dyadic subrectangles of the domain. The resulting algorithms are near linear time computable in the sample size. We specifically focus on the performance of these online algorithms in the context of estimating piecewise polynomial and bounded variation function classes in the fixed design setup. The simultaneous oracle risk bounds we obtain for these estimators in this context provide new and improved (in certain aspects) guarantees even in the batch setting and are not available for the state of the art batch learning estimators. ",
    "url": "https://arxiv.org/abs/2203.16587",
    "authors": [
      "Sabyasachi Chatterjee",
      "Subhajit Goswami"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.16606",
    "title": "Enhancing Cancer Prediction in Challenging Screen-Detected Incident Lung  Nodules Using Time-Series Deep Learning",
    "abstract": "Lung cancer is the leading cause of cancer-related mortality worldwide. Lung cancer screening (LCS) using annual low-dose computed tomography (CT) scanning has been proven to significantly reduce lung cancer mortality by detecting cancerous lung nodules at an earlier stage. Improving risk stratification of malignancy risk in lung nodules can be enhanced using machine/deep learning algorithms. However most existing algorithms: a) have primarily assessed single time-point CT data alone thereby failing to utilize the inherent advantages contained within longitudinal imaging datasets; b) have not integrated into computer models pertinent clinical data that might inform risk prediction; c) have not assessed algorithm performance on the spectrum of nodules that are most challenging for radiologists to interpret and where assistance from analytic tools would be most beneficial. Here we show the performance of our time-series deep learning model (DeepCAD-NLM-L) which integrates multi-model information across three longitudinal data domains: nodule-specific, lung-specific, and clinical demographic data. We compared our time-series deep learning model to a) radiologist performance on CTs from the National Lung Screening Trial enriched with the most challenging nodules for diagnosis; b) a nodule management algorithm from a North London LCS study (SUMMIT). Our model demonstrated comparable and complementary performance to radiologists when interpreting challenging lung nodules and showed improved performance (AUC=88\\%) against models utilizing single time-point data only. The results emphasise the importance of time-series, multi-modal analysis when interpreting malignancy risk in LCS. ",
    "url": "https://arxiv.org/abs/2203.16606",
    "authors": [
      "Shahab Aslani",
      "Pavan Alluri",
      "Eyjolfur Gudmundsson",
      "Edward Chandy",
      "John McCabe",
      "Anand Devaraj",
      "Carolyn Horst",
      "Sam M Janes",
      "Rahul Chakkara",
      "Arjun Nair",
      "Daniel C Alexander",
      "SUMMIT consortium",
      "Joseph Jacob"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16642",
    "title": "Data-driven Prediction of Relevant Scenarios for Robust Optimization",
    "abstract": "In this work we study robust one- and two-stage problems with discrete uncertainty sets which are known to be hard to solve even if the underlying deterministic problem is easy. Popular solution methods iteratively generate scenario constraints and possibly second-stage variables. This way, by solving a sequence of smaller problems, it is often possible to avoid the complexity of considering all scenarios simultaneously. A key ingredient for the performance of the iterative methods is a good selection of start scenarios. In this paper we propose a data-driven heuristic to seed the iterative solution method with a set of starting scenarios that provide a strong lower bound early in the process, and result in considerably smaller overall solution times compared to other benchmark methods. Our heuristic learns the relevance of a scenario by extracting information from training data based on a combined similarity measure between robust problem instances and single scenarios. Our experiments show that predicting even a small number of good start scenarios by our method can considerably reduce the computation time of the iterative methods. ",
    "url": "https://arxiv.org/abs/2203.16642",
    "authors": [
      "Marc Goerigk",
      "Jannis Kurtz"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16662",
    "title": "Challenges in leveraging GANs for few-shot data augmentation",
    "abstract": "In this paper, we explore the use of GAN-based few-shot data augmentation as a method to improve few-shot classification performance. We perform an exploration into how a GAN can be fine-tuned for such a task (one of which is in a class-incremental manner), as well as a rigorous empirical investigation into how well these models can perform to improve few-shot classification. We identify issues related to the difficulty of training such generative models under a purely supervised regime with very few examples, as well as issues regarding the evaluation protocols of existing works. We also find that in this regime, classification accuracy is highly sensitive to how the classes of the dataset are randomly split. Therefore, we propose a semi-supervised fine-tuning approach as a more pragmatic way forward to address these problems. ",
    "url": "https://arxiv.org/abs/2203.16662",
    "authors": [
      "Christopher Beckham",
      "Issam Laradji",
      "Pau Rodriguez",
      "David Vazquez",
      "Derek Nowrouzezahrai",
      "Christopher Pal"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16705",
    "title": "Robust Disentangled Variational Speech Representation Learning for  Zero-shot Voice Conversion",
    "abstract": "Traditional studies on voice conversion (VC) have made progress with parallel training data and known speakers. Good voice conversion quality is obtained by exploring better alignment modules or expressive mapping functions. In this study, we investigate zero-shot VC from a novel perspective of self-supervised disentangled speech representation learning. Specifically, we achieve the disentanglement by balancing the information flow between global speaker representation and time-varying content representation in a sequential variational autoencoder (VAE). A zero-shot voice conversion is performed by feeding an arbitrary speaker embedding and content embeddings to the VAE decoder. Besides that, an on-the-fly data augmentation training strategy is applied to make the learned representation noise invariant. On TIMIT and VCTK datasets, we achieve state-of-the-art performance on both objective evaluation, i.e., speaker verification (SV) on speaker embedding and content embedding, and subjective evaluation, i.e., voice naturalness and similarity, and remains to be robust even with noisy source/target utterances. ",
    "url": "https://arxiv.org/abs/2203.16705",
    "authors": [
      "Jiachen Lian",
      "Chunlei Zhang",
      "Dong Yu"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.16711",
    "title": "An analytic theory for the dynamics of wide quantum neural networks",
    "abstract": "Parametrized quantum circuits can be used as quantum neural networks and have the potential to outperform their classical counterparts when trained for addressing learning problems. To date, much of the results on their performance on practical problems are heuristic in nature. In particular, the convergence rate for the training of quantum neural networks is not fully understood. Here, we analyze the dynamics of gradient descent for the training error of a class of variational quantum machine learning models. We define wide quantum neural networks as parameterized quantum circuits in the limit of a large number of qubits and variational parameters. We then find a simple analytic formula that captures the average behavior of their loss function and discuss the consequences of our findings. For example, for random quantum circuits, we predict and characterize an exponential decay of the residual training error as a function of the parameters of the system. We finally validate our analytic results with numerical experiments. ",
    "url": "https://arxiv.org/abs/2203.16711",
    "authors": [
      "Junyu Liu",
      "Khadijeh Najafi",
      "Kunal Sharma",
      "Francesco Tacchino",
      "Liang Jiang",
      "Antonio Mezzacapo"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.16749",
    "title": "SpecGrad: Diffusion Probabilistic Model based Neural Vocoder with  Adaptive Noise Spectral Shaping",
    "abstract": "Neural vocoder using denoising diffusion probabilistic model (DDPM) has been improved by adaptation of the diffusion noise distribution to given acoustic features. In this study, we propose SpecGrad that adapts the diffusion noise so that its time-varying spectral envelope becomes close to the conditioning log-mel spectrogram. This adaptation by time-varying filtering improves the sound quality especially in the high-frequency bands. It is processed in the time-frequency domain to keep the computational cost almost the same as the conventional DDPM-based neural vocoders. Experimental results showed that SpecGrad generates higher-fidelity speech waveform than conventional DDPM-based neural vocoders in both analysis-synthesis and speech enhancement scenarios. Audio demos are available at wavegrad.github.io/specgrad/. ",
    "url": "https://arxiv.org/abs/2203.16749",
    "authors": [
      "Yuma Koizumi",
      "Heiga Zen",
      "Kohei Yatabe",
      "Nanxin Chen",
      "Michiel Bacchiani"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.16805",
    "title": "Minimum Roman Dominating Distance Energy of a Graph",
    "abstract": "In this correspondence, we introduced the concept of minimum roman dominating distance energy $E_{RDd}(G)$ of a graph $G$ and computed minimum roman dominating distance energy of some standard graphs. Also, we discussed the properties of eigenvalues of a minimum roman dominating distance matrix $A_{RDd}(G).$ Finally, we derived the Upper and lower bounds for $E_{RDd}(G).$ ",
    "url": "https://arxiv.org/abs/2203.16805",
    "authors": [
      "Lakshmanan R",
      "N. Annamalai"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2203.16861",
    "title": "On Reconfiguration Graph of Independent Sets under Token Sliding",
    "abstract": "An independent set of a graph $G$ is a vertex subset $I$ such that there is no edge joining any two vertices in $I$. Imagine that a token is placed on each vertex of an independent set of $G$. The $\\mathsf{TS}$- ($\\mathsf{TS}_k$-) reconfiguration graph of $G$ takes all non-empty independent sets (of size $k$) as its nodes, where $k$ is some given positive integer. Two nodes are adjacent if one can be obtained from the other by sliding a token on some vertex to one of its unoccupied neighbors. This paper focuses on the structure and realizability of these reconfiguration graphs. More precisely, we study two main questions for a given graph $G$: (1) Whether the $\\mathsf{TS}_k$-reconfiguration graph of $G$ belongs to some graph class $\\mathcal{G}$ (including complete graphs, paths, cycles, complete bipartite graphs, and connected split graphs) and (2) If $G$ satisfies some property $\\mathcal{P}$ (including $s$-partitedness, planarity, Eulerianity, girth, and the clique's size), whether the corresponding $\\mathsf{TS}$- ($\\mathsf{TS}_k$-) reconfiguration graph of $G$ also satisfies $\\mathcal{P}$, and vice versa. ",
    "url": "https://arxiv.org/abs/2203.16861",
    "authors": [
      "David Avis",
      "Duc A. Hoang"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2203.16900",
    "title": "Transducing paths in graph classes with unbounded shrubdepth",
    "abstract": "Transductions are a general formalism for expressing transformations of graphs (and more generally, of relational structures) in logic. We prove that a graph class $\\mathscr{C}$ can be $\\mathsf{FO}$-transduced from a class of bounded-height trees (that is, has bounded shrubdepth) if, and only if, from $\\mathscr{C}$ one cannot $\\mathsf{FO}$-transduce the class of all paths. This establishes one of the three remaining open questions posed by Blumensath and Courcelle about the $\\mathsf{MSO}$-transduction quasi-order, even in the stronger form that concerns $\\mathsf{FO}$-transductions instead of $\\mathsf{MSO}$-transductions. The backbone of our proof is a graph-theoretic statement that says the following: If a graph $G$ excludes a path, the bipartite complement of a path, and a half-graph as semi-induced subgraphs, then the vertex set of $G$ can be partitioned into a bounded number of parts so that every part induces a cograph of bounded height, and every pair of parts semi-induce a bi-cograph of bounded height. This statement may be of independent interest; for instance, it implies that the graphs in question form a class that is linearly $\\chi$-bounded. ",
    "url": "https://arxiv.org/abs/2203.16900",
    "authors": [
      "Michał Pilipczuk",
      "Patrice Ossona de Mendez",
      "Sebastian Siebertz"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Logic in Computer Science (cs.LO)",
      "Logic (math.LO)"
    ]
  },
  {
    "id": "arXiv:2203.17001",
    "title": "SingAug: Data Augmentation for Singing Voice Synthesis with  Cycle-consistent Training Strategy",
    "abstract": "Deep learning based singing voice synthesis (SVS) systems have been demonstrated to flexibly generate singing with better qualities, compared to conventional statistical parametric based methods. However, neural systems are generally data-hungry and have difficulty to reach reasonable singing quality with limited public available training data. In this work, we explore different data augmentation methods to boost the training of SVS systems, including several strategies customized to SVS based on pitch augmentation and mix-up augmentation. To further stabilize the training, we introduce the cycle-consistent training strategy. Extensive experiments on two public singing databases demonstrate that our proposed augmentation methods and the stabilizing training strategy can significantly improve the performance on both objective and subjective evaluations. ",
    "url": "https://arxiv.org/abs/2203.17001",
    "authors": [
      "Shuai Guo",
      "Jiatong Shi",
      "Tao Qian",
      "Shinji Watanabe",
      "Qin Jin"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2203.17004",
    "title": "Speech Enhancement with Score-Based Generative Models in the Complex  STFT Domain",
    "abstract": "Score-based generative models (SGMs) have recently shown impressive results for difficult generative tasks such as the unconditional and conditional generation of natural images and audio signals. In this work, we extend these models to the complex short-time Fourier transform (STFT) domain, proposing a novel training task for speech enhancement using a complex-valued deep neural network. We derive this training task within the formalism of stochastic differential equations, thereby enabling the use of predictor-corrector samplers. We provide alternative formulations inspired by previous publications on using SGMs for speech enhancement, avoiding the need for any prior assumptions on the noise distribution and making the training task purely generative which, as we show, results in improved enhancement performance. ",
    "url": "https://arxiv.org/abs/2203.17004",
    "authors": [
      "Simon Welker",
      "Julius Richter",
      "Timo Gerkmann"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2203.17019",
    "title": "DeepFry: Identifying Vocal Fry Using Deep Neural Networks",
    "abstract": "Vocal fry or creaky voice refers to a voice quality characterized by irregular glottal opening and low pitch. It occurs in diverse languages and is prevalent in American English, where it is used not only to mark phrase finality, but also sociolinguistic factors and affect. Due to its irregular periodicity, creaky voice challenges automatic speech processing and recognition systems, particularly for languages where creak is frequently used. This paper proposes a deep learning model to detect creaky voice in fluent speech. The model is composed of an encoder and a classifier trained together. The encoder takes the raw waveform and learns a representation using a convolutional neural network. The classifier is implemented as a multi-headed fully-connected network trained to detect creaky voice, voicing, and pitch, where the last two are used to refine creak prediction. The model is trained and tested on speech of American English speakers, annotated for creak by trained phoneticians. We evaluated the performance of our system using two encoders: one is tailored for the task, and the other is based on a state-of-the-art unsupervised representation. Results suggest our best-performing system has improved recall and F1 scores compared to previous methods on unseen data. ",
    "url": "https://arxiv.org/abs/2203.17019",
    "authors": [
      "Bronya R. Chernyak",
      "Talia Ben Simon",
      "Yael Segal",
      "Jeremy Steffman",
      "Eleanor Chodroff",
      "Jennifer S. Cole",
      "Joseph Keshet"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2203.17040",
    "title": "Potential impact of CV-QKD integration on classical WDM network capacity",
    "abstract": "Continuous-variable quantum key distribution (CV-QKD) could allow QKD and classical optical signals physically sharing the same optical fibers in existing networks. However, Raman scattering imposes a limit on the optical power, which in turn impacts the network capacity for classical traffic in presence of CV-QKD. Network-planning simulations indicate that maxing out the CV-QKD capacity in an optical link can adversely impact its classical capacity. Although preliminary, these results show that designing a mixed classical and CV-QKD network will require dedicated planning heuristics and tools that specifically seek a compromise between classical and CV-QKD traffics. ",
    "url": "https://arxiv.org/abs/2203.17040",
    "authors": [
      "Cédric Ware",
      "Raphaël Aymeric",
      "Chaima Zidi",
      "Mounia Lourdiane"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2203.17056",
    "title": "Weakly toll convexity and proper interval graphs",
    "abstract": "A walk $u_0u_1 \\ldots u_{k-1}u_k$ is a \\textit{weakly toll walk} if $u_0u_i \\in E(G)$ implies $u_i = u_1$ and $u_ju_k\\in E(G)$ implies $u_j=u_{k-1}$. A set $S$ of vertices of $G$ is {\\it weakly toll convex} if for any two non-adjacent vertices $x,y \\in S$ any vertex in a weakly toll walk between $x$ and $y$ is also in $S$. The {\\em weakly toll convexity} is the graph convexity space defined over weakly toll convex sets. Many studies are devoted to determine if a graph equipped with a convexity space is a {\\em convex geometry}. An \\emph{extreme vertex} is an element $x$ of a convex set $S$ such that the set $S\\backslash\\{x\\}$ is also convex. A graph convexity space is said to be a convex geometry if it satisfies the Minkowski-Krein-Milman property, which states that every convex set is the convex hull of its extreme vertices. It is known that chordal, Ptolemaic, weakly polarizable, and interval graphs can be characterized as convex geometries with respect to the monophonic, geodesic, $m^3$, and toll convexities, respectively. Other important classes of graphs can also be characterized in this way. In this paper, we prove that a graph is a convex geometry with respect to the weakly toll convexity if and only if it is a proper interval graph. Furthermore, some well-known graph invariants are studied with respect to the weakly toll convexity. ",
    "url": "https://arxiv.org/abs/2203.17056",
    "authors": [
      "Mitre C. Dourado",
      "Marisa Gutierrez",
      "Fábio Protti",
      "Silvia Tondato"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2203.17066",
    "title": "Cross-modal Learning of Graph Representations using Radar Point Cloud  for Long-Range Gesture Recognition",
    "abstract": "Gesture recognition is one of the most intuitive ways of interaction and has gathered particular attention for human computer interaction. Radar sensors possess multiple intrinsic properties, such as their ability to work in low illumination, harsh weather conditions, and being low-cost and compact, making them highly preferable for a gesture recognition solution. However, most literature work focuses on solutions with a limited range that is lower than a meter. We propose a novel architecture for a long-range (1m - 2m) gesture recognition solution that leverages a point cloud-based cross-learning approach from camera point cloud to 60-GHz FMCW radar point cloud, which allows learning better representations while suppressing noise. We use a variant of Dynamic Graph CNN (DGCNN) for the cross-learning, enabling us to model relationships between the points at a local and global level and to model the temporal dynamics a Bi-LSTM network is employed. In the experimental results section, we demonstrate our model's overall accuracy of 98.4% for five gestures and its generalization capability. ",
    "url": "https://arxiv.org/abs/2203.17066",
    "authors": [
      "Souvik Hazra",
      "Hao Feng",
      "Gamze Naz Kiprit",
      "Michael Stephan",
      "Lorenzo Servadei",
      "Robert Wille",
      "Robert Weigel",
      "Avik Santra"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.17068",
    "title": "EEND-SS: Joint End-to-End Neural Speaker Diarization and Speech  Separation for Flexible Number of Speakers",
    "abstract": "In this paper, we present a novel framework that jointly performs speaker diarization, speech separation, and speaker counting. Our proposed method combines end-to-end speaker diarization and speech separation methods, namely, End-to-End Neural Speaker Diarization with Encoder-Decoder-based Attractor calculation (EEND-EDA) and the Convolutional Time-domain Audio Separation Network (ConvTasNet) as multi-tasking joint model. We also propose the multiple 1x1 convolutional layer architecture for estimating the separation masks corresponding to the number of speakers, and a post-processing technique for refining the separated speech signal with speech activity. Experiments using LibriMix dataset show that our proposed method outperforms the baselines in terms of diarization and separation performance for both fixed and flexible numbers of speakers, as well as speaker counting performance for flexible numbers of speakers. All materials will be open-sourced and reproducible in ESPnet toolkit. ",
    "url": "https://arxiv.org/abs/2203.17068",
    "authors": [
      "Yushi Ueda",
      "Soumi Maiti",
      "Shinji Watanabe",
      "Chunlei Zhang",
      "Meng Yu",
      "Shi-Xiong Zhang",
      "Yong Xu"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2203.17089",
    "title": "Quantum-Aided Meta-Learning for Bayesian Binary Neural Networks via Born  Machines",
    "abstract": "Near-term noisy intermediate-scale quantum circuits can efficiently implement implicit probabilistic models in discrete spaces, supporting distributions that are practically infeasible to sample from using classical means. One of the possible applications of such models, also known as Born machines, is probabilistic inference, which is at the core of Bayesian methods. This paper studies the use of Born machines for the problem of training binary Bayesian neural networks. In the proposed approach, a Born machine is used to model the variational distribution of the binary weights of the neural network, and data from multiple tasks is used to reduce training data requirements on new tasks. The method combines gradient-based meta-learning and variational inference via Born machines, and is shown in a prototypical regression problem to outperform conventional joint learning strategies. ",
    "url": "https://arxiv.org/abs/2203.17089",
    "authors": [
      "Ivana Nikoloska",
      "Osvaldo Simeone"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.17218",
    "title": "Improved Relation Networks for End-to-End Speaker Verification and  Identification",
    "abstract": "Speaker identification systems in a real-world scenario are tasked to identify a speaker amongst a set of enrolled speakers given just a few samples for each enrolled speaker. This paper demonstrates the effectiveness of meta-learning and relation networks for this use case. We propose improved relation networks for speaker verification and few-shot (unseen) speaker identification. The use of relation networks facilitates joint training of the frontend speaker encoder and the backend model. Inspired by the use of prototypical networks in speaker verification and to increase the discriminability of the speaker embeddings, we train the model to classify samples in the current episode amongst all speakers present in the training set. Furthermore, we propose a new training regime for faster model convergence by extracting more information from a given meta-learning episode with negligible extra computation. We evaluate the proposed techniques on VoxCeleb, SITW and VCTK datasets on the tasks of speaker verification and unseen speaker identification. The proposed approach outperforms the existing approaches consistently on both tasks. ",
    "url": "https://arxiv.org/abs/2203.17218",
    "authors": [
      "Ashutosh Chaubey",
      "Sparsh Sinha",
      "Susmita Ghose"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:1812.00086",
    "title": "Graph Node-Feature Convolution for Representation Learning",
    "abstract": " Title: Graph Node-Feature Convolution for Representation Learning ",
    "url": "https://arxiv.org/abs/1812.00086",
    "authors": [
      "Li Zhang",
      "Heda Song",
      "Nikolaos Aletras",
      "Haiping Lu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1902.09941",
    "title": "Unsupervised Part Mining for Fine-grained Image Classification",
    "abstract": " Comments: 10 pages,4 figures ",
    "url": "https://arxiv.org/abs/1902.09941",
    "authors": [
      "Runsheng Zhang",
      "jian zhang",
      "Yaping Huang",
      "Qi Zou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:1908.02203",
    "title": "Model Agnostic Defence against Backdoor Attacks in Machine Learning",
    "abstract": " Comments: IEEE Transactions on Reliability, 2022 ",
    "url": "https://arxiv.org/abs/1908.02203",
    "authors": [
      "Sakshi Udeshi",
      "Shanshan Peng",
      "Gerald Woo",
      "Lionell Loh",
      "Louth Rawshan",
      "Sudipta Chattopadhyay"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:1911.06872",
    "title": "Innovation and Strategic Network Formation",
    "abstract": " Title: Innovation and Strategic Network Formation ",
    "url": "https://arxiv.org/abs/1911.06872",
    "authors": [
      "Krishna Dasaratha"
    ],
    "subjectives": [
      "Theoretical Economics (econ.TH)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2001.02299",
    "title": "The LDBC Social Network Benchmark",
    "abstract": " Comments: For the repository containing the source code of this technical report, see this https URL ",
    "url": "https://arxiv.org/abs/2001.02299",
    "authors": [
      "Renzo Angles",
      "János Benjamin Antal",
      "Alex Averbuch",
      "Peter Boncz",
      "Orri Erling",
      "Andrey Gubichev",
      "Vlad Haprian",
      "Moritz Kaufmann",
      "Josep Lluís Larriba Pey",
      "Norbert Martínez",
      "József Marton",
      "Marcus Paradies",
      "Minh-Duc Pham",
      "Arnau Prat-Pérez",
      "Mirko Spasić",
      "Benjamin A. Steer",
      "Gábor Szárnyas",
      "Jack Waudby"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Performance (cs.PF)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2006.05630",
    "title": "Distributional Robust Batch Contextual Bandits",
    "abstract": " Comments: The short version has been accepted in ICML 2020 ",
    "url": "https://arxiv.org/abs/2006.05630",
    "authors": [
      "Nian Si",
      "Fan Zhang",
      "Zhengyuan Zhou",
      "Jose Blanchet"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2006.06053",
    "title": "Causal Feature Selection for Algorithmic Fairness",
    "abstract": " Comments: Full version of the paper at SIGMOD 2022 ",
    "url": "https://arxiv.org/abs/2006.06053",
    "authors": [
      "Sainyam Galhotra",
      "Karthikeyan Shanmugam",
      "Prasanna Sattigeri",
      "Kush R. Varshney"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)",
      "Databases (cs.DB)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2011.13634",
    "title": "Deep Reinforcement Learning for Resource Constrained Multiclass  Scheduling in Wireless Networks",
    "abstract": " Title: Deep Reinforcement Learning for Resource Constrained Multiclass  Scheduling in Wireless Networks ",
    "url": "https://arxiv.org/abs/2011.13634",
    "authors": [
      "Apostolos Avranas",
      "Marios Kountouris",
      "Philippe Ciblat"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2012.11943",
    "title": "Compressing LSTM Networks by Matrix Product Operators",
    "abstract": " Comments: 2 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2012.11943",
    "authors": [
      "Ze-Feng Gao",
      "Xingwei Sun",
      "Lan Gao",
      "Junfeng Li",
      "Zhong-Yi Lu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Computational Physics (physics.comp-ph)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2012.13093",
    "title": "EDN: Salient Object Detection via Extremely-Downsampled Network",
    "abstract": " Comments: Accepted by IEEE Transactions on Image Processing, 12 pages ",
    "url": "https://arxiv.org/abs/2012.13093",
    "authors": [
      "Yu-Huan Wu",
      "Yun Liu",
      "Le Zhang",
      "Ming-Ming Cheng",
      "Bo Ren"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2102.12252",
    "title": "Localization Distillation for Dense Object Detection",
    "abstract": " Comments: Accepted by CVPR 2022. Camera Ready ",
    "url": "https://arxiv.org/abs/2102.12252",
    "authors": [
      "Zhaohui Zheng",
      "Rongguang Ye",
      "Ping Wang",
      "Dongwei Ren",
      "Wangmeng Zuo",
      "Qibin Hou",
      "Ming-Ming Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2102.12967",
    "title": "A statistical framework for efficient out of distribution detection in  deep neural networks",
    "abstract": " Title: A statistical framework for efficient out of distribution detection in  deep neural networks ",
    "url": "https://arxiv.org/abs/2102.12967",
    "authors": [
      "Matan Haroush",
      "Tzviel Frostig",
      "Ruth Heller",
      "Daniel Soudry"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2103.15537",
    "title": "Cloth-Changing Person Re-identification from A Single Image with Gait  Prediction and Regularization",
    "abstract": " Comments: Accepted by CVPR 2022. arXiv admin note: text overlap with arXiv:2002.02295 by other authors ",
    "url": "https://arxiv.org/abs/2103.15537",
    "authors": [
      "Xin Jin",
      "Tianyu He",
      "Kecheng Zheng",
      "Zhiheng Yin",
      "Xu Shen",
      "Zhen Huang",
      "Ruoyu Feng",
      "Jianqiang Huang",
      "Xian-Sheng Hua",
      "Zhibo Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.14785",
    "title": "Two Coupled Rejection Metrics Can Tell Adversarial Examples Apart",
    "abstract": " Comments: CVPR 2022 ",
    "url": "https://arxiv.org/abs/2105.14785",
    "authors": [
      "Tianyu Pang",
      "Huishuai Zhang",
      "Di He",
      "Yinpeng Dong",
      "Hang Su",
      "Wei Chen",
      "Jun Zhu",
      "Tie-Yan Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.00402",
    "title": "A note on the network coloring game: A randomized distributed $(Δ  +1)$-coloring algorithm",
    "abstract": " Comments: Some references have been added, as well as some discussion on the connection between the network coloring game and the distributed coloring problem ",
    "url": "https://arxiv.org/abs/2106.00402",
    "authors": [
      "Nikolaos Fryganiotis",
      "Symeon Papavassiliou",
      "Christos Pelekis"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2106.04564",
    "title": "Are Pretrained Transformers Robust in Intent Classification? A Missing  Ingredient in Evaluation of Out-of-Scope Intent Detection",
    "abstract": " Comments: ACL 2022 Workshop on NLP for Conversational AI ",
    "url": "https://arxiv.org/abs/2106.04564",
    "authors": [
      "Jianguo Zhang",
      "Kazuma Hashimoto",
      "Yao Wan",
      "Zhiwei Liu",
      "Ye Liu",
      "Caiming Xiong",
      "Philip S. Yu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.10811",
    "title": "DiGS : Divergence guided shape implicit neural representation for  unoriented point clouds",
    "abstract": " Title: DiGS : Divergence guided shape implicit neural representation for  unoriented point clouds ",
    "url": "https://arxiv.org/abs/2106.10811",
    "authors": [
      "Yizhak Ben-Shabat",
      "Chamin Hewa Koneputugodage",
      "Stephen Gould"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.11821",
    "title": "Data Augmentation for Opcode Sequence Based Malware Detection",
    "abstract": " Comments: 8 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2106.11821",
    "authors": [
      "Niall McLaughlin",
      "Jesus Martinez del Rincon"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.05885",
    "title": "The paradox of the compositionality of natural language: a neural  machine translation case study",
    "abstract": " Comments: To appear at ACL 2022; 22 pages total (9 in the main paper, 3 pages of references and 10 pages with appendices) ",
    "url": "https://arxiv.org/abs/2108.05885",
    "authors": [
      "Verna Dankers",
      "Elia Bruni",
      "Dieuwke Hupkes"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.02165",
    "title": "FBDNN: Filter Banks and Deep Neural Networks for Portable and Fast  Brain-Computer Interfaces",
    "abstract": " Comments: We included additional tests of statistical significance ",
    "url": "https://arxiv.org/abs/2109.02165",
    "authors": [
      "Pedro R. A. S. Bassi",
      "Romis Attux"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.01661",
    "title": "Rerunning OCR: A Machine Learning Approach to Quality Assessment and  Enhancement Prediction",
    "abstract": " Comments: Journal of Data Mining and Digital Humanities; Major revision ",
    "url": "https://arxiv.org/abs/2110.01661",
    "authors": [
      "Pit Schneider",
      "Yves Maurer"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.04488",
    "title": "Demystifying the Transferability of Adversarial Attacks in Computer  Networks",
    "abstract": " Comments: 14 pages ",
    "url": "https://arxiv.org/abs/2110.04488",
    "authors": [
      "Ehsan Nowroozi",
      "Yassine Mekdad",
      "Mohammad Hajian Berenjestanaki",
      "Mauro Conti",
      "Abdeslam EL Fergougui"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2110.05781",
    "title": "BERTraffic: BERT-based Joint Speaker Role and Speaker Change Detection  for Air Traffic Control Communications",
    "abstract": " Comments: This paper has been submitted to Interspeech 2022 ",
    "url": "https://arxiv.org/abs/2110.05781",
    "authors": [
      "Juan Zuluaga-Gomez",
      "Seyyed Saeed Sarfjoo",
      "Amrutha Prasad",
      "Iuliia Nigmatulina",
      "Petr Motlicek",
      "Karel Ondrej",
      "Oliver Ohneiser",
      "Hartmut Helmke"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.06537",
    "title": "Well-classified Examples are Underestimated in Classification with Deep  Neural Networks",
    "abstract": " Comments: Accepted by AAAI 2022; 17 pages, 11 figures, 13 tables ",
    "url": "https://arxiv.org/abs/2110.06537",
    "authors": [
      "Guangxiang Zhao",
      "Wenkai Yang",
      "Xuancheng Ren",
      "Lei Li",
      "Yunfang Wu",
      "Xu Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.07274",
    "title": "An Approach to Mispronunciation Detection and Diagnosis with Acoustic,  Phonetic and Linguistic (APL) Embeddings",
    "abstract": " Comments: Accepted by ICASSP 2022 ",
    "url": "https://arxiv.org/abs/2110.07274",
    "authors": [
      "Wenxuan Ye",
      "Shaoguang Mao",
      "Frank Soong",
      "Wenshan Wu",
      "Yan Xia",
      "Jonathan Tien",
      "Zhiyong Wu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2110.13492",
    "title": "TUNet: A Block-online Bandwidth Extension Model based on Transformers  and Self-supervised Pretraining",
    "abstract": " Comments: ICASSP 2022 accepted, 5 pages, 4 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2110.13492",
    "authors": [
      "Viet-Anh Nguyen",
      "Anh H. T. Nguyen",
      "Andy W. H. Khong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2111.00600",
    "title": "Minimum Description Length Recurrent Neural Networks",
    "abstract": " Comments: 15 pages ",
    "url": "https://arxiv.org/abs/2111.00600",
    "authors": [
      "Nur Lan",
      "Michal Geyer",
      "Emmanuel Chemla",
      "Roni Katzir"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2111.11873",
    "title": "Deformable image registration with deep network priors: a study on  longitudinal PET images",
    "abstract": " Comments: 11 pages 3 figures in the main article 2 tables in the main article 2 figures in supplementary material ",
    "url": "https://arxiv.org/abs/2111.11873",
    "authors": [
      "Constance Fourcade",
      "Ludovic Ferrer",
      "Noemie Moreau",
      "Gianmarco Santini",
      "Aishlinn Brennan",
      "Caroline Rousseau",
      "Marie Lacombe",
      "Vincent Fleury",
      "Mathilde Colombié",
      "Pascal Jézéquel",
      "Mario Campone",
      "Mathieu Rubeaux",
      "Diana Mateus"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.13738",
    "title": "The Implicit Values of A Good Hand Shake: Handheld Multi-Frame Neural  Depth Refinement",
    "abstract": " Comments: Project github: this https URL ",
    "url": "https://arxiv.org/abs/2111.13738",
    "authors": [
      "Ilya Chugunov",
      "Yuxuan Zhang",
      "Zhihao Xia",
      "Xuaner",
      "Zhang",
      "Jiawen Chen",
      "Felix Heide"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.14451",
    "title": "HDR-NeRF: High Dynamic Range Neural Radiance Fields",
    "abstract": " Comments: Accepted to CVPR 2022. Project page: this https URL ",
    "url": "https://arxiv.org/abs/2111.14451",
    "authors": [
      "Xin Huang",
      "Qi Zhang",
      "Ying Feng",
      "Hongdong Li",
      "Xuan Wang",
      "Qing Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.04148",
    "title": "Neural Points: Point Cloud Representation with Neural Fields for  Arbitrary Upsampling",
    "abstract": " Comments: Accepted to CVPR2022. Project page: this https URL ",
    "url": "https://arxiv.org/abs/2112.04148",
    "authors": [
      "Wanquan Feng",
      "Jin Li",
      "Hongrui Cai",
      "Xiaonan Luo",
      "Juyong Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.08740",
    "title": "Feature Erasing and Diffusion Network for Occluded Person  Re-Identification",
    "abstract": " Comments: 10 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2112.08740",
    "authors": [
      "Zhikang Wang",
      "Feng Zhu",
      "Shixiang Tang",
      "Rui Zhao",
      "Lihuo He",
      "Jiangning Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.11594",
    "title": "GCoD: Graph Convolutional Network Acceleration via Dedicated Algorithm  and Accelerator Co-Design",
    "abstract": " Comments: Published as a conference paper at HPCA 2022 ",
    "url": "https://arxiv.org/abs/2112.11594",
    "authors": [
      "Haoran You",
      "Tong Geng",
      "Yongan Zhang",
      "Ang Li",
      "Yingyan Lin"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.11790",
    "title": "BEVDet: High-performance Multi-camera 3D Object Detection in  Bird-Eye-View",
    "abstract": " Comments: Multi-camera 3D Object Detection ",
    "url": "https://arxiv.org/abs/2112.11790",
    "authors": [
      "Junjie Huang",
      "Guan Huang",
      "Zheng Zhu",
      "Yun Ye",
      "Dalong Du"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.12970",
    "title": "SGTR: End-to-end Scene Graph Generation with Transformer",
    "abstract": " Comments: Accepted by CVPR2022 ",
    "url": "https://arxiv.org/abs/2112.12970",
    "authors": [
      "Rongjie Li",
      "Songyang Zhang",
      "Xuming He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.13215",
    "title": "Continual Learning for Unsupervised Anomaly Detection in Continuous  Auditing of Financial Accounting Data",
    "abstract": " Comments: AAAI 2022 Workshop on AI in Financial Services: Adaptiveness, Resilience & Governance ",
    "url": "https://arxiv.org/abs/2112.13215",
    "authors": [
      "Hamed Hemati",
      "Marco Schreyer",
      "Damian Borth"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.07116",
    "title": "Robust Computation Tree Logic",
    "abstract": " Comments: 23 pages, 1 figure, to be published in the proceedings of NASA Formal Methods (NFM), 2022 ",
    "url": "https://arxiv.org/abs/2201.07116",
    "authors": [
      "Satya Prakash Nayak",
      "Daniel Neider",
      "Rajarshi Roy",
      "Martin Zimmermann"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2202.00645",
    "title": "Stability and Generalization Capabilities of Message Passing Graph  Neural Networks",
    "abstract": " Comments: 44 pages, typos corrected, preprint ",
    "url": "https://arxiv.org/abs/2202.00645",
    "authors": [
      "Sohir Maskey",
      "Ron Levie",
      "Yunseok Lee",
      "Gitta Kutyniok"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Numerical Analysis (math.NA)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2203.01515",
    "title": "Code Synonyms Do Matter: Multiple Synonyms Matching Network for  Automatic ICD Coding",
    "abstract": " Comments: Accepted by ACL 2022 Main Conference, Short Paper ",
    "url": "https://arxiv.org/abs/2203.01515",
    "authors": [
      "Zheng Yuan",
      "Chuanqi Tan",
      "Songfang Huang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.01933",
    "title": "Temporal Context Matters: Enhancing Single Image Prediction with Disease  Progression Representations",
    "abstract": " Comments: Accepted in CVPR 2022 (ORAL) ",
    "url": "https://arxiv.org/abs/2203.01933",
    "authors": [
      "Aishik Konwer",
      "Xuan Xu",
      "Joseph Bae",
      "Chao Chen",
      "Prateek Prasanna"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02884",
    "title": "Towards Self-Supervised Category-Level Object Pose and Size Estimation",
    "abstract": " Title: Towards Self-Supervised Category-Level Object Pose and Size Estimation ",
    "url": "https://arxiv.org/abs/2203.02884",
    "authors": [
      "Yisheng He",
      "Haoqiang Fan",
      "Haibin Huang",
      "Qifeng Chen",
      "Jian Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.04114",
    "title": "A study on joint modeling and data augmentation of multi-modalities for  audio-visual scene classification",
    "abstract": " Comments: 5 pages, 1 figure, submitted to INTERSPEECH 2022 ",
    "url": "https://arxiv.org/abs/2203.04114",
    "authors": [
      "Qing Wang",
      "Jun Du",
      "Siyuan Zheng",
      "Yunqing Li",
      "Yajian Wang",
      "Yuzhong Wu",
      "Hu Hu",
      "Chao-Han Huck Yang",
      "Sabato Marco Siniscalchi",
      "Yannan Wang",
      "Chin-Hui Lee"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.06398",
    "title": "SIGMA: Semantic-complete Graph Matching for Domain Adaptive Object  Detection",
    "abstract": " Comments: Accepted by CVPR2022 (ORAL presentation) ",
    "url": "https://arxiv.org/abs/2203.06398",
    "authors": [
      "Wuyang Li",
      "Xinyu Liu",
      "Yixuan Yuan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.07836",
    "title": "Graph Pre-training for AMR Parsing and Generation",
    "abstract": " Comments: ACL2022 camera-ready final version ",
    "url": "https://arxiv.org/abs/2203.07836",
    "authors": [
      "Xuefeng Bai",
      "Yulong Chen",
      "Yue Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.09767",
    "title": "Speaker Embedding-aware Neural Diarization: an Efficient Framework for  Overlapping Speech Diarization in Meeting Scenarios",
    "abstract": " Comments: Submitted to INTERSPEECH 2022, 5 parges, 2 figure ",
    "url": "https://arxiv.org/abs/2203.09767",
    "authors": [
      "Zhihao Du",
      "Shiliang Zhang",
      "Siqi Zheng",
      "Zhijie Yan"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.13005",
    "title": "GX-Plug: a Middleware for Plugging Accelerators to Distributed Graph  Processing",
    "abstract": " Comments: 13 pages ",
    "url": "https://arxiv.org/abs/2203.13005",
    "authors": [
      "Kai Zou",
      "Xike Xie",
      "Qi Li",
      "Deyu Kong"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2203.13686",
    "title": "Image Compression and Actionable Intelligence With Deep Neural Networks",
    "abstract": " Comments: 3 Pages, 2 Figures, 1 Table, 31 Refereneces ",
    "url": "https://arxiv.org/abs/2203.13686",
    "authors": [
      "Matthew Ciolino"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.15287",
    "title": "Accelerating Code Search with Deep Hashing and Code Classification",
    "abstract": " Comments: Accepted to 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022) ",
    "url": "https://arxiv.org/abs/2203.15287",
    "authors": [
      "Wenchao Gu",
      "Yanlin Wang",
      "Lun Du",
      "Hongyu Zhang",
      "Shi Han",
      "Dongmei Zhang",
      "Michael R. Lyu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.15547",
    "title": "ME-CapsNet: A Multi-Enhanced Capsule Networks with Routing Mechanism",
    "abstract": " Comments: Submitted to 8th IEEE International Conference on Electronics, Computing and Communication Technologies (IEEE CONECCT'22) ",
    "url": "https://arxiv.org/abs/2203.15547",
    "authors": [
      "Jerrin Bright",
      "Suryaprakash Rajkumar",
      "Arockia Selvakumar Arockia Doss"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.15640",
    "title": "Synthesis and Execution of Communicative Robotic Movements with  Generative Adversarial Networks",
    "abstract": " Comments: Submitted to the Special Issue on Emerging Topics on Development and Learning, IEEE TCDS. Unpublished, review process ongoing. Luca Garello and Linda Lastrico contributed equally to this work, hence they share the first name ",
    "url": "https://arxiv.org/abs/2203.15640",
    "authors": [
      "Luca Garello",
      "Linda Lastrico",
      "Alessandra Sciutti",
      "Nicoletta Noceti",
      "Fulvio Mastrogiovanni",
      "Francesco Rea"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.15872",
    "title": "Protective Mission against a Highly Maneuverable Rogue Drone Using  Defense Margin Strategy",
    "abstract": " Title: Protective Mission against a Highly Maneuverable Rogue Drone Using  Defense Margin Strategy ",
    "url": "https://arxiv.org/abs/2203.15872",
    "authors": [
      "Minjun Sung",
      "Christophe Johannes Hiltebrandt-McIntosh",
      "Hunmin Kim",
      "Naira Hovakimyan"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.15878",
    "title": "Characterizations of graph classes via convex geometries: A survey",
    "abstract": " Comments: 16 pages ",
    "url": "https://arxiv.org/abs/2203.15878",
    "authors": [
      "Mitre C. Dourado",
      "Fábio Protti",
      "Rudini Sampaio"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2203.15880",
    "title": "Proactive Image Manipulation Detection",
    "abstract": " Comments: Published at CVPR 2022 ",
    "url": "https://arxiv.org/abs/2203.15880",
    "authors": [
      "Vishal Asnani",
      "Xi Yin",
      "Tal Hassner",
      "Sijia Liu",
      "Xiaoming Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.15884",
    "title": "Radial Autoencoders for Enhanced Anomaly Detection",
    "abstract": " Title: Radial Autoencoders for Enhanced Anomaly Detection ",
    "url": "https://arxiv.org/abs/2203.15884",
    "authors": [
      "Mihai-Cezar Augustin",
      "Vivien Bonvin",
      "Regis Houssou",
      "Efstratios Rappos",
      "Stephan Robert-Nicoud"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.15924",
    "title": "Hybrid of monolithic and staggered solution techniques for the  computational analysis of fracture, assessed on fibrous network mechanics",
    "abstract": " Comments: Numerical Analysis (math.NA) ",
    "url": "https://arxiv.org/abs/2203.15924",
    "authors": [
      "Vedad Tojaga",
      "Artem Kulachenko",
      "Soren Ostlund",
      "T. Christian Gasser"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2203.15935",
    "title": "Graph Neural Networks in IoT: A Survey",
    "abstract": " Title: Graph Neural Networks in IoT: A Survey ",
    "url": "https://arxiv.org/abs/2203.15935",
    "authors": [
      "Guimin Dong",
      "Mingyue Tang",
      "Zhiyuan Wang",
      "Jiechao Gao",
      "Sikun Guo",
      "Lihua Cai",
      "Robert Gutierrez",
      "Bradford Campbell",
      "Laura E. Barnes",
      "Mehdi Boukhechba"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16263",
    "title": "Does Audio Deepfake Detection Generalize?",
    "abstract": " Comments: Submitted to Interspeech 2022 ",
    "url": "https://arxiv.org/abs/2203.16263",
    "authors": [
      "Nicolas M. Müller",
      "Pavel Czempin",
      "Franziska Dieckmann",
      "Adam Froghyar",
      "Konstantin Böttinger"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.16297",
    "title": "Forecasting from LiDAR via Future Object Detection",
    "abstract": " Comments: This work has been accepted to Computer Vision and Pattern Recognition (CVPR) 2022 ",
    "url": "https://arxiv.org/abs/2203.16297",
    "authors": [
      "Neehar Peri",
      "Jonathon Luiten",
      "Mengtian Li",
      "Aljoša Ošep",
      "Laura Leal-Taixé",
      "Deva Ramanan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.16349",
    "title": "The Block-based Mobile PDE Systems Are Not Secure -- Experimental  Attacks",
    "abstract": " Title: The Block-based Mobile PDE Systems Are Not Secure -- Experimental  Attacks ",
    "url": "https://arxiv.org/abs/2203.16349",
    "authors": [
      "Niusen Chen",
      "Bo Chen",
      "Weisong Shi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  }
]