[
  {
    "id": "arXiv:2208.04315",
    "title": "Patient-Specific Game-Based Transfer Method for Parkinson's Disease  Severity Prediction",
    "abstract": "Dysphonia is one of the early symptoms of Parkinson's disease (PD). Most existing methods use feature selection methods to find the optimal subset of voice features for all PD patients to improve the prediction performance. Few have considered the heterogeneity between patients, which implies the need to provide specific prediction models for different patients. However, building this prediction model for each patient faces the challenge of small sample size, which makes it lack generalization ability. Instance transfer is an effective way to make up for this deficiency. Therefore, this paper proposes a patient-specific game-based transfer (PSGT) method for PD severity prediction. First, a selection mechanism is used to select PD patients with similar disease trends to the target patient from the source domain, which greatly reduces the scope of instance transfer and reduces the risk of negative transfer. Then, the contribution of the transferred subjects and their instances to the disease estimation of the target subject is fairly evaluated by the Shapley value, which improves the interpretability of the method. Next, the proportion of valid instances is determined according to the contribution of transferred subjects, and the instances with higher contribution are transferred based on this proportion to further reduce the difference between the transferred instance subset and the target subject. Finally, the selected subset of instances is added to the training set of the target subject, and the extended data is fed into the random forest to improve the performance of the PD severity prediction method. Parkinson's telemonitoring dataset is used to evaluate the feasibility and effectiveness. Experiment results show that the proposed PSGT method has better performance in both prediction error and stability over compared methods. ",
    "url": "https://arxiv.org/abs/2208.04315",
    "authors": [
      "Zaifa Xue",
      "Huibin Lu",
      "Tao Zhang",
      "Max A. Little"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.04319",
    "title": "PhyGNNet: Solving spatiotemporal PDEs with Physics-informed Graph Neural  Network",
    "abstract": "Solving partial differential equations (PDEs) is an important research means in the fields of physics, biology, and chemistry. As an approximate alternative to numerical methods, PINN has received extensive attention and played an important role in many fields. However, PINN uses a fully connected network as its model, which has limited fitting ability and limited extrapolation ability in both time and space. In this paper, we propose PhyGNNet for solving partial differential equations on the basics of a graph neural network which consists of encoder, processer, and decoder blocks. In particular, we divide the computing area into regular grids, define partial differential operators on the grids, then construct pde loss for the network to optimize to build PhyGNNet model. What's more, we conduct comparative experiments on Burgers equation and heat equation to validate our approach, the results show that our method has better fit ability and extrapolation ability both in time and spatial areas compared with PINN. ",
    "url": "https://arxiv.org/abs/2208.04319",
    "authors": [
      "Longxiang Jiang",
      "Liyuan Wang",
      "Xinkun Chu",
      "Yonghao Xiao",
      "Hao Zhang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04321",
    "title": "Neural Architecture Search as Multiobjective Optimization Benchmarks:  Problem Formulation and Performance Assessment",
    "abstract": "The ongoing advancements in network architecture design have led to remarkable achievements in deep learning across various challenging computer vision tasks. Meanwhile, the development of neural architecture search (NAS) has provided promising approaches to automating the design of network architectures for lower prediction error. Recently, the emerging application scenarios of deep learning have raised higher demands for network architectures considering multiple design criteria: number of parameters/floating-point operations, and inference latency, among others. From an optimization point of view, the NAS tasks involving multiple design criteria are intrinsically multiobjective optimization problems; hence, it is reasonable to adopt evolutionary multiobjective optimization (EMO) algorithms for tackling them. Nonetheless, there is still a clear gap confining the related research along this pathway: on the one hand, there is a lack of a general problem formulation of NAS tasks from an optimization point of view; on the other hand, there are challenges in conducting benchmark assessments of EMO algorithms on NAS tasks. To bridge the gap: (i) we formulate NAS tasks into general multi-objective optimization problems and analyze the complex characteristics from an optimization point of view; (ii) we present an end-to-end pipeline, dubbed $\\texttt{EvoXBench}$, to generate benchmark test problems for EMO algorithms to run efficiently -- without the requirement of GPUs or Pytorch/Tensorflow; (iii) we instantiate two test suites comprehensively covering two datasets, seven search spaces, and three hardware devices, involving up to eight objectives. Based on the above, we validate the proposed test suites using six representative EMO algorithms and provide some empirical analyses. The code of $\\texttt{EvoXBench}$ is available from $\\href{https://github.com/EMI-Group/EvoXBench}{\\rm{here}}$. ",
    "url": "https://arxiv.org/abs/2208.04321",
    "authors": [
      "Zhichao Lu",
      "Ran Cheng",
      "Yaochu Jin",
      "Kay Chen Tan",
      "Kalyanmoy Deb"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04322",
    "title": "Learning-Based Client Selection for Federated Learning Services Over  Wireless Networks with Constrained Monetary Budgets",
    "abstract": "We investigate a data quality-aware dynamic client selection problem for multiple federated learning (FL) services in a wireless network, where each client has dynamic datasets for the simultaneous training of multiple FL services and each FL service demander has to pay for the clients with constrained monetary budgets. The problem is formalized as a non-cooperative Markov game over the training rounds. A multi-agent hybrid deep reinforcement learning-based algorithm is proposed to optimize the joint client selection and payment actions, while avoiding action conflicts. Simulation results indicate that our proposed algorithm can significantly improve the training performance. ",
    "url": "https://arxiv.org/abs/2208.04322",
    "authors": [
      "Zhipeng Cheng",
      "Xuwei Fan",
      "Minghui Liwang",
      "Ning Chen",
      "Xianbin Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.04346",
    "title": "QSAM-Net: Rain streak removal by quaternion neural network with  self-attention module",
    "abstract": "Images captured in real-world applications in remote sensing, image or video retrieval, and outdoor surveillance suffer degraded quality introduced by poor weather conditions. Conditions such as rain and mist, introduce artifacts that make visual analysis challenging and limit the performance of high-level computer vision methods. For time-critical applications where a rapid response is necessary, it becomes crucial to develop algorithms that automatically remove rain, without diminishing the quality of the image contents. This article aims to develop a novel quaternion multi-stage multiscale neural network with a self-attention module called QSAM-Net to remove rain streaks. The novelty of this algorithm is that it requires significantly fewer parameters by a factor of 3.98, over prior methods, while improving visual quality. This is demonstrated by the extensive evaluation and benchmarking on synthetic and real-world rainy images. This feature of QSAM-Net makes the network suitable for implementation on edge devices and applications requiring near real-time performance. The experiments demonstrate that by improving the visual quality of images. In addition, object detection accuracy and training speed are also improved. ",
    "url": "https://arxiv.org/abs/2208.04346",
    "authors": [
      "Vladimir Frants",
      "Sos Agaian",
      "Karen Panetta"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04352",
    "title": "Rethinking Robust Representation Learning Under Fine-grained Noisy Faces",
    "abstract": "Learning robust feature representation from large-scale noisy faces stands out as one of the key challenges in high-performance face recognition. Recent attempts have been made to cope with this challenge by alleviating the intra-class conflict and inter-class conflict. However, the unconstrained noise type in each conflict still makes it difficult for these algorithms to perform well. To better understand this, we reformulate the noise type of each class in a more fine-grained manner as N-identities|K^C-clusters. Different types of noisy faces can be generated by adjusting the values of \\nkc. Based on this unified formulation, we found that the main barrier behind the noise-robust representation learning is the flexibility of the algorithm under different N, K, and C. For this potential problem, we propose a new method, named Evolving Sub-centers Learning~(ESL), to find optimal hyperplanes to accurately describe the latent space of massive noisy faces. More specifically, we initialize M sub-centers for each class and ESL encourages it to be automatically aligned to N-identities|K^C-clusters faces via producing, merging, and dropping operations. Images belonging to the same identity in noisy faces can effectively converge to the same sub-center and samples with different identities will be pushed away. We inspect its effectiveness with an elaborate ablation study on the synthetic noisy dataset with different N, K, and C. Without any bells and whistles, ESL can achieve significant performance gains over state-of-the-art methods on large-scale noisy faces ",
    "url": "https://arxiv.org/abs/2208.04352",
    "authors": [
      "Bingqi Ma",
      "Guanglu Song",
      "Boxiao Liu",
      "Yu Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04358",
    "title": "LargeNetVis: Visual Exploration of Large Temporal Networks Based on  Community Taxonomies",
    "abstract": "Temporal (or time-evolving) networks are commonly used to model complex systems and the evolution of their components throughout time. Although these networks can be analyzed by different means, visual analytics stands out as an effective way for a pre-analysis before doing quantitative/statistical analyses to identify patterns, anomalies, and other behaviors in the data, thus leading to new insights and better decision-making. However, the large number of nodes, edges, and/or timestamps in many real-world networks may lead to polluted layouts that make the analysis inefficient or even infeasible. In this paper, we propose LargeNetVis, a web-based visual analytics system designed to assist in analyzing small and large temporal networks. It successfully achieves this goal by leveraging three taxonomies focused on network communities to guide the visual exploration process. The system is composed of four interactive visual components: the first (Taxonomy Matrix) presents a summary of the network characteristics, the second (Global View) gives an overview of the network evolution, the third (a node-link diagram) enables community- and node-level structural analysis, and the fourth (a Temporal Activity Map -- TAM) shows the community- and node-level activity under a temporal perspective. ",
    "url": "https://arxiv.org/abs/2208.04358",
    "authors": [
      "Claudio D. G. Linhares",
      "Jean R. Ponciano",
      "Diogenes S. Pedro",
      "Luis E. C. Rocha",
      "Agma J. M. Traina",
      "Jorge Poco"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2208.04361",
    "title": "Semi-Supervised Cross-Modal Salient Object Detection with U-Structure  Networks",
    "abstract": "Salient Object Detection (SOD) is a popular and important topic aimed at precise detection and segmentation of the interesting regions in the images. We integrate the linguistic information into the vision-based U-Structure networks designed for salient object detection tasks. The experiments are based on the newly created DUTS Cross Modal (DUTS-CM) dataset, which contains both visual and linguistic labels. We propose a new module called efficient Cross-Modal Self-Attention (eCMSA) to combine visual and linguistic features and improve the performance of the original U-structure networks. Meanwhile, to reduce the heavy burden of labeling, we employ a semi-supervised learning method by training an image caption model based on the DUTS-CM dataset, which can automatically label other datasets like DUT-OMRON and HKU-IS. The comprehensive experiments show that the performance of SOD can be improved with the natural language input and is competitive compared with other SOD methods. ",
    "url": "https://arxiv.org/abs/2208.04361",
    "authors": [
      "Yunqing Bao",
      "Hang Dai",
      "Abdulmotaleb Elsaddik"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04369",
    "title": "Understanding Weight Similarity of Neural Networks via Chain  Normalization Rule and Hypothesis-Training-Testing",
    "abstract": "We present a weight similarity measure method that can quantify the weight similarity of non-convex neural networks. To understand the weight similarity of different trained models, we propose to extract the feature representation from the weights of neural networks. We first normalize the weights of neural networks by introducing a chain normalization rule, which is used for weight representation learning and weight similarity measure. We extend the traditional hypothesis-testing method to a hypothesis-training-testing statistical inference method to validate the hypothesis on the weight similarity of neural networks. With the chain normalization rule and the new statistical inference, we study the weight similarity measure on Multi-Layer Perceptron (MLP), Convolutional Neural Network (CNN), and Recurrent Neural Network (RNN), and find that the weights of an identical neural network optimized with the Stochastic Gradient Descent (SGD) algorithm converge to a similar local solution in a metric space. The weight similarity measure provides more insight into the local solutions of neural networks. Experiments on several datasets consistently validate the hypothesis of weight similarity measure. ",
    "url": "https://arxiv.org/abs/2208.04369",
    "authors": [
      "Guangcong Wang",
      "Guangrun Wang",
      "Wenqi Liang",
      "Jianhuang Lai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.04370",
    "title": "CLIP-based Neural Neighbor Style Transfer for 3D Assets",
    "abstract": "We present a method for transferring the style from a set of images to a 3D object. The texture appearance of an asset is optimized with a differentiable renderer in a pipeline based on losses using pretrained deep neural networks. More specifically, we utilize a nearest-neighbor feature matching loss with CLIP-ResNet50 to extract the style from images. We show that a CLIP- based style loss provides a different appearance over a VGG-based loss by focusing more on texture over geometric shapes. Additionally, we extend the loss to support multiple images and enable loss-based control over the color palette combined with automatic color palette extraction from style images. ",
    "url": "https://arxiv.org/abs/2208.04370",
    "authors": [
      "Shailesh Mishra",
      "Jonathan Granskog"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2208.04389",
    "title": "Share with Me: A Study on a Social Robot Collecting Mental Health Data",
    "abstract": "Social robots have been used to assist with mental well-being in various ways such as to help children with autism improve on their social skills and executive functioning such as joint attention and bodily awareness. They are also used to help older adults by reducing feelings of isolation and loneliness, as well as supporting mental well-being of teens and children. However, existing work in this sphere has only shown support for mental health through social robots by responding interactively to human activity to help them learn relevant skills. We hypothesize that humans can also get help from social robots in mental well-being by releasing or sharing their mental health data with the social robots. In this paper, we present a human-robot interaction (HRI) study to evaluate this hypothesis. During the five-day study, a total of fifty-five (n=55) participants shared their in-the-moment mood and stress levels with a social robot. We saw a majority of positive results indicating it is worth conducting future work in this direction, and the potential of social robots to largely support mental well-being. ",
    "url": "https://arxiv.org/abs/2208.04389",
    "authors": [
      "Raida Karim",
      "Edgar Lopez",
      "Katelynn Oleson",
      "Tony Li",
      "Elin A. Björling",
      "Maya Cakmak"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2208.04405",
    "title": "Recovering the Graph Underlying Networked Dynamical Systems under  Partial Observability: A Deep Learning Approach",
    "abstract": "We study the problem of graph structure identification, i.e., of recovering the graph of dependencies among time series. We model these time series data as components of the state of linear stochastic networked dynamical systems. We assume partial observability, where the state evolution of only a subset of nodes comprising the network is observed. We devise a new feature vector computed from the observed time series and prove that these features are linearly separable, i.e., there exists a hyperplane that separates the cluster of features associated with connected pairs of nodes from those associated with disconnected pairs. This renders the features amenable to train a variety of classifiers to perform causal inference. In particular, we use these features to train Convolutional Neural Networks (CNNs). The resulting causal inference mechanism outperforms state-of-the-art counterparts w.r.t. sample-complexity. The trained CNNs generalize well over structurally distinct networks (dense or sparse) and noise-level profiles. Remarkably, they also generalize well to real-world networks while trained over a synthetic network (realization of a random graph). Finally, the proposed method consistently reconstructs the graph in a pairwise manner, that is, by deciding if an edge or arrow is present or absent in each pair of nodes, from the corresponding time series of each pair. This fits the framework of large-scale systems, where observation or processing of all nodes in the network is prohibitive. ",
    "url": "https://arxiv.org/abs/2208.04405",
    "authors": [
      "Sérgio Machado",
      "Anirudh Sridhar",
      "Paulo Gil",
      "Jorge Henriques",
      "José M. F. Moura",
      "Augusto Santos"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2208.04408",
    "title": "A note on independent sets in sparse-dense graphs",
    "abstract": "Sparse-dense partitions was introduced by Feder, Hell, Klein, and Motwani [STOC 1999, SIDMA 2003] as a tool to solve partitioning problems. In this paper, the following result concerning independent sets in graphs having sparse-dense partitions is presented: if a $n$-vertex graph $G$ admits a sparse-dense partition concerning classes $\\mathcal S$ and $\\mathcal D$, where $\\mathcal D$ is a subclass of the complement of $K_t$-free graphs (for some ~$t$), and graphs in $\\mathcal S$ can be recognized in polynomial time, then: enumerate all maximal independent sets of $G$ (or find its maximum) can be performed in $n^{O(1)}$ time whenever it can be done in polynomial time for graphs in the class $\\mathcal S$. This result has the following interesting implications: A P versus NP-hard dichotomy for Max. Independent Set on graphs whose vertex set can be partitioned into $k$ independent sets and $\\ell$ cliques, so-called $(k, \\ell)$-graphs. concerning the values of $k$ and $\\ell$ of $(k, \\ell)$-graphs. A P-time algorithm that does not require $(1,\\ell)$-partitions for determining whether a $(1,\\ell)$-graph $G$ is well-covered. Well-covered graphs are graphs in which every maximal independent set has the same cardinality. The characterization of conflict graph classes for which the conflict version of a P-time graph problem is still in P assuming such classes. Conflict versions of graph problems ask for solutions avoiding pairs of conflicting elements (vertices or edges) described in conflict graphs. ",
    "url": "https://arxiv.org/abs/2208.04408",
    "authors": [
      "Uéverton S. Souza"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Computational Complexity (cs.CC)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2208.04433",
    "title": "Peer Prediction for Learning Agents",
    "abstract": "Peer prediction refers to a collection of mechanisms for eliciting information from human agents when direct verification of the obtained information is unavailable. They are designed to have a game-theoretic equilibrium where everyone reveals their private information truthfully. This result holds under the assumption that agents are Bayesian and they each adopt a fixed strategy across all tasks. Human agents however are observed in many domains to exhibit learning behavior in sequential settings. In this paper, we explore the dynamics of sequential peer prediction mechanisms when participants are learning agents. We first show that the notion of no regret alone for the agents' learning algorithms cannot guarantee convergence to the truthful strategy. We then focus on a family of learning algorithms where strategy updates only depend on agents' cumulative rewards and prove that agents' strategies in the popular Correlated Agreement (CA) mechanism converge to truthful reporting when they use algorithms from this family. This family of algorithms is not necessarily no-regret, but includes several familiar no-regret learning algorithms (e.g multiplicative weight update and Follow the Perturbed Leader) as special cases. Simulation of several algorithms in this family as well as the $\\epsilon$-greedy algorithm, which is outside of this family, shows convergence to the truthful strategy in the CA mechanism. ",
    "url": "https://arxiv.org/abs/2208.04433",
    "authors": [
      "Shi Feng",
      "Fang-Yi Yu",
      "Yiling Chen"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2208.04435",
    "title": "Bayesian Pseudo Labels: Expectation Maximization for Robust and  Efficient Semi-Supervised Segmentation",
    "abstract": "This paper concerns pseudo labelling in segmentation. Our contribution is fourfold. Firstly, we present a new formulation of pseudo-labelling as an Expectation-Maximization (EM) algorithm for clear statistical interpretation. Secondly, we propose a semi-supervised medical image segmentation method purely based on the original pseudo labelling, namely SegPL. We demonstrate SegPL is a competitive approach against state-of-the-art consistency regularisation based methods on semi-supervised segmentation on a 2D multi-class MRI brain tumour segmentation task and a 3D binary CT lung vessel segmentation task. The simplicity of SegPL allows less computational cost comparing to prior methods. Thirdly, we demonstrate that the effectiveness of SegPL may originate from its robustness against out-of-distribution noises and adversarial attacks. Lastly, under the EM framework, we introduce a probabilistic generalisation of SegPL via variational inference, which learns a dynamic threshold for pseudo labelling during the training. We show that SegPL with variational inference can perform uncertainty estimation on par with the gold-standard method Deep Ensemble. ",
    "url": "https://arxiv.org/abs/2208.04435",
    "authors": [
      "Mou-Cheng Xu",
      "Yukun Zhou",
      "Chen Jin",
      "Marius de Groot",
      "Daniel C. Alexander",
      "Neil P. Oxtoby",
      "Yipeng Hu",
      "Joseph Jacob"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04438",
    "title": "Occlusion-Aware Instance Segmentation via BiLayer Network Architectures",
    "abstract": "Segmenting highly-overlapping image objects is challenging, because there is typically no distinction between real object contours and occlusion boundaries on images. Unlike previous instance segmentation methods, we model image formation as a composition of two overlapping layers, and propose Bilayer Convolutional Network (BCNet), where the top layer detects occluding objects (occluders) and the bottom layer infers partially occluded instances (occludees). The explicit modeling of occlusion relationship with bilayer structure naturally decouples the boundaries of both the occluding and occluded instances, and considers the interaction between them during mask regression. We investigate the efficacy of bilayer structure using two popular convolutional network designs, namely, Fully Convolutional Network (FCN) and Graph Convolutional Network (GCN). Further, we formulate bilayer decoupling using the vision transformer (ViT), by representing instances in the image as separate learnable occluder and occludee queries. Large and consistent improvements using one/two-stage and query-based object detectors with various backbones and network layer choices validate the generalization ability of bilayer decoupling, as shown by extensive experiments on image instance segmentation benchmarks (COCO, KINS, COCOA) and video instance segmentation benchmarks (YTVIS, OVIS, BDD100K MOTS), especially for heavy occlusion cases. Code and data are available at https://github.com/lkeab/BCNet. ",
    "url": "https://arxiv.org/abs/2208.04438",
    "authors": [
      "Lei Ke",
      "Yu-Wing Tai",
      "Chi-Keung Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04440",
    "title": "Dispersion vs Disparity: Hiding Variability Can Encourage Stereotyping  When Visualizing Social Outcomes",
    "abstract": "Visualization research often focuses on perceptual accuracy or helping readers interpret key messages. However, we know very little about how chart designs might influence readers' perceptions of the people behind the data. Specifically, could designs interact with readers' social cognitive biases in ways that perpetuate harmful stereotypes? For example, when analyzing social inequality, bar charts are a popular choice to present outcome disparities between race, gender, or other groups. But bar charts may encourage deficit thinking, the perception that outcome disparities are caused by groups' personal strengths or deficiencies, rather than external factors. These faulty personal attributions can then reinforce stereotypes about the groups being visualized. We conducted four experiments examining design choices that influence attribution biases (and therefore deficit thinking). Crowdworkers viewed visualizations depicting social outcomes that either mask variability in data, such as bar charts or dot plots, or emphasize variability in data, such as jitter plots or prediction intervals. They reported their agreement with both personal and external explanations for the visualized disparities. Overall, when participants saw visualizations that hide within-group variability, they agreed more with personal explanations. When they saw visualizations that emphasize within-group variability, they agreed less with personal explanations. These results demonstrate that data visualizations about social inequity can be misinterpreted in harmful ways and lead to stereotyping. Design choices can influence these biases: Hiding variability tends to increase stereotyping while emphasizing variability reduces it. ",
    "url": "https://arxiv.org/abs/2208.04440",
    "authors": [
      "Eli Holder",
      "Cindy Xiong"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2208.04441",
    "title": "Txt2Img-MHN: Remote Sensing Image Generation from Text Using Modern  Hopfield Networks",
    "abstract": "The synthesis of high-resolution remote sensing images based on text descriptions has great potential in many practical application scenarios. Although deep neural networks have achieved great success in many important remote sensing tasks, generating realistic remote sensing images from text descriptions is still very difficult. To address this challenge, we propose a novel text-to-image modern Hopfield network (Txt2Img-MHN). The main idea of Txt2Img-MHN is to conduct hierarchical prototype learning on both text and image embeddings with modern Hopfield layers. Instead of directly learning concrete but highly diverse text-image joint feature representations for different semantics, Txt2Img-MHN aims to learn the most representative prototypes from text-image embeddings, achieving a coarse-to-fine learning strategy. These learned prototypes can then be utilized to represent more complex semantics in the text-to-image generation task. To better evaluate the realism and semantic consistency of the generated images, we further conduct zero-shot classification on real remote sensing data using the classification model trained on synthesized images. Despite its simplicity, we find that the overall accuracy in the zero-shot classification may serve as a good metric to evaluate the ability to generate an image from text. Extensive experiments on the benchmark remote sensing text-image dataset demonstrate that the proposed Txt2Img-MHN can generate more realistic remote sensing images than existing methods. Code and pre-trained models are available online (https://github.com/YonghaoXu/Txt2Img-MHN). ",
    "url": "https://arxiv.org/abs/2208.04441",
    "authors": [
      "Yonghao Xu",
      "Weikang Yu",
      "Pedram Ghamisi",
      "Michael Kopp",
      "Sepp Hochreiter"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04448",
    "title": "NeuralVDB: High-resolution Sparse Volume Representation using  Hierarchical Neural Networks",
    "abstract": "We introduce NeuralVDB, which improves on an existing industry standard for efficient storage of sparse volumetric data, denoted VDB, by leveraging recent advancements in machine learning. Our novel hybrid data structure can reduce the memory footprints of VDB volumes by orders of magnitude, while maintaining its flexibility and only incurring a small (user-controlled) compression errors. Specifically, NeuralVDB replaces the lower nodes of a shallow and wide VDB tree structure with multiple hierarchy neural networks that separately encode topology and value information by means of neural classifiers and regressors respectively. This approach has proven to maximize the compression ratio while maintaining the spatial adaptivity offered by the higher-level VDB data structure. For sparse signed distance fields and density volumes, we have observed compression ratios on the order of $10\\times$ to more than $100\\times$ from already compressed VDB inputs, with little to no visual artifacts. We also demonstrate how its application to animated sparse volumes can both accelerate training and generate temporally coherent neural networks. ",
    "url": "https://arxiv.org/abs/2208.04448",
    "authors": [
      "Doyub Kim",
      "Minjae Lee",
      "Ken Museth"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2208.04458",
    "title": "Comparative Evaluation of Bipartite, Node-Link, and Matrix-Based Network  Representations",
    "abstract": "This work investigates and compares the performance of node-link diagrams, adjacency matrices, and bipartite layouts for visualizing networks. In a crowd-sourced user study (n = 150), we measure the task accuracy and completion time of the three representations for different network classes and properties. In contrast to the literature, which covers mostly topology-based tasks (e.g., path finding) in small datasets, we mainly focus on overview tasks for large and directed networks. We consider three overview tasks on networks with 500 nodes: (T1) network class identification, (T2) cluster detection, and (T3) network density estimation, and two detailed tasks: (T4) node in-degree vs. out-degree and (T5) representation mapping, on networks with 50 and 20 nodes, respectively. Our results show that bipartite layouts are beneficial for revealing the overall network structure, while adjacency matrices are most reliable across the different tasks. ",
    "url": "https://arxiv.org/abs/2208.04458",
    "authors": [
      "Moataz Abdelaal",
      "Nathan D. Schiele",
      "Katrin Angerbauer",
      "Kuno Kurzhals",
      "Michael Sedlmair",
      "Daniel Weiskopf"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2208.04459",
    "title": "Bullwhip Effect of Supply Networks: Joint Impact of Network Structure  and Market Demand",
    "abstract": "The progressive amplification of fluctuations in demand as the demand travels upstream the supply chains is known as the bullwhip effect. We first analytically characterize the bullwhip effect in general supply chain networks in two cases: (i) all suppliers have a unique layer position, where our method is founded on the control-theoretic approach, and (ii) not all suppliers have a unique layer position due to the presence of intra-layer links or inter-layer links between suppliers that are not positioned in consecutive layers, where we use both the absorbing Markov chain and the control-theoretic approach. We then investigate how network structures impact the BWE of supply chain networks. In particular, we analytically show that (i) if the market demand is generated from the same stationary process, the structure of supply networks does not affect the layer-wise bullwhip effect of supply networks, and (ii) if the market demand is generated from different stationary or non-stationary market processes, wider supply networks lead to a lower level of layer-wise bullwhip effect. Finally, numerical simulations are used to validate our propositions. ",
    "url": "https://arxiv.org/abs/2208.04459",
    "authors": [
      "Jin-Zhu Yü",
      "Chencheng Cai",
      "Jianxi Gao"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2208.04461",
    "title": "A Theoretical View on Sparsely Activated Networks",
    "abstract": "Deep and wide neural networks successfully fit very complex functions today, but dense models are starting to be prohibitively expensive for inference. To mitigate this, one promising direction is networks that activate a sparse subgraph of the network. The subgraph is chosen by a data-dependent routing function, enforcing a fixed mapping of inputs to subnetworks (e.g., the Mixture of Experts (MoE) paradigm in Switch Transformers). However, prior work is largely empirical, and while existing routing functions work well in practice, they do not lead to theoretical guarantees on approximation ability. We aim to provide a theoretical explanation for the power of sparse networks. As our first contribution, we present a formal model of data-dependent sparse networks that captures salient aspects of popular architectures. We then introduce a routing function based on locality sensitive hashing (LSH) that enables us to reason about how well sparse networks approximate target functions. After representing LSH-based sparse networks with our model, we prove that sparse networks can match the approximation power of dense networks on Lipschitz functions. Applying LSH on the input vectors means that the experts interpolate the target function in different subregions of the input space. To support our theory, we define various datasets based on Lipschitz target functions, and we show that sparse networks give a favorable trade-off between number of active units and approximation quality. ",
    "url": "https://arxiv.org/abs/2208.04461",
    "authors": [
      "Cenk Baykal",
      "Nishanth Dikkala",
      "Rina Panigrahy",
      "Cyrus Rashtchian",
      "Xin Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.04465",
    "title": "Characterizing Social Movement Narratives in Online Communities: The  2021 Cuban Protests on Reddit",
    "abstract": "Social movements are dominated by storytelling, as narratives play a key role in how communities involved in these movements shape their identities. Thus, recognizing the accepted narratives of different communities is central to understanding social movements. In this context, journalists face the challenge of making sense of these emerging narratives in social media when they seek to report social protests. Thus, they would benefit from support tools that allow them to identify and explore such narratives. In this work, we propose a narrative extraction algorithm from social media that incorporates the concept of community acceptance. Using our method, we study the 2021 Cuban protests and characterize five relevant communities. The extracted narratives differ in both structure and content across communities. Our work has implications in the study of social movements, intelligence analysis, computational journalism, and misinformation research. ",
    "url": "https://arxiv.org/abs/2208.04465",
    "authors": [
      "Brian Felipe Keith Norambuena",
      "Tanushree Mitra",
      "Chris North"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2208.04482",
    "title": "OptEmbed: Learning Optimal Embedding Table for Click-through Rate  Prediction",
    "abstract": "Learning embedding table plays a fundamental role in Click-through rate(CTR) prediction from the view of the model performance and memory usage. The embedding table is a two-dimensional tensor, with its axes indicating the number of feature values and the embedding dimension, respectively. To learn an efficient and effective embedding table, recent works either assign various embedding dimensions for feature fields and reduce the number of embeddings respectively or mask the embedding table parameters. However, all these existing works cannot get an optimal embedding table. On the one hand, various embedding dimensions still require a large amount of memory due to the vast number of features in the dataset. On the other hand, decreasing the number of embeddings usually suffers from performance degradation, which is intolerable in CTR prediction. Finally, pruning embedding parameters will lead to a sparse embedding table, which is hard to be deployed. To this end, we propose an optimal embedding table learning framework OptEmbed, which provides a practical and general method to find an optimal embedding table for various base CTR models. Specifically, we propose pruning the redundant embeddings regarding corresponding features' importance by learnable pruning thresholds. Furthermore, we consider assigning various embedding dimensions as one single candidate architecture. To efficiently search the optimal embedding dimensions, we design a uniform embedding dimension sampling scheme to equally train all candidate architectures, meaning architecture-related parameters and learnable thresholds are trained simultaneously in one supernet. We then propose an evolution search method based on the supernet to find the optimal embedding dimensions for each field. Experiments on public datasets show that OptEmbed can learn a compact embedding table which can further improve the model performance. ",
    "url": "https://arxiv.org/abs/2208.04482",
    "authors": [
      "Fuyuan Lyu",
      "Xing Tang",
      "Hong Zhu",
      "Huifeng Guo",
      "Yingxue Zhang",
      "Ruiming Tang",
      "Xue Liu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2208.04489",
    "title": "Exploring Hate Speech Detection with HateXplain and BERT",
    "abstract": "Hate Speech takes many forms to target communities with derogatory comments, and takes humanity a step back in societal progress. HateXplain is a recently published and first dataset to use annotated spans in the form of rationales, along with speech classification categories and targeted communities to make the classification more humanlike, explainable, accurate and less biased. We tune BERT to perform this task in the form of rationales and class prediction, and compare our performance on different metrics spanning across accuracy, explainability and bias. Our novelty is threefold. Firstly, we experiment with the amalgamated rationale class loss with different importance values. Secondly, we experiment extensively with the ground truth attention values for the rationales. With the introduction of conservative and lenient attentions, we compare performance of the model on HateXplain and test our hypothesis. Thirdly, in order to improve the unintended bias in our models, we use masking of the target community words and note the improvement in bias and explainability metrics. Overall, we are successful in achieving model explanability, bias removal and several incremental improvements on the original BERT implementation. ",
    "url": "https://arxiv.org/abs/2208.04489",
    "authors": [
      "Arvind Subramaniam",
      "Aryan Mehra",
      "Sayani Kundu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.04491",
    "title": "Improving Vaccine Stance Detection by Combining Online and Offline Data",
    "abstract": "Differing opinions about COVID-19 have led to various online discourses regarding vaccines. Due to the detrimental effects and the scale of the COVID-19 pandemic, detecting vaccine stance has become especially important and is attracting increasing attention. Communication during the pandemic is typically done via online and offline sources, which provide two complementary avenues for detecting vaccine stance. Therefore, this paper aims to (1) study the importance of integrating online and offline data to vaccine stance detection; and (2) identify the critical online and offline attributes that influence an individual's vaccine stance. We model vaccine hesitancy as a surrogate for identifying the importance of online and offline factors. With the aid of explainable AI and combinatorial analysis, we conclude that both online and offline factors help predict vaccine stance. ",
    "url": "https://arxiv.org/abs/2208.04491",
    "authors": [
      "Anique Tahir",
      "Lu Cheng",
      "Paras Sheth",
      "Huan Liu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2208.04494",
    "title": "A Time-to-first-spike Coding and Conversion Aware Training for  Energy-Efficient Deep Spiking Neural Network Processor Design",
    "abstract": "In this paper, we present an energy-efficient SNN architecture, which can seamlessly run deep spiking neural networks (SNNs) with improved accuracy. First, we propose a conversion aware training (CAT) to reduce ANN-to-SNN conversion loss without hardware implementation overhead. In the proposed CAT, the activation function developed for simulating SNN during ANN training, is efficiently exploited to reduce the data representation error after conversion. Based on the CAT technique, we also present a time-to-first-spike coding that allows lightweight logarithmic computation by utilizing spike time information. The SNN processor design that supports the proposed techniques has been implemented using 28nm CMOS process. The processor achieves the top-1 accuracies of 91.7%, 67.9% and 57.4% with inference energy of 486.7uJ, 503.6uJ, and 1426uJ to process CIFAR-10, CIFAR-100, and Tiny-ImageNet, respectively, when running VGG-16 with 5bit logarithmic weights. ",
    "url": "https://arxiv.org/abs/2208.04494",
    "authors": [
      "Dongwoo Lew",
      "Kyungchul Lee",
      "Jongsun Park"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04508",
    "title": "Training Overparametrized Neural Networks in Sublinear Time",
    "abstract": "The success of deep learning comes at a tremendous computational and energy cost, and the scalability of training massively overparametrized neural networks is becoming a real barrier to the progress of AI. Despite the popularity and low cost-per-iteration of traditional Backpropagation via gradient decent, SGD has prohibitive convergence rate in non-convex settings, both in theory and practice. To mitigate this cost, recent works have proposed to employ alternative (Newton-type) training methods with much faster convergence rate, albeit with higher cost-per-iteration. For a typical neural network with $m=\\mathrm{poly}(n)$ parameters and input batch of $n$ datapoints in $\\mathbb{R}^d$, the previous work of [Brand, Peng, Song, and Weinstein, ITCS'2021] requires $\\sim mnd + n^3$ time per iteration. In this paper, we present a novel training method that requires only $m^{1-\\alpha} n d + n^3$ amortized time in the same overparametrized regime, where $\\alpha \\in (0.01,1)$ is some fixed constant. This method relies on a new and alternative view of neural networks, as a set of binary search trees, where each iteration corresponds to modifying a small subset of the nodes in the tree. We believe this view would have further applications in the design and analysis of DNNs. ",
    "url": "https://arxiv.org/abs/2208.04508",
    "authors": [
      "Hang Hu",
      "Zhao Song",
      "Omri Weinstein",
      "Danyang Zhuo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.04510",
    "title": "Unsupervised Domain Adaptation for Point Cloud Semantic Segmentation via  Graph Matching",
    "abstract": "Unsupervised domain adaptation for point cloud semantic segmentation has attracted great attention due to its effectiveness in learning with unlabeled data. Most of existing methods use global-level feature alignment to transfer the knowledge from the source domain to the target domain, which may cause the semantic ambiguity of the feature space. In this paper, we propose a graph-based framework to explore the local-level feature alignment between the two domains, which can reserve semantic discrimination during adaptation. Specifically, in order to extract local-level features, we first dynamically construct local feature graphs on both domains and build a memory bank with the graphs from the source domain. In particular, we use optimal transport to generate the graph matching pairs. Then, based on the assignment matrix, we can align the feature distributions between the two domains with the graph-based local feature loss. Furthermore, we consider the correlation between the features of different categories and formulate a category-guided contrastive loss to guide the segmentation model to learn discriminative features on the target domain. Extensive experiments on different synthetic-to-real and real-to-real domain adaptation scenarios demonstrate that our method can achieve state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2208.04510",
    "authors": [
      "Yikai Bian",
      "Le Hui",
      "Jianjun Qian",
      "Jin Xie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04511",
    "title": "Object Detection with Deep Reinforcement Learning",
    "abstract": "Object localization has been a crucial task in computer vision field. Methods of localizing objects in an image have been proposed based on the features of the attended pixels. Recently researchers have proposed methods to formulate object localization as a dynamic decision process, which can be solved by a reinforcement learning approach. In this project, we implement a novel active object localization algorithm based on deep reinforcement learning. We compare two different action settings for this MDP: a hierarchical method and a dynamic method. We further perform some ablation studies on the performance of the models by investigating different hyperparameters and various architecture changes. ",
    "url": "https://arxiv.org/abs/2208.04511",
    "authors": [
      "Manoosh Samiei",
      "Ruofeng Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.04529",
    "title": "Motif-based Graph Representation Learning with Application to Chemical  Molecules",
    "abstract": "This work considers the task of representation learning on the attributed relational graph (ARG). Both the nodes and edges in an ARG are associated with attributes/features allowing ARGs to encode rich structural information widely observed in real applications. Existing graph neural networks offer limited ability to capture complex interactions within local structural contexts, which hinders them from taking advantage of the expression power of ARGs. We propose Motif Convolution Module (MCM), a new motif-based graph representation learning technique to better utilize local structural information. The ability to handle continuous edge and node features is one of MCM's advantages over existing motif-based models. MCM builds a motif vocabulary in an unsupervised way and deploys a novel motif convolution operation to extract the local structural context of individual nodes, which is then used to learn higher-level node representations via multilayer perceptron and/or message passing in graph neural networks. When compared with other graph learning approaches to classifying synthetic graphs, our approach is substantially better in capturing structural context. We also demonstrate the performance and explainability advantages of our approach by applying it to several molecular benchmarks. ",
    "url": "https://arxiv.org/abs/2208.04529",
    "authors": [
      "Yifei Wang",
      "Shiyang Chen",
      "Guobin Chen",
      "Ethan Shurberg",
      "Hang Liu",
      "Pengyu Hong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04530",
    "title": "VectorFlow: Combining Images and Vectors for Traffic Occupancy and Flow  Prediction",
    "abstract": "Predicting future behaviors of road agents is a key task in autonomous driving. While existing models have demonstrated great success in predicting marginal agent future behaviors, it remains a challenge to efficiently predict consistent joint behaviors of multiple agents. Recently, the occupancy flow fields representation was proposed to represent joint future states of road agents through a combination of occupancy grid and flow, which supports efficient and consistent joint predictions. In this work, we propose a novel occupancy flow fields predictor to produce accurate occupancy and flow predictions, by combining the power of an image encoder that learns features from a rasterized traffic image and a vector encoder that captures information of continuous agent trajectories and map states. The two encoded features are fused by multiple attention modules before generating final predictions. Our simple but effective model ranks 3rd place on the Waymo Open Dataset Occupancy and Flow Prediction Challenge, and achieves the best performance in the occluded occupancy and flow prediction task. ",
    "url": "https://arxiv.org/abs/2208.04530",
    "authors": [
      "Xin Huang",
      "Xiaoyu Tian",
      "Junru Gu",
      "Qiao Sun",
      "Hang Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2208.04545",
    "title": "Massive MIMO Channel Prediction Using Machine Learning: Power of Domain  Transformation",
    "abstract": "To compensate the loss from outdated channel state information in wideband massive multiple-input multipleoutput (MIMO) systems, channel prediction can be performed by leveraging the temporal correlation of wireless channels. Machine learning (ML)-based channel predictors for massive MIMO systems were designed recently; however, the time overhead to collect a large amount of training data directly affects the latency of the system. In this paper, we propose a novel ML-based channel prediction technique, which can reduce the time overhead to collect the training data by transforming the domain of channels from subcarrier to antenna in wideband massive MIMO systems. Numerical results show that the proposed technique can not only reduce the time overhead but also give additional performance gain compared to the ML-based channel prediction techniques without the domain transformation. ",
    "url": "https://arxiv.org/abs/2208.04545",
    "authors": [
      "Beomsoo Ko",
      "Hwanjin Kim",
      "Junil Choi"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2208.04547",
    "title": "Emotion Detection From Tweets Using a BERT and SVM Ensemble Model",
    "abstract": "Automatic identification of emotions expressed in Twitter data has a wide range of applications. We create a well-balanced dataset by adding a neutral class to a benchmark dataset consisting of four emotions: fear, sadness, joy, and anger. On this extended dataset, we investigate the use of Support Vector Machine (SVM) and Bidirectional Encoder Representations from Transformers (BERT) for emotion recognition. We propose a novel ensemble model by combining the two BERT and SVM models. Experiments show that the proposed model achieves a state-of-the-art accuracy of 0.91 on emotion recognition in tweets. ",
    "url": "https://arxiv.org/abs/2208.04547",
    "authors": [
      "Ionuţ-Alexandru Albu",
      "Stelian Spînu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.04549",
    "title": "Disentangled Representation Learning Using ($β$-)VAE and GAN",
    "abstract": "Given a dataset of images containing different objects with different features such as shape, size, rotation, and x-y position; and a Variational Autoencoder (VAE); creating a disentangled encoding of these features in the hidden space vector of the VAE was the task of interest in this paper. The dSprite dataset provided the desired features for the required experiments in this research. After training the VAE combined with a Generative Adversarial Network (GAN), each dimension of the hidden vector was disrupted to explore the disentanglement in each dimension. Note that the GAN was used to improve the quality of output image reconstruction. ",
    "url": "https://arxiv.org/abs/2208.04549",
    "authors": [
      "Mohammad Haghir Ebrahimabadi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2208.04580",
    "title": "More Interpretable Graph Similarity Computation via Maximum Common  Subgraph Inference",
    "abstract": "Graph similarity measurement, which computes the distance/similarity between two graphs, arises in various graph-related tasks. Recent learning-based methods lack interpretability, as they directly transform interaction information between two graphs into one hidden vector and then map it to similarity. To cope with this problem, this study proposes a more interpretable end-to-end paradigm for graph similarity learning, named Similarity Computation via Maximum Common Subgraph Inference (INFMCS). Our critical insight into INFMCS is the strong correlation between similarity score and Maximum Common Subgraph (MCS). We implicitly infer MCS to obtain the normalized MCS size, with the supervision information being only the similarity score during training. To capture more global information, we also stack some vanilla transformer encoder layers with graph convolution layers and propose a novel permutation-invariant node Positional Encoding. The entire model is quite simple yet effective. Comprehensive experiments demonstrate that INFMCS consistently outperforms state-of-the-art baselines for graph-graph classification and regression tasks. Ablation experiments verify the effectiveness of the proposed computation paradigm and other components. Also, visualization and statistics of results reveal the interpretability of INFMCS. ",
    "url": "https://arxiv.org/abs/2208.04580",
    "authors": [
      "Zixun Lan",
      "Binjie Hong",
      "Ye Ma",
      "Fei Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.04588",
    "title": "SBPF: Sensitiveness Based Pruning Framework For Convolutional Neural  Network On Image Classification",
    "abstract": "Pruning techniques are used comprehensively to compress convolutional neural networks (CNNs) on image classification. However, the majority of pruning methods require a well pre-trained model to provide useful supporting parameters, such as C1-norm, BatchNorm value and gradient information, which may lead to inconsistency of filter evaluation if the parameters of the pre-trained model are not well optimized. Therefore, we propose a sensitiveness based method to evaluate the importance of each layer from the perspective of inference accuracy by adding extra damage for the original model. Because the performance of the accuracy is determined by the distribution of parameters across all layers rather than individual parameter, the sensitiveness based method will be robust to update of parameters. Namely, we can obtain similar importance evaluation of each convolutional layer between the imperfect-trained and fully trained models. For VGG-16 on CIFAR-10, even when the original model is only trained with 50 epochs, we can get same evaluation of layer importance as the results when the model is trained fully. Then we will remove filters proportional from each layer by the quantified sensitiveness. Our sensitiveness based pruning framework is verified efficiently on VGG-16, a customized Conv-4 and ResNet-18 with CIFAR-10, MNIST and CIFAR-100, respectively. ",
    "url": "https://arxiv.org/abs/2208.04588",
    "authors": [
      "Yiheng Lu",
      "Maoguo Gong",
      "Wei Zhao",
      "Kaiyuan Feng",
      "Hao Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.04589",
    "title": "Long-term Causal Effects Estimation via Latent Surrogates Representation  Learning",
    "abstract": "Estimating long-term causal effects based on short-term surrogates is a significant but challenging problem in many real-world applications, e.g., marketing and medicine. Despite its success in certain domains, most existing methods estimate causal effects in an idealistic and simplistic way - ignoring the causal structure among short-term outcomes and treating all of them as surrogates. However, such methods cannot be well applied to real-world scenarios, in which the partially observed surrogates are mixed with their proxies among short-term outcomes. To this end, we develop our flexible method, Laser, to estimate long-term causal effects in the more realistic situation that the surrogates are observed or have observed proxies.Given the indistinguishability between the surrogates and proxies, we utilize identifiable variational auto-encoder (iVAE) to recover the whole valid surrogates on all the surrogates candidates without the need of distinguishing the observed surrogates or the proxies of latent surrogates. With the help of the recovered surrogates, we further devise an unbiased estimation of long-term causal effects. Extensive experimental results on the real-world and semi-synthetic datasets demonstrate the effectiveness of our proposed method. ",
    "url": "https://arxiv.org/abs/2208.04589",
    "authors": [
      "Ruichu Cai",
      "Weilin Chen",
      "Zeqin Yang",
      "Shu Wan",
      "Chen Zheng",
      "Xiaoqing Yang",
      "Jiecheng Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.04591",
    "title": "Stronger Privacy Amplification by Shuffling for Rényi and Approximate  Differential Privacy",
    "abstract": "The shuffle model of differential privacy has gained significant interest as an intermediate trust model between the standard local and central models [EFMRTT19; CSUZZ19]. A key result in this model is that randomly shuffling locally randomized data amplifies differential privacy guarantees. Such amplification implies substantially stronger privacy guarantees for systems in which data is contributed anonymously [BEMMRLRKTS17]. In this work, we improve the state of the art privacy amplification by shuffling results both theoretically and numerically. Our first contribution is the first asymptotically optimal analysis of the R\\'enyi differential privacy parameters for the shuffled outputs of LDP randomizers. Our second contribution is a new analysis of privacy amplification by shuffling. This analysis improves on the techniques of [FMT20] and leads to tighter numerical bounds in all parameter settings. ",
    "url": "https://arxiv.org/abs/2208.04591",
    "authors": [
      "Vitaly Feldman",
      "Audra McMillan",
      "Kunal Talwar"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.04593",
    "title": "Robust Output Feedback Control Design in the Presence of Sporadic  Measurements",
    "abstract": "Output feedback control design for linear time-invariant systems in the presence of sporadic measurements and exogenous perturbations is addressed. To cope with the sporadic availability of measurements of the output, a hybrid dynamic output feedback controller equipped with a holding device whose state is reset when a new measurement is available is designed. The closed-loop system, resulting from the interconnection of the controller and the plant, is augmented with a timer variable triggering the arrival of new measurements and its properties are analyzed using hybrid system tools. Building upon Lyapunov theory for hybrid systems, sufficient conditions for internal and L2 input-to-output stability are proposed. An LMI-based design methodology for the co-design of the gains of the controller and the parameters of the holding device is presented. The effectiveness of the proposed LMI-based design approach is showcased in a numerical example. ",
    "url": "https://arxiv.org/abs/2208.04593",
    "authors": [
      "Roberto Merco",
      "Francesco Ferrante",
      "Ricardo G. Sanfelice",
      "Pierluigi Pisu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.04600",
    "title": "IDNP: Interest Dynamics Modeling using Generative Neural Processes for  Sequential Recommendation",
    "abstract": "Recent sequential recommendation models rely increasingly on consecutive short-term user-item interaction sequences to model user interests. These approaches have, however, raised concerns about both short- and long-term interests. (1) {\\it short-term}: interaction sequences may not result from a monolithic interest, but rather from several intertwined interests, even within a short period of time, resulting in their failures to model skip behaviors; (2) {\\it long-term}: interaction sequences are primarily observed sparsely at discrete intervals, other than consecutively over the long run. This renders difficulty in inferring long-term interests, since only discrete interest representations can be derived, without taking into account interest dynamics across sequences. In this study, we address these concerns by learning (1) multi-scale representations of short-term interests; and (2) dynamics-aware representations of long-term interests. To this end, we present an \\textbf{I}nterest \\textbf{D}ynamics modeling framework using generative \\textbf{N}eural \\textbf{P}rocesses, coined IDNP, to model user interests from a functional perspective. IDNP learns a global interest function family to define each user's long-term interest as a function instantiation, manifesting interest dynamics through function continuity. Specifically, IDNP first encodes each user's short-term interactions into multi-scale representations, which are then summarized as user context. By combining latent global interest with user context, IDNP then reconstructs long-term user interest functions and predicts interactions at upcoming query timestep. Moreover, IDNP can model such interest functions even when interaction sequences are limited and non-consecutive. Extensive experiments on four real-world datasets demonstrate that our model outperforms state-of-the-arts on various evaluation metrics. ",
    "url": "https://arxiv.org/abs/2208.04600",
    "authors": [
      "Jing Du",
      "Zesheng Ye",
      "Lina Yao",
      "Bin Guo",
      "Zhiwen Yu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04609",
    "title": "E2EG: End-to-End Node Classification Using Graph Topology and Text-based  Node Attributes",
    "abstract": "Node classification utilizing text-based node attributes has many real-world applications, ranging from prediction of paper topics in academic citation graphs to classification of user characteristics in social media networks. State-of-the-art node classification frameworks, such as GIANT, use a two-stage pipeline: first embedding the text attributes of graph nodes then feeding the resulting embeddings into a node classification model. In this paper, we eliminate these two stages and instead develop an end-to-end node classification model that builds upon GIANT, called End-to-End-GIANT (E2EG). The tandem utilization of a main and an auxiliary classification objectives in our approach results in a more robust model, thus enabling the BERT backbone to be switched out for a distilled encoder with a 25% - 40% reduction in the number of parameters. Moreover, the end-to-end nature of the model increases ease of use, as it avoids the need of chaining multiple models for node classification. Compared to a GIANT+MLP baseline on the ogbn-arxiv and ogbn-products datasets, our model is able to obtain slightly better accuracy in the transductive setting (+0.5%), while reducing model training time by up to 40%. Our model is also applicable in the inductive setting, outperforming GIANT+MLP by up to +2.23%. ",
    "url": "https://arxiv.org/abs/2208.04609",
    "authors": [
      "Tu Anh Dinh",
      "Jeroen den Boef",
      "Joran Cornelisse",
      "Paul Groth"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2208.04611",
    "title": "Generative models-based data labeling for deep networks regression:  application to seed maturity estimation from UAV multispectral images",
    "abstract": "Monitoring seed maturity is an increasing challenge in agriculture due to climate change and more restrictive practices. Seeds monitoring in the field is essential to optimize the farming process and to guarantee yield quality through high germination. Traditional methods are based on limited sampling in the field and analysis in laboratory. Moreover, they are time consuming and only allow monitoring sub-sections of the crop field. This leads to a lack of accuracy on the condition of the crop as a whole due to intra-field heterogeneities. Multispectral imagery by UAV allows uniform scan of fields and better capture of crop maturity information. On the other hand, deep learning methods have shown tremendous potential in estimating agronomic parameters, especially maturity. However, they require large labeled datasets. Although large sets of aerial images are available, labeling them with ground truth is a tedious, if not impossible task. In this paper, we propose a method for estimating parsley seed maturity using multispectral UAV imagery, with a new approach for automatic data labeling. This approach is based on parametric and non-parametric models to provide weak labels. We also consider the data acquisition protocol and the performance evaluation of the different steps of the method. Results show good performance, and the non-parametric kernel density estimator model can improve neural network generalization when used as a labeling method, leading to more robust and better performing deep neural models. ",
    "url": "https://arxiv.org/abs/2208.04611",
    "authors": [
      "Eric Dericquebourg",
      "Adel Hafiane",
      "Raphael Canals"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04614",
    "title": "Classification of electromagnetic interference induced image noise in an  analog video link",
    "abstract": "With the ever-increasing electrification of the vehicle showing no sign of retreating, electronic systems deployed in automotive applications are subject to more stringent Electromagnetic Immunity compliance constraints than ever before, to ensure the proximity of nearby electronic systems will not affect their operation. The EMI compliance testing of an analog camera link requires video quality to be monitored and assessed to validate such compliance, which up to now, has been a manual task. Due to the nature of human interpretation, this is open to inconsistency. Here, we propose a solution using deep learning models that analyse, and grade video content derived from an EMI compliance test. These models are trained using a dataset built entirely from real test image data to ensure the accuracy of the resultant model(s) is maximised. Starting with the standard AlexNet, we propose four models to classify the EMI noise level ",
    "url": "https://arxiv.org/abs/2208.04614",
    "authors": [
      "Anthony Purcell",
      "Ciarán Eising"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04619",
    "title": "RDA: Reciprocal Distribution Alignment for Robust SSL",
    "abstract": "In this work, we propose Reciprocal Distribution Alignment (RDA) to address semi-supervised learning (SSL), which is a hyperparameter-free framework that is independent of confidence threshold and works with both the matched (conventionally) and the mismatched class distributions. Distribution mismatch is an often overlooked but more general SSL scenario where the labeled and the unlabeled data do not fall into the identical class distribution. This may lead to the model not exploiting the labeled data reliably and drastically degrade the performance of SSL methods, which could not be rescued by the traditional distribution alignment. In RDA, we enforce a reciprocal alignment on the distributions of the predictions from two classifiers predicting pseudo-labels and complementary labels on the unlabeled data. These two distributions, carrying complementary information, could be utilized to regularize each other without any prior of class distribution. Moreover, we theoretically show that RDA maximizes the input-output mutual information. Our approach achieves promising performance in SSL under a variety of scenarios of mismatched distributions, as well as the conventional matched SSL setting. Our code is available at: https://github.com/NJUyued/RDA4RobustSSL. ",
    "url": "https://arxiv.org/abs/2208.04619",
    "authors": [
      "Yue Duan",
      "Lei Qi",
      "Lei Wang",
      "Luping Zhou",
      "Yinghuan Shi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04620",
    "title": "Cascade-based Echo Chamber Detection",
    "abstract": "Despite echo chambers in social media have been under considerable scrutiny, general models for their detection and analysis are missing. In this work, we aim to fill this gap by proposing a probabilistic generative model that explains social media footprints -- i.e., social network structure and propagations of information -- through a set of latent communities, characterized by a degree of echo-chamber behavior and by an opinion polarity. Specifically, echo chambers are modeled as communities that are permeable to pieces of information with similar ideological polarity, and impermeable to information of opposed leaning: this allows discriminating echo chambers from communities that lack a clear ideological alignment. To learn the model parameters we propose a scalable, stochastic adaptation of the Generalized Expectation Maximization algorithm, that optimizes the joint likelihood of observing social connections and information propagation. Experiments on synthetic data show that our algorithm is able to correctly reconstruct ground-truth latent communities with their degree of echo-chamber behavior and opinion polarity. Experiments on real-world data about polarized social and political debates, such as the Brexit referendum or the COVID-19 vaccine campaign, confirm the effectiveness of our proposal in detecting echo chambers. Finally, we show how our model can improve accuracy in auxiliary predictive tasks, such as stance detection and prediction of future propagations. ",
    "url": "https://arxiv.org/abs/2208.04620",
    "authors": [
      "Marco Minici",
      "Federico Cinus",
      "Corrado Monti",
      "Francesco Bonchi",
      "Giuseppe Manco"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2208.04627",
    "title": "Causal Discovery in Probabilistic Networks with an Identifiable Causal  Effect",
    "abstract": "Causal identification is at the core of the causal inference literature, where complete algorithms have been proposed to identify causal queries of interest. The validity of these algorithms hinges on the restrictive assumption of having access to a correctly specified causal structure. In this work, we study the setting where a probabilistic model of the causal structure is available. Specifically, the edges in a causal graph are assigned probabilities which may, for example, represent degree of belief from domain experts. Alternatively, the uncertainly about an edge may reflect the confidence of a particular statistical test. The question that naturally arises in this setting is: Given such a probabilistic graph and a specific causal effect of interest, what is the subgraph which has the highest plausibility and for which the causal effect is identifiable? We show that answering this question reduces to solving an NP-hard combinatorial optimization problem which we call the edge ID problem. We propose efficient algorithms to approximate this problem, and evaluate our proposed algorithms against real-world networks and randomly generated graphs. ",
    "url": "https://arxiv.org/abs/2208.04627",
    "authors": [
      "Sina Akbari",
      "Fateme Jamshidi",
      "Ehsan Mokhtarian",
      "Matthew J. Vowels",
      "Jalal Etesami",
      "Negar Kiyavash"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2208.04637",
    "title": "Fisher Matrix Based Fault Detection for PMUs Data in Power Grids",
    "abstract": "Abnormal event detection is critical in the safe operation of power system. In this paper, using the data collected from phasor measurement units (PMUs), two methods based on Fisher random matrix are proposed to detect faults in power grids. Firstly, the fault detection matrix is constructed and the event detection problem is reformatted as a two-sample covariance matrices test problem. Secondly, the central limit theorem for the linear spectral statistic of the Fisher matrix is derived and a test statistic for testing faults is proposed. To save computing resources, the screening step of fault interval based on the test statistic is designed to check the existence of faults. Then two point-by-point methods are proposed to determine the time of the fault in the interval. One method detects faults by checking whether the largest sample eigenvalue falls outside the supporting set of limiting spectral distribution of the standard Fisher matrix, which can detect the faults with higher accuracy. The other method tests the faults based on the statistic proposed, which has a faster detection speed. Compared with existing works, the simulation results illustrate that two methods proposed in this paper cost less computational time and provide a higher degree of accuracy. ",
    "url": "https://arxiv.org/abs/2208.04637",
    "authors": [
      "Ke Chen",
      "Dandan Jiang",
      "Bo Wang",
      "Hongxia Wang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.04639",
    "title": "Efficient Out-of-Distribution Detection of Melanoma with Wavelet-based  Normalizing Flows",
    "abstract": "Melanoma is a serious form of skin cancer with high mortality rate at later stages. Fortunately, when detected early, the prognosis of melanoma is promising and malignant melanoma incidence rates are relatively low. As a result, datasets are heavily imbalanced which complicates training current state-of-the-art supervised classification AI models. We propose to use generative models to learn the benign data distribution and detect Out-of-Distribution (OOD) malignant images through density estimation. Normalizing Flows (NFs) are ideal candidates for OOD detection due to their ability to compute exact likelihoods. Nevertheless, their inductive biases towards apparent graphical features rather than semantic context hamper accurate OOD detection. In this work, we aim at using these biases with domain-level knowledge of melanoma, to improve likelihood-based OOD detection of malignant images. Our encouraging results demonstrate potential for OOD detection of melanoma using NFs. We achieve a 9\\% increase in Area Under Curve of the Receiver Operating Characteristics by using wavelet-based NFs. This model requires significantly less parameters for inference making it more applicable on edge devices. The proposed methodology can aid medical experts with diagnosis of skin-cancer patients and continuously increase survival rates. Furthermore, this research paves the way for other areas in oncology with similar data imbalance issues\\footnote{Code available at: https://github.com/A-Vzer/WaveletFlowPytorch} ",
    "url": "https://arxiv.org/abs/2208.04639",
    "authors": [
      "M.M. Amaan Valiuddin",
      "Christiaan G.A. Viviers",
      "Ruud J.G. van Sloun",
      "Peter H.N. de With",
      "Fons van der Sommen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04641",
    "title": "ASR Error Correction with Constrained Decoding on Operation Prediction",
    "abstract": "Error correction techniques remain effective to refine outputs from automatic speech recognition (ASR) models. Existing end-to-end error correction methods based on an encoder-decoder architecture process all tokens in the decoding phase, creating undesirable latency. In this paper, we propose an ASR error correction method utilizing the predictions of correction operations. More specifically, we construct a predictor between the encoder and the decoder to learn if a token should be kept (\"K\"), deleted (\"D\"), or changed (\"C\") to restrict decoding to only part of the input sequence embeddings (the \"C\" tokens) for fast inference. Experiments on three public datasets demonstrate the effectiveness of the proposed approach in reducing the latency of the decoding process in ASR correction. It enhances the inference speed by at least three times (3.4 and 5.7 times) while maintaining the same level of accuracy (with WER reductions of 0.53% and 1.69% respectively) for our two proposed models compared to a solid encoder-decoder baseline. In the meantime, we produce and release a benchmark dataset contributing to the ASR error correction community to foster research along this line. ",
    "url": "https://arxiv.org/abs/2208.04641",
    "authors": [
      "Jingyuan Yang",
      "Rongjun Li",
      "Wei Peng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2208.04668",
    "title": "Energy-Efficient Power Allocation for an Underlay Spectrum Sharing  RadioWeaves Network",
    "abstract": "RadioWeaves network operates a large number of distributed antennas using cell-free architecture to provide high data rates and support a large number of users. Operating this network in an energy-efficient manner in the limited available spectrum is crucial. Therefore, we consider energy efficiency (EE) maximization of a RadioWeaves network that shares spectrum with a collocated primary network in underlay mode. To simplify the problem, we lower bound the non-convex EE objective function to form a convex problem. We then propose a downlink power allocation policy that maximizes the EE of the secondary RadioWeaves network subject to power constraint at each access point and interference constraint at each primary user. Our numerical results investigate the secondary system's performance in interference, power, and EE constrained regimes with correlated fading channels. Furthermore, they show that the proposed power allocation scheme performs significantly better than the simpler equal power allocation scheme. ",
    "url": "https://arxiv.org/abs/2208.04668",
    "authors": [
      "Zakir Hussain Shaik",
      "Rimalapudi Sarvendranath",
      "Erik G. Larsson"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2208.04697",
    "title": "Let it RAIN for Social Good",
    "abstract": "Artificial Intelligence (AI) as a highly transformative technology take on a special role as both an enabler and a threat to UN Sustainable Development Goals (SDGs). AI Ethics and emerging high-level policy efforts stand at the pivot point between these outcomes but is barred from effect due the abstraction gap between high-level values and responsible action. In this paper the Responsible Norms (RAIN) framework is presented, bridging this gap thereby enabling effective high-level control of AI impact. With effective and operationalized AI Ethics, AI technologies can be directed towards global sustainable development. ",
    "url": "https://arxiv.org/abs/2208.04697",
    "authors": [
      "Mattias Brännström",
      "Andreas Theodorou",
      "Virginia Dignum"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.04719",
    "title": "STELLA: Sparse Taint Analysis for Enclave Leakage Detection",
    "abstract": "Intel SGX (Software Guard Extension) is a promising TEE (trusted execution environment) technique that can protect programs running in user space from being maliciously accessed by the host operating system. Although it provides hardware access control and memory encryption, the actual effectiveness also depends on the quality of the software. In particular, improper implementation of a code snippet running inside the enclave may still leak private data due to the invalid use of pointers. This paper serves as a first attempt to study the privacy leakage issues of enclave code and proposes a novel static sparse taint analysis approach to detect them. We first summarize five common patterns of leakage code. Based on these patterns, our approach performs forward analysis to recognize all taint sinks and then employs a backward approach to detect leakages. Finally, we have conducted experiments with several open-source enclave programs and found 78 vulnerabilities previously unknown in 13 projects. ",
    "url": "https://arxiv.org/abs/2208.04719",
    "authors": [
      "Yang Chen",
      "Jianfeng jiang",
      "Shoumeng Yan",
      "Hui Xu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2208.04728",
    "title": "A New Approach to Line-Sphere and Line-Quadrics Intersection Detection  and Computation",
    "abstract": "Line intersection with convex and un-convex polygons or polyhedron algorithms are well known as line clipping algorithms and very often used in computer graphics. Rendering of geometrical problems often leads to ray tracing techniques, when an intersection of many lines with spheres or quadrics is a critical issue due to ray-tracing algorithm complexity. A new formulation of detection and computation of the intersection of line (ray) with a quadric surface is presented, which separates geometric properties of the line and quadrics that enables pre-computation. The presented approach is especially convenient for implementation with SSE instructions or on GPU ",
    "url": "https://arxiv.org/abs/2208.04728",
    "authors": [
      "Vaclav Skala"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2208.04732",
    "title": "Efficient Novelty Detection Methods for Early Warning of Potential Fatal  Diseases",
    "abstract": "Fatal diseases, as Critical Health Episodes (CHEs), represent real dangers for patients hospitalized in Intensive Care Units. These episodes can lead to irreversible organ damage and death. Nevertheless, diagnosing them in time would greatly reduce their inconvenience. This study therefore focused on building a highly effective early warning system for CHEs such as Acute Hypotensive Episodes and Tachycardia Episodes. To facilitate the precocity of the prediction, a gap of one hour was considered between the observation periods (Observation Windows) and the periods during which a critical event can occur (Target Windows). The MIMIC II dataset was used to evaluate the performance of the proposed system. This system first includes extracting additional features using three different modes. Then, the feature selection process allowing the selection of the most relevant features was performed using the Mutual Information Gain feature importance. Finally, the high-performance predictive model LightGBM was used to perform episode classification. This approach called MIG-LightGBM was evaluated using five different metrics: Event Recall (ER), Reduced Precision (RP), average Anticipation Time (aveAT), average False Alarms (aveFA), and Event F1-score (EF1-score). A method is therefore considered highly efficient for the early prediction of CHEs if it exhibits not only a large aveAT but also a large EF1-score and a low aveFA. Compared to systems using Extreme Gradient Boosting, Support Vector Classification or Naive Bayes as a predictive model, the proposed system was found to be highly dominant. It also confirmed its superiority over the Layered Learning approach. ",
    "url": "https://arxiv.org/abs/2208.04732",
    "authors": [
      "Sèdjro Salomon Hotegni",
      "Ernest Fokoué"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04749",
    "title": "Where's the Learning in Representation Learning for Compositional  Semantics and the Case of Thematic Fit",
    "abstract": "Observing that for certain NLP tasks, such as semantic role prediction or thematic fit estimation, random embeddings perform as well as pretrained embeddings, we explore what settings allow for this and examine where most of the learning is encoded: the word embeddings, the semantic role embeddings, or ``the network''. We find nuanced answers, depending on the task and its relation to the training objective. We examine these representation learning aspects in multi-task learning, where role prediction and role-filling are supervised tasks, while several thematic fit tasks are outside the models' direct supervision. We observe a non-monotonous relation between some tasks' quality score and the training data size. In order to better understand this observation, we analyze these results using easier, per-verb versions of these tasks. ",
    "url": "https://arxiv.org/abs/2208.04749",
    "authors": [
      "Mughilan Muthupari",
      "Samrat Halder",
      "Asad Sayeed",
      "Yuval Marton"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.04761",
    "title": "Digital health shopping assistant with React Native: a simple  technological solution to a complex health problem",
    "abstract": "Today, more and more people are reporting allergies, which can range from simple reactions close to discomfort to anaphylactic shocks. Other people may not be allergic but avoid certain foods for personal reasons. Daily food shopping of these people is hampered by the fact that unwanted ingredients can be hidden in any food, and it is difficult to find them all. The paper presents a digital health shopping assistant called \"Diet Helper\", aimed to make life easier for such people by making it easy to determine whether a product is suitable for consumption, according to the specific dietary requirements of both types - existing diet and self-defined. This is achieved by capturing ingredient label, received by the app as an input, which the app analyses, converting the captured label to text, and filters out unwanted ingredients that according to the user should be avoided as either allergens or products to which the consumer is intolerant etc, helping the user decide if the product is suitable for consumption. This should make daily grocery shopping easier by providing the user with more accurate and simplified product selection in seconds, reducing the total time spent in the grocery stores, which is especially relevant in light of COVID-19, although it was and will remain out of it due to the busy schedules and active rhythm of life of modern society. The app is developed using the React Native framework and Google Firebase platform, which makes it easy to develop, use and extend such solutions thereby encouraging to start actively developing solutions that could improve wellbeing. ",
    "url": "https://arxiv.org/abs/2208.04761",
    "authors": [
      "Alina Govoruhina",
      "Anastasija Nikiforova"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Databases (cs.DB)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2208.04802",
    "title": "Integrating connection search in graph queries",
    "abstract": "Graph data management and querying has many practical applications. When graphs are very heterogeneous and/or users are unfamiliar with their structure, they may need to find how two or more groups of nodes are connected in a graph, even when users are not able to describe the connections. This is only partially supported by existing query languages, which allow searching for paths, but not for trees connecting three or more node groups. The latter is related to the NP-hard Group Steiner Tree problem, and has been previously considered for keyword search in databases. In this work, we formally show how to integrate connecting tree patterns (CTPs, in short) within a graph query language such as SPARQL or Cypher, leading to an Extended Query Language (or EQL, in short). We then study a set of algorithms for evaluating CTPs; we generalize prior keyword search work, most importantly by (i) considering bidirectional edge traversal and (ii) allowing users to select any score function for ranking CTP results. To cope with very large search spaces, we propose an efficient pruning technique and formally establish a large set of cases where our algorithm, MOLESP, is complete even with pruning. Our experiments validate the performance of our CTP and EQL evaluation algorithms on a large set of synthetic and real-world workloads. ",
    "url": "https://arxiv.org/abs/2208.04802",
    "authors": [
      "Angelos Christos Anadiotis",
      "Ioana Manolescu",
      "Madhulika Mohanty"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.04807",
    "title": "HyperNST: Hyper-Networks for Neural Style Transfer",
    "abstract": "We present HyperNST; a neural style transfer (NST) technique for the artistic stylization of images, based on Hyper-networks and the StyleGAN2 architecture. Our contribution is a novel method for inducing style transfer parameterized by a metric space, pre-trained for style-based visual search (SBVS). We show for the first time that such space may be used to drive NST, enabling the application and interpolation of styles from an SBVS system. The technical contribution is a hyper-network that predicts weight updates to a StyleGAN2 pre-trained over a diverse gamut of artistic content (portraits), tailoring the style parameterization on a per-region basis using a semantic map of the facial regions. We show HyperNST to exceed state of the art in content preservation for our stylized content while retaining good style transfer performance. ",
    "url": "https://arxiv.org/abs/2208.04807",
    "authors": [
      "Dan Ruta",
      "Andrew Gilbert",
      "Saeid Motiian",
      "Baldo Faieta",
      "Zhe Lin",
      "John Collomosse"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04811",
    "title": "An Unconstrained Symmetric Nonnegative Latent Factor Analysis for  Large-scale Undirected Weighted Networks",
    "abstract": "Large-scale undirected weighted networks are usually found in big data-related research fields. It can naturally be quantified as a symmetric high-dimensional and incomplete (SHDI) matrix for implementing big data analysis tasks. A symmetric non-negative latent-factor-analysis (SNL) model is able to efficiently extract latent factors (LFs) from an SHDI matrix. Yet it relies on a constraint-combination training scheme, which makes it lack flexibility. To address this issue, this paper proposes an unconstrained symmetric nonnegative latent-factor-analysis (USNL) model. Its main idea is two-fold: 1) The output LFs are separated from the decision parameters via integrating a nonnegative mapping function into an SNL model; and 2) Stochastic gradient descent (SGD) is adopted for implementing unconstrained model training along with ensuring the output LFs nonnegativity. Empirical studies on four SHDI matrices generated from real big data applications demonstrate that an USNL model achieves higher prediction accuracy of missing data than an SNL model, as well as highly competitive computational efficiency. ",
    "url": "https://arxiv.org/abs/2208.04811",
    "authors": [
      "Zhe Xie",
      "Weiling Li",
      "Yurong Zhong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04838",
    "title": "Robust Machine Learning for Malware Detection over Time",
    "abstract": "The presence and persistence of Android malware is an on-going threat that plagues this information era, and machine learning technologies are now extensively used to deploy more effective detectors that can block the majority of these malicious programs. However, these algorithms have not been developed to pursue the natural evolution of malware, and their performances significantly degrade over time because of such concept-drift. Currently, state-of-the-art techniques only focus on detecting the presence of such drift, or they address it by relying on frequent updates of models. Hence, there is a lack of knowledge regarding the cause of the concept drift, and ad-hoc solutions that can counter the passing of time are still under-investigated. In this work, we commence to address these issues as we propose (i) a drift-analysis framework to identify which characteristics of data are causing the drift, and (ii) SVM-CB, a time-aware classifier that leverages the drift-analysis information to slow down the performance drop. We highlight the efficacy of our contribution by comparing its degradation over time with a state-of-the-art classifier, and we show that SVM-CB better withstands the distribution changes that naturally characterize the malware domain. We conclude by discussing the limitations of our approach and how our contribution can be taken as a first step towards more time-resistant classifiers that not only tackle, but also understand the concept drift that affects data. ",
    "url": "https://arxiv.org/abs/2208.04838",
    "authors": [
      "Daniele Angioni",
      "Luca Demetrio",
      "Maura Pintor",
      "Battista Biggio"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.04846",
    "title": "Mining Reaction and Diffusion Dynamics in Social Activities",
    "abstract": "Large quantifies of online user activity data, such as weekly web search volumes, which co-evolve with the mutual influence of several queries and locations, serve as an important social sensor. It is an important task to accurately forecast the future activity by discovering latent interactions from such data, i.e., the ecosystems between each query and the flow of influences between each area. However, this is a difficult problem in terms of data quantity and complex patterns covering the dynamics. To tackle the problem, we propose FluxCube, which is an effective mining method that forecasts large collections of co-evolving online user activity and provides good interpretability. Our model is the expansion of a combination of two mathematical models: a reaction-diffusion system provides a framework for modeling the flow of influences between local area groups and an ecological system models the latent interactions between each query. Also, by leveraging the concept of physics-informed neural networks, FluxCube achieves high interpretability obtained from the parameters and high forecasting performance, together. Extensive experiments on real datasets showed that FluxCube outperforms comparable models in terms of the forecasting accuracy, and each component in FluxCube contributes to the enhanced performance. We then show some case studies that FluxCube can extract useful latent interactions between queries and area groups. ",
    "url": "https://arxiv.org/abs/2208.04846",
    "authors": [
      "Taichi Murayama",
      "Yasuko Matsubara",
      "Sakurai Yasushi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04880",
    "title": "Loop Shaping with Scaled Relative Graphs",
    "abstract": "The Scaled Relative Graph (SRG) is a generalization of the Nyquist diagram that may be plotted for nonlinear operators, and allows nonlinear robustness margins to be defined graphically. This abstract explores techniques for shaping the SRG of an operator in order to maximize these robustness margins. ",
    "url": "https://arxiv.org/abs/2208.04880",
    "authors": [
      "Thomas Chaffey",
      "Fulvio Forni",
      "Rodolphe Sepulchre"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.04882",
    "title": "Unsupervised Question Clarity Prediction Through Retrieved Item  Coherency",
    "abstract": "Despite recent progress on conversational systems, they still do not perform smoothly and coherently when faced with ambiguous requests. When questions are unclear, conversational systems should have the ability to ask clarifying questions, rather than assuming a particular interpretation or simply responding that they do not understand. Previous studies have shown that users are more satisfied when asked a clarifying question, rather than receiving an unrelated response. While the research community has paid substantial attention to the problem of predicting query ambiguity in traditional search contexts, researchers have paid relatively little attention to predicting when this ambiguity is sufficient to warrant clarification in the context of conversational systems. In this paper, we propose an unsupervised method for predicting the need for clarification. This method is based on the measured coherency of results from an initial answer retrieval step, under the assumption that a less ambiguous query is more likely to retrieve more coherent results when compared to an ambiguous query. We build a graph from retrieved items based on their context similarity, treating measures of graph connectivity as indicators of ambiguity. We evaluate our approach on two recently released open-domain conversational question answering datasets, ClariQ and AmbigNQ, comparing it with neural and non-neural baselines. Our unsupervised approach performs as well as supervised approaches while providing better generalization. ",
    "url": "https://arxiv.org/abs/2208.04882",
    "authors": [
      "Negar Arabzadeh",
      "Mahsa Seifikar",
      "Charles L. A. Clarke"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2208.04883",
    "title": "Neural-Rendezvous: Learning-based Robust Guidance and Control to  Encounter Interstellar Objects",
    "abstract": "Interstellar objects (ISOs), astronomical objects not gravitationally bound to the Sun, are likely representatives of primitive materials invaluable in understanding exoplanetary star systems. Due to their poorly constrained orbits with generally high inclinations and relative velocities, however, exploring ISOs with conventional human-in-the-loop approaches is significantly challenging. This paper presents Neural-Rendezvous -- a deep learning-based guidance and control framework for encountering any fast-moving objects, including ISOs, robustly, accurately, and autonomously in real-time. It uses pointwise minimum norm tracking control on top of a guidance policy modeled by a spectrally-normalized deep neural network, where its hyperparameters are tuned with a newly introduced loss function directly penalizing the state trajectory tracking error. We rigorously show that, even in the challenging case of ISO exploration, Neural-Rendezvous provides 1) a high probability exponential bound on the expected spacecraft delivery error; and 2) a finite optimality gap with respect to the solution of model predictive control, both of which are indispensable especially for such a critical space mission. In numerical simulations, Neural-Rendezvous is demonstrated to achieve a terminal-time delivery error of less than 0.2 km for 99% of the ISO candidates with realistic state uncertainty, whilst retaining computational efficiency sufficient for real-time implementation. ",
    "url": "https://arxiv.org/abs/2208.04883",
    "authors": [
      "Hiroyasu Tsukamoto",
      "Soon-Jo Chung",
      "Benjamin Donitz",
      "Michel Ingham",
      "Declan Mages",
      "Yashwanth Kumar Nakka"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2208.04892",
    "title": "Intrinsically Motivated Learning of Causal World Models",
    "abstract": "Despite the recent progress in deep learning and reinforcement learning, transfer and generalization of skills learned on specific tasks is very limited compared to human (or animal) intelligence. The lifelong, incremental building of common sense knowledge might be a necessary component on the way to achieve more general intelligence. A promising direction is to build world models capturing the true physical mechanisms hidden behind the sensorimotor interaction with the environment. Here we explore the idea that inferring the causal structure of the environment could benefit from well-chosen actions as means to collect relevant interventional data. ",
    "url": "https://arxiv.org/abs/2208.04892",
    "authors": [
      "Louis Annabi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04910",
    "title": "Deep Learning-Based Objective and Reproducible Osteosarcoma Chemotherapy  Response Assessment and Outcome Prediction",
    "abstract": "Osteosarcoma is the most common primary bone cancer whose standard treatment includes pre-operative chemotherapy followed by resection. Chemotherapy response is used for predicting prognosis and further management of patients. Necrosis is routinely assessed post-chemotherapy from histology slides on resection specimens where necrosis ratio is defined as the ratio of necrotic tumor to overall tumor. Patients with necrosis ratio >=90% are known to have better outcome. Manual microscopic review of necrosis ratio from multiple glass slides is semi-quantitative and can have intra- and inter-observer variability. We propose an objective and reproducible deep learning-based approach to estimate necrosis ratio with outcome prediction from scanned hematoxylin and eosin whole slide images. We collected 103 osteosarcoma cases with 3134 WSIs to train our deep learning model, to validate necrosis ratio assessment, and to evaluate outcome prediction. We trained Deep Multi-Magnification Network to segment multiple tissue subtypes including viable tumor and necrotic tumor in pixel-level and to calculate case-level necrosis ratio from multiple WSIs. We showed necrosis ratio estimated by our segmentation model highly correlates with necrosis ratio from pathology reports manually assessed by experts where mean absolute differences for Grades IV (100%), III (>=90%), and II (>=50% and <90%) necrosis response are 4.4%, 4.5%, and 17.8%, respectively. We successfully stratified patients to predict overall survival with p=10^-6 and progression-free survival with p=0.012. Our reproducible approach without variability enabled us to tune cutoff thresholds, specifically for our model and our data set, to 80% for OS and 60% for PFS. Our study indicates deep learning can support pathologists as an objective tool to analyze osteosarcoma from histology for assessing treatment response and predicting patient outcome. ",
    "url": "https://arxiv.org/abs/2208.04910",
    "authors": [
      "David Joon Ho",
      "Narasimhan P. Agaram",
      "Marc-Henri Jean",
      "Stephanie D. Suser",
      "Cynthia Chu",
      "Chad M. Vanderbilt",
      "Paul A. Meyers",
      "Leonard H. Wexler",
      "John H. Healey",
      "Thomas J. Fuchs",
      "Meera R. Hameed"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04924",
    "title": "On the Activation Function Dependence of the Spectral Bias of Neural  Networks",
    "abstract": "Neural networks are universal function approximators which are known to generalize well despite being dramatically overparameterized. We study this phenomenon from the point of view of the spectral bias of neural networks. Our contributions are two-fold. First, we provide a theoretical explanation for the spectral bias of ReLU neural networks by leveraging connections with the theory of finite element methods. Second, based upon this theory we predict that switching the activation function to a piecewise linear B-spline, namely the Hat function, will remove this spectral bias, which we verify empirically in a variety of settings. Our empirical studies also show that neural networks with the Hat activation function are trained significantly faster using stochastic gradient descent and ADAM. Combined with previous work showing that the Hat activation function also improves generalization accuracy on image classification tasks, this indicates that using the Hat activation provides significant advantages over the ReLU on certain problems. ",
    "url": "https://arxiv.org/abs/2208.04924",
    "authors": [
      "Qingguo Hong",
      "Qinyang Tan",
      "Jonathan W. Siegel",
      "Jinchao Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03953",
    "title": "Intelligent MIMO Detection Using Meta Learning",
    "abstract": "In a K-best detector for multiple-input-multiple-output(MIMO) systems, the value of K needs to be sufficiently large to achieve near-maximum-likelihood (ML) performance. By treating K as a variable that can be adjusted according to a fitting function of some learnable coefficients, an intelligent MIMO detection network based on deep neural networks (DNN) is proposed to reduce complexity of the detection algorithm with little performance degradation. In particular, the proposed intelligent detection algorithm uses meta learning to learn the coefficients of the fitting function for K to circumvent the problem of learning K directly. The idea of network fusion is used to combine the learning results of the meta learning component networks. Simulation results show that the proposed scheme achieves near-ML detection performance while its complexity is close to that of linear detectors. Besides, it also exhibits strong ability of fast training. ",
    "url": "https://arxiv.org/abs/2208.03953",
    "authors": [
      "Haomiao Huo",
      "Jindan Xu",
      "Gege Su",
      "Wei Xu",
      "Ning Wang"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2208.04446",
    "title": "Safe Dual Gradient Method for Network Utility Maximization Problems",
    "abstract": "In this paper, we introduce a novel first-order dual gradient algorithm for solving network utility maximization problems that arise in resource allocation schemes over networks with safety-critical constraints. Inspired by applications where customers' demand can only be affected through posted prices and real-time two-way communication with customers is not available, we require an algorithm to generate \\textit{safe prices}. This means that at no iteration should the realized demand in response to the posted prices violate the safety constraints of the network. Thus, in contrast to existing first-order methods, our algorithm, called the safe dual gradient method (SDGM), is guaranteed to produce feasible primal iterates at all iterations. We ensure primal feasibility by 1) adding a diminishing safety margin to the constraints, and 2) using a sign-based dual update method with different step sizes for plus and minus directions. In addition, we prove that the primal iterates produced by the SDGM achieve a sublinear static regret of ${\\cal O}(\\sqrt{T})$. ",
    "url": "https://arxiv.org/abs/2208.04446",
    "authors": [
      "Berkay Turan",
      "Mahnoosh Alizadeh"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.04468",
    "title": "Deep Maxout Network Gaussian Process",
    "abstract": "Study of neural networks with infinite width is important for better understanding of the neural network in practical application. In this work, we derive the equivalence of the deep, infinite-width maxout network and the Gaussian process (GP) and characterize the maxout kernel with a compositional structure. Moreover, we build up the connection between our deep maxout network kernel and deep neural network kernels. We also give an efficient numerical implementation of our kernel which can be adapted to any maxout rank. Numerical results show that doing Bayesian inference based on the deep maxout network kernel can lead to competitive results compared with their finite-width counterparts and deep neural network kernels. This enlightens us that the maxout activation may also be incorporated into other infinite-width neural network structures such as the convolutional neural network (CNN). ",
    "url": "https://arxiv.org/abs/2208.04468",
    "authors": [
      "Libin Liang",
      "Ye Tian",
      "Ge Cheng"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04481",
    "title": "Synthetic Aperture Radar Image Change Detection via Layer  Attention-Based Noise-Tolerant Network",
    "abstract": "Recently, change detection methods for synthetic aperture radar (SAR) images based on convolutional neural networks (CNN) have gained increasing research attention. However, existing CNN-based methods neglect the interactions among multilayer convolutions, and errors involved in the preclassification restrict the network optimization. To this end, we proposed a layer attention-based noise-tolerant network, termed LANTNet. In particular, we design a layer attention module that adaptively weights the feature of different convolution layers. In addition, we design a noise-tolerant loss function that effectively suppresses the impact of noisy labels. Therefore, the model is insensitive to noisy labels in the preclassification results. The experimental results on three SAR datasets show that the proposed LANTNet performs better compared to several state-of-the-art methods. The source codes are available at https://github.com/summitgao/LANTNet ",
    "url": "https://arxiv.org/abs/2208.04481",
    "authors": [
      "Desen Meng",
      "Feng Gao",
      "Junyu Dong",
      "Qian Du",
      "Heng-Chao Li"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04524",
    "title": "Multiple Instance Neural Networks Based on Sparse Attention for Cancer  Detection using T-cell Receptor Sequences",
    "abstract": "Early detection of cancers has been much explored due to its paramount importance in biomedical fields. Among different types of data used to answer this biological question, studies based on T cell receptors (TCRs) are under recent spotlight due to the growing appreciation of the roles of the host immunity system in tumor biology. However, the one-to-many correspondence between a patient and multiple TCR sequences hinders researchers from simply adopting classical statistical/machine learning methods. There were recent attempts to model this type of data in the context of multiple instance learning (MIL). Despite the novel application of MIL to cancer detection using TCR sequences and the demonstrated adequate performance in several tumor types, there is still room for improvement, especially for certain cancer types. Furthermore, explainable neural network models are not fully investigated for this application. In this article, we propose multiple instance neural networks based on sparse attention (MINN-SA) to enhance the performance in cancer detection and explainability. The sparse attention structure drops out uninformative instances in each bag, achieving both interpretability and better predictive performance in combination with the skip connection. Our experiments show that MINN-SA yields the highest area under the ROC curve (AUC) scores on average measured across 10 different types of cancers, compared to existing MIL approaches. Moreover, we observe from the estimated attentions that MINN-SA can identify the TCRs that are specific for tumor antigens in the same T cell repertoire. ",
    "url": "https://arxiv.org/abs/2208.04524",
    "authors": [
      "Younghoon Kim",
      "Tao Wang",
      "Danyi Xiong",
      "Xinlei Wang",
      "Seongoh Park"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04626",
    "title": "Recycling an anechoic pre-trained speech separation deep neural network  for binaural dereverberation of a single source",
    "abstract": "Reverberation results in reduced intelligibility for both normal and hearing-impaired listeners. This paper presents a novel psychoacoustic approach of dereverberation of a single speech source by recycling a pre-trained binaural anechoic speech separation neural network. As training the deep neural network (DNN) is a lengthy and computationally expensive process, the advantage of using a pre-trained separation network for dereverberation is that the network does not need to be retrained, saving both time and computational resources. The interaural cues of a reverberant source are given to this pretrained neural network to discriminate between the direct path signal and the reverberant speech. The results show an average improvement of 1.3% in signal intelligibility, 0.83 dB in SRMR (signal to reverberation energy ratio) and 0.16 points in perceptual evaluation of speech quality (PESQ) over other state-of-the-art signal processing dereverberation algorithms and 14% in intelligibility and 0.35 points in quality over orthogonal matching pursuit with spectral subtraction (OSS), a machine learning based dereverberation algorithm. ",
    "url": "https://arxiv.org/abs/2208.04626",
    "authors": [
      "Sania Gul",
      "Muhammad Salman Khan",
      "Syed Waqar Shah",
      "Ata Ur-Rehman"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2208.04654",
    "title": "Extending GCC-PHAT using Shift Equivariant Neural Networks",
    "abstract": "Speaker localization using microphone arrays depends on accurate time delay estimation techniques. For decades, methods based on the generalized cross correlation with phase transform (GCC-PHAT) have been widely adopted for this purpose. Recently, the GCC-PHAT has also been used to provide input features to neural networks in order to remove the effects of noise and reverberation, but at the cost of losing theoretical guarantees in noise-free conditions. We propose a novel approach to extending the GCC-PHAT, where the received signals are filtered using a shift equivariant neural network that preserves the timing information contained in the signals. By extensive experiments we show that our model consistently reduces the error of the GCC-PHAT in adverse environments, with guarantees of exact time delay recovery in ideal conditions. ",
    "url": "https://arxiv.org/abs/2208.04654",
    "authors": [
      "Axel Berg",
      "Mark O'Connor",
      "Kalle Åström",
      "Magnus Oskarsson"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2208.04661",
    "title": "OL-DN: Online learning based dual-domain network for HEVC intra frame  quality enhancement",
    "abstract": "Convolution neural network (CNN) based methods offer effective solutions for enhancing the quality of compressed image and video. However, these methods ignore using the raw data to enhance the quality. In this paper, we adopt the raw data in the quality enhancement for the HEVC intra-coded image by proposing an online learning-based method. When quality enhancement is demanded, we online train our proposed model at encoder side and then use the parameters to update the model of decoder side. This method not only improves model performance, but also makes one model adoptable to multiple coding scenarios. Besides, quantization error in discrete cosine transform (DCT) coefficients is the root cause of various HEVC compression artifacts. Thus, we combine frequency domain priors to assist image reconstruction. We design a DCT based convolution layer, to produce DCT coefficients that are suitable for CNN learning. Experimental results show that our proposed online learning based dual-domain network (OL-DN) has achieved superior performance, compared with the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2208.04661",
    "authors": [
      "Renwei Yang",
      "Shuyuan Zhu",
      "Xiaozhen Zheng",
      "Bing Zeng"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04667",
    "title": "Representation learning of rare temporal conditions for travel time  prediction",
    "abstract": "Predicting travel time under rare temporal conditions (e.g., public holidays, school vacation period, etc.) constitutes a challenge due to the limitation of historical data. If at all available, historical data often form a heterogeneous time series due to high probability of other changes over long periods of time (e.g., road works, introduced traffic calming initiatives, etc.). This is especially prominent in cities and suburban areas. We present a vector-space model for encoding rare temporal conditions, that allows coherent representation learning across different temporal conditions. We show increased performance for travel time prediction over different baselines when utilizing the vector-space encoding for representing the temporal setting. ",
    "url": "https://arxiv.org/abs/2208.04667",
    "authors": [
      "Niklas Petersen",
      "Filipe Rodrigues",
      "Francisco Pereira"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04679",
    "title": "Improved Multiple-Image-Based Reflection Removal Algorithm Using Deep  Neural Networks",
    "abstract": "When imaging through a semi-reflective medium such as glass, the reflection of another scene can often be found in the captured images. It degrades the quality of the images and affects their subsequent analyses. In this paper, a novel deep neural network approach for solving the reflection problem in imaging is presented. Traditional reflection removal methods not only require long computation time for solving different optimization functions, their performance is also not guaranteed. As array cameras are readily available in nowadays imaging devices, we first suggest in this paper a multiple-image based depth estimation method using a convolutional neural network (CNN). The proposed network avoids the depth ambiguity problem due to the reflection in the image, and directly estimates the depths along the image edges. They are then used to classify the edges as belonging to the background or reflection. Since edges having similar depth values are error prone in the classification, they are removed from the reflection removal process. We suggest a generative adversarial network (GAN) to regenerate the removed background edges. Finally, the estimated background edge map is fed to another auto-encoder network to assist the extraction of the background from the original image. Experimental results show that the proposed reflection removal algorithm achieves superior performance both quantitatively and qualitatively as compared to the state-of-the-art methods. The proposed algorithm also shows much faster speed compared to the existing approaches using the traditional optimization methods. ",
    "url": "https://arxiv.org/abs/2208.04679",
    "authors": [
      "Tingtian Li",
      "Yuk-Hee Chan",
      "Daniel P.K. Lun"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04718",
    "title": "Improving COVID-19 CT Classification of CNNs by Learning  Parameter-Efficient Representation",
    "abstract": "COVID-19 pandemic continues to spread rapidly over the world and causes a tremendous crisis in global human health and the economy. Its early detection and diagnosis are crucial for controlling the further spread. Many deep learning-based methods have been proposed to assist clinicians in automatic COVID-19 diagnosis based on computed tomography imaging. However, challenges still remain, including low data diversity in existing datasets, and unsatisfied detection resulting from insufficient accuracy and sensitivity of deep learning models. To enhance the data diversity, we design augmentation techniques of incremental levels and apply them to the largest open-access benchmark dataset, COVIDx CT-2A. Meanwhile, similarity regularization (SR) derived from contrastive learning is proposed in this study to enable CNNs to learn more parameter-efficient representations, thus improving the accuracy and sensitivity of CNNs. The results on seven commonly used CNNs demonstrate that CNN performance can be improved stably through applying the designed augmentation and SR techniques. In particular, DenseNet121 with SR achieves an average test accuracy of 99.44% in three trials for three-category classification, including normal, non-COVID-19 pneumonia, and COVID-19 pneumonia. And the achieved precision, sensitivity, and specificity for the COVID-19 pneumonia category are 98.40%, 99.59%, and 99.50%, respectively. These statistics suggest that our method has surpassed the existing state-of-the-art methods on the COVIDx CT-2A dataset. ",
    "url": "https://arxiv.org/abs/2208.04718",
    "authors": [
      "Yujia Xu",
      "Hak-Keung Lam",
      "Guangyu Jia",
      "Jian Jiang",
      "Junkai Liao",
      "Xinqi Bao"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04813",
    "title": "The explosive value of the networks",
    "abstract": "Networks have always played a special role for human beings in shaping social relations, forming public opinion, and driving economic equilibria. Nowadays, online networked platforms dominate digital markets and capitalization leader-boards, while social networks drive public discussion. Despite the importance of networks in many economic and social domains (economics, sociology, anthropology, psychology,...), the knowledge about the laws that dominate their dynamics is still scarce and fragmented. Here, we analyse a wide set of online networks (those financed by advertising) by investigating their value dynamics from several perspectives: the type of service, the geographic scope, the merging between networks, and the relationship between economic and financial value. The results show that the networks are dominated by strongly nonlinear dynamics. The existence of non-linearity is often underestimated in social sciences because it involves contexts that are difficult to deal with, such as the presence of multiple equilibria -- some of which are unstable. Yet, these dynamics must be fully understood and addressed if we aim to understand the recent evolution in the economic, political and social milieus, which are precisely characterised by corner equilibria (e.g., polarization, winner-take-all solutions, increasing inequality) and nonlinear patterns. ",
    "url": "https://arxiv.org/abs/2208.04813",
    "authors": [
      "Antonio Scala",
      "Marco Delmastro"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2208.04825",
    "title": "Longitudinal Prediction of Postnatal Brain Magnetic Resonance Images via  a Metamorphic Generative Adversarial Network",
    "abstract": "Missing scans are inevitable in longitudinal studies due to either subject dropouts or failed scans. In this paper, we propose a deep learning framework to predict missing scans from acquired scans, catering to longitudinal infant studies. Prediction of infant brain MRI is challenging owing to the rapid contrast and structural changes particularly during the first year of life. We introduce a trustworthy metamorphic generative adversarial network (MGAN) for translating infant brain MRI from one time-point to another. MGAN has three key features: (i) Image translation leveraging spatial and frequency information for detail-preserving mapping; (ii) Quality-guided learning strategy that focuses attention on challenging regions. (iii) Multi-scale hybrid loss function that improves translation of tissue contrast and structural details. Experimental results indicate that MGAN outperforms existing GANs by accurately predicting both contrast and anatomical details. ",
    "url": "https://arxiv.org/abs/2208.04825",
    "authors": [
      "Yunzhi Huang",
      "Sahar Ahmad",
      "Luyi Han",
      "Shuai Wang",
      "Zhengwang Wu",
      "Weili Lin",
      "Gang Li",
      "Li Wang",
      "Pew-Thian Yap"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04845",
    "title": "Quantization enabled Privacy Protection in Decentralized Stochastic  Optimization",
    "abstract": "By enabling multiple agents to cooperatively solve a global optimization problem in the absence of a central coordinator, decentralized stochastic optimization is gaining increasing attention in areas as diverse as machine learning, control, and sensor networks. Since the associated data usually contain sensitive information, such as user locations and personal identities, privacy protection has emerged as a crucial need in the implementation of decentralized stochastic optimization. In this paper, we propose a decentralized stochastic optimization algorithm that is able to guarantee provable convergence accuracy even in the presence of aggressive quantization errors that are proportional to the amplitude of quantization inputs. The result applies to both convex and non-convex objective functions, and enables us to exploit aggressive quantization schemes to obfuscate shared information, and hence enables privacy protection without losing provable optimization accuracy. In fact, by using a {stochastic} ternary quantization scheme, which quantizes any value to three numerical levels, we achieve quantization-based rigorous differential privacy in decentralized stochastic optimization, which has not been reported before. In combination with the presented quantization scheme, the proposed algorithm ensures, for the first time, rigorous differential privacy in decentralized stochastic optimization without losing provable convergence accuracy. Simulation results for a distributed estimation problem as well as numerical experiments for decentralized learning on a benchmark machine learning dataset confirm the effectiveness of the proposed approach. ",
    "url": "https://arxiv.org/abs/2208.04845",
    "authors": [
      "Yongqiang Wang",
      "Tamer Basar"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.04852",
    "title": "Graph neural networks for the prediction of molecular structure-property  relationships",
    "abstract": "Molecular property prediction is of crucial importance in many disciplines such as drug discovery, molecular biology, or material and process design. The frequently employed quantitative structure-property/activity relationships (QSPRs/QSARs) characterize molecules by descriptors which are then mapped to the properties of interest via a linear or nonlinear model. In contrast, graph neural networks, a novel machine learning method, directly work on the molecular graph, i.e., a graph representation where atoms correspond to nodes and bonds correspond to edges. GNNs allow to learn properties in an end-to-end fashion, thereby avoiding the need for informative descriptors as in QSPRs/QSARs. GNNs have been shown to achieve state-of-the-art prediction performance on various property predictions tasks and represent an active field of research. We describe the fundamentals of GNNs and demonstrate the application of GNNs via two examples for molecular property prediction. ",
    "url": "https://arxiv.org/abs/2208.04852",
    "authors": [
      "Jan G. Rittig",
      "Qinghe Gao",
      "Manuel Dahmen",
      "Alexander Mitsos",
      "Artur M. Schweidtmann"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2208.04929",
    "title": "Literature Review: Graph Kernels in Chemoinformatics",
    "abstract": "The purpose of this review is to introduce the reader to graph kernels, with a view of applying them in classification problems in chemoinformatics. Graph kernels are functions that allow us to infer chemical properties of molecules, which can help with tasks such as finding suitable compounds for drug design. The use of kernel methods is but one particular way two quantify similarity between graphs. We restrict our discussion to this one method, although popular alternatives have emerged in recent years, most notably Graph Neural Networks. ",
    "url": "https://arxiv.org/abs/2208.04929",
    "authors": [
      "James Young"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2008.08796",
    "title": "Distributed Stochastic Subgradient Optimization Algorithms Over Random  and Noisy Networks",
    "abstract": " Title: Distributed Stochastic Subgradient Optimization Algorithms Over Random  and Noisy Networks ",
    "url": "https://arxiv.org/abs/2008.08796",
    "authors": [
      "Tao Li",
      "Keli Fu",
      "Xiaozheng Fu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2012.05009",
    "title": "A Gumbel-based Rating Prediction Framework for Imbalanced Recommendation",
    "abstract": " Comments: Accepted at CIKM 2022 ",
    "url": "https://arxiv.org/abs/2012.05009",
    "authors": [
      "Yuexin Wu",
      "Xiaolei Huang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2101.02083",
    "title": "Representation learning for maximization of MI, nonlinear ICA and  nonlinear subspaces with robust density ratio estimation",
    "abstract": " Title: Representation learning for maximization of MI, nonlinear ICA and  nonlinear subspaces with robust density ratio estimation ",
    "url": "https://arxiv.org/abs/2101.02083",
    "authors": [
      "Hiroaki Sasaki",
      "Takashi Takenouchi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2104.09164",
    "title": "Secure Human Action Recognition by Encrypted Neural Network Inference",
    "abstract": " Comments: 16 pages, 6 figures, accepted at Nature Communications ",
    "url": "https://arxiv.org/abs/2104.09164",
    "authors": [
      "Miran Kim",
      "Xiaoqian Jiang",
      "Kristin Lauter",
      "Elkhan Ismayilzada",
      "Shayan Shams"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2104.09864",
    "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
    "abstract": " Title: RoFormer: Enhanced Transformer with Rotary Position Embedding ",
    "url": "https://arxiv.org/abs/2104.09864",
    "authors": [
      "Jianlin Su",
      "Yu Lu",
      "Shengfeng Pan",
      "Ahmed Murtadha",
      "Bo Wen",
      "Yunfeng Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.14756",
    "title": "Predicting Intraoperative Hypoxemia with Hybrid Inference Sequence  Autoencoder Networks",
    "abstract": " Comments: Accepted for CIKM '22 ",
    "url": "https://arxiv.org/abs/2104.14756",
    "authors": [
      "Hanyang Liu",
      "Michael C. Montana",
      "Dingwen Li",
      "Chase Renfroe",
      "Thomas Kannampallil",
      "Chenyang Lu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.05057",
    "title": "Multiple Kernel Representation Learning on Networks",
    "abstract": " Comments: This manuscript is an extended version of the previous work entitled \"Kernel Node Embeddings\" (arXiv:1909.03416), and it has been accepted for publication in IEEE Transactions on Knowledge and Data Engineering ",
    "url": "https://arxiv.org/abs/2106.05057",
    "authors": [
      "Abdulkadir Celikkanat",
      "Yanning Shen",
      "Fragkiskos D. Malliaros"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.06881",
    "title": "Evolution of Non-Terrestrial Networks From 5G to 6G: A Survey",
    "abstract": " Comments: Accepted for publication in IEEE Communications Surveys & Tutorials ",
    "url": "https://arxiv.org/abs/2107.06881",
    "authors": [
      "M. Mahdi Azari",
      "Sourabh Solanki",
      "Symeon Chatzinotas",
      "Oltjon Kodheli",
      "Hazem Sallouha",
      "Achiel Colpaert",
      "Jesus Fabian Mendoza Montoya",
      "Sofie Pollin",
      "Alireza Haqiqatnejad",
      "Arsham Mostaani",
      "Eva Lagunas",
      "Bjorn Ottersten"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Emerging Technologies (cs.ET)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2107.10771",
    "title": "EAN: Event Adaptive Network for Enhanced Action Recognition",
    "abstract": " Comments: IJCV2022 paper. Codes are available at: this https URL ",
    "url": "https://arxiv.org/abs/2107.10771",
    "authors": [
      "Yuan Tian",
      "Yichao Yan",
      "Guangtao Zhai",
      "Guodong Guo",
      "Zhiyong Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.09795",
    "title": "Intersecting diametral balls induced by a geometric graph",
    "abstract": " Comments: THE TITLE CHANGED! Added a new section with open problems. 15 pages, 4 figures. Key words: Tverberg's theorem, geometric graph, perfect matching, red-blue matching, Hamiltonian cycle, alternating cycle, infinite descent, halving line, $\\alpha$-lense, arrangements of convex bodies ",
    "url": "https://arxiv.org/abs/2108.09795",
    "authors": [
      "Olimjoni Pirahmad",
      "Alexandr Polyanskii",
      "Alexey Vasilevskii"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Geometry (cs.CG)",
      "Metric Geometry (math.MG)"
    ]
  },
  {
    "id": "arXiv:2108.13054",
    "title": "Wasserstein Generative Adversarial Uncertainty Quantification in  Physics-Informed Neural Networks",
    "abstract": " Title: Wasserstein Generative Adversarial Uncertainty Quantification in  Physics-Informed Neural Networks ",
    "url": "https://arxiv.org/abs/2108.13054",
    "authors": [
      "Yihang Gao",
      "Michael K. Ng"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.10871",
    "title": "Nested Sampling for Non-Gaussian Inference in SLAM Factor Graphs",
    "abstract": " Title: Nested Sampling for Non-Gaussian Inference in SLAM Factor Graphs ",
    "url": "https://arxiv.org/abs/2109.10871",
    "authors": [
      "Qiangqiang Huang",
      "Alan Papalia",
      "John J. Leonard"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2111.10693",
    "title": "Thermodynamical Material Networks for Modeling, Planning and Control of  Circular Material Flows",
    "abstract": " Comments: To be submitted ",
    "url": "https://arxiv.org/abs/2111.10693",
    "authors": [
      "Federico Zocco",
      "Pantelis Sopasakis",
      "Wassim M. Haddad",
      "Beatrice Smyth"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2111.12851",
    "title": "A Tractable Approach to Coverage Analysis in Downlink Satellite Networks",
    "abstract": " Comments: 15 pages ",
    "url": "https://arxiv.org/abs/2111.12851",
    "authors": [
      "Jeonghun Park",
      "Jinseok Choi",
      "Namyoon Lee"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2112.00170",
    "title": "SAMO: Optimised Mapping of Convolutional Neural Networks to Streaming  Architectures",
    "abstract": " Title: SAMO: Optimised Mapping of Convolutional Neural Networks to Streaming  Architectures ",
    "url": "https://arxiv.org/abs/2112.00170",
    "authors": [
      "Alexander Montgomerie-Corcoran",
      "Zhewen Yu",
      "Christos-Savvas Bouganis"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2201.04569",
    "title": "Get your Foes Fooled: Proximal Gradient Split Learning for Defense  against Model Inversion Attacks on IoMT data",
    "abstract": " Comments: 10 pages, 5 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2201.04569",
    "authors": [
      "Sunder Ali Khowaja",
      "Ik Hyun Lee",
      "Kapal Dev",
      "Muhammad Aslam Jarwar",
      "Nawab Muhammad Faseeh Qureshi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.05451",
    "title": "A causal model of safety assurance for machine learning",
    "abstract": " Title: A causal model of safety assurance for machine learning ",
    "url": "https://arxiv.org/abs/2201.05451",
    "authors": [
      "Simon Burton"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2201.09508",
    "title": "Multiple Similarity Drug-Target Interaction Prediction with Random Walks  and Matrix Factorization",
    "abstract": " Title: Multiple Similarity Drug-Target Interaction Prediction with Random Walks  and Matrix Factorization ",
    "url": "https://arxiv.org/abs/2201.09508",
    "authors": [
      "Bin Liu",
      "Dimitrios Papadopoulos",
      "Fragkiskos D. Malliaros",
      "Grigorios Tsoumakas",
      "Apostolos N. Papadopoulos"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03354",
    "title": "Robust Dialogue State Tracking with Weak Supervision and Sparse Data",
    "abstract": " Comments: 12 pages, 6 figures, pre-MIT Press publication version (author's final version), accepted for publication in TACL ",
    "url": "https://arxiv.org/abs/2202.03354",
    "authors": [
      "Michael Heck",
      "Nurul Lubis",
      "Carel van Niekerk",
      "Shutong Feng",
      "Christian Geishauser",
      "Hsien-Chin Lin",
      "Milica Gašić"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2202.04134",
    "title": "A Novel Ontology-guided Attribute Partitioning Ensemble Learning Model  for Early Prediction of Cognitive Deficits using Quantitative Structural MRI  in Very Preterm Infants",
    "abstract": " Comments: Latest Version, published at NeuroImage. PMID: 35850161 DOI: 10.1016/j.neuroimage.2022.119484 ",
    "url": "https://arxiv.org/abs/2202.04134",
    "authors": [
      "Zhiyuan Li",
      "Hailong Li",
      "Adebayo Braimah",
      "Jonathan R. Dillman",
      "Nehal A.Parikh",
      "Lili He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.04856",
    "title": "PPA: Preference Profiling Attack Against Federated Learning",
    "abstract": " Title: PPA: Preference Profiling Attack Against Federated Learning ",
    "url": "https://arxiv.org/abs/2202.04856",
    "authors": [
      "Chunyi Zhou",
      "Yansong Gao",
      "Anmin Fu",
      "Kai Chen",
      "Zhiyang Dai",
      "Zhi Zhang",
      "Minhui Xue",
      "Yuqing Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.09792",
    "title": "Hierarchical Interpretation of Neural Text Classification",
    "abstract": " Comments: Accepted by Computational Linguistics ",
    "url": "https://arxiv.org/abs/2202.09792",
    "authors": [
      "Hanqi Yan",
      "Lin Gui",
      "Yulan He"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2203.00809",
    "title": "Instance-aware multi-object self-supervision for monocular depth  prediction",
    "abstract": " Comments: IROS 2022 and RAL ",
    "url": "https://arxiv.org/abs/2203.00809",
    "authors": [
      "Houssem Boulahbal",
      "Adrian Voicila",
      "Andrew Comport"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16662",
    "title": "Overcoming challenges in leveraging GANs for few-shot data augmentation",
    "abstract": " Comments: v3 of the paper, various changes including better figures, CIFAR-100 results, and precision-recall metrics ",
    "url": "https://arxiv.org/abs/2203.16662",
    "authors": [
      "Christopher Beckham",
      "Issam Laradji",
      "Pau Rodriguez",
      "David Vazquez",
      "Derek Nowrouzezahrai",
      "Christopher Pal"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.00302",
    "title": "Actual Causality and Responsibility Attribution in Decentralized  Partially Observable Markov Decision Processes",
    "abstract": " Comments: In Proceedings of the 2022 AAAI/ACM Conference on AI, Ethics, and Society (AIES22) ",
    "url": "https://arxiv.org/abs/2204.00302",
    "authors": [
      "Stelios Triantafyllou",
      "Adish Singla",
      "Goran Radanovic"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.01543",
    "title": "Causality, Causal Discovery, and Causal Inference in Structural  Engineering",
    "abstract": " Title: Causality, Causal Discovery, and Causal Inference in Structural  Engineering ",
    "url": "https://arxiv.org/abs/2204.01543",
    "authors": [
      "M.Z. Naser"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2205.00481",
    "title": "A recipe of training neural network-based LDPC decoders",
    "abstract": " Comments: 9 pages,10 figures ",
    "url": "https://arxiv.org/abs/2205.00481",
    "authors": [
      "Guangwen Li",
      "Xiao Yu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.03757",
    "title": "On the quick search for the shortest paths in an unweighted dynamic  graph by its projections in brief",
    "abstract": " Comments: 4 pages, in russian language, 2 figures, 6 tables ",
    "url": "https://arxiv.org/abs/2206.03757",
    "authors": [
      "V.A. Melent'ev"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2206.11017",
    "title": "Object Type Clustering using Markov Directly-Follow Multigraph in  Object-Centric Process Mining",
    "abstract": " Title: Object Type Clustering using Markov Directly-Follow Multigraph in  Object-Centric Process Mining ",
    "url": "https://arxiv.org/abs/2206.11017",
    "authors": [
      "Amin Jalali"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.13660",
    "title": "DF-SCA: Dynamic Frequency Side Channel Attacks are Practical",
    "abstract": " Title: DF-SCA: Dynamic Frequency Side Channel Attacks are Practical ",
    "url": "https://arxiv.org/abs/2206.13660",
    "authors": [
      "Debopriya Roy Dipta",
      "Berk Gulmezoglu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2207.05825",
    "title": "Solving Bilevel Optimal Bidding Problems Using Deep Convolutional Neural  Networks",
    "abstract": " Title: Solving Bilevel Optimal Bidding Problems Using Deep Convolutional Neural  Networks ",
    "url": "https://arxiv.org/abs/2207.05825",
    "authors": [
      "Domagoj Vlah",
      "Karlo Šepetanc",
      "Hrvoje Pandžić"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2207.06031",
    "title": "Unsupervised Recognition of Informative Features via Tensor Network  Machine Learning and Quantum Entanglement Variations",
    "abstract": " Comments: 7 pages, 8 figures. In the updated version, we added the unsupervised segmentation of images of cells, and the results with multi-qubit measurements ",
    "url": "https://arxiv.org/abs/2207.06031",
    "authors": [
      "Sheng-Chen Bai",
      "Yi-Cheng Tang",
      "Shi-Ju Ran"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Strongly Correlated Electrons (cond-mat.str-el)",
      "Machine Learning (cs.LG)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2207.07039",
    "title": "Convolutional Bypasses Are Better Vision Transformer Adapters",
    "abstract": " Title: Convolutional Bypasses Are Better Vision Transformer Adapters ",
    "url": "https://arxiv.org/abs/2207.07039",
    "authors": [
      "Shibo Jie",
      "Zhi-Hong Deng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.08046",
    "title": "MDM: Multiple Dynamic Masks for Visual Explanation of Neural Networks",
    "abstract": " Title: MDM: Multiple Dynamic Masks for Visual Explanation of Neural Networks ",
    "url": "https://arxiv.org/abs/2207.08046",
    "authors": [
      "Yitao Peng",
      "Longzhen Yang",
      "Yihang Liu",
      "Lianghua He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.08230",
    "title": "Troll Tweet Detection Using Contextualized Word Representations",
    "abstract": " Title: Troll Tweet Detection Using Contextualized Word Representations ",
    "url": "https://arxiv.org/abs/2207.08230",
    "authors": [
      "Seyhmus Yilmaz",
      "Sultan Zavrak"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.08417",
    "title": "Real-time End-to-End Video Text Spotter with Contrastive Representation  Learning",
    "abstract": " Title: Real-time End-to-End Video Text Spotter with Contrastive Representation  Learning ",
    "url": "https://arxiv.org/abs/2207.08417",
    "authors": [
      "Wejia Wu",
      "Zhuang Li",
      "Jiahong Li",
      "Chunhua Shen",
      "Hong Zhou",
      "Size Li",
      "Zhongyuan Wang",
      "Ping Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.13921",
    "title": "HelixFold-Single: MSA-free Protein Structure Prediction by Using Protein  Language Model as an Alternative",
    "abstract": " Title: HelixFold-Single: MSA-free Protein Structure Prediction by Using Protein  Language Model as an Alternative ",
    "url": "https://arxiv.org/abs/2207.13921",
    "authors": [
      "Xiaomin Fang",
      "Fan Wang",
      "Lihang Liu",
      "Jingzhou He",
      "Dayong Lin",
      "Yingfei Xiang",
      "Xiaonan Zhang",
      "Hua Wu",
      "Hui Li",
      "Le Song"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2208.02321",
    "title": "Visual Analysis and Detection of Contrails in Aircraft Engine  Simulations",
    "abstract": " Comments: 11 Pages, 7 figures, IEEE VIS 2022 ",
    "url": "https://arxiv.org/abs/2208.02321",
    "authors": [
      "Nafiul Nipu",
      "Carla Floricel",
      "Negar Naghashzadeh",
      "Roberto Paoli",
      "G. Elisabeta Marai"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.02432",
    "title": "Image-based Contextual Pill Recognition with Medical Knowledge Graph  Assistance",
    "abstract": " Comments: Accepted for presentation at the 14th Asian Conference on Intelligent Information and Database Systems (ACIIDS 2022) ",
    "url": "https://arxiv.org/abs/2208.02432",
    "authors": [
      "Anh Duy Nguyen",
      "Thuy Dung Nguyen",
      "Huy Hieu Pham",
      "Thanh Hung Nguyen",
      "Phi Le Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.02712",
    "title": "UTOPIC: Uncertainty-aware Overlap Prediction Network for Partial Point  Cloud Registration",
    "abstract": " Title: UTOPIC: Uncertainty-aware Overlap Prediction Network for Partial Point  Cloud Registration ",
    "url": "https://arxiv.org/abs/2208.02712",
    "authors": [
      "Zhilei Chen",
      "Honghua Chen",
      "Lina Gong",
      "Xuefeng Yan",
      "Jun Wang",
      "Yanwen Guo",
      "Jing Qin",
      "Mingqiang Wei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03608",
    "title": "Shap-CAM: Visual Explanations for Convolutional Neural Networks based on  Shapley Value",
    "abstract": " Comments: Accepted by ECCV 2022 ",
    "url": "https://arxiv.org/abs/2208.03608",
    "authors": [
      "Quan Zheng",
      "Ziwei Wang",
      "Jie Zhou",
      "Jiwen Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2208.03666",
    "title": "See What You See: Self-supervised Cross-modal Retrieval of Visual  Stimuli from Brain Activity",
    "abstract": " Title: See What You See: Self-supervised Cross-modal Retrieval of Visual  Stimuli from Brain Activity ",
    "url": "https://arxiv.org/abs/2208.03666",
    "authors": [
      "Zesheng Ye",
      "Lina Yao",
      "Yu Zhang",
      "Silvia Gustin"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2208.03712",
    "title": "The Influence of Network Structural Preference on Node Classification  and Link Prediction",
    "abstract": " Title: The Influence of Network Structural Preference on Node Classification  and Link Prediction ",
    "url": "https://arxiv.org/abs/2208.03712",
    "authors": [
      "Sarmad N. Mohammed",
      "Semra Gündüç"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2208.04045",
    "title": "Rapid Flow Behavior Modeling of Thermal Interface Materials Using Deep  Neural Networks",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2208.04045",
    "authors": [
      "Simon Baeuerle",
      "Marius Gebhardt",
      "Jonas Barth",
      "Andreas Steimer",
      "Ralf Mikut"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  }
]