[
  {
    "id": "arXiv:2110.14003",
    "title": "Connected greedy colourings of perfect graphs and other classes: the  good, the bad and the ugly",
    "abstract": "The Grundy number of a graph is the maximum number of colours used by the ``First-Fit'' greedy colouring algorithm over all vertex orderings. Given a vertex ordering $\\sigma= v_1,\\dots,v_n$, the ``First-Fit'' greedy colouring algorithm colours the vertices in the order of $\\sigma$ by assigning to each vertex the smallest colour unused in its neighbourhood. By restricting this procedure to vertex orderings that are connected, we obtain {\\em connected greedy colourings}. For some graphs, all connected greedy colourings use exactly $\\chi(G)$ colours; they are called {\\em good graphs}. On the opposite, some graphs do not admit any connected greedy colouring using only $\\chi(G)$ colours; they are called {\\em ugly graphs}. We show that no perfect graph is ugly. We also give simple proofs of this fact for subclasses of perfect graphs (block graphs, comparability graphs), and show that no $K_4$-minor free graph is ugly. ",
    "url": "https://arxiv.org/abs/2110.14003",
    "authors": [
      "Laurent Beaudou",
      "Caroline Brosse",
      "Oscar Defrain",
      "Florent Foucaud",
      "Aurélie Lagoutte",
      "Vincent Limouzy",
      "Lucas Pastor"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2110.14030",
    "title": "Improving Local Effectiveness for Global robust training",
    "abstract": "Despite its popularity, deep neural networks are easily fooled. To alleviate this deficiency, researchers are actively developing new training strategies, which encourage models that are robust to small input perturbations. Several successful robust training methods have been proposed. However, many of them rely on strong adversaries, which can be prohibitively expensive to generate when the input dimension is high and the model structure is complicated. We adopt a new perspective on robustness and propose a novel training algorithm that allows a more effective use of adversaries. Our method improves the model robustness at each local ball centered around an adversary and then, by combining these local balls through a global term, achieves overall robustness. We demonstrate that, by maximizing the use of adversaries via focusing on local balls, we achieve high robust accuracy with weak adversaries. Specifically, our method reaches a similar robust accuracy level to the state of the art approaches trained on strong adversaries on MNIST, CIFAR-10 and CIFAR-100. As a result, the overall training time is reduced. Furthermore, when trained with strong adversaries, our method matches with the current state of the art on MNIST and outperforms them on CIFAR-10 and CIFAR-100. ",
    "url": "https://arxiv.org/abs/2110.14030",
    "authors": [
      "Jingyue Lu",
      "M. Pawan Kumar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.14124",
    "title": "An improved multiobjective evolutionary algorithm based on decomposition  and adaptive multi-reference points",
    "abstract": "Many real-world optimization problems such as engineering design are finally modeled as a multiobjective optimization problem (MOP) which must be solved to get a set of trade-offs. Multiobjective evolutionary algorithm based on decomposition (MOEA/D) has been regarded as a very promising approach for solving MOPs, which offers a general algorithmic framework of evolutionary multiobjective optimization. Recent studies have shown that MOEA/D with uniformly distributed weight vectors is well-suited to MOPs with regular Pareto optimal front, but its performance in terms of diversity deteriorates on MOPs with irregular Pareto optimal front such as highly nonlinear and convex. In this way, the solution set obtained by the algorithm can not provide more reasonable choices for decision makers. In order to efficiently overcome this shortcoming, in this paper, we propose an improved MOEA/D algorithm by virtue of the well-known Pascoletti-Serafini scalarization method and a new strategy of multi-reference points. Specifically, this strategy consists of the setting and adaptation of reference points generated by the techniques of equidistant partition and projection. For performance assessment, the proposed algorithm is compared with existing four state-of-the-art multiobjective evolutionary algorithms on both benchmark test problems with various types of Pareto optimal fronts and two real-world MOPs including the hatch cover design and the rocket injector design in engineering optimization. Experimental results reveal that the proposed algorithm is better than that of the other compared algorithms in diversity. ",
    "url": "https://arxiv.org/abs/2110.14124",
    "authors": [
      "Wang Chen",
      "Jian Chen",
      "Weitian Wu",
      "Xinmin Yang",
      "Hui Li"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2110.14343",
    "title": "Comprehensive learning particle swarm optimization enabled modeling  framework for multi-step-ahead influenza prediction",
    "abstract": "Epidemics of influenza are major public health concerns. Since influenza prediction always relies on the weekly clinical or laboratory surveillance data, typically the weekly Influenza-like illness (ILI) rate series, accurate multi-step-ahead influenza predictions using ILI series is of great importance, especially, to the potential coming influenza outbreaks. This study proposes Comprehensive Learning Particle Swarm Optimization based Machine Learning (CLPSO-ML) framework incorporating support vector regression (SVR) and multilayer perceptron (MLP) for multi-step-ahead influenza prediction. A comprehensive examination and comparison of the performance and potential of three commonly used multi-step-ahead prediction modeling strategies, including iterated strategy, direct strategy and multiple-input multiple-output (MIMO) strategy, was conducted using the weekly ILI rate series from both the Southern and Northern China. The results show that: (1) The MIMO strategy achieves the best multi-step-ahead prediction, and is potentially more adaptive for longer horizon; (2) The iterated strategy demonstrates special potentials for deriving the least time difference between the occurrence of the predicted peak value and the true peak value of an influenza outbreak; (3) For ILI in the Northern China, SVR model implemented with MIMO strategy performs best, and SVR with iterated strategy also shows remarkable performance especially during outbreak periods; while for ILI in the Southern China, both SVR and MLP models with MIMO strategy have competitive prediction performance ",
    "url": "https://arxiv.org/abs/2110.14343",
    "authors": [
      "Siyue Yang",
      "Yukun Bao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2110.14355",
    "title": "Transfer learning with causal counterfactual reasoning in Decision  Transformers",
    "abstract": "The ability to adapt to changes in environmental contingencies is an important challenge in reinforcement learning. Indeed, transferring previously acquired knowledge to environments with unseen structural properties can greatly enhance the flexibility and efficiency by which novel optimal policies may be constructed. In this work, we study the problem of transfer learning under changes in the environment dynamics. In this study, we apply causal reasoning in the offline reinforcement learning setting to transfer a learned policy to new environments. Specifically, we use the Decision Transformer (DT) architecture to distill a new policy on the new environment. The DT is trained on data collected by performing policy rollouts on factual and counterfactual simulations from the source environment. We show that this mechanism can bootstrap a successful policy on the target environment while retaining most of the reward. ",
    "url": "https://arxiv.org/abs/2110.14355",
    "authors": [
      "Ayman Boustati",
      "Hana Chockler",
      "Daniel C. McNamee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.14461",
    "title": "Hand gesture detection in the hand movement test for the early diagnosis  of dementia",
    "abstract": "Collecting hands data is important for many cognitive studies, especially for senior participants who has no IT background. For example, alternating hand movements and imitation of gestures are formal cognitive assessment in the early detection of dementia. During data collection process, one of the key steps is to detect whether the participants is following the instruction correctly to do the correct gestures. Meanwhile, re-searchers found a lot of problems in TAS Test hand movement data collection process, where is challenging to detect similar gestures and guarantee the quality of the collect-ed images. We have implemented a hand gesture detector to detect the gestures per-formed in the hand movement tests, which enables us to monitor if the participants are following the instructions correctly. In this research, we have processed 20,000 images collected from TAS Test and labelled 6,450 images to detect different hand poses in the hand movement tests. This paper has the following three contributions. Firstly, we compared the performance of different network structures for hand poses detection. Secondly, we introduced a transformer block in the state of art network and increased the classification performance of the similar gestures. Thirdly, we have created two datasets and included 20 percent of blurred images in the dataset to investigate how different network structures were impacted by noisy data, then we proposed a novel net-work to increase the detection accuracy to mediate the influence of the noisy data. ",
    "url": "https://arxiv.org/abs/2110.14461",
    "authors": [
      "Guan Huang",
      "Son N. Tran",
      "Quan Bai",
      "Jane Alty"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2110.14545",
    "title": "Performance prediction of massively parallel computation by Bayesian  inference",
    "abstract": "A performance prediction method for massively parallel computation is proposed. The method is based on performance modeling and Bayesian inference to predict elapsed time T as a function of the number of used nodes P (T=T(P)). The focus is on extrapolation for larger values of P from the perspective of application researchers. The proposed method has several improvements over the method developed in a previous paper, and application to real-symmetric generalized eigenvalue problem shows promising prediction results. The method is generalizable and applicable to many other computations. ",
    "url": "https://arxiv.org/abs/2110.14545",
    "authors": [
      "Hisashi Kohashi",
      "Harumichi Iwamoto",
      "Takeshi Fukaya",
      "Yusaku Yamamoto",
      "Takeo Hoshi"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2110.14590",
    "title": "TMBuD: A dataset for urban scene building detection",
    "abstract": "Building recognition and 3D reconstruction of human made structures in urban scenarios has become an interesting and actual topic in the image processing domain. For this research topic the Computer Vision and Augmented Reality areas intersect for creating a better understanding of the urban scenario for various topics. In this paper we aim to introduce a dataset solution, the TMBuD, that is better fitted for image processing on human made structures for urban scene scenarios. The proposed dataset will allow proper evaluation of salient edges and semantic segmentation of images focusing on the street view perspective of buildings. The images that form our dataset offer various street view perspectives of buildings from urban scenarios, which allows for evaluating complex algorithms. The dataset features 160 images of buildings from Timisoara, Romania, with a resolution of 768 x 1024 pixels each. ",
    "url": "https://arxiv.org/abs/2110.14590",
    "authors": [
      "Orhei Ciprian",
      "Vert Silviu",
      "Mocofan Muguras",
      "Vasiu Radu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.13976",
    "title": "Biological learning in key-value memory networks",
    "abstract": "In neuroscience, classical Hopfield networks are the standard biologically plausible model of long-term memory, relying on Hebbian plasticity for storage and attractor dynamics for recall. In contrast, memory-augmented neural networks in machine learning commonly use a key-value mechanism to store and read out memories in a single step. Such augmented networks achieve impressive feats of memory compared to traditional variants, yet their biological relevance is unclear. We propose an implementation of basic key-value memory that stores inputs using a combination of biologically plausible three-factor plasticity rules. The same rules are recovered when network parameters are meta-learned. Our network performs on par with classical Hopfield networks on autoassociative memory tasks and can be naturally extended to continual recall, heteroassociative memory, and sequence learning. Our results suggest a compelling alternative to the classical Hopfield network as a model of biological long-term memory. ",
    "url": "https://arxiv.org/abs/2110.13976",
    "authors": [
      "Danil Tyulmankov",
      "Ching Fang",
      "Annapurna Vadaparty",
      "Guangyu Robert Yang"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2110.14453",
    "title": "Most direct product of graphs are Type 1",
    "abstract": "A \\textit{$k$-total coloring} of a graph $G$ is an assignment of $k$ colors to its elements (vertices and edges) so that adjacent or incident elements have different colors. The total chromatic number is the smallest integer $k$ for which the graph $G$ has a $k$-total coloring. Clearly, this number is at least $\\Delta(G)+1$, where $\\Delta(G)$ is the maximum degree of $G$. When the lower bound is reached, the graph is said to be Type~1. The upper bound of $\\Delta(G)+2$ is a central problem that has been open for fifty years, is verified for graphs with maximum degree 4 but not for regular graphs. Most classified direct product of graphs are Type~1. The particular cases of the direct product of cycle graphs $C_m \\times C_n$, for $m =3p, 5\\ell$ and $8\\ell$ with $p \\geq 2$ and $\\ell \\geq 1$, and arbitrary $n \\geq 3$, were previously known to be Type 1 and motivated the conjecture that, except for $C_4 \\times C_4$, all direct product of cycle graphs $C_m \\times C_n$ with $m,n \\geq 3$ are Type 1. We give a general pattern proving that all $C_m \\times C_n$ are Type 1, except for $C_4 \\times C_4$. dditionally, we investigate sufficient conditions to ensure that the direct product reaches the lower bound for the total chromatic number. ",
    "url": "https://arxiv.org/abs/2110.14453",
    "authors": [
      "Diane Castonguay",
      "Celina M. H. de Figueiredo",
      "Luis Antonio Kowada",
      "Caroline Reis Patrão",
      "Diana Sasaki"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2110.14507",
    "title": "Detecting the ultra low dimensionality of real networks",
    "abstract": "Reducing dimension redundancy to find simplifying patterns in high-dimensional datasets and complex networks has become a major endeavor in many scientific fields. However, detecting the dimensionality of their latent space is challenging but necessary to generate efficient embeddings to be used in a multitude of downstream tasks. Here, we propose a method to infer the dimensionality of networks without the need for any a priori spatial embedding. Due to the ability of hyperbolic geometry to capture the complex connectivity of real networks, we detect ultra low dimensionality far below values reported using other approaches. We applied our method to real networks from different domains and found unexpected regularities, including: tissue-specific biomolecular networks being extremely low dimensional; brain connectomes being close to the three dimensions of their anatomical embedding; and social networks and the Internet requiring slightly higher dimensionality. Beyond paving the way towards an ultra efficient dimensional reduction, our findings help address fundamental issues that hinge on dimensionality, such as universality in critical behavior. ",
    "url": "https://arxiv.org/abs/2110.14507",
    "authors": [
      "Pedro Almagro",
      "Marian Boguna",
      "M. Angeles Serrano"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:1901.05639",
    "title": "Machine learning with neural networks",
    "abstract": " Comments: Revised version, 241 pages ",
    "url": "https://arxiv.org/abs/1901.05639",
    "authors": [
      "B. Mehlig"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1904.12060",
    "title": "Every planar graph with $Δ\\geqslant 8$ is totally  $(Δ+2)$-choosable",
    "abstract": " Comments: 77 pages, 78 figures ",
    "url": "https://arxiv.org/abs/1904.12060",
    "authors": [
      "Marthe Bonamy",
      "Théo Pierron",
      "Éric Sopena"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2001.11279",
    "title": "Goal-directed graph construction using reinforcement learning",
    "abstract": " Title: Goal-directed graph construction using reinforcement learning ",
    "url": "https://arxiv.org/abs/2001.11279",
    "authors": [
      "Victor-Alexandru Darvariu",
      "Stephen Hailes",
      "Mirco Musolesi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2104.03155",
    "title": "Human-robot collaborative object transfer using human motion prediction  based on Cartesian pose Dynamic Movement Primitives",
    "abstract": " Title: Human-robot collaborative object transfer using human motion prediction  based on Cartesian pose Dynamic Movement Primitives ",
    "url": "https://arxiv.org/abs/2104.03155",
    "authors": [
      "Antonis Sidiropoulos",
      "Yiannis Karayiannidis",
      "Zoe Doulgeri"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2105.11868",
    "title": "Detection and blind channel estimation for UAV-aided wireless sensor  networks in smart cities under mobile jamming attack",
    "abstract": " Comments: 19 pages, 14 figures, 6 tables, submitted to IEEE Internet of Things Journal ",
    "url": "https://arxiv.org/abs/2105.11868",
    "authors": [
      "Donatella Darsena",
      "Giacinto Gelli",
      "Ivan Iudice",
      "Francesco Verde"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Networking and Internet Architecture (cs.NI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2106.15577",
    "title": "As easy as APC: overcoming missing data and class imbalance in time  series with self-supervised learning",
    "abstract": " Comments: 15 pages ",
    "url": "https://arxiv.org/abs/2106.15577",
    "authors": [
      "Fiorella Wever",
      "T. Anderson Keller",
      "Victor Garcia",
      "Laura Symul"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.01163",
    "title": "Unveiling the structure of wide flat minima in neural networks",
    "abstract": " Comments: 15 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2107.01163",
    "authors": [
      "Carlo Baldassi",
      "Clarissa Lauditi",
      "Enrico M. Malatesta",
      "Gabriele Perugini",
      "Riccardo Zecchina"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)",
      "Mathematical Physics (math-ph)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2109.02515",
    "title": "Efficient diagonalization of symmetric matrices associated with graphs  of small treewidth",
    "abstract": " Title: Efficient diagonalization of symmetric matrices associated with graphs  of small treewidth ",
    "url": "https://arxiv.org/abs/2109.02515",
    "authors": [
      "Martin Fürer",
      "Carlos Hoppen",
      "Vilmar Trevisan"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Symbolic Computation (cs.SC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2109.14204",
    "title": "Resource sharing on endogenous networks",
    "abstract": " Title: Resource sharing on endogenous networks ",
    "url": "https://arxiv.org/abs/2109.14204",
    "authors": [
      "Philip Solimine",
      "Luke Boosey"
    ],
    "subjectives": [
      "General Economics (econ.GN)",
      "Social and Information Networks (cs.SI)",
      "Computation (stat.CO)"
    ]
  }
]