[
  {
    "id": "arXiv:2402.10220",
    "title": "Towards Semi-Autonomous Robotic Arm Manipulation Operator Intention  Detection from Forces Feedback",
    "abstract": "In harsh environments such as those found in nuclear facilities, the use of robotic systems is crucial for performing tasks that would otherwise require human intervention. This is done to minimize the risk of human exposure to dangerous levels of radiation, which can have severe consequences for health and even be fatal. However, the telemanipulation systems employed in these environments are becoming increasingly intricate, relying heavily on sophisticated control methods and local master devices. Consequently, the cognitive burden on operators during labor-intensive tasks is growing. To tackle this challenge, operator intention detection based on task learning can greatly enhance the performance of robotic tasks while reducing the reliance on human effort in teleoperation, particularly in a glovebox environment. By accurately predicting the operator's intentions, the robot can carry out tasks more efficiently and effectively, with minimal input from the operator. In this regard, we propose the utilization of Convolutional Neural Networks, a machine learning approach, to learn and forecast the operator's intentions using raw force feedback spatiotemporal data. Through our experimental study on glovebox tasks for nuclear applications, such as radiation survey and object grasping, we have achieved promising outcomes. Our approach holds the potential to enhance the safety and efficiency of robotic systems in harsh environments, thus diminishing the risk of human exposure to radiation while simultaneously improving the precision and speed of robotic operations. ",
    "url": "https://arxiv.org/abs/2402.10220",
    "authors": [
      "Abdullah Alharthi",
      "Ozan Tokatli",
      "Erwin Lopez",
      "Guido Herrmann"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.10228",
    "title": "HyperAgent: A Simple, Scalable, Efficient and Provable Reinforcement  Learning Framework for Complex Environments",
    "abstract": "To solve complex tasks under resource constraints, reinforcement learning (RL) agents need to be simple, efficient, and scalable with (1) large state space and (2) increasingly accumulated data of interactions. We propose the HyperAgent, a RL framework with hypermodel, index sampling schemes and incremental update mechanism, enabling computation-efficient sequential posterior approximation and data-efficient action selection under general value function approximation beyond conjugacy. The implementation of \\HyperAgent is simple as it only adds one module and one line of code additional to DDQN. Practically, HyperAgent demonstrates its robust performance in large-scale deep RL benchmarks with significant efficiency gain in terms of both data and computation. Theoretically, among the practically scalable algorithms, HyperAgent is the first method to achieve provably scalable per-step computational complexity as well as sublinear regret under tabular RL. The core of our theoretical analysis is the sequential posterior approximation argument, made possible by the first analytical tool for sequential random projection, a non-trivial martingale extension of the Johnson-Lindenstrauss lemma. This work bridges the theoretical and practical realms of RL, establishing a new benchmark for RL algorithm design. ",
    "url": "https://arxiv.org/abs/2402.10228",
    "authors": [
      "Yingru Li",
      "Jiawei Xu",
      "Lei Han",
      "Zhi-Quan Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.10231",
    "title": "A Multi-faceted Semi-Synthetic Dataset for Automated Cyberbullying  Detection",
    "abstract": "In recent years, the rising use of social media has propelled automated cyberbullying detection into a prominent research domain. However, challenges persist due to the absence of a standardized definition and universally accepted datasets. Many researchers now view cyberbullying as a facet of cyberaggression, encompassing factors like repetition, peer relationships, and harmful intent in addition to online aggression. Acquiring comprehensive data reflective of all cyberbullying components from social media networks proves to be a complex task. This paper provides a description of an extensive semi-synthetic cyberbullying dataset that incorporates all of the essential aspects of cyberbullying, including aggression, repetition, peer relationships, and intent to harm. The method of creating the dataset is succinctly outlined, and a detailed overview of the publicly accessible dataset is additionally presented. This accompanying data article provides an in-depth look at the dataset, increasing transparency and enabling replication. It also aids in a deeper understanding of the data, supporting broader research use. ",
    "url": "https://arxiv.org/abs/2402.10231",
    "authors": [
      "Naveed Ejaz",
      "Fakhra Kashif",
      "Salimur Choudhury"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10248",
    "title": "A Data-Driven Supervised Machine Learning Approach to Estimating Global  Ambient Air Pollution Concentrations With Associated Prediction Intervals",
    "abstract": "Global ambient air pollution, a transboundary challenge, is typically addressed through interventions relying on data from spatially sparse and heterogeneously placed monitoring stations. These stations often encounter temporal data gaps due to issues such as power outages. In response, we have developed a scalable, data-driven, supervised machine learning framework. This model is designed to impute missing temporal and spatial measurements, thereby generating a comprehensive dataset for pollutants including NO$_2$, O$_3$, PM$_{10}$, PM$_{2.5}$, and SO$_2$. The dataset, with a fine granularity of 0.25$^{\\circ}$ at hourly intervals and accompanied by prediction intervals for each estimate, caters to a wide range of stakeholders relying on outdoor air pollution data for downstream assessments. This enables more detailed studies. Additionally, the model's performance across various geographical locations is examined, providing insights and recommendations for strategic placement of future monitoring stations to further enhance the model's accuracy. ",
    "url": "https://arxiv.org/abs/2402.10248",
    "authors": [
      "Liam J Berrisford",
      "Hugo Barbosa",
      "Ronaldo Menezes"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10283",
    "title": "Backdoor Attack against One-Class Sequential Anomaly Detection Models",
    "abstract": "Deep anomaly detection on sequential data has garnered significant attention due to the wide application scenarios. However, deep learning-based models face a critical security threat - their vulnerability to backdoor attacks. In this paper, we explore compromising deep sequential anomaly detection models by proposing a novel backdoor attack strategy. The attack approach comprises two primary steps, trigger generation and backdoor injection. Trigger generation is to derive imperceptible triggers by crafting perturbed samples from the benign normal data, of which the perturbed samples are still normal. The backdoor injection is to properly inject the backdoor triggers to comprise the model only for the samples with triggers. The experimental results demonstrate the effectiveness of our proposed attack strategy by injecting backdoors on two well-established one-class anomaly detection models. ",
    "url": "https://arxiv.org/abs/2402.10283",
    "authors": [
      "He Cheng",
      "Shuhan Yuan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2402.10290",
    "title": "Experiments with Encoding Structured Data for Neural Networks",
    "abstract": "The project's aim is to create an AI agent capable of selecting good actions in a game-playing domain called Battlespace. Sequential domains like Battlespace are important testbeds for planning problems, as such, the Department of Defense uses such domains for wargaming exercises. The agents we developed combine Monte Carlo Tree Search (MCTS) and Deep Q-Network (DQN) techniques in an effort to navigate the game environment, avoid obstacles, interact with adversaries, and capture the flag. This paper will focus on the encoding techniques we explored to present complex structured data stored in a Python class, a necessary precursor to an agent. ",
    "url": "https://arxiv.org/abs/2402.10290",
    "authors": [
      "Sujay Nagesh Koujalgi",
      "Jonathan Dodge"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10291",
    "title": "An Evaluation of Real-time Adaptive Sampling Change Point Detection  Algorithm using KCUSUM",
    "abstract": "Detecting abrupt changes in real-time data streams from scientific simulations presents a challenging task, demanding the deployment of accurate and efficient algorithms. Identifying change points in live data stream involves continuous scrutiny of incoming observations for deviations in their statistical characteristics, particularly in high-volume data scenarios. Maintaining a balance between sudden change detection and minimizing false alarms is vital. Many existing algorithms for this purpose rely on known probability distributions, limiting their feasibility. In this study, we introduce the Kernel-based Cumulative Sum (KCUSUM) algorithm, a non-parametric extension of the traditional Cumulative Sum (CUSUM) method, which has gained prominence for its efficacy in online change point detection under less restrictive conditions. KCUSUM splits itself by comparing incoming samples directly with reference samples and computes a statistic grounded in the Maximum Mean Discrepancy (MMD) non-parametric framework. This approach extends KCUSUM's pertinence to scenarios where only reference samples are available, such as atomic trajectories of proteins in vacuum, facilitating the detection of deviations from the reference sample without prior knowledge of the data's underlying distribution. Furthermore, by harnessing MMD's inherent random-walk structure, we can theoretically analyze KCUSUM's performance across various use cases, including metrics like expected delay and mean runtime to false alarms. Finally, we discuss real-world use cases from scientific simulations such as NWChem CODAR and protein folding data, demonstrating KCUSUM's practical effectiveness in online change point detection. ",
    "url": "https://arxiv.org/abs/2402.10291",
    "authors": [
      "Vijayalakshmi Saravanan",
      "Perry Siehien",
      "Shinjae Yoo",
      "Hubertus Van Dam",
      "Thomas Flynn",
      "Christopher Kelly",
      "Khaled Z Ibrahim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.10294",
    "title": "LAVE: LLM-Powered Agent Assistance and Language Augmentation for Video  Editing",
    "abstract": "Video creation has become increasingly popular, yet the expertise and effort required for editing often pose barriers to beginners. In this paper, we explore the integration of large language models (LLMs) into the video editing workflow to reduce these barriers. Our design vision is embodied in LAVE, a novel system that provides LLM-powered agent assistance and language-augmented editing features. LAVE automatically generates language descriptions for the user's footage, serving as the foundation for enabling the LLM to process videos and assist in editing tasks. When the user provides editing objectives, the agent plans and executes relevant actions to fulfill them. Moreover, LAVE allows users to edit videos through either the agent or direct UI manipulation, providing flexibility and enabling manual refinement of agent actions. Our user study, which included eight participants ranging from novices to proficient editors, demonstrated LAVE's effectiveness. The results also shed light on user perceptions of the proposed LLM-assisted editing paradigm and its impact on users' creativity and sense of co-creation. Based on these findings, we propose design implications to inform the future development of agent-assisted content editing. ",
    "url": "https://arxiv.org/abs/2402.10294",
    "authors": [
      "Bryan Wang",
      "Yuliang Li",
      "Zhaoyang Lv",
      "Haijun Xia",
      "Yan Xu",
      "Raj Sodhi"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2402.10307",
    "title": "A New Radio to Overcome Critical Link Budgets",
    "abstract": "We propose Multi-Antenna (MA) Towards Inband Shift Keying (TISK): a new multi-carrier radio concept to cope with critical link budgets. In contrast to common proposals that rely on analog beamforming at both transmitter and receiver, MA-TISK does not require beam alignment. The transmitted signals have all constant envelope in continuous time, which allows for efficient, low-cost power amplification and up-conversion. The concept is compatible with any linear PSK-modulation as well as pulse position modulation. Each sub-carrier is sent over a separate antenna that is equipped with a voltage-controlled oscillator. The phases of these oscillators are controlled by digital baseband. Temporal signal combining makes up for the lack of beamforming gain at the transmitter. A common message may be broadcast to many receivers, simultaneously. Demodulation can be efficiently implemented by means of fast Fourier transform. MA-TISK does not suffer from spectral re-growth issues plaguing other constant envelope modulations like GMSK. Almost rectangular signal spectra similar to those for linear modulation with root-raised-cosine pulse shaping are possible. For the 100 MHz-wide spectral mask of 5G downlink, QPSK-modulation allows for 160 MBit/s with 5.74 MHz subcarrier spacing when using 16 transmit antennas. The wide carrier spacing makes the signals insensitive to Doppler effects. There is no loss in link budget gain compared to spatial beamforming at the transmitter. ",
    "url": "https://arxiv.org/abs/2402.10307",
    "authors": [
      "Ralf R. Müller"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.10310",
    "title": "Interpretable Generative Adversarial Imitation Learning",
    "abstract": "Imitation learning methods have demonstrated considerable success in teaching autonomous systems complex tasks through expert demonstrations. However, a limitation of these methods is their lack of interpretability, particularly in understanding the specific task the learning agent aims to accomplish. In this paper, we propose a novel imitation learning method that combines Signal Temporal Logic (STL) inference and control synthesis, enabling the explicit representation of the task as an STL formula. This approach not only provides a clear understanding of the task but also allows for the incorporation of human knowledge and adaptation to new scenarios through manual adjustments of the STL formulae. Additionally, we employ a Generative Adversarial Network (GAN)-inspired training approach for both the inference and the control policy, effectively narrowing the gap between the expert and learned policies. The effectiveness of our algorithm is demonstrated through two case studies, showcasing its practical applicability and adaptability. ",
    "url": "https://arxiv.org/abs/2402.10310",
    "authors": [
      "Wenliang Liu",
      "Danyang Li",
      "Erfan Aasi",
      "Roberto Tron",
      "Calin Belta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2402.10321",
    "title": "LaserSAM: Zero-Shot Change Detection Using Visual Segmentation of  Spinning LiDAR",
    "abstract": "This paper presents an approach for applying camera perception techniques to spinning LiDAR data. To improve the robustness of long-term change detection from a 3D LiDAR, range and intensity information are rendered into virtual perspectives using a pinhole camera model. Hue-saturation-value image encoding is used to colourize the images by range and near-IR intensity. The LiDAR's active scene illumination makes it invariant to ambient brightness, which enables night-to-day change detection without additional processing. Using the colourized, perspective range image allows existing foundation models to detect semantic regions. Specifically, the Segment Anything Model detects semantically similar regions in both a previously acquired map and live view from a path-repeating robot. By comparing the masks in both views, changes in the live scan are detected. Results indicate that the Segment Anything Model is capable of accurately capturing the shape of arbitrary changes introduced into scenes. The system achieves an object recall of 82.6% and a precision of 47.0%. Changes can be detected through day-to-night illumination variations reliably. After pixel-level masks are generated, the one-to-one correspondence with 3D points means that the 2D masks can be directly used to recover the 3D location of the changes. Eventually, the detected 3D changes can be avoided by treating them as obstacles in a local motion planner. ",
    "url": "https://arxiv.org/abs/2402.10321",
    "authors": [
      "Alexander Krawciw",
      "Sven Lilge",
      "Timothy D. Barfoot"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2402.10339",
    "title": "What to Do When Your Discrete Optimization Is the Size of a Neural  Network?",
    "abstract": "Oftentimes, machine learning applications using neural networks involve solving discrete optimization problems, such as in pruning, parameter-isolation-based continual learning and training of binary networks. Still, these discrete problems are combinatorial in nature and are also not amenable to gradient-based optimization. Additionally, classical approaches used in discrete settings do not scale well to large neural networks, forcing scientists and empiricists to rely on alternative methods. Among these, two main distinct sources of top-down information can be used to lead the model to good solutions: (1) extrapolating gradient information from points outside of the solution set (2) comparing evaluations between members of a subset of the valid solutions. We take continuation path (CP) methods to represent using purely the former and Monte Carlo (MC) methods to represent the latter, while also noting that some hybrid methods combine the two. The main goal of this work is to compare both approaches. For that purpose, we first overview the two classes while also discussing some of their drawbacks analytically. Then, on the experimental section, we compare their performance, starting with smaller microworld experiments, which allow more fine-grained control of problem variables, and gradually moving towards larger problems, including neural network regression and neural network pruning for image classification, where we additionally compare against magnitude-based pruning. ",
    "url": "https://arxiv.org/abs/2402.10339",
    "authors": [
      "Hugo Silva",
      "Martha White"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10359",
    "title": "Can we soft prompt LLMs for graph learning tasks?",
    "abstract": "Graph plays an important role in representing complex relationships in real-world applications such as social networks, biological data and citation networks. In recent years, Large Language Models (LLMs) have achieved tremendous success in various domains, which makes applying LLMs to graphs particularly appealing. However, directly applying LLMs to graph modalities presents unique challenges due to the discrepancy and mismatch between the graph and text modalities. Hence, to further investigate LLMs' potential for comprehending graph information, we introduce GraphPrompter, a novel framework designed to align graph information with LLMs via soft prompts. Specifically, GraphPrompter consists of two main components: a graph neural network to encode complex graph information and an LLM that effectively processes textual information. Comprehensive experiments on various benchmark datasets under node classification and link prediction tasks demonstrate the effectiveness of our proposed method. The GraphPrompter framework unveils the substantial capabilities of LLMs as predictors in graph-related tasks, enabling researchers to utilize LLMs across a spectrum of real-world graph scenarios more effectively. ",
    "url": "https://arxiv.org/abs/2402.10359",
    "authors": [
      "Zheyuan Liu",
      "Xiaoxin He",
      "Yijun Tian",
      "Nitesh V. Chawla"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.10365",
    "title": "Deep Spectral Meshes: Multi-Frequency Facial Mesh Processing with Graph  Neural Networks",
    "abstract": "With the rising popularity of virtual worlds, the importance of data-driven parametric models of 3D meshes has grown rapidly. Numerous applications, such as computer vision, procedural generation, and mesh editing, vastly rely on these models. However, current approaches do not allow for independent editing of deformations at different frequency levels. They also do not benefit from representing deformations at different frequencies with dedicated representations, which would better expose their properties and improve the generated meshes' geometric and perceptual quality. In this work, spectral meshes are introduced as a method to decompose mesh deformations into low-frequency and high-frequency deformations. These features of low- and high-frequency deformations are used for representation learning with graph convolutional networks. A parametric model for 3D facial mesh synthesis is built upon the proposed framework, exposing user parameters that control disentangled high- and low-frequency deformations. Independent control of deformations at different frequencies and generation of plausible synthetic examples are mutually exclusive objectives. A Conditioning Factor is introduced to leverage these objectives. Our model takes further advantage of spectral partitioning by representing different frequency levels with disparate, more suitable representations. Low frequencies are represented with standardised Euclidean coordinates, and high frequencies with a normalised deformation representation (DR). This paper investigates applications of our proposed approach in mesh reconstruction, mesh interpolation, and multi-frequency editing. It is demonstrated that our method improves the overall quality of generated meshes on most datasets when considering both the $L_1$ norm and perceptual Dihedral Angle Mesh Error (DAME) metrics. ",
    "url": "https://arxiv.org/abs/2402.10365",
    "authors": [
      "Robert Kosk",
      "Richard Southern",
      "Lihua You",
      "Shaojun Bian",
      "Willem Kokke",
      "Greg Maguire"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computational Geometry (cs.CG)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2402.10372",
    "title": "Sequential Manipulation of Deformable Linear Object Networks with  Endpoint Pose Measurements using Adaptive Model Predictive Control",
    "abstract": "Robotic manipulation of deformable linear objects (DLOs) is an active area of research, though emerging applications, like automotive wire harness installation, introduce constraints that have not been considered in prior work. Confined workspaces and limited visibility complicate prior assumptions of multi-robot manipulation and direct measurement of DLO configuration (state). This work focuses on single-arm manipulation of stiff DLOs (StDLOs) connected to form a DLO network (DLON), for which the measurements (output) are the endpoint poses of the DLON, which are subject to unknown dynamics during manipulation. To demonstrate feasibility of output-based control without state estimation, direct input-output dynamics are shown to exist by training neural network models on simulated trajectories. Output dynamics are then approximated with polynomials and found to contain well-known rigid body dynamics terms. A composite model consisting of a rigid body model and an online data-driven residual is developed, which predicts output dynamics more accurately than either model alone, and without prior experience with the system. An adaptive model predictive controller is developed with the composite model for DLON manipulation, which completes DLON installation tasks, both in simulation and with a physical automotive wire harness. ",
    "url": "https://arxiv.org/abs/2402.10372",
    "authors": [
      "Tyler Toner",
      "Vahidreza Molazadeh",
      "Miguel Saez",
      "Dawn M. Tilbury",
      "Kira Barton"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2402.10388",
    "title": "Improvising Age Verification Technologies in Canada: Technical,  Regulatory and Social Dynamics",
    "abstract": "Age verification, which is a mandatory legal requirement for delivering certain age-appropriate services or products, has recently been emphasized around the globe to ensure online safety for children. The rapid advancement of artificial intelligence has facilitated the recent development of some cutting-edge age-verification technologies, particularly using biometrics. However, successful deployment and mass acceptance of these technologies are significantly dependent on the corresponding socio-economic and regulatory context. This paper reviews such key dynamics for improvising age-verification technologies in Canada. It is particularly essential for such technologies to be inclusive, transparent, adaptable, privacy-preserving, and secure. Effective collaboration between academia, government, and industry entities can help to meet the growing demands for age-verification services in Canada while maintaining a user-centric approach. ",
    "url": "https://arxiv.org/abs/2402.10388",
    "authors": [
      "Azfar Adib",
      "Wei-Ping Zhu",
      "M. Omair Ahmad"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.10389",
    "title": "Enabling Zero Trust Security in IoMT Edge Network",
    "abstract": "Internet of Medical Things (IoMT) deals with a patient-data-rich segment, which makes security and privacy a severe concern for patients. Therefore, access control is a significant aspect of ensuring trust in the IoMT. However, deploying existing authentication and authorization solutions to the Internet of Medical Things (IoMT) is not straightforward because of highly dynamic and possibly unprotected environments and untrusted supply chain for the IoT devices. In this article, we propose Soter, a Zero-Trust based authentication system for the IoMT. Soter Incorporates trust negotiation mechanisms within the Zero Trust framework to enable dynamic trust establishment. When a user or device seeks access to a resource, initiate a trust negotiation process. During this process, credentials, attributes, and contextual information are exchanged between the requester and the resource owner. Soter defines access rules based on various factors, including user identity, device health, and location. Access is granted or denied based on these conditions. ",
    "url": "https://arxiv.org/abs/2402.10389",
    "authors": [
      "Maha Ali Allouzi",
      "Javed Khan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2402.10397",
    "title": "LogELECTRA: Self-supervised Anomaly Detection for Unstructured Logs",
    "abstract": "System logs are some of the most important information for the maintenance of software systems, which have become larger and more complex in recent years. The goal of log-based anomaly detection is to automatically detect system anomalies by analyzing the large number of logs generated in a short period of time, which is a critical challenge in the real world. Previous studies have used a log parser to extract templates from unstructured log data and detect anomalies on the basis of patterns of the template occurrences. These methods have limitations for logs with unknown templates. Furthermore, since most log anomalies are known to be point anomalies rather than contextual anomalies, detection methods based on occurrence patterns can cause unnecessary delays in detection. In this paper, we propose LogELECTRA, a new log anomaly detection model that analyzes a single line of log messages more deeply on the basis of self-supervised anomaly detection. LogELECTRA specializes in detecting log anomalies as point anomalies by applying ELECTRA, a natural language processing model, to analyze the semantics of a single line of log messages. LogELECTRA outperformed existing state-of-the-art methods in experiments on the public benchmark log datasets BGL, Sprit, and Thunderbird. ",
    "url": "https://arxiv.org/abs/2402.10397",
    "authors": [
      "Yuuki Yamanaka",
      "Tomokatsu Takahashi",
      "Takuya Minami",
      "Yoshiaki Nakajima"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2402.10398",
    "title": "Prompt Learning for Multi-Label Code Smell Detection: A Promising  Approach",
    "abstract": "Code smells indicate the potential problems of software quality so that developers can identify refactoring opportunities by detecting code smells. State-of-the-art approaches leverage heuristics, machine learning, and deep learning to detect code smells. However, existing approaches have not fully explored the potential of large language models (LLMs). In this paper, we propose \\textit{PromptSmell}, a novel approach based on prompt learning for detecting multi-label code smell. Firstly, code snippets are acquired by traversing abstract syntax trees. Combined code snippets with natural language prompts and mask tokens, \\textit{PromptSmell} constructs the input of LLMs. Secondly, to detect multi-label code smell, we leverage a label combination approach by converting a multi-label problem into a multi-classification problem. A customized answer space is added to the word list of pre-trained language models, and the probability distribution of intermediate answers is obtained by predicting the words at the mask positions. Finally, the intermediate answers are mapped to the target class labels by a verbalizer as the final classification result. We evaluate the effectiveness of \\textit{PromptSmell} by answering six research questions. The experimental results demonstrate that \\textit{PromptSmell} obtains an improvement of 11.17\\% in $precision_{w}$ and 7.4\\% in $F1_{w}$ compared to existing approaches. ",
    "url": "https://arxiv.org/abs/2402.10398",
    "authors": [
      "Haiyang Liu",
      "Yang Zhang",
      "Vidya Saikrishna",
      "Quanquan Tian",
      "Kun Zheng"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2402.10403",
    "title": "Polyhedral Complex Derivation from Piecewise Trilinear Networks",
    "abstract": "Recent advancements in visualizing deep neural networks provide insights into their structures and mesh extraction from Continuous Piecewise Affine (CPWA) functions. Meanwhile, developments in neural surface representation learning incorporate non-linear positional encoding, addressing issues like spectral bias; however, this poses challenges in applying mesh extraction techniques based on CPWA functions. Focusing on trilinear interpolating methods as positional encoding, we present theoretical insights and an analytical mesh extraction, showing the transformation of hypersurfaces to flat planes within the trilinear region under the eikonal constraint. Moreover, we introduce a method for approximating intersecting points among three hypersurfaces contributing to broader applications. We empirically validate correctness and parsimony through chamfer distance and efficiency, and angular distance, while examining the correlation between the eikonal loss and the planarity of the hypersurfaces. ",
    "url": "https://arxiv.org/abs/2402.10403",
    "authors": [
      "Jin-Hwa Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2402.10409",
    "title": "Understanding Survey Paper Taxonomy about Large Language Models via  Graph Representation Learning",
    "abstract": "As new research on Large Language Models (LLMs) continues, it is difficult to keep up with new research and models. To help researchers synthesize the new research many have written survey papers, but even those have become numerous. In this paper, we develop a method to automatically assign survey papers to a taxonomy. We collect the metadata of 144 LLM survey papers and explore three paradigms to classify papers within the taxonomy. Our work indicates that leveraging graph structure information on co-category graphs can significantly outperform the language models in two paradigms; pre-trained language models' fine-tuning and zero-shot/few-shot classifications using LLMs. We find that our model surpasses an average human recognition level and that fine-tuning LLMs using weak labels generated by a smaller model, such as the GCN in this study, can be more effective than using ground-truth labels, revealing the potential of weak-to-strong generalization in the taxonomy classification task. ",
    "url": "https://arxiv.org/abs/2402.10409",
    "authors": [
      "Jun Zhuang",
      "Casey Kennington"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10423",
    "title": "Connect the dots: Dataset Condensation, Differential Privacy, and  Adversarial Uncertainty",
    "abstract": "Our work focuses on understanding the underpinning mechanism of dataset condensation by drawing connections with ($\\epsilon$, $\\delta$)-differential privacy where the optimal noise, $\\epsilon$, is chosen by adversarial uncertainty \\cite{Grining2017}. We can answer the question about the inner workings of the dataset condensation procedure. Previous work \\cite{dong2022} proved the link between dataset condensation (DC) and ($\\epsilon$, $\\delta$)-differential privacy. However, it is unclear from existing works on ablating DC to obtain a lower-bound estimate of $\\epsilon$ that will suffice for creating high-fidelity synthetic data. We suggest that adversarial uncertainty is the most appropriate method to achieve an optimal noise level, $\\epsilon$. As part of the internal dynamics of dataset condensation, we adopt a satisfactory scheme for noise estimation that guarantees high-fidelity data while providing privacy. ",
    "url": "https://arxiv.org/abs/2402.10423",
    "authors": [
      "Kenneth Odoh"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10426",
    "title": "DELL: Generating Reactions and Explanations for LLM-Based Misinformation  Detection",
    "abstract": "Large language models are limited by challenges in factuality and hallucinations to be directly employed off-the-shelf for judging the veracity of news articles, where factual accuracy is paramount. In this work, we propose DELL that identifies three key stages in misinformation detection where LLMs could be incorporated as part of the pipeline: 1) LLMs could \\emph{generate news reactions} to represent diverse perspectives and simulate user-news interaction networks; 2) LLMs could \\emph{generate explanations} for proxy tasks (e.g., sentiment, stance) to enrich the contexts of news articles and produce experts specializing in various aspects of news understanding; 3) LLMs could \\emph{merge task-specific experts} and provide an overall prediction by incorporating the predictions and confidence scores of varying experts. Extensive experiments on seven datasets with three LLMs demonstrate that DELL outperforms state-of-the-art baselines by up to 16.8\\% in macro f1-score. Further analysis reveals that the generated reactions and explanations are greatly helpful in misinformation detection, while our proposed LLM-guided expert merging helps produce better-calibrated predictions. ",
    "url": "https://arxiv.org/abs/2402.10426",
    "authors": [
      "Herun Wan",
      "Shangbin Feng",
      "Zhaoxuan Tan",
      "Heng Wang",
      "Yulia Tsvetkov",
      "Minnan Luo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.10434",
    "title": "Parametric Augmentation for Time Series Contrastive Learning",
    "abstract": "Modern techniques like contrastive learning have been effectively used in many areas, including computer vision, natural language processing, and graph-structured data. Creating positive examples that assist the model in learning robust and discriminative representations is a crucial stage in contrastive learning approaches. Usually, preset human intuition directs the selection of relevant data augmentations. Due to patterns that are easily recognized by humans, this rule of thumb works well in the vision and language domains. However, it is impractical to visually inspect the temporal structures in time series. The diversity of time series augmentations at both the dataset and instance levels makes it difficult to choose meaningful augmentations on the fly. In this study, we address this gap by analyzing time series data augmentation using information theory and summarizing the most commonly adopted augmentations in a unified format. We then propose a contrastive learning framework with parametric augmentation, AutoTCL, which can be adaptively employed to support time series representation learning. The proposed approach is encoder-agnostic, allowing it to be seamlessly integrated with different backbone encoders. Experiments on univariate forecasting tasks demonstrate the highly competitive results of our method, with an average 6.5\\% reduction in MSE and 4.7\\% in MAE over the leading baselines. In classification tasks, AutoTCL achieves a $1.2\\%$ increase in average accuracy. ",
    "url": "https://arxiv.org/abs/2402.10434",
    "authors": [
      "Xu Zheng",
      "Tianchun Wang",
      "Wei Cheng",
      "Aitian Ma",
      "Haifeng Chen",
      "Mo Sha",
      "Dongsheng Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10468",
    "title": "Adversarial Curriculum Graph Contrastive Learning with Pair-wise  Augmentation",
    "abstract": "Graph contrastive learning (GCL) has emerged as a pivotal technique in the domain of graph representation learning. A crucial aspect of effective GCL is the caliber of generated positive and negative samples, which is intrinsically dictated by their resemblance to the original data. Nevertheless, precise control over similarity during sample generation presents a formidable challenge, often impeding the effective discovery of representative graph patterns. To address this challenge, we propose an innovative framework: Adversarial Curriculum Graph Contrastive Learning (ACGCL), which capitalizes on the merits of pair-wise augmentation to engender graph-level positive and negative samples with controllable similarity, alongside subgraph contrastive learning to discern effective graph patterns therein. Within the ACGCL framework, we have devised a novel adversarial curriculum training methodology that facilitates progressive learning by sequentially increasing the difficulty of distinguishing the generated samples. Notably, this approach transcends the prevalent sparsity issue inherent in conventional curriculum learning strategies by adaptively concentrating on more challenging training data. Finally, a comprehensive assessment of ACGCL is conducted through extensive experiments on six well-known benchmark datasets, wherein ACGCL conspicuously surpasses a set of state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2402.10468",
    "authors": [
      "Xinjian Zhao",
      "Liang Zhang",
      "Yang Liu",
      "Ruocheng Guo",
      "Xiangyu Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10470",
    "title": "Theoretical Understanding of Learning from Adversarial Perturbations",
    "abstract": "It is not fully understood why adversarial examples can deceive neural networks and transfer between different networks. To elucidate this, several studies have hypothesized that adversarial perturbations, while appearing as noises, contain class features. This is supported by empirical evidence showing that networks trained on mislabeled adversarial examples can still generalize well to correctly labeled test samples. However, a theoretical understanding of how perturbations include class features and contribute to generalization is limited. In this study, we provide a theoretical framework for understanding learning from perturbations using a one-hidden-layer network trained on mutually orthogonal samples. Our results highlight that various adversarial perturbations, even perturbations of a few pixels, contain sufficient class features for generalization. Moreover, we reveal that the decision boundary when learning from perturbations matches that from standard samples except for specific regions under mild conditions. The code is available at https://github.com/s-kumano/learning-from-adversarial-perturbations. ",
    "url": "https://arxiv.org/abs/2402.10470",
    "authors": [
      "Soichiro Kumano",
      "Hiroshi Kera",
      "Toshihiko Yamasaki"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.10473",
    "title": "Privacy for Fairness: Information Obfuscation for Fair Representation  Learning with Local Differential Privacy",
    "abstract": "As machine learning (ML) becomes more prevalent in human-centric applications, there is a growing emphasis on algorithmic fairness and privacy protection. While previous research has explored these areas as separate objectives, there is a growing recognition of the complex relationship between privacy and fairness. However, previous works have primarily focused on examining the interplay between privacy and fairness through empirical investigations, with limited attention given to theoretical exploration. This study aims to bridge this gap by introducing a theoretical framework that enables a comprehensive examination of their interrelation. We shall develop and analyze an information bottleneck (IB) based information obfuscation method with local differential privacy (LDP) for fair representation learning. In contrast to many empirical studies on fairness in ML, we show that the incorporation of LDP randomizers during the encoding process can enhance the fairness of the learned representation. Our analysis will demonstrate that the disclosure of sensitive information is constrained by the privacy budget of the LDP randomizer, thereby enabling the optimization process within the IB framework to effectively suppress sensitive information while preserving the desired utility through obfuscation. Based on the proposed method, we further develop a variational representation encoding approach that simultaneously achieves fairness and LDP. Our variational encoding approach offers practical advantages. It is trained using a non-adversarial method and does not require the introduction of any variational prior. Extensive experiments will be presented to validate our theoretical results and demonstrate the ability of our proposed approach to achieve both LDP and fairness while preserving adequate utility. ",
    "url": "https://arxiv.org/abs/2402.10473",
    "authors": [
      "Songjie Xie",
      "Youlong Wu",
      "Jiaxuan Li",
      "Ming Ding",
      "Khaled B. Letaief"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2402.10476",
    "title": "Spike-EVPR: Deep Spiking Residual Network with Cross-Representation  Aggregation for Event-Based Visual Place Recognition",
    "abstract": "Event cameras have been successfully applied to visual place recognition (VPR) tasks by using deep artificial neural networks (ANNs) in recent years. However, previously proposed deep ANN architectures are often unable to harness the abundant temporal information presented in event streams. In contrast, deep spiking networks exhibit more intricate spatiotemporal dynamics and are inherently well-suited to process sparse asynchronous event streams. Unfortunately, directly inputting temporal-dense event volumes into the spiking network introduces excessive time steps, resulting in prohibitively high training costs for large-scale VPR tasks. To address the aforementioned issues, we propose a novel deep spiking network architecture called Spike-EVPR for event-based VPR tasks. First, we introduce two novel event representations tailored for SNN to fully exploit the spatio-temporal information from the event streams, and reduce the video memory occupation during training as much as possible. Then, to exploit the full potential of these two representations, we construct a Bifurcated Spike Residual Encoder (BSR-Encoder) with powerful representational capabilities to better extract the high-level features from the two event representations. Next, we introduce a Shared & Specific Descriptor Extractor (SSD-Extractor). This module is designed to extract features shared between the two representations and features specific to each. Finally, we propose a Cross-Descriptor Aggregation Module (CDA-Module) that fuses the above three features to generate a refined, robust global descriptor of the scene. Our experimental results indicate the superior performance of our Spike-EVPR compared to several existing EVPR pipelines on Brisbane-Event-VPR and DDD20 datasets, with the average Recall@1 increased by 7.61% on Brisbane and 13.20% on DDD20. ",
    "url": "https://arxiv.org/abs/2402.10476",
    "authors": [
      "Chenming Hu",
      "Zheng Fang",
      "Kuanxu Hou",
      "Delei Kong",
      "Junjie Jiang",
      "Hao Zhuang",
      "Mingyuan Sun",
      "Xinjie Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.10477",
    "title": "Understanding Likelihood of Normalizing Flow and Image Complexity  through the Lens of Out-of-Distribution Detection",
    "abstract": "Out-of-distribution (OOD) detection is crucial to safety-critical machine learning applications and has been extensively studied. While recent studies have predominantly focused on classifier-based methods, research on deep generative model (DGM)-based methods have lagged relatively. This disparity may be attributed to a perplexing phenomenon: DGMs often assign higher likelihoods to unknown OOD inputs than to their known training data. This paper focuses on explaining the underlying mechanism of this phenomenon. We propose a hypothesis that less complex images concentrate in high-density regions in the latent space, resulting in a higher likelihood assignment in the Normalizing Flow (NF). We experimentally demonstrate its validity for five NF architectures, concluding that their likelihood is untrustworthy. Additionally, we show that this problem can be alleviated by treating image complexity as an independent variable. Finally, we provide evidence of the potential applicability of our hypothesis in another DGM, PixelCNN++. ",
    "url": "https://arxiv.org/abs/2402.10477",
    "authors": [
      "Genki Osada",
      "Tsubasa Takahashi",
      "Takashi Nishide"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10478",
    "title": "CodaMal: Contrastive Domain Adaptation for Malaria Detection in Low-Cost  Microscopes",
    "abstract": "Malaria is a major health issue worldwide, and its diagnosis requires scalable solutions that can work effectively with low-cost microscopes (LCM). Deep learning-based methods have shown success in computer-aided diagnosis from microscopic images. However, these methods need annotated images that show cells affected by malaria parasites and their life stages. Annotating images from LCM significantly increases the burden on medical experts compared to annotating images from high-cost microscopes (HCM). For this reason, a practical solution would be trained on HCM images which should generalize well on LCM images during testing. While earlier methods adopted a multi-stage learning process, they did not offer an end-to-end approach. In this work, we present an end-to-end learning framework, named CodaMal (Contrastive Domain Adpation for Malaria). In order to bridge the gap between HCM (training) and LCM (testing), we propose a domain adaptive contrastive loss. It reduces the domain shift by promoting similarity between the representations of HCM and its corresponding LCM image, without imposing an additional annotation burden. In addition, the training objective includes object detection objectives with carefully designed augmentations, ensuring the accurate detection of malaria parasites. On the publicly available large-scale M5-dataset, our proposed method shows a significant improvement of 16% over the state-of-the-art methods in terms of the mean average precision metric (mAP), provides 21x speed up during inference, and requires only half learnable parameters than the prior methods. Our code is publicly available. ",
    "url": "https://arxiv.org/abs/2402.10478",
    "authors": [
      "Ishan Rajendrakumar Dave",
      "Tristan de Blegiers",
      "Chen Chen",
      "Mubarak Shah"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10496",
    "title": "Comparing Hallucination Detection Metrics for Multilingual Generation",
    "abstract": "While many automatic hallucination detection techniques have been proposed for English texts, their effectiveness in multilingual contexts remains unexplored. This paper aims to bridge the gap in understanding how these hallucination detection metrics perform on non-English languages. We evaluate the efficacy of various detection metrics, including lexical metrics like ROUGE and Named Entity Overlap and Natural Language Inference (NLI)-based metrics, at detecting hallucinations in biographical summaries in many languages; we also evaluate how correlated these different metrics are to gauge whether they measure the same phenomena. Our empirical analysis reveals that while lexical metrics show limited effectiveness, NLI-based metrics perform well in high-resource languages at the sentence level. In contrast, NLI-based metrics often fail to detect atomic fact hallucinations. Our findings highlight existing gaps in multilingual hallucination detection and motivate future research to develop more robust detection methods for LLM hallucination in other languages. ",
    "url": "https://arxiv.org/abs/2402.10496",
    "authors": [
      "Haoqiang Kang",
      "Terra Blevins",
      "Luke Zettlemoyer"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10505",
    "title": "A Survey of Resilient Coordination for Cyber-Physical Systems Against  Malicious Attacks",
    "abstract": "Cyber-physical systems (CPSs) facilitate the integration of physical entities and cyber infrastructures through the utilization of pervasive computational resources and communication units, leading to improved efficiency, automation, and practical viability in both academia and industry. Due to its openness and distributed characteristics, a critical issue prevalent in CPSs is to guarantee resilience in presence of malicious attacks. This paper conducts a comprehensive survey of recent advances on resilient coordination for CPSs. Different from existing survey papers, we focus on the node injection attack and propose a novel taxonomy according to the multi-layered framework of CPS. Furthermore, miscellaneous resilient coordination problems are discussed in this survey. Specifically, some preliminaries and the fundamental problem settings are given at the beginning. Subsequently, based on a multi-layered framework of CPSs, promising results of resilient consensus are classified and reviewed from three perspectives: physical structure, communication mechanism, and network topology. Next, two typical application scenarios, i.e., multi-robot systems and smart grids are exemplified to extend resilient consensus to other coordination tasks. Particularly, we examine resilient containment and resilient distributed optimization problems, both of which demonstrate the applicability of resilient coordination approaches. Finally, potential avenues are highlighted for future research. ",
    "url": "https://arxiv.org/abs/2402.10505",
    "authors": [
      "Zirui Liao",
      "Jian Shi",
      "Yuwei Zhang",
      "Shaoping Wang",
      "Zhiyong Sun"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2402.10527",
    "title": "Zero-shot sampling of adversarial entities in biomedical question  answering",
    "abstract": "The increasing depth of parametric domain knowledge in large language models (LLMs) is fueling their rapid deployment in real-world applications. In high-stakes and knowledge-intensive tasks, understanding model vulnerabilities is essential for quantifying the trustworthiness of model predictions and regulating their use. The recent discovery of named entities as adversarial examples in natural language processing tasks raises questions about their potential guises in other settings. Here, we propose a powerscaled distance-weighted sampling scheme in embedding space to discover diverse adversarial entities as distractors. We demonstrate its advantage over random sampling in adversarial question answering on biomedical topics. Our approach enables the exploration of different regions on the attack surface, which reveals two regimes of adversarial entities that markedly differ in their characteristics. Moreover, we show that the attacks successfully manipulate token-wise Shapley value explanations, which become deceptive in the adversarial setting. Our investigations illustrate the brittleness of domain knowledge in LLMs and reveal a shortcoming of standard evaluations for high-capacity models. ",
    "url": "https://arxiv.org/abs/2402.10527",
    "authors": [
      "R. Patrick Xian",
      "Alex J. Lee",
      "Vincent Wang",
      "Qiming Cui",
      "Russell Ro",
      "Reza Abbasi-Asl"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2402.10533",
    "title": "APCodec: A Neural Audio Codec with Parallel Amplitude and Phase Spectrum  Encoding and Decoding",
    "abstract": "This paper introduces a novel neural audio codec targeting high waveform sampling rates and low bitrates named APCodec, which seamlessly integrates the strengths of parametric codecs and waveform codecs. The APCodec revolutionizes the process of audio encoding and decoding by concurrently handling the amplitude and phase spectra as audio parametric characteristics like parametric codecs. It is composed of an encoder and a decoder with the modified ConvNeXt v2 network as the backbone, connected by a quantizer based on the residual vector quantization (RVQ) mechanism. The encoder compresses the audio amplitude and phase spectra in parallel, amalgamating them into a continuous latent code at a reduced temporal resolution. This code is subsequently quantized by the quantizer. Ultimately, the decoder reconstructs the audio amplitude and phase spectra in parallel, and the decoded waveform is obtained by inverse short-time Fourier transform. To ensure the fidelity of decoded audio like waveform codecs, spectral-level loss, quantization loss, and generative adversarial network (GAN) based loss are collectively employed for training the APCodec. To support low-latency streamable inference, we employ feed-forward layers and causal convolutional layers in APCodec, incorporating a knowledge distillation training strategy to enhance the quality of decoded audio. Experimental results confirm that our proposed APCodec can encode 48 kHz audio at bitrate of just 6 kbps, with no significant degradation in the quality of the decoded audio. At the same bitrate, our proposed APCodec also demonstrates superior decoded audio quality and faster generation speed compared to well-known codecs, such as SoundStream, Encodec, HiFi-Codec and AudioDec. ",
    "url": "https://arxiv.org/abs/2402.10533",
    "authors": [
      "Yang Ai",
      "Xiao-Hang Jiang",
      "Ye-Xin Lu",
      "Hui-Peng Du",
      "Zhen-Hua Ling"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2402.10558",
    "title": "Neural paraphrasing by automatically crawled and aligned sentence pairs",
    "abstract": "Paraphrasing is the task of re-writing an input text using other words, without altering the meaning of the original content. Conversational systems can exploit automatic paraphrasing to make the conversation more natural, e.g., talking about a certain topic using different paraphrases in different time instants. Recently, the task of automatically generating paraphrases has been approached in the context of Natural Language Generation (NLG). While many existing systems simply consist in rule-based models, the recent success of the Deep Neural Networks in several NLG tasks naturally suggests the possibility of exploiting such networks for generating paraphrases. However, the main obstacle toward neural-network-based paraphrasing is the lack of large datasets with aligned pairs of sentences and paraphrases, that are needed to efficiently train the neural models. In this paper we present a method for the automatic generation of large aligned corpora, that is based on the assumption that news and blog websites talk about the same events using different narrative styles. We propose a similarity search procedure with linguistic constraints that, given a reference sentence, is able to locate the most similar candidate paraphrases out from millions of indexed sentences. The data generation process is evaluated in the case of the Italian language, performing experiments using pointer-based deep neural architectures. ",
    "url": "https://arxiv.org/abs/2402.10558",
    "authors": [
      "Achille Globo",
      "Antonio Trevisi",
      "Andrea Zugarini",
      "Leonardo Rigutini",
      "Marco Maggini",
      "Stefano Melacci"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.10575",
    "title": "Symbolic Autoencoding for Self-Supervised Sequence Learning",
    "abstract": "Traditional language models, adept at next-token prediction in text sequences, often struggle with transduction tasks between distinct symbolic systems, particularly when parallel data is scarce. Addressing this issue, we introduce \\textit{symbolic autoencoding} ($\\Sigma$AE), a self-supervised framework that harnesses the power of abundant unparallel data alongside limited parallel data. $\\Sigma$AE connects two generative models via a discrete bottleneck layer and is optimized end-to-end by minimizing reconstruction loss (simultaneously with supervised loss for the parallel data), such that the sequence generated by the discrete bottleneck can be read out as the transduced input sequence. We also develop gradient-based methods allowing for efficient self-supervised sequence learning despite the discreteness of the bottleneck. Our results demonstrate that $\\Sigma$AE significantly enhances performance on transduction tasks, even with minimal parallel data, offering a promising solution for weakly supervised learning scenarios. ",
    "url": "https://arxiv.org/abs/2402.10575",
    "authors": [
      "Mohammad Hossein Amani",
      "Nicolas Mario Baldwin",
      "Amin Mansouri",
      "Martin Josifoski",
      "Maxime Peyrard",
      "Robert West"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10595",
    "title": "Compact and De-biased Negative Instance Embedding for Multi-Instance  Learning on Whole-Slide Image Classification",
    "abstract": "Whole-slide image (WSI) classification is a challenging task because 1) patches from WSI lack annotation, and 2) WSI possesses unnecessary variability, e.g., stain protocol. Recently, Multiple-Instance Learning (MIL) has made significant progress, allowing for classification based on slide-level, rather than patch-level, annotations. However, existing MIL methods ignore that all patches from normal slides are normal. Using this free annotation, we introduce a semi-supervision signal to de-bias the inter-slide variability and to capture the common factors of variation within normal patches. Because our method is orthogonal to the MIL algorithm, we evaluate our method on top of the recently proposed MIL algorithms and also compare the performance with other semi-supervised approaches. We evaluate our method on two public WSI datasets including Camelyon-16 and TCGA lung cancer and demonstrate that our approach significantly improves the predictive performance of existing MIL algorithms and outperforms other semi-supervised algorithms. We release our code at https://github.com/AITRICS/pathology_mil. ",
    "url": "https://arxiv.org/abs/2402.10595",
    "authors": [
      "Joohyung Lee",
      "Heejeong Nam",
      "Kwanhyung Lee",
      "Sangchul Hahn"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.10600",
    "title": "Envisioning the Future Role of 3D Wireless Networks in Preventing and  Managing Disasters and Emergency Situations",
    "abstract": "In an era marked by unprecedented climatic upheavals and evolving urban landscapes, the role of advanced communication networks in disaster prevention and management is becoming increasingly critical. This paper explores the transformative potential of 3D wireless networks, an innovative amalgamation of terrestrial, aerial, and satellite technologies, in enhancing disaster response mechanisms. We delve into a myriad of use cases, ranging from large facility evacuations to wildfire management, underscoring the versatility of these networks in ensuring timely communication, real-time situational awareness, and efficient resource allocation during crises. We also present an overview of cutting-edge prototypes, highlighting the practical feasibility and operational efficacy of 3D wireless networks in real-world scenarios. Simultaneously, we acknowledge the challenges posed by aspects such as cybersecurity, cross-border coordination, and physical layer technological hurdles, and propose future directions for research and development in this domain. ",
    "url": "https://arxiv.org/abs/2402.10600",
    "authors": [
      "Ahmed Alhammadi",
      "Anuj Abraham",
      "Aymen Fakhreddine",
      "Yu Tian",
      "Jun Du",
      "Faouzi Bader"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2402.10612",
    "title": "Retrieve Only When It Needs: Adaptive Retrieval Augmentation for  Hallucination Mitigation in Large Language Models",
    "abstract": "Hallucinations pose a significant challenge for the practical implementation of large language models (LLMs). The utilization of parametric knowledge in generating factual content is constrained by the limited knowledge of LLMs, potentially resulting in internal hallucinations. While incorporating external information can help fill knowledge gaps, it also introduces the risk of irrelevant information, thereby increasing the likelihood of external hallucinations. A careful and balanced integration of the parametric knowledge within LLMs with external information is crucial to alleviate hallucinations. In this study, we present Rowen, a novel approach that enhances LLMs with a selective retrieval augmentation process tailored to address hallucinated outputs. This process is governed by a multilingual semantic-aware detection module, which evaluates the consistency of the perturbed responses across various languages for the same queries. Upon detecting inconsistencies indicative of hallucinations, Rowen activates the retrieval of external information to rectify the model outputs. Rowen adeptly harmonizes the intrinsic parameters in LLMs with external knowledge sources, effectively mitigating hallucinations by ensuring a balanced integration of internal reasoning and external evidence. Through a comprehensive empirical analysis, we demonstrate that Rowen surpasses the current state-of-the-art in both detecting and mitigating hallucinated content within the outputs of LLMs. ",
    "url": "https://arxiv.org/abs/2402.10612",
    "authors": [
      "Hanxing Ding",
      "Liang Pang",
      "Zihao Wei",
      "Huawei Shen",
      "Xueqi Cheng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.10626",
    "title": "Robust Beamforming for RIS-aided Communications: Gradient-based Manifold  Meta Learning",
    "abstract": "Reconfigurable intelligent surface (RIS) has become a promising technology to realize the programmable wireless environment via steering the incident signal in fully customizable ways. However, a major challenge in RIS-aided communication systems is the simultaneous design of the precoding matrix at the base station (BS) and the phase shifting matrix of the RIS elements. This is mainly attributed to the highly non-convex optimization space of variables at both the BS and the RIS, and the diversity of communication environments. Generally, traditional optimization methods for this problem suffer from the high complexity, while existing deep learning based methods are lack of robustness in various scenarios. To address these issues, we introduce a gradient-based manifold meta learning method (GMML), which works without pre-training and has strong robustness for RIS-aided communications. Specifically, the proposed method fuses meta learning and manifold learning to improve the overall spectral efficiency, and reduce the overhead of the high-dimensional signal process. Unlike traditional deep learning based methods which directly take channel state information as input, GMML feeds the gradients of the precoding matrix and phase shifting matrix into neural networks. Coherently, we design a differential regulator to constrain the phase shifting matrix of the RIS. Numerical results show that the proposed GMML can improve the spectral efficiency by up to 7.31\\%, and speed up the convergence by 23 times faster compared to traditional approaches. Moreover, they also demonstrate remarkable robustness and adaptability in dynamic settings. ",
    "url": "https://arxiv.org/abs/2402.10626",
    "authors": [
      "Fenghao Zhu",
      "Xinquan Wang",
      "Chongwen Huang",
      "Zhaohui Yang",
      "Xiaoming Chen",
      "Ahmed Alhammadi",
      "Zhaoyang Zhang",
      "Chau Yuen",
      "Mérouane Debbah"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.10649",
    "title": "Hermite Neural Network Simulation for Solving the 2D Schrodinger  Equation",
    "abstract": "The Schrodinger equation is a mathematical equation describing the wave function's behavior in a quantum-mechanical system. It is a partial differential equation that provides valuable insights into the fundamental principles of quantum mechanics. In this paper, the aim was to solve the Schrodinger equation with sufficient accuracy by using a mixture of neural networks with the collocation method base Hermite functions. Initially, the Hermite functions roots were employed as collocation points, enhancing the efficiency of the solution. The Schrodinger equation is defined in an infinite domain, the use of Hermite functions as activation functions resulted in excellent precision. Finally, the proposed method was simulated using MATLAB's Simulink tool. The results were then compared with those obtained using Physics-informed neural networks and the presented method. ",
    "url": "https://arxiv.org/abs/2402.10649",
    "authors": [
      "Kourosh Parand",
      "Aida Pakniyat"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2402.10655",
    "title": "An energy-based material model for the simulation of shape memory alloys  under complex boundary value problems",
    "abstract": "Shape memory alloys are remarkable 'smart' materials used in a broad spectrum of applications, ranging from aerospace to robotics, thanks to their unique thermomechanical coupling capabilities. Given the complex properties of shape memory alloys, which are largely influenced by thermal and mechanical loads, as well as their loading history, predicting their behavior can be challenging. Consequently, there exists a pronounced demand for an efficient material model to simulate the behavior of these alloys. This paper introduces a material model rooted in Hamilton's principle. The key advantages of the presented material model encompass a more accurate depiction of the internal variable evolution and heightened robustness. As such, the proposed material model signifies an advancement in the realistic and efficient simulation of shape memory alloys. ",
    "url": "https://arxiv.org/abs/2402.10655",
    "authors": [
      "C. Erdogan",
      "T. Bode",
      "P. Junker"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2402.10659",
    "title": "Network Formation and Dynamics Among Multi-LLMs",
    "abstract": "Social networks influence behaviors, preferences, and relationships and play a crucial role in the dissemination of information and norms within human societies. As large language models (LLMs) increasingly integrate into social and professional environments, understanding their behavior within the context of social networks and interactions becomes essential. Our study analyzes the behaviors of standard network structures and real-world networks to determine whether the dynamics of multiple LLMs align with human social dynamics. We explore various social network principles, including micro-level concepts such as preferential attachment, triadic closure, and homophily, as well as macro-level concepts like community structure and the small-world phenomenon. Our findings suggest that LLMs demonstrate all these principles when they are provided with network structures and asked about their preferences regarding network formation. Furthermore, we investigate LLMs' decision-making based on real-world networks to compare the strengths of these principles. Our results reveal that triadic closure and homophily have a stronger influence than preferential attachment and that LLMs substantially exceed random guessing in the task of network formation predictions. Overall, our study contributes to the development of socially aware LLMs by shedding light on LLMs' network formation behaviors and exploring their impacts on social dynamics and norms. ",
    "url": "https://arxiv.org/abs/2402.10659",
    "authors": [
      "Marios Papachristou",
      "Yuan Yuan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2402.10665",
    "title": "Selective Prediction for Semantic Segmentation using Post-Hoc Confidence  Estimation and Its Performance under Distribution Shift",
    "abstract": "Semantic segmentation plays a crucial role in various computer vision applications, yet its efficacy is often hindered by the lack of high-quality labeled data. To address this challenge, a common strategy is to leverage models trained on data from different populations, such as publicly available datasets. This approach, however, leads to the distribution shift problem, presenting a reduced performance on the population of interest. In scenarios where model errors can have significant consequences, selective prediction methods offer a means to mitigate risks and reduce reliance on expert supervision. This paper investigates selective prediction for semantic segmentation in low-resource settings, thus focusing on post-hoc confidence estimators applied to pre-trained models operating under distribution shift. We propose a novel image-level confidence measure tailored for semantic segmentation and demonstrate its effectiveness through experiments on three medical imaging tasks. Our findings show that post-hoc confidence estimators offer a cost-effective approach to reducing the impacts of distribution shift. ",
    "url": "https://arxiv.org/abs/2402.10665",
    "authors": [
      "Bruno Laboissiere Camargos Borges",
      "Bruno Machado Pacheco",
      "Danilo Silva"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.10681",
    "title": "Physics-informed MeshGraphNets (PI-MGNs): Neural finite element solvers  for non-stationary and nonlinear simulations on arbitrary meshes",
    "abstract": "Engineering components must meet increasing technological demands in ever shorter development cycles. To face these challenges, a holistic approach is essential that allows for the concurrent development of part design, material system and manufacturing process. Current approaches employ numerical simulations, which however quickly becomes computation-intensive, especially for iterative optimization. Data-driven machine learning methods can be used to replace time- and resource-intensive numerical simulations. In particular, MeshGraphNets (MGNs) have shown promising results. They enable fast and accurate predictions on unseen mesh geometries while being fully differentiable for optimization. However, these models rely on large amounts of expensive training data, such as numerical simulations. Physics-informed neural networks (PINNs) offer an opportunity to train neural networks with partial differential equations instead of labeled data, but have not been extended yet to handle time-dependent simulations of arbitrary meshes. This work introduces PI-MGNs, a hybrid approach that combines PINNs and MGNs to quickly and accurately solve non-stationary and nonlinear partial differential equations (PDEs) on arbitrary meshes. The method is exemplified for thermal process simulations of unseen parts with inhomogeneous material distribution. Further results show that the model scales well to large and complex meshes, although it is trained on small generic meshes only. ",
    "url": "https://arxiv.org/abs/2402.10681",
    "authors": [
      "Tobias Würth",
      "Niklas Freymuth",
      "Clemens Zimmerling",
      "Gerhard Neumann",
      "Luise Kärger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2402.10701",
    "title": "Does Twinning Vehicular Networks Enhance Their Performance in Dense  Areas?",
    "abstract": "This paper investigates the potential of Digital Twins (DTs) to enhance network performance in densely populated urban areas, specifically focusing on vehicular networks. The study comprises two phases. In Phase I, we utilize traffic data and AI clustering to identify critical locations, particularly in crowded urban areas with high accident rates. In Phase II, we evaluate the advantages of twinning vehicular networks through three deployment scenarios: edge-based twin, cloud-based twin, and hybrid-based twin. Our analysis demonstrates that twinning significantly reduces network delays, with virtual twins outperforming physical networks. Virtual twins maintain low delays even with increased vehicle density, such as 15.05 seconds for 300 vehicles. Moreover, they exhibit faster computational speeds, with cloud-based twins being 1.7 times faster than edge twins in certain scenarios. These findings provide insights for efficient vehicular communication and underscore the potential of virtual twins in enhancing vehicular networks in crowded areas while emphasizing the importance of considering real-world factors when making deployment decisions. ",
    "url": "https://arxiv.org/abs/2402.10701",
    "authors": [
      "Sarah Al-Shareeda",
      "Sema F. Oktug",
      "Yusuf Yaslan",
      "Gokhan Yurdakul",
      "Berk Canberk"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10724",
    "title": "Machine Learning based Prediction of Ditching Loads",
    "abstract": "We present approaches to predict dynamic ditching loads on aircraft fuselages using machine learning. The employed learning procedure is structured into two parts, the reconstruction of the spatial loads using a convolutional autoencoder (CAE) and the transient evolution of these loads in a subsequent part. Different CAE strategies are assessed and combined with either long short-term memory (LSTM) networks or Koopman-operator based methods to predict the transient behaviour. The training data is compiled by an extension of the momentum method of von-Karman and Wagner and the rationale of the training approach is briefly summarised. The application included refers to a full-scale fuselage of a DLR-D150 aircraft for a range of horizontal and vertical approach velocities at 6{\\deg} incidence. Results indicate a satisfactory level of predictive agreement for all four investigated surrogate models examined, with the combination of an LSTM and a deep decoder CAE showing the best performance. ",
    "url": "https://arxiv.org/abs/2402.10724",
    "authors": [
      "Henning Schwarz",
      "Micha Überrück",
      "Jens-Peter M. Zemke",
      "Thomas Rung"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2402.10741",
    "title": "Identifying heterogeneous micromechanical properties of biological  tissues via physics-informed neural networks",
    "abstract": "The heterogeneous micromechanical properties of biological tissues have profound implications across diverse medical and engineering domains. However, identifying the full-field heterogeneous elastic properties of soft materials using traditional computational and engineering approaches is fundamentally challenging due to difficulties in estimating local stress fields. Recently, there has been a growing interest in using data-driven models to learn full-field mechanical responses such as displacement and strain from experimental or synthetic data. However, research studies on inferring the full-field elastic properties of materials, a more challenging problem, are scarce, particularly for large deformation, hyperelastic materials. Here, we propose a novel approach to identify the elastic modulus distribution in nonlinear, large deformation hyperelastic materials utilizing physics-informed neural networks (PINNs). We evaluate the prediction accuracies and computational efficiency of PINNs, informed by mechanic features and principles, across three synthetic materials with structural complexity that closely resemble real tissue patterns, such as brain tissue and tricuspid valve tissue. Our improved PINN architecture accurately estimates the full-field elastic properties, with relative errors of less than 5% across all examples. This research has significant potential for advancing our understanding of micromechanical behaviors in biological materials, impacting future innovations in engineering and medicine. ",
    "url": "https://arxiv.org/abs/2402.10741",
    "authors": [
      "Wensi Wu",
      "Mitchell Daneker",
      "Kevin T. Turner",
      "Matthew A. Jolley",
      "Lu Lu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2402.10743",
    "title": "Construction of a Syntactic Analysis Map for Yi Shui School through Text  Mining and Natural Language Processing Research",
    "abstract": "Entity and relationship extraction is a crucial component in natural language processing tasks such as knowledge graph construction, question answering system design, and semantic analysis. Most of the information of the Yishui school of traditional Chinese Medicine (TCM) is stored in the form of unstructured classical Chinese text. The key information extraction of TCM texts plays an important role in mining and studying the academic schools of TCM. In order to solve these problems efficiently using artificial intelligence methods, this study constructs a word segmentation and entity relationship extraction model based on conditional random fields under the framework of natural language processing technology to identify and extract the entity relationship of traditional Chinese medicine texts, and uses the common weighting technology of TF-IDF information retrieval and data mining to extract important key entity information in different ancient books. The dependency syntactic parser based on neural network is used to analyze the grammatical relationship between entities in each ancient book article, and it is represented as a tree structure visualization, which lays the foundation for the next construction of the knowledge graph of Yishui school and the use of artificial intelligence methods to carry out the research of TCM academic schools. ",
    "url": "https://arxiv.org/abs/2402.10743",
    "authors": [
      "Hanqing Zhao",
      "Yuehan Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.10747",
    "title": "Fully Differentiable Lagrangian Convolutional Neural Network for  Continuity-Consistent Physics-Informed Precipitation Nowcasting",
    "abstract": "This paper presents a convolutional neural network model for precipitation nowcasting that combines data-driven learning with physics-informed domain knowledge. We propose LUPIN, a Lagrangian Double U-Net for Physics-Informed Nowcasting, that draws from existing extrapolation-based nowcasting methods and implements the Lagrangian coordinate system transformation of the data in a fully differentiable and GPU-accelerated manner to allow for real-time end-to-end training and inference. Based on our evaluation, LUPIN matches and exceeds the performance of the chosen benchmark, opening the door for other Lagrangian machine learning models. ",
    "url": "https://arxiv.org/abs/2402.10747",
    "authors": [
      "Peter Pavlík",
      "Martin Výboh",
      "Anna Bou Ezzeddine",
      "Viera Rozinajová"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.10752",
    "title": "STF: Spatio-Temporal Fusion Module for Improving Video Object Detection",
    "abstract": "Consecutive frames in a video contain redundancy, but they may also contain relevant complementary information for the detection task. The objective of our work is to leverage this complementary information to improve detection. Therefore, we propose a spatio-temporal fusion framework (STF). We first introduce multi-frame and single-frame attention modules that allow a neural network to share feature maps between nearby frames to obtain more robust object representations. Second, we introduce a dual-frame fusion module that merges feature maps in a learnable manner to improve them. Our evaluation is conducted on three different benchmarks including video sequences of moving road users. The performed experiments demonstrate that the proposed spatio-temporal fusion module leads to improved detection performance compared to baseline object detectors. Code is available at https://github.com/noreenanwar/STF-module ",
    "url": "https://arxiv.org/abs/2402.10752",
    "authors": [
      "Noreen Anwar",
      "Guillaume-Alexandre Bilodeau",
      "Wassim Bouachir"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.10756",
    "title": "Towards Cohesion-Fairness Harmony: Contrastive Regularization in  Individual Fair Graph Clustering",
    "abstract": "Conventional fair graph clustering methods face two primary challenges: i) They prioritize balanced clusters at the expense of cluster cohesion by imposing rigid constraints, ii) Existing methods of both individual and group-level fairness in graph partitioning mostly rely on eigen decompositions and thus, generally lack interpretability. To address these issues, we propose iFairNMTF, an individual Fairness Nonnegative Matrix Tri-Factorization model with contrastive fairness regularization that achieves balanced and cohesive clusters. By introducing fairness regularization, our model allows for customizable accuracy-fairness trade-offs, thereby enhancing user autonomy without compromising the interpretability provided by nonnegative matrix tri-factorization. Experimental evaluations on real and synthetic datasets demonstrate the superior flexibility of iFairNMTF in achieving fairness and clustering performance. ",
    "url": "https://arxiv.org/abs/2402.10756",
    "authors": [
      "Siamak Ghodsi",
      "Seyed Amjad Seyedi",
      "Eirini Ntoutsi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Theory (cs.IT)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2402.10779",
    "title": "A Condensed Transition Graph Framework for Zero-shot Link Prediction  with Large Language Models",
    "abstract": "Zero-shot link prediction (ZSLP) on knowledge graphs aims at automatically identifying relations between given entities. Existing methods primarily employ auxiliary information to predict tail entity given head entity and its relation, yet face challenges due to the occasional unavailability of such detailed information and the inherent simplicity of predicting tail entities based on semantic similarities. Even though Large Language Models (LLMs) offer a promising solution to predict unobserved relations between the head and tail entity in a zero-shot manner, their performance is still restricted due to the inability to leverage all the (exponentially many) paths' information between two entities, which are critical in collectively indicating their relation types. To address this, in this work, we introduce a Condensed Transition Graph Framework for Zero-Shot Link Prediction (CTLP), which encodes all the paths' information in linear time complexity to predict unseen relations between entities, attaining both efficiency and information preservation. Specifically, we design a condensed transition graph encoder with theoretical guarantees on its coverage, expressiveness, and efficiency. It is learned by a transition graph contrastive learning strategy. Subsequently, we design a soft instruction tuning to learn and map the all-path embedding to the input of LLMs. Experimental results show that our proposed CTLP method achieves state-of-the-art performance on three standard ZSLP datasets ",
    "url": "https://arxiv.org/abs/2402.10779",
    "authors": [
      "Mingchen Li",
      "Chen Ling",
      "Rui Zhang",
      "Liang Zhao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.10783",
    "title": "On Permutation Selectors and their Applications in Ad-Hoc Radio Networks  Protocols",
    "abstract": "Selective families of sets, or selectors, are combinatorial tools used to \"isolate\" individual members of sets from some set family. Given a set $X$ and an element $x\\in X$, to isolate $x$ from $X$, at least one of the sets in the selector must intersect $X$ on exactly $x$. We study (k,N)-permutation selectors which have the property that they can isolate each element of each $k$-element subset of $\\{0,1,...,N-1\\}$ in each possible order. These selectors can be used in protocols for ad-hoc radio networks to more efficiently disseminate information along multiple hops. In 2004, Gasieniec, Radzik and Xin gave a construction of a (k,N)-permutation selector of size $O(k^2\\log^3 N)$. This paper improves this by providing a probabilistic construction of a (k,N)-permutation selector of size $O(k^2\\log N)$. Remarkably, this matches the asymptotic bound for standard strong (k,N)-selectors, that isolate each element of each set of size $k$, but with no restriction on the order. We then show that the use of our (k,N)-permutation selector improves the best running time for gossiping in ad-hoc radio networks by a poly-logarithmic factor. ",
    "url": "https://arxiv.org/abs/2402.10783",
    "authors": [
      "Jordan Kuschner",
      "Yugarshi Shashwat",
      "Sarthak Yadav",
      "Marek Chrobak"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2402.10793",
    "title": "Masked Attention is All You Need for Graphs",
    "abstract": "Graph neural networks (GNNs) and variations of the message passing algorithm are the predominant means for learning on graphs, largely due to their flexibility, speed, and satisfactory performance. The design of powerful and general purpose GNNs, however, requires significant research efforts and often relies on handcrafted, carefully-chosen message passing operators. Motivated by this, we propose a remarkably simple alternative for learning on graphs that relies exclusively on attention. Graphs are represented as node or edge sets and their connectivity is enforced by masking the attention weight matrix, effectively creating custom attention patterns for each graph. Despite its simplicity, masked attention for graphs (MAG) has state-of-the-art performance on long-range tasks and outperforms strong message passing baselines and much more involved attention-based methods on over 55 node and graph-level tasks. We also show significantly better transfer learning capabilities compared to GNNs and comparable or better time and memory scaling. MAG has sub-linear memory scaling in the number of nodes or edges, enabling learning on dense graphs and future-proofing the approach. ",
    "url": "https://arxiv.org/abs/2402.10793",
    "authors": [
      "David Buterez",
      "Jon Paul Janet",
      "Dino Oglic",
      "Pietro Lio"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10802",
    "title": "TimeSeriesBench: An Industrial-Grade Benchmark for Time Series Anomaly  Detection Models",
    "abstract": "Driven by the proliferation of real-world application scenarios and scales, time series anomaly detection (TSAD) has attracted considerable scholarly and industrial interest. However, existing algorithms exhibit a gap in terms of training paradigm, online detection paradigm, and evaluation criteria when compared to the actual needs of real-world industrial systems. Firstly, current algorithms typically train a specific model for each individual time series. In a large-scale online system with tens of thousands of curves, maintaining such a multitude of models is impractical. The performance of using merely one single unified model to detect anomalies remains unknown. Secondly, most TSAD models are trained on the historical part of a time series and are tested on its future segment. In distributed systems, however, there are frequent system deployments and upgrades, with new, previously unseen time series emerging daily. The performance of testing newly incoming unseen time series on current TSAD algorithms remains unknown. Lastly, although some papers have conducted detailed surveys, the absence of an online evaluation platform prevents answering questions like \"Who is the best at anomaly detection at the current stage?\" In this paper, we propose TimeSeriesBench, an industrial-grade benchmark that we continuously maintain as a leaderboard. On this leaderboard, we assess the performance of existing algorithms across more than 168 evaluation settings combining different training and testing paradigms, evaluation metrics and datasets. Through our comprehensive analysis of the results, we provide recommendations for the future design of anomaly detection algorithms. To address known issues with existing public datasets, we release an industrial dataset to the public together with TimeSeriesBench. All code, data, and the online leaderboard have been made publicly available. ",
    "url": "https://arxiv.org/abs/2402.10802",
    "authors": [
      "Haotian Si",
      "Changhua Pei",
      "Hang Cui",
      "Jingwen Yang",
      "Yongqian Sun",
      "Shenglin Zhang",
      "Jingjing Li",
      "Haiming Zhang",
      "Jing Han",
      "Dan Pei",
      "Jianhui Li",
      "Gaogang Xie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10806",
    "title": "Streaming Algorithms for Connectivity Augmentation",
    "abstract": "We study the $k$-connectivity augmentation problem ($k$-CAP) in the single-pass streaming model. Given a $(k-1)$-edge connected graph $G=(V,E)$ that is stored in memory, and a stream of weighted edges $L$ with weights in $\\{0,1,\\dots,W\\}$, the goal is to choose a minimum weight subset $L'\\subseteq L$ such that $G'=(V,E\\cup L')$ is $k$-edge connected. We give a $(2+\\epsilon)$-approximation algorithm for this problem which requires to store $O(\\epsilon^{-1} n\\log n)$ words. Moreover, we show our result is tight: Any algorithm with better than $2$-approximation for the problem requires $\\Omega(n^2)$ bits of space even when $k=2$. This establishes a gap between the optimal approximation factor one can obtain in the streaming vs the offline setting for $k$-CAP. We further consider a natural generalization to the fully streaming model where both $E$ and $L$ arrive in the stream in an arbitrary order. We show that this problem has a space lower bound that matches the best possible size of a spanner of the same approximation ratio. Following this, we give improved results for spanners on weighted graphs: We show a streaming algorithm that finds a $(2t-1+\\epsilon)$-approximate weighted spanner of size at most $O(\\epsilon^{-1} n^{1+1/t}\\log n)$ for integer $t$, whereas the best prior streaming algorithm for spanner on weighted graphs had size depending on $\\log W$. Using our spanner result, we provide an optimal $O(t)$-approximation for $k$-CAP in the fully streaming model with $O(nk + n^{1+1/t})$ words of space. Finally we apply our results to network design problems such as Steiner tree augmentation problem (STAP), $k$-edge connected spanning subgraph ($k$-ECSS), and the general Survivable Network Design problem (SNDP). In particular, we show a single-pass $O(t\\log k)$-approximation for SNDP using $O(kn^{1+1/t})$ words of space, where $k$ is the maximum connectivity requirement. ",
    "url": "https://arxiv.org/abs/2402.10806",
    "authors": [
      "Ce Jin",
      "Michael Kapralov",
      "Sepideh Mahabadi",
      "Ali Vakilian"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2402.10816",
    "title": "TernaryVote: Differentially Private, Communication Efficient, and  Byzantine Resilient Distributed Optimization on Heterogeneous Data",
    "abstract": "Distributed training of deep neural networks faces three critical challenges: privacy preservation, communication efficiency, and robustness to fault and adversarial behaviors. Although significant research efforts have been devoted to addressing these challenges independently, their synthesis remains less explored. In this paper, we propose TernaryVote, which combines a ternary compressor and the majority vote mechanism to realize differential privacy, gradient compression, and Byzantine resilience simultaneously. We theoretically quantify the privacy guarantee through the lens of the emerging f-differential privacy (DP) and the Byzantine resilience of the proposed algorithm. Particularly, in terms of privacy guarantees, compared to the existing sign-based approach StoSign, the proposed method improves the dimension dependence on the gradient size and enjoys privacy amplification by mini-batch sampling while ensuring a comparable convergence rate. We also prove that TernaryVote is robust when less than 50% of workers are blind attackers, which matches that of SIGNSGD with majority vote. Extensive experimental results validate the effectiveness of the proposed algorithm. ",
    "url": "https://arxiv.org/abs/2402.10816",
    "authors": [
      "Richeng Jin",
      "Yujie Gu",
      "Kai Yue",
      "Xiaofan He",
      "Zhaoyang Zhang",
      "Huaiyu Dai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.10822",
    "title": "QKDNetSim+: Improvement of the Quantum Network Simulator for NS-3",
    "abstract": "The first Quantum Key Distribution (QKD) networks are currently being deployed, but the implementation cost is still prohibitive for most researchers. As such, there is a need for realistic QKD network simulators. The \\textit{QKDNetSim} module for the network simulator NS-3 focuses on the representation of packets and the management of key material in a QKD network at the application layer. Although QKDNetSim's representation of a QKD network is insightful, some its components lack the depth that would allow the simulator to faithfully represent the behaviour of a real quantum network. In this work, we analyse QKDNetSim's architecture to identify its limitations, and we present an enhanced version of QKDNetSim in which some of its components have been modified to provide a more realistic simulation environment. ",
    "url": "https://arxiv.org/abs/2402.10822",
    "authors": [
      "David Soler",
      "Iván Cillero",
      "Carlos Dafonte",
      "Manuel Fernández-Veiga",
      "Ana Fernández-Vilas",
      "Francisco J. Nóvoa"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2402.10847",
    "title": "Enhancement-Driven Pretraining for Robust Fingerprint Representation  Learning",
    "abstract": "Fingerprint recognition stands as a pivotal component of biometric technology, with diverse applications from identity verification to advanced search tools. In this paper, we propose a unique method for deriving robust fingerprint representations by leveraging enhancement-based pre-training. Building on the achievements of U-Net-based fingerprint enhancement, our method employs a specialized encoder to derive representations from fingerprint images in a self-supervised manner. We further refine these representations, aiming to enhance the verification capabilities. Our experimental results, tested on publicly available fingerprint datasets, reveal a marked improvement in verification performance against established self-supervised training techniques. Our findings not only highlight the effectiveness of our method but also pave the way for potential advancements. Crucially, our research indicates that it is feasible to extract meaningful fingerprint representations from degraded images without relying on enhanced samples. ",
    "url": "https://arxiv.org/abs/2402.10847",
    "authors": [
      "Ekta Gavas",
      "Kaustubh Olpadkar",
      "Anoop Namboodiri"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.10853",
    "title": "Discovering and exploring cases of educational source code plagiarism  with Dolos",
    "abstract": "Source code plagiarism is a significant issue in educational practice, and educators need user-friendly tools to cope with such academic dishonesty. This article introduces the latest version of Dolos, a state-of-the-art ecosystem of tools for detecting and preventing plagiarism in educational source code. In this new version, the primary focus has been on enhancing the user experience. Educators can now run the entire plagiarism detection pipeline from a new web app in their browser, eliminating the need for any installation or configuration. Completely redesigned analytics dashboards provide an instant assessment of whether a collection of source files contains suspected cases of plagiarism and how widespread plagiarism is within the collection. The dashboards support hierarchically structured navigation to facilitate zooming in and out of suspect cases. Clusters are an essential new component of the dashboard design, reflecting the observation that plagiarism can occur among larger groups of students. To meet various user needs, the Dolos software stack for source code plagiarism detections now includes a web interface, a JSON application programming interface (API), a command line interface (CLI), a JavaScript library and a preconfigured Docker container. Clear documentation and a free-to-use instance of the web app can be found at https://dolos.ugent.be. The source code is also available on GitHub. ",
    "url": "https://arxiv.org/abs/2402.10853",
    "authors": [
      "Rien Maertens",
      "Maarten Van Neyghem",
      "Maxiem Geldhof",
      "Charlotte Van Petegem",
      "Niko Strijbol",
      "Peter Dawyndt",
      "Bart Mesuere"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2402.10861",
    "title": "Hypergraph Connectivity Augmentation in Strongly Polynomial Time",
    "abstract": "We consider hypergraph network design problems where the goal is to construct a hypergraph that satisfies certain connectivity requirements. For graph network design problems where the goal is to construct a graph that satisfies certain connectivity requirements, the number of edges in every feasible solution is at most quadratic in the number of vertices. In contrast, for hypergraph network design problems, we might have feasible solutions in which the number of hyperedges is exponential in the number of vertices. This presents an additional technical challenge in hypergraph network design problems compared to graph network design problems: in order to solve the problem in polynomial time, we first need to show that there exists a feasible solution in which the number of hyperedges is polynomial in the input size. The central theme of this work is to show that certain hypergraph network design problems admit solutions in which the number of hyperedges is polynomial in the number of vertices and moreover, can be solved in strongly polynomial time. Our work improves on the previous fastest pseudo-polynomial run-time for these problems. In addition, we develop strongly polynomial time algorithms that return near-uniform hypergraphs as solutions (i.e., every pair of hyperedges differ in size by at most one). As applications of our results, we derive the first strongly polynomial time algorithms for (i) degree-specified hypergraph connectivity augmentation using hyperedges, (ii) degree-specified hypergraph node-to-area connectivity augmentation using hyperedges, and (iii) degree-constrained mixed-hypergraph connectivity augmentation using hyperedges. ",
    "url": "https://arxiv.org/abs/2402.10861",
    "authors": [
      "Kristóf Bérczi",
      "Karthekeyan Chandrasekaran",
      "Tamás Király",
      "Shubhang Kulkarni"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2402.10862",
    "title": "Differential Private Federated Transfer Learning for Mental Health  Monitoring in Everyday Settings: A Case Study on Stress Detection",
    "abstract": "Mental health conditions, prevalent across various demographics, necessitate efficient monitoring to mitigate their adverse impacts on life quality. The surge in data-driven methodologies for mental health monitoring has underscored the importance of privacy-preserving techniques in handling sensitive health data. Despite strides in federated learning for mental health monitoring, existing approaches struggle with vulnerabilities to certain cyber-attacks and data insufficiency in real-world applications. In this paper, we introduce a differential private federated transfer learning framework for mental health monitoring to enhance data privacy and enrich data sufficiency. To accomplish this, we integrate federated learning with two pivotal elements: (1) differential privacy, achieved by introducing noise into the updates, and (2) transfer learning, employing a pre-trained universal model to adeptly address issues of data imbalance and insufficiency. We evaluate the framework by a case study on stress detection, employing a dataset of physiological and contextual data from a longitudinal study. Our finding show that the proposed approach can attain a 10% boost in accuracy and a 21% enhancement in recall, while ensuring privacy protection. ",
    "url": "https://arxiv.org/abs/2402.10862",
    "authors": [
      "Ziyu Wang",
      "Zhongqi Yang",
      "Iman Azimi",
      "Amir M. Rahmani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.10877",
    "title": "Robust agents learn causal world models",
    "abstract": "It has long been hypothesised that causal reasoning plays a fundamental role in robust and general intelligence. However, it is not known if agents must learn causal models in order to generalise to new domains, or if other inductive biases are sufficient. We answer this question, showing that any agent capable of satisfying a regret bound under a large set of distributional shifts must have learned an approximate causal model of the data generating process, which converges to the true causal model for optimal agents. We discuss the implications of this result for several research areas including transfer learning and causal inference. ",
    "url": "https://arxiv.org/abs/2402.10877",
    "authors": [
      "Jonathan Richens",
      "Tom Everitt"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10889",
    "title": "Evaluation of EAP Usage for Authenticating Eduroam Users in 5G Networks",
    "abstract": "The fifth generation of the telecommunication networks (5G) established the service-oriented paradigm on the mobile networks. In this new context, the 5G Core component has become extremely flexible so, in addition to serving mobile networks, it can also be used to connect devices from the so-called non-3GPP networks, which contains technologies such as WiFi. The implementation of this connectivity requires specific protocols to ensure authentication and reliability. Given these characteristics and the possibility of convergence, it is necessary to carefully choose the encryption algorithms and authentication methods used by non-3GPP user equipment. In light of the above, this paper highlights key findings resulting from an analysis on the subject conducted through a test environment which could be used in the context of the Eduroam federation. ",
    "url": "https://arxiv.org/abs/2402.10889",
    "authors": [
      "Leonardo Azalim de Oliveira",
      "Edelberto Franco Silva"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.10213",
    "title": "Clustering Inductive Biases with Unrolled Networks",
    "abstract": "The classical sparse coding (SC) model represents visual stimuli as a linear combination of a handful of learned basis functions that are Gabor-like when trained on natural image data. However, the Gabor-like filters learned by classical sparse coding far overpredict well-tuned simple cell receptive field profiles observed empirically. While neurons fire sparsely, neuronal populations are also organized in physical space by their sensitivity to certain features. In V1, this organization is a smooth progression of orientations along the cortical sheet. A number of subsequent models have either discarded the sparse dictionary learning framework entirely or whose updates have yet to take advantage of the surge in unrolled, neural dictionary learning architectures. A key missing theme of these updates is a stronger notion of \\emph{structured sparsity}. We propose an autoencoder architecture (WLSC) whose latent representations are implicitly, locally organized for spectral clustering through a Laplacian quadratic form of a bipartite graph, which generates a diverse set of artificial receptive fields that match primate data in V1 as faithfully as recent contrastive frameworks like Local Low Dimensionality, or LLD \\citep{lld} that discard sparse dictionary learning. By unifying sparse and smooth coding in models of the early visual cortex through our autoencoder, we also show that our regularization can be interpreted as early-stage specialization of receptive fields to certain classes of stimuli; that is, we induce a weak clustering bias for later stages of cortex where functional and spatial segregation (i.e. topography) are known to occur. The results show an imperative for \\emph{spatial regularization} of both the receptive fields and firing rates to begin to describe feature disentanglement in V1 and beyond. ",
    "url": "https://arxiv.org/abs/2402.10213",
    "authors": [
      "Jonathan Huml",
      "Abiy Tasissa",
      "Demba Ba"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10433",
    "title": "Fusing Neural and Physical: Augment Protein Conformation Sampling with  Tractable Simulations",
    "abstract": "The protein dynamics are common and important for their biological functions and properties, the study of which usually involves time-consuming molecular dynamics (MD) simulations in silico. Recently, generative models has been leveraged as a surrogate sampler to obtain conformation ensembles with orders of magnitude faster and without requiring any simulation data (a \"zero-shot\" inference). However, being agnostic of the underlying energy landscape, the accuracy of such generative model may still be limited. In this work, we explore the few-shot setting of such pre-trained generative sampler which incorporates MD simulations in a tractable manner. Specifically, given a target protein of interest, we first acquire some seeding conformations from the pre-trained sampler followed by a number of physical simulations in parallel starting from these seeding samples. Then we fine-tuned the generative model using the simulation trajectories above to become a target-specific sampler. Experimental results demonstrated the superior performance of such few-shot conformation sampler at a tractable computational cost. ",
    "url": "https://arxiv.org/abs/2402.10433",
    "authors": [
      "Jiarui Lu",
      "Zuobai Zhang",
      "Bozitao Zhong",
      "Chence Shi",
      "Jian Tang"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2402.10456",
    "title": "Generative Modeling for Tabular Data via Penalized Optimal Transport  Network",
    "abstract": "The task of precisely learning the probability distribution of rows within tabular data and producing authentic synthetic samples is both crucial and non-trivial. Wasserstein generative adversarial network (WGAN) marks a notable improvement in generative modeling, addressing the challenges faced by its predecessor, generative adversarial network. However, due to the mixed data types and multimodalities prevalent in tabular data, the delicate equilibrium between the generator and discriminator, as well as the inherent instability of Wasserstein distance in high dimensions, WGAN often fails to produce high-fidelity samples. To this end, we propose POTNet (Penalized Optimal Transport Network), a generative deep neural network based on a novel, robust, and interpretable marginally-penalized Wasserstein (MPW) loss. POTNet can effectively model tabular data containing both categorical and continuous features. Moreover, it offers the flexibility to condition on a subset of features. We provide theoretical justifications for the motivation behind the MPW loss. We also empirically demonstrate the effectiveness of our proposed method on four different benchmarks across a variety of real-world and simulated datasets. Our proposed model achieves orders of magnitude speedup during the sampling stage compared to state-of-the-art generative models for tabular data, thereby enabling efficient large-scale synthetic data generation. ",
    "url": "https://arxiv.org/abs/2402.10456",
    "authors": [
      "Wenhui Sophia Lu",
      "Chenyang Zhong",
      "Wing Hung Wong"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2402.10502",
    "title": "Late-time transition of $M_B$ inferred via neural networks",
    "abstract": "The strengthening of tensions in the cosmological parameters has led to a reconsideration of fundamental aspects of standard cosmology. The tension in the Hubble constant can also be viewed as a tension between local and early Universe constraints on the absolute magnitude $M_B$ of Type Ia supernova. In this work, we reconsider the possibility of a variation of this parameter in a model-independent way. We employ neural networks to agnostically constrain the value of the absolute magnitude as well as assess the impact and statistical significance of a variation in $M_B$ with redshift from the Pantheon+ compilation, together with a thorough analysis of the neural network architecture. We find an indication for a transition redshift at the $z\\approx 1$ region. ",
    "url": "https://arxiv.org/abs/2402.10502",
    "authors": [
      "Purba Mukherjee",
      "Konstantinos F. Dialektopoulos",
      "Jackson Levi Said",
      "Jurgen Mifsud"
    ],
    "subjectives": [
      "Cosmology and Nongalactic Astrophysics (astro-ph.CO)",
      "Machine Learning (cs.LG)",
      "General Relativity and Quantum Cosmology (gr-qc)"
    ]
  },
  {
    "id": "arXiv:2402.10678",
    "title": "Covering a Graph with Minimal Local Sets",
    "abstract": "Local sets, a graph structure invariant under local complementation, have been originally introduced in the context of quantum computing for the study of quantum entanglement within the so-called graph state formalism. A local set in a graph is made of a non-empty set of vertices together with its odd neighborhood. We show that any graph can be covered by minimal local sets, i.e. that every vertex is contained in at least one local set that is minimal by inclusion. More precisely, we introduce an algorithm for finding a minimal local set cover in polynomial time. This result is proved by exploring the link between local sets and cut-rank. We prove some additional results on minimal local sets: we give tight bounds on their size, and we show that there can be exponentially many of them in a graph. Finally, we provide an extension of our definitions and our main result to $q$-multigraphs, the graphical counterpart of quantum qudit graph states. ",
    "url": "https://arxiv.org/abs/2402.10678",
    "authors": [
      "Nathan Claudet",
      "Simon Perdrix"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2402.10728",
    "title": "Semi-weakly-supervised neural network training for medical image  registration",
    "abstract": "For training registration networks, weak supervision from segmented corresponding regions-of-interest (ROIs) have been proven effective for (a) supplementing unsupervised methods, and (b) being used independently in registration tasks in which unsupervised losses are unavailable or ineffective. This correspondence-informing supervision entails cost in annotation that requires significant specialised effort. This paper describes a semi-weakly-supervised registration pipeline that improves the model performance, when only a small corresponding-ROI-labelled dataset is available, by exploiting unlabelled image pairs. We examine two types of augmentation methods by perturbation on network weights and image resampling, such that consistency-based unsupervised losses can be applied on unlabelled data. The novel WarpDDF and RegCut approaches are proposed to allow commutative perturbation between an image pair and the predicted spatial transformation (i.e. respective input and output of registration networks), distinct from existing perturbation methods for classification or segmentation. Experiments using 589 male pelvic MR images, labelled with eight anatomical ROIs, show the improvement in registration performance and the ablated contributions from the individual strategies. Furthermore, this study attempts to construct one of the first computational atlases for pelvic structures, enabled by registering inter-subject MRs, and quantifies the significant differences due to the proposed semi-weak supervision with a discussion on the potential clinical use of example atlas-derived statistics. ",
    "url": "https://arxiv.org/abs/2402.10728",
    "authors": [
      "Yiwen Li",
      "Yunguan Fu",
      "Iani J.M.B. Gayo",
      "Qianye Yang",
      "Zhe Min",
      "Shaheer U. Saeed",
      "Wen Yan",
      "Yipei Wang",
      "J. Alison Noble",
      "Mark Emberton",
      "Matthew J. Clarkson",
      "Dean C. Barratt",
      "Victor A. Prisacariu",
      "Yipeng Hu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.10760",
    "title": "RAGIC: Risk-Aware Generative Adversarial Model for Stock Interval  Construction",
    "abstract": "Efforts to predict stock market outcomes have yielded limited success due to the inherently stochastic nature of the market, influenced by numerous unpredictable factors. Many existing prediction approaches focus on single-point predictions, lacking the depth needed for effective decision-making and often overlooking market risk. To bridge this gap, we propose a novel model, RAGIC, which introduces sequence generation for stock interval prediction to quantify uncertainty more effectively. Our approach leverages a Generative Adversarial Network (GAN) to produce future price sequences infused with randomness inherent in financial markets. RAGIC's generator includes a risk module, capturing the risk perception of informed investors, and a temporal module, accounting for historical price trends and seasonality. This multi-faceted generator informs the creation of risk-sensitive intervals through statistical inference, incorporating horizon-wise insights. The interval's width is carefully adjusted to reflect market volatility. Importantly, our approach relies solely on publicly available data and incurs only low computational overhead. RAGIC's evaluation across globally recognized broad-based indices demonstrates its balanced performance, offering both accuracy and informativeness. Achieving a consistent 95% coverage, RAGIC maintains a narrow interval width. This promising outcome suggests that our approach effectively addresses the challenges of stock market prediction while incorporating vital risk considerations. ",
    "url": "https://arxiv.org/abs/2402.10760",
    "authors": [
      "Jingyi Gu",
      "Wenlu Du",
      "Guiling Wang"
    ],
    "subjectives": [
      "Statistical Finance (q-fin.ST)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10776",
    "title": "In-Vivo Hyperspectral Human Brain Image Database for Brain Cancer  Detection",
    "abstract": "The use of hyperspectral imaging for medical applications is becoming more common in recent years. One of the main obstacles that researchers find when developing hyperspectral algorithms for medical applications is the lack of specific, publicly available, and hyperspectral medical data. The work described in this paper was developed within the framework of the European project HELICoiD (HypErspectraL Imaging Cancer Detection), which had as a main goal the application of hyperspectral imaging to the delineation of brain tumors in real-time during neurosurgical operations. In this paper, the methodology followed to generate the first hyperspectral database of in-vivo human brain tissues is presented. Data was acquired employing a customized hyperspectral acquisition system capable of capturing information in the Visual and Near InfraRed (VNIR) range from 400 to 1000 nm. Repeatability was assessed for the cases where two images of the same scene were captured consecutively. The analysis reveals that the system works more efficiently in the spectral range between 450 and 900 nm. A total of 36 hyperspectral images from 22 different patients were obtained. From these data, more than 300 000 spectral signatures were labeled employing a semi-automatic methodology based on the spectral angle mapper algorithm. Four different classes were defined: normal tissue, tumor tissue, blood vessel, and background elements. All the hyperspectral data has been made available in a public repository. ",
    "url": "https://arxiv.org/abs/2402.10776",
    "authors": [
      "H. Fabelo",
      "S. Ortega",
      "A. Szolna",
      "D. Bulters",
      "J.F. Pineiro",
      "S. Kabwama",
      "A. Shanahan",
      "H. Bulstrode",
      "S. Bisshopp",
      "B.R. Kiran",
      "D. Ravi",
      "R. Lazcano",
      "D. Madronal",
      "C. Sosa",
      "C. Espino",
      "M. Marquez",
      "M. De la Luz Plaza",
      "R. Camacho",
      "D. Carrera",
      "M. Hernandez",
      "G.M. Callico",
      "J. Morera",
      "B. Stanciulescu",
      "G.Z. Yang",
      "R. Salvador",
      "E. Juarez",
      "C. Sanz",
      "R. Sarmiento"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.09254",
    "title": "How networks shape diversity for better or worse",
    "abstract": " Comments: 16 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2201.09254",
    "authors": [
      "Andrea Musso",
      "Dirk Helbing"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2202.06095",
    "title": "A Review of Deep Learning-based Approaches for Deepfake Content  Detection",
    "abstract": " Title: A Review of Deep Learning-based Approaches for Deepfake Content  Detection ",
    "url": "https://arxiv.org/abs/2202.06095",
    "authors": [
      "Leandro A. Passos",
      "Danilo Jodas",
      "Kelton A. P. da Costa",
      "Luis A. Souza Júnior",
      "Douglas Rodrigues",
      "Javier Del Ser",
      "David Camacho",
      "João Paulo Papa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.00594",
    "title": "Sparse graphs with bounded induced cycle packing number have logarithmic  treewidth",
    "abstract": " Comments: 30 pages, 6 figures. v5: revised version ",
    "url": "https://arxiv.org/abs/2206.00594",
    "authors": [
      "Marthe Bonamy",
      "Édouard Bonnet",
      "Hugues Déprés",
      "Louis Esperet",
      "Colin Geniet",
      "Claire Hilaire",
      "Stéphan Thomassé",
      "Alexandra Wesolek"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2206.12532",
    "title": "Causal Scoring: A Framework for Effect Estimation, Effect Ordering, and  Effect Classification",
    "abstract": " Title: Causal Scoring: A Framework for Effect Estimation, Effect Ordering, and  Effect Classification ",
    "url": "https://arxiv.org/abs/2206.12532",
    "authors": [
      "Carlos Fernández-Loría",
      "Jorge Loría"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13508",
    "title": "Data Augmentation techniques in time series domain: A survey and  taxonomy",
    "abstract": " Comments: 33 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2206.13508",
    "authors": [
      "Guillermo Iglesias",
      "Edgar Talavera",
      "Ángel González-Prieto",
      "Alberto Mozo",
      "Sandra Gómez-Canaval"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.09031",
    "title": "Decorrelative Network Architecture for Robust Electrocardiogram  Classification",
    "abstract": " Comments: 24 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2207.09031",
    "authors": [
      "Christopher Wiedeman",
      "Ge Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.03295",
    "title": "MogaNet: Multi-order Gated Aggregation Network",
    "abstract": " Comments: ICLR 2024 Camera Ready. Preprint V3 (19 pages + 16 pages). Implementations refer to this https URL ",
    "url": "https://arxiv.org/abs/2211.03295",
    "authors": [
      "Siyuan Li",
      "Zedong Wang",
      "Zicheng Liu",
      "Cheng Tan",
      "Haitao Lin",
      "Di Wu",
      "Zhiyuan Chen",
      "Jiangbin Zheng",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.14424",
    "title": "Normalizing flow neural networks by JKO scheme",
    "abstract": " Comments: NeurIPS 2023 spotlight ",
    "url": "https://arxiv.org/abs/2212.14424",
    "authors": [
      "Chen Xu",
      "Xiuyuan Cheng",
      "Yao Xie"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.05352",
    "title": "Concentration in Gossip Opinion Dynamics over Random Graphs",
    "abstract": " Title: Concentration in Gossip Opinion Dynamics over Random Graphs ",
    "url": "https://arxiv.org/abs/2301.05352",
    "authors": [
      "Yu Xing",
      "Karl Henrik Johansson"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2303.15103",
    "title": "Contrastive Learning Is Spectral Clustering On Similarity Graph",
    "abstract": " Comments: ICLR 2024; We express our gratitude to the anonymous reviewers for their valuable feedback ",
    "url": "https://arxiv.org/abs/2303.15103",
    "authors": [
      "Yifan Zhang",
      "Zhiquan Tan",
      "Jingqin Yang",
      "Yang Yuan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05099",
    "title": "Feudal Graph Reinforcement Learning",
    "abstract": " Title: Feudal Graph Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2304.05099",
    "authors": [
      "Tommaso Marzi",
      "Arshjot Khehra",
      "Andrea Cini",
      "Cesare Alippi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.07724",
    "title": "MS-LSTM: Exploring Spatiotemporal Multiscale Representations in Video  Prediction Domain",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2206.03010 ",
    "url": "https://arxiv.org/abs/2304.07724",
    "authors": [
      "Zhifeng Ma",
      "Hao Zhang",
      "Jie Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.01713",
    "title": "Learning Disentangled Semantic Spaces of Explanations via Invertible  Neural Networks",
    "abstract": " Title: Learning Disentangled Semantic Spaces of Explanations via Invertible  Neural Networks ",
    "url": "https://arxiv.org/abs/2305.01713",
    "authors": [
      "Yingji Zhang",
      "Danilo S. Carvalho",
      "André Freitas"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.10544",
    "title": "Tractable Probabilistic Graph Representation Learning with Graph-Induced  Sum-Product Networks",
    "abstract": " Comments: The 12th International Conference on Learning Representations (ICLR 2024) ",
    "url": "https://arxiv.org/abs/2305.10544",
    "authors": [
      "Federico Errica",
      "Mathias Niepert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.12095",
    "title": "CARD: Channel Aligned Robust Blend Transformer for Time Series  Forecasting",
    "abstract": " Comments: ICLR 2024 ",
    "url": "https://arxiv.org/abs/2305.12095",
    "authors": [
      "Wang Xue",
      "Tian Zhou",
      "Qingsong Wen",
      "Jinyang Gao",
      "Bolin Ding",
      "Rong Jin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.14448",
    "title": "Robust non-computability and stability of dynamical systems",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2109.15080 ",
    "url": "https://arxiv.org/abs/2305.14448",
    "authors": [
      "Daniel S. Graça",
      "Ning Zhong"
    ],
    "subjectives": [
      "Logic (math.LO)",
      "Logic in Computer Science (cs.LO)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2305.17342",
    "title": "Rethinking Adversarial Policies: A Generalized Attack Formulation and  Provable Defense in RL",
    "abstract": " Comments: International Conference on Learning Representations (ICLR) 2024, spotlight ",
    "url": "https://arxiv.org/abs/2305.17342",
    "authors": [
      "Xiangyu Liu",
      "Souradip Chakraborty",
      "Yanchao Sun",
      "Furong Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.15585",
    "title": "Optimizing Credit Limit Adjustments Under Adversarial Goals Using  Reinforcement Learning",
    "abstract": " Comments: 29 pages, 16 figures ",
    "url": "https://arxiv.org/abs/2306.15585",
    "authors": [
      "Sherly Alfonso-Sánchez",
      "Jesús Solano",
      "Alejandro Correa-Bahnsen",
      "Kristina P. Sendova",
      "Cristián Bravo"
    ],
    "subjectives": [
      "General Finance (q-fin.GN)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.07881",
    "title": "Graph Embedded Intuitionistic Fuzzy Random Vector Functional Link Neural  Network for Class Imbalance Learning",
    "abstract": " Comments: IEEE Transactions on Neural Networks and Learning Systems ",
    "url": "https://arxiv.org/abs/2307.07881",
    "authors": [
      "M.A. Ganaie",
      "M. Sajid",
      "A.K. Malik",
      "M. Tanveer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.12563",
    "title": "Multivariate Time-Series Anomaly Detection with Contaminated Data",
    "abstract": " Comments: 9 pages, 4 tables, 4 figures ",
    "url": "https://arxiv.org/abs/2308.12563",
    "authors": [
      "Thi Kieu Khanh Ho",
      "Narges Armanfard"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2309.13144",
    "title": "SoRTS: Learned Tree Search for Long Horizon Social Robot Navigation",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2304.01428 ",
    "url": "https://arxiv.org/abs/2309.13144",
    "authors": [
      "Ingrid Navarro",
      "Jay Patrikar",
      "Joao P. A. Dantas",
      "Rohan Baijal",
      "Ian Higgins",
      "Sebastian Scherer",
      "Jean Oh"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.05212",
    "title": "Interpretable Semiotics Networks Representing Awareness",
    "abstract": " Title: Interpretable Semiotics Networks Representing Awareness ",
    "url": "https://arxiv.org/abs/2310.05212",
    "authors": [
      "David Kupeev",
      "Eyal Nitcany"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2310.06549",
    "title": "Be Careful What You Smooth For: Label Smoothing Can Be a Privacy Shield  but Also a Catalyst for Model Inversion Attacks",
    "abstract": " Comments: Published as a conference paper at ICLR 2024 ",
    "url": "https://arxiv.org/abs/2310.06549",
    "authors": [
      "Lukas Struppek",
      "Dominik Hintersdorf",
      "Kristian Kersting"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.15072",
    "title": "RD-VIO: Robust Visual-Inertial Odometry for Mobile Augmented Reality in  Dynamic Environments",
    "abstract": " Title: RD-VIO: Robust Visual-Inertial Odometry for Mobile Augmented Reality in  Dynamic Environments ",
    "url": "https://arxiv.org/abs/2310.15072",
    "authors": [
      "Jinyu Li",
      "Xiaokun Pan",
      "Gan Huang",
      "Ziyang Zhang",
      "Nan Wang",
      "Hujun Bao",
      "Guofeng Zhang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.18884",
    "title": "Simple and Asymmetric Graph Contrastive Learning without Augmentations",
    "abstract": " Comments: NeurIPS 2023 Main Track ",
    "url": "https://arxiv.org/abs/2310.18884",
    "authors": [
      "Teng Xiao",
      "Huaisheng Zhu",
      "Zhengyu Chen",
      "Suhang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.20329",
    "title": "InstructCoder: Empowering Language Models for Code Editing",
    "abstract": " Title: InstructCoder: Empowering Language Models for Code Editing ",
    "url": "https://arxiv.org/abs/2310.20329",
    "authors": [
      "Kaixin Li",
      "Qisheng Hu",
      "Xu Zhao",
      "Hui Chen",
      "Yuxi Xie",
      "Tiedong Liu",
      "Qizhe Xie",
      "Junxian He"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2311.09618",
    "title": "Simulating Opinion Dynamics with Networks of LLM-based Agents",
    "abstract": " Title: Simulating Opinion Dynamics with Networks of LLM-based Agents ",
    "url": "https://arxiv.org/abs/2311.09618",
    "authors": [
      "Yun-Shiuan Chuang",
      "Agam Goyal",
      "Nikunj Harlalka",
      "Siddharth Suresh",
      "Robert Hawkins",
      "Sijia Yang",
      "Dhavan Shah",
      "Junjie Hu",
      "Timothy T. Rogers"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.11229",
    "title": "Causal ATE Mitigates Unintended Bias in Controlled Text Generation",
    "abstract": " Comments: 12 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2311.11229",
    "authors": [
      "Rahul Madhavan",
      "Kahini Wadhawan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2312.05780",
    "title": "PULSAR: Graph based Positive Unlabeled Learning with Multi Stream  Adaptive Convolutions for Parkinson's Disease Recognition",
    "abstract": " Title: PULSAR: Graph based Positive Unlabeled Learning with Multi Stream  Adaptive Convolutions for Parkinson's Disease Recognition ",
    "url": "https://arxiv.org/abs/2312.05780",
    "authors": [
      "Md. Zarif Ul Alam",
      "Md Saiful Islam",
      "Ehsan Hoque",
      "M Saifur Rahman"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.09715",
    "title": "CETN: Contrast-enhanced Through Network for CTR Prediction",
    "abstract": " Title: CETN: Contrast-enhanced Through Network for CTR Prediction ",
    "url": "https://arxiv.org/abs/2312.09715",
    "authors": [
      "Honghao Li",
      "Lei Sang",
      "Yi Zhang",
      "Xuyun Zhang",
      "Yiwen Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2312.11539",
    "title": "KGLens: A Parameterized Knowledge Graph Solution to Assess What an LLM  Does and Doesn't Know",
    "abstract": " Title: KGLens: A Parameterized Knowledge Graph Solution to Assess What an LLM  Does and Doesn't Know ",
    "url": "https://arxiv.org/abs/2312.11539",
    "authors": [
      "Shangshang Zheng",
      "He Bai",
      "Yizhe Zhang",
      "Yi Su",
      "Xiaochuan Niu",
      "Navdeep Jaitly"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.13839",
    "title": "Q-SENN: Quantized Self-Explaining Neural Networks",
    "abstract": " Comments: Accepted to AAAI 2024, SRRAI ",
    "url": "https://arxiv.org/abs/2312.13839",
    "authors": [
      "Thomas Norrenbrock",
      "Marco Rudolph",
      "Bodo Rosenhahn"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.00685",
    "title": "Communication-Efficient Federated Learning for LEO Satellite Networks  Integrated with HAPs Using Hybrid NOMA-OFDM",
    "abstract": " Title: Communication-Efficient Federated Learning for LEO Satellite Networks  Integrated with HAPs Using Hybrid NOMA-OFDM ",
    "url": "https://arxiv.org/abs/2401.00685",
    "authors": [
      "Mohamed Elmahallawy",
      "Tie Luo",
      "Khaled Ramadan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2401.02897",
    "title": "Robust Bichromatic Classification using Two Lines",
    "abstract": " Comments: 19 pages, 11 figures. Updated to include new results ",
    "url": "https://arxiv.org/abs/2401.02897",
    "authors": [
      "Erwin Glazenburg",
      "Thijs van der Horst",
      "Tom Peters",
      "Bettina Speckmann",
      "Frank Staals"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2401.05949",
    "title": "Universal Vulnerabilities in Large Language Models: Backdoor Attacks for  In-context Learning",
    "abstract": " Title: Universal Vulnerabilities in Large Language Models: Backdoor Attacks for  In-context Learning ",
    "url": "https://arxiv.org/abs/2401.05949",
    "authors": [
      "Shuai Zhao",
      "Meihuizi Jia",
      "Luu Anh Tuan",
      "Fengjun Pan",
      "Jinming Wen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.08190",
    "title": "MARIO: MAth Reasoning with code Interpreter Output -- A Reproducible  Pipeline",
    "abstract": " Comments: Work in progress ",
    "url": "https://arxiv.org/abs/2401.08190",
    "authors": [
      "Minpeng Liao",
      "Wei Luo",
      "Chengxi Li",
      "Jing Wu",
      "Kai Fan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.08903",
    "title": "PPR: Enhancing Dodging Attacks while Maintaining Impersonation Attacks  on Face Recognition Systems",
    "abstract": " Title: PPR: Enhancing Dodging Attacks while Maintaining Impersonation Attacks  on Face Recognition Systems ",
    "url": "https://arxiv.org/abs/2401.08903",
    "authors": [
      "Fengfan Zhou",
      "Heifei Ling",
      "Bangjie Yin",
      "Hui Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.12192",
    "title": "Text Embedding Inversion Security for Multilingual Language Models",
    "abstract": " Comments: 18 pages, 17 Tables, 6 Figures ",
    "url": "https://arxiv.org/abs/2401.12192",
    "authors": [
      "Yiyi Chen",
      "Heather Lent",
      "Johannes Bjerva"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.12956",
    "title": "Examining the Role of Peer Acknowledgements on Social Annotations:  Unraveling the Psychological Underpinnings",
    "abstract": " Title: Examining the Role of Peer Acknowledgements on Social Annotations:  Unraveling the Psychological Underpinnings ",
    "url": "https://arxiv.org/abs/2401.12956",
    "authors": [
      "Xiaoshan Huang",
      "Haolun Wu",
      "Xue Liu",
      "Susanne Lajoie"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2401.13200",
    "title": "Topology-aware Embedding Memory for Continual Learning on Expanding  Networks",
    "abstract": " Title: Topology-aware Embedding Memory for Continual Learning on Expanding  Networks ",
    "url": "https://arxiv.org/abs/2401.13200",
    "authors": [
      "Xikun Zhang",
      "Dongjin Song",
      "Yixin Chen",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.13964",
    "title": "An Extensible Framework for Open Heterogeneous Collaborative Perception",
    "abstract": " Comments: Accepted by ICLR 2024. The code and data are open-sourced at this https URL ",
    "url": "https://arxiv.org/abs/2401.13964",
    "authors": [
      "Yifan Lu",
      "Yue Hu",
      "Yiqi Zhong",
      "Dequan Wang",
      "Siheng Chen",
      "Yanfeng Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.16240",
    "title": "Combining Hierachical VAEs with LLMs for clinically meaningful timeline  summarisation in social media",
    "abstract": " Title: Combining Hierachical VAEs with LLMs for clinically meaningful timeline  summarisation in social media ",
    "url": "https://arxiv.org/abs/2401.16240",
    "authors": [
      "Jiayu Song",
      "Jenny Chim",
      "Adam Tsakalidis",
      "Julia Ive",
      "Dana Atzil-Slonim",
      "Maria Liakata"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.17167",
    "title": "Planning, Creation, Usage: Benchmarking LLMs for Comprehensive Tool  Utilization in Real-World Complex Scenarios",
    "abstract": " Title: Planning, Creation, Usage: Benchmarking LLMs for Comprehensive Tool  Utilization in Real-World Complex Scenarios ",
    "url": "https://arxiv.org/abs/2401.17167",
    "authors": [
      "Shijue Huang",
      "Wanjun Zhong",
      "Jianqiao Lu",
      "Qi Zhu",
      "Jiahui Gao",
      "Weiwen Liu",
      "Yutai Hou",
      "Xingshan Zeng",
      "Yasheng Wang",
      "Lifeng Shang",
      "Xin Jiang",
      "Ruifeng Xu",
      "Qun Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.00418",
    "title": "Benchmarking Transferable Adversarial Attacks",
    "abstract": " Comments: Accepted by NDSS 2024 Workshop ",
    "url": "https://arxiv.org/abs/2402.00418",
    "authors": [
      "Zhibo Jin",
      "Jiayu Zhang",
      "Zhiyu Zhu",
      "Huaming Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.00570",
    "title": "CADICA: a new dataset for coronary artery disease detection by using  invasive coronary angiography",
    "abstract": " Title: CADICA: a new dataset for coronary artery disease detection by using  invasive coronary angiography ",
    "url": "https://arxiv.org/abs/2402.00570",
    "authors": [
      "Ariadna Jiménez-Partinen",
      "Miguel A. Molina-Cabello",
      "Karl Thurnhofer-Hemsi",
      "Esteban J. Palomo",
      "Jorge Rodríguez-Capitán",
      "Ana I. Molina-Ramos",
      "Manuel Jiménez-Navarro"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.00626",
    "title": "Vision-LLMs Can Fool Themselves with Self-Generated Typographic Attacks",
    "abstract": " Title: Vision-LLMs Can Fool Themselves with Self-Generated Typographic Attacks ",
    "url": "https://arxiv.org/abs/2402.00626",
    "authors": [
      "Maan Qraitem",
      "Nazia Tasnim",
      "Piotr Teterwak",
      "Kate Saenko",
      "Bryan A. Plummer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.01681",
    "title": "Emojis Decoded: Leveraging ChatGPT for Enhanced Understanding in Social  Media Communications",
    "abstract": " Comments: 12 pages, 2 page appendix ",
    "url": "https://arxiv.org/abs/2402.01681",
    "authors": [
      "Yuhang Zhou",
      "Paiheng Xu",
      "Xiyao Wang",
      "Xuan Lu",
      "Ge Gao",
      "Wei Ai"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.03190",
    "title": "Unified Hallucination Detection for Multimodal Large Language Models",
    "abstract": " Comments: Work in progress ",
    "url": "https://arxiv.org/abs/2402.03190",
    "authors": [
      "Xiang Chen",
      "Chenxi Wang",
      "Yida Xue",
      "Ningyu Zhang",
      "Xiaoyan Yang",
      "Qiang Li",
      "Yue Shen",
      "Lei Liang",
      "Jinjie Gu",
      "Huajun Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2402.03522",
    "title": "Influencer Identification on Link Predicted Graphs",
    "abstract": " Comments: 19 pages + appendix. V2 has additional information on how our model differs from existing algorithms ",
    "url": "https://arxiv.org/abs/2402.03522",
    "authors": [
      "Laura P. Schaposnik",
      "Raina Wu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2402.03703",
    "title": "Hierarchical Large Language Models in Cloud Edge End Architecture for  Heterogeneous Robot Cluster Control",
    "abstract": " Title: Hierarchical Large Language Models in Cloud Edge End Architecture for  Heterogeneous Robot Cluster Control ",
    "url": "https://arxiv.org/abs/2402.03703",
    "authors": [
      "Zhirong Luan",
      "Yujun Lai",
      "Rundong Huang",
      "Yan Yan",
      "Jingwei Wang",
      "Jizhou Lu",
      "Badong Chen"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2402.04534",
    "title": "M2fNet: Multi-modal Forest Monitoring Network on Large-scale Virtual  Dataset",
    "abstract": " Comments: 5 pages ",
    "url": "https://arxiv.org/abs/2402.04534",
    "authors": [
      "Yawen Lu",
      "Yunhan Huang",
      "Su Sun",
      "Tansi Zhang",
      "Xuewen Zhang",
      "Songlin Fei",
      "Yingjie Chen"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2402.05973",
    "title": "Blockchain-enabled Clustered and Scalable Federated Learning (BCS-FL)  Framework in UAV Networks",
    "abstract": " Comments: 6 pages, 7 figures, 2023 IEEE International Workshop on Computer Aided Modeling and Design of Communication Links and Networks (IEEE CAMAD), Edinburgh UK ",
    "url": "https://arxiv.org/abs/2402.05973",
    "authors": [
      "Sana Hafeez",
      "Lina Mohjazi",
      "Muhammad Ali Imran",
      "Yao Sun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.06764",
    "title": "GLaM: Fine-Tuning Large Language Models for Domain Knowledge Graph  Alignment via Neighborhood Partitioning and Generative Subgraph Encoding",
    "abstract": " Comments: To be published in AAAI Spring Symposium: AAAI-MAKE 2024 ",
    "url": "https://arxiv.org/abs/2402.06764",
    "authors": [
      "Stefan Dernbach",
      "Khushbu Agarwal",
      "Alejandro Zuniga",
      "Michael Henry",
      "Sutanay Choudhury"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.07338",
    "title": "Exploring Saliency Bias in Manipulation Detection",
    "abstract": " Title: Exploring Saliency Bias in Manipulation Detection ",
    "url": "https://arxiv.org/abs/2402.07338",
    "authors": [
      "Joshua Krinsky",
      "Alan Bettis",
      "Qiuyu Tang",
      "Daniel Moreira",
      "Aparna Bharati"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.07637",
    "title": "Compressive Recovery of Signals Defined on Perturbed Graphs",
    "abstract": " Comments: 18 pages, 15 figures. v2: Minor correction in ref [32] ",
    "url": "https://arxiv.org/abs/2402.07637",
    "authors": [
      "Sabyasachi Ghosh",
      "Ajit Rajwade"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2402.08225",
    "title": "Improving Black-box Robustness with In-Context Rewriting",
    "abstract": " Title: Improving Black-box Robustness with In-Context Rewriting ",
    "url": "https://arxiv.org/abs/2402.08225",
    "authors": [
      "Kyle O'Brien",
      "Nathan Ng",
      "Isha Puri",
      "Jorge Mendez",
      "Hamid Palangi",
      "Yoon Kim",
      "Marzyeh Ghassemi",
      "Thomas Hartvigsen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.08277",
    "title": "Towards Faithful and Robust LLM Specialists for Evidence-Based  Question-Answering",
    "abstract": " Title: Towards Faithful and Robust LLM Specialists for Evidence-Based  Question-Answering ",
    "url": "https://arxiv.org/abs/2402.08277",
    "authors": [
      "Tobias Schimanski",
      "Jingwei Ni",
      "Mathias Kraus",
      "Elliott Ash",
      "Markus Leippold"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.09091",
    "title": "Play Guessing Game with LLM: Indirect Jailbreak Attack with Implicit  Clues",
    "abstract": " Comments: 13 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2402.09091",
    "authors": [
      "Zhiyuan Chang",
      "Mingyang Li",
      "Yi Liu",
      "Junjie Wang",
      "Qing Wang",
      "Yang Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2402.09631",
    "title": "MiMiC: Minimally Modified Counterfactuals in the Representation Space",
    "abstract": " Comments: Preprint ",
    "url": "https://arxiv.org/abs/2402.09631",
    "authors": [
      "Shashwat Singh",
      "Shauli Ravfogel",
      "Jonathan Herzig",
      "Roee Aharoni",
      "Ryan Cotterell",
      "Ponnurangam Kumaraguru"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2402.09664",
    "title": "CodeMind: A Framework to Challenge Large Language Models for Code  Reasoning",
    "abstract": " Title: CodeMind: A Framework to Challenge Large Language Models for Code  Reasoning ",
    "url": "https://arxiv.org/abs/2402.09664",
    "authors": [
      "Changshu Liu",
      "Shizhuo Dylan Zhang",
      "Reyhaneh Jabbarvand"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2402.09786",
    "title": "Examining Pathological Bias in a Generative Adversarial Network  Discriminator: A Case Study on a StyleGAN3 Model",
    "abstract": " Title: Examining Pathological Bias in a Generative Adversarial Network  Discriminator: A Case Study on a StyleGAN3 Model ",
    "url": "https://arxiv.org/abs/2402.09786",
    "authors": [
      "Alvin Grissom II",
      "Ryan F. Lei",
      "Jeova Farias Sales Rocha Neto",
      "Bailey Lin",
      "Ryan Trotter"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10059",
    "title": "Partial synchrony for free? New bounds for Byzantine agreement via a  generic transformation across network models",
    "abstract": " Title: Partial synchrony for free? New bounds for Byzantine agreement via a  generic transformation across network models ",
    "url": "https://arxiv.org/abs/2402.10059",
    "authors": [
      "Pierre Civit",
      "Muhammad Ayaz Dzulfikar",
      "Seth Gilbert",
      "Rachid Guerraoui",
      "Jovan Komatovic",
      "Manuel Vidigueira",
      "Igor Zablotchi"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  }
]