[
  {
    "id": "arXiv:2106.12118",
    "title": "HDMM: Optimizing error of high-dimensional statistical queries under  differential privacy",
    "abstract": "In this work we describe the High-Dimensional Matrix Mechanism (HDMM), a differentially private algorithm for answering a workload of predicate counting queries. HDMM represents query workloads using a compact implicit matrix representation and exploits this representation to efficiently optimize over (a subset of) the space of differentially private algorithms for one that is unbiased and answers the input query workload with low expected error. HDMM can be deployed for both $\\epsilon$-differential privacy (with Laplace noise) and $(\\epsilon, \\delta)$-differential privacy (with Gaussian noise), although the core techniques are slightly different for each. We demonstrate empirically that HDMM can efficiently answer queries with lower expected error than state-of-the-art techniques, and in some cases, it nearly matches existing lower bounds for the particular class of mechanisms we consider. ",
    "url": "https://arxiv.org/abs/2106.12118",
    "authors": [
      "Ryan McKenna",
      "Gerome Miklau",
      "Michael Hay",
      "Ashwin Machanavajjhala"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2106.12132",
    "title": "Enrollment-less training for personalized voice activity detection",
    "abstract": "We present a novel personalized voice activity detection (PVAD) learning method that does not require enrollment data during training. PVAD is a task to detect the speech segments of a specific target speaker at the frame level using enrollment speech of the target speaker. Since PVAD must learn speakers' speech variations to clarify the boundary between speakers, studies on PVAD used large-scale datasets that contain many utterances for each speaker. However, the datasets to train a PVAD model are often limited because substantial cost is needed to prepare such a dataset. In addition, we cannot utilize the datasets used to train the standard VAD because they often lack speaker labels. To solve these problems, our key idea is to use one utterance as both a kind of enrollment speech and an input to the PVAD during training, which enables PVAD training without enrollment speech. In our proposed method, called enrollment-less training, we augment one utterance so as to create variability between the input and the enrollment speech while keeping the speaker identity, which avoids the mismatch between training and inference. Our experimental results demonstrate the efficacy of the method. ",
    "url": "https://arxiv.org/abs/2106.12132",
    "authors": [
      "Naoki Makishima",
      "Mana Ihori",
      "Tomohiro Tanaka",
      "Akihiko Takashima",
      "Shota Orihashi",
      "Ryo Masumura"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2106.12147",
    "title": "Lagrangian dual framework for conservative neural network solutions of  kinetic equations",
    "abstract": "In this paper, we propose a novel conservative formulation for solving kinetic equations via neural networks. More precisely, we formulate the learning problem as a constrained optimization problem with constraints that represent the physical conservation laws. The constraints are relaxed toward the residual loss function by the Lagrangian duality. By imposing physical conservation properties of the solution as constraints of the learning problem, we demonstrate far more accurate approximations of the solutions in terms of errors and the conservation laws, for the kinetic Fokker-Planck equation and the homogeneous Boltzmann equation. ",
    "url": "https://arxiv.org/abs/2106.12147",
    "authors": [
      "Hyung Ju Hwang",
      "Hwijae Son"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.12249",
    "title": "Forced pairs in A-Stick graphs",
    "abstract": "A Stick graph G=(A\\cup B, E) is the intersection graph of a set A of horizontal segments and a set B of vertical segments in the plane, whose left and respectively bottom endpoints lie on the same ground line with slope -1. These endpoints are respectively called A-origins and B-origins. When a total order is provided for the A-origins, the resulting graphs are called A-Stick graphs. In this paper, we propose a characterization of the class of A-Stick graphs using forced pairs, which are pairs of segments in B with the property that only one left-to-right order of their origins is possible on the ground line. We deduce a recognition algorithm for A-Stick graphs running in O(|A|+|B|+|E|) time, thus improving the running time of O(|A|\\cdot |B|) of the best current algorithm. We also introduce the problem of finding, for a Stick graph, a representation using segments of minimum total length. The canonical order on the A- and B-origins, output by our recognition algorithm, allows us to obtain partial results on this problem. ",
    "url": "https://arxiv.org/abs/2106.12249",
    "authors": [
      "Irena Rusu"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2106.12322",
    "title": "Distributed coloring and the local structure of unit-disk graphs",
    "abstract": "Coloring unit-disk graphs efficiently is an important problem in the global and distributed setting, with applications in radio channel assignment problems when the communication relies on omni-directional antennas of the same power. In this context it is important to bound not only the complexity of the coloring algorithms, but also the number of colors used. In this paper, we consider two natural distributed settings. In the location-aware setting (when nodes know their coordinates in the plane), we give a constant time distributed algorithm coloring any unit-disk graph $G$ with at most $(3+\\epsilon)\\omega(G)+6$ colors, for any constant $\\epsilon>0$, where $\\omega(G)$ is the clique number of $G$. This improves upon a classical 3-approximation algorithm for this problem, for all unit-disk graphs whose chromatic number significantly exceeds their clique number. When nodes do not know their coordinates in the plane, we give a distributed algorithm in the LOCAL model that colors every unit-disk graph $G$ with at most $5.68\\omega(G)$ colors in $O(2^{\\sqrt{\\log \\log n}})$ rounds. Moreover, when $\\omega(G)=O(1)$, the algorithm runs in $O(\\log^* n)$ rounds. This algorithm is based on a study of the local structure of unit-disk graphs, which is of independent interest. We conjecture that every unit-disk graph $G$ has average degree at most $4\\omega(G)$, which would imply the existence of a $O(\\log n)$ round algorithm coloring any unit-disk graph $G$ with (approximatively) $4\\omega(G)$ colors. ",
    "url": "https://arxiv.org/abs/2106.12322",
    "authors": [
      "Louis Esperet",
      "Sébastien Julliot",
      "Arnaud de Mesmay"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computational Geometry (cs.CG)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2106.12515",
    "title": "Committor functions via tensor networks",
    "abstract": "We propose a novel approach for computing committor functions, which describe transitions of a stochastic process between metastable states. The committor function satisfies a backward Kolmogorov equation, and in typical high-dimensional settings of interest, it is intractable to compute and store the solution with traditional numerical methods. By parametrizing the committor function in a matrix product state/tensor train format and using a similar representation for the equilibrium probability density, we solve the variational formulation of the backward Kolmogorov equation with linear time and memory complexity in the number of dimensions. This approach bypasses the need for sampling the equilibrium distribution, which can be difficult when the distribution has multiple modes. Numerical results demonstrate the effectiveness of the proposed method for high-dimensional problems. ",
    "url": "https://arxiv.org/abs/2106.12515",
    "authors": [
      "Yian Chen",
      "Jeremy Hoskins",
      "Yuehaw Khoo",
      "Michael Lindsey"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2106.12045",
    "title": "Deep learning for improved global precipitation in numerical weather  prediction systems",
    "abstract": "The formation of precipitation in state-of-the-art weather and climate models is an important process. The understanding of its relationship with other variables can lead to endless benefits, particularly for the world's monsoon regions dependent on rainfall as a support for livelihood. Various factors play a crucial role in the formation of rainfall, and those physical processes are leading to significant biases in the operational weather forecasts. We use the UNET architecture of a deep convolutional neural network with residual learning as a proof of concept to learn global data-driven models of precipitation. The models are trained on reanalysis datasets projected on the cubed-sphere projection to minimize errors due to spherical distortion. The results are compared with the operational dynamical model used by the India Meteorological Department. The theoretical deep learning-based model shows doubling of the grid point, as well as area averaged skill measured in Pearson correlation coefficients relative to operational system. This study is a proof-of-concept showing that residual learning-based UNET can unravel physical relationships to target precipitation, and those physical constraints can be used in the dynamical operational models towards improved precipitation forecasts. Our results pave the way for the development of online, hybrid models in the future. ",
    "url": "https://arxiv.org/abs/2106.12045",
    "authors": [
      "Manmeet Singh",
      "Bipin Kumar",
      "Dev Niyogi",
      "Suryachandra Rao",
      "Sukhpal Singh Gill",
      "Rajib Chattopadhyay",
      "Ravi S Nanjundiah"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.12228",
    "title": "groupShapley: Efficient prediction explanation with Shapley values for  feature groups",
    "abstract": "Shapley values has established itself as one of the most appropriate and theoretically sound frameworks for explaining predictions from complex machine learning models. The popularity of Shapley values in the explanation setting is probably due to its unique theoretical properties. The main drawback with Shapley values, however, is that its computational complexity grows exponentially in the number of input features, making it unfeasible in many real world situations where there could be hundreds or thousands of features. Furthermore, with many (dependent) features, presenting/visualizing and interpreting the computed Shapley values also becomes challenging. The present paper introduces groupShapley: a conceptually simple approach for dealing with the aforementioned bottlenecks. The idea is to group the features, for example by type or dependence, and then compute and present Shapley values for these groups instead of for all individual features. Reducing hundreds or thousands of features to half a dozen or so, makes precise computations practically feasible and the presentation and knowledge extraction greatly simplified. We prove that under certain conditions, groupShapley is equivalent to summing the feature-wise Shapley values within each feature group. Moreover, we provide a simulation study exemplifying the differences when these conditions are not met. We illustrate the usability of the approach in a real world car insurance example, where groupShapley is used to provide simple and intuitive explanations. ",
    "url": "https://arxiv.org/abs/2106.12228",
    "authors": [
      "Martin Jullum",
      "Annabelle Redelmeier",
      "Kjersti Aas"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2008.00316",
    "title": "Order from chaos in quantum walks on cyclic graphs",
    "abstract": " Comments: 8 pages, 11 figures, revised with a new section on secure encryption-decryption mechanism via combining chaotic quantum walks to yield an ordered quantum walk. Accepted for publication in Physical Review A ",
    "url": "https://arxiv.org/abs/2008.00316",
    "authors": [
      "Abhisek Panda",
      "Colin Benjamin"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Quantum Algebra (math.QA)",
      "Chaotic Dynamics (nlin.CD)"
    ]
  },
  {
    "id": "arXiv:2012.02481",
    "title": "A novel multi-classifier information fusion based on Dempster-Shafer  theory: application to vibration-based fault detection",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2007.08789 ",
    "url": "https://arxiv.org/abs/2012.02481",
    "authors": [
      "Vahid Yaghoubi",
      "Liangliang Cheng",
      "Wim Van Paepegem",
      "Mathias Kersemans"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.04653",
    "title": "Networked partisanship and framing: a socio-semantic network analysis of  the Italian debate on migration",
    "abstract": " Title: Networked partisanship and framing: a socio-semantic network analysis of  the Italian debate on migration ",
    "url": "https://arxiv.org/abs/2103.04653",
    "authors": [
      "Tommaso Radicioni",
      "Tiziano Squartini",
      "Elena Pavan",
      "Fabio Saracco"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:2106.11756",
    "title": "Trinity: A No-Code AI platform for complex spatial datasets",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2106.11756",
    "authors": [
      "C.V.Krishnakumar Iyer",
      "Feili Hou",
      "Henry Wang",
      "Yonghong Wang",
      "Kay Oh",
      "Swetava Ganguli",
      "Vipul Pandey"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]