[
  {
    "id": "arXiv:2305.07039",
    "title": "Value Iteration Networks with Gated Summarization Module",
    "abstract": "In this paper, we address the challenges faced by Value Iteration Networks (VIN) in handling larger input maps and mitigating the impact of accumulated errors caused by increased iterations. We propose a novel approach, Value Iteration Networks with Gated Summarization Module (GS-VIN), which incorporates two main improvements: (1) employing an Adaptive Iteration Strategy in the Value Iteration module to reduce the number of iterations, and (2) introducing a Gated Summarization module to summarize the iterative process. The adaptive iteration strategy uses larger convolution kernels with fewer iteration times, reducing network depth and increasing training stability while maintaining the accuracy of the planning process. The gated summarization module enables the network to emphasize the entire planning process, rather than solely relying on the final global planning outcome, by temporally and spatially resampling the entire planning process within the VI module. We conduct experiments on 2D grid world path-finding problems and the Atari Mr. Pac-man environment, demonstrating that GS-VIN outperforms the baseline in terms of single-step accuracy, planning success rate, and overall performance across different map sizes. Additionally, we provide an analysis of the relationship between input size, kernel size, and the number of iterations in VI-based models, which is applicable to a majority of VI-based models and offers valuable insights for researchers and industrial deployment. ",
    "url": "https://arxiv.org/abs/2305.07039",
    "authors": [
      "Jinyu Cai",
      "Jialong Li",
      "Kenji Tei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07097",
    "title": "Automated Smell Detection and Recommendation in Natural Language  Requirements",
    "abstract": "Requirement specifications are typically written in natural language (NL) due to its usability across multiple domains and understandability by all stakeholders. However, unstructured NL is prone to quality problems (e.g., ambiguity) in writing requirements, which can result in project failures. To address this issue, we present a tool, named Paska, that automatically detects quality problems as smells in NL requirements and offers recommendations to improve their quality. Our approach relies on natural language processing (NLP) techniques and, most importantly, a state-of-the-art controlled natural language (CNL) for requirements (Rimay), to detect smells and suggest recommendations using patterns defined in Rimay to improve requirement quality. We evaluated Paska through an industrial case study in the financial domain involving 13 systems and 2725 annotated requirements. The results show that our tool is accurate in detecting smells (precision of 89% and recall of 89%) and suggesting appropriate Rimay pattern recommendations (precision of 96% and recall of 94%). ",
    "url": "https://arxiv.org/abs/2305.07097",
    "authors": [
      "Alvaro Veizaga",
      "Seung Yeob Shin",
      "Lionel C. Briand"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2305.07098",
    "title": "Theoretical Analyses of Evolutionary Algorithms on Time-Linkage OneMax  with General Weights",
    "abstract": "Evolutionary computation has shown its superiority in dynamic optimization, but for the (dynamic) time-linkage problems, some theoretical studies have revealed the possible weakness of evolutionary computation. Since the theoretically analyzed time-linkage problem only considers the influence of an extremely strong negative time-linkage effect, it remains unclear whether the weakness also appears in problems with more general time-linkage effects. Besides, understanding in depth the relationship between time-linkage effect and algorithmic features is important to build up our knowledge of what algorithmic features are good at what kinds of problems. In this paper, we analyze the general time-linkage effect and consider the time-linkage OneMax with general weights whose absolute values reflect the strength and whose sign reflects the positive or negative influence. We prove that except for some small and positive time-linkage effects (that is, for weights $0$ and $1$), randomized local search (RLS) and (1+1)EA cannot converge to the global optimum with a positive probability. More precisely, for the negative time-linkage effect (for negative weights), both algorithms cannot efficiently reach the global optimum and the probability of failing to converge to the global optimum is at least $1-o(1)$. For the not so small positive time-linkage effect (positive weights greater than $1$), such a probability is at most $c+o(1)$ where $c$ is a constant strictly less than $1$. ",
    "url": "https://arxiv.org/abs/2305.07098",
    "authors": [
      "Weijie Zheng",
      "Xin Yao"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2305.07100",
    "title": "$\\mathrm{E}(n)$ Equivariant Message Passing Simplicial Networks",
    "abstract": "This paper presents $\\mathrm{E}(n)$ Equivariant Message Passing Simplicial Networks (EMPSNs), a novel approach to learning on geometric graphs and point clouds that is equivariant to rotations, translations, and reflections. EMPSNs can learn high-dimensional simplex features in graphs (e.g. triangles), and use the increase of geometric information of higher-dimensional simplices in an $\\mathrm{E}(n)$ equivariant fashion. EMPSNs simultaneously generalize $\\mathrm{E}(n)$ Equivariant Graph Neural Networks to a topologically more elaborate counterpart and provide an approach for including geometric information in Message Passing Simplicial Networks. The results indicate that EMPSNs can leverage the benefits of both approaches, leading to a general increase in performance when compared to either method. Furthermore, the results suggest that incorporating geometric information serves as an effective measure against over-smoothing in message passing networks, especially when operating on high-dimensional simplicial structures. Last, we show that EMPSNs are on par with state-of-the-art approaches for learning on geometric graphs. ",
    "url": "https://arxiv.org/abs/2305.07100",
    "authors": [
      "Floor Eijkelboom",
      "Rob Hesselink",
      "Erik Bekkers"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07114",
    "title": "Enhanced Hybrid Automatic Repeat Request Scheduling for Non-Terrestrial  IoT Networks",
    "abstract": "Non-terrestrial networks (NTNs) complement their terrestrial counterparts in enabling ubiquitous connectivity globally by serving unserved and/or underserved areas of the world. While supporting enhanced mobile broadband (eMBB) data over NTNs has been extensively studied in the past, focus on massive machine type communication (mMTC) over NTNs is currently growing, as also witnessed by the new study and work items included into the 3rd generation partnership project (3GPP) agenda for commissioning specifications for Internet-of-Things (IoT) communications over NTNs. Supporting mMTC in non-terrestrial cellular IoT (C-IoT) networks requires jointly addressing the unique challenges introduced in NTNs and CIoT communications. In this paper, we tackle one such issue caused due to the extended round-trip time and increased path loss in NTNs resulting in a degraded network throughput. We propose smarter transport blocks scheduling methods that can increase the efficiency of resource utilization. We conduct end-to-end link-level simulations of C-IoT traffic over NTNs and present numerical results of the data rate gains achieved to show the performance of our proposed solutions against legacy scheduling methods. ",
    "url": "https://arxiv.org/abs/2305.07114",
    "authors": [
      "Gautham Prasad",
      "Vishnu Rajendra Chandrika",
      "Lutz Lampe",
      "Gus Vos"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.07117",
    "title": "Conflict Mitigation Framework and Conflict Detection in O-RAN Near-RT  RIC",
    "abstract": "The steady evolution of the Open RAN concept sheds light on xApps and their potential use cases in O-RANcompliant deployments. There are several areas where xApps can be used that are being widely investigated, but the issue of mitigating conflicts between xApp decisions requires further in-depth investigation. This article defines a conflict mitigation framework (CMF) built into the existing O-RAN architecture; it enables the Conflict Mitigation component in O-RAN's Near- Real-Time RAN Intelligent Controller (Near-RT RIC) to detect and resolve all conflict types defined in the O-RAN Alliance's technical specifications. Methods for detecting each type of conflict are defined, including message flows between Near-RT RIC components. The suitability of the proposed CMF is proven with a simulation of an O-RAN network. Results of the simulation show that enabling the CMF allows balancing the network control capabilities of conflicting xApps to significantly improve network performance, with a small negative impact on its reliability. It is concluded that defining a unified CMF in Near-RT RIC is the first step towards providing a standardized method of conflict detection and resolution in O-RAN environments. ",
    "url": "https://arxiv.org/abs/2305.07117",
    "authors": [
      "Cezary Adamczyk",
      "Adrian Kliks"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2305.07119",
    "title": "Graph Neural Network for Accurate and Low-complexity SAR ATR",
    "abstract": "Synthetic Aperture Radar (SAR) Automatic Target Recognition (ATR) is the key technique for remote sensing image recognition. The state-of-the-art works exploit the deep convolutional neural networks (CNNs) for SAR ATR, leading to high computation costs. These deep CNN models are unsuitable to be deployed on resource-limited platforms. In this work, we propose a graph neural network (GNN) model to achieve accurate and low-latency SAR ATR. We transform the input SAR image into the graph representation. The proposed GNN model consists of a stack of GNN layers that operates on the input graph to perform target classification. Unlike the state-of-the-art CNNs, which need heavy convolution operations, the proposed GNN model has low computation complexity and achieves comparable high accuracy. The GNN-based approach enables our proposed \\emph{input pruning} strategy. By filtering out the irrelevant vertices in the input graph, we can reduce the computation complexity. Moreover, we propose the \\emph{model pruning} strategy to sparsify the model weight matrices which further reduces the computation complexity. We evaluate the proposed GNN model on the MSTAR dataset and ship discrimination dataset. The evaluation results show that the proposed GNN model achieves 99.38\\% and 99.7\\% classification accuracy on the above two datasets, respectively. The proposed pruning strategies can prune 98.6\\% input vertices and 97\\% weight entries with negligible accuracy loss. Compared with the state-of-the-art CNNs, the proposed GNN model has only 1/3000 computation cost and 1/80 model size. ",
    "url": "https://arxiv.org/abs/2305.07119",
    "authors": [
      "Bingyi Zhang",
      "Sasindu Wijeratne",
      "Rajgopal Kannan",
      "Viktor Prasanna",
      "Carl Busart"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2305.07132",
    "title": "Tackling Interpretability in Audio Classification Networks with  Non-negative Matrix Factorization",
    "abstract": "This paper tackles two major problem settings for interpretability of audio processing networks, post-hoc and by-design interpretation. For post-hoc interpretation, we aim to interpret decisions of a network in terms of high-level audio objects that are also listenable for the end-user. This is extended to present an inherently interpretable model with high performance. To this end, we propose a novel interpreter design that incorporates non-negative matrix factorization (NMF). In particular, an interpreter is trained to generate a regularized intermediate embedding from hidden layers of a target network, learnt as time-activations of a pre-learnt NMF dictionary. Our methodology allows us to generate intuitive audio-based interpretations that explicitly enhance parts of the input signal most relevant for a network's decision. We demonstrate our method's applicability on a variety of classification tasks, including multi-label data for real-world audio and music. ",
    "url": "https://arxiv.org/abs/2305.07132",
    "authors": [
      "Jayneel Parekh",
      "Sanjeel Parekh",
      "Pavlo Mozharovskyi",
      "Gaël Richard",
      "Florence d'Alché-Buc"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2305.07138",
    "title": "Promise and Limitations of Supervised Optimal Transport-Based Graph  Summarization via Information Theoretic Measures",
    "abstract": "Graph summarization is the problem of producing smaller graph representations of an input graph dataset, in such a way that the smaller compressed graphs capture relevant structural information for downstream tasks. There is a recent graph summarization method that formulates an optimal transport-based framework that allows prior information about node, edge, and attribute importance (never defined in that work) to be incorporated into the graph summarization process. However, very little is known about the statistical properties of this framework. To elucidate this question, we consider the problem of supervised graph summarization, wherein by using information theoretic measures we seek to preserve relevant information about a class label. To gain a theoretical perspective on the supervised summarization problem itself, we first formulate it in terms of maximizing the Shannon mutual information between the summarized graph and the class label. We show an NP-hardness of approximation result for this problem, thereby constraining what one should expect from proposed solutions. We then propose a summarization method that incorporates mutual information estimates between random variables associated with sample graphs and class labels into the optimal transport compression framework. We empirically show performance improvements over previous works in terms of classification accuracy and time on synthetic and certain real datasets. We also theoretically explore the limitations of the optimal transport approach for the supervised summarization problem and we show that it fails to satisfy a certain desirable information monotonicity property. ",
    "url": "https://arxiv.org/abs/2305.07138",
    "authors": [
      "Sepideh Neshatfar",
      "Abram Magner",
      "Salimeh Yasaei Sekeh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07142",
    "title": "Efficient Coded Multi-Party Computation at Edge Networks",
    "abstract": "Multi-party computation (MPC) is promising for designing privacy-preserving machine learning algorithms at edge networks. An emerging approach is coded-MPC (CMPC), which advocates the use of coded computation to improve the performance of MPC in terms of the required number of workers involved in computations. The current approach for designing CMPC algorithms is to merely combine efficient coded computation constructions with MPC. We show that this approach fails short of being efficient; e.g., entangled polynomial codes are not necessarily better than PolyDot codes in MPC setting, while they are always better for coded computation. Motivated by this observation, we propose a new construction; Adaptive Gap Entangled (AGE) polynomial codes for MPC. We show through analysis and simulations that MPC with AGE codes always perform better than existing CMPC algorithms in terms of the required number of workers as well as computation, storage, and communication overhead. ",
    "url": "https://arxiv.org/abs/2305.07142",
    "authors": [
      "Elahe Vedadi",
      "Yasaman Keshtkarjahromi",
      "Hulya Seferoglu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2305.07163",
    "title": "CatE: Embedding $\\mathcal{ALC}$ ontologies using category-theoretical  semantics",
    "abstract": "Machine learning with Semantic Web ontologies follows several strategies, one of which involves projecting ontologies into graph structures and applying graph embeddings or graph-based machine learning methods to the resulting graphs. Several methods have been developed that project ontology axioms into graphs. However, these methods are limited in the type of axioms they can project (totality), whether they are invertible (injectivity), and how they exploit semantic information. These limitations restrict the kind of tasks to which they can be applied. Category-theoretical semantics of logic languages formalizes interpretations using categories instead of sets, and categories have a graph-like structure. We developed CatE, which uses the category-theoretical formulation of the semantics of the Description Logic $\\mathcal{ALC}$ to generate a graph representation for ontology axioms. The CatE projection is total and injective, and therefore overcomes limitations of other graph-based ontology embedding methods which are generally not invertible. We apply CatE to a number of different tasks, including deductive and inductive reasoning, and we demonstrate that CatE improves over state of the art ontology embedding methods. Furthermore, we show that CatE can also outperform model-theoretic ontology embedding methods in machine learning tasks in the biomedical domain. ",
    "url": "https://arxiv.org/abs/2305.07163",
    "authors": [
      "Fernando Zhapa-Camacho",
      "Robert Hoehndorf"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07180",
    "title": "Saliency-Guided Mutual Learning Network for Few-shot Fine-grained Visual  Recognition",
    "abstract": "Recognizing novel sub-categories with scarce samples is an essential and challenging research topic in computer vision. Existing literature focus on addressing this challenge through global-based or local-based representation approaches. The former employs global feature representations for recognization, which may lack fine-grained information. The latter captures local relationships with complex structures, possibly leading to high model complexity. To address the above challenges, this article proposes a novel framework called SGML-Net for few-shot fine-grained visual recognition. SGML-Net incorporates auxiliary information via saliency detection to guide discriminative representation learning, achieving high performance and low model complexity. Specifically, SGML-Net utilizes the saliency detection model to emphasize the key regions of each sub-category, providing a strong prior for representation learning. SGML-Net transfers such prior with two independent branches in a mutual learning paradigm. To achieve effective transfer, SGML-Net leverages the relationships among different regions, making the representation more informative and thus providing better guidance. The auxiliary branch is excluded upon the transfer's completion, ensuring low model complexity in deployment. The proposed approach is empirically evaluated on three widely-used benchmarks, demonstrating its superior performance. ",
    "url": "https://arxiv.org/abs/2305.07180",
    "authors": [
      "Haiqi Liu",
      "C. L. Philip Chen",
      "Xinrong Gong",
      "Tong Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.07182",
    "title": "Boosting Value Decomposition via Unit-Wise Attentive State  Representation for Cooperative Multi-Agent Reinforcement Learning",
    "abstract": "In cooperative multi-agent reinforcement learning (MARL), the environmental stochasticity and uncertainties will increase exponentially when the number of agents increases, which puts hard pressure on how to come up with a compact latent representation from partial observation for boosting value decomposition. To tackle these issues, we propose a simple yet powerful method that alleviates partial observability and efficiently promotes coordination by introducing the UNit-wise attentive State Representation (UNSR). In UNSR, each agent learns a compact and disentangled unit-wise state representation outputted from transformer blocks, and produces its local action-value function. The proposed UNSR is used to boost the value decomposition with a multi-head attention mechanism for producing efficient credit assignment in the mixing network, providing an efficient reasoning path between the individual value function and joint value function. Experimental results demonstrate that our method achieves superior performance and data efficiency compared to solid baselines on the StarCraft II micromanagement challenge. Additional ablation experiments also help identify the key factors contributing to the performance of UNSR. ",
    "url": "https://arxiv.org/abs/2305.07182",
    "authors": [
      "Qingpeng Zhao",
      "Yuanyang Zhu",
      "Zichuan Liu",
      "Zhi Wang",
      "Chunlin Chen"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07186",
    "title": "Learning to Code on Graphs for Topological Interference Management",
    "abstract": "The state-of-the-art coding schemes for topological interference management (TIM) problems are usually handcrafted for specific families of network topologies, relying critically on experts' domain knowledge. This inevitably restricts the potential wider applications to wireless communication systems, due to the limited generalizability. This work makes the first attempt to advocate a novel intelligent coding approach to mimic topological interference alignment (IA) via local graph coloring algorithms, leveraging the new advances of graph neural networks (GNNs) and reinforcement learning (RL). The proposed LCG framework is then generalized to discover new IA coding schemes, including one-to-one vector IA and subspace IA. The extensive experiments demonstrate the excellent generalizability and transferability of the proposed approach, where the parameterized GNNs trained by small size TIM instances are able to work well on new unseen network topologies with larger size. ",
    "url": "https://arxiv.org/abs/2305.07186",
    "authors": [
      "Zhiwei Shan",
      "Xinping Yi",
      "Han Yu",
      "Chung-Shou Liao",
      "Shi Jin"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2305.07193",
    "title": "Aggressive Internet-Wide Scanners: Network Impact and Longitudinal  Characterization",
    "abstract": "Aggressive network scanners, i.e., ones with immoderate and persistent behaviors, ubiquitously search the Internet to identify insecure and publicly accessible hosts. These scanners generally lie within two main categories; i) benign research-oriented probers; ii) nefarious actors that forage for vulnerable victims and host exploitation. However, the origins, characteristics and the impact on real networks of these aggressive scanners are not well understood. In this paper, via the vantage point of a large network telescope, we provide an extensive longitudinal empirical analysis of aggressive IPv4 scanners that spans a period of almost two years. Moreover, we examine their network impact using flow and packet data from two academic ISPs. To our surprise, we discover that a non-negligible fraction of packets processed by ISP routers can be attributed to aggressive scanners. Our work aims to raise the network community's awareness for these \"heavy hitters\", especially the miscreant ones, whose invasive and rigorous behavior i) makes them more likely to succeed in abusing the hosts they target and ii) imposes a network footprint that can be disruptive to critical network services by incurring consequences akin to denial of service attacks. ",
    "url": "https://arxiv.org/abs/2305.07193",
    "authors": [
      "Aniket Anand",
      "Michalis Kallitsis",
      "Jackson Sippe",
      "Alberto Dainotti"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2305.07198",
    "title": "Model Predictive Control of Smart Districts Participating in Frequency  Regulation Market: A Case Study of Using Heating Network Storage",
    "abstract": "Flexibility provided by Combined Heat and Power (CHP) units in district heating networks is an important means to cope with increasing penetration of intermittent renewable energy resources, and various methods have been proposed to exploit thermal storage tanks installed in these networks. This paper studies a novel problem motivated by an example of district heating and cooling networks in Japan, where high-temperature steam is used as the heating medium. In steam-based networks, storage tanks are usually absent, and there is a strong need to utilize thermal inertia of the pipeline network as storage. However, this type of use of a heating network directly affects the operating condition of the network, and assuring safety and supply quality at the use side is an open problem. To address this, we formulate a novel control problem to utilize CHP units in frequency regulation market while satisfying physical constraints on a steam network described by a nonlinear model capturing dynamics of heat flows and heat accumulation in the network. Furthermore, a Model Predictive Control (MPC) framework is proposed to solve this problem. By consistently combining several nonlinear control techniques, a computationally efficient MPC controller is obtained and shown to work in real-time. ",
    "url": "https://arxiv.org/abs/2305.07198",
    "authors": [
      "Hikaru Hoshino",
      "T. John Koo",
      "Yun-Chung Chu",
      "Yoshihiko Susuki"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.07205",
    "title": "Mem-Rec: Memory Efficient Recommendation System using Alternative  Representation",
    "abstract": "Deep learning-based recommendation systems (e.g., DLRMs) are widely used AI models to provide high-quality personalized recommendations. Training data used for modern recommendation systems commonly includes categorical features taking on tens-of-millions of possible distinct values. These categorical tokens are typically assigned learned vector representations, that are stored in large embedding tables, on the order of 100s of GB. Storing and accessing these tables represent a substantial burden in commercial deployments. Our work proposes MEM-REC, a novel alternative representation approach for embedding tables. MEM-REC leverages bloom filters and hashing methods to encode categorical features using two cache-friendly embedding tables. The first table (token embedding) contains raw embeddings (i.e. learned vector representation), and the second table (weight embedding), which is much smaller, contains weights to scale these raw embeddings to provide better discriminative capability to each data point. We provide a detailed architecture, design and analysis of MEM-REC addressing trade-offs in accuracy and computation requirements, in comparison with state-of-the-art techniques. We show that MEM-REC can not only maintain the recommendation quality and significantly reduce the memory footprint for commercial scale recommendation models but can also improve the embedding latency. In particular, based on our results, MEM-REC compresses the MLPerf CriteoTB benchmark DLRM model size by 2900x and performs up to 3.4x faster embeddings while achieving the same AUC as that of the full uncompressed model. ",
    "url": "https://arxiv.org/abs/2305.07205",
    "authors": [
      "Gopu Krishna Jha",
      "Anthony Thomas",
      "Nilesh Jain",
      "Sameh Gobriel",
      "Tajana Rosing",
      "Ravi Iyer"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07208",
    "title": "Making Differential Privacy Work for Census Data Users",
    "abstract": "The U.S. Census Bureau collects and publishes detailed demographic data about Americans which are heavily used by researchers and policymakers. The Bureau has recently adopted the framework of differential privacy in an effort to improve confidentiality of individual census responses. A key output of this privacy protection system is the Noisy Measurement File (NMF), which is produced by adding random noise to tabulated statistics. The NMF is critical to understanding any biases in the data, and performing valid statistical inference on published census data. Unfortunately, the current release format of the NMF is difficult to access and work with. We describe the process we use to transform the NMF into a usable format, and provide recommendations to the Bureau for how to release future versions of the NMF. These changes are essential for ensuring transparency of privacy measures and reproducibility of scientific research built on census data. ",
    "url": "https://arxiv.org/abs/2305.07208",
    "authors": [
      "Cory McCartan",
      "Tyler Simko",
      "Kosuke Imai"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2305.07254",
    "title": "A Lightweight Authentication Protocol against Modeling Attacks based on  a Novel LFSR-APUF",
    "abstract": "Simple authentication protocols based on conventional physical unclonable function (PUF) are vulnerable to modeling attacks and other security threats. This paper proposes an arbiter PUF based on a linear feedback shift register (LFSR-APUF). Different from the previously reported linear feedback shift register for challenge extension, the proposed scheme feeds the external random challenges into the LFSR module to obfuscate the linear mapping relationship between the challenge and response. It can prevent attackers from obtaining valid challenge-response pairs (CRPs), increasing its resistance to modeling attacks significantly. A 64-stage LFSR-APUF has been implemented on a field programmable gate array (FPGA) board. The experimental results reveal that the proposed design can effectively resist various modeling attacks such as logistic regression (LR), evolutionary strategy (ES), Artificial Neuro Network (ANN), and support vector machine (SVM) with a prediction rate of 51.79% and a slight effect on the randomness, reliability, and uniqueness. Further, a lightweight authentication protocol is established based on the proposed LFSR-APUF. The protocol incorporates a low-overhead, ultra-lightweight, novel private bit conversion Cover function that is uniquely bound to each device in the authentication network. A dynamic and timevariant obfuscation scheme in combination with the proposed LFSR-APUF is implemented in the protocol. The proposed authentication protocol not only resists spoofing attacks, physical attacks, and modeling attacks effectively, but also ensures the security of the entire authentication network by transferring important information in encrypted form from the server to the database even when the attacker completely controls the server. ",
    "url": "https://arxiv.org/abs/2305.07254",
    "authors": [
      "Yao Wang",
      "Xue Mei",
      "Zhengtai Chang",
      "Wenbing Fan",
      "Benqing Guo",
      "Zhi Quan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.07258",
    "title": "Direct Shaping of Minimum and Maximum Singular Values: An  $\\mathcal{H}_{-}/\\mathcal{H}_{\\infty}$ Synthesis Approach for Fault Detection  Filters",
    "abstract": "The performance of fault detection filters relies on a high sensitivity to faults and a low sensitivity to disturbances. The aim of this paper is to develop an approach to directly shape these sensitivities, expressed in terms of minimum and maximum singular values. The developed method offers an alternative solution to the $\\mathcal{H}_{-}/\\mathcal{H}_{\\infty}$ synthesis problem, building upon traditional multiobjective synthesis results. The result is an optimal filter synthesized via iterative convex optimization and the approach is particularly useful for fault diagnosis as illustrated by a numerical example. ",
    "url": "https://arxiv.org/abs/2305.07258",
    "authors": [
      "Koen Classens",
      "W.P.M.H.",
      "Heemels",
      "Tom Oomen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.07265",
    "title": "Performance Analysis of RIS-Aided NOMA Networks in $α-μ$ &  $κ-μ$ Generalized Fading Channel",
    "abstract": "For forthcoming 5G networks, Non-Orthogonal Multiple Access (NOMA) is a very promising techniques. and in today's world, Line of Sight communication is becoming increasingly harder to achieve. Hence, technologies like Reconfigurable Intelligent Surfaces (RIS) emerge. RIS-aided NOMA networks is a widely researched implementation of RIS. The environment where these networks are employed are non-homogeneous & non-linear in nature. The effectiveness of these systems must thus be evaluated using generalized fading channels. In this paper, the performance of a RIS-aided NOMA is compared with conventional NOMA in alpha-mu and kappa-mu channels. This paper also shows that the well-known fading distribution are special cases of these generalized fading channels, both analytically and through simulation. ",
    "url": "https://arxiv.org/abs/2305.07265",
    "authors": [
      "Aaditya Prakash Kattekola",
      "Sanjana Dontha",
      "Anuradha Sundru"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.07269",
    "title": "Meta-Optimization for Higher Model Generalizability in Single-Image  Depth Prediction",
    "abstract": "Model generalizability to unseen datasets, concerned with in-the-wild robustness, is less studied for indoor single-image depth prediction. We leverage gradient-based meta-learning for higher generalizability on zero-shot cross-dataset inference. Unlike the most-studied image classification in meta-learning, depth is pixel-level continuous range values, and mappings from each image to depth vary widely across environments. Thus no explicit task boundaries exist. We instead propose fine-grained task that treats each RGB-D pair as a task in our meta-optimization. We first show meta-learning on limited data induces much better prior (max +29.4\\%). Using meta-learned weights as initialization for following supervised learning, without involving extra data or information, it consistently outperforms baselines without the method. Compared to most indoor-depth methods that only train/ test on a single dataset, we propose zero-shot cross-dataset protocols, closely evaluate robustness, and show consistently higher generalizability and accuracy by our meta-initialization. The work at the intersection of depth and meta-learning potentially drives both research streams to step closer to practical use. ",
    "url": "https://arxiv.org/abs/2305.07269",
    "authors": [
      "Cho-Ying Wu",
      "Yiqi Zhong",
      "Junying Wang",
      "Ulrich Neumann"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.07270",
    "title": "SSD-MonoDTR: Supervised Scale-constrained Deformable Transformer for  Monocular 3D Object Detection",
    "abstract": "Transformer-based methods have demonstrated superior performance for monocular 3D object detection recently, which predicts 3D attributes from a single 2D image. Most existing transformer-based methods leverage visual and depth representations to explore valuable query points on objects, and the quality of the learned queries has a great impact on detection accuracy. Unfortunately, existing unsupervised attention mechanisms in transformer are prone to generate low-quality query features due to inaccurate receptive fields, especially on hard objects. To tackle this problem, this paper proposes a novel ``Supervised Scale-constrained Deformable Attention'' (SSDA) for monocular 3D object detection. Specifically, SSDA presets several masks with different scales and utilizes depth and visual features to predict the local feature for each query. Imposing the scale constraint, SSDA could well predict the accurate receptive field of a query to support robust query feature generation. What is more, SSDA is assigned with a Weighted Scale Matching (WSM) loss to supervise scale prediction, which presents more confident results as compared to the unsupervised attention mechanisms. Extensive experiments on ``KITTI'' demonstrate that SSDA significantly improves the detection accuracy especially on moderate and hard objects, yielding SOTA performance as compared to the existing approaches. Code will be publicly available at https://github.com/mikasa3lili/SSD-MonoDETR. ",
    "url": "https://arxiv.org/abs/2305.07270",
    "authors": [
      "Xuan He",
      "Fan Yang",
      "Jiacheng Lin",
      "Haolong Fu",
      "Jin Yuan",
      "Kailun Yang",
      "Zhiyong Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2305.07287",
    "title": "Where to Look When Repairing Code? Comparing the Attention of Neural  Models and Developers",
    "abstract": "Neural network-based techniques for automated program repair are becoming increasingly effective. Despite their success, little is known about why they succeed or fail, and how their way of reasoning about the code to repair compares to human developers. This paper presents the first in-depth study comparing human and neural program repair. In particular, we investigate what parts of the buggy code humans and two state of the art neural repair models focus on. This comparison is enabled by a novel attention-tracking interface for human code editing, based on which we gather a dataset of 98 bug fixing sessions, and on the attention layers of neural repair models. Our results show that the attention of the humans and both neural models often overlaps (0.35 to 0.44 correlation). At the same time, the agreement between humans and models still leaves room for improvement, as evidenced by the higher human-human correlation of 0.56. While the two models either focus mostly on the buggy line or on the surrounding context, the developers adopt a hybrid approach that evolves over time, where 36.8% of the attention is given to the buggy line and the rest to the context. Overall, we find the humans to still be clearly more effective at finding a correct fix, with 67.3% vs. less than 3% correctly predicted patches. The results and data of this study are a first step into a deeper understanding of the internal process of neural program repair, and offer insights inspired by the behavior of human developers on how to further improve neural repair models. ",
    "url": "https://arxiv.org/abs/2305.07287",
    "authors": [
      "Dominik Huber",
      "Matteo Paltenghi",
      "Michael Pradel"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2305.07288",
    "title": "Open-WikiTable: Dataset for Open Domain Question Answering with Complex  Reasoning over Table",
    "abstract": "Despite recent interest in open domain question answering (ODQA) over tables, many studies still rely on datasets that are not truly optimal for the task with respect to utilizing structural nature of table. These datasets assume answers reside as a single cell value and do not necessitate exploring over multiple cells such as aggregation, comparison, and sorting. Thus, we release Open-WikiTable, the first ODQA dataset that requires complex reasoning over tables. Open-WikiTable is built upon WikiSQL and WikiTableQuestions to be applicable in the open-domain setting. As each question is coupled with both textual answers and SQL queries, Open-WikiTable opens up a wide range of possibilities for future research, as both reader and parser methods can be applied. The dataset and code are publicly available. ",
    "url": "https://arxiv.org/abs/2305.07288",
    "authors": [
      "Sunjun Kweon",
      "Yeonsu Kwon",
      "Seonhee Cho",
      "Yohan Jo",
      "Edward Choi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.07289",
    "title": "RepCL: Exploring Effective Representation for Continual Text  Classification",
    "abstract": "Continual learning (CL) aims to constantly learn new knowledge over time while avoiding catastrophic forgetting on old tasks. In this work, we focus on continual text classification under the class-incremental setting. Recent CL studies find that the representations learned in one task may not be effective for other tasks, namely representation bias problem. For the first time we formally analyze representation bias from an information bottleneck perspective and suggest that exploiting representations with more class-relevant information could alleviate the bias. To this end, we propose a novel replay-based continual text classification method, RepCL. Our approach utilizes contrastive and generative representation learning objectives to capture more class-relevant features. In addition, RepCL introduces an adversarial replay strategy to alleviate the overfitting problem of replay. Experiments demonstrate that RepCL effectively alleviates forgetting and achieves state-of-the-art performance on three text classification tasks. ",
    "url": "https://arxiv.org/abs/2305.07289",
    "authors": [
      "Yifan Song",
      "Peiyi Wang",
      "Dawei Zhu",
      "Tianyu Liu",
      "Zhifang Sui",
      "Sujian Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.07295",
    "title": "Parameterized Verification of Disjunctive Timed Networks",
    "abstract": "We introduce new techniques for the parameterized verification of disjunctive timed networks (DTNs), i.e., networks of timed automata (TAs) that communicate via location guards that enable a transition only if at least one process is in a given location. This computational model has been considered in the literature before, and example applications are gossiping clock synchronization protocols or planning problems. We address the minimum-time reachability problem (minreach) in DTNs, and show how to efficiently solve it based on a novel zone-graph algorithm. We further show that solving minreach allows us to construct a summary TA capturing exactly the possible behaviors of a single TA within a DTN of arbitrary size. The combination of these two results enables the parameterized verification of DTNs, while avoiding the construction of an exponential-size cutoff-system required by existing results. Our techniques are also implemented, and experiments show their practicality. ",
    "url": "https://arxiv.org/abs/2305.07295",
    "authors": [
      "Étienne André",
      "Paul Eichler",
      "Swen Jacobs",
      "Shyam Lal Karra"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2305.07300",
    "title": "Learning Quadruped Locomotion using Bio-Inspired Neural Networks with  Intrinsic Rhythmicity",
    "abstract": "Biological studies reveal that neural circuits located at the spinal cord called central pattern generator (CPG) oscillates and generates rhythmic signals, which are the underlying mechanism responsible for rhythmic locomotion behaviors of animals. Inspired by CPG's capability to naturally generate rhythmic patterns, researchers have attempted to create mathematical models of CPG and utilize them for the locomotion of legged robots. In this paper, we propose a network architecture that incorporates CPGs for rhythmic pattern generation and a multi-layer perceptron (MLP) network for sensory feedback. We also proposed a method that reformulates CPGs into a fully-differentiable stateless network, allowing CPGs and MLP to be jointly trained with gradient-based learning. The results show that our proposed method learned agile and dynamic locomotion policies which are capable of blind traversal over uneven terrain and resist external pushes. Simulation results also show that the learned policies are capable of self-modulating step frequency and step length to adapt to the locomotion velocity. ",
    "url": "https://arxiv.org/abs/2305.07300",
    "authors": [
      "Chuanyu Yang",
      "Can Pu",
      "Tianqi Wei",
      "Cong Wang",
      "Zhibin Li"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.07308",
    "title": "Efficient Search of Comprehensively Robust Neural Architectures via  Multi-fidelity Evaluation",
    "abstract": "Neural architecture search (NAS) has emerged as one successful technique to find robust deep neural network (DNN) architectures. However, most existing robustness evaluations in NAS only consider $l_{\\infty}$ norm-based adversarial noises. In order to improve the robustness of DNN models against multiple types of noises, it is necessary to consider a comprehensive evaluation in NAS for robust architectures. But with the increasing number of types of robustness evaluations, it also becomes more time-consuming to find comprehensively robust architectures. To alleviate this problem, we propose a novel efficient search of comprehensively robust neural architectures via multi-fidelity evaluation (ES-CRNA-ME). Specifically, we first search for comprehensively robust architectures under multiple types of evaluations using the weight-sharing-based NAS method, including different $l_{p}$ norm attacks, semantic adversarial attacks, and composite adversarial attacks. In addition, we reduce the number of robustness evaluations by the correlation analysis, which can incorporate similar evaluations and decrease the evaluation cost. Finally, we propose a multi-fidelity online surrogate during optimization to further decrease the search cost. On the basis of the surrogate constructed by low-fidelity data, the online high-fidelity data is utilized to finetune the surrogate. Experiments on CIFAR10 and CIFAR100 datasets show the effectiveness of our proposed method. ",
    "url": "https://arxiv.org/abs/2305.07308",
    "authors": [
      "Jialiang Sun",
      "Wen Yao",
      "Tingsong Jiang",
      "Xiaoqian Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.07310",
    "title": "Improving Zero-shot Multilingual Neural Machine Translation by  Leveraging Cross-lingual Consistency Regularization",
    "abstract": "The multilingual neural machine translation (NMT) model has a promising capability of zero-shot translation, where it could directly translate between language pairs unseen during training. For good transfer performance from supervised directions to zero-shot directions, the multilingual NMT model is expected to learn universal representations across different languages. This paper introduces a cross-lingual consistency regularization, CrossConST, to bridge the representation gap among different languages and boost zero-shot translation performance. The theoretical analysis shows that CrossConST implicitly maximizes the probability distribution for zero-shot translation, and the experimental results on both low-resource and high-resource benchmarks show that CrossConST consistently improves the translation performance. The experimental analysis also proves that CrossConST could close the sentence representation gap and better align the representation space. Given the universality and simplicity of CrossConST, we believe it can serve as a strong baseline for future multilingual NMT research. ",
    "url": "https://arxiv.org/abs/2305.07310",
    "authors": [
      "Pengzhi Gao",
      "Liwen Zhang",
      "Zhongjun He",
      "Hua Wu",
      "Haifeng Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07316",
    "title": "Parameterized Approximation for Robust Clustering in Discrete Geometric  Spaces",
    "abstract": "We consider the well-studied Robust $(k, z)$-Clustering problem, which generalizes the classic $k$-Median, $k$-Means, and $k$-Center problems. Given a constant $z\\ge 1$, the input to Robust $(k, z)$-Clustering is a set $P$ of $n$ weighted points in a metric space $(M,\\delta)$ and a positive integer $k$. Further, each point belongs to one (or more) of the $m$ many different groups $S_1,S_2,\\ldots,S_m$. Our goal is to find a set $X$ of $k$ centers such that $\\max_{i \\in [m]} \\sum_{p \\in S_i} w(p) \\delta(p,X)^z$ is minimized. This problem arises in the domains of robust optimization [Anthony, Goyal, Gupta, Nagarajan, Math. Oper. Res. 2010] and in algorithmic fairness. For polynomial time computation, an approximation factor of $O(\\log m/\\log\\log m)$ is known [Makarychev, Vakilian, COLT $2021$], which is tight under a plausible complexity assumption even in the line metrics. For FPT time, there is a $(3^z+\\epsilon)$-approximation algorithm, which is tight under GAP-ETH [Goyal, Jaiswal, Inf. Proc. Letters, 2023]. Motivated by the tight lower bounds for general discrete metrics, we focus on \\emph{geometric} spaces such as the (discrete) high-dimensional Euclidean setting and metrics of low doubling dimension, which play an important role in data analysis applications. First, for a universal constant $\\eta_0 >0.0006$, we devise a $3^z(1-\\eta_{0})$-factor FPT approximation algorithm for discrete high-dimensional Euclidean spaces thereby bypassing the lower bound for general metrics. We complement this result by showing that even the special case of $k$-Center in dimension $\\Theta(\\log n)$ is $(\\sqrt{3/2}- o(1))$-hard to approximate for FPT algorithms. Finally, we complete the FPT approximation landscape by designing an FPT $(1+\\epsilon)$-approximation scheme (EPAS) for the metric of sub-logarithmic doubling dimension. ",
    "url": "https://arxiv.org/abs/2305.07316",
    "authors": [
      "Fateme Abbasi",
      "Sandip Banerjee",
      "Jarosław Byrka",
      "Parinya Chalermsook",
      "Ameet Gadekar",
      "Kamyar Khodamoradi",
      "Dániel Marx",
      "Roohani Sharma",
      "Joachim Spoerhase"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Geometry (cs.CG)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07328",
    "title": "Configurable Spatial-Temporal Hierarchical Analysis for Flexible Video  Anomaly Detection",
    "abstract": "Video anomaly detection (VAD) is a vital task with great practical applications in industrial surveillance, security system, and traffic control. Unlike previous unsupervised VAD methods that adopt a fixed structure to learn normality without considering different detection demands, we design a spatial-temporal hierarchical architecture (STHA) as a configurable architecture to flexibly detect different degrees of anomaly. The comprehensive structure of the STHA is delineated into a tripartite hierarchy, encompassing the following tiers: the stream level, the stack level, and the block level. Specifically, we design several auto-encoder-based blocks that possess varying capacities for extracting normal patterns. Then, we stack blocks according to the complexity degrees with both intra-stack and inter-stack residual links to learn hierarchical normality gradually. Considering the multisource knowledge of videos, we also model the spatial normality of video frames and temporal normality of RGB difference by designing two parallel streams consisting of stacks. Thus, STHA can provide various representation learning abilities by expanding or contracting hierarchically to detect anomalies of different degrees. Since the anomaly set is complicated and unbounded, our STHA can adjust its detection ability to adapt to the human detection demands and the complexity degree of anomaly that happened in the history of a scene. We conduct experiments on three benchmarks and perform extensive analysis, and the results demonstrate that our method performs comparablely to the state-of-the-art methods. In addition, we design a toy dataset to prove that our model can better balance the learning ability to adapt to different detection demands. ",
    "url": "https://arxiv.org/abs/2305.07328",
    "authors": [
      "Kai Cheng",
      "Xinhua Zeng",
      "Yang Liu",
      "Tian Wang",
      "Chengxin Pang",
      "Jing Teng",
      "Zhaoyang Xia",
      "Jing Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.07330",
    "title": "Multi-Wavelength Transponders for High-capacity Optical Networks: A  Physical-layer-aware Network Planning Study",
    "abstract": "Continued cost- and power-efficient capacity scaling in optical networks is imperative to keep pace with ever-increasing traffic demands. In this paper, we investigate multi-wavelength transponders as a potential way forward. Suitable system architectures and realistic specifications of multi-wavelength transponders are identified and analyzed in terms of transmit OSNR penalties and spectral constraints. We investigate the performance for different specifications as compared to single-wavelength transponders in a network planning study on two network topologies, developing guidelines for multi-wavelength transponders specifications and their potential benefits. The studies show a reduction in the number of required lasers of up to 83% at the expense of a slight increase in number of lightpaths, demonstrating the potential for significant cost savings and efficiency improvements. ",
    "url": "https://arxiv.org/abs/2305.07330",
    "authors": [
      "Jasper Müller",
      "Ognjen Jovanovic",
      "Tobias Fehenberger",
      "Gabriele Di Rosa",
      "Jörg-Peter Elbers",
      "Carmen Mas-Machuca"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2305.07332",
    "title": "QoT estimation using EGN-assisted machine learning for multi-period  network planning",
    "abstract": "The rapidly growing traffic demands in fiber-optical networks require flexibility and accuracy in configuring lightpaths, for which fast and accurate quality of transmission (QoT) estimation is of pivotal importance. This paper introduces a machine learning (ML)-based QoT estimation approach that meets these requirements. The proposed gradient-boosting ML model uses precomputed per-channel self-channel-interference values as representative and condensed features to estimate non-linear interference in a flexible-grid network. With an enhanced Gaussian noise (GN) model simulation as the baseline, the ML model achieves a mean absolute signal-to-noise ratio error of approximately 0.1 dB, which is an improvement over the GN model. For three different network topologies and network planning approaches of varying complexities, a multi-period network planning study is performed in which ML and GN are compared as path computation elements (PCEs). The results show that the ML PCE is capable of matching or slightly improving the performance of the GN PCE on all topologies while reducing significantly the computation time of network planning by up to 70%. ",
    "url": "https://arxiv.org/abs/2305.07332",
    "authors": [
      "Jasper Müller",
      "Sai Kireet Patri",
      "Tobias Fehenberger",
      "Helmut Griesser",
      "Jörg-Peter Elbers",
      "Carmen Mas-Machuca"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2305.07342",
    "title": "BundleRecon: Ray Bundle-Based 3D Neural Reconstruction",
    "abstract": "With the growing popularity of neural rendering, there has been an increasing number of neural implicit multi-view reconstruction methods. While many models have been enhanced in terms of positional encoding, sampling, rendering, and other aspects to improve the reconstruction quality, current methods do not fully leverage the information among neighboring pixels during the reconstruction process. To address this issue, we propose an enhanced model called BundleRecon. In the existing approaches, sampling is performed by a single ray that corresponds to a single pixel. In contrast, our model samples a patch of pixels using a bundle of rays, which incorporates information from neighboring pixels. Furthermore, we design bundle-based constraints to further improve the reconstruction quality. Experimental results demonstrate that BundleRecon is compatible with the existing neural implicit multi-view reconstruction methods and can improve their reconstruction quality. ",
    "url": "https://arxiv.org/abs/2305.07342",
    "authors": [
      "Weikun Zhang",
      "Jianke Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.07350",
    "title": "Detecting Coordinated Inauthentic Behavior in Likes on Social Media:  Proof of Concept",
    "abstract": "Coordinated inauthentic behavior is used as a tool on social media to shape public opinion by elevating or suppressing topics using systematic engagements -- e.g. through *likes* or similar reactions. In an honest world, reactions may be informative to users when selecting on what to spend their attention: through the wisdom of crowds, summed reactions may help identifying relevant and high-quality content. This is nullified by coordinated inauthentic liking. To restore wisdom-of-crowds effects, it is therefore desirable to separate the inauthentic agents from the wise crowd, and use only the latter as a voting *jury* on the relevance of a post. To this end, we design two *jury selection procedures* (JSPs) that discard agents classified as inauthentic. Using machine learning techniques, both cluster on binary vote data -- one using a Gaussian Mixture Model (GMM JSP), one the k-means algorithm (KM JSP) -- and label agents by logistic regression. We evaluate the jury selection procedures with an agent-based model, and show that the GMM JSP detects more inauthentic agents, but both JSPs select juries with vastly increased correctness of vote by majority. This proof of concept provides an argument for the release of reactions data from social media platforms through a direct use-case in the fight against online misinformation. ",
    "url": "https://arxiv.org/abs/2305.07350",
    "authors": [
      "Laura Jahn",
      "Rasmus K. Rendsvig",
      "Jacob Stærk-Østergaard"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2305.07360",
    "title": "Improving the Quality of Neural Machine Translation Through Proper  Translation of Name Entities",
    "abstract": "In this paper, we have shown a method of improving the quality of neural machine translation by translating/transliterating name entities as a preprocessing step. Through experiments we have shown the performance gain of our system. For evaluation we considered three types of name entities viz person names, location names and organization names. The system was able to correctly translate mostly all the name entities. For person names the accuracy was 99.86%, for location names the accuracy was 99.63% and for organization names the accuracy was 99.05%. Overall, the accuracy of the system was 99.52% ",
    "url": "https://arxiv.org/abs/2305.07360",
    "authors": [
      "Radhika Sharma",
      "Pragya Katyayan",
      "Nisheeth Joshi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07366",
    "title": "Multi-Value Alignment in Normative Multi-Agent System: Evolutionary  Optimisation Approach",
    "abstract": "Value-alignment in normative multi-agent systems is used to promote a certain value and to ensure the consistent behavior of agents in autonomous intelligent systems with human values. However, the current literature is limited to incorporation of effective norms for single value alignment with no consideration of agents' heterogeneity and the requirement of simultaneous promotion and alignment of multiple values. This research proposes a multi-value promotion model that uses multi-objective evolutionary algorithms to produce the optimum parametric set of norms that is aligned with multiple simultaneous values of heterogeneous agents and the system. To understand various aspects of this complex problem, several evolutionary algorithms were used to find a set of optimised norm parameters considering two toy tax scenarios with two and five values are considered. The results are analysed from different perspectives to show the impact of a selected evolutionary algorithm on the solution, and the importance of understanding the relation between values when prioritising them. ",
    "url": "https://arxiv.org/abs/2305.07366",
    "authors": [
      "Maha Riad",
      "Vinicius Renan de Carvalho",
      "Fatemeh Golpayegani"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2305.07375",
    "title": "Is ChatGPT a Good Causal Reasoner? A Comprehensive Evaluation",
    "abstract": "Causal reasoning ability is crucial for numerous NLP applications. Despite the impressive emerging ability of ChatGPT in various NLP tasks, it is unclear how well ChatGPT performs in causal reasoning. In this paper, we conduct the first comprehensive evaluation of the ChatGPT's causal reasoning capabilities. Experiments show that ChatGPT is not a good causal reasoner, but a good causal interpreter. Besides, ChatGPT has a serious hallucination on causal reasoning, possibly due to the reporting biases between causal and non-causal relationships in natural language, as well as ChatGPT's upgrading processes, such as RLHF. The In-Context Learning (ICL) and Chain-of-Though (COT) techniques can further exacerbate such causal hallucination. Additionally, the causal reasoning ability of ChatGPT is sensitive to the words used to express the causal concept in prompts, and close-ended prompts perform better than open-ended prompts. For events in sentences, ChatGPT excels at capturing explicit causality rather than implicit causality, and performs better in sentences with lower event density and smaller lexical distance between events. ",
    "url": "https://arxiv.org/abs/2305.07375",
    "authors": [
      "Jinglong Gao",
      "Xiao Ding",
      "Bing Qin",
      "Ting Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07381",
    "title": "Novel bribery mining attacks in the bitcoin system and the bribery  miner's dilemma",
    "abstract": "Mining attacks allow adversaries to obtain a disproportionate share of the mining reward by deviating from the honest mining strategy in the Bitcoin system. Among them, the most well-known are selfish mining (SM), block withholding (BWH), fork after withholding (FAW) and bribery mining. In this paper, we propose two novel mining attacks: bribery semi-selfish mining (BSSM) and bribery stubborn mining (BSM). Both of them can increase the relative extra reward of the adversary and will make the target bribery miners suffer from the bribery miner dilemma. All targets earn less under the Nash equilibrium. For each target, their local optimal strategy is to accept the bribes. However, they will suffer losses, comparing with denying the bribes. Furthermore, for all targets, their global optimal strategy is to deny the bribes. Quantitative analysis and simulation have been verified our theoretical analysis. We propose practical measures to mitigate more advanced mining attack strategies based on bribery mining, and provide new ideas for addressing bribery mining attacks in the future. However, how to completely and effectively prevent these attacks is still needed on further research. ",
    "url": "https://arxiv.org/abs/2305.07381",
    "authors": [
      "Junjie Hu",
      "Chunxiang Xu",
      "Zhe Jiang",
      "Jiwu Cao"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.07386",
    "title": "One-step Bipartite Graph Cut: A Normalized Formulation and Its  Application to Scalable Subspace Clustering",
    "abstract": "The bipartite graph structure has shown its promising ability in facilitating the subspace clustering and spectral clustering algorithms for large-scale datasets. To avoid the post-processing via k-means during the bipartite graph partitioning, the constrained Laplacian rank (CLR) is often utilized for constraining the number of connected components (i.e., clusters) in the bipartite graph, which, however, neglects the distribution (or normalization) of these connected components and may lead to imbalanced or even ill clusters. Despite the significant success of normalized cut (Ncut) in general graphs, it remains surprisingly an open problem how to enforce a one-step normalized cut for bipartite graphs, especially with linear-time complexity. In this paper, we first characterize a novel one-step bipartite graph cut (OBCut) criterion with normalized constraints, and theoretically prove its equivalence to a trace maximization problem. Then we extend this cut criterion to a scalable subspace clustering approach, where adaptive anchor learning, bipartite graph learning, and one-step normalized bipartite graph partitioning are simultaneously modeled in a unified objective function, and an alternating optimization algorithm is further designed to solve it in linear time. Experiments on a variety of general and large-scale datasets demonstrate the effectiveness and scalability of our approach. ",
    "url": "https://arxiv.org/abs/2305.07386",
    "authors": [
      "Si-Guo Fang",
      "Dong Huang",
      "Chang-Dong Wang",
      "Jian-Huang Lai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07406",
    "title": "Two-in-One: A Model Hijacking Attack Against Text Generation Models",
    "abstract": "Machine learning has progressed significantly in various applications ranging from face recognition to text generation. However, its success has been accompanied by different attacks. Recently a new attack has been proposed which raises both accountability and parasitic computing risks, namely the model hijacking attack. Nevertheless, this attack has only focused on image classification tasks. In this work, we broaden the scope of this attack to include text generation and classification models, hence showing its broader applicability. More concretely, we propose a new model hijacking attack, Ditto, that can hijack different text classification tasks into multiple generation ones, e.g., language translation, text summarization, and language modeling. We use a range of text benchmark datasets such as SST-2, TweetEval, AGnews, QNLI, and IMDB to evaluate the performance of our attacks. Our results show that by using Ditto, an adversary can successfully hijack text generation models without jeopardizing their utility. ",
    "url": "https://arxiv.org/abs/2305.07406",
    "authors": [
      "Wai Man Si",
      "Michael Backes",
      "Yang Zhang",
      "Ahmed Salem"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07416",
    "title": "A Multidimensional Graph Fourier Transformation Neural Network for  Vehicle Trajectory Prediction",
    "abstract": "This work introduces the multidimensional Graph Fourier Transformation Neural Network (GFTNN) for long-term trajectory predictions on highways. Similar to Graph Neural Networks (GNNs), the GFTNN is a novel network architecture that operates on graph structures. While several GNNs lack discriminative power due to suboptimal aggregation schemes, the proposed model aggregates scenario properties through a powerful operation: the multidimensional Graph Fourier Transformation (GFT). The spatio-temporal vehicle interaction graph of a scenario is converted into a spectral scenario representation using the GFT. This beneficial representation is input to the prediction framework composed of a neural network and a descriptive decoder. Even though the proposed GFTNN does not include any recurrent element, it outperforms state-of-the-art models in the task of highway trajectory prediction. For experiments and evaluation, the publicly available datasets highD and NGSIM are used ",
    "url": "https://arxiv.org/abs/2305.07416",
    "authors": [
      "Marion Neumeier",
      "Andreas Tollkühn",
      "Michael Botsch",
      "Wolfgang Utschick"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07424",
    "title": "Instance Smoothed Contrastive Learning for Unsupervised Sentence  Embedding",
    "abstract": "Contrastive learning-based methods, such as unsup-SimCSE, have achieved state-of-the-art (SOTA) performances in learning unsupervised sentence embeddings. However, in previous studies, each embedding used for contrastive learning only derived from one sentence instance, and we call these embeddings instance-level embeddings. In other words, each embedding is regarded as a unique class of its own, whichmay hurt the generalization performance. In this study, we propose IS-CSE (instance smoothing contrastive sentence embedding) to smooth the boundaries of embeddings in the feature space. Specifically, we retrieve embeddings from a dynamic memory buffer according to the semantic similarity to get a positive embedding group. Then embeddings in the group are aggregated by a self-attention operation to produce a smoothed instance embedding for further analysis. We evaluate our method on standard semantic text similarity (STS) tasks and achieve an average of 78.30%, 79.47%, 77.73%, and 79.42% Spearman's correlation on the base of BERT-base, BERT-large, RoBERTa-base, and RoBERTa-large respectively, a 2.05%, 1.06%, 1.16% and 0.52% improvement compared to unsup-SimCSE. ",
    "url": "https://arxiv.org/abs/2305.07424",
    "authors": [
      "Hongliang He",
      "Junlei zhang",
      "Zhenzhong Lan",
      "Yue Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07450",
    "title": "Accelerating Java Ray Tracing Applications on Heterogeneous Hardware",
    "abstract": "Ray tracing has been typically known as a graphics rendering method capable of producing highly realistic imagery and visual effects generated by computers. More recently the performance improvements in Graphics Processing Units (GPUs) have enabled developers to exploit sufficient computing power to build a fair amount of ray tracing applications with the ability to run in real-time. Typically, real-time ray tracing is achieved by utilizing high performance kernels written in CUDA, OpenCL, and Vulkan which can be invoked by high-level languages via native bindings; a technique that fragments application code bases as well as limits portability. This paper presents a hardware-accelerated ray tracing rendering engine, fully written in Java, that can seamlessly harness the performance of underlying GPUs via the TornadoVM framework. Through this paper, we show the potential of Java and acceleration frameworks to process in real time a compute intensive application. Our results indicate that it is possible to enable real time ray tracing from Java by achieving up to 234, 152, 45 frames-per-second in 720p, 1080p, and 4K resolutions, respectively. ",
    "url": "https://arxiv.org/abs/2305.07450",
    "authors": [
      "Vinh Pham Van",
      "Juan Fumero",
      "Athanasios Stratikopoulos",
      "Florin Blanaru",
      "Christos Kotselidis"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2305.07494",
    "title": "Temporal Network Creation Games",
    "abstract": "Most networks are not static objects, but instead they change over time. This observation has sparked rigorous research on temporal graphs within the last years. In temporal graphs, we have a fixed set of nodes and the connections between them are only available at certain time steps. This gives rise to a plethora of algorithmic problems on such graphs, most prominently the problem of finding temporal spanners, i.e., the computation of subgraphs that guarantee all pairs reachability via temporal paths. To the best of our knowledge, only centralized approaches for the solution of this problem are known. However, many real-world networks are not shaped by a central designer but instead they emerge and evolve by the interaction of many strategic agents. This observation is the driving force of the recent intensive research on game-theoretic network formation models. In this work we bring together these two recent research directions: temporal graphs and game-theoretic network formation. As a first step into this new realm, we focus on a simplified setting where a complete temporal host graph is given and the agents, corresponding to its nodes, selfishly create incident edges to ensure that they can reach all other nodes via temporal paths in the created network. This yields temporal spanners as equilibria of our game. We prove results on the convergence to and the existence of equilibrium networks, on the complexity of finding best agent strategies, and on the quality of the equilibria. By taking these first important steps, we uncover challenging open problems that call for an in-depth exploration of the creation of temporal graphs by strategic agents. ",
    "url": "https://arxiv.org/abs/2305.07494",
    "authors": [
      "Davide Bilò",
      "Sarel Cohen",
      "Tobias Friedrich",
      "Hans Gawendowicz",
      "Nicolas Klodt",
      "Pascal Lenzner",
      "George Skretas"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Artificial Intelligence (cs.AI)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2305.07495",
    "title": "Gallery Sampling for Robust and Fast Face Identification",
    "abstract": "Deep learning methods have been achieved brilliant results in face recognition. One of the important tasks to improve the performance is to collect and label images as many as possible. However, labeling identities and checking qualities of large image data are difficult task and mistakes cannot be avoided in processing large data. Previous works have been trying to deal with the problem only in training domain, however it can cause much serious problem if the mistakes are in gallery data of face identification. We proposed gallery data sampling methods which are robust to outliers including wrong labeled, low quality, and less-informative images and reduce searching time. The proposed sampling-by-pruning and sampling-by-generating methods significantly improved face identification performance on our 5.4M web image dataset of celebrities. The proposed method achieved 0.0975 in terms of FNIR at FPIR=0.01, while conventional method showed 0.3891. The average number of feature vectors for each individual gallery was reduced to 17.1 from 115.9 and it can provide much faster search. We also made experiments on public datasets and our method achieved 0.1314 and 0.0668 FNIRs at FPIR=0.01 on the CASIA-WebFace and MS1MV2, while the convectional method did 0.5446, and 0.1327, respectively. ",
    "url": "https://arxiv.org/abs/2305.07495",
    "authors": [
      "Myung-cheol Roh",
      "Pyoung-gang Lim",
      "Jongju Shin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07499",
    "title": "Device-Robust Acoustic Scene Classification via Impulse Response  Augmentation",
    "abstract": "The ability to generalize to a wide range of recording devices is a crucial performance factor for audio classification models. The characteristics of different types of microphones introduce distributional shifts in the digitized audio signals due to their varying frequency responses. If this domain shift is not taken into account during training, the model's performance could degrade severely when it is applied to signals recorded by unseen devices. In particular, training a model on audio signals recorded with a small number of different microphones can make generalization to unseen devices difficult. To tackle this problem, we convolve audio signals in the training set with pre-recorded device impulse responses (DIRs) to artificially increase the diversity of recording devices. We systematically study the effect of DIR augmentation on the task of Acoustic Scene Classification using CNNs and Audio Spectrogram Transformers. The results show that DIR augmentation in isolation performs similarly to the state-of-the-art method Freq-MixStyle. However, we also show that DIR augmentation and Freq-MixStyle are complementary, achieving a new state-of-the-art performance on signals recorded by devices unseen during training. ",
    "url": "https://arxiv.org/abs/2305.07499",
    "authors": [
      "Tobias Morocutti",
      "Florian Schmid",
      "Khaled Koutini",
      "Gerhard Widmer"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2305.07500",
    "title": "Beyond invariant representation learning: linearly alignable latent  spaces for efficient closed-form domain adaptation",
    "abstract": "Optimal transport (OT) is a powerful geometric tool used to compare and align probability measures following the least effort principle. Among many successful applications of OT in machine learning (ML), domain adaptation (DA) -- a field of study where the goal is to transfer a classifier from one labelled domain to another similar, yet different unlabelled or scarcely labelled domain -- has been historically among the most investigated ones. This success is due to the ability of OT to provide both a meaningful discrepancy measure to assess the similarity of two domains' distributions and a mapping that can project source domain data onto the target one. In this paper, we propose a principally new OT-based approach applied to DA that uses the closed-form solution of the OT problem given by an affine mapping and learns an embedding space for which this solution is optimal and computationally less complex. We show that our approach works in both homogeneous and heterogeneous DA settings and outperforms or is on par with other famous baselines based on both traditional OT and OT in incomparable spaces. Furthermore, we show that our proposed method vastly reduces computational complexity. ",
    "url": "https://arxiv.org/abs/2305.07500",
    "authors": [
      "Oliver Struckmeier",
      "Ievgen Redko",
      "Anton Mallasto",
      "Karol Arndt",
      "Markus Heinonen",
      "Ville Kyrki"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07521",
    "title": "AGFormer: Efficient Graph Representation with Anchor-Graph Transformer",
    "abstract": "To alleviate the local receptive issue of GCN, Transformers have been exploited to capture the long range dependences of nodes for graph data representation and learning. However, existing graph Transformers generally employ regular self-attention module for all node-to-node message passing which needs to learn the affinities/relationships between all node's pairs, leading to high computational cost issue. Also, they are usually sensitive to graph noises. To overcome this issue, we propose a novel graph Transformer architecture, termed Anchor Graph Transformer (AGFormer), by leveraging an anchor graph model. To be specific, AGFormer first obtains some representative anchors and then converts node-to-node message passing into anchor-to-anchor and anchor-to-node message passing process. Thus, AGFormer performs much more efficiently and also robustly than regular node-to-node Transformers. Extensive experiments on several benchmark datasets demonstrate the effectiveness and benefits of proposed AGFormer. ",
    "url": "https://arxiv.org/abs/2305.07521",
    "authors": [
      "Bo Jiang",
      "Fei Xu",
      "Ziyan Zhang",
      "Jin Tang",
      "Feiping Nie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07522",
    "title": "PillarAcc: Sparse PointPillars Accelerator for Real-Time Point Cloud 3D  Object Detection on Edge Devices",
    "abstract": "3D object detection using point cloud (PC) data is vital for autonomous driving perception pipelines, where efficient encoding is key to meeting stringent resource and latency requirements. PointPillars, a widely adopted bird's-eye view (BEV) encoding, aggregates 3D point cloud data into 2D pillars for high-accuracy 3D object detection. However, most state-of-the-art methods employing PointPillar overlook the inherent sparsity of pillar encoding, missing opportunities for significant computational reduction. In this study, we propose a groundbreaking algorithm-hardware co-design that accelerates sparse convolution processing and maximizes sparsity utilization in pillar-based 3D object detection networks. We investigate sparsification opportunities using an advanced pillar-pruning method, achieving an optimal balance between accuracy and sparsity. We introduce PillarAcc, a state-of-the-art sparsity support mechanism that enhances sparse pillar convolution through linear complexity input-output mapping generation and conflict-free gather-scatter memory access. Additionally, we propose dataflow optimization techniques, dynamically adjusting the pillar processing schedule for optimal hardware utilization under diverse sparsity operations. We evaluate PillarAcc on various cutting-edge 3D object detection networks and benchmarks, achieving remarkable speedup and energy savings compared to representative edge platforms, demonstrating record-breaking PointPillars speed of 500FPS with minimal compromise in accuracy. ",
    "url": "https://arxiv.org/abs/2305.07522",
    "authors": [
      "Minjae Lee",
      "Hyungmin Kim",
      "Seongmin Park",
      "Minyong Yoon",
      "Janghwan Lee",
      "Junwon Choi",
      "Mingu Kang",
      "Jungwook Choi"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07552",
    "title": "Dish detection in food platters: A framework for automated diet logging  and nutrition management",
    "abstract": "Diet is central to the epidemic of lifestyle disorders. Accurate and effortless diet logging is one of the significant bottlenecks for effective diet management and calorie restriction. Dish detection from food platters is a challenging problem due to a visually complex food layout. We present an end-to-end computational framework for diet management, from data compilation, annotation, and state-of-the-art model identification to its mobile app implementation. As a case study, we implement the framework in the context of Indian food platters known for their complex presentation that poses a challenge for the automated detection of dishes. Starting with the 61 most popular Indian dishes, we identify the state-of-the-art model through a comparative analysis of deep-learning-based object detection architectures. Rooted in a meticulous compilation of 68,005 platter images with 134,814 manual dish annotations, we first compare ten architectures for multi-label classification to identify ResNet152 (mAP=84.51%) as the best model. YOLOv8x (mAP=87.70%) emerged as the best model architecture for dish detection among the eight deep-learning models implemented after a thorough performance evaluation. By comparing with the state-of-the-art model for the IndianFood10 dataset, we demonstrate the superior object detection performance of YOLOv8x for this subset and establish Resnet152 as the best architecture for multi-label classification. The models thus trained on richly annotated data can be extended to include dishes from across global cuisines. The proposed framework is demonstrated through a proof-of-concept mobile application with diverse applications for diet logging, food recommendation systems, nutritional interventions, and mitigation of lifestyle disorders. ",
    "url": "https://arxiv.org/abs/2305.07552",
    "authors": [
      "Mansi Goel",
      "Shashank Dargar",
      "Shounak Ghatak",
      "Nidhi Verma",
      "Pratik Chauhan",
      "Anushka Gupta",
      "Nikhila Vishnumolakala",
      "Hareesh Amuru",
      "Ekta Gambhir",
      "Ronak Chhajed",
      "Meenal Jain",
      "Astha Jain",
      "Samiksha Garg",
      "Nitesh Narwade",
      "Nikhilesh Verhwani",
      "Abhuday Tiwari",
      "Kirti Vashishtha",
      "Ganesh Bagler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2305.07571",
    "title": "Supplementing Gradient-Based Reinforcement Learning with Simple  Evolutionary Ideas",
    "abstract": "We present a simple, sample-efficient algorithm for introducing large but directed learning steps in reinforcement learning (RL), through the use of evolutionary operators. The methodology uses a population of RL agents training with a common experience buffer, with occasional crossovers and mutations of the agents in order to search efficiently through the policy space. Unlike prior literature on combining evolutionary search (ES) with RL, this work does not generate a distribution of agents from a common mean and covariance matrix. Neither does it require the evaluation of the entire population of policies at every time step. Instead, we focus on gradient-based training throughout the life of every policy (individual), with a sparse amount of evolutionary exploration. The resulting algorithm is shown to be robust to hyperparameter variations. As a surprising corollary, we show that simply initialising and training multiple RL agents with a common memory (with no further evolutionary updates) outperforms several standard RL baselines. ",
    "url": "https://arxiv.org/abs/2305.07571",
    "authors": [
      "Harshad Khadilkar"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07584",
    "title": "Proactive Content Caching Scheme in Urban Vehicular Networks",
    "abstract": "Stream media content caching is a key enabling technology to promote the value chain of future urban vehicular networks. Nevertheless, the high mobility of vehicles, intermittency of information transmissions, high dynamics of user requests, limited caching capacities and extreme complexity of business scenarios pose an enormous challenge to content caching and distribution in vehicular networks. To tackle this problem, this paper aims to design a novel edge-computing-enabled hierarchical cooperative caching framework. Firstly, we profoundly analyze the spatio-temporal correlation between the historical vehicle trajectory of user requests and construct the system model to predict the vehicle trajectory and content popularity, which lays a foundation for mobility-aware content caching and dispatching. Meanwhile, we probe into privacy protection strategies to realize privacy-preserved prediction model. Furthermore, based on trajectory and popular content prediction results, content caching strategy is studied, and adaptive and dynamic resource management schemes are proposed for hierarchical cooperative caching networks. Finally, simulations are provided to verify the superiority of our proposed scheme and algorithms. It shows that the proposed algorithms effectively improve the performance of the considered system in terms of hit ratio and average delay, and narrow the gap to the optimal caching scheme comparing with the traditional schemes. ",
    "url": "https://arxiv.org/abs/2305.07584",
    "authors": [
      "Biqian Feng",
      "Chenyuan Feng",
      "Daquan Feng",
      "Yongpeng Wu",
      "Xiang-Gen Xia"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.07594",
    "title": "Opti Code Pro: A Heuristic Search-based Approach to Code Refactoring",
    "abstract": "This paper presents an approach that evaluates best-first search methods to code refactoring. The motivation for code refactoring could be to improve the design, structure, or implementation of an existing program without changing its functionality. To solve a very specific problem of coupling and cohesion, we propose using heuristic search-based techniques on an approximation of the full code refactoring problem, to guide the refactoring process toward solutions that have high cohesion and low coupling. We evaluated our approach by providing demonstrative examples of the effectiveness of this approach on random state problems and created a tool to implement the algorithm on Java projects. ",
    "url": "https://arxiv.org/abs/2305.07594",
    "authors": [
      "Sourena Khanzadeh",
      "Samad Alias Nyein Chan",
      "Richard Valenzano",
      "Manar Alalfi"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07598",
    "title": "RHINO: Rotated DETR with Dynamic Denoising via Hungarian Matching for  Oriented Object Detection",
    "abstract": "With the publication of DINO, a variant of the Detection Transformer (DETR), Detection Transformers are breaking the record in the object detection benchmark with the merits of their end-to-end design and scalability. However, the extension of DETR to oriented object detection has not been thoroughly studied although more benefits from its end-to-end architecture are expected such as removing NMS and anchor-related costs. In this paper, we propose a first strong DINO-based baseline for oriented object detection. We found that straightforward employment of DETRs for oriented object detection does not guarantee non-duplicate prediction, and propose a simple cost to mitigate this. Furthermore, we introduce a novel denoising strategy that uses Hungarian matching to filter redundant noised queries and query alignment to preserve matching consistency between Transformer decoder layers. Our proposed model outperforms previous rotated DETRs and other counterparts, achieving state-of-the-art performance in DOTA-v1.0/v1.5/v2.0, and DIOR-R benchmarks. ",
    "url": "https://arxiv.org/abs/2305.07598",
    "authors": [
      "Hakjin Lee",
      "Minki Song",
      "Jamyoung Koo",
      "Junghoon Seo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07602",
    "title": "ViT Unified: Joint Fingerprint Recognition and Presentation Attack  Detection",
    "abstract": "A secure fingerprint recognition system must contain both a presentation attack (i.e., spoof) detection and recognition module in order to protect users against unwanted access by malicious users. Traditionally, these tasks would be carried out by two independent systems; however, recent studies have demonstrated the potential to have one unified system architecture in order to reduce the computational burdens on the system, while maintaining high accuracy. In this work, we leverage a vision transformer architecture for joint spoof detection and matching and report competitive results with state-of-the-art (SOTA) models for both a sequential system (two ViT models operating independently) and a unified architecture (a single ViT model for both tasks). ViT models are particularly well suited for this task as the ViT's global embedding encodes features useful for recognition, whereas the individual, local embeddings are useful for spoof detection. We demonstrate the capability of our unified model to achieve an average integrated matching (IM) accuracy of 98.87% across LivDet 2013 and 2015 CrossMatch sensors. This is comparable to IM accuracy of 98.95% of our sequential dual-ViT system, but with ~50% of the parameters and ~58% of the latency. ",
    "url": "https://arxiv.org/abs/2305.07602",
    "authors": [
      "Steven A. Grosz",
      "Kanishka P. Wijewardena",
      "Anil K. Jain"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.07614",
    "title": "NevIR: Negation in Neural Information Retrieval",
    "abstract": "Negation is a common everyday phenomena and has been a consistent area of weakness for language models (LMs). Although the Information Retrieval (IR) community has adopted LMs as the backbone of modern IR architectures, there has been little to no research in understanding how negation impacts neural IR. We therefore construct a straightforward benchmark on this theme: asking IR models to rank two documents that differ only by negation. We show that the results vary widely according to the type of IR architecture: cross-encoders perform best, followed by late-interaction models, and in last place are bi-encoder and sparse neural architectures. We find that most current information retrieval models do not consider negation, performing similarly or worse than randomly ranking. We show that although the obvious approach of continued fine-tuning on a dataset of contrastive documents containing negations increases performance (as does model size), there is still a large gap between machine and human performance. ",
    "url": "https://arxiv.org/abs/2305.07614",
    "authors": [
      "Orion Weller",
      "Dawn Lawrie",
      "Benjamin Van Durme"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.07632",
    "title": "Design, Development, and Evaluation of an Interactive Personalized  Social Robot to Monitor and Coach Post-Stroke Rehabilitation Exercises",
    "abstract": "Socially assistive robots are increasingly being explored to improve the engagement of older adults and people with disability in health and well-being-related exercises. However, even if people have various physical conditions, most prior work on social robot exercise coaching systems has utilized generic, predefined feedback. The deployment of these systems still remains a challenge. In this paper, we present our work of iteratively engaging therapists and post-stroke survivors to design, develop, and evaluate a social robot exercise coaching system for personalized rehabilitation. Through interviews with therapists, we designed how this system interacts with the user and then developed an interactive social robot exercise coaching system. This system integrates a neural network model with a rule-based model to automatically monitor and assess patients' rehabilitation exercises and can be tuned with individual patient's data to generate real-time, personalized corrective feedback for improvement. With the dataset of rehabilitation exercises from 15 post-stroke survivors, we demonstrated our system significantly improves its performance to assess patients' exercises while tuning with held-out patient's data. In addition, our real-world evaluation study showed that our system can adapt to new participants and achieved 0.81 average performance to assess their exercises, which is comparable to the experts' agreement level. We further discuss the potential benefits and limitations of our system in practice. ",
    "url": "https://arxiv.org/abs/2305.07632",
    "authors": [
      "Min Hun Lee",
      "Daniel P. Siewiorek",
      "Asim Smailagic",
      "Alexandre Bernardino",
      "Sergi Bermúdez i Badia"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2305.07633",
    "title": "Zero-shot Item-based Recommendation via Multi-task Product Knowledge  Graph Pre-Training",
    "abstract": "Existing recommender systems face difficulties with zero-shot items, i.e. items that have no historical interactions with users during the training stage. Though recent works extract universal item representation via pre-trained language models (PLMs), they ignore the crucial item relationships. This paper presents a novel paradigm for the Zero-Shot Item-based Recommendation (ZSIR) task, which pre-trains a model on product knowledge graph (PKG) to refine the item features from PLMs. We identify three challenges for pre-training PKG, which are multi-type relations in PKG, semantic divergence between item generic information and relations and domain discrepancy from PKG to downstream ZSIR task. We address the challenges by proposing four pre-training tasks and novel task-oriented adaptation (ToA) layers. Moreover, this paper discusses how to fine-tune the model on new recommendation task such that the ToA layers are adapted to ZSIR task. Comprehensive experiments on 18 markets dataset are conducted to verify the effectiveness of the proposed model in both knowledge prediction and ZSIR task. ",
    "url": "https://arxiv.org/abs/2305.07633",
    "authors": [
      "Ziwei Fan",
      "Zhiwei Liu",
      "Shelby Heinecke",
      "Jianguo Zhang",
      "Huan Wang",
      "Caiming Xiong",
      "Philip S. Yu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07639",
    "title": "Efficient Neural Network based Classification and Outlier Detection for  Image Moderation using Compressed Sensing and Group Testing",
    "abstract": "Popular social media platforms employ neural network based image moderation engines to classify images uploaded on them as having potentially objectionable content. Such moderation engines must answer a large number of queries with heavy computational cost, even though the actual number of images with objectionable content is usually a tiny fraction. Inspired by recent work on Neural Group Testing, we propose an approach which exploits this fact to reduce the overall computational cost of such engines using the technique of Compressed Sensing (CS). We present the quantitative matrix-pooled neural network (QMPNN), which takes as input $n$ images, and a $m \\times n$ binary pooling matrix with $m < n$, whose rows indicate $m$ pools of images i.e. selections of $r$ images out of $n$. The QMPNN efficiently outputs the product of this matrix with the unknown sparse binary vector indicating whether each image is objectionable or not, i.e. it outputs the number of objectionable images in each pool. For suitable matrices, this is decoded using CS decoding algorithms to predict which images were objectionable. The computational cost of running the QMPNN and the CS algorithms is significantly lower than the cost of using a neural network with the same number of parameters separately on each image to classify the images, which we demonstrate via extensive experiments. Our technique is inherently resilient to moderate levels of errors in the prediction from the QMPNN. Furthermore, we present pooled deep outlier detection, which brings CS and group testing techniques to deep outlier detection, to provide for the case when the objectionable images do not belong to a set of pre-defined classes. This technique enables efficient automated moderation of off-topic images shared on topical forums dedicated to sharing images of a certain single class, many of which are currently human-moderated. ",
    "url": "https://arxiv.org/abs/2305.07639",
    "authors": [
      "Sabyasachi Ghosh",
      "Sanyam Saxena",
      "Ajit Rajwade"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07648",
    "title": "A Critical View Of Vision-Based Long-Term Dynamics Prediction Under  Environment Misalignment",
    "abstract": "Dynamics prediction, which is the problem of predicting future states of scene objects based on current and prior states, is drawing increasing attention as an instance of learning physics. To solve this problem, Region Proposal Convolutional Interaction Network (RPCIN), a vision-based model, was proposed and achieved state-of-the-art performance in long-term prediction. RPCIN only takes raw images and simple object descriptions, such as the bounding box and segmentation mask of each object, as input. However, despite its success, the model's capability can be compromised under conditions of environment misalignment. In this paper, we investigate two challenging conditions for environment misalignment: Cross-Domain and Cross-Context by proposing four datasets that are designed for these challenges: SimB-Border, SimB-Split, BlenB-Border, and BlenB-Split. The datasets cover two domains and two contexts. Using RPCIN as a probe, experiments conducted on the combinations of the proposed datasets reveal potential weaknesses of the vision-based long-term dynamics prediction model. Furthermore, we propose a promising direction to mitigate the Cross-Domain challenge and provide concrete evidence supporting such a direction, which provides dramatic alleviation of the challenge on the proposed datasets. ",
    "url": "https://arxiv.org/abs/2305.07648",
    "authors": [
      "Hanchen Xie",
      "Jiageng Zhu",
      "Mahyar Khayatkhoei",
      "Jiazhi Li",
      "Mohamed E. Hussein",
      "Wael AbdAlmgaeed"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.07038",
    "title": "Revealing Patterns of Symptomatology in Parkinson's Disease: A Latent  Space Analysis with 3D Convolutional Autoencoders",
    "abstract": "This work proposes the use of 3D convolutional variational autoencoders (CVAEs) to trace the changes and symptomatology produced by neurodegeneration in Parkinson's disease (PD). In this work, we present a novel approach to detect and quantify changes in dopamine transporter (DaT) concentration and its spatial patterns using 3D CVAEs on Ioflupane (FPCIT) imaging. Our approach leverages the power of deep learning to learn a low-dimensional representation of the brain imaging data, which then is linked to different symptom categories using regression algorithms. We demonstrate the effectiveness of our approach on a dataset of PD patients and healthy controls, and show that general symptomatology (UPDRS) is linked to a d-dimensional decomposition via the CVAE with R2>0.25. Our work shows the potential of representation learning not only in early diagnosis but in understanding neurodegeneration processes and symptomatology. ",
    "url": "https://arxiv.org/abs/2305.07038",
    "authors": [
      "E. Delgado de las Heras",
      "F.J. Martinez-Murcia",
      "I.A. Illán",
      "C. Jiménez-Mesa",
      "D. Castillo-Barnes",
      "J. Ramírez",
      "J.M. Górriz"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07089",
    "title": "HINT: Hierarchical Mixture Networks For Coherent Probabilistic  Forecasting",
    "abstract": "We present the Hierarchical Mixture Networks (HINT), a model family for efficient and accurate coherent forecasting. We specialize the networks on the task via a multivariate mixture optimized with composite likelihood and made coherent via bootstrap reconciliation. Additionally, we robustify the networks to stark time series scale variations, incorporating normalized feature extraction and recomposition of output scales within their architecture. We demonstrate 8% sCRPS improved accuracy across five datasets compared to the existing state-of-the-art. We conduct ablation studies on our model's components and extensively investigate the theoretical properties of the multivariate mixture. HINT's code is available at this https://github.com/Nixtla/neuralforecast. ",
    "url": "https://arxiv.org/abs/2305.07089",
    "authors": [
      "Kin G. Olivares",
      "David Luo",
      "Cristian Challu",
      "Stefania La Vattiata",
      "Max Mergenthaler",
      "Artur Dubrawski"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2305.07145",
    "title": "Enhancing Petrophysical Studies with Machine Learning: A Field Case  Study on Permeability Prediction in Heterogeneous Reservoirs",
    "abstract": "This field case study aims to address the challenge of accurately predicting petrophysical properties in heterogeneous reservoir formations, which can significantly impact reservoir performance predictions. The study employed three machine learning algorithms, namely Artificial Neural Network (ANN), Random Forest Classifier (RFC), and Support Vector Machine (SVM), to predict permeability log from conventional logs and match it with core data. The primary objective of this study was to compare the effectiveness of the three machine learning algorithms in predicting permeability and determine the optimal prediction method. The study utilized the Flow Zone Indicator (FZI) rock typing technique to understand the factors influencing reservoir quality. The findings will be used to improve reservoir simulation and locate future wells more accurately. The study concluded that the FZI approach and machine learning algorithms are effective in predicting permeability log and improving reservoir performance predictions. ",
    "url": "https://arxiv.org/abs/2305.07145",
    "authors": [
      "Fethi Ali Cheddad"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07204",
    "title": "Multi-level Temporal-channel Speaker Retrieval for Robust Zero-shot  Voice Conversion",
    "abstract": "Zero-shot voice conversion (VC) converts source speech into the voice of any desired speaker using only one utterance of the speaker without requiring additional model updates. Typical methods use a speaker representation from a pre-trained speaker verification (SV) model or learn speaker representation during VC training to achieve zero-shot VC. However, existing speaker modeling methods overlook the variation of speaker information richness in temporal and frequency channel dimensions of speech. This insufficient speaker modeling hampers the ability of the VC model to accurately represent unseen speakers who are not in the training dataset. In this study, we present a robust zero-shot VC model with multi-level temporal-channel retrieval, referred to as MTCR-VC. Specifically, to flexibly adapt to the dynamic-variant speaker characteristic in the temporal and channel axis of the speech, we propose a novel fine-grained speaker modeling method, called temporal-channel retrieval (TCR), to find out when and where speaker information appears in speech. It retrieves variable-length speaker representation from both temporal and channel dimensions under the guidance of a pre-trained SV model. Besides, inspired by the hierarchical process of human speech production, the MTCR speaker module stacks several TCR blocks to extract speaker representations from multi-granularity levels. Furthermore, to achieve better speech disentanglement and reconstruction, we introduce a cycle-based training strategy to simulate zero-shot inference recurrently. We adopt perpetual constraints on three aspects, including content, style, and speaker, to drive this process. Experiments demonstrate that MTCR-VC is superior to the previous zero-shot VC methods in modeling speaker timbre while maintaining good speech naturalness. ",
    "url": "https://arxiv.org/abs/2305.07204",
    "authors": [
      "Zhichao Wang",
      "Liumeng Xue",
      "Qiuqiang Kong",
      "Lei Xie",
      "Yuanzhe Chen",
      "Qiao Tian",
      "Yuping Wang"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2305.07344",
    "title": "A Bayesian Approach to Characterize Unknown Interference Power in  Wireless Networks",
    "abstract": "The existence of unknown interference is a prevalent problem in wireless communication networks. Especially in multi-user multiple-input multiple-output (MIMO) networks, where a large number of user equipments are served on the same time-frequency resources, the outage performance may be dominated by the unknown interference arising from scheduling variations in neighboring cells. In this letter, we propose a Bayesian method for modeling the unknown interference power in the uplink of a cellular network. Numerical results show that our method accurately models the distribution of the unknown interference power and can be effectively used for rate adaptation with guaranteed target outage performance. ",
    "url": "https://arxiv.org/abs/2305.07344",
    "authors": [
      "Mahmoud Zaher",
      "Emil Björnson",
      "Marina Petrova"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2305.07385",
    "title": "Spatial correlations in the qubit properties of D-Wave 2000Q measured  and simulated qubit networks",
    "abstract": "We show strong positive spatial correlations in the qubits of a D-Wave 2000Q quantum annealing chip that are connected to qubits outside their own unit cell. By simulating the dynamics of spin networks, we then show that correlation between nodes is affected by a number of factors. The different connectivity of qubits within the network means that information transfer is not straightforward even when all the qubit-qubit couplings have equal weighting. The similarity between connected nodes is further changed when the couplings' strength is scaled according to the physical length of the connections (here to simulate dipole-dipole interactions). This highlights the importance of understanding the architectural features and potentially unprogrammed interactions/connections that can divert the performance of a quantum system away from the idealised model of identical qubits and couplings across the chip. ",
    "url": "https://arxiv.org/abs/2305.07385",
    "authors": [
      "Jessica Park",
      "Susan Stepney",
      "Irene D'Amico"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2305.07446",
    "title": "A Lightweight Domain Adversarial Neural Network Based on Knowledge  Distillation for EEG-based Cross-subject Emotion Recognition",
    "abstract": "Individual differences of Electroencephalogram (EEG) could cause the domain shift which would significantly degrade the performance of cross-subject strategy. The domain adversarial neural networks (DANN), where the classification loss and domain loss jointly update the parameters of feature extractor, are adopted to deal with the domain shift. However, limited EEG data quantity and strong individual difference are challenges for the DANN with cumbersome feature extractor. In this work, we propose knowledge distillation (KD) based lightweight DANN to enhance cross-subject EEG-based emotion recognition. Specifically, the teacher model with strong context learning ability is utilized to learn complex temporal dynamics and spatial correlations of EEG, and robust lightweight student model is guided by the teacher model to learn more difficult domain-invariant features. In the feature-based KD framework, a transformer-based hierarchical temporalspatial learning model is served as the teacher model. The student model, which is composed of Bi-LSTM units, is a lightweight version of the teacher model. Hence, the student model could be supervised to mimic the robust feature representations of teacher model by leveraging complementary latent temporal features and spatial features. In the DANN-based cross-subject emotion recognition, we combine the obtained student model and a lightweight temporal-spatial feature interaction module as the feature extractor. And the feature aggregation is fed to the emotion classifier and domain classifier for domain-invariant feature learning. To verify the effectiveness of the proposed method, we conduct the subject-independent experiments on the public dataset DEAP with arousal and valence classification. The outstanding performance and t-SNE visualization of latent features verify the advantage and effectiveness of the proposed method. ",
    "url": "https://arxiv.org/abs/2305.07446",
    "authors": [
      "Zhe Wang",
      "Yongxiong Wang",
      "Jiapeng Zhang",
      "Yiheng Tang",
      "Zhiqun Pan"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.07524",
    "title": "Joint MR sequence optimization beats pure neural network approaches for  spin-echo MRI super-resolution",
    "abstract": "Current MRI super-resolution (SR) methods only use existing contrasts acquired from typical clinical sequences as input for the neural network (NN). In turbo spin echo sequences (TSE) the sequence parameters can have a strong influence on the actual resolution of the acquired image and have consequently a considera-ble impact on the performance of the NN. We propose a known-operator learning approach to perform an end-to-end optimization of MR sequence and neural net-work parameters for SR-TSE. This MR-physics-informed training procedure jointly optimizes the radiofrequency pulse train of a proton density- (PD-) and T2-weighted TSE and a subsequently applied convolutional neural network to predict the corresponding PDw and T2w super-resolution TSE images. The found radiofrequency pulse train designs generate an optimal signal for the NN to perform the SR task. Our method generalizes from the simulation-based optimi-zation to in vivo measurements and the acquired physics-informed SR images show higher correlation with a time-consuming segmented high-resolution TSE sequence compared to a pure network training approach. ",
    "url": "https://arxiv.org/abs/2305.07524",
    "authors": [
      "Hoai Nam Dang",
      "Vladimir Golkov",
      "Thomas Wimmer",
      "Daniel Cremers",
      "Andreas Maier",
      "Moritz Zaiss"
    ],
    "subjectives": [
      "Medical Physics (physics.med-ph)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07580",
    "title": "Fisher Information Embedding for Node and Graph Learning",
    "abstract": "Attention-based graph neural networks (GNNs), such as graph attention networks (GATs), have become popular neural architectures for processing graph-structured data and learning node embeddings. Despite their empirical success, these models rely on labeled data and the theoretical properties of these models have yet to be fully understood. In this work, we propose a novel attention-based node embedding framework for graphs. Our framework builds upon a hierarchical kernel for multisets of subgraphs around nodes (e.g. neighborhoods) and each kernel leverages the geometry of a smooth statistical manifold to compare pairs of multisets, by \"projecting\" the multisets onto the manifold. By explicitly computing node embeddings with a manifold of Gaussian mixtures, our method leads to a new attention mechanism for neighborhood aggregation. We provide theoretical insights into genralizability and expressivity of our embeddings, contributing to a deeper understanding of attention-based GNNs. We propose efficient unsupervised and supervised methods for learning the embeddings, with the unsupervised method not requiring any labeled data. Through experiments on several node classification benchmarks, we demonstrate that our proposed method outperforms existing attention-based graph models like GATs. Our code is available at https://github.com/BorgwardtLab/fisher_information_embedding. ",
    "url": "https://arxiv.org/abs/2305.07580",
    "authors": [
      "Dexiong Chen",
      "Paolo Pellizzoni",
      "Karsten Borgwardt"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.00327",
    "title": "Orthonormal Product Quantization Network for Scalable Face Image  Retrieval",
    "abstract": " Comments: Published in Pattern Recognition, supplementary material can be found in Github project page ",
    "url": "https://arxiv.org/abs/2107.00327",
    "authors": [
      "Ming Zhang",
      "Xuefei Zhe",
      "Hong Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.08123",
    "title": "Neural Étendue Expander for Ultra-Wide-Angle High-Fidelity  Holographic Display",
    "abstract": " Title: Neural Étendue Expander for Ultra-Wide-Angle High-Fidelity  Holographic Display ",
    "url": "https://arxiv.org/abs/2109.08123",
    "authors": [
      "Ethan Tseng",
      "Seung-Hwan Baek",
      "Grace Kuo",
      "Nathan Matsuda",
      "Andrew Maimone",
      "Praneeth Chakravarthula",
      "Qiang Fu",
      "Wolfgang Heidrich",
      "Douglas Lanman",
      "Felix Heide"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2201.07577",
    "title": "Models for information propagation on graphs",
    "abstract": " Title: Models for information propagation on graphs ",
    "url": "https://arxiv.org/abs/2201.07577",
    "authors": [
      "Oliver R. A. Dunbar",
      "Charles M. Elliott",
      "Lisa Maria Kreusser"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Analysis of PDEs (math.AP)"
    ]
  },
  {
    "id": "arXiv:2203.06006",
    "title": "Edge and Pair Queries -- Random Graphs and Complexity",
    "abstract": " Comments: 23 pages ",
    "url": "https://arxiv.org/abs/2203.06006",
    "authors": [
      "Dariusz Dereniowski",
      "Przemysław Gordinowicz",
      "Paweł Prałat"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2205.07877",
    "title": "A Comprehensive Survey on Model Quantization for Deep Neural Networks",
    "abstract": " Comments: We have corrected the names of during-training quantization and after-training quantization We have modified the structure of the paper The discussion of some important topics in quantization has been extended We have investigated some new and important references in the current manuscript ",
    "url": "https://arxiv.org/abs/2205.07877",
    "authors": [
      "Babak Rokh",
      "Ali Azarpeyvand",
      "Alireza Khanteymoori"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.02578",
    "title": "SimLM: Pre-training with Representation Bottleneck for Dense Passage  Retrieval",
    "abstract": " Comments: Accepted to ACL 2023 ",
    "url": "https://arxiv.org/abs/2207.02578",
    "authors": [
      "Liang Wang",
      "Nan Yang",
      "Xiaolong Huang",
      "Binxing Jiao",
      "Linjun Yang",
      "Daxin Jiang",
      "Rangan Majumder",
      "Furu Wei"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2209.05208",
    "title": "Graph Neural Modeling of Network Flows",
    "abstract": " Title: Graph Neural Modeling of Network Flows ",
    "url": "https://arxiv.org/abs/2209.05208",
    "authors": [
      "Victor-Alexandru Darvariu",
      "Stephen Hailes",
      "Mirco Musolesi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2211.03796",
    "title": "Astronomia ex machina: a history, primer, and outlook on neural networks  in astronomy",
    "abstract": " Comments: 75 pages, 327 references, 32 figures. Review accepted in Royal Society Open Science ",
    "url": "https://arxiv.org/abs/2211.03796",
    "authors": [
      "Michael J. Smith",
      "James E. Geach"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.15301",
    "title": "Learning Coherent Clusters in Weakly-Connected Network Systems",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2209.13701 ",
    "url": "https://arxiv.org/abs/2211.15301",
    "authors": [
      "Hancheng Min",
      "Enrique Mallada"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2212.10011",
    "title": "PLUE: Language Understanding Evaluation Benchmark for Privacy Policies  in English",
    "abstract": " Comments: ACL 2023. Code is released at this https URL ",
    "url": "https://arxiv.org/abs/2212.10011",
    "authors": [
      "Jianfeng Chi",
      "Wasi Uddin Ahmad",
      "Yuan Tian",
      "Kai-Wei Chang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.02947",
    "title": "GPS++: Reviving the Art of Message Passing for Molecular Property  Prediction",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2212.02229 ",
    "url": "https://arxiv.org/abs/2302.02947",
    "authors": [
      "Dominic Masters",
      "Josef Dean",
      "Kerstin Klaser",
      "Zhiyi Li",
      "Sam Maddrell-Mander",
      "Adam Sanders",
      "Hatem Helal",
      "Deniz Beker",
      "Andrew Fitzgibbon",
      "Shenyang Huang",
      "Ladislav Rampášek",
      "Dominique Beaini"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.04759",
    "title": "Robust and Scalable Bayesian Online Changepoint Detection",
    "abstract": " Title: Robust and Scalable Bayesian Online Changepoint Detection ",
    "url": "https://arxiv.org/abs/2302.04759",
    "authors": [
      "Matias Altamirano",
      "François-Xavier Briol",
      "Jeremias Knoblauch"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06019",
    "title": "A Correct-and-Certify Approach to Self-Supervise Object Pose Estimators  via Ensemble Self-Training",
    "abstract": " Title: A Correct-and-Certify Approach to Self-Supervise Object Pose Estimators  via Ensemble Self-Training ",
    "url": "https://arxiv.org/abs/2302.06019",
    "authors": [
      "Jingnan Shi",
      "Rajat Talak",
      "Dominic Maggio",
      "Luca Carlone"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.07260",
    "title": "Scalable Bayesian optimization with high-dimensional outputs using  randomized prior networks",
    "abstract": " Comments: 18 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2302.07260",
    "authors": [
      "Mohamed Aziz Bhouri",
      "Michael Joly",
      "Robert Yu",
      "Soumalya Sarkar",
      "Paris Perdikaris"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.08070",
    "title": "Local Causal Discovery for Estimating Causal Effects",
    "abstract": " Comments: Accepted at CLeaR 2023 ",
    "url": "https://arxiv.org/abs/2302.08070",
    "authors": [
      "Shantanu Gupta",
      "David Childers",
      "Zachary C. Lipton"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2302.14452",
    "title": "An Effective Crop-Paste Pipeline for Few-shot Object Detection",
    "abstract": " Title: An Effective Crop-Paste Pipeline for Few-shot Object Detection ",
    "url": "https://arxiv.org/abs/2302.14452",
    "authors": [
      "Shaobo Lin",
      "Kun Wang",
      "Xingyu Zeng",
      "Rui Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.01123",
    "title": "Self-Supervised Depth Correction of Lidar Measurements from Map  Consistency Loss",
    "abstract": " Comments: Submitted to RA-L: this https URL ",
    "url": "https://arxiv.org/abs/2303.01123",
    "authors": [
      "Ruslan Agishev",
      "Tomáš Pětříček",
      "Karel Zimmermann"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2303.01486",
    "title": "Understanding plasticity in neural networks",
    "abstract": " Comments: Accepted to ICML 2023 ",
    "url": "https://arxiv.org/abs/2303.01486",
    "authors": [
      "Clare Lyle",
      "Zeyu Zheng",
      "Evgenii Nikishin",
      "Bernardo Avila Pires",
      "Razvan Pascanu",
      "Will Dabney"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.06060",
    "title": "Deep Spiking Neural Networks with High Representation Similarity Model  Visual Pathways of Macaque and Mouse",
    "abstract": " Comments: Accepted by Proceedings of the 37th AAAI Conference on Artificial Intelligence (AAAI-23) ",
    "url": "https://arxiv.org/abs/2303.06060",
    "authors": [
      "Liwei Huang",
      "Zhengyu Ma",
      "Liutao Yu",
      "Huihui Zhou",
      "Yonghong Tian"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2303.13221",
    "title": "Explore the Power of Synthetic Data on Few-shot Object Detection",
    "abstract": " Title: Explore the Power of Synthetic Data on Few-shot Object Detection ",
    "url": "https://arxiv.org/abs/2303.13221",
    "authors": [
      "Shaobo Lin",
      "Kun Wang",
      "Xingyu Zeng",
      "Rui Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03692",
    "title": "Sound Dynamic Deadlock Prediction in Linear Time",
    "abstract": " Title: Sound Dynamic Deadlock Prediction in Linear Time ",
    "url": "https://arxiv.org/abs/2304.03692",
    "authors": [
      "Hünkar Can Tunç",
      "Umang Mathur",
      "Andreas Pavlogiannis",
      "Mahesh Viswanathan"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2304.05379",
    "title": "Design and Analysis of Index codes for 3-Group NOMA in Vehicular Adhoc  Networks",
    "abstract": " Comments: 16 pages and 3 figures. One figure added and presentation improved ",
    "url": "https://arxiv.org/abs/2304.05379",
    "authors": [
      "Sai Pavan Deekshitula",
      "B. Sundar Rajan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2304.06715",
    "title": "Evaluating the Robustness of Interpretability Methods through  Explanation Invariance and Equivariance",
    "abstract": " Comments: 33 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2304.06715",
    "authors": [
      "Jonathan Crabbé",
      "Mihaela van der Schaar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2304.08914",
    "title": "A Study of Neural Collapse Phenomenon: Grassmannian Frame, Symmetry and  Generalization",
    "abstract": " Comments: 25 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2304.08914",
    "authors": [
      "Peifeng Gao",
      "Qianqian Xu",
      "Peisong Wen",
      "Huiyang Shao",
      "Zhiyong Yang",
      "Qingming Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.09015",
    "title": "PaTeCon: A Pattern-Based Temporal Constraint Mining Method for Conflict  Detection on Knowledge Graphs",
    "abstract": " Comments: Accepted by AAAI23 ",
    "url": "https://arxiv.org/abs/2304.09015",
    "authors": [
      "Jianhao Chen",
      "Junyang Ren",
      "Wentao Ding",
      "Yuzhong Qu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.10305",
    "title": "Feature-compatible Progressive Learning for Video Copy Detection",
    "abstract": " Comments: The second place solutions for both tracks of Meta AI Video Similarity Challenge (VSC22), CVPR 2023 ",
    "url": "https://arxiv.org/abs/2304.10305",
    "authors": [
      "Wenhao Wang",
      "Yifan Sun",
      "Yi Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.14636",
    "title": "PreNAS: Preferred One-Shot Learning Towards Efficient Neural  Architecture Search",
    "abstract": " Comments: Accepted by ICML 2023 ",
    "url": "https://arxiv.org/abs/2304.14636",
    "authors": [
      "Haibin Wang",
      "Ce Ge",
      "Hesen Chen",
      "Xiuyu Sun"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2305.01139",
    "title": "Stratified Adversarial Robustness with Rejection",
    "abstract": " Comments: Paper published at International Conference on Machine Learning (ICML'23) ",
    "url": "https://arxiv.org/abs/2305.01139",
    "authors": [
      "Jiefeng Chen",
      "Jayaram Raghuram",
      "Jihye Choi",
      "Xi Wu",
      "Yingyu Liang",
      "Somesh Jha"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.01777",
    "title": "Representation Learning via Manifold Flattening and Reconstruction",
    "abstract": " Comments: 43 pages, 19 figures ",
    "url": "https://arxiv.org/abs/2305.01777",
    "authors": [
      "Michael Psenka",
      "Druv Pai",
      "Vishal Raman",
      "Shankar Sastry",
      "Yi Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Differential Geometry (math.DG)"
    ]
  },
  {
    "id": "arXiv:2305.02422",
    "title": "GAMIVAL: Video Quality Prediction on Mobile Cloud Gaming Content",
    "abstract": " Comments: Accepted to IEEE SPL 2023. The implementation of GAMIVAL has been made available online: this https URL ",
    "url": "https://arxiv.org/abs/2305.02422",
    "authors": [
      "Yu-Chih Chen",
      "Avinab Saha",
      "Chase Davis",
      "Bo Qiu",
      "Xiaoming Wang",
      "Rahul Gowda",
      "Ioannis Katsavounidis",
      "Alan C. Bovik"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2305.02854",
    "title": "Distributed Construction of Near-Optimal Compact Routing Schemes for  Planar Graphs",
    "abstract": " Title: Distributed Construction of Near-Optimal Compact Routing Schemes for  Planar Graphs ",
    "url": "https://arxiv.org/abs/2305.02854",
    "authors": [
      "Jinfeng Dou",
      "Thorsten Götte",
      "Henning Hillebrandt",
      "Christian Scheideler",
      "Julian Werthmann"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2305.05888",
    "title": "Distribution-Flexible Subset Quantization for Post-Quantizing  Super-Resolution Networks",
    "abstract": " Title: Distribution-Flexible Subset Quantization for Post-Quantizing  Super-Resolution Networks ",
    "url": "https://arxiv.org/abs/2305.05888",
    "authors": [
      "Yunshan Zhong",
      "Mingbao Lin",
      "Jingjing Xie",
      "Yuxin Zhang",
      "Fei Chao",
      "Rongrong Ji"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06026",
    "title": "Search for the UGLE Truth: An Investigation into Unsupervised GNN  Learning Environments",
    "abstract": " Title: Search for the UGLE Truth: An Investigation into Unsupervised GNN  Learning Environments ",
    "url": "https://arxiv.org/abs/2305.06026",
    "authors": [
      "Will Leeney",
      "Ryan McConville"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.06141",
    "title": "Active Semantic Localization with Graph Neural Embedding",
    "abstract": " Comments: 7 pages, 5 figures, 1 table ",
    "url": "https://arxiv.org/abs/2305.06141",
    "authors": [
      "Mitsuki Yoshida",
      "Kanji Tanaka",
      "Ryogo Yamamoto",
      "Daiki Iwata"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.06435",
    "title": "Phase transitions in the mini-batch size for sparse and dense neural  networks",
    "abstract": " Comments: 15 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2305.06435",
    "authors": [
      "Raffaele Marino",
      "Federico Ricci-Tersenghi"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  }
]