[
  {
    "id": "arXiv:2403.03222",
    "title": "Knowledge-guided EEG Representation Learning",
    "abstract": "Self-supervised learning has produced impressive results in multimedia domains of audio, vision and speech. This paradigm is equally, if not more, relevant for the domain of biosignals, owing to the scarcity of labelled data in such scenarios. The ability to leverage large-scale unlabelled data to learn robust representations could help improve the performance of numerous inference tasks on biosignals. Given the inherent domain differences between multimedia modalities and biosignals, the established objectives for self-supervised learning may not translate well to this domain. Hence, there is an unmet need to adapt these methods to biosignal analysis. In this work we propose a self-supervised model for EEG, which provides robust performance and remarkable parameter efficiency by using state space-based deep learning architecture. We also propose a novel knowledge-guided pre-training objective that accounts for the idiosyncrasies of the EEG signal. The results indicate improved embedding representation learning and downstream performance compared to prior works on exemplary tasks. Also, the proposed objective significantly reduces the amount of pre-training data required to obtain performance equivalent to prior works. ",
    "url": "https://arxiv.org/abs/2403.03222",
    "authors": [
      "Aditya Kommineni",
      "Kleanthis Avramidis",
      "Richard Leahy",
      "Shrikanth Narayanan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.03223",
    "title": "Exact Enforcement of Temporal Continuity in Sequential Physics-Informed  Neural Networks",
    "abstract": "The use of deep learning methods in scientific computing represents a potential paradigm shift in engineering problem solving. One of the most prominent developments is Physics-Informed Neural Networks (PINNs), in which neural networks are trained to satisfy partial differential equations (PDEs) and/or observed data. While this method shows promise, the standard version has been shown to struggle in accurately predicting the dynamic behavior of time-dependent problems. To address this challenge, methods have been proposed that decompose the time domain into multiple segments, employing a distinct neural network in each segment and directly incorporating continuity between them in the loss function of the minimization problem. In this work we introduce a method to exactly enforce continuity between successive time segments via a solution ansatz. This hard constrained sequential PINN (HCS-PINN) method is simple to implement and eliminates the need for any loss terms associated with temporal continuity. The method is tested for a number of benchmark problems involving both linear and non-linear PDEs. Examples include various first order time dependent problems in which traditional PINNs struggle, namely advection, Allen-Cahn, and Korteweg-de Vries equations. Furthermore, second and third order time-dependent problems are demonstrated via wave and Jerky dynamics examples, respectively. Notably, the Jerky dynamics problem is chaotic, making the problem especially sensitive to temporal accuracy. The numerical experiments conducted with the proposed method demonstrated superior convergence and accuracy over both traditional PINNs and the soft-constrained counterparts. ",
    "url": "https://arxiv.org/abs/2403.03223",
    "authors": [
      "Pratanu Roy",
      "Stephen Castonguay"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2403.03241",
    "title": "A Deep Learning Framework for Wireless Radiation Field Reconstruction  and Channel Prediction",
    "abstract": "We present NeWRF, a deep learning framework for predicting wireless channels. Wireless channel prediction is a long-standing problem in the wireless community and is a key technology for improving the coverage of wireless network deployments. Today, a wireless deployment is evaluated by a site survey which is a cumbersome process requiring an experienced engineer to perform extensive channel measurements. To reduce the cost of site surveys, we develop NeWRF, which is based on recent advances in Neural Radiance Fields (NeRF). NeWRF trains a neural network model with a sparse set of channel measurements, and predicts the wireless channel accurately at any location in the site. We introduce a series of techniques that integrate wireless propagation properties into the NeRF framework to account for the fundamental differences between the behavior of light and wireless signals. We conduct extensive evaluations of our framework and show that our approach can accurately predict channels at unvisited locations with significantly lower measurement density than prior state-of-the-art ",
    "url": "https://arxiv.org/abs/2403.03241",
    "authors": [
      "Haofan Lu",
      "Christopher Vattheuer",
      "Baharan Mirzasoleiman",
      "Omid Abari"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2403.03292",
    "title": "Averaging Rate Scheduler for Decentralized Learning on Heterogeneous  Data",
    "abstract": "State-of-the-art decentralized learning algorithms typically require the data distribution to be Independent and Identically Distributed (IID). However, in practical scenarios, the data distribution across the agents can have significant heterogeneity. In this work, we propose averaging rate scheduling as a simple yet effective way to reduce the impact of heterogeneity in decentralized learning. Our experiments illustrate the superiority of the proposed method (~3% improvement in test accuracy) compared to the conventional approach of employing a constant averaging rate. ",
    "url": "https://arxiv.org/abs/2403.03292",
    "authors": [
      "Sai Aparna Aketi",
      "Sakshi Choudhary",
      "Kaushik Roy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2403.03333",
    "title": "Solution Simplex Clustering for Heterogeneous Federated Learning",
    "abstract": "We tackle a major challenge in federated learning (FL) -- achieving good performance under highly heterogeneous client distributions. The difficulty partially arises from two seemingly contradictory goals: learning a common model by aggregating the information from clients, and learning local personalized models that should be adapted to each local distribution. In this work, we propose Solution Simplex Clustered Federated Learning (SosicFL) for dissolving such contradiction. Based on the recent ideas of learning solution simplices, SosicFL assigns a subregion in a simplex to each client, and performs FL to learn a common solution simplex. This allows the client models to possess their characteristics within the degrees of freedom in the solution simplex, and at the same time achieves the goal of learning a global common model. Our experiments show that SosicFL improves the performance and accelerates the training process for global and personalized FL with minimal computational overhead. ",
    "url": "https://arxiv.org/abs/2403.03333",
    "authors": [
      "Dennis Grinwald",
      "Philipp Wiesner",
      "Shinichi Nakajima"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2403.03336",
    "title": "Scope of Large Language Models for Mining Emerging Opinions in Online  Health Discourse",
    "abstract": "In this paper, we develop an LLM-powered framework for the curation and evaluation of emerging opinion mining in online health communities. We formulate emerging opinion mining as a pairwise stance detection problem between (title, comment) pairs sourced from Reddit, where post titles contain emerging health-related claims on a topic that is not predefined. The claims are either explicitly or implicitly expressed by the user. We detail (i) a method of claim identification -- the task of identifying if a post title contains a claim and (ii) an opinion mining-driven evaluation framework for stance detection using LLMs. We facilitate our exploration by releasing a novel test dataset, Long COVID-Stance, or LC-stance, which can be used to evaluate LLMs on the tasks of claim identification and stance detection in online health communities. Long Covid is an emerging post-COVID disorder with uncertain and complex treatment guidelines, thus making it a suitable use case for our task. LC-Stance contains long COVID treatment related discourse sourced from a Reddit community. Our evaluation shows that GPT-4 significantly outperforms prior works on zero-shot stance detection. We then perform thorough LLM model diagnostics, identifying the role of claim type (i.e. implicit vs explicit claims) and comment length as sources of model error. ",
    "url": "https://arxiv.org/abs/2403.03336",
    "authors": [
      "Joseph Gatto",
      "Madhusudan Basak",
      "Yash Srivastava",
      "Philip Bohlman",
      "Sarah M. Preum"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.03337",
    "title": "Fine-Grained Privacy Guarantees for Coverage Problems",
    "abstract": "We introduce a new notion of neighboring databases for coverage problems such as Max Cover and Set Cover under differential privacy. In contrast to the standard privacy notion for these problems, which is analogous to node-privacy in graphs, our new definition gives a more fine-grained privacy guarantee, which is analogous to edge-privacy. We illustrate several scenarios of Set Cover and Max Cover where our privacy notion is desired one for the application. Our main result is an $\\epsilon$-edge differentially private algorithm for Max Cover which obtains an $(1-1/e-\\eta,\\tilde{O}(k/\\epsilon))$-approximation with high probability. Furthermore, we show that this result is nearly tight: we give a lower bound show that an additive error of $\\Omega(k/\\epsilon)$ is necessary under edge-differential privacy. Via group privacy properties, this implies a new algorithm for $\\epsilon$-node differentially private Max Cover which obtains an $(1-1/e-\\eta,\\tilde{O}(fk/\\epsilon))$-approximation, where $f$ is the maximum degree of an element in the set system. When $f\\ll k$, this improves over the best known algorithm for Max Cover under pure (node) differential privacy, which obtains an $(1-1/e,\\tilde{O}(k^2/\\epsilon))$-approximation. ",
    "url": "https://arxiv.org/abs/2403.03337",
    "authors": [
      "Laxman Dhulipala",
      "George Z. Li"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.03344",
    "title": "Learn to Code Sustainably: An Empirical Study on LLM-based Green Code  Generation",
    "abstract": "The increasing use of information technology has led to a significant share of energy consumption and carbon emissions from data centers. These contributions are expected to rise with the growing demand for big data analytics, increasing digitization, and the development of large artificial intelligence (AI) models. The need to address the environmental impact of software development has led to increased interest in green (sustainable) coding and claims that the use of AI models can lead to energy efficiency gains. Here, we provide an empirical study on green code and an overview of green coding practices, as well as metrics used to quantify the sustainability awareness of AI models. In this framework, we evaluate the sustainability of auto-generated code. The auto-generate codes considered in this study are produced by generative commercial AI language models, GitHub Copilot, OpenAI ChatGPT-3, and Amazon CodeWhisperer. Within our methodology, in order to quantify the sustainability awareness of these AI models, we propose a definition of the code's \"green capacity\", based on certain sustainability metrics. We compare the performance and green capacity of human-generated code and code generated by the three AI language models in response to easy-to-hard problem statements. Our findings shed light on the current capacity of AI models to contribute to sustainable software development. ",
    "url": "https://arxiv.org/abs/2403.03344",
    "authors": [
      "Tina Vartziotis",
      "Ippolyti Dellatolas",
      "George Dasoulas",
      "Maximilian Schmidt",
      "Florian Schneider",
      "Tim Hoffmann",
      "Sotirios Kotsopoulos",
      "Michael Keckeisen"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03359",
    "title": "RACE-SM: Reinforcement Learning Based Autonomous Control for Social  On-Ramp Merging",
    "abstract": "Autonomous parallel-style on-ramp merging in human controlled traffic continues to be an existing issue for autonomous vehicle control. Existing non-learning based solutions for vehicle control rely on rules and optimization primarily. These methods have been seen to present significant challenges. Recent advancements in Deep Reinforcement Learning have shown promise and have received significant academic interest however the available learning based approaches show inadequate attention to other highway vehicles and often rely on inaccurate road traffic assumptions. In addition, the parallel-style case is rarely considered. A novel learning based model for acceleration and lane change decision making that explicitly considers the utility to both the ego vehicle and its surrounding vehicles which may be cooperative or uncooperative to produce behaviour that is socially acceptable is proposed. The novel reward function makes use of Social Value Orientation to weight the vehicle's level of social cooperation and is divided into ego vehicle and surrounding vehicle utility which are weighted according to the model's designated Social Value Orientation. A two-lane highway with an on-ramp divided into a taper-style and parallel-style section is considered. Simulation results indicated the importance of considering surrounding vehicles in reward function design and show that the proposed model matches or surpasses those in literature in terms of collisions while also introducing socially courteous behaviour avoiding near misses and anti-social behaviour through direct consideration of the effect of merging on surrounding vehicles. ",
    "url": "https://arxiv.org/abs/2403.03359",
    "authors": [
      "Jordan Poots"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.03360",
    "title": "Bridge the Future: High-Performance Networks in Confidential VMs without  Trusted I/O devices",
    "abstract": "Trusted I/O (TIO) is an appealing solution to improve I/O performance for confidential VMs (CVMs), with the potential to eliminate broad sources of I/O overhead. However, this paper emphasizes that not all types of I/O can derive substantial benefits from TIO, particularly network I/O. Given the obligatory use of encryption protocols for network traffic in CVM's threat model, TIO's approach of I/O encryption over the PCIe bus becomes redundant. Furthermore, TIO solutions need to expand the Trusted Computing Base (TCB) to include TIO devices and are commercially unavailable. Motivated by these insights, the goal of this paper is to propose a software solution that helps CVMs immediately benefit from high-performance networks, while confining trust only to the on-chip CVM. We present FOLIO, a software solution crafted from a secure and efficient Data Plane Development Kit (DPDK) extension compatible with the latest version of AMD Secure Encrypted Virtualization (SEV), a.k.a., Secure Nested Paging (SNP). Our design is informed by a thorough analysis of all possible factors that impact SNP VM's network performance. By extensively removing overhead sources, we arrive at a design that approaches the efficiency of an optimal TIO-based configuration. Evaluation shows that FOLIO has a performance dip less than 6% relative to the optimal TIO configuration, while only relying on off-the-shelf CPUs. ",
    "url": "https://arxiv.org/abs/2403.03360",
    "authors": [
      "Mengyuan Li",
      "Shashvat Srivastava",
      "Mengjia Yan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.03368",
    "title": "Leveraging Federated Learning for Automatic Detection of Clopidogrel  Treatment Failures",
    "abstract": "The effectiveness of clopidogrel, a widely used antiplatelet medication, varies significantly among individuals, necessitating the development of precise predictive models to optimize patient care. In this study, we leverage federated learning strategies to address clopidogrel treatment failure detection. Our research harnesses the collaborative power of multiple healthcare institutions, allowing them to jointly train machine learning models while safeguarding sensitive patient data. Utilizing the UK Biobank dataset, which encompasses a vast and diverse population, we partitioned the data based on geographic centers and evaluated the performance of federated learning. Our results show that while centralized training achieves higher Area Under the Curve (AUC) values and faster convergence, federated learning approaches can substantially narrow this performance gap. Our findings underscore the potential of federated learning in addressing clopidogrel treatment failure detection, offering a promising avenue for enhancing patient care through personalized treatment strategies while respecting data privacy. This study contributes to the growing body of research on federated learning in healthcare and lays the groundwork for secure and privacy-preserving predictive models for various medical conditions. ",
    "url": "https://arxiv.org/abs/2403.03368",
    "authors": [
      "Samuel Kim",
      "Min Sang Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2403.03376",
    "title": "Scalable Network Tomography for Dynamic Spectrum Access",
    "abstract": "Mobile networks have increased spectral efficiency through advanced multiplexing strategies that are coordinated by base stations (BS) in licensed spectrum. However, external interference on clients leads to significant performance degradation during dynamic (unlicensed) spectrum access (DSA). We introduce the notion of network tomography for DSA, whereby clients are transformed into spectrum sensors, whose joint access statistics are measured and used to account for interfering sources. Albeit promising, performing such tomography naively incurs an impractical overhead that scales exponentially with the multiplexing order of the strategies deployed -- which will only continue to grow with 5G/6G technologies. To this end, we propose a novel, scalable network tomography framework called NeTo-X that estimates joint client access statistics with just linear overhead, and forms a blue-print of the interference, thus enabling efficient DSA for future networks. NeTo-X's design incorporates intelligent algorithms that leverage multi-channel diversity and the spatial locality of interference impact on clients to accurately estimate the desired interference statistics from just pair-wise measurements of its clients. The merits of its framework are showcased in the context of resource management and jammer localization applications, where its performance significantly outperforms baseline approaches and closely approximates optimal performance at a scalable overhead. ",
    "url": "https://arxiv.org/abs/2403.03376",
    "authors": [
      "Aadesh Madnaik",
      "N. Cameron Matson",
      "Karthikeyan Sundaresan"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2403.03390",
    "title": "Performance Evaluation of Semi-supervised Learning Frameworks for  Multi-Class Weed Detection",
    "abstract": "Effective weed control plays a crucial role in optimizing crop yield and enhancing agricultural product quality. However, the reliance on herbicide application not only poses a critical threat to the environment but also promotes the emergence of resistant weeds. Fortunately, recent advances in precision weed management enabled by ML and DL provide a sustainable alternative. Despite great progress, existing algorithms are mainly developed based on supervised learning approaches, which typically demand large-scale datasets with manual-labeled annotations, which is time-consuming and labor-intensive. As such, label-efficient learning methods, especially semi-supervised learning, have gained increased attention in the broader domain of computer vision and have demonstrated promising performance. These methods aim to utilize a small number of labeled data samples along with a great number of unlabeled samples to develop high-performing models comparable to the supervised learning counterpart trained on a large amount of labeled data samples. In this study, we assess the effectiveness of a semi-supervised learning framework for multi-class weed detection, employing two well-known object detection frameworks, namely FCOS and Faster-RCNN. Specifically, we evaluate a generalized student-teacher framework with an improved pseudo-label generation module to produce reliable pseudo-labels for the unlabeled data. To enhance generalization, an ensemble student network is employed to facilitate the training process. Experimental results show that the proposed approach is able to achieve approximately 76\\% and 96\\% detection accuracy as the supervised methods with only 10\\% of labeled data in CottenWeedDet3 and CottonWeedDet12, respectively. We offer access to the source code, contributing a valuable resource for ongoing semi-supervised learning research in weed detection and beyond. ",
    "url": "https://arxiv.org/abs/2403.03390",
    "authors": [
      "Jiajia Li",
      "Dong Chen",
      "Xunyuan Yin",
      "Zhaojian Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2403.03400",
    "title": "Contrastive Learning of Person-independent Representations for Facial  Action Unit Detection",
    "abstract": "Facial action unit (AU) detection, aiming to classify AU present in the facial image, has long suffered from insufficient AU annotations. In this paper, we aim to mitigate this data scarcity issue by learning AU representations from a large number of unlabelled facial videos in a contrastive learning paradigm. We formulate the self-supervised AU representation learning signals in two-fold: (1) AU representation should be frame-wisely discriminative within a short video clip; (2) Facial frames sampled from different identities but show analogous facial AUs should have consistent AU representations. As to achieve these goals, we propose to contrastively learn the AU representation within a video clip and devise a cross-identity reconstruction mechanism to learn the person-independent representations. Specially, we adopt a margin-based temporal contrastive learning paradigm to perceive the temporal AU coherence and evolution characteristics within a clip that consists of consecutive input facial frames. Moreover, the cross-identity reconstruction mechanism facilitates pushing the faces from different identities but show analogous AUs close in the latent embedding space. Experimental results on three public AU datasets demonstrate that the learned AU representation is discriminative for AU detection. Our method outperforms other contrastive learning methods and significantly closes the performance gap between the self-supervised and supervised AU detection approaches. ",
    "url": "https://arxiv.org/abs/2403.03400",
    "authors": [
      "Yong Li",
      "Shiguang Shan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03405",
    "title": "Causality-based Cross-Modal Representation Learning for  Vision-and-Language Navigation",
    "abstract": "Vision-and-Language Navigation (VLN) has gained significant research interest in recent years due to its potential applications in real-world scenarios. However, existing VLN methods struggle with the issue of spurious associations, resulting in poor generalization with a significant performance gap between seen and unseen environments. In this paper, we tackle this challenge by proposing a unified framework CausalVLN based on the causal learning paradigm to train a robust navigator capable of learning unbiased feature representations. Specifically, we establish reasonable assumptions about confounders for vision and language in VLN using the structured causal model (SCM). Building upon this, we propose an iterative backdoor-based representation learning (IBRL) method that allows for the adaptive and effective intervention on confounders. Furthermore, we introduce the visual and linguistic backdoor causal encoders to enable unbiased feature expression for multi-modalities during training and validation, enhancing the agent's capability to generalize across different environments. Experiments on three VLN datasets (R2R, RxR, and REVERIE) showcase the superiority of our proposed method over previous state-of-the-art approaches. Moreover, detailed visualization analysis demonstrates the effectiveness of CausalVLN in significantly narrowing down the performance gap between seen and unseen environments, underscoring its strong generalization capability. ",
    "url": "https://arxiv.org/abs/2403.03405",
    "authors": [
      "Liuyi Wang",
      "Zongtao He",
      "Ronghao Dang",
      "Huiyi Chen",
      "Chengju Liu",
      "Qijun Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03409",
    "title": "Sparse Spiking Neural Network: Exploiting Heterogeneity in Timescales  for Pruning Recurrent SNN",
    "abstract": "Recurrent Spiking Neural Networks (RSNNs) have emerged as a computationally efficient and brain-inspired learning model. The design of sparse RSNNs with fewer neurons and synapses helps reduce the computational complexity of RSNNs. Traditionally, sparse SNNs are obtained by first training a dense and complex SNN for a target task, and, then, pruning neurons with low activity (activity-based pruning) while maintaining task performance. In contrast, this paper presents a task-agnostic methodology for designing sparse RSNNs by pruning a large randomly initialized model. We introduce a novel Lyapunov Noise Pruning (LNP) algorithm that uses graph sparsification methods and utilizes Lyapunov exponents to design a stable sparse RSNN from a randomly initialized RSNN. We show that the LNP can leverage diversity in neuronal timescales to design a sparse Heterogeneous RSNN (HRSNN). Further, we show that the same sparse HRSNN model can be trained for different tasks, such as image classification and temporal prediction. We experimentally show that, in spite of being task-agnostic, LNP increases computational efficiency (fewer neurons and synapses) and prediction performance of RSNNs compared to traditional activity-based pruning of trained dense models. ",
    "url": "https://arxiv.org/abs/2403.03409",
    "authors": [
      "Biswadeep Chakraborty",
      "Beomseok Kang",
      "Harshit Kumar",
      "Saibal Mukhopadhyay"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03410",
    "title": "Prediction Of Cryptocurrency Prices Using LSTM, SVM And Polynomial  Regression",
    "abstract": "The rapid development of information technology, especially the Internet, has facilitated users with a quick and easy way to seek information. With these convenience offered by internet services, many individuals who initially invested in gold and precious metals are now shifting into digital investments in form of cryptocurrencies. However, investments in crypto coins are filled with uncertainties and fluctuation in daily basis. This risk posed as significant challenges for coin investors that could result in substantial investment losses. The uncertainty of the value of these crypto coins is a critical issue in the field of coin investment. Forecasting, is one of the methods used to predict the future value of these crypto coins. By utilizing the models of Long Short Term Memory, Support Vector Machine, and Polynomial Regression algorithm for forecasting, a performance comparison is conducted to determine which algorithm model is most suitable for predicting crypto currency prices. The mean square error is employed as a benchmark for the comparison. By applying those three constructed algorithm models, the Support Vector Machine uses a linear kernel to produce the smallest mean square error compared to the Long Short Term Memory and Polynomial Regression algorithm models, with a mean square error value of 0.02. Keywords: Cryptocurrency, Forecasting, Long Short Term Memory, Mean Square Error, Polynomial Regression, Support Vector Machine ",
    "url": "https://arxiv.org/abs/2403.03410",
    "authors": [
      "Novan Fauzi Al Giffary",
      "Feri Sulianta"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistical Finance (q-fin.ST)"
    ]
  },
  {
    "id": "arXiv:2403.03412",
    "title": "Advancing Out-of-Distribution Detection through Data Purification and  Dynamic Activation Function Design",
    "abstract": "In the dynamic realms of machine learning and deep learning, the robustness and reliability of models are paramount, especially in critical real-world applications. A fundamental challenge in this sphere is managing Out-of-Distribution (OOD) samples, significantly increasing the risks of model misclassification and uncertainty. Our work addresses this challenge by enhancing the detection and management of OOD samples in neural networks. We introduce OOD-R (Out-of-Distribution-Rectified), a meticulously curated collection of open-source datasets with enhanced noise reduction properties. In-Distribution (ID) noise in existing OOD datasets can lead to inaccurate evaluation of detection algorithms. Recognizing this, OOD-R incorporates noise filtering technologies to refine the datasets, ensuring a more accurate and reliable evaluation of OOD detection algorithms. This approach not only improves the overall quality of data but also aids in better distinguishing between OOD and ID samples, resulting in up to a 2.5\\% improvement in model accuracy and a minimum 3.2\\% reduction in false positives. Furthermore, we present ActFun, an innovative method that fine-tunes the model's response to diverse inputs, thereby improving the stability of feature extraction and minimizing specificity issues. ActFun addresses the common problem of model overconfidence in OOD detection by strategically reducing the influence of hidden units, which enhances the model's capability to estimate OOD uncertainty more accurately. Implementing ActFun in the OOD-R dataset has led to significant performance enhancements, including an 18.42\\% increase in AUROC of the GradNorm method and a 16.93\\% decrease in FPR95 of the Energy method. Overall, our research not only advances the methodologies in OOD detection but also emphasizes the importance of dataset integrity for accurate algorithm evaluation. ",
    "url": "https://arxiv.org/abs/2403.03412",
    "authors": [
      "Yingrui Ji",
      "Yao Zhu",
      "Zhigang Li",
      "Jiansheng Chen",
      "Yunlong Kong",
      "Jingbo Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03433",
    "title": "I3DE: An IDE for Inspecting Inconsistencies in PL/SQL Code",
    "abstract": "In this paper, we introduce I3DE (Inconsistency Inspecting IDE) - an IDE plugin to inspect inconsistencies in PL/SQL code. We first observed the potential issues, e.g., misuses or bugs, that are introduced by the inconsistent understanding of PL/SQL semantics by PL/SQL programmers and DBMS developers, and propose a metamorphic testing-based approach for inspecting such inconsistencies in PL/SQL code. We design and implement our approach in I3DE, a widely usable plugin for the IntelliJ Platform. We conducted a comparative user study involving 16 participants, and the findings indicate that I3DE is consistently effective and efficient in helping programmers identify and avoid inconsistencies across different programming difficulties ",
    "url": "https://arxiv.org/abs/2403.03433",
    "authors": [
      "Jiangshan Liu",
      "Shuang Liu",
      "Junjie Chen"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.03456",
    "title": "DLP-GAN: Learning to Draw Modern Chinese Landscape Photos with  Generative Adversarial Network",
    "abstract": "Chinese landscape painting has a unique and artistic style, and its drawing technique is highly abstract in both the use of color and the realistic representation of objects. Previous methods focus on transferring from modern photos to ancient ink paintings. However, little attention has been paid to translating landscape paintings into modern photos. To solve such problems, in this paper, we (1) propose DLP-GAN (\\textbf{D}raw Modern Chinese \\textbf{L}andscape \\textbf{P}hotos with \\textbf{G}enerative \\textbf{A}dversarial \\textbf{N}etwork), an unsupervised cross-domain image translation framework with a novel asymmetric cycle mapping, and (2) introduce a generator based on a dense-fusion module to match different translation directions. Moreover, a dual-consistency loss is proposed to balance the realism and abstraction of model painting. In this way, our model can draw landscape photos and sketches in the modern sense. Finally, based on our collection of modern landscape and sketch datasets, we compare the images generated by our model with other benchmarks. Extensive experiments including user studies show that our model outperforms state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2403.03456",
    "authors": [
      "Xiangquan Gui",
      "Binxuan Zhang",
      "Li Li",
      "Yi Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03465",
    "title": "Self-Attention Empowered Graph Convolutional Network for Structure  Learning and Node Embedding",
    "abstract": "In representation learning on graph-structured data, many popular graph neural networks (GNNs) fail to capture long-range dependencies, leading to performance degradation. Furthermore, this weakness is magnified when the concerned graph is characterized by heterophily (low homophily). To solve this issue, this paper proposes a novel graph learning framework called the graph convolutional network with self-attention (GCN-SA). The proposed scheme exhibits an exceptional generalization capability in node-level representation learning. The proposed GCN-SA contains two enhancements corresponding to edges and node features. For edges, we utilize a self-attention mechanism to design a stable and effective graph-structure-learning module that can capture the internal correlation between any pair of nodes. This graph-structure-learning module can identify reliable neighbors for each node from the entire graph. Regarding the node features, we modify the transformer block to make it more applicable to enable GCN to fuse valuable information from the entire graph. These two enhancements work in distinct ways to help our GCN-SA capture long-range dependencies, enabling it to perform representation learning on graphs with varying levels of homophily. The experimental results on benchmark datasets demonstrate the effectiveness of the proposed GCN-SA. Compared to other outstanding GNN counterparts, the proposed GCN-SA is competitive. ",
    "url": "https://arxiv.org/abs/2403.03465",
    "authors": [
      "Mengying Jiang",
      "Guizhong Liu",
      "Yuanchao Su",
      "Xinliang Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.03483",
    "title": "A Teacher-Free Graph Knowledge Distillation Framework with Dual  Self-Distillation",
    "abstract": "Recent years have witnessed great success in handling graph-related tasks with Graph Neural Networks (GNNs). Despite their great academic success, Multi-Layer Perceptrons (MLPs) remain the primary workhorse for practical industrial applications. One reason for such an academic-industry gap is the neighborhood-fetching latency incurred by data dependency in GNNs. To reduce their gaps, Graph Knowledge Distillation (GKD) is proposed, usually based on a standard teacher-student architecture, to distill knowledge from a large teacher GNN into a lightweight student GNN or MLP. However, we found in this paper that neither teachers nor GNNs are necessary for graph knowledge distillation. We propose a Teacher-Free Graph Self-Distillation (TGS) framework that does not require any teacher model or GNNs during both training and inference. More importantly, the proposed TGS framework is purely based on MLPs, where structural information is only implicitly used to guide dual knowledge self-distillation between the target node and its neighborhood. As a result, TGS enjoys the benefits of graph topology awareness in training but is free from data dependency in inference. Extensive experiments have shown that the performance of vanilla MLPs can be greatly improved with dual self-distillation, e.g., TGS improves over vanilla MLPs by 15.54% on average and outperforms state-of-the-art GKD algorithms on six real-world datasets. In terms of inference speed, TGS infers 75X-89X faster than existing GNNs and 16X-25X faster than classical inference acceleration methods. ",
    "url": "https://arxiv.org/abs/2403.03483",
    "authors": [
      "Lirong Wu",
      "Haitao Lin",
      "Zhangyang Gao",
      "Guojiang Zhao",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03497",
    "title": "Adaptive coordination promotes collective cooperation in repeated social  dilemmas",
    "abstract": "Direct reciprocity based on the repeated prisoner's dilemma has been intensively studied. Most theoretical investigations have concentrated on memory-$1$ strategies, a class of elementary strategies just reacting to the previous-round outcomes. Though the properties of \"All-or-None\" strategies ($AoN_K$) have been discovered, simulations just confirmed the good performance of $AoN_K$ of very short memory lengths. It remains unclear how $AoN_K$ strategies would fare when players have access to longer rounds of history information. We construct a theoretical model to investigate the performance of the class of $AoN_K$ strategies of varying memory length $K$. We rigorously derive the payoffs and show that $AoN_K$ strategies of intermediate memory length $K$ are most prevalent, while strategies of larger memory lengths are less competent. Larger memory lengths make it hard for $AoN_K$ strategies to coordinate, and thus inhibiting their mutual reciprocity. We then propose the adaptive coordination strategy combining tolerance and $AoN_K$' coordination rule. This strategy behaves like $AoN_K$ strategy when coordination is not sufficient, and tolerates opponents' occasional deviations by still cooperating when coordination is sufficient. We found that the adaptive coordination strategy wins over other classic memory-$1$ strategies in various typical competition environments, and stabilizes the population at high levels of cooperation, suggesting the effectiveness of high level adaptability in resolving social dilemmas. Our work may offer a theoretical framework for exploring complex strategies using history information, which are different from traditional memory-$n$ strategies. ",
    "url": "https://arxiv.org/abs/2403.03497",
    "authors": [
      "Feipeng Zhang",
      "Te Wu",
      "Long Wang"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2403.03504",
    "title": "Graph Visualization for Blockchain Data",
    "abstract": "In this report, we introduce a novel approach to visualize extremely large graphs efficiently. Our method combines two force-directed algorithms, Kamada-Kawai and ForceAtlas2, to handle different graph components based on their node count. Additionally, we suggest utilizing the Fast Multipole method to enhance the speed of ForceAtlas2. Although initially designed for analyzing bitcoin transaction graphs, for which we present results here, this algorithm can also be applied to other crypto currency transaction graphs or graphs from diverse domains. ",
    "url": "https://arxiv.org/abs/2403.03504",
    "authors": [
      "Marcell Dietl",
      "Andre Gemünd",
      "Daniel Oeltz",
      "Felix M. Thiele",
      "Christian Werner"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2403.03508",
    "title": "Probing the Robustness of Time-series Forecasting Models with  CounterfacTS",
    "abstract": "A common issue for machine learning models applied to time-series forecasting is the temporal evolution of the data distributions (i.e., concept drift). Because most of the training data does not reflect such changes, the models present poor performance on the new out-of-distribution scenarios and, therefore, the impact of such events cannot be reliably anticipated ahead of time. We present and publicly release CounterfacTS, a tool to probe the robustness of deep learning models in time-series forecasting tasks via counterfactuals. CounterfacTS has a user-friendly interface that allows the user to visualize, compare and quantify time series data and their forecasts, for a number of datasets and deep learning models. Furthermore, the user can apply various transformations to the time series and explore the resulting changes in the forecasts in an interpretable manner. Through example cases, we illustrate how CounterfacTS can be used to i) identify the main features characterizing and differentiating sets of time series, ii) assess how the model performance depends on these characateristics, and iii) guide transformations of the original time series to create counterfactuals with desired properties for training and increasing the forecasting performance in new regions of the data distribution. We discuss the importance of visualizing and considering the location of the data in a projected feature space to transform time-series and create effective counterfactuals for training the models. Overall, CounterfacTS aids at creating counterfactuals to efficiently explore the impact of hypothetical scenarios not covered by the original data in time-series forecasting tasks. ",
    "url": "https://arxiv.org/abs/2403.03508",
    "authors": [
      "Håkon Hanisch Kjærnli",
      "Lluis Mas-Ribas",
      "Aida Ashrafi",
      "Gleb Sizov",
      "Helge Langseth",
      "Odd Erik Gundersen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03512",
    "title": "Dcl-Net: Dual Contrastive Learning Network for Semi-Supervised  Multi-Organ Segmentation",
    "abstract": "Semi-supervised learning is a sound measure to relieve the strict demand of abundant annotated datasets, especially for challenging multi-organ segmentation . However, most existing SSL methods predict pixels in a single image independently, ignoring the relations among images and categories. In this paper, we propose a two-stage Dual Contrastive Learning Network for semi-supervised MoS, which utilizes global and local contrastive learning to strengthen the relations among images and classes. Concretely, in Stage 1, we develop a similarity-guided global contrastive learning to explore the implicit continuity and similarity among images and learn global context. Then, in Stage 2, we present an organ-aware local contrastive learning to further attract the class representations. To ease the computation burden, we introduce a mask center computation algorithm to compress the category representations for local contrastive learning. Experiments conducted on the public 2017 ACDC dataset and an in-house RC-OARs dataset has demonstrated the superior performance of our method. ",
    "url": "https://arxiv.org/abs/2403.03512",
    "authors": [
      "Lu Wen",
      "Zhenghao Feng",
      "Yun Hou",
      "Peng Wang",
      "Xi Wu",
      "Jiliu Zhou",
      "Yan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03517",
    "title": "IB-Net: Initial Branch Network for Variable Decision in Boolean  Satisfiability",
    "abstract": "Boolean Satisfiability problems are vital components in Electronic Design Automation, particularly within the Logic Equivalence Checking process. Currently, SAT solvers are employed for these problems and neural network is tried as assistance to solvers. However, as SAT problems in the LEC context are distinctive due to their predominantly unsatisfiability nature and a substantial proportion of UNSAT-core variables, existing neural network assistance has proven unsuccessful in this specialized domain. To tackle this challenge, we propose IB-Net, an innovative framework utilizing graph neural networks and novel graph encoding techniques to model unsatisfiable problems and interact with state-of-the-art solvers. Extensive evaluations across solvers and datasets demonstrate IB-Net's acceleration, achieving an average runtime speedup of 5.0% on industrial data and 8.3% on SAT competition data empirically. This breakthrough advances efficient solving in LEC workflows. ",
    "url": "https://arxiv.org/abs/2403.03517",
    "authors": [
      "Tsz Ho Chan",
      "Wenyi Xiao",
      "Junhua Huang",
      "Huiling Zhen",
      "Guangji Tian",
      "Mingxuan Yuan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03525",
    "title": "Exploratory Factory Analysis of the Centrality Metrics for Complex  Real-World Networks",
    "abstract": "Exploratory factor analysis (EFA) is useful to identify the number and mapping of the hidden factors that could dominantly represent the features in the dataset. Principal component analysis (PCA) is the first step as part of the two-step procedure to conduct EFA, with the number of dominant principal components being the number of hidden factors and the entries for the features in the corresponding Eigenvectors serve as the initial values of the factor loadings. In this paper, we conduct EFA on a suite of 80 complex network datasets to identify the number and mapping of the hidden factors (expected to be less than four) that could dominantly represent the values incurred by the vertices with respect to the four major centrality metrics (degree: DEG, eigenvector: EVC, betweenness: BWC and closeness: CLC). ",
    "url": "https://arxiv.org/abs/2403.03525",
    "authors": [
      "Natarajan Meghanathan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.03538",
    "title": "RADIA -- Radio Advertisement Detection with Intelligent Analytics",
    "abstract": "Radio advertising remains an integral part of modern marketing strategies, with its appeal and potential for targeted reach undeniably effective. However, the dynamic nature of radio airtime and the rising trend of multiple radio spots necessitates an efficient system for monitoring advertisement broadcasts. This study investigates a novel automated radio advertisement detection technique incorporating advanced speech recognition and text classification algorithms. RadIA's approach surpasses traditional methods by eliminating the need for prior knowledge of the broadcast content. This contribution allows for detecting impromptu and newly introduced advertisements, providing a comprehensive solution for advertisement detection in radio broadcasting. Experimental results show that the resulting model, trained on carefully segmented and tagged text data, achieves an F1-macro score of 87.76 against a theoretical maximum of 89.33. This paper provides insights into the choice of hyperparameters and their impact on the model's performance. This study demonstrates its potential to ensure compliance with advertising broadcast contracts and offer competitive surveillance. This groundbreaking research could fundamentally change how radio advertising is monitored and open new doors for marketing optimization. ",
    "url": "https://arxiv.org/abs/2403.03538",
    "authors": [
      "Jorge Álvarez",
      "Juan Carlos Armenteros",
      "Camilo Torrón",
      "Miguel Ortega-Martín",
      "Alfonso Ardoiz",
      "Óscar García",
      "Ignacio Arranz",
      "Íñigo Galdeano",
      "Ignacio Garrido",
      "Adrián Alonso",
      "Fernando Bayón",
      "Oleg Vorontsov"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2403.03544",
    "title": "Prompt Mining for Language-based Human Mobility Forecasting",
    "abstract": "With the advancement of large language models, language-based forecasting has recently emerged as an innovative approach for predicting human mobility patterns. The core idea is to use prompts to transform the raw mobility data given as numerical values into natural language sentences so that the language models can be leveraged to generate the description for future observations. However, previous studies have only employed fixed and manually designed templates to transform numerical values into sentences. Since the forecasting performance of language models heavily relies on prompts, using fixed templates for prompting may limit the forecasting capability of language models. In this paper, we propose a novel framework for prompt mining in language-based mobility forecasting, aiming to explore diverse prompt design strategies. Specifically, the framework includes a prompt generation stage based on the information entropy of prompts and a prompt refinement stage to integrate mechanisms such as the chain of thought. Experimental results on real-world large-scale data demonstrate the superiority of generated prompts from our prompt mining pipeline. Additionally, the comparison of different prompt variants shows that the proposed prompt refinement process is effective. Our study presents a promising direction for further advancing language-based mobility forecasting. ",
    "url": "https://arxiv.org/abs/2403.03544",
    "authors": [
      "Hao Xue",
      "Tianye Tang",
      "Ali Payani",
      "Flora D. Salim"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.03562",
    "title": "Efficient Algorithms for Empirical Group Distributional Robust  Optimization and Beyond",
    "abstract": "We investigate the empirical counterpart of group distributionally robust optimization (GDRO), which aims to minimize the maximal empirical risk across $m$ distinct groups. We formulate empirical GDRO as a $\\textit{two-level}$ finite-sum convex-concave minimax optimization problem and develop a stochastic variance reduced mirror prox algorithm. Unlike existing methods, we construct the stochastic gradient by per-group sampling technique and perform variance reduction for all groups, which fully exploits the $\\textit{two-level}$ finite-sum structure of empirical GDRO. Furthermore, we compute the snapshot and mirror snapshot point by a one-index-shifted weighted average, which distinguishes us from the naive ergodic average. Our algorithm also supports non-constant learning rates, which is different from existing literature. We establish convergence guarantees both in expectation and with high probability, demonstrating a complexity of $\\mathcal{O}\\left(\\frac{m\\sqrt{\\bar{n}\\ln{m}}}{\\varepsilon}\\right)$, where $\\bar n$ is the average number of samples among $m$ groups. Remarkably, our approach outperforms the state-of-the-art method by a factor of $\\sqrt{m}$. Furthermore, we extend our methodology to deal with the empirical minimax excess risk optimization (MERO) problem and manage to give the expectation bound and the high probability bound, accordingly. The complexity of our empirical MERO algorithm matches that of empirical GDRO at $\\mathcal{O}\\left(\\frac{m\\sqrt{\\bar{n}\\ln{m}}}{\\varepsilon}\\right)$, significantly surpassing the bounds of existing methods. ",
    "url": "https://arxiv.org/abs/2403.03562",
    "authors": [
      "Dingzhi Yu",
      "Yunuo Cai",
      "Wei Jiang",
      "Lijun Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.03563",
    "title": "Multimodal Anomaly Detection based on Deep Auto-Encoder for Object Slip  Perception of Mobile Manipulation Robots",
    "abstract": "Object slip perception is essential for mobile manipulation robots to perform manipulation tasks reliably in the dynamic real-world. Traditional approaches to robot arms' slip perception use tactile or vision sensors. However, mobile robots still have to deal with noise in their sensor signals caused by the robot's movement in a changing environment. To solve this problem, we present an anomaly detection method that utilizes multisensory data based on a deep autoencoder model. The proposed framework integrates heterogeneous data streams collected from various robot sensors, including RGB and depth cameras, a microphone, and a force-torque sensor. The integrated data is used to train a deep autoencoder to construct latent representations of the multisensory data that indicate the normal status. Anomalies can then be identified by error scores measured by the difference between the trained encoder's latent values and the latent values of reconstructed input data. In order to evaluate the proposed framework, we conducted an experiment that mimics an object slip by a mobile service robot operating in a real-world environment with diverse household objects and different moving patterns. The experimental results verified that the proposed framework reliably detects anomalies in object slip situations despite various object types and robot behaviors, and visual and auditory noise in the environment. ",
    "url": "https://arxiv.org/abs/2403.03563",
    "authors": [
      "Youngjae Yoo",
      "Chung-Yeon Lee",
      "Byoung-Tak Zhang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03576",
    "title": "Unsupervised Incremental Learning with Dual Concept Drift Detection for  Identifying Anomalous Sequences",
    "abstract": "In the contemporary digital landscape, the continuous generation of extensive streaming data across diverse domains has become pervasive. Yet, a significant portion of this data remains unlabeled, posing a challenge in identifying infrequent events such as anomalies. This challenge is further amplified in non-stationary environments, where the performance of models can degrade over time due to concept drift. To address these challenges, this paper introduces a new method referred to as VAE4AS (Variational Autoencoder for Anomalous Sequences). VAE4AS integrates incremental learning with dual drift detection mechanisms, employing both a statistical test and a distance-based test. The anomaly detection is facilitated by a Variational Autoencoder. To gauge the effectiveness of VAE4AS, a comprehensive experimental study is conducted using real-world and synthetic datasets characterized by anomalous rates below 10\\% and recurrent drift. The results show that the proposed method surpasses both robust baselines and state-of-the-art techniques, providing compelling evidence for their efficacy in effectively addressing some of the challenges associated with anomalous sequence detection in non-stationary streaming data. ",
    "url": "https://arxiv.org/abs/2403.03576",
    "authors": [
      "Jin Li",
      "Kleanthis Malialis",
      "Marios M. Polycarpou"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2403.03578",
    "title": "Causal Disentanglement for Regulating Social Influence Bias in Social  Recommendation",
    "abstract": "Social recommendation systems face the problem of social influence bias, which can lead to an overemphasis on recommending items that friends have interacted with. Addressing this problem is crucial, and existing methods often rely on techniques such as weight adjustment or leveraging unbiased data to eliminate this bias. However, we argue that not all biases are detrimental, i.e., some items recommended by friends may align with the user's interests. Blindly eliminating such biases could undermine these positive effects, potentially diminishing recommendation accuracy. In this paper, we propose a Causal Disentanglement-based framework for Regulating Social influence Bias in social recommendation, named CDRSB, to improve recommendation performance. From the perspective of causal inference, we find that the user social network could be regarded as a confounder between the user and item embeddings (treatment) and ratings (outcome). Due to the presence of this social network confounder, two paths exist from user and item embeddings to ratings: a non-causal social influence path and a causal interest path. Building upon this insight, we propose a disentangled encoder that focuses on disentangling user and item embeddings into interest and social influence embeddings. Mutual information-based objectives are designed to enhance the distinctiveness of these disentangled embeddings, eliminating redundant information. Additionally, a regulatory decoder that employs a weight calculation module to dynamically learn the weights of social influence embeddings for effectively regulating social influence bias has been designed. Experimental results on four large-scale real-world datasets Ciao, Epinions, Dianping, and Douban book demonstrate the effectiveness of CDRSB compared to state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2403.03578",
    "authors": [
      "Li Wang",
      "Min Xu",
      "Quangui Zhang",
      "Yunxiao Shi",
      "Qiang Wu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03581",
    "title": "Enhancing ASD detection accuracy: a combined approach of machine  learning and deep learning models with natural language processing",
    "abstract": "Purpose: Our study explored the use of artificial intelligence (AI) to diagnose autism spectrum disorder (ASD). It focused on machine learning (ML) and deep learning (DL) to detect ASD from text inputs on social media, addressing challenges in traditional ASD diagnosis. Methods: We used natural language processing (NLP), ML, and DL models (including decision trees, XGB, KNN, RNN, LSTM, Bi-LSTM, BERT, and BERTweet) to analyze 404,627 tweets, classifying them based on ASD or non-ASD authors. A subset of 90,000 tweets was used for model training and testing. Results: Our AI models showed high accuracy, with an 88% success rate in identifying texts from individuals with ASD. Conclusion: The study demonstrates AI's potential in improving ASD diagnosis, especially in children, highlighting the importance of early detection. ",
    "url": "https://arxiv.org/abs/2403.03581",
    "authors": [
      "Sergio Rubio-Martín",
      "María Teresa García-Ordás",
      "Martín Bayón-Gutiérrez",
      "Natalia Prieto-Fernández",
      "José Alberto Benítez-Andrades"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03582",
    "title": "Design of an Open-Source Architecture for Neural Machine Translation",
    "abstract": "adaptNMT is an open-source application that offers a streamlined approach to the development and deployment of Recurrent Neural Networks and Transformer models. This application is built upon the widely-adopted OpenNMT ecosystem, and is particularly useful for new entrants to the field, as it simplifies the setup of the development environment and creation of train, validation, and test splits. The application offers a graphing feature that illustrates the progress of model training, and employs SentencePiece for creating subword segmentation models. Furthermore, the application provides an intuitive user interface that facilitates hyperparameter customization. Notably, a single-click model development approach has been implemented, and models developed by adaptNMT can be evaluated using a range of metrics. To encourage eco-friendly research, adaptNMT incorporates a green report that flags the power consumption and kgCO${_2}$ emissions generated during model development. The application is freely available. ",
    "url": "https://arxiv.org/abs/2403.03582",
    "authors": [
      "Séamus Lankford",
      "Haithem Afli",
      "Andy Way"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03592",
    "title": "Wildest Dreams: Reproducible Research in Privacy-preserving Neural  Network Training",
    "abstract": "Machine Learning (ML), addresses a multitude of complex issues in multiple disciplines, including social sciences, finance, and medical research. ML models require substantial computing power and are only as powerful as the data utilized. Due to high computational cost of ML methods, data scientists frequently use Machine Learning-as-a-Service (MLaaS) to outsource computation to external servers. However, when working with private information, like financial data or health records, outsourcing the computation might result in privacy issues. Recent advances in Privacy-Preserving Techniques (PPTs) have enabled ML training and inference over protected data through the use of Privacy-Preserving Machine Learning (PPML). However, these techniques are still at a preliminary stage and their application in real-world situations is demanding. In order to comprehend discrepancy between theoretical research suggestions and actual applications, this work examines the past and present of PPML, focusing on Homomorphic Encryption (HE) and Secure Multi-party Computation (SMPC) applied to ML. This work primarily focuses on the ML model's training phase, where maintaining user data privacy is of utmost importance. We provide a solid theoretical background that eases the understanding of current approaches and their limitations. In addition, we present a SoK of the most recent PPML frameworks for model training and provide a comprehensive comparison in terms of the unique properties and performances on standard benchmarks. Also, we reproduce the results for some of the papers and examine at what level existing works in the field provide support for open science. We believe our work serves as a valuable contribution by raising awareness about the current gap between theoretical advancements and real-world applications in PPML, specifically regarding open-source availability, reproducibility, and usability. ",
    "url": "https://arxiv.org/abs/2403.03592",
    "authors": [
      "Tanveer Khan",
      "Mindaugas Budzys",
      "Khoa Nguyen",
      "Antonis Michalas"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03599",
    "title": "Learning Invariant Representations of Graph Neural Networks via Cluster  Generalization",
    "abstract": "Graph neural networks (GNNs) have become increasingly popular in modeling graph-structured data due to their ability to learn node representations by aggregating local structure information. However, it is widely acknowledged that the test graph structure may differ from the training graph structure, resulting in a structure shift. In this paper, we experimentally find that the performance of GNNs drops significantly when the structure shift happens, suggesting that the learned models may be biased towards specific structure patterns. To address this challenge, we propose the Cluster Information Transfer (CIT) mechanism (Code available at https://github.com/BUPT-GAMMA/CITGNN), which can learn invariant representations for GNNs, thereby improving their generalization ability to various and unknown test graphs with structure shift. The CIT mechanism achieves this by combining different cluster information with the nodes while preserving their cluster-independent information. By generating nodes across different clusters, the mechanism significantly enhances the diversity of the nodes and helps GNNs learn the invariant representations. We provide a theoretical analysis of the CIT mechanism, showing that the impact of changing clusters during structure shift can be mitigated after transfer. Additionally, the proposed mechanism is a plug-in that can be easily used to improve existing GNNs. We comprehensively evaluate our proposed method on three typical structure shift scenarios, demonstrating its effectiveness in enhancing GNNs' performance. ",
    "url": "https://arxiv.org/abs/2403.03599",
    "authors": [
      "Donglin Xia",
      "Xiao Wang",
      "Nian Liu",
      "Chuan Shi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03608",
    "title": "GSNeRF: Generalizable Semantic Neural Radiance Fields with Enhanced 3D  Scene Understanding",
    "abstract": "Utilizing multi-view inputs to synthesize novel-view images, Neural Radiance Fields (NeRF) have emerged as a popular research topic in 3D vision. In this work, we introduce a Generalizable Semantic Neural Radiance Field (GSNeRF), which uniquely takes image semantics into the synthesis process so that both novel view images and the associated semantic maps can be produced for unseen scenes. Our GSNeRF is composed of two stages: Semantic Geo-Reasoning and Depth-Guided Visual rendering. The former is able to observe multi-view image inputs to extract semantic and geometry features from a scene. Guided by the resulting image geometry information, the latter performs both image and semantic rendering with improved performances. Our experiments not only confirm that GSNeRF performs favorably against prior works on both novel-view image and semantic segmentation synthesis but the effectiveness of our sampling strategy for visual rendering is further verified. ",
    "url": "https://arxiv.org/abs/2403.03608",
    "authors": [
      "Zi-Ting Chou",
      "Sheng-Yu Huang",
      "I-Jieh Liu",
      "Yu-Chiang Frank Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03617",
    "title": "Spectrum Occupancy Detection Supported by Federated Learning",
    "abstract": "Dynamic spectrum access is essential for radiocommunication and its limited spectrum resources. The key element of dynamic spectrum access systems is effective spectrum occupancy detection. In many cases, machine learning algorithms improve detection effectiveness. Because of the recent trend of using federated learning, a federated learning algorithm is presented in the context of distributed spectrum occupancy detection. The results of the work presented in the paper are based on actual signal samples collected in the laboratory. The proposed algorithm is effective, especially in the context of a set of sensors with faulty sensors. ",
    "url": "https://arxiv.org/abs/2403.03617",
    "authors": [
      "Łukasz Kułacz"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.03635",
    "title": "Processing Load Allocation of On-Board Multi-User Detection for  Payload-Constrained Satellite Networks",
    "abstract": "The rapid advance of mega-constellation facilitates the booming of direct-to-satellite massive access, where multi-user detection is critical to alleviate the induced inter-user interference. While centralized implementation of on-board detection induces unaffordable complexity for a single satellite, this paper proposes to allocate the processing load among cooperative satellites for finest exploitation of distributed processing power. Observing the inherent disparities among users, we first excavate the closed-form trade-offs between achievable sum-rate and the processing load corresponding to the satellite-user matchings, which leads to a system sum-rate maximization problem under stringent payload constraints. To address the non-trivial integer matching, we develop a quadratic transformation to the original problem, and prove it an equivalent conversion. The problem is further simplified into a series of subproblems employing successive lower bound approximation which obtains polynomial-time complexity and converges within a few iterations. Numerical results show remarkably complexity reduction compared with centralized processing, as well as around 20\\% sum-rate gain compared with other allocation methods. ",
    "url": "https://arxiv.org/abs/2403.03635",
    "authors": [
      "Sirui Miao",
      "Neng Ye",
      "Peisen Wang",
      "Qiaolin Ouyang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.03645",
    "title": "K-Link: Knowledge-Link Graph from LLMs for Enhanced Representation  Learning in Multivariate Time-Series Data",
    "abstract": "Sourced from various sensors and organized chronologically, Multivariate Time-Series (MTS) data involves crucial spatial-temporal dependencies, e.g., correlations among sensors. To capture these dependencies, Graph Neural Networks (GNNs) have emerged as powerful tools, yet their effectiveness is restricted by the quality of graph construction from MTS data. Typically, existing approaches construct graphs solely from MTS signals, which may introduce bias due to a small training dataset and may not accurately represent underlying dependencies. To address this challenge, we propose a novel framework named K-Link, leveraging Large Language Models (LLMs) to encode extensive general knowledge and thereby providing effective solutions to reduce the bias. Leveraging the knowledge embedded in LLMs, such as physical principles, we extract a \\textit{Knowledge-Link graph}, capturing vast semantic knowledge of sensors and the linkage of the sensor-level knowledge. To harness the potential of the knowledge-link graph in enhancing the graph derived from MTS data, we propose a graph alignment module, facilitating the transfer of semantic knowledge within the knowledge-link graph into the MTS-derived graph. By doing so, we can improve the graph quality, ensuring effective representation learning with GNNs for MTS data. Extensive experiments demonstrate the efficacy of our approach for superior performance across various MTS-related downstream tasks. ",
    "url": "https://arxiv.org/abs/2403.03645",
    "authors": [
      "Yucheng Wang",
      "Ruibing Jin",
      "Min Wu",
      "Xiaoli Li",
      "Lihua Xie",
      "Zhenghua Chen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03655",
    "title": "Kronos: A Robust Sharding Blockchain Consensus with Optimal  Communication Overhead",
    "abstract": "Sharding enhances blockchain scalability by dividing the network into shards, each managing specific unspent transaction outputs or accounts. Cross-shard transactions pose a critical challenge to the security and efficiency of sharding blockchains. Current solutions, however, either prioritize security with assumptions and substantial investments, or focus on reducing overhead and overlooking security considerations. In this paper, we present Kronos, a generic and efficient sharding blockchain consensus ensuring robust security. We introduce a buffer mechanism for atomic cross-shard transaction processing. Shard members collectively maintain a buffer to manage cross-shard inputs, ensuring that a transaction is committed only if all inputs are available, and no fund is transferred for invalid requests. While ensuring security, Kronos processes transactions with optimal intra-shard communication overhead. Additionally, we propose a reduction for transaction invalidity proof generation to simple and fast multicasting, leading to atomic rejection without executing full-fledged Byzantine fault tolerance protocol in optimistic scenarios. Moreover, Kronos adopts a newly designed batch mechanism, reducing inter-shard message complexity to $O((m$log$m/b)\\lambda)$. Kronos operates without dependence on any time or client honesty assumption, serving as a plug-in sharding blockchain consensus supporting applications in diverse network environments including asynchronous ones. We implement Kronos using two prominent BFT protocols: Speeding Dumbo and HotStuff. Extensive experiments demonstrate Kronos achieving a substantial throughput of 68.6ktx/sec with 1.7sec latency. Compared with state-of-the-art solutions, Kronos outperforms in all cases, achieving up to a 42x improvement in throughput and a 50% reduction in latency when cross-shard transactions dominate the workload. ",
    "url": "https://arxiv.org/abs/2403.03655",
    "authors": [
      "Andi Liu",
      "Yizhong Liu",
      "Zhuocheng Pan",
      "Yinuo Li",
      "Jianwei Liu",
      "Yuan Lu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.03659",
    "title": "Robust Graph Structure Learning under Heterophily",
    "abstract": "Graph is a fundamental mathematical structure in characterizing relations between different objects and has been widely used on various learning tasks. Most methods implicitly assume a given graph to be accurate and complete. However, real data is inevitably noisy and sparse, which will lead to inferior results. Despite the remarkable success of recent graph representation learning methods, they inherently presume that the graph is homophilic, and largely overlook heterophily, where most connected nodes are from different classes. In this regard, we propose a novel robust graph structure learning method to achieve a high-quality graph from heterophilic data for downstream tasks. We first apply a high-pass filter to make each node more distinctive from its neighbors by encoding structure information into the node features. Then, we learn a robust graph with an adaptive norm characterizing different levels of noise. Afterwards, we propose a novel regularizer to further refine the graph structure. Clustering and semi-supervised classification experiments on heterophilic graphs verify the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2403.03659",
    "authors": [
      "Xuanting Xie",
      "Zhao Kang",
      "Wenyu Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03663",
    "title": "Robust Safety-Critical Control for Systems with Sporadic Measurements  and Dwell Time Constraints",
    "abstract": "This paper presents extensions of control barrier function (CBF) theory to systems with disturbances wherein a controller only receives measurements infrequently and operates open-loop between measurements, while still satisfying state constraints. The paper considers both impulsive and continuous actuators, and models the actuators, measurements, disturbances, and timing constraints as a hybrid dynamical system. We then design an open-loop observer that bounds the worst-case uncertainty between measurements. We develop definitions of CBFs for both actuation cases, and corresponding conditions on the control input to guarantee satisfaction of the state constraints. We apply these conditions to simulations of a satellite rendezvous in an elliptical orbit and autonomous orbit stationkeeping. ",
    "url": "https://arxiv.org/abs/2403.03663",
    "authors": [
      "Joseph Breeden",
      "Luca Zaccarian",
      "Dimitra Panagou"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2403.03665",
    "title": "Robust radial basis function interpolation based on geodesic distance  for the numerical coupling of multiphysics problems",
    "abstract": "Multiphysics simulations frequently require transferring solution fields between subproblems with non-matching spatial discretizations, typically using interpolation techniques. Standard methods are usually based on measuring the closeness between points by means of the Euclidean distance, which does not account for curvature, cuts, cavities or other non-trivial geometrical or topological features of the domain. This may lead to spurious oscillations in the interpolant in proximity to these features. To overcome this issue, we propose a modification to rescaled localized radial basis function (RL-RBF) interpolation to account for the geometry of the interpolation domain, by yielding conformity and fidelity to geometrical and topological features. The proposed method, referred to as RL-RBF-G, relies on measuring the geodesic distance between data points. RL-RBF-G removes spurious oscillations appearing in the RL-RBF interpolant, resulting in increased accuracy in domains with complex geometries. We demonstrate the effectiveness of RL-RBF-G interpolation through a convergence study in an idealized setting. Furthermore, we discuss the algorithmic aspects and the implementation of RL-RBF-G interpolation in a distributed-memory parallel framework, and present the results of a strong scalability test yielding nearly ideal results. Finally, we show the effectiveness of RL-RBF-G interpolation in multiphysics simulations by considering an application to a whole-heart cardiac electromecanics model. ",
    "url": "https://arxiv.org/abs/2403.03665",
    "authors": [
      "Michele Bucelli",
      "Francesco Regazzoni",
      "Luca Dede'",
      "Alfio Quarteroni"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2403.03666",
    "title": "Provable Filter for Real-world Graph Clustering",
    "abstract": "Graph clustering, an important unsupervised problem, has been shown to be more resistant to advances in Graph Neural Networks (GNNs). In addition, almost all clustering methods focus on homophilic graphs and ignore heterophily. This significantly limits their applicability in practice, since real-world graphs exhibit a structural disparity and cannot simply be classified as homophily and heterophily. Thus, a principled way to handle practical graphs is urgently needed. To fill this gap, we provide a novel solution with theoretical support. Interestingly, we find that most homophilic and heterophilic edges can be correctly identified on the basis of neighbor information. Motivated by this finding, we construct two graphs that are highly homophilic and heterophilic, respectively. They are used to build low-pass and high-pass filters to capture holistic information. Important features are further enhanced by the squeeze-and-excitation block. We validate our approach through extensive experiments on both homophilic and heterophilic graphs. Empirical results demonstrate the superiority of our method compared to state-of-the-art clustering methods. ",
    "url": "https://arxiv.org/abs/2403.03666",
    "authors": [
      "Xuanting Xie",
      "Erlin Pan",
      "Zhao Kang",
      "Wenyu Chen",
      "Bingheng Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03670",
    "title": "CDC: A Simple Framework for Complex Data Clustering",
    "abstract": "In today's data-driven digital era, the amount as well as complexity, such as multi-view, non-Euclidean, and multi-relational, of the collected data are growing exponentially or even faster. Clustering, which unsupervisely extracts valid knowledge from data, is extremely useful in practice. However, existing methods are independently developed to handle one particular challenge at the expense of the others. In this work, we propose a simple but effective framework for complex data clustering (CDC) that can efficiently process different types of data with linear complexity. We first utilize graph filtering to fuse geometry structure and attribute information. We then reduce the complexity with high-quality anchors that are adaptively learned via a novel similarity-preserving regularizer. We illustrate the cluster-ability of our proposed method theoretically and experimentally. In particular, we deploy CDC to graph data of size 111M. ",
    "url": "https://arxiv.org/abs/2403.03670",
    "authors": [
      "Zhao Kang",
      "Xuanting Xie",
      "Bingheng Li",
      "Erlin Pan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03671",
    "title": "Portraying the Need for Temporal Data in Flood Detection via Sentinel-1",
    "abstract": "Identifying flood affected areas in remote sensing data is a critical problem in earth observation to analyze flood impact and drive responses. While a number of methods have been proposed in the literature, there are two main limitations in available flood detection datasets: (1) a lack of region variability is commonly observed and/or (2) they require to distinguish permanent water bodies from flooded areas from a single image, which becomes an ill-posed setup. Consequently, we extend the globally diverse MMFlood dataset to multi-date by providing one year of Sentinel-1 observations around each flood event. To our surprise, we notice that the definition of flooded pixels in MMFlood is inconsistent when observing the entire image sequence. Hence, we re-frame the flood detection task as a temporal anomaly detection problem, where anomalous water bodies are segmented from a Sentinel-1 temporal sequence. From this definition, we provide a simple method inspired by the popular video change detector ViBe, results of which quantitatively align with the SAR image time series, providing a reasonable baseline for future works. ",
    "url": "https://arxiv.org/abs/2403.03671",
    "authors": [
      "Xavier Bou",
      "Thibaud Ehret",
      "Rafael Grompone von Gioi",
      "Jeremy Anger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2403.03672",
    "title": "Learning Adversarial MDPs with Stochastic Hard Constraints",
    "abstract": "We study online learning problems in constrained Markov decision processes (CMDPs) with adversarial losses and stochastic hard constraints. We consider two different scenarios. In the first one, we address general CMDPs, where we design an algorithm that attains sublinear regret and cumulative positive constraints violation. In the second scenario, under the mild assumption that a policy strictly satisfying the constraints exists and is known to the learner, we design an algorithm that achieves sublinear regret while ensuring that the constraints are satisfied at every episode with high probability. To the best of our knowledge, our work is the first to study CMDPs involving both adversarial losses and hard constraints. Indeed, previous works either focus on much weaker soft constraints--allowing for positive violation to cancel out negative ones--or are restricted to stochastic losses. Thus, our algorithms can deal with general non-stationary environments subject to requirements much stricter than those manageable with state-of-the-art algorithms. This enables their adoption in a much wider range of real-world applications, ranging from autonomous driving to online advertising and recommender systems. ",
    "url": "https://arxiv.org/abs/2403.03672",
    "authors": [
      "Francesco Emanuele Stradi",
      "Matteo Castiglioni",
      "Alberto Marchesi",
      "Nicola Gatti"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03674",
    "title": "Adversarial Infrared Geometry: Using Geometry to Perform Adversarial  Attack against Infrared Pedestrian Detectors",
    "abstract": "Currently, infrared imaging technology enjoys widespread usage, with infrared object detection technology experiencing a surge in prominence. While previous studies have delved into physical attacks on infrared object detectors, the implementation of these techniques remains complex. For instance, some approaches entail the use of bulb boards or infrared QR suits as perturbations to execute attacks, which entail costly optimization and cumbersome deployment processes. Other methodologies involve the utilization of irregular aerogel as physical perturbations for infrared attacks, albeit at the expense of optimization expenses and perceptibility issues. In this study, we propose a novel infrared physical attack termed Adversarial Infrared Geometry (\\textbf{AdvIG}), which facilitates efficient black-box query attacks by modeling diverse geometric shapes (lines, triangles, ellipses) and optimizing their physical parameters using Particle Swarm Optimization (PSO). Extensive experiments are conducted to evaluate the effectiveness, stealthiness, and robustness of AdvIG. In digital attack experiments, line, triangle, and ellipse patterns achieve attack success rates of 93.1\\%, 86.8\\%, and 100.0\\%, respectively, with average query times of 71.7, 113.1, and 2.57, respectively, thereby confirming the efficiency of AdvIG. Physical attack experiments are conducted to assess the attack success rate of AdvIG at different distances. On average, the line, triangle, and ellipse achieve attack success rates of 61.1\\%, 61.2\\%, and 96.2\\%, respectively. Further experiments are conducted to comprehensively analyze AdvIG, including ablation experiments, transfer attack experiments, and adversarial defense mechanisms. Given the superior performance of our method as a simple and efficient black-box adversarial attack in both digital and physical environments, we advocate for widespread attention to AdvIG. ",
    "url": "https://arxiv.org/abs/2403.03674",
    "authors": [
      "Kalibinuer Tiliwalidi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03676",
    "title": "Simplified PCNet with Robustness",
    "abstract": "Graph Neural Networks (GNNs) have garnered significant attention for their success in learning the representation of homophilic or heterophilic graphs. However, they cannot generalize well to real-world graphs with different levels of homophily. In response, the Possion-Charlier Network (PCNet) \\cite{li2024pc}, the previous work, allows graph representation to be learned from heterophily to homophily. Although PCNet alleviates the heterophily issue, there remain some challenges in further improving the efficacy and efficiency. In this paper, we simplify PCNet and enhance its robustness. We first extend the filter order to continuous values and reduce its parameters. Two variants with adaptive neighborhood sizes are implemented. Theoretical analysis shows our model's robustness to graph structure perturbations or adversarial attacks. We validate our approach through semi-supervised learning tasks on various datasets representing both homophilic and heterophilic graphs. ",
    "url": "https://arxiv.org/abs/2403.03676",
    "authors": [
      "Bingheng Li",
      "Xuanting Xie",
      "Haoxiang Lei",
      "Ruiyi Fang",
      "Zhao Kang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03681",
    "title": "3D Object Visibility Prediction in Autonomous Driving",
    "abstract": "With the rapid advancement of hardware and software technologies, research in autonomous driving has seen significant growth. The prevailing framework for multi-sensor autonomous driving encompasses sensor installation, perception, path planning, decision-making, and motion control. At the perception phase, a common approach involves utilizing neural networks to infer 3D bounding box (Bbox) attributes from raw sensor data, including classification, size, and orientation. In this paper, we present a novel attribute and its corresponding algorithm: 3D object visibility. By incorporating multi-task learning, the introduction of this attribute, visibility, negligibly affects the model's effectiveness and efficiency. Our proposal of this attribute and its computational strategy aims to expand the capabilities for downstream tasks, thereby enhancing the safety and reliability of real-time autonomous driving in real-world scenarios. ",
    "url": "https://arxiv.org/abs/2403.03681",
    "authors": [
      "Chuanyu Luo",
      "Nuo Cheng",
      "Ren Zhong",
      "Haipeng Jiang",
      "Wenyu Chen",
      "Aoli Wang",
      "Pu Li"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03704",
    "title": "Causal Prototype-inspired Contrast Adaptation for Unsupervised Domain  Adaptive Semantic Segmentation of High-resolution Remote Sensing Imagery",
    "abstract": "Semantic segmentation of high-resolution remote sensing imagery (HRSI) suffers from the domain shift, resulting in poor performance of the model in another unseen domain. Unsupervised domain adaptive (UDA) semantic segmentation aims to adapt the semantic segmentation model trained on the labeled source domain to an unlabeled target domain. However, the existing UDA semantic segmentation models tend to align pixels or features based on statistical information related to labels in source and target domain data, and make predictions accordingly, which leads to uncertainty and fragility of prediction results. In this paper, we propose a causal prototype-inspired contrast adaptation (CPCA) method to explore the invariant causal mechanisms between different HRSIs domains and their semantic labels. It firstly disentangles causal features and bias features from the source and target domain images through a causal feature disentanglement module. Then, a causal prototypical contrast module is used to learn domain invariant causal features. To further de-correlate causal and bias features, a causal intervention module is introduced to intervene on the bias features to generate counterfactual unbiased samples. By forcing the causal features to meet the principles of separability, invariance and intervention, CPCA can simulate the causal factors of source and target domains, and make decisions on the target domain based on the causal features, which can observe improved generalization ability. Extensive experiments under three cross-domain tasks indicate that CPCA is remarkably superior to the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2403.03704",
    "authors": [
      "Jingru Zhu",
      "Ya Guo",
      "Geng Sun",
      "Liang Hong",
      "Jie Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03709",
    "title": "Portable, heterogeneous ensemble workflows at scale using libEnsemble",
    "abstract": "libEnsemble is a Python-based toolkit for running dynamic ensembles, developed as part of the DOE Exascale Computing Project. The toolkit utilizes a unique generator--simulator--allocator paradigm, where generators produce input for simulators, simulators evaluate those inputs, and allocators decide whether and when a simulator or generator should be called. The generator steers the ensemble based on simulation results. libEnsemble communicates between a manager and workers. Flexibility is provided through multiple manager--worker communication substrates each of which has different benefits. These include Python's multiprocessing, mpi4py, and TCP. Multisite ensembles are supported using Balsam or Globus Compute. We overview the unique characteristics of libEnsemble as well as current and potential interoperability with other packages in the workflow ecosystem. We highlight libEnsemble's dynamic resource features: libEnsemble can detect system resources (nodes, cores, and GPUs) and assign these in a portable way. These features allow users to specify resources required for each simulation automatically on a range of systems, including Frontier, Aurora, and Perlmutter. Such ensembles can include multiple simulation types, some using GPUs and others using only CPUs, sharing nodes for maximum efficiency. We demonstrate libEnsemble's capabilities, scalability, and scientific impact via a Gaussian process surrogate training problem for the longitudinal density profile at the exit of a plasma accelerator stage using Wake-T and WarpX simulations. We also describe the benefits of libEnsemble's generator--simulator coupling, which easily exposes to the user the ability to cancel, and portably kill, running simulations. Such control can be directed from the generator or allocator based on models that are updated with intermediate simulation output. ",
    "url": "https://arxiv.org/abs/2403.03709",
    "authors": [
      "Stephen Hudson",
      "Jeffrey Larson",
      "John-Luke Navarro",
      "Stefan M. Wild"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2403.03714",
    "title": "Intent-aware Recommendation via Disentangled Graph Contrastive Learning",
    "abstract": "Graph neural network (GNN) based recommender systems have become one of the mainstream trends due to the powerful learning ability from user behavior data. Understanding the user intents from behavior data is the key to recommender systems, which poses two basic requirements for GNN-based recommender systems. One is how to learn complex and diverse intents especially when the user behavior is usually inadequate in reality. The other is different behaviors have different intent distributions, so how to establish their relations for a more explainable recommender system. In this paper, we present the Intent-aware Recommendation via Disentangled Graph Contrastive Learning (IDCL), which simultaneously learns interpretable intents and behavior distributions over those intents. Specifically, we first model the user behavior data as a user-item-concept graph, and design a GNN based behavior disentangling module to learn the different intents. Then we propose the intent-wise contrastive learning to enhance the intent disentangling and meanwhile infer the behavior distributions. Finally, the coding rate reduction regularization is introduced to make the behaviors of different intents orthogonal. Extensive experiments demonstrate the effectiveness of IDCL in terms of substantial improvement and the interpretability. ",
    "url": "https://arxiv.org/abs/2403.03714",
    "authors": [
      "Yuling Wang",
      "Xiao Wang",
      "Xiangzhou Huang",
      "Yanhua Yu",
      "Haoyang Li",
      "Mengdi Zhang",
      "Zirui Guo",
      "Wei Wu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2403.03721",
    "title": "CMDA: Cross-Modal and Domain Adversarial Adaptation for LiDAR-Based 3D  Object Detection",
    "abstract": "Recent LiDAR-based 3D Object Detection (3DOD) methods show promising results, but they often do not generalize well to target domains outside the source (or training) data distribution. To reduce such domain gaps and thus to make 3DOD models more generalizable, we introduce a novel unsupervised domain adaptation (UDA) method, called CMDA, which (i) leverages visual semantic cues from an image modality (i.e., camera images) as an effective semantic bridge to close the domain gap in the cross-modal Bird's Eye View (BEV) representations. Further, (ii) we also introduce a self-training-based learning strategy, wherein a model is adversarially trained to generate domain-invariant features, which disrupt the discrimination of whether a feature instance comes from a source or an unseen target domain. Overall, our CMDA framework guides the 3DOD model to generate highly informative and domain-adaptive features for novel data distributions. In our extensive experiments with large-scale benchmarks, such as nuScenes, Waymo, and KITTI, those mentioned above provide significant performance gains for UDA tasks, achieving state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2403.03721",
    "authors": [
      "Gyusam Chang",
      "Wonseok Roh",
      "Sujin Jang",
      "Dongwook Lee",
      "Daehyun Ji",
      "Gyeongrok Oh",
      "Jinsun Park",
      "Jinkyu Kim",
      "Sangpil Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03725",
    "title": "To Trust or Not to Trust: Assignment Mechanisms with Predictions in the  Private Graph Model",
    "abstract": "The realm of algorithms with predictions has led to the development of several new algorithms that leverage (potentially erroneous) predictions to enhance their performance guarantees. The challenge is to devise algorithms that achieve optimal approximation guarantees as the prediction quality varies from perfect (consistency) to imperfect (robustness). This framework is particularly appealing in mechanism design contexts, where predictions might convey private information about the agents. In this paper, we design strategyproof mechanisms that leverage predictions to achieve improved approximation guarantees for several variants of the Generalized Assignment Problem (GAP) in the private graph model. In this model, first introduced by Dughmi & Ghosh (2010), the set of resources that an agent is compatible with is private information. For the Bipartite Matching Problem (BMP), we give a deterministic group-strategyproof (GSP) mechanism that is $(1 +1/\\gamma)$-consistent and $(1 + \\gamma)$-robust, where $\\gamma \\ge 1$ is some confidence parameter. We also prove that this is best possible. Remarkably, our mechanism draws inspiration from the renowned Gale-Shapley algorithm, incorporating predictions as a crucial element. Additionally, we give a randomized mechanism that is universally GSP and improves on the guarantees in expectation. The other GAP variants that we consider all make use of a unified greedy mechanism that adds edges to the assignment according to a specific order. Our universally GSP mechanism randomizes over the greedy mechanism, our mechanism for BMP and the predicted assignment, leading to $(1+3/\\gamma)$-consistency and $(3+\\gamma)$-robustness in expectation. All our mechanisms also provide more fine-grained approximation guarantees that interpolate between the consistency and the robustness, depending on some natural error measure of the prediction. ",
    "url": "https://arxiv.org/abs/2403.03725",
    "authors": [
      "Riccardo Colini-Baldeschi",
      "Sophie Klumper",
      "Guido Schäfer",
      "Artem Tsikiridis"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2403.03727",
    "title": "Robust MITL planning under uncertain navigation times",
    "abstract": "In environments like offices, the duration of a robot's navigation between two locations may vary over time. For instance, reaching a kitchen may take more time during lunchtime since the corridors are crowded with people heading the same way. In this work, we address the problem of routing in such environments with tasks expressed in Metric Interval Temporal Logic (MITL) - a rich robot task specification language that allows us to capture explicit time requirements. Our objective is to find a strategy that maximizes the temporal robustness of the robot's MITL task. As the first step towards a solution, we define a Mixed-integer linear programming approach to solving the task planning problem over a Varying Weighted Transition System, where navigation durations are deterministic but vary depending on the time of day. Then, we apply this planner to optimize for MITL temporal robustness in Markov Decision Processes, where the navigation durations between physical locations are uncertain, but the time-dependent distribution over possible delays is known. Finally, we develop a receding horizon planner for Markov Decision Processes that preserves guarantees over MITL temporal robustness. We show the scalability of our planning algorithms in simulations of robotic tasks. ",
    "url": "https://arxiv.org/abs/2403.03727",
    "authors": [
      "Alexis Linard",
      "Anna Gautier",
      "Daniel Duberg",
      "Jana Tumova"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2403.03728",
    "title": "Bridging Diversity and Uncertainty in Active learning with  Self-Supervised Pre-Training",
    "abstract": "This study addresses the integration of diversity-based and uncertainty-based sampling strategies in active learning, particularly within the context of self-supervised pre-trained models. We introduce a straightforward heuristic called TCM that mitigates the cold start problem while maintaining strong performance across various data levels. By initially applying TypiClust for diversity sampling and subsequently transitioning to uncertainty sampling with Margin, our approach effectively combines the strengths of both strategies. Our experiments demonstrate that TCM consistently outperforms existing methods across various datasets in both low and high data regimes. ",
    "url": "https://arxiv.org/abs/2403.03728",
    "authors": [
      "Paul Doucet",
      "Benjamin Estermann",
      "Till Aczel",
      "Roger Wattenhofer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03730",
    "title": "Learning 3D object-centric representation through prediction",
    "abstract": "As part of human core knowledge, the representation of objects is the building block of mental representation that supports high-level concepts and symbolic reasoning. While humans develop the ability of perceiving objects situated in 3D environments without supervision, models that learn the same set of abilities with similar constraints faced by human infants are lacking. Towards this end, we developed a novel network architecture that simultaneously learns to 1) segment objects from discrete images, 2) infer their 3D locations, and 3) perceive depth, all while using only information directly available to the brain as training data, namely: sequences of images and self-motion. The core idea is treating objects as latent causes of visual input which the brain uses to make efficient predictions of future scenes. This results in object representations being learned as an essential byproduct of learning to predict. ",
    "url": "https://arxiv.org/abs/2403.03730",
    "authors": [
      "John Day",
      "Tushar Arora",
      "Jirui Liu",
      "Li Erran Li",
      "Ming Bo Cai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03739",
    "title": "A&B BNN: Add&Bit-Operation-Only Hardware-Friendly Binary Neural Network",
    "abstract": "Binary neural networks utilize 1-bit quantized weights and activations to reduce both the model's storage demands and computational burden. However, advanced binary architectures still incorporate millions of inefficient and nonhardware-friendly full-precision multiplication operations. A&B BNN is proposed to directly remove part of the multiplication operations in a traditional BNN and replace the rest with an equal number of bit operations, introducing the mask layer and the quantized RPReLU structure based on the normalizer-free network architecture. The mask layer can be removed during inference by leveraging the intrinsic characteristics of BNN with straightforward mathematical transformations to avoid the associated multiplication operations. The quantized RPReLU structure enables more efficient bit operations by constraining its slope to be integer powers of 2. Experimental results achieved 92.30%, 69.35%, and 66.89% on the CIFAR-10, CIFAR-100, and ImageNet datasets, respectively, which are competitive with the state-of-the-art. Ablation studies have verified the efficacy of the quantized RPReLU structure, leading to a 1.14% enhancement on the ImageNet compared to using a fixed slope RLeakyReLU. The proposed add&bit-operation-only BNN offers an innovative approach for hardware-friendly network architecture. ",
    "url": "https://arxiv.org/abs/2403.03739",
    "authors": [
      "Ruichen Ma",
      "Guanchao Qiao",
      "Yian Liu",
      "Liwei Meng",
      "Ning Ning",
      "Yang Liu",
      "Shaogang Hu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03740",
    "title": "Self-supervised Photographic Image Layout Representation Learning",
    "abstract": "In the domain of image layout representation learning, the critical process of translating image layouts into succinct vector forms is increasingly significant across diverse applications, such as image retrieval, manipulation, and generation. Most approaches in this area heavily rely on costly labeled datasets and notably lack in adapting their modeling and learning methods to the specific nuances of photographic image layouts. This shortfall makes the learning process for photographic image layouts suboptimal. In our research, we directly address these challenges. We innovate by defining basic layout primitives that encapsulate various levels of layout information and by mapping these, along with their interconnections, onto a heterogeneous graph structure. This graph is meticulously engineered to capture the intricate layout information within the pixel domain explicitly. Advancing further, we introduce novel pretext tasks coupled with customized loss functions, strategically designed for effective self-supervised learning of these layout graphs. Building on this foundation, we develop an autoencoder-based network architecture skilled in compressing these heterogeneous layout graphs into precise, dimensionally-reduced layout representations. Additionally, we introduce the LODB dataset, which features a broader range of layout categories and richer semantics, serving as a comprehensive benchmark for evaluating the effectiveness of layout representation learning methods. Our extensive experimentation on this dataset demonstrates the superior performance of our approach in the realm of photographic image layout representation learning. ",
    "url": "https://arxiv.org/abs/2403.03740",
    "authors": [
      "Zhaoran Zhao",
      "Peng Lu",
      "Xujun Peng",
      "Wenhao Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2403.03750",
    "title": "German also Hallucinates! Inconsistency Detection in News Summaries with  the Absinth Dataset",
    "abstract": "The advent of Large Language Models (LLMs) has led to remarkable progress on a wide range of natural language processing tasks. Despite the advances, these large-sized models still suffer from hallucinating information in their output, which poses a major issue in automatic text summarization, as we must guarantee that the generated summary is consistent with the content of the source document. Previous research addresses the challenging task of detecting hallucinations in the output (i.e. inconsistency detection) in order to evaluate the faithfulness of the generated summaries. However, these works primarily focus on English and recent multilingual approaches lack German data. This work presents absinth, a manually annotated dataset for hallucination detection in German news summarization and explores the capabilities of novel open-source LLMs on this task in both fine-tuning and in-context learning settings. We open-source and release the absinth dataset to foster further research on hallucination detection in German. ",
    "url": "https://arxiv.org/abs/2403.03750",
    "authors": [
      "Laura Mascarell",
      "Ribin Chalumattu",
      "Annette Rios"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03772",
    "title": "AcceleratedLiNGAM: Learning Causal DAGs at the speed of GPUs",
    "abstract": "Existing causal discovery methods based on combinatorial optimization or search are slow, prohibiting their application on large-scale datasets. In response, more recent methods attempt to address this limitation by formulating causal discovery as structure learning with continuous optimization but such approaches thus far provide no statistical guarantees. In this paper, we show that by efficiently parallelizing existing causal discovery methods, we can in fact scale them to thousands of dimensions, making them practical for substantially larger-scale problems. In particular, we parallelize the LiNGAM method, which is quadratic in the number of variables, obtaining up to a 32-fold speed-up on benchmark datasets when compared with existing sequential implementations. Specifically, we focus on the causal ordering subprocedure in DirectLiNGAM and implement GPU kernels to accelerate it. This allows us to apply DirectLiNGAM to causal inference on large-scale gene expression data with genetic interventions yielding competitive results compared with specialized continuous optimization methods, and Var-LiNGAM for causal discovery on U.S. stock data. ",
    "url": "https://arxiv.org/abs/2403.03772",
    "authors": [
      "Victor Akinwande",
      "J. Zico Kolter"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.03773",
    "title": "Verified Training for Counterfactual Explanation Robustness under Data  Shift",
    "abstract": "Counterfactual explanations (CEs) enhance the interpretability of machine learning models by describing what changes to an input are necessary to change its prediction to a desired class. These explanations are commonly used to guide users' actions, e.g., by describing how a user whose loan application was denied can be approved for a loan in the future. Existing approaches generate CEs by focusing on a single, fixed model, and do not provide any formal guarantees on the CEs' future validity. When models are updated periodically to account for data shift, if the generated CEs are not robust to the shifts, users' actions may no longer have the desired impacts on their predictions. This paper introduces VeriTraCER, an approach that jointly trains a classifier and an explainer to explicitly consider the robustness of the generated CEs to small model shifts. VeriTraCER optimizes over a carefully designed loss function that ensures the verifiable robustness of CEs to local model updates, thus providing deterministic guarantees to CE validity. Our empirical evaluation demonstrates that VeriTraCER generates CEs that (1) are verifiably robust to small model updates and (2) display competitive robustness to state-of-the-art approaches in handling empirical model updates including random initialization, leave-one-out, and distribution shifts. ",
    "url": "https://arxiv.org/abs/2403.03773",
    "authors": [
      "Anna P. Meyer",
      "Yuhao Zhang",
      "Aws Albarghouthi",
      "Loris D'Antoni"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03777",
    "title": "ENOT: Expectile Regularization for Fast and Accurate Training of Neural  Optimal Transport",
    "abstract": "We present a new extension for Neural Optimal Transport (NOT) training procedure, capable of accurately and efficiently estimating optimal transportation plan via specific regularisation on conjugate potentials. The main bottleneck of existing NOT solvers is associated with the procedure of finding a near-exact approximation of the conjugate operator (i.e., the c-transform), which is done either by optimizing over maximin objectives or by the computationally-intensive fine-tuning of the initial approximated prediction. We resolve both issues by proposing a new, theoretically justified loss in the form of expectile regularization that enforces binding conditions on the learning dual potentials. Such a regularization provides the upper bound estimation over the distribution of possible conjugate potentials and makes the learning stable, eliminating the need for additional extensive finetuning. We formally justify the efficiency of our method, called Expectile-Regularised Neural Optimal Transport (ENOT). ENOT outperforms previous state-of-the-art approaches on the Wasserstein-2 benchmark tasks by a large margin (up to a 3-fold improvement in quality and up to a 10-fold improvement in runtime). ",
    "url": "https://arxiv.org/abs/2403.03777",
    "authors": [
      "Nazar Buzun",
      "Maksim Bobrin",
      "Dmitry V. Dylov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03781",
    "title": "Neural Architecture Search using Particle Swarm and Ant Colony  Optimization",
    "abstract": "Neural network models have a number of hyperparameters that must be chosen along with their architecture. This can be a heavy burden on a novice user, choosing which architecture and what values to assign to parameters. In most cases, default hyperparameters and architectures are used. Significant improvements to model accuracy can be achieved through the evaluation of multiple architectures. A process known as Neural Architecture Search (NAS) may be applied to automatically evaluate a large number of such architectures. A system integrating open source tools for Neural Architecture Search (OpenNAS), in the classification of images, has been developed as part of this research. OpenNAS takes any dataset of grayscale, or RBG images, and generates Convolutional Neural Network (CNN) architectures based on a range of metaheuristics using either an AutoKeras, a transfer learning or a Swarm Intelligence (SI) approach. Particle Swarm Optimization (PSO) and Ant Colony Optimization (ACO) are used as the SI algorithms. Furthermore, models developed through such metaheuristics may be combined using stacking ensembles. In the context of this paper, we focus on training and optimizing CNNs using the Swarm Intelligence (SI) components of OpenNAS. Two major types of SI algorithms, namely PSO and ACO, are compared to see which is more effective in generating higher model accuracies. It is shown, with our experimental design, that the PSO algorithm performs better than ACO. The performance improvement of PSO is most notable with a more complex dataset. As a baseline, the performance of fine-tuned pre-trained models is also evaluated. ",
    "url": "https://arxiv.org/abs/2403.03781",
    "authors": [
      "Séamus Lankford",
      "Diarmuid Grimes"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03785",
    "title": "A machine learning workflow to address credit default prediction",
    "abstract": "Due to the recent increase in interest in Financial Technology (FinTech), applications like credit default prediction (CDP) are gaining significant industrial and academic attention. In this regard, CDP plays a crucial role in assessing the creditworthiness of individuals and businesses, enabling lenders to make informed decisions regarding loan approvals and risk management. In this paper, we propose a workflow-based approach to improve CDP, which refers to the task of assessing the probability that a borrower will default on his or her credit obligations. The workflow consists of multiple steps, each designed to leverage the strengths of different techniques featured in machine learning pipelines and, thus best solve the CDP task. We employ a comprehensive and systematic approach starting with data preprocessing using Weight of Evidence encoding, a technique that ensures in a single-shot data scaling by removing outliers, handling missing values, and making data uniform for models working with different data types. Next, we train several families of learning models, introducing ensemble techniques to build more robust models and hyperparameter optimization via multi-objective genetic algorithms to consider both predictive accuracy and financial aspects. Our research aims at contributing to the FinTech industry in providing a tool to move toward more accurate and reliable credit risk assessment, benefiting both lenders and borrowers. ",
    "url": "https://arxiv.org/abs/2403.03785",
    "authors": [
      "Rambod Rahmani",
      "Marco Parola",
      "Mario G.C.A. Cimino"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)",
      "Risk Management (q-fin.RM)"
    ]
  },
  {
    "id": "arXiv:2403.03788",
    "title": "PPTC-R benchmark: Towards Evaluating the Robustness of Large Language  Models for PowerPoint Task Completion",
    "abstract": "The growing dependence on Large Language Models (LLMs) for finishing user instructions necessitates a comprehensive understanding of their robustness to complex task completion in real-world situations. To address this critical need, we propose the PowerPoint Task Completion Robustness benchmark (PPTC-R) to measure LLMs' robustness to the user PPT task instruction and software version. Specifically, we construct adversarial user instructions by attacking user instructions at sentence, semantic, and multi-language levels. To assess the robustness of Language Models to software versions, we vary the number of provided APIs to simulate both the newest version and earlier version settings. Subsequently, we test 3 closed-source and 4 open-source LLMs using a benchmark that incorporates these robustness settings, aiming to evaluate how deviations impact LLMs' API calls for task completion. We find that GPT-4 exhibits the highest performance and strong robustness in our benchmark, particularly in the version update and the multilingual settings. However, we find that all LLMs lose their robustness when confronted with multiple challenges (e.g., multi-turn) simultaneously, leading to significant performance drops. We further analyze the robustness behavior and error reasons of LLMs in our benchmark, which provide valuable insights for researchers to understand the LLM's robustness in task completion and develop more robust LLMs and agents. We release the code and data at \\url{https://github.com/ZekaiGalaxy/PPTCR}. ",
    "url": "https://arxiv.org/abs/2403.03788",
    "authors": [
      "Zekai Zhang",
      "Yiduo Guo",
      "Yaobo Liang",
      "Dongyan Zhao",
      "Nan Duan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.03790",
    "title": "Popeye: A Unified Visual-Language Model for Multi-Source Ship Detection  from Remote Sensing Imagery",
    "abstract": "Ship detection needs to identify ship locations from remote sensing (RS) scenes. However, due to different imaging payloads, various appearances of ships, and complicated background interference from the bird's eye view, it is difficult to set up a unified paradigm for achieving multi-source ship detection. Therefore, in this article, considering that the large language models (LLMs) emerge the powerful generalization ability, a novel unified visual-language model called Popeye is proposed for multi-source ship detection from RS imagery. First, to bridge the interpretation gap between multi-source images for ship detection, a novel image-instruction-answer way is designed to integrate the various ship detection ways (e.g., horizontal bounding box (HBB), oriented bounding box (OBB)) into a unified labeling paradigm. Then, in view of this, a cross-modal image interpretation method is developed for the proposed Popeye to enhance interactive comprehension ability between visual and language content, which can be easily migrated into any multi-source ship detection task. Subsequently, owing to objective domain differences, a knowledge adaption mechanism is designed to adapt the pre-trained visual-language knowledge from the nature scene into the RS domain for multi-source ship detection. In addition, the segment anything model (SAM) is also seamlessly integrated into the proposed Popeye to achieve pixel-level ship segmentation without additional training costs. Finally, extensive experiments are conducted on the newly constructed instruction dataset named MMShip, and the results indicate that the proposed Popeye outperforms current specialist, open-vocabulary, and other visual-language models for zero-shot multi-source ship detection. ",
    "url": "https://arxiv.org/abs/2403.03790",
    "authors": [
      "Wei Zhang",
      "Miaoxin Cai",
      "Tong Zhang",
      "Guoqiang Lei",
      "Yin Zhuang",
      "Xuerui Mao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03791",
    "title": "KG-TREAT: Pre-training for Treatment Effect Estimation by Synergizing  Patient Data with Knowledge Graphs",
    "abstract": "Treatment effect estimation (TEE) is the task of determining the impact of various treatments on patient outcomes. Current TEE methods fall short due to reliance on limited labeled data and challenges posed by sparse and high-dimensional observational patient data. To address the challenges, we introduce a novel pre-training and fine-tuning framework, KG-TREAT, which synergizes large-scale observational patient data with biomedical knowledge graphs (KGs) to enhance TEE. Unlike previous approaches, KG-TREAT constructs dual-focus KGs and integrates a deep bi-level attention synergy method for in-depth information fusion, enabling distinct encoding of treatment-covariate and outcome-covariate relationships. KG-TREAT also incorporates two pre-training tasks to ensure a thorough grounding and contextualization of patient data and KGs. Evaluation on four downstream TEE tasks shows KG-TREAT's superiority over existing methods, with an average improvement of 7% in Area under the ROC Curve (AUC) and 9% in Influence Function-based Precision of Estimating Heterogeneous Effects (IF-PEHE). The effectiveness of our estimated treatment effects is further affirmed by alignment with established randomized clinical trial findings. ",
    "url": "https://arxiv.org/abs/2403.03791",
    "authors": [
      "Ruoqi Liu",
      "Lingfei Wu",
      "Ping Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.03792",
    "title": "Neural Exec: Learning (and Learning from) Execution Triggers for Prompt  Injection Attacks",
    "abstract": "We introduce a new family of prompt injection attacks, termed Neural Exec. Unlike known attacks that rely on handcrafted strings (e.g., \"Ignore previous instructions and...\"), we show that it is possible to conceptualize the creation of execution triggers as a differentiable search problem and use learning-based methods to autonomously generate them. Our results demonstrate that a motivated adversary can forge triggers that are not only drastically more effective than current handcrafted ones but also exhibit inherent flexibility in shape, properties, and functionality. In this direction, we show that an attacker can design and generate Neural Execs capable of persisting through multi-stage preprocessing pipelines, such as in the case of Retrieval-Augmented Generation (RAG)-based applications. More critically, our findings show that attackers can produce triggers that deviate markedly in form and shape from any known attack, sidestepping existing blacklist-based detection and sanitation approaches. ",
    "url": "https://arxiv.org/abs/2403.03792",
    "authors": [
      "Dario Pasquini",
      "Martin Strohmeier",
      "Carmela Troncoso"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03842",
    "title": "Political polarisation in turbulent times: Tracking polarisation trends  and partisan news link sharing on Finnish Twitter, 2015-2023",
    "abstract": "The study analyses polarisation on Finnish social media with data from the platform X, which was known as Twitter during the time of data collection (during the Sipil\\\"a and Marin governments, 2015-2023). The users were clustered into three different ideological groups - the Conservative Right, the Moderate Right, and the Liberal Left - based on their retweeting of tweets referring to the different political parties in Finland. Trends in polarisation of several topics encompassing the most recent political crises - immigration, climate change, COVID-19, and security policy - between these ideological groups is analysed using network methods. To what extent the polarisation of each topic aligns with the polarisation of the other topics is also studied. In addition, the sharing of news links is examined in relation to the ideological groups of the users as well as to the sentiment and the virality of the tweets in which news links are shared. ",
    "url": "https://arxiv.org/abs/2403.03842",
    "authors": [
      "Antti Gronow",
      "Arttu Malkamäki"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.03854",
    "title": "ECAP: Extensive Cut-and-Paste Augmentation for Unsupervised Domain  Adaptive Semantic Segmentation",
    "abstract": "We consider unsupervised domain adaptation (UDA) for semantic segmentation in which the model is trained on a labeled source dataset and adapted to an unlabeled target dataset. Unfortunately, current self-training methods are susceptible to misclassified pseudo-labels resulting from erroneous predictions. Since certain classes are typically associated with less reliable predictions in UDA, reducing the impact of such pseudo-labels without skewing the training towards some classes is notoriously difficult. To this end, we propose an extensive cut-and-paste strategy (ECAP) to leverage reliable pseudo-labels through data augmentation. Specifically, ECAP maintains a memory bank of pseudo-labeled target samples throughout training and cut-and-pastes the most confident ones onto the current training batch. We implement ECAP on top of the recent method MIC and boost its performance on two synthetic-to-real domain adaptation benchmarks. Notably, MIC+ECAP reaches an unprecedented performance of 69.1 mIoU on the Synthia->Cityscapes benchmark. Our code is available at https://github.com/ErikBrorsson/ECAP. ",
    "url": "https://arxiv.org/abs/2403.03854",
    "authors": [
      "Erik Brorsson",
      "Knut Åkesson",
      "Lennart Svensson",
      "Kristofer Bengtsson"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03858",
    "title": "Exploring Jamming and Hijacking Attacks for Micro Aerial Drones",
    "abstract": "Recent advancements in drone technology have shown that commercial off-the-shelf Micro Aerial Drones are more effective than large-sized drones for performing flight missions in narrow environments, such as swarming, indoor navigation, and inspection of hazardous locations. Due to their deployments in many civilian and military applications, safe and reliable communication of these drones throughout the mission is critical. The Crazyflie ecosystem is one of the most popular Micro Aerial Drones and has the potential to be deployed worldwide. In this paper, we empirically investigate two interference attacks against the Crazy Real Time Protocol (CRTP) implemented within the Crazyflie drones. In particular, we explore the feasibility of experimenting two attack vectors that can disrupt an ongoing flight mission: the jamming attack, and the hijacking attack. Our experimental results demonstrate the effectiveness of such attacks in both autonomous and non-autonomous flight modes on a Crazyflie 2.1 drone. Finally, we suggest potential shielding strategies that guarantee a safe and secure flight mission. To the best of our knowledge, this is the first work investigating jamming and hijacking attacks against Micro Aerial Drones, both in autonomous and non-autonomous modes. ",
    "url": "https://arxiv.org/abs/2403.03858",
    "authors": [
      "Yassine Mekdad",
      "Abbas Acar",
      "Ahmet Aris",
      "Abdeslam El Fergougui",
      "Mauro Conti",
      "Riccardo Lazzeretti",
      "Selcuk Uluagac"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.03876",
    "title": "A Survey on Adversarial Contention Resolution",
    "abstract": "Contention resolution addresses the challenge of coordinating access by multiple processes to a shared resource such as memory, disk storage, or a communication channel. Originally spurred by challenges in database systems and bus networks, contention resolution has endured as an important abstraction for resource sharing, despite decades of technological change. Here, we survey the literature on resolving worst-case contention, where the number of processes and the time at which each process may start seeking access to the resource is dictated by an adversary. We highlight the evolution of contention resolution, where new concerns -- such as security, quality of service, and energy efficiency -- are motivated by modern systems. These efforts have yielded insights into the limits of randomized and deterministic approaches, as well as the impact of different model assumptions such as global clock synchronization, knowledge of the number of processors, feedback from access attempts, and attacks on the availability of the shared resource. ",
    "url": "https://arxiv.org/abs/2403.03876",
    "authors": [
      "Ioana Banicescu",
      "Trisha Chakraborty",
      "Seth Gilbert",
      "Maxwell Young"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2403.03880",
    "title": "Graph neural network outputs are almost surely asymptotically constant",
    "abstract": "Graph neural networks (GNNs) are the predominant architectures for a variety of learning tasks on graphs. We present a new angle on the expressive power of GNNs by studying how the predictions of a GNN probabilistic classifier evolve as we apply it on larger graphs drawn from some random graph model. We show that the output converges to a constant function, which upper-bounds what these classifiers can express uniformly. This convergence phenomenon applies to a very wide class of GNNs, including state of the art models, with aggregates including mean and the attention-based mechanism of graph transformers. Our results apply to a broad class of random graph models, including the (sparse) Erd\\H{o}s-R\\'enyi model and the stochastic block model. We empirically validate these findings, observing that the convergence phenomenon already manifests itself on graphs of relatively modest size. ",
    "url": "https://arxiv.org/abs/2403.03880",
    "authors": [
      "Sam Adam-Day",
      "Michael Benedikt",
      "İsmail İlkan Ceylan",
      "Ben Finkelshtein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2403.03894",
    "title": "IRCoder: Intermediate Representations Make Language Models Robust  Multilingual Code Generators",
    "abstract": "Code understanding and generation have fast become some of the most popular applications of language models (LMs). Nonetheless, research on multilingual aspects of Code-LMs (i.e., LMs for code generation) such as cross-lingual transfer between different programming languages, language-specific data augmentation, and post-hoc LM adaptation, alongside exploitation of data sources other than the original textual content, has been much sparser than for their natural language counterparts. In particular, most mainstream Code-LMs have been pre-trained on source code files alone. In this work, we investigate the prospect of leveraging readily available compiler intermediate representations - shared across programming languages - to improve the multilingual capabilities of Code-LMs and facilitate cross-lingual transfer. To this end, we first compile SLTrans, a parallel dataset consisting of nearly 4M self-contained source code files coupled with respective intermediate representations. Next, starting from various base Code-LMs (ranging in size from 1.1B to 7.3B parameters), we carry out continued causal language modelling training on SLTrans, forcing the Code-LMs to (1) learn the IR language and (2) align the IR constructs with respective constructs of various programming languages. Our resulting models, dubbed IRCoder, display sizeable and consistent gains across a wide variety of code generation tasks and metrics, including prompt robustness, multilingual code completion, code understanding, and instruction following. ",
    "url": "https://arxiv.org/abs/2403.03894",
    "authors": [
      "Indraneil Paul",
      "Jun Luo",
      "Goran Glavaš",
      "Iryna Gurevych"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2403.03898",
    "title": "Electrical Load Forecasting Model Using Hybrid LSTM Neural Networks with  Online Correction",
    "abstract": "Accurate electrical load forecasting is of great importance for the efficient operation and control of modern power systems. In this work, a hybrid long short-term memory (LSTM)-based model with online correction is developed for day-ahead electrical load forecasting. Firstly, four types of features are extracted from the original electrical load dataset, including the historical time series, time index features, historical statistical features, and similarity features. Then, a hybrid LSTM-based electrical load forecasting model is designed, where an LSTM neural network block and a fully-connected neural network block are integrated that can model both temporal features (historical time series) and non-temporal features (the rest features). A gradient regularization-based offline training algorithm and an output layer parameter fine-tuning-based online model correction method are developed to enhance the model's capabilities to defend against disturbance and adapt to the latest load data distribution, thus improving the forecasting accuracy. At last, extensive experiments are carried out to validate the effectiveness of the proposed electrical load forecasting strategy with superior accuracy compared with commonly used forecasting models. ",
    "url": "https://arxiv.org/abs/2403.03898",
    "authors": [
      "Nan Lu",
      "Quan Ouyang",
      "Yang Li",
      "Changfu Zou"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.03913",
    "title": "Multipolar opinion evolution in biased networks",
    "abstract": "Motivated by empirical research on bias and opinion formation, we introduce a novel multidimensional nonlinear opinion dynamical model where agents have individual biases, which are fixed, as well as opinions, which evolve. The dimensions are coupled through a normalization step, which is also the source of the nonlinearity, so that the state describes an agent's relative opinion of various options. This can capture, for example, an individual's relative trust in different media. In special cases including where biases are uniform across agents our model achieves consensus, but in general, behaviors are richer and capture multipolar opinion distributions. We examine general fixed points of the system, as well as special cases such as zero biases toward certain options or partitioned decision sets. Lastly, we demonstrate that our model exhibits polarization when biases are spatially correlated across the network, while, as empirical research suggests, a mixed community can mediate biases. ",
    "url": "https://arxiv.org/abs/2403.03913",
    "authors": [
      "Luka Baković",
      "David Ohlin",
      "Giacomo Como",
      "Emma Tegling"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.03923",
    "title": "Did Translation Models Get More Robust Without Anyone Even Noticing?",
    "abstract": "Neural machine translation (MT) models achieve strong results across a variety of settings, but it is widely believed that they are highly sensitive to \"noisy\" inputs, such as spelling errors, abbreviations, and other formatting issues. In this paper, we revisit this insight in light of recent multilingual MT models and large language models (LLMs) applied to machine translation. Somewhat surprisingly, we show through controlled experiments that these models are far more robust to many kinds of noise than previous models, even when they perform similarly on clean data. This is notable because, even though LLMs have more parameters and more complex training processes than past models, none of the open ones we consider use any techniques specifically designed to encourage robustness. Next, we show that similar trends hold for social media translation experiments -- LLMs are more robust to social media text. We include an analysis of the circumstances in which source correction techniques can be used to mitigate the effects of noise. Altogether, we show that robustness to many types of noise has increased. ",
    "url": "https://arxiv.org/abs/2403.03923",
    "authors": [
      "Ben Peters",
      "André F.T. Martins"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.03949",
    "title": "Reconciling Reality through Simulation: A Real-to-Sim-to-Real Approach  for Robust Manipulation",
    "abstract": "Imitation learning methods need significant human supervision to learn policies robust to changes in object poses, physical disturbances, and visual distractors. Reinforcement learning, on the other hand, can explore the environment autonomously to learn robust behaviors but may require impractical amounts of unsafe real-world data collection. To learn performant, robust policies without the burden of unsafe real-world data collection or extensive human supervision, we propose RialTo, a system for robustifying real-world imitation learning policies via reinforcement learning in \"digital twin\" simulation environments constructed on the fly from small amounts of real-world data. To enable this real-to-sim-to-real pipeline, RialTo proposes an easy-to-use interface for quickly scanning and constructing digital twins of real-world environments. We also introduce a novel \"inverse distillation\" procedure for bringing real-world demonstrations into simulated environments for efficient fine-tuning, with minimal human intervention and engineering required. We evaluate RialTo across a variety of robotic manipulation problems in the real world, such as robustly stacking dishes on a rack, placing books on a shelf, and six other tasks. RialTo increases (over 67%) in policy robustness without requiring extensive human data collection. Project website and videos at https://real-to-sim-to-real.github.io/RialTo/ ",
    "url": "https://arxiv.org/abs/2403.03949",
    "authors": [
      "Marcel Torne",
      "Anthony Simeonov",
      "Zechu Li",
      "April Chan",
      "Tao Chen",
      "Abhishek Gupta",
      "Pulkit Agrawal"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03229",
    "title": "Embracing Uncertainty Flexibility: Harnessing a Supervised Tree Kernel  to Empower Ensemble Modelling for 2D Echocardiography-Based Prediction of  Right Ventricular Volume",
    "abstract": "The right ventricular (RV) function deterioration strongly predicts clinical outcomes in numerous circumstances. To boost the clinical deployment of ensemble regression methods that quantify RV volumes using tabular data from the widely available two-dimensional echocardiography (2DE), we propose to complement the volume predictions with uncertainty scores. To this end, we employ an instance-based method which uses the learned tree structure to identify the nearest training samples to a target instance and then uses a number of distribution types to more flexibly model the output. The probabilistic and point-prediction performances of the proposed framework are evaluated on a relatively small-scale dataset, comprising 100 end-diastolic and end-systolic RV volumes. The reference values for point performance were obtained from MRI. The results demonstrate that our flexible approach yields improved probabilistic and point performances over other state-of-the-art methods. The appropriateness of the proposed framework is showcased by providing exemplar cases. The estimated uncertainty embodies both aleatoric and epistemic types. This work aligns with trustworthy artificial intelligence since it can be used to enhance the decision-making process and reduce risks. The feature importance scores of our framework can be exploited to reduce the number of required 2DE views which could enhance the proposed pipeline's clinical application. ",
    "url": "https://arxiv.org/abs/2403.03229",
    "authors": [
      "Tuan A. Bohoran",
      "Polydoros N. Kampaktsis",
      "Laura McLaughlin",
      "Jay Leb",
      "Gerry P. McCann",
      "Archontis Giannakidis"
    ],
    "subjectives": [
      "Tissues and Organs (q-bio.TO)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)",
      "Analysis of PDEs (math.AP)"
    ]
  },
  {
    "id": "arXiv:2403.03245",
    "title": "Neural Network Learning and Quantum Gravity",
    "abstract": "The landscape of low-energy effective field theories stemming from string theory is too vast for a systematic exploration. However, the meadows of the string landscape may be fertile ground for the application of machine learning techniques. Employing neural network learning may allow for inferring novel, undiscovered properties that consistent theories in the landscape should possess, or checking conjectural statements about alleged characteristics thereof. The aim of this work is to describe to what extent the string landscape can be explored with neural network-based learning. Our analysis is motivated by recent studies that show that the string landscape is characterized by finiteness properties, emerging from its underlying tame, o-minimal structures. Indeed, employing these results, we illustrate that any low-energy effective theory of string theory is endowed with certain statistical learnability properties. Consequently, several learning problems therein formulated, including interpolations and multi-class classification problems, can be concretely addressed with machine learning, delivering results with sufficiently high accuracy. ",
    "url": "https://arxiv.org/abs/2403.03245",
    "authors": [
      "Stefano Lanza"
    ],
    "subjectives": [
      "High Energy Physics - Theory (hep-th)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03271",
    "title": "Low-Complexity Linear Decoupling of Users for Uplink Massive MU-MIMO  Detection",
    "abstract": "Multi-user massive MIMO is a promising candidate for future wireless communication systems. It enables users with different requirements to be connected to the same base station (BS) on the same set of resources. In uplink massive MU-MIMO, while users with different requirements are served, decoupled signal detection helps in using a user-specific detection scheme for every user. In this paper, we propose a low-complexity linear decoupling scheme called Sequential Decoupler (SD), which aids in the parallel detection of each user's data streams. The proposed algorithm shows significant complexity reduction, particularly when the number of users in the system increases. In the numerical simulations, it has been observed that the complexity of the proposed scheme is only 0.15% of the conventional Singular Value Decomposition (SVD) based decoupling and 47% to the pseudo-inverse based decoupling schemes when 80 users with two antennas each are served by the BS. ",
    "url": "https://arxiv.org/abs/2403.03271",
    "authors": [
      "S. Sowmya",
      "Gokularam Muthukrishnan",
      "K. Giridhar"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2403.03276",
    "title": "ARNN: Attentive Recurrent Neural Network for Multi-channel EEG Signals  to Identify Epileptic Seizures",
    "abstract": "We proposed an Attentive Recurrent Neural Network (ARNN), which recurrently applies attention layers along a sequence and has linear complexity with respect to the sequence length. The proposed model operates on multi-channel EEG signals rather than single channel signals and leverages parallel computation. In this cell, the attention layer is a computational unit that efficiently applies self-attention and cross-attention mechanisms to compute a recurrent function over a wide number of state vectors and input signals. Our architecture is inspired in part by the attention layer and long short-term memory (LSTM) cells, and it uses long-short style gates, but it scales this typical cell up by several orders to parallelize for multi-channel EEG signals. It inherits the advantages of attention layers and LSTM gate while avoiding their respective drawbacks. We evaluated the model effectiveness through extensive experiments with heterogeneous datasets, including the CHB-MIT and UPenn and Mayos Clinic, CHB-MIT datasets. The empirical findings suggest that the ARNN model outperforms baseline methods such as LSTM, Vision Transformer (ViT), Compact Convolution Transformer (CCT), and R-Transformer (RT), showcasing superior performance and faster processing capabilities across a wide range of tasks. The code has been made publicly accessible at \\url{https://github.com/Salim-Lysiun/ARNN}. ",
    "url": "https://arxiv.org/abs/2403.03276",
    "authors": [
      "Salim Rukhsar",
      "Anil Kumar Tiwari"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03310",
    "title": "Graph Learning for Parameter Prediction of Quantum Approximate  Optimization Algorithm",
    "abstract": "In recent years, quantum computing has emerged as a transformative force in the field of combinatorial optimization, offering novel approaches to tackling complex problems that have long challenged classical computational methods. Among these, the Quantum Approximate Optimization Algorithm (QAOA) stands out for its potential to efficiently solve the Max-Cut problem, a quintessential example of combinatorial optimization. However, practical application faces challenges due to current limitations on quantum computational resource. Our work optimizes QAOA initialization, using Graph Neural Networks (GNN) as a warm-start technique. This sacrifices affordable computational resource on classical computer to reduce quantum computational resource overhead, enhancing QAOA's effectiveness. Experiments with various GNN architectures demonstrate the adaptability and stability of our framework, highlighting the synergy between quantum algorithms and machine learning. Our findings show GNN's potential in improving QAOA performance, opening new avenues for hybrid quantum-classical approaches in quantum computing and contributing to practical applications. ",
    "url": "https://arxiv.org/abs/2403.03310",
    "authors": [
      "Zhiding Liang",
      "Gang Liu",
      "Zheyuan Liu",
      "Jinglei Cheng",
      "Tianyi Hao",
      "Kecheng Liu",
      "Hang Ren",
      "Zhixin Song",
      "Ji Liu",
      "Fanny Ye",
      "Yiyu Shi"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03326",
    "title": "AnatoMix: Anatomy-aware Data Augmentation for Multi-organ Segmentation",
    "abstract": "Multi-organ segmentation in medical images is a widely researched task and can save much manual efforts of clinicians in daily routines. Automating the organ segmentation process using deep learning (DL) is a promising solution and state-of-the-art segmentation models are achieving promising accuracy. In this work, We proposed a novel data augmentation strategy for increasing the generalizibility of multi-organ segmentation datasets, namely AnatoMix. By object-level matching and manipulation, our method is able to generate new images with correct anatomy, i.e. organ segmentation mask, exponentially increasing the size of the segmentation dataset. Initial experiments have been done to investigate the segmentation performance influenced by our method on a public CT dataset. Our augmentation method can lead to mean dice of 76.1, compared with 74.8 of the baseline method. ",
    "url": "https://arxiv.org/abs/2403.03326",
    "authors": [
      "Chang Liu",
      "Fuxin Fan",
      "Annette Schwarz",
      "Andreas Maier"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03404",
    "title": "Secure Total Domination Number in Maximal Outerplanar Graphs",
    "abstract": "A subset $S$ of vertices in a graph $G$ is a secure total dominating set of $G$ if $S$ is a total dominating set of $G$ and, for each vertex $u \\not\\in S$, there is a vertex $v \\in S$ such that $uv$ is an edge and $(S \\setminus \\{v\\}) \\cup \\{u\\}$ is also a total dominating set of $G$. We show that if $G$ is a maximal outerplanar graph of order $n$, then $G$ has a total secure dominating set of size at most $\\lfloor 2n/3 \\rfloor$. Moreover, if an outerplanar graph $G$ of order $n$, then each secure total dominating set has at least $\\lceil (n+2)/3 \\rceil$ vertices. We show that these bounds are best possible. ",
    "url": "https://arxiv.org/abs/2403.03404",
    "authors": [
      "Yasufumi Aita",
      "Toru Araki"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2403.03427",
    "title": "Single Transit Detection In Kepler With Machine Learning And Onboard  Spacecraft Diagnostics",
    "abstract": "Exoplanet discovery at long orbital periods requires reliably detecting individual transits without additional information about the system. Techniques like phase-folding of light curves and periodogram analysis of radial velocity data are more sensitive to planets with shorter orbital periods, leaving a dearth of planet discoveries at long periods. We present a novel technique using an ensemble of Convolutional Neural Networks incorporating the onboard spacecraft diagnostics of \\emph{Kepler} to classify transits within a light curve. We create a pipeline to recover the location of individual transits, and the period of the orbiting planet, which maintains $>80\\%$ transit recovery sensitivity out to an 800-day orbital period. Our neural network pipeline has the potential to discover additional planets in the \\emph{Kepler} dataset, and crucially, within the $\\eta$-Earth regime. We report our first candidate from this pipeline, KOI 1271.02. KOI 1271.01 is known to exhibit strong Transit Timing Variations (TTVs), and so we jointly model the TTVs and transits of both transiting planets to constrain the orbital configuration and planetary parameters and conclude with a series of potential parameters for KOI 1271.02, as there is not enough data currently to uniquely constrain the system. We conclude that KOI 1271.02 has a radius of 5.32 $\\pm$ 0.20 $R_{\\oplus}$ and a mass of $28.94^{0.23}_{-0.47}$ $M_{\\oplus}$. Future constraints on the nature of KOI 1271.02 require measuring additional TTVs of KOI 1271.01 or observing a second transit of KOI 1271.02. ",
    "url": "https://arxiv.org/abs/2403.03427",
    "authors": [
      "Matthew T. Hansen",
      "Jason A. Dittmann"
    ],
    "subjectives": [
      "Earth and Planetary Astrophysics (astro-ph.EP)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03455",
    "title": "Robust Control Lyapunov-Value Functions for Nonlinear Disturbed Systems",
    "abstract": "Control Lyapunov Functions (CLFs) have been extensively used in the control community. A well-known drawback is the absence of a systematic way to construct CLFs for general nonlinear systems, and the problem can become more complex with input or state constraints. Our preliminary work on constructing Control Lyapunov Value Functions (CLVFs) using Hamilton-Jacobi (HJ) reachability analysis provides a method for finding a non-smooth CLF. In this paper, we extend our work on CLVFs to systems with bounded disturbance and define the Robust CLVF (R-CLVF). The R-CLVF naturally inherits all properties of the CLVF; i.e., it first identifies the \"smallest robust control invariant set (SRCIS)\" and stabilizes the system to it with a user-specified exponential rate. The region from which the exponential rate can be met is called the \"region of exponential stabilizability (ROES).\" We provide clearer definitions of the SRCIS and more rigorous proofs of several important theorems. Since the computation of the R-CLVF suffers from the \"curse of dimensionality,\" we also provide two techniques (warmstart and system decomposition) that solve it, along with necessary proofs. Three numerical examples are provided, validating our definition of SRCIS, illustrating the trade-off between a faster decay rate and a smaller ROES, and demonstrating the efficiency of computation using warmstart and decomposition. ",
    "url": "https://arxiv.org/abs/2403.03455",
    "authors": [
      "Zheng Gong",
      "Sylvia Herbert"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.03511",
    "title": "Illuminating the property space in crystal structure prediction using  Quality-Diversity algorithms",
    "abstract": "The identification of materials with exceptional properties is an essential objective to enable technological progress. We propose the application of \\textit{Quality-Diversity} algorithms to the field of crystal structure prediction. The objective of these algorithms is to identify a diverse set of high-performing solutions, which has been successful in a range of fields such as robotics, architecture and aeronautical engineering. As these methods rely on a high number of evaluations, we employ machine-learning surrogate models to compute the interatomic potential and material properties that are used to guide optimisation. Consequently, we also show the value of using neural networks to model crystal properties and enable the identification of novel composition--structure combinations. In this work, we specifically study the application of the MAP-Elites algorithm to predict polymorphs of TiO$_2$. We rediscover the known ground state, in addition to a set of other polymorphs with distinct properties. We validate our method for C, SiO$_2$ and SiC systems, where we show that the algorithm can uncover multiple local minima with distinct electronic and mechanical properties. ",
    "url": "https://arxiv.org/abs/2403.03511",
    "authors": [
      "Marta Wolinska",
      "Aron Walsh",
      "Antoine Cully"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2403.03526",
    "title": "FingerNet: EEG Decoding of A Fine Motor Imagery with Finger-tapping Task  Based on A Deep Neural Network",
    "abstract": "Brain-computer interface (BCI) technology facilitates communication between the human brain and computers, primarily utilizing electroencephalography (EEG) signals to discern human intentions. Although EEG-based BCI systems have been developed for paralysis individuals, ongoing studies explore systems for speech imagery and motor imagery (MI). This study introduces FingerNet, a specialized network for fine MI classification, departing from conventional gross MI studies. The proposed FingerNet could extract spatial and temporal features from EEG signals, improving classification accuracy within the same hand. The experimental results demonstrated that performance showed significantly higher accuracy in classifying five finger-tapping tasks, encompassing thumb, index, middle, ring, and little finger movements. FingerNet demonstrated dominant performance compared to the conventional baseline models, EEGNet and DeepConvNet. The average accuracy for FingerNet was 0.3049, whereas EEGNet and DeepConvNet exhibited lower accuracies of 0.2196 and 0.2533, respectively. Statistical validation also demonstrates the predominance of FingerNet over baseline networks. For biased predictions, particularly for thumb and index classes, we led to the implementation of weighted cross-entropy and also adapted the weighted cross-entropy, a method conventionally employed to mitigate class imbalance. The proposed FingerNet involves optimizing network structure, improving performance, and exploring applications beyond fine MI. Moreover, the weighted Cross Entropy approach employed to address such biased predictions appears to have broader applicability and relevance across various domains involving multi-class classification tasks. We believe that effective execution of motor imagery can be achieved not only for fine MI, but also for local muscle MI ",
    "url": "https://arxiv.org/abs/2403.03526",
    "authors": [
      "Young-Min Go",
      "Seong-Hyun Yu",
      "Hyeong-Yeong Park",
      "Minji Lee",
      "Ji-Hoon Jeong"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2403.03606",
    "title": "Enhancing Price Prediction in Cryptocurrency Using Transformer Neural  Network and Technical Indicators",
    "abstract": "This study presents an innovative approach for predicting cryptocurrency time series, specifically focusing on Bitcoin, Ethereum, and Litecoin. The methodology integrates the use of technical indicators, a Performer neural network, and BiLSTM (Bidirectional Long Short-Term Memory) to capture temporal dynamics and extract significant features from raw cryptocurrency data. The application of technical indicators, such facilitates the extraction of intricate patterns, momentum, volatility, and trends. The Performer neural network, employing Fast Attention Via positive Orthogonal Random features (FAVOR+), has demonstrated superior computational efficiency and scalability compared to the traditional Multi-head attention mechanism in Transformer models. Additionally, the integration of BiLSTM in the feedforward network enhances the model's capacity to capture temporal dynamics in the data, processing it in both forward and backward directions. This is particularly advantageous for time series data where past and future data points can influence the current state. The proposed method has been applied to the hourly and daily timeframes of the major cryptocurrencies and its performance has been benchmarked against other methods documented in the literature. The results underscore the potential of the proposed method to outperform existing models, marking a significant progression in the field of cryptocurrency price prediction. ",
    "url": "https://arxiv.org/abs/2403.03606",
    "authors": [
      "Mohammad Ali Labbaf Khaniki",
      "Mohammad Manthouri"
    ],
    "subjectives": [
      "Computational Finance (q-fin.CP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03668",
    "title": "On the Structure of Hamiltonian Graphs with Small Independence Number",
    "abstract": "A Hamiltonian path (cycle) in a graph is a path (cycle, respectively) which passes through all of its vertices. The problems of deciding the existence of a Hamiltonian cycle (path) in an input graph are well known to be NP-complete, and restricted classes of graphs which allow for their polynomial-time solutions are intensively investigated. Until very recently the complexity was open even for graphs of independence number at most 3. So far unpublished result of Jedli\\v{c}kov\\'{a} and Kratochv\\'{\\i}l [arXiv:2309.09228] shows that for every integer $k$, Hamiltonian path and cycle are polynomial-time solvable in graphs of independence number bounded by $k$. As a companion structural result, we determine explicit obstacles for the existence of a Hamiltonian path for small values of $k$, namely for graphs of independence number 2, 3, and 4. Identifying these obstacles in an input graph yields alternative polynomial-time algorithms for Hamiltonian path and cycle with no large hidden multiplicative constants. ",
    "url": "https://arxiv.org/abs/2403.03668",
    "authors": [
      "Nikola Jedličková",
      "Jan Kratochvíl"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2403.03702",
    "title": "Online model error correction with neural networks: application to the  Integrated Forecasting System",
    "abstract": "In recent years, there has been significant progress in the development of fully data-driven global numerical weather prediction models. These machine learning weather prediction models have their strength, notably accuracy and low computational requirements, but also their weakness: they struggle to represent fundamental dynamical balances, and they are far from being suitable for data assimilation experiments. Hybrid modelling emerges as a promising approach to address these limitations. Hybrid models integrate a physics-based core component with a statistical component, typically a neural network, to enhance prediction capabilities. In this article, we propose to develop a model error correction for the operational Integrated Forecasting System (IFS) of the European Centre for Medium-Range Weather Forecasts using a neural network. The neural network is initially pre-trained offline using a large dataset of operational analyses and analysis increments. Subsequently, the trained network is integrated into the IFS within the Object-Oriented Prediction System (OOPS) so as to be used in data assimilation and forecast experiments. It is then further trained online using a recently developed variant of weak-constraint 4D-Var. The results show that the pre-trained neural network already provides a reliable model error correction, which translates into reduced forecast errors in many conditions and that the online training further improves the accuracy of the hybrid model in many conditions. ",
    "url": "https://arxiv.org/abs/2403.03702",
    "authors": [
      "Alban Farchi",
      "Marcin Chrust",
      "Marc Bocquet",
      "Massimo Bonavita"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03720",
    "title": "Criminal organizations exhibit hysteresis, resilience, and robustness by  balancing security and efficiency",
    "abstract": "The interplay between criminal organizations and law enforcement disruption strategies is crucial in criminology. Criminal enterprises, like legitimate businesses, balance visibility and security to thrive. This study uses evolutionary game theory to analyze criminal networks' dynamics, resilience to interventions, and responses to external conditions. We find strong hysteresis effects, challenging traditional deterrence-focused strategies. Optimal thresholds for organization formation or dissolution are defined by these effects. Stricter punishment doesn't always deter organized crime linearly. Network structure, particularly link density and skill assortativity, significantly influences organization formation and stability. These insights advocate for adaptive policy-making and strategic law enforcement to effectively disrupt criminal networks. ",
    "url": "https://arxiv.org/abs/2403.03720",
    "authors": [
      "Casper van Elteren",
      "Vítor V. Vasconcelos",
      "Mike Lees"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.03767",
    "title": "Predicting the Temperature Dependence of Surfactant CMCs Using Graph  Neural Networks",
    "abstract": "The critical micelle concentration (CMC) of surfactant molecules is an essential property for surfactant applications in industry. Recently, classical QSPR and Graph Neural Networks (GNNs), a deep learning technique, have been successfully applied to predict the CMC of surfactants at room temperature. However, these models have not yet considered the temperature dependency of the CMC, which is highly relevant for practical applications. We herein develop a GNN model for temperature-dependent CMC prediction of surfactants. We collect about 1400 data points from public sources for all surfactant classes, i.e., ionic, nonionic, and zwitterionic, at multiple temperatures. We test the predictive quality of the model for following scenarios: i) when CMC data for surfactants are present in the training of the model in at least one different temperature, and ii) CMC data for surfactants are not present in the training, i.e., generalizing to unseen surfactants. In both test scenarios, our model exhibits a high predictive performance of R$^2 \\geq $ 0.94 on test data. We also find that the model performance varies by surfactant class. Finally, we evaluate the model for sugar-based surfactants with complex molecular structures, as these represent a more sustainable alternative to synthetic surfactants and are therefore of great interest for future applications in the personal and home care industries. ",
    "url": "https://arxiv.org/abs/2403.03767",
    "authors": [
      "Christoforos Brozos",
      "Jan G. Rittig",
      "Sandip Bhattacharya",
      "Elie Akanny",
      "Christina Kohlmann",
      "Alexander Mitsos"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03816",
    "title": "Targeted Variance Reduction: Robust Bayesian Optimization of Black-Box  Simulators with Noise Parameters",
    "abstract": "The optimization of a black-box simulator over control parameters $\\mathbf{x}$ arises in a myriad of scientific applications. In such applications, the simulator often takes the form $f(\\mathbf{x},\\boldsymbol{\\theta})$, where $\\boldsymbol{\\theta}$ are parameters that are uncertain in practice. Robust optimization aims to optimize the objective $\\mathbb{E}[f(\\mathbf{x},\\boldsymbol{\\Theta})]$, where $\\boldsymbol{\\Theta} \\sim \\mathcal{P}$ is a random variable that models uncertainty on $\\boldsymbol{\\theta}$. For this, existing black-box methods typically employ a two-stage approach for selecting the next point $(\\mathbf{x},\\boldsymbol{\\theta})$, where $\\mathbf{x}$ and $\\boldsymbol{\\theta}$ are optimized separately via different acquisition functions. As such, these approaches do not employ a joint acquisition over $(\\mathbf{x},\\boldsymbol{\\theta})$, and thus may fail to fully exploit control-to-noise interactions for effective robust optimization. To address this, we propose a new Bayesian optimization method called Targeted Variance Reduction (TVR). The TVR leverages a novel joint acquisition function over $(\\mathbf{x},\\boldsymbol{\\theta})$, which targets variance reduction on the objective within the desired region of improvement. Under a Gaussian process surrogate on $f$, the TVR acquisition can be evaluated in closed form, and reveals an insightful exploration-exploitation-precision trade-off for robust black-box optimization. The TVR can further accommodate a broad class of non-Gaussian distributions on $\\mathcal{P}$ via a careful integration of normalizing flows. We demonstrate the improved performance of TVR over the state-of-the-art in a suite of numerical experiments and an application to the robust design of automobile brake discs under operational uncertainty. ",
    "url": "https://arxiv.org/abs/2403.03816",
    "authors": [
      "John Joshua Miller",
      "Simon Mak"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03850",
    "title": "Conformal prediction for multi-dimensional time series by ellipsoidal  sets",
    "abstract": "Conformal prediction (CP) has been a popular method for uncertainty quantification because it is distribution-free, model-agnostic, and theoretically sound. For forecasting problems in supervised learning, most CP methods focus on building prediction intervals for univariate responses. In this work, we develop a sequential CP method called $\\texttt{MultiDimSPCI}$ that builds prediction regions for a multivariate response, especially in the context of multivariate time series, which are not exchangeable. Theoretically, we estimate finite-sample high-probability bounds on the conditional coverage gap. Empirically, we demonstrate that $\\texttt{MultiDimSPCI}$ maintains valid coverage on a wide range of multivariate time series while producing smaller prediction regions than CP and non-CP baselines. ",
    "url": "https://arxiv.org/abs/2403.03850",
    "authors": [
      "Chen Xu",
      "Hanyang Jiang",
      "Yao Xie"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03891",
    "title": "Joint multi-task learning improves weakly-supervised biomarker  prediction in computational pathology",
    "abstract": "Deep Learning (DL) can predict biomarkers directly from digitized cancer histology in a weakly-supervised setting. Recently, the prediction of continuous biomarkers through regression-based DL has seen an increasing interest. Nonetheless, clinical decision making often requires a categorical outcome. Consequently, we developed a weakly-supervised joint multi-task Transformer architecture which has been trained and evaluated on four public patient cohorts for the prediction of two key predictive biomarkers, microsatellite instability (MSI) and homologous recombination deficiency (HRD), trained with auxiliary regression tasks related to the tumor microenvironment. Moreover, we perform a comprehensive benchmark of 16 approaches of task balancing for weakly-supervised joint multi-task learning in computational pathology. Using our novel approach, we improve over the state-of-the-art area under the receiver operating characteristic by +7.7% and +4.1%, as well as yielding better clustering of latent embeddings by +8% and +5% for the prediction of MSI and HRD in external cohorts, respectively. ",
    "url": "https://arxiv.org/abs/2403.03891",
    "authors": [
      "Omar S. M. El Nahhas",
      "Georg Wölflein",
      "Marta Ligero",
      "Tim Lenz",
      "Marko van Treeck",
      "Firas Khader",
      "Daniel Truhn",
      "Jakob Nikolas Kather"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.11155",
    "title": "Quantum Neural Network with Density Matrix for Question Answering and  Classical Image Classification",
    "abstract": " Title: Quantum Neural Network with Density Matrix for Question Answering and  Classical Image Classification ",
    "url": "https://arxiv.org/abs/2203.11155",
    "authors": [
      "X. Q. Zhao",
      "T. L. Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2209.00225",
    "title": "STDEN: Towards Physics-Guided Neural Networks for Traffic Flow  Prediction",
    "abstract": " Comments: 36th AAAI Conference on Artificial Intelligence (AAAI 2022) ",
    "url": "https://arxiv.org/abs/2209.00225",
    "authors": [
      "Jiahao Ji",
      "Jingyuan Wang",
      "Zhe Jiang",
      "Jiawei Jiang",
      "Hu Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.09475",
    "title": "FIMP: Foundation Model-Informed Message Passing for Graph Neural  Networks",
    "abstract": " Comments: 16 pages (11 + 5 pages appendix). 5 figures and 7 tables ",
    "url": "https://arxiv.org/abs/2210.09475",
    "authors": [
      "Syed Asad Rizvi",
      "Nhi Nguyen",
      "Haoran Lyu",
      "Benjamin Christensen",
      "Josue Ortega Caro",
      "Antonio H. O. Fonseca",
      "Emanuele Zappala",
      "Maryam Bagherian",
      "Christopher Averill",
      "Chadi G. Abdallah",
      "Amin Karbasi",
      "Rex Ying",
      "Maria Brbic",
      "Rahul Madhav Dhodapkar",
      "David van Dijk"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.12776",
    "title": "Metadata Privacy Beyond Tunneling for Instant Messaging",
    "abstract": " Comments: To appear at the 9th IEEE European Symposium on Security and Privacy ",
    "url": "https://arxiv.org/abs/2210.12776",
    "authors": [
      "Boel Nelson",
      "Elena Pagnin",
      "Aslan Askarov"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2212.04475",
    "title": "Spatio-Temporal Self-Supervised Learning for Traffic Flow Prediction",
    "abstract": " Comments: 37th AAAI Conference on Artificial Intelligence (AAAI 2023) ",
    "url": "https://arxiv.org/abs/2212.04475",
    "authors": [
      "Jiahao Ji",
      "Jingyuan Wang",
      "Chao Huang",
      "Junjie Wu",
      "Boren Xu",
      "Zhenhe Wu",
      "Junbo Zhang",
      "Yu Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.03658",
    "title": "Planted Bipartite Graph Detection",
    "abstract": " Comments: 37 pages ",
    "url": "https://arxiv.org/abs/2302.03658",
    "authors": [
      "Asaf Rotenberg",
      "Wasim Huleihel",
      "Ofer Shayevitz"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2303.00286",
    "title": "Treat Different Negatives Differently: Enriching Loss Functions with  Domain and Range Constraints for Link Prediction",
    "abstract": " Comments: Accepted in ESWC 2024 ",
    "url": "https://arxiv.org/abs/2303.00286",
    "authors": [
      "Nicolas Hubert",
      "Pierre Monnin",
      "Armelle Brun",
      "Davy Monticolo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01343",
    "title": "A study of distributionally robust mixed-integer programming with  Wasserstein metric: on the value of incomplete data",
    "abstract": " Comments: 32 pages; minor mistakes are fixed in Definition 1 ",
    "url": "https://arxiv.org/abs/2304.01343",
    "authors": [
      "Sergey S. Ketkov"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2305.09329",
    "title": "CWTM: Leveraging Contextualized Word Embeddings from BERT for Neural  Topic Modeling",
    "abstract": " Comments: The paper has been accepted to appear at the LREC-COLING 2024 conference ",
    "url": "https://arxiv.org/abs/2305.09329",
    "authors": [
      "Zheng Fang",
      "Yulan He",
      "Rob Procter"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.16793",
    "title": "Incentive Mechanism for Uncertain Tasks under Differential Privacy",
    "abstract": " Title: Incentive Mechanism for Uncertain Tasks under Differential Privacy ",
    "url": "https://arxiv.org/abs/2305.16793",
    "authors": [
      "Xikun Jiang",
      "Chenhao Ying",
      "Lei Li",
      "Boris Düdder",
      "Haiqin Wu",
      "Haiming Jin",
      "Yuan Luo"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2306.00266",
    "title": "A polynomial-time iterative algorithm for random graph matching with  non-vanishing correlation",
    "abstract": " Comments: 62 pages, 1 figure ",
    "url": "https://arxiv.org/abs/2306.00266",
    "authors": [
      "Jian Ding",
      "Zhangsong Li"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Probability (math.PR)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.02117",
    "title": "VQGraph: Rethinking Graph Representation Space for Bridging GNNs and  MLPs",
    "abstract": " Comments: ICLR 2024. Code: this https URL ",
    "url": "https://arxiv.org/abs/2308.02117",
    "authors": [
      "Ling Yang",
      "Ye Tian",
      "Minkai Xu",
      "Zhongyi Liu",
      "Shenda Hong",
      "Wei Qu",
      "Wentao Zhang",
      "Bin Cui",
      "Muhan Zhang",
      "Jure Leskovec"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.03417",
    "title": "PURL: Safe and Effective Sanitization of Link Decoration",
    "abstract": " Title: PURL: Safe and Effective Sanitization of Link Decoration ",
    "url": "https://arxiv.org/abs/2308.03417",
    "authors": [
      "Shaoor Munir",
      "Patrick Lee",
      "Umar Iqbal",
      "Zubair Shafiq",
      "Sandra Siby"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04100",
    "title": "The Still Secret Ballot: The Limited Privacy Cost of Transparent  Election Results",
    "abstract": " Comments: Updated version with new analyses and terminology of local revelation. 50 pages, 14 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2308.04100",
    "authors": [
      "Shiro Kuriwaki",
      "Jeffrey B. Lewis",
      "Michael Morse"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2309.03685",
    "title": "PyGraft: Configurable Generation of Synthetic Schemas and Knowledge  Graphs at Your Fingertips",
    "abstract": " Comments: Accepted in ESWC 2024 ",
    "url": "https://arxiv.org/abs/2309.03685",
    "authors": [
      "Nicolas Hubert",
      "Pierre Monnin",
      "Mathieu d'Aquin",
      "Davy Monticolo",
      "Armelle Brun"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2309.05317",
    "title": "Neural Koopman prior for data assimilation",
    "abstract": " Title: Neural Koopman prior for data assimilation ",
    "url": "https://arxiv.org/abs/2309.05317",
    "authors": [
      "Anthony Frion",
      "Lucas Drumetz",
      "Mauro Dalla Mura",
      "Guillaume Tochon",
      "Abdeldjalil Aïssa El Bey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.09553",
    "title": "Causal-Story: Local Causal Attention Utilizing Parameter-Efficient  Tuning For Visual Story Synthesis",
    "abstract": " Comments: Accepted by 2024 International Conference on Acoustics, Speech and Signal Processing(ICASSP 2024) ",
    "url": "https://arxiv.org/abs/2309.09553",
    "authors": [
      "Tianyi Song",
      "Jiuxin Cao",
      "Kun Wang",
      "Bo Liu",
      "Xiaofeng Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2310.00354",
    "title": "AI-Dentify: Deep learning for proximal caries detection on bitewing  x-ray -- HUNT4 Oral Health Study",
    "abstract": " Comments: 24 pages, 5 figure, 7 tables ",
    "url": "https://arxiv.org/abs/2310.00354",
    "authors": [
      "Javier Pérez de Frutos",
      "Ragnhild Holden Helland",
      "Shreya Desai",
      "Line Cathrine Nymoen",
      "Thomas Langø",
      "Theodor Remman",
      "Abhijit Sen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.01986",
    "title": "A Vision-Based Tactile Sensing System for Multimodal Contact Information  Perception via Neural Network",
    "abstract": " Title: A Vision-Based Tactile Sensing System for Multimodal Contact Information  Perception via Neural Network ",
    "url": "https://arxiv.org/abs/2310.01986",
    "authors": [
      "Weiliang Xu",
      "Guoyuan Zhou",
      "Yuanzhi Zhou",
      "Zhibin Zou",
      "Jiali Wang",
      "Wenfeng Wu",
      "Xinming Li"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.03572",
    "title": "Residual Multi-Fidelity Neural Network Computing",
    "abstract": " Title: Residual Multi-Fidelity Neural Network Computing ",
    "url": "https://arxiv.org/abs/2310.03572",
    "authors": [
      "Owen Davis",
      "Mohammad Motamed",
      "Raul Tempone"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2310.04687",
    "title": "Improving Adversarial Attacks on Latent Diffusion Model",
    "abstract": " Title: Improving Adversarial Attacks on Latent Diffusion Model ",
    "url": "https://arxiv.org/abs/2310.04687",
    "authors": [
      "Boyang Zheng",
      "Chumeng Liang",
      "Xiaoyu Wu",
      "Yan Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.12357",
    "title": "Large Language Models for Code Analysis: Do LLMs Really Do Their Job?",
    "abstract": " Comments: Accepted by Usenix Security 2024 ",
    "url": "https://arxiv.org/abs/2310.12357",
    "authors": [
      "Chongzhou Fang",
      "Ning Miao",
      "Shaurya Srivastav",
      "Jialin Liu",
      "Ruoyu Zhang",
      "Ruijie Fang",
      "Asmita",
      "Ryan Tsang",
      "Najmeh Nazari",
      "Han Wang",
      "Houman Homayoun"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.13225",
    "title": "Scalable Neural Network Kernels",
    "abstract": " Comments: ICLR 2024 ",
    "url": "https://arxiv.org/abs/2310.13225",
    "authors": [
      "Arijit Sehanobish",
      "Krzysztof Choromanski",
      "Yunfan Zhao",
      "Avinava Dubey",
      "Valerii Likhosherstov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.14814",
    "title": "Leveraging Ensemble Diversity for Robust Self-Training in the Presence  of Sample Selection Bias",
    "abstract": " Comments: Accepted at AISTATS 2024, Valencia, Spain ",
    "url": "https://arxiv.org/abs/2310.14814",
    "authors": [
      "Ambroise Odonnat",
      "Vasilii Feofanov",
      "Ievgen Redko"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.00369",
    "title": "Direct System Identification of Dynamical Networks with Partial  Measurements: a Maximum Likelihood Approach",
    "abstract": " Comments: Accepted to ECC 2024 ",
    "url": "https://arxiv.org/abs/2311.00369",
    "authors": [
      "João Victor Galvão da Mata",
      "Anders Hansson",
      "Martin S. Andersen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2311.03260",
    "title": "From Coupled Oscillators to Graph Neural Networks: Reducing  Over-smoothing via a Kuramoto Model-based Approach",
    "abstract": " Title: From Coupled Oscillators to Graph Neural Networks: Reducing  Over-smoothing via a Kuramoto Model-based Approach ",
    "url": "https://arxiv.org/abs/2311.03260",
    "authors": [
      "Tuan Nguyen",
      "Hirotada Honda",
      "Takashi Sano",
      "Vinh Nguyen",
      "Shugo Nakamura",
      "Tan M. Nguyen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.07277",
    "title": "AdaCCD: Adaptive Semantic Contrasts Discovery Based Cross Lingual  Adaptation for Code Clone Detection",
    "abstract": " Title: AdaCCD: Adaptive Semantic Contrasts Discovery Based Cross Lingual  Adaptation for Code Clone Detection ",
    "url": "https://arxiv.org/abs/2311.07277",
    "authors": [
      "Yangkai Du",
      "Tengfei Ma",
      "Lingfei Wu",
      "Xuhong Zhang",
      "Shouling Ji"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.09393",
    "title": "Taypsi: Static Enforcement of Privacy Policies for Policy-Agnostic  Oblivious Computation",
    "abstract": " Title: Taypsi: Static Enforcement of Privacy Policies for Policy-Agnostic  Oblivious Computation ",
    "url": "https://arxiv.org/abs/2311.09393",
    "authors": [
      "Qianchuan Ye",
      "Benjamin Delaware"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.11016",
    "title": "SNI-SLAM: Semantic Neural Implicit SLAM",
    "abstract": " Comments: Accepted to CVPR 2024 ",
    "url": "https://arxiv.org/abs/2311.11016",
    "authors": [
      "Siting Zhu",
      "Guangming Wang",
      "Hermann Blum",
      "Jiuming Liu",
      "Liang Song",
      "Marc Pollefeys",
      "Hesheng Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.12472",
    "title": "Self-Supervised Deconfounding Against Spatio-Temporal Shifts: Theory and  Modeling",
    "abstract": " Comments: 14 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2311.12472",
    "authors": [
      "Jiahao Ji",
      "Wentao Zhang",
      "Jingyuan Wang",
      "Yue He",
      "Chao Huang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.10187",
    "title": "TSRNet: Simple Framework for Real-time ECG Anomaly Detection with  Multimodal Time and Spectrogram Restoration Network",
    "abstract": " Comments: Accepted at ISBI 2024 ",
    "url": "https://arxiv.org/abs/2312.10187",
    "authors": [
      "Nhat-Tan Bui",
      "Dinh-Hieu Hoang",
      "Thinh Phan",
      "Minh-Triet Tran",
      "Brijesh Patel",
      "Donald Adjeroh",
      "Ngan Le"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.14197",
    "title": "Benchmarking and Defending Against Indirect Prompt Injection Attacks on  Large Language Models",
    "abstract": " Title: Benchmarking and Defending Against Indirect Prompt Injection Attacks on  Large Language Models ",
    "url": "https://arxiv.org/abs/2312.14197",
    "authors": [
      "Jingwei Yi",
      "Yueqi Xie",
      "Bin Zhu",
      "Emre Kiciman",
      "Guangzhong Sun",
      "Xing Xie",
      "Fangzhao Wu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.17285",
    "title": "Understanding Distributed Representations of Concepts in Deep Neural  Networks without Supervision",
    "abstract": " Comments: Published in AAAI2024. First two authors contributed equally. The code is available at this https URL ",
    "url": "https://arxiv.org/abs/2312.17285",
    "authors": [
      "Wonjoon Chang",
      "Dahee Kwon",
      "Jaesik Choi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.02880",
    "title": "Lotto: Secure Participant Selection against Adversarial Servers in  Federated Learning",
    "abstract": " Comments: This article has been accepted to USENIX Security '24 ",
    "url": "https://arxiv.org/abs/2401.02880",
    "authors": [
      "Zhifeng Jiang",
      "Peng Ye",
      "Shiqi He",
      "Wei Wang",
      "Ruichuan Chen",
      "Bo Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2401.06401",
    "title": "DevEval: Evaluating Code Generation in Practical Software Projects",
    "abstract": " Comments: We are re-checking this benchmark and repeating related experiments. New versions of DevEval will be released later ",
    "url": "https://arxiv.org/abs/2401.06401",
    "authors": [
      "Jia Li",
      "Ge Li",
      "Yunfei Zhao",
      "Yongmin Li",
      "Zhi Jin",
      "Hao Zhu",
      "Huanyu Liu",
      "Kaibo Liu",
      "Lecheng Wang",
      "Zheng Fang",
      "Lanshen Wang",
      "Jiazheng Ding",
      "Xuanming Zhang",
      "Yihong Dong",
      "Yuqi Zhu",
      "Bin Gu",
      "Mengfei Yang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.10712",
    "title": "Q&A Prompts: Discovering Rich Visual Clues through Mining  Question-Answer Prompts for VQA requiring Diverse World Knowledge",
    "abstract": " Title: Q&A Prompts: Discovering Rich Visual Clues through Mining  Question-Answer Prompts for VQA requiring Diverse World Knowledge ",
    "url": "https://arxiv.org/abs/2401.10712",
    "authors": [
      "Haibi Wang",
      "Weifeng Ge"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.03697",
    "title": "SHMC-Net: A Mask-guided Feature Fusion Network for Sperm Head Morphology  Classification",
    "abstract": " Comments: Published on ISBI 2024 ",
    "url": "https://arxiv.org/abs/2402.03697",
    "authors": [
      "Nishchal Sapkota",
      "Yejia Zhang",
      "Sirui Li",
      "Peixian Liang",
      "Zhuo Zhao",
      "Jingjing Zhang",
      "Xiaomin Zha",
      "Yiru Zhou",
      "Yunxia Cao",
      "Danny Z Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04405",
    "title": "Interpretable domain knowledge enhanced machine learning framework on  axial capacity prediction of circular CFST columns",
    "abstract": " Comments: Journal Research Article ",
    "url": "https://arxiv.org/abs/2402.04405",
    "authors": [
      "Dian Wang",
      "Zhigang Ren",
      "Gen Kondo"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2402.06326",
    "title": "Prompt Learning on Temporal Interaction Graphs",
    "abstract": " Comments: 11 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2402.06326",
    "authors": [
      "Xi Chen",
      "Siwei Zhang",
      "Yun Xiong",
      "Xixi Wu",
      "Jiawei Zhang",
      "Xiangguo Sun",
      "Yao Zhang",
      "Feng Zhao",
      "Yulin Kang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2402.07153",
    "title": "Error Estimation for Physics-informed Neural Networks Approximating  Semilinear Wave Equations",
    "abstract": " Title: Error Estimation for Physics-informed Neural Networks Approximating  Semilinear Wave Equations ",
    "url": "https://arxiv.org/abs/2402.07153",
    "authors": [
      "Beatrice Lorenz",
      "Aras Bacho",
      "Gitta Kutyniok"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.13959",
    "title": "Retention Induced Biases in a Recommendation System with Heterogeneous  Users",
    "abstract": " Title: Retention Induced Biases in a Recommendation System with Heterogeneous  Users ",
    "url": "https://arxiv.org/abs/2402.13959",
    "authors": [
      "Shichao Ma"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2402.15653",
    "title": "Low-Frequency Black-Box Backdoor Attack via Evolutionary Algorithm",
    "abstract": " Title: Low-Frequency Black-Box Backdoor Attack via Evolutionary Algorithm ",
    "url": "https://arxiv.org/abs/2402.15653",
    "authors": [
      "Yanqi Qiao",
      "Dazhuang Liu",
      "Rui Wang",
      "Kaitai Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.16029",
    "title": "GraphWiz: An Instruction-Following Language Model for Graph Problems",
    "abstract": " Comments: 27pages, 15 tables ",
    "url": "https://arxiv.org/abs/2402.16029",
    "authors": [
      "Nuo Chen",
      "Yuhan Li",
      "Jianheng Tang",
      "Jia Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.16073",
    "title": "Pfeed: Generating near real-time personalized feeds using precomputed  embedding similarities",
    "abstract": " Comments: 9 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2402.16073",
    "authors": [
      "Binyam Gebre",
      "Karoliina Ranta",
      "Stef van den Elzen",
      "Ernst Kuiper",
      "Thijs Baars",
      "Tom Heskes"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.16899",
    "title": "A priori Estimates for Deep Residual Network in Continuous-time  Reinforcement Learning",
    "abstract": " Title: A priori Estimates for Deep Residual Network in Continuous-time  Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2402.16899",
    "authors": [
      "Shuyu Yin",
      "Qixuan Zhou",
      "Fei Wen",
      "Tao Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.18162",
    "title": "Out-of-Distribution Detection using Neural Activation Prior",
    "abstract": " Title: Out-of-Distribution Detection using Neural Activation Prior ",
    "url": "https://arxiv.org/abs/2402.18162",
    "authors": [
      "Weilin Wan",
      "Weizhong Zhang",
      "Cheng Jin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.18383",
    "title": "Robust Quantification of Percent Emphysema on CT via Domain Attention:  the Multi-Ethnic Study of Atherosclerosis (MESA) Lung Study",
    "abstract": " Comments: 5 pages, 5 figures. Accepted to IEEE International Symposium on Biomedical Imaging 2024 (ISBI 2024). Camera-ready version ",
    "url": "https://arxiv.org/abs/2402.18383",
    "authors": [
      "Xuzhe Zhang",
      "Elsa D. Angelini",
      "Eric A. Hoffman",
      "Karol E. Watson",
      "Benjamin M. Smith",
      "R. Graham Barr",
      "Andrew F. Laine"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.19322",
    "title": "Verification of Neural Networks' Global Robustness",
    "abstract": " Title: Verification of Neural Networks' Global Robustness ",
    "url": "https://arxiv.org/abs/2402.19322",
    "authors": [
      "Anan Kabaha",
      "Dana Drachsler-Cohen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2402.19379",
    "title": "Wisdom of the Silicon Crowd: LLM Ensemble Prediction Capabilities Rival  Human Crowd Accuracy",
    "abstract": " Comments: 20 pages; 13 visualizations (nine figures, four tables) ",
    "url": "https://arxiv.org/abs/2402.19379",
    "authors": [
      "Philipp Schoenegger",
      "Indre Tuminauskaite",
      "Peter S. Park",
      "Philip E. Tetlock"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.00331",
    "title": "WindGP: Efficient Graph Partitioning on Heterogenous Machines",
    "abstract": " Comments: 19 pages, 15 figures, 18 tables ",
    "url": "https://arxiv.org/abs/2403.00331",
    "authors": [
      "Li Zeng",
      "Haohan Huang",
      "Binfan Zheng",
      "Kang Yang",
      "Shengcheng Shao",
      "Jinhua Zhou",
      "Jun Xie",
      "Rongqian Zhao",
      "Xin Chen"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2403.01317",
    "title": "Less is More: Hop-Wise Graph Attention for Scalable and Generalizable  Learning on Circuits",
    "abstract": " Comments: Published as a conference paper at Design Automation Conference (DAC) 2024 ",
    "url": "https://arxiv.org/abs/2403.01317",
    "authors": [
      "Chenhui Deng",
      "Zichao Yue",
      "Cunxi Yu",
      "Gokce Sarar",
      "Ryan Carey",
      "Rajeev Jain",
      "Zhiru Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2403.01766",
    "title": "Improving Visual Perception of a Social Robot for Controlled and  In-the-wild Human-robot Interaction",
    "abstract": " Comments: accepted to HRI 2024 (LBR track) ",
    "url": "https://arxiv.org/abs/2403.01766",
    "authors": [
      "Wangjie Zhong",
      "Leimin Tian",
      "Duy Tho Le",
      "Hamid Rezatofighi"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.02472",
    "title": "OffLanDat: A Community Based Implicit Offensive Language Dataset  Generated by Large Language Model Through Prompt Engineering",
    "abstract": " Title: OffLanDat: A Community Based Implicit Offensive Language Dataset  Generated by Large Language Model Through Prompt Engineering ",
    "url": "https://arxiv.org/abs/2403.02472",
    "authors": [
      "Amit Das",
      "Mostafa Rahgouy",
      "Dongji Feng",
      "Zheng Zhang",
      "Tathagata Bhattacharya",
      "Nilanjana Raychawdhary",
      "Mary Sandage",
      "Lauramarie Pope",
      "Gerry Dozier",
      "Cheryl Seals"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  }
]