[
  {
    "id": "arXiv:2111.06964",
    "title": "Synchronization of networks of piecewise-smooth systems",
    "abstract": "We study convergence in networks of piecewise-smooth (PWS) systems that commonly arise in applications to model dynamical systems whose evolution is affected by macroscopic events such as switches and impacts. Existing approaches were typically oriented toward guaranteeing global bounded synchronizability, local stability of the synchronization manifold, or achieving synchronization by exerting a control action on each node. Here we start by generalizing existing results on QUAD systems to the case of PWS systems, accounting for a large variety of nonlinear coupling laws. Then, we propose that a discontinuous coupling can be used to guarantee global synchronizability of a network of N PWS agents under mild assumptions on the individual dynamics. We provide extensive numerical simulations to gain insights on larger networks. ",
    "url": "https://arxiv.org/abs/2111.06964",
    "authors": [
      "Marco Coraggio",
      "Pietro DeLellis",
      "S. John Hogan",
      "Mario di Bernardo"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2111.07160",
    "title": "A robust collision source method for rank adaptive dynamical low-rank  approximation in radiation therapy",
    "abstract": "Deterministic models for radiation transport describe the density of radiation particles moving through a background material. In radiation therapy applications, the phase space of this density is composed of energy, spatial position and direction of flight. The resulting six-dimensional phase space prohibits fine numerical discretizations, which are essential for the construction of accurate and reliable treatment plans. In this work, we tackle the high dimensional phase space through a dynamical low-rank approximation of the particle density. Dynamical low-rank approximation (DLRA) evolves the solution on a low-rank manifold in time. Interpreting the energy variable as a pseudo-time lets us employ the DLRA framework to represent the solution of the radiation transport equation on a low-rank manifold for every energy. Stiff scattering terms are treated through an efficient implicit energy discretization and a rank adaptive integrator is chosen to dynamically adapt the rank in energy. To facilitate the use of boundary conditions and reduce the overall rank, the radiation transport equation is split into collided and uncollided particles through a collision source method. Uncollided particles are described by a directed quadrature set guaranteeing low computational costs, whereas collided particles are represented by a low-rank solution. It can be shown that the presented method is L$^2$-stable under a time step restriction which does not depend on stiff scattering terms. Moreover, the implicit treatment of scattering does not require numerical inversions of matrices. Numerical results for radiation therapy configurations as well as the line source benchmark underline the efficiency of the proposed method. ",
    "url": "https://arxiv.org/abs/2111.07160",
    "authors": [
      "Jonas Kusch",
      "Pia Stammer"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2111.07183",
    "title": "Reliably-stabilizing piecewise-affine neural network controllers",
    "abstract": "A common problem affecting neural network (NN) approximations of model predictive control (MPC) policies is the lack of analytical tools to assess the stability of the closed-loop system under the action of the NN-based controller. We present a general procedure to quantify the performance of such a controller, or to design minimum complexity NNs with rectified linear units (ReLUs) that preserve the desirable properties of a given MPC scheme. By quantifying the approximation error between NN-based and MPC-based state-to-input mappings, we first establish suitable conditions involving two key quantities, the worst-case error and the Lipschitz constant, guaranteeing the stability of the closed-loop system. We then develop an offline, mixed-integer optimization-based method to compute those quantities exactly. Together these techniques provide conditions sufficient to certify the stability and performance of a ReLU-based approximation of an MPC control law. ",
    "url": "https://arxiv.org/abs/2111.07183",
    "authors": [
      "Filippo Fabiani",
      "Paul J. Goulart"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2111.07613",
    "title": "Generate plane quad mesh with neural networks and tree search",
    "abstract": "The quality of mesh generation has long been considered a vital aspect in providing engineers with reliable simulation results throughout the history of the Finite Element Method (FEM). The element extraction method, which is currently the most robust method, is used in business software. However, in order to speed up extraction, the approach is done by finding the next element that optimizes a target function, which can result in local mesh of bad quality after many time steps. We provide TreeMesh, a method that uses this method in conjunction with reinforcement learning (also possible with supervised learning) and a novel Monte-Carlo tree search (MCTS) (Coulom(2006), Kocsis and Szepesv\\'ari(2006), Browne et~al.(2012)). The algorithm is based on a previously proposed approach (Pan et~al.(2021)). After making many improvements on DRL (algorithm, state-action-reward setting) and adding a MCTS, it outperforms the former work on the same boundary. Furthermore, using tree search, our program reveals much preponderance on seed-density-changing boundaries, which is common on thin-film materials. ",
    "url": "https://arxiv.org/abs/2111.07613",
    "authors": [
      "Hua Tong",
      "Yong Ni"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2111.07683",
    "title": "Reachability analysis of neural networks using mixed monotonicity",
    "abstract": "This paper presents a new reachability analysis tool to compute an interval over-approximation of the output set of a feedforward neural network under given input uncertainty. The proposed approach adapts to neural networks an existing mixed-monotonicity method for the reachability analysis of dynamical systems and applies it to all possible partial networks within the given neural network. This ensures that the intersection of the obtained results is the tightest interval over-approximation of the output of each layer that can be obtained using mixed-monotonicity. Unlike other tools in the literature that focus on small classes of piecewise-affine or monotone activation functions, the main strength of our approach is its generality in the sense that it can handle neural networks with any Lipschitz-continuous activation function. In addition, the simplicity of the proposed framework allows users to very easily add unimplemented activation functions, by simply providing the function, its derivative and the global extrema and corresponding arguments of the derivative. Our algorithm is tested and compared to five other interval-based tools on 1000 randomly generated neural networks for four activation functions (ReLU, TanH, ELU, SiLU). We show that our tool always outperforms the Interval Bound Propagation method and that we obtain tighter output bounds than ReluVal, Neurify, VeriNet and CROWN (when they are applicable) in 15 to 60 percent of cases. ",
    "url": "https://arxiv.org/abs/2111.07683",
    "authors": [
      "Pierre-Jean Meyer"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.07860",
    "title": "Tracking in apps' privacy policies",
    "abstract": "Data protection law, including the General Data Protection Regulation (GDPR), usually requires a privacy policy before data can be collected from individuals. We analysed 15,145 privacy policies from 26,910 mobile apps in May 2019 (about one year after the GDPR came into force), finding that only opening the policy webpages shares data with third-parties for 48.5% of policies, potentially violating the GDPR. We compare this data sharing across countries, payment models (free, in-app-purchases, paid) and platforms (Google Play Store, Apple App Store). We further contacted 52 developers of apps, which did not provide a privacy policy, and asked them about their data practices. Despite being legally required to answer such queries, 12 developers (23%) failed to respond. ",
    "url": "https://arxiv.org/abs/2111.07860",
    "authors": [
      "Konrad Kollnig"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2111.07885",
    "title": "Heuristics for k-domination models of facility location problems in  street networks",
    "abstract": "We present new greedy and beam search heuristic methods to find small-size $k$-dominating sets in graphs. The methods are inspired by a new problem formulation which explicitly highlights a certain structure of the problem. An empirical evaluation of the new methods is done with respect to two existing methods, using instances of graphs corresponding to street networks. The k-domination problem with respect to this class of graphs can be used to model real-world facility location problem scenarios. For the classic minimum dominating set ($1$-domination) problem, all except one methods perform similarly, which is due to their equivalence in this particular case. However, for the k-domination problem with k>1, the new methods outperform the benchmark methods, and the performance gain is more significant for larger values of k. ",
    "url": "https://arxiv.org/abs/2111.07885",
    "authors": [
      "Padraig Corcoran",
      "Andrei Gagarin"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2111.07898",
    "title": "Category-orthogonal object features guide information processing in  recurrent neural networks trained for object categorization",
    "abstract": "Recurrent neural networks (RNNs) have been shown to perform better than feedforward architectures in visual object categorization tasks, especially in challenging conditions such as cluttered images. However, little is known about the exact computational role of recurrent information flow in these conditions. Here we test RNNs trained for object categorization on the hypothesis that recurrence iteratively aids object categorization via the communication of category-orthogonal auxiliary variables (the location, orientation, and scale of the object). Using diagnostic linear readouts, we find that: (a) information about auxiliary variables increases across time in all network layers, (b) this information is indeed present in the recurrent information flow, and (c) its manipulation significantly affects task performance. These observations confirm the hypothesis that category-orthogonal auxiliary variable information is conveyed through recurrent connectivity and is used to optimize category inference in cluttered environments. ",
    "url": "https://arxiv.org/abs/2111.07898",
    "authors": [
      "Sushrut Thorat",
      "Giacomo Aldegheri",
      "Tim C. Kietzmann"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.06890",
    "title": "Impact of loss functions on the performance of a deep neural network  designed to restore low-dose digital mammography",
    "abstract": "Digital mammography is still the most common imaging tool for breast cancer screening. Although the benefits of using digital mammography for cancer screening outweigh the risks associated with the x-ray exposure, the radiation dose must be kept as low as possible while maintaining the diagnostic utility of the generated images, thus minimizing patient risks. Many studies investigated the feasibility of dose reduction by restoring low-dose images using deep neural networks. In these cases, choosing the appropriate training database and loss function is crucial and impacts the quality of the results. In this work, a modification of the ResNet architecture, with hierarchical skip connections, is proposed to restore low-dose digital mammography. We compared the restored images to the standard full-dose images. Moreover, we evaluated the performance of several loss functions for this task. For training purposes, we extracted 256,000 image patches from a dataset of 400 images of retrospective clinical mammography exams, where different dose levels were simulated to generate low and standard-dose pairs. To validate the network in a real scenario, a physical anthropomorphic breast phantom was used to acquire real low-dose and standard full-dose images in a commercially avaliable mammography system, which were then processed through our trained model. An analytical restoration model for low-dose digital mammography, previously presented, was used as a benchmark in this work. Objective assessment was performed through the signal-to-noise ratio (SNR) and mean normalized squared error (MNSE), decomposed into residual noise and bias. Results showed that the perceptual loss function (PL4) is able to achieve virtually the same noise levels of a full-dose acquisition, while resulting in smaller signal bias compared to other loss functions. ",
    "url": "https://arxiv.org/abs/2111.06890",
    "authors": [
      "Hongming Shan",
      "Rodrigo de Barros Vimieiro",
      "Lucas Rodrigues Borges",
      "Marcelo Andrade da Costa Vieira",
      "Ge Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2111.07634",
    "title": "Pseudo-domains in imaging data improve prediction of future disease  status in multi-center studies",
    "abstract": "In multi-center randomized clinical trials imaging data can be diverse due to acquisition technology or scanning protocols. Models predicting future outcome of patients are impaired by this data heterogeneity. Here, we propose a prediction method that can cope with a high number of different scanning sites and a low number of samples per site. We cluster sites into pseudo-domains based on visual appearance of scans, and train pseudo-domain specific models. Results show that they improve the prediction accuracy for steatosis after 48 weeks from imaging data acquired at an initial visit and 12-weeks follow-up in liver disease ",
    "url": "https://arxiv.org/abs/2111.07634",
    "authors": [
      "Matthias Perkonigg",
      "Peter Mesenbrink",
      "Alexander Goehler",
      "Miljen Martic",
      "Ahmed Ba-Ssalamah",
      "Georg Langs"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.07725",
    "title": "Investigating self-supervised front ends for speech spoofing  countermeasures",
    "abstract": "Self-supervised speech model is a rapid progressing research topic, and many pre-trained models have been released and used in various down-stream tasks. For speech anti-spoofing, most countermeasures (CMs) are using signal processing algorithms to extract acoustic features for classification. In this study, we use pre-trained self-supervised speech models as the front end of spoofing CMs. We investigated different back end architectures to be combined with the self-supervised front end, the effectiveness of fine tuning the front end, and the performance of using different pre-trained self-supervised models. Our experiments found that, when a good pre-trained front end was fine tuned with either a shallow or a deep neural-network-based back end on the ASVspoof 2019 logical access (LA) training set, the resulting CM not only achieved a low EER score on the 2019 LA test set but also significantly outperformed the baseline on ASVspoof 2015, 2021 LA, and 2021 deepfake test sets. ",
    "url": "https://arxiv.org/abs/2111.07725",
    "authors": [
      "Xin Wang",
      "Junichi Yamagishi"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2111.07801",
    "title": "The ubiquitous efficiency of going further: how street networks affect  travel speed",
    "abstract": "As cities struggle to adapt to more ``people-centered'' urbanism, transportation planning and engineering must innovate to expand the street network strategically in order to ensure efficiency but also to deter sprawl. Here, we conducted a study of over 200 cities around the world to understand the impact that the patterns of deceleration points in streets due to traffic signs has in trajectories done from motorized vehicles. We demonstrate that there is a ubiquitous nonlinear relationship between time and distance in the optimal trajectories within each city. More precisely, given a specific period of time $\\tau$, without any traffic, one can move on average up to the distance $\\left \\langle D \\right \\rangle \\sim\\tau^\\beta$. We found a super-linear relationship for almost all cities in which $\\beta>1.0$. This points to an efficiency of scale when traveling large distances, meaning the average speed will be higher for longer trips when compared to shorter trips. We demonstrate that this efficiency is a consequence of the spatial distribution of large segments of streets without deceleration points, favoring access to routes in which a vehicle can cross large distances without stops. These findings show that cities must consider how their street morphology can affect travel speed. ",
    "url": "https://arxiv.org/abs/2111.07801",
    "authors": [
      "Gabriel L. Maia",
      "Caio Ponte",
      "Carlos Caminha",
      "Lara Furtado",
      "Hygor P. M. Melo",
      "Vasco Furtado"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2111.07845",
    "title": "Metric dimension on sparse graphs and its applications to zero forcing  sets",
    "abstract": "The metric dimension dim(G) of a graph $G$ is the minimum cardinality of a subset $S$ of vertices of $G$ such that each vertex of $G$ is uniquely determined by its distances to $S$. It is well-known that the metric dimension of a graph can be drastically increased by the modification of a single edge. Our main result consists in proving that the increase of the metric dimension of an edge addition can be amortized in the sense that if the graph consists of a spanning tree $T$ plus $c$ edges, then the metric dimension of $G$ is at most the metric dimension of $T$ plus $6c$. We then use this result to prove a weakening of a conjecture of Eroh et al. The zero forcing number $Z(G)$ of $G$ is the minimum cardinality of a subset $S$ of black vertices (whereas the other vertices are colored white) of $G$ such that all the vertices will turned black after applying finitely many times the following rule: a white vertex is turned black if it is the only white neighbor of a black vertex. Eroh et al. conjectured that, for any graph $G$, $dim(G)\\leq Z(G) + c(G)$, where $c(G)$ is the number of edges that have to be removed from $G$ to get a forest. They proved the conjecture is true for trees and unicyclic graphs. We prove a weaker version of the conjecture: $dim(G)\\leq Z(G)+6c(G)$ holds for any graph. We also prove that the conjecture is true for graphs with edge disjoint cycles, widely generalizing the unicyclic result of Eroh et al. ",
    "url": "https://arxiv.org/abs/2111.07845",
    "authors": [
      "Nicolas Bousquet",
      "Quentin Deschamps",
      "Aline Parreau",
      "Ignacio M. Pelayo"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2111.07892",
    "title": "Data privacy protection in microscopic image analysis for material data  mining",
    "abstract": "Recent progress in material data mining has been driven by high-capacity models trained on large datasets. However, collecting experimental data has been extremely costly owing to the amount of human effort and expertise required. Therefore, material researchers are often reluctant to easily disclose their private data, which leads to the problem of data island, and it is difficult to collect a large amount of data to train high-quality models. In this study, a material microstructure image feature extraction algorithm FedTransfer based on data privacy protection is proposed. The core contributions are as follows: 1) the federated learning algorithm is introduced into the polycrystalline microstructure image segmentation task to make full use of different user data to carry out machine learning, break the data island and improve the model generalization ability under the condition of ensuring the privacy and security of user data; 2) A data sharing strategy based on style transfer is proposed. By sharing style information of images that is not urgent for user confidentiality, it can reduce the performance penalty caused by the distribution difference of data among different users. ",
    "url": "https://arxiv.org/abs/2111.07892",
    "authors": [
      "Boyuan Ma",
      "Xiang Yin",
      "Xiaojuan Ban",
      "Haiyou Huang",
      "Neng Zhang",
      "Hao Wang",
      "Weihua Xue"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1910.10116",
    "title": "Sequential metric dimension for random graphs",
    "abstract": " Comments: Typos, errors corrected ",
    "url": "https://arxiv.org/abs/1910.10116",
    "authors": [
      "Gergely Ódor",
      "Patrick Thiran"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Data Structures and Algorithms (cs.DS)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2004.03114",
    "title": "Approximating Min-Mean-Cycle for low-diameter graphs in near-optimal  time and memory",
    "abstract": " Title: Approximating Min-Mean-Cycle for low-diameter graphs in near-optimal  time and memory ",
    "url": "https://arxiv.org/abs/2004.03114",
    "authors": [
      "Jason M. Altschuler",
      "Pablo A. Parrilo"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2010.11413",
    "title": "Predicting human decision making in psychological tasks with recurrent  neural networks",
    "abstract": " Title: Predicting human decision making in psychological tasks with recurrent  neural networks ",
    "url": "https://arxiv.org/abs/2010.11413",
    "authors": [
      "Baihan Lin",
      "Djallel Bouneffouf",
      "Guillermo Cecchi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2106.09820",
    "title": "Adversarial Detection Avoidance Attacks: Evaluating the robustness of  perceptual hashing-based client-side scanning",
    "abstract": " Title: Adversarial Detection Avoidance Attacks: Evaluating the robustness of  perceptual hashing-based client-side scanning ",
    "url": "https://arxiv.org/abs/2106.09820",
    "authors": [
      "Shubham Jain",
      "Ana-Maria Cretu",
      "Yves-Alexandre de Montjoye"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2106.10064",
    "title": "Fitting summary statistics of neural data with a differentiable spiking  network simulator",
    "abstract": " Title: Fitting summary statistics of neural data with a differentiable spiking  network simulator ",
    "url": "https://arxiv.org/abs/2106.10064",
    "authors": [
      "Guillaume Bellec",
      "Shuqi Wang",
      "Alireza Modirshanechi",
      "Johanni Brea",
      "Wulfram Gerstner"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2107.10246",
    "title": "Sampling from Potts on random graphs of unbounded degree via  random-cluster dynamics",
    "abstract": " Comments: 45 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2107.10246",
    "authors": [
      "Antonio Blanca",
      "Reza Gheissari"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Discrete Mathematics (cs.DM)",
      "Mathematical Physics (math-ph)"
    ]
  },
  {
    "id": "arXiv:2108.02221",
    "title": "Deep multi-task mining Calabi-Yau four-folds",
    "abstract": " Comments: 15 pages; additional details, references updated ",
    "url": "https://arxiv.org/abs/2108.02221",
    "authors": [
      "Harold Erbin",
      "Riccardo Finotello",
      "Robin Schneider",
      "Mohamed Tamaazousti"
    ],
    "subjectives": [
      "High Energy Physics - Theory (hep-th)",
      "Machine Learning (cs.LG)",
      "Algebraic Geometry (math.AG)"
    ]
  },
  {
    "id": "arXiv:2108.13672",
    "title": "Medical SANSformers: Training self-supervised transformers without  attention for Electronic Medical Records",
    "abstract": " Comments: 25 pages, 8 figures, 5 tables, Submitted to a journal ",
    "url": "https://arxiv.org/abs/2108.13672",
    "authors": [
      "Yogesh Kumar",
      "Alexander Ilin",
      "Henri Salo",
      "Sangita Kulathinal",
      "Maarit K. Leinonen",
      "Pekka Marttinen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.12329",
    "title": "The network signature of constellation line figures",
    "abstract": " Comments: 25 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2110.12329",
    "authors": [
      "Doina Bucur"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.13148",
    "title": "As if by magic: self-supervised training of deep despeckling networks  with MERLIN",
    "abstract": " Comments: To appear on IEEE Transactions on Geoscience and Remote Sensing ",
    "url": "https://arxiv.org/abs/2110.13148",
    "authors": [
      "Emanuele Dalsasso",
      "Loïc Denis",
      "Florence Tupin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  }
]