[
  {
    "id": "arXiv:2107.14234",
    "title": "Contact detection between an ellipsoid and a combination of quadrics",
    "abstract": "We analyze the characteristic polynomial associated to an ellipsoid and another quadric in the context of the contact detection problem. We obtain a necessary and sufficient condition for an efficient method to detect contact. This condition is a feature on the size and the shape of the quadrics and can be checked directly from their parameters. Under this hypothesis, contact can be noticed by means of discriminants of the characteristic polynomial. Furthermore, relative positions can be classified through the sign of the coefficients of this polynomial. ",
    "url": "https://arxiv.org/abs/2107.14234",
    "authors": [
      "Miguel Brozos-Vázquez",
      "M.J. Pereira-Sáez",
      "A. B. Rodríguez-Raposo",
      "M.J. Souto-Salorio",
      "A. D. Tarrío-Tobar"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2107.14344",
    "title": "Towards robust vision by multi-task learning on monkey visual cortex",
    "abstract": "Deep neural networks set the state-of-the-art across many tasks in computer vision, but their generalization ability to image distortions is surprisingly fragile. In contrast, the mammalian visual system is robust to a wide range of perturbations. Recent work suggests that this generalization ability can be explained by useful inductive biases encoded in the representations of visual stimuli throughout the visual cortex. Here, we successfully leveraged these inductive biases with a multi-task learning approach: we jointly trained a deep network to perform image classification and to predict neural activity in macaque primary visual cortex (V1). We measured the out-of-distribution generalization abilities of our network by testing its robustness to image distortions. We found that co-training on monkey V1 data leads to increased robustness despite the absence of those distortions during training. Additionally, we showed that our network's robustness is very close to that of an Oracle network where parts of the architecture are directly trained on noisy images. Our results also demonstrated that the network's representations become more brain-like as their robustness improves. Using a novel constrained reconstruction analysis, we investigated what makes our brain-regularized network more robust. We found that our co-trained network is more sensitive to content than noise when compared to a Baseline network that we trained for image classification alone. Using DeepGaze-predicted saliency maps for ImageNet images, we found that our monkey co-trained network tends to be more sensitive to salient regions in a scene, reminiscent of existing theories on the role of V1 in the detection of object borders and bottom-up saliency. Overall, our work expands the promising research avenue of transferring inductive biases from the brain, and provides a novel analysis of the effects of our transfer. ",
    "url": "https://arxiv.org/abs/2107.14344",
    "authors": [
      "Shahd Safarani",
      "Arne Nix",
      "Konstantin Willeke",
      "Santiago A. Cadena",
      "Kelli Restivo",
      "George Denfield",
      "Andreas S. Tolias",
      "Fabian H. Sinz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.14385",
    "title": "Random vector functional link neural network based ensemble deep  learning for short-term load forecasting",
    "abstract": "Electricity load forecasting is crucial for the power systems' planning and maintenance. However, its un-stationary and non-linear characteristics impose significant difficulties in anticipating future demand. This paper proposes a novel ensemble deep Random Vector Functional Link (edRVFL) network for electricity load forecasting. The weights of hidden layers are randomly initialized and kept fixed during the training process. The hidden layers are stacked to enforce deep representation learning. Then, the model generates the forecasts by ensembling the outputs of each layer. Moreover, we also propose to augment the random enhancement features by empirical wavelet transformation (EWT). The raw load data is decomposed by EWT in a walk-forward fashion, not introducing future data leakage problems in the decomposition process. Finally, all the sub-series generated by the EWT, including raw data, are fed into the edRVFL for forecasting purposes. The proposed model is evaluated on twenty publicly available time series from the Australian Energy Market Operator of the year 2020. The simulation results demonstrate the proposed model's superior performance over eleven forecasting methods in three error metrics and statistical tests on electricity load forecasting tasks. ",
    "url": "https://arxiv.org/abs/2107.14385",
    "authors": [
      "Ruobin Gao",
      "Liang Du",
      "P.N. Suganthan",
      "Qin Zhou",
      "Kum Fai Yuen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2107.14561",
    "title": "TASK3 DCASE2021 Challenge: Sound event localization and detection using  squeeze-excitation residual CNNs",
    "abstract": "Sound event localisation and detection (SELD) is a problem in the field of automatic listening that aims at the temporal detection and localisation (direction of arrival estimation) of sound events within an audio clip, usually of long duration. Due to the amount of data present in the datasets related to this problem, solutions based on deep learning have positioned themselves at the top of the state of the art. Most solutions are based on 2D representations of the audio (different spectrograms) that are processed by a convolutional-recurrent network. The motivation of this submission is to study the squeeze-excitation technique in the convolutional part of the network and how it improves the performance of the system. This study is based on the one carried out by the same team last year. This year, it has been decided to study how this technique improves each of the datasets (last year only the MIC dataset was studied). This modification shows an improvement in the performance of the system compared to the baseline using MIC dataset. ",
    "url": "https://arxiv.org/abs/2107.14561",
    "authors": [
      "Javier Naranjo-Alcazar",
      "Sergi Perez-Castanos",
      "Pedro Zuccarello",
      "Francesc J. Ferri",
      "Maximo Cobos"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2107.14582",
    "title": "NeuralDP Differentially private neural networks by design",
    "abstract": "The application of differential privacy to the training of deep neural networks holds the promise of allowing large-scale (decentralized) use of sensitive data while providing rigorous privacy guarantees to the individual. The predominant approach to differentially private training of neural networks is DP-SGD, which relies on norm-based gradient clipping as a method for bounding sensitivity, followed by the addition of appropriately calibrated Gaussian noise. In this work we propose NeuralDP, a technique for privatising activations of some layer within a neural network, which by the post-processing properties of differential privacy yields a differentially private network. We experimentally demonstrate on two datasets (MNIST and Pediatric Pneumonia Dataset (PPD)) that our method offers substantially improved privacy-utility trade-offs compared to DP-SGD. ",
    "url": "https://arxiv.org/abs/2107.14582",
    "authors": [
      "Moritz Knolle",
      "Dmitrii Usynin",
      "Alexander Ziller",
      "Marcus R. Makowski",
      "Daniel Rueckert",
      "Georgios Kaissis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2107.14585",
    "title": "Dynamic optimal congestion pricing in multi-region urban networks by  application of a Multi-Layer-Neural network",
    "abstract": "Traffic management by applying congestion pricing is a measure for mitigating congestion in protected city corridors. As a promising tool, pricing improves the level of service in a network and reduces travel delays. However, real-world implementations are restricted to static pricing, i.e., the price is fixed and not responsive to the prevailing regional traffic conditions. Dynamic pricing overcomes these limitations but also affects the users route choices. This work uses dynamic pricing's influence and predicts pricing functions to aim for a system optimal traffic distribution. The framework models a large-scale network where every region is considered homogeneous, allowing for the Macroscopic Fundamental Diagram (MFD) application. We compute Dynamic System Optimum (DSO) and a Quasi Dynamic User Equilibrium (QDUE) of the macroscopic model by formulating a linear optimization problem and utilizing the Dijkstra algorithm and a Multinomial Logit model (MNL), respectively. The equilibria allow us to find an optimal pricing methodology by training Multi-Layer-Neural (MLN) network models. We test our framework on a case study in Zurich, Switzerland, and showcase that (a) our neural network model learns the complex user behavior and (b) allows predicting optimal pricing functions. Results show a significant performance improvement when operating a transportation network in the DSO and highlight how dynamic pricing influences the user's route choice behavior towards the system optimal equilibrium. ",
    "url": "https://arxiv.org/abs/2107.14585",
    "authors": [
      "Alexander Genser",
      "Anastasios Kouvelas"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2107.14631",
    "title": "Critical ride comfort detection for automated vehicles",
    "abstract": "In a future connected vehicle environment, an optimized route and motion planning should not only fulfill efficiency and safety constraints but also minimize vehicle motions and oscillations, causing poor ride comfort perceived by passengers. This work provides a framework for a large-scale and cost-efficient evaluation to address AV's ride comfort and allow the comparison of different comfort assessment strategies. The proposed tool also gives insights to comfort data, allowing for the development of novel algorithms, guidelines, or motion planning systems incorporating passenger comfort. A vehicle-road simulation framework utilizable to assess the most common ride comfort determination strategies based on vehicle dynamics data is presented. The developed methodology encompasses a road surface model, a non-linear vehicle model optimization, and Monte Carlo simulations to allow for an accurate and cost-efficient generation of virtual chassis acceleration data. Ride comfort is determined by applying a commonly used threshold method and an analysis based on ISO 2631. The two methods are compared against comfort classifications based on empirical measurements of the International Roughness Index (IRI). A case study with three road sites in Austria demonstrates the framework's practical application with real data and achieves high-resolution ride comfort classifications. The results highlight that ISO 2631 comfort estimates are most similar to IRI classifications and that the thresholding procedure detects preventable situations but also over- or underestimates ride comfort. Hence, the work shows the potential risk of negative ride comfort of AVs using simple threshold values and stresses the importance of a robust comfort evaluation method for enhancing AVs' path and motion planning with maximal ride comfort. ",
    "url": "https://arxiv.org/abs/2107.14631",
    "authors": [
      "Alexander Genser",
      "Roland Spielhofer",
      "Philippe Nitsche",
      "Anastasios Kouvelas"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2107.14756",
    "title": "Unveiling the potential of Graph Neural Networks for robust Intrusion  Detection",
    "abstract": "The last few years have seen an increasing wave of attacks with serious economic and privacy damages, which evinces the need for accurate Network Intrusion Detection Systems (NIDS). Recent works propose the use of Machine Learning (ML) techniques for building such systems (e.g., decision trees, neural networks). However, existing ML-based NIDS are barely robust to common adversarial attacks, which limits their applicability to real networks. A fundamental problem of these solutions is that they treat and classify flows independently. In contrast, in this paper we argue the importance of focusing on the structural patterns of attacks, by capturing not only the individual flow features, but also the relations between different flows (e.g., the source/destination hosts they share). To this end, we use a graph representation that keeps flow records and their relationships, and propose a novel Graph Neural Network (GNN) model tailored to process and learn from such graph-structured information. In our evaluation, we first show that the proposed GNN model achieves state-of-the-art results in the well-known CIC-IDS2017 dataset. Moreover, we assess the robustness of our solution under two common adversarial attacks, that intentionally modify the packet size and inter-arrival times to avoid detection. The results show that our model is able to maintain the same level of accuracy as in previous experiments, while state-of-the-art ML techniques degrade up to 50% their accuracy (F1-score) under these attacks. This unprecedented level of robustness is mainly induced by the capability of our GNN model to learn flow patterns of attacks structured as graphs. ",
    "url": "https://arxiv.org/abs/2107.14756",
    "authors": [
      "David Pujol-Perich",
      "José Suárez-Varela",
      "Albert Cabellos-Aparicio",
      "Pere Barlet-Ros"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2107.14758",
    "title": "A scalable and robust preconditioner for high-order FEM based on the  fast diagonalization method",
    "abstract": "Pavarino proved that the additive Schwarz method with vertex patches and a low-order coarse space gives a $p$-robust solver for symmetric and coercive problems. However, for very high polynomial degree it is not feasible to assemble or factorize the matrices for each patch. In this work we introduce a direct solver for separable patch problems that scales to very high polynomial degree on tensor product cells. The solver constructs a tensor product basis that diagonalizes the blocks in the stiffness matrix for the internal degrees of freedom of each individual cell. As a result, the non-zero structure of the cell matrices is that of the graph connecting internal degrees of freedom to their projection onto the facets. In the new basis, the patch problem is as sparse as a low-order finite difference discretization, while having a sparser Cholesky factorization. We can thus afford to assemble and factorize the matrices for the vertex-patch problems, even for very high polynomial degree. In the non-separable case, the method can be applied as a preconditioner by approximating the problem with a separable surrogate. ",
    "url": "https://arxiv.org/abs/2107.14758",
    "authors": [
      "Pablo D. Brubeck",
      "Patrick E. Farrell"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2107.14776",
    "title": "Synthetic flow-based cryptomining attack generation through Generative  Adversarial Networks",
    "abstract": "Due to the growing rise of cyber attacks in the Internet, flow-based data sets are crucial to increase the performance of the Machine Learning (ML) components that run in network-based intrusion detection systems (IDS). To overcome the existing network traffic data shortage in attack analysis, recent works propose Generative Adversarial Networks (GANs) for synthetic flow-based network traffic generation. Data privacy is appearing more and more as a strong requirement when processing such network data, which suggests to find solutions where synthetic data can fully replace real data. Because of the ill-convergence of the GAN training, none of the existing solutions can generate high-quality fully synthetic data that can totally substitute real data in the training of IDS ML components. Therefore, they mix real with synthetic data, which acts only as data augmentation components, leading to privacy breaches as real data is used. In sharp contrast, in this work we propose a novel deterministic way to measure the quality of the synthetic data produced by a GAN both with respect to the real data and to its performance when used for ML tasks. As a byproduct, we present a heuristic that uses these metrics for selecting the best performing generator during GAN training, leading to a stopping criterion. An additional heuristic is proposed to select the best performing GANs when different types of synthetic data are to be used in the same ML task. We demonstrate the adequacy of our proposal by generating synthetic cryptomining attack traffic and normal traffic flow-based data using an enhanced version of a Wasserstein GAN. We show that the generated synthetic network traffic can completely replace real data when training a ML-based cryptomining detector, obtaining similar performance and avoiding privacy violations, since real data is not used in the training of the ML-based detector. ",
    "url": "https://arxiv.org/abs/2107.14776",
    "authors": [
      "Alberto Mozo",
      "Ángel González-Prieto",
      "Antonio Pastor",
      "Sandra Gómez-Canaval",
      "Edgar Talavera"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.14235",
    "title": "EEG multipurpose eye blink detector using convolutional neural network",
    "abstract": "The electrical signal emitted by the eyes movement produces a very strong artifact on EEG signaldue to its close proximity to the sensors and abundance of occurrence. In the context of detectingeye blink artifacts in EEG waveforms for further removal and signal purification, multiple strategieswhere proposed in the literature. Most commonly applied methods require the use of a large numberof electrodes, complex equipment for sampling and processing data. The goal of this work is to createa reliable and user independent algorithm for detecting and removing eye blink in EEG signals usingCNN (convolutional neural network). For training and validation, three sets of public EEG data wereused. All three sets contain samples obtained while the recruited subjects performed assigned tasksthat included blink voluntarily in specific moments, watch a video and read an article. The modelused in this study was able to have an embracing understanding of all the features that distinguish atrivial EEG signal from a signal contaminated with eye blink artifacts without being overfitted byspecific features that only occurred in the situations when the signals were registered. ",
    "url": "https://arxiv.org/abs/2107.14235",
    "authors": [
      "Amanda Ferrari Iaquinta",
      "Ana Carolina de Sousa Silva",
      "Aldrumont Ferraz Júnior",
      "Jessica Monique de Toledo",
      "Gustavo Voltani von Atzingen"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.14466",
    "title": "Quotients of probabilistic Boolean networks",
    "abstract": "A probabilistic Boolean network (PBN) is a discrete-time system composed of a collection of Boolean networks between which the PBN switches in a stochastic manner. This paper focuses on the study of quotients of PBNs. Given a PBN and an equivalence relation on its state set, we consider a probabilistic transition system that is generated by the PBN; the resulting quotient transition system then automatically captures the quotient behavior of this PBN. We therefore describe a method for obtaining a probabilistic Boolean system that generates the transitions of the quotient transition system. Applications of this quotient description are discussed, and it is shown that for PBNs, controller synthesis can be performed easily by first controlling a quotient system and then lifting the control law back to the original network. A biological example is given to show the usefulness of the developed results. ",
    "url": "https://arxiv.org/abs/2107.14466",
    "authors": [
      "Rui Li",
      "Qi Zhang",
      "Tianguang Chu"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2107.14747",
    "title": "A common variable minimax theorem for graphs",
    "abstract": "Let $\\mathcal{G} = \\{G_1 = (V, E_1), \\dots, G_m = (V, E_m)\\}$ be a collection of $m$ graphs defined on a common set of vertices $V$ but with different edge sets $E_1, \\dots, E_m$. Informally, a function $f :V \\rightarrow \\mathbb{R}$ is smooth with respect to $G_k = (V,E_k)$ if $f(u) \\sim f(v)$ whenever $(u, v) \\in E_k$. We study the problem of understanding whether there exists a nonconstant function that is smooth with respect to all graphs in $\\mathcal{G}$, simultaneously, and how to find it if it exists. ",
    "url": "https://arxiv.org/abs/2107.14747",
    "authors": [
      "Ronald R. Coifman",
      "Nicholas F. Marshall",
      "Stefan Steinerberger"
    ],
    "subjectives": [
      "Spectral Theory (math.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.12559",
    "title": "Mittag-Leffler functions and their applications in network science",
    "abstract": " Title: Mittag-Leffler functions and their applications in network science ",
    "url": "https://arxiv.org/abs/2103.12559",
    "authors": [
      "Francesca Arrigo",
      "Fabio Durastante"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2103.13870",
    "title": "A novel weighted approach for time series forecasting based on  visibility graph",
    "abstract": " Title: A novel weighted approach for time series forecasting based on  visibility graph ",
    "url": "https://arxiv.org/abs/2103.13870",
    "authors": [
      "Tianxiang Zhan",
      "Fuyuan Xiao"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  }
]