[
  {
    "id": "arXiv:2109.01206",
    "title": "Mechanical Chameleons: Evaluating the effects of a social robot's  non-verbal behavior on social influence",
    "abstract": "In this paper we present a pilot study which investigates how non-verbal behavior affects social influence in social robots. We also present a modular system which is capable of controlling the non-verbal behavior based on the interlocutor's facial gestures (head movements and facial expressions) in real time, and a study investigating whether three different strategies for facial gestures (\"still\", \"natural movement\", i.e. movements recorded from another conversation, and \"copy\", i.e. mimicking the user with a four second delay) has any affect on social influence and decision making in a \"survival task\". Our preliminary results show there was no significant difference between the three conditions, but this might be due to among other things a low number of study participants (12). ",
    "url": "https://arxiv.org/abs/2109.01206",
    "authors": [
      "Patrik Jonell",
      "Anna Deichler",
      "Ilaria Torre",
      "Iolanda Leite",
      "Jonas Beskow"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2109.01451",
    "title": "Impact of GPU uncertainty on the training of predictive deep neural  networks",
    "abstract": "Deep neural networks often present uncertainties such as hardware- and software-derived noise and randomness. We studied the effects of such uncertainty on learning outcomes, with a particular focus on the function of graphics processing units (GPUs), and found that GPU-induced uncertainty increased learning accuracy of a certain deep neural network. When training a predictive deep neural network using only the CPU without the GPU, the learning error is higher than when training the same number of epochs using the GPU, suggesting that the GPU plays a different role in the learning process than just increasing the computational speed. Because this effect cannot be observed in learning by a simple autoencoder, it could be a phenomenon specific to certain types of neural networks. GPU-specific computational processing is more indeterminate than that by CPUs, and hardware-derived uncertainties, which are often considered obstacles that need to be eliminated, might, in some cases, be successfully incorporated into the training of deep neural networks. Moreover, such uncertainties might be interesting phenomena to consider in brain-related computational processing, which comprises a large mass of uncertain signals. ",
    "url": "https://arxiv.org/abs/2109.01451",
    "authors": [
      "Maciej Pietrowski",
      "Andrzej Gajda",
      "Takuto Yamamoto",
      "Taisuke Kobayashi",
      "Lana Sinapayen",
      "Eiji Watanabe"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2109.01527",
    "title": "Hide and seek in Slovakia: utilizing tracking code data to uncover  untrustworthy website networks",
    "abstract": "The proliferation of misleading or false information spread by untrustworthy websites has emerged as a significant concern on the public agenda in many countries, including Slovakia. Despite the influence ascribed to such websites, their transparency and accountability remain an issue in most cases, with published work on mapping the administrators and connections of untrustworthy websites remaining limited. This article contributes to this body of knowledge (i) by providing an effective open-source tool to uncover untrustworthy website networks based on the utilization of the same Google Analytics/AdSense IDs, with the added ability to expose networks based on historical data, and (ii) by providing insight into the Slovak untrustworthy website landscape through delivering a first of its kind mapping of Slovak untrustworthy website networks. Our approach is based on a mix-method design employing a qualitative exploration of data collected in a two wave study conducted in 2019 and 2021, utilizing a custom-coded tool to uncover website connections. Overall, the study succeeds in exposing multiple novel website ties. Our findings indicate that while some untrustworthy website networks have been found to operate in the Slovak infosphere, most researched websites appear to be run by multiple mutually unconnected administrators. The resulting data also demonstrates that untrustworthy Slovak websites display a high content diversity in terms of connected websites, ranging from websites of local NGOs, an e-shop selling underwear to a matchmaking portal. ",
    "url": "https://arxiv.org/abs/2109.01527",
    "authors": [
      "Jozef Michal Mintal",
      "Michal Kalman",
      "Karol Fabián"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2109.00116",
    "title": "Universality, criticality and complexity of information propagation in  social media",
    "abstract": "Information avalanches in social media are typically studied in a similar fashion as avalanches of neuronal activity in the brain. Whereas a large body of literature reveals substantial agreement about the existence of a unique process characterizing neuronal activity across organisms, the dynamics of information in online social media is far less understood. Statistical laws of information avalanches are found in previous studies to be not robust across systems, and radically different processes are used to represent plausible driving mechanisms for information propagation. Here, we analyze almost 1 billion time-stamped events collected from a multitude of online platforms -- including Telegram, Twitter and Weibo -- over observation windows longer than 10 years to show that the propagation of information in social media is a universal and critical process. Universality arises from the observation of identical macroscopic patterns across platforms, irrespective of the details of the specific system at hand. Critical behavior is deduced from the power-law distributions, and corresponding hyperscaling relations, characterizing size and duration of avalanches of information. Neuronal activity may be modeled as a simple contagion process, where only a single exposure to activity may be sufficient for its diffusion. On the contrary, statistical testing on our data indicates that a mixture of simple and complex contagion, where involvement of an individual requires exposure from multiple acquaintances, characterizes the propagation of information in social media. We show that the complexity of the process is correlated with the semantic content of the information that is propagated. Conversational topics about music, movies and TV shows tend to propagate as simple contagion processes, whereas controversial discussions on political/societal themes obey the rules of complex contagion. ",
    "url": "https://arxiv.org/abs/2109.00116",
    "authors": [
      "Daniele Notarmuzi",
      "Claudio Castellano",
      "Alessandro Flammini",
      "Dario Mazzilli",
      "Filippo Radicchi"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2109.01294",
    "title": "Measurement-device-independent quantum key distribution for  nonstandalone networks",
    "abstract": "Untrusted node networks initially implemented by measurement-device-independent quantum key distribution (MDI-QKD) protocol are a crucial step on the roadmap of the quantum Internet. Considering extensive QKD implementations of trusted node networks, a workable upgrading tactic of existing networks toward MDI networks needs to be explicit. Here, referring to the nonstandalone (NSA) network of 5G, we propose an NSA-MDI scheme as an evolutionary selection for existing phase-encoding BB84 networks. Our solution can upgrade the BB84 networks and terminals that employ various phase-encoding schemes to immediately support MDI without hardware changes. This cost-effective upgrade effectively promotes the deployment of MDI networks as a step of untrusted node networks while taking full advantage of existing networks. In addition, the diversified demands on security and bandwidth are satisfied, and network survivability is improved. ",
    "url": "https://arxiv.org/abs/2109.01294",
    "authors": [
      "Guan-Jie Fan-Yuan",
      "Feng-Yu Lu",
      "Shuang Wang",
      "Zhen-Qiang Yin",
      "De-Yong He",
      "Zheng Zhou",
      "Jun Teng",
      "Wei Chen",
      "Guang-Can Guo",
      "Zheng-Fu Han"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2109.01485",
    "title": "MitoDet: Simple and robust mitosis detection",
    "abstract": "Mitotic figure detection is a challenging task in digital pathology that has a direct impact on therapeutic decisions. While automated methods often achieve acceptable results under laboratory conditions, they frequently fail in the clinical deployment phase. This problem can be mainly attributed to a phenomenon called domain shift. An important source of a domain shift is introduced by different microscopes and their camera systems, which noticeably change the color representation of digitized images. In this method description we present our submitted algorithm for the Mitosis Domain Generalization Challenge, which employs a RetinaNet trained with strong data augmentation and achieves an F1 score of 0.7138 on the preliminary test set. ",
    "url": "https://arxiv.org/abs/2109.01485",
    "authors": [
      "Jakob Dexl",
      "Michaela Benz",
      "Volker Bruns",
      "Petr Kuritcyn",
      "Thomas Wittenberg"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2007.03193",
    "title": "Policies for elementary links in a quantum network",
    "abstract": " Comments: 17+38 pages, 5 figures. Minor changes; accepted for publication in Quantum ",
    "url": "https://arxiv.org/abs/2007.03193",
    "authors": [
      "Sumeet Khatri"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2101.00962",
    "title": "Hybrid FEM-NN models: Combining artificial neural networks with the  finite element method",
    "abstract": " Title: Hybrid FEM-NN models: Combining artificial neural networks with the  finite element method ",
    "url": "https://arxiv.org/abs/2101.00962",
    "authors": [
      "Sebastian K. Mitusch",
      "Simon W. Funke",
      "Miroslav Kuchta"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2102.08524",
    "title": "Applications of optimal nonlinear control to a whole-brain network of  FitzHugh-Nagumo oscillators",
    "abstract": " Comments: Main paper: 20 pages, 14 figures; supplemental material: 10 pages, 9 figures. For associated video files, see this https URL ",
    "url": "https://arxiv.org/abs/2102.08524",
    "authors": [
      "Teresa Chouzouris",
      "Nicolas Roth",
      "Caglar Cakan",
      "Klaus Obermayer"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Systems and Control (eess.SY)",
      "Adaptation and Self-Organizing Systems (nlin.AO)"
    ]
  },
  {
    "id": "arXiv:2103.00151",
    "title": "Affine equivalences of surfaces of translation and minimal surfaces, and  applications to symmetry detection and design",
    "abstract": " Comments: 22 pages ",
    "url": "https://arxiv.org/abs/2103.00151",
    "authors": [
      "Juan Gerardo Alcázar",
      "Georg Muntingh"
    ],
    "subjectives": [
      "Algebraic Geometry (math.AG)",
      "Computational Geometry (cs.CG)",
      "Symbolic Computation (cs.SC)"
    ]
  },
  {
    "id": "arXiv:2103.05872",
    "title": "Sampling methods for efficient training of graph convolutional networks:  A survey",
    "abstract": " Comments: Accepted by IEEE/CAA Journal of Automatica Sinica ",
    "url": "https://arxiv.org/abs/2103.05872",
    "authors": [
      "Xin Liu",
      "Mingyu Yan",
      "Lei Deng",
      "Guoqi Li",
      "Xiaochun Ye",
      "Dongrui Fan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  }
]