[
  {
    "id": "arXiv:2404.10780",
    "title": "Phishing Website Detection Using a Combined Model of ANN and LSTM",
    "abstract": "In this digital era, our lives highly depend on the internet and worldwide technology. Wide usage of technology and platforms of communication makes our lives better and easier. But on the other side it carries out some security issues and cruel activities, phishing is one activity of these cruel activities. It is a type of cybercrime, which has the purpose of stealing the personal information of the computer user, and enterprises, which carry out fake websites that are the copy of the original websites. The attackers used personal information like account IDs, passwords, and usernames for the purpose of some fraudulent activities against the user of the computer. To overcome this problem researchers focused on the machine learning and deep learning approaches. In our study, we are going to use machine learning and deep learning models to identify the fake web pages on the secondary dataset. ",
    "url": "https://arxiv.org/abs/2404.10780",
    "authors": [
      "Muhammad Shoaib Farooq",
      "Hina jabbar"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2404.10784",
    "title": "Graph Vertex Embeddings: Distance, Regularization and Community  Detection",
    "abstract": "Graph embeddings have emerged as a powerful tool for representing complex network structures in a low-dimensional space, enabling the use of efficient methods that employ the metric structure in the embedding space as a proxy for the topological structure of the data. In this paper, we explore several aspects that affect the quality of a vertex embedding of graph-structured data. To this effect, we first present a family of flexible distance functions that faithfully capture the topological distance between different vertices. Secondly, we analyze vertex embeddings as resulting from a fitted transformation of the distance matrix rather than as a direct result of optimization. Finally, we evaluate the effectiveness of our proposed embedding constructions by performing community detection on a host of benchmark datasets. The reported results are competitive with classical algorithms that operate on the entire graph while benefitting from a substantially reduced computational complexity due to the reduced dimensionality of the representations. ",
    "url": "https://arxiv.org/abs/2404.10784",
    "authors": [
      "Radosław Nowak",
      "Adam Małkowski",
      "Daniel Cieślak",
      "Piotr Sokół",
      "Paweł Wawrzyński"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.10788",
    "title": "The Path To Autonomous Cyber Defense",
    "abstract": "Defenders are overwhelmed by the number and scale of attacks against their networks.This problem will only be exacerbated as attackers leverage artificial intelligence to automate their workflows. We propose a path to autonomous cyber agents able to augment defenders by automating critical steps in the cyber defense life cycle. ",
    "url": "https://arxiv.org/abs/2404.10788",
    "authors": [
      "Sean Oesch",
      "Phillipe Austria",
      "Amul Chaulagain",
      "Brian Weber",
      "Cory Watson",
      "Matthew Dixson",
      "Amir Sadovnik"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.10789",
    "title": "PASA: Attack Agnostic Unsupervised Adversarial Detection using  Prediction & Attribution Sensitivity Analysis",
    "abstract": "Deep neural networks for classification are vulnerable to adversarial attacks, where small perturbations to input samples lead to incorrect predictions. This susceptibility, combined with the black-box nature of such networks, limits their adoption in critical applications like autonomous driving. Feature-attribution-based explanation methods provide relevance of input features for model predictions on input samples, thus explaining model decisions. However, we observe that both model predictions and feature attributions for input samples are sensitive to noise. We develop a practical method for this characteristic of model prediction and feature attribution to detect adversarial samples. Our method, PASA, requires the computation of two test statistics using model prediction and feature attribution and can reliably detect adversarial samples using thresholds learned from benign samples. We validate our lightweight approach by evaluating the performance of PASA on varying strengths of FGSM, PGD, BIM, and CW attacks on multiple image and non-image datasets. On average, we outperform state-of-the-art statistical unsupervised adversarial detectors on CIFAR-10 and ImageNet by 14\\% and 35\\% ROC-AUC scores, respectively. Moreover, our approach demonstrates competitive performance even when an adversary is aware of the defense mechanism. ",
    "url": "https://arxiv.org/abs/2404.10789",
    "authors": [
      "Dipkamal Bhusal",
      "Md Tanvirul Alam",
      "Monish K. Veerabhadran",
      "Michael Clifford",
      "Sara Rampazzi",
      "Nidhi Rastogi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.10790",
    "title": "Multimodal Attack Detection for Action Recognition Models",
    "abstract": "Adversarial machine learning attacks on video action recognition models is a growing research area and many effective attacks were introduced in recent years. These attacks show that action recognition models can be breached in many ways. Hence using these models in practice raises significant security concerns. However, there are very few works which focus on defending against or detecting attacks. In this work, we propose a novel universal detection method which is compatible with any action recognition model. In our extensive experiments, we show that our method consistently detects various attacks against different target models with high true positive rates while satisfying very low false positive rates. Tested against four state-of-the-art attacks targeting four action recognition models, the proposed detector achieves an average AUC of 0.911 over 16 test cases while the best performance achieved by the existing detectors is 0.645 average AUC. This 41.2% improvement is enabled by the robustness of the proposed detector to varying attack methods and target models. The lowest AUC achieved by our detector across the 16 test cases is 0.837 while the competing detector's performance drops as low as 0.211. We also show that the proposed detector is robust to varying attack strengths. In addition, we analyze our method's real-time performance with different hardware setups to demonstrate its potential as a practical defense mechanism. ",
    "url": "https://arxiv.org/abs/2404.10790",
    "authors": [
      "Furkan Mumcu",
      "Yasin Yilmaz"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.10796",
    "title": "Black-box Adversarial Transferability: An Empirical Study in  Cybersecurity Perspective",
    "abstract": "The rapid advancement of artificial intelligence within the realm of cybersecurity raises significant security concerns. The vulnerability of deep learning models in adversarial attacks is one of the major issues. In adversarial machine learning, malicious users try to fool the deep learning model by inserting adversarial perturbation inputs into the model during its training or testing phase. Subsequently, it reduces the model confidence score and results in incorrect classifications. The novel key contribution of the research is to empirically test the black-box adversarial transferability phenomena in cyber attack detection systems. It indicates that the adversarial perturbation input generated through the surrogate model has a similar impact on the target model in producing the incorrect classification. To empirically validate this phenomenon, surrogate and target models are used. The adversarial perturbation inputs are generated based on the surrogate-model for which the hacker has complete information. Based on these adversarial perturbation inputs, both surrogate and target models are evaluated during the inference phase. We have done extensive experimentation over the CICDDoS-2019 dataset, and the results are classified in terms of various performance metrics like accuracy, precision, recall, and f1-score. The findings indicate that any deep learning model is highly susceptible to adversarial attacks, even if the attacker does not have access to the internal details of the target model. The results also indicate that white-box adversarial attacks have a severe impact compared to black-box adversarial attacks. There is a need to investigate and explore adversarial defence techniques to increase the robustness of the deep learning models against adversarial attacks. ",
    "url": "https://arxiv.org/abs/2404.10796",
    "authors": [
      "Khushnaseeb Roshan",
      "Aasim Zafar"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.10800",
    "title": "Advancing Network Intrusion Detection: Integrating Graph Neural Networks  with Scattering Transform and Node2Vec for Enhanced Anomaly Detection",
    "abstract": "In this paper, we present two novel methods in Network Intrusion Detection Systems (NIDS) using Graph Neural Networks (GNNs). The first approach, Scattering Transform with E-GraphSAGE (STEG), utilizes the scattering transform to conduct multi-resolution analysis of edge feature vectors. This provides a detailed representation that is essential for identifying subtle anomalies in network traffic. The second approach improves node representation by initiating with Node2Vec, diverging from standard methods of using uniform values, thereby capturing a more accurate and holistic network picture. Our methods have shown significant improvements in performance compared to existing state-of-the-art methods in benchmark NIDS datasets. ",
    "url": "https://arxiv.org/abs/2404.10800",
    "authors": [
      "Abdeljalil Zoubir",
      "Badr Missaoui"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.10838",
    "title": "Dynamic Self-adaptive Multiscale Distillation from Pre-trained  Multimodal Large Model for Efficient Cross-modal Representation Learning",
    "abstract": "In recent years, pre-trained multimodal large models have attracted widespread attention due to their outstanding performance in various multimodal applications. Nonetheless, the extensive computational resources and vast datasets required for their training present significant hurdles for deployment in environments with limited computational resources. To address this challenge, we propose a novel dynamic self-adaptive multiscale distillation from pre-trained multimodal large model for efficient cross-modal representation learning for the first time. Unlike existing distillation methods, our strategy employs a multiscale perspective, enabling the extraction structural knowledge across from the pre-trained multimodal large model. Ensuring that the student model inherits a comprehensive and nuanced understanding of the teacher knowledge. To optimize each distillation loss in a balanced and efficient manner, we propose a dynamic self-adaptive distillation loss balancer, a novel component eliminating the need for manual loss weight adjustments and dynamically balances each loss item during the distillation process. Our methodology streamlines pre-trained multimodal large models using only their output features and original image-level information, requiring minimal computational resources. This efficient approach is suited for various applications and allows the deployment of advanced multimodal technologies even in resource-limited settings. Extensive experiments has demonstrated that our method maintains high performance while significantly reducing model complexity and training costs. Moreover, our distilled student model utilizes only image-level information to achieve state-of-the-art performance on cross-modal retrieval tasks, surpassing previous methods that relied on region-level information. ",
    "url": "https://arxiv.org/abs/2404.10838",
    "authors": [
      "Zhengyang Liang",
      "Meiyu Liang",
      "Wei Huang",
      "Yawen Li",
      "Zhe Xue"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2404.10842",
    "title": "Unsupervised Speaker Diarization in Distributed IoT Networks Using  Federated Learning",
    "abstract": "This paper presents a computationally efficient and distributed speaker diarization framework for networked IoT-style audio devices. The work proposes a Federated Learning model which can identify the participants in a conversation without the requirement of a large audio database for training. An unsupervised online update mechanism is proposed for the Federated Learning model which depends on cosine similarity of speaker embeddings. Moreover, the proposed diarization system solves the problem of speaker change detection via. unsupervised segmentation techniques using Hotelling's t-squared Statistic and Bayesian Information Criterion. In this new approach, speaker change detection is biased around detected quasi-silences, which reduces the severity of the trade-off between the missed detection and false detection rates. Additionally, the computational overhead due to frame-by-frame identification of speakers is reduced via. unsupervised clustering of speech segments. The results demonstrate the effectiveness of the proposed training method in the presence of non-IID speech data. It also shows a considerable improvement in the reduction of false and missed detection at the segmentation stage, while reducing the computational overhead. Improved accuracy and reduced computational cost makes the mechanism suitable for real-time speaker diarization across a distributed IoT audio network. ",
    "url": "https://arxiv.org/abs/2404.10842",
    "authors": [
      "Amit Kumar Bhuyan",
      "Hrishikesh Dutta",
      "Subir Biswas"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2404.10843",
    "title": "Geometric Neural Operators (GNPs) for Data-Driven Deep Learning of  Non-Euclidean Operators",
    "abstract": "We introduce Geometric Neural Operators (GNPs) for accounting for geometric contributions in data-driven deep learning of operators. We show how GNPs can be used (i) to estimate geometric properties, such as the metric and curvatures, (ii) to approximate Partial Differential Equations (PDEs) on manifolds, (iii) learn solution maps for Laplace-Beltrami (LB) operators, and (iv) to solve Bayesian inverse problems for identifying manifold shapes. The methods allow for handling geometries of general shape including point-cloud representations. The developed GNPs provide approaches for incorporating the roles of geometry in data-driven learning of operators. ",
    "url": "https://arxiv.org/abs/2404.10843",
    "authors": [
      "Blaine Quackenbush",
      "Paul J. Atzberger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2404.10857",
    "title": "D3CODE: Disentangling Disagreements in Data across Cultures on  Offensiveness Detection and Evaluation",
    "abstract": "While human annotations play a crucial role in language technologies, annotator subjectivity has long been overlooked in data collection. Recent studies that have critically examined this issue are often situated in the Western context, and solely document differences across age, gender, or racial groups. As a result, NLP research on subjectivity have overlooked the fact that individuals within demographic groups may hold diverse values, which can influence their perceptions beyond their group norms. To effectively incorporate these considerations into NLP pipelines, we need datasets with extensive parallel annotations from various social and cultural groups. In this paper we introduce the \\dataset dataset: a large-scale cross-cultural dataset of parallel annotations for offensive language in over 4.5K sentences annotated by a pool of over 4k annotators, balanced across gender and age, from across 21 countries, representing eight geo-cultural regions. The dataset contains annotators' moral values captured along six moral foundations: care, equality, proportionality, authority, loyalty, and purity. Our analyses reveal substantial regional variations in annotators' perceptions that are shaped by individual moral values, offering crucial insights for building pluralistic, culturally sensitive NLP models. ",
    "url": "https://arxiv.org/abs/2404.10857",
    "authors": [
      "Aida Mostafazadeh Davani",
      "Mark Díaz",
      "Dylan Baker",
      "Vinodkumar Prabhakaran"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.10865",
    "title": "OSR-ViT: A Simple and Modular Framework for Open-Set Object Detection  and Discovery",
    "abstract": "An object detector's ability to detect and flag \\textit{novel} objects during open-world deployments is critical for many real-world applications. Unfortunately, much of the work in open object detection today is disjointed and fails to adequately address applications that prioritize unknown object recall \\textit{in addition to} known-class accuracy. To close this gap, we present a new task called Open-Set Object Detection and Discovery (OSODD) and as a solution propose the Open-Set Regions with ViT features (OSR-ViT) detection framework. OSR-ViT combines a class-agnostic proposal network with a powerful ViT-based classifier. Its modular design simplifies optimization and allows users to easily swap proposal solutions and feature extractors to best suit their application. Using our multifaceted evaluation protocol, we show that OSR-ViT obtains performance levels that far exceed state-of-the-art supervised methods. Our method also excels in low-data settings, outperforming supervised baselines using a fraction of the training data. ",
    "url": "https://arxiv.org/abs/2404.10865",
    "authors": [
      "Matthew Inkawhich",
      "Nathan Inkawhich",
      "Hao Yang",
      "Jingyang Zhang",
      "Randolph Linderman",
      "Yiran Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.10883",
    "title": "Automated Discovery of Functional Actual Causes in Complex Environments",
    "abstract": "Reinforcement learning (RL) algorithms often struggle to learn policies that generalize to novel situations due to issues such as causal confusion, overfitting to irrelevant factors, and failure to isolate control of state factors. These issues stem from a common source: a failure to accurately identify and exploit state-specific causal relationships in the environment. While some prior works in RL aim to identify these relationships explicitly, they rely on informal domain-specific heuristics such as spatial and temporal proximity. Actual causality offers a principled and general framework for determining the causes of particular events. However, existing definitions of actual cause often attribute causality to a large number of events, even if many of them rarely influence the outcome. Prior work on actual causality proposes normality as a solution to this problem, but its existing implementations are challenging to scale to complex and continuous-valued RL environments. This paper introduces functional actual cause (FAC), a framework that uses context-specific independencies in the environment to restrict the set of actual causes. We additionally introduce Joint Optimization for Actual Cause Inference (JACI), an algorithm that learns from observational data to infer functional actual causes. We demonstrate empirically that FAC agrees with known results on a suite of examples from the actual causality literature, and JACI identifies actual causes with significantly higher accuracy than existing heuristic methods in a set of complex, continuous-valued environments. ",
    "url": "https://arxiv.org/abs/2404.10883",
    "authors": [
      "Caleb Chuck",
      "Sankaran Vaidyanathan",
      "Stephen Giguere",
      "Amy Zhang",
      "David Jensen",
      "Scott Niekum"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2404.10890",
    "title": "Exploring Augmentation and Cognitive Strategies for AI based Synthetic  Personae",
    "abstract": "Large language models (LLMs) hold potential for innovative HCI research, including the creation of synthetic personae. However, their black-box nature and propensity for hallucinations pose challenges. To address these limitations, this position paper advocates for using LLMs as data augmentation systems rather than zero-shot generators. We further propose the development of robust cognitive and memory frameworks to guide LLM responses. Initial explorations suggest that data enrichment, episodic memory, and self-reflection techniques can improve the reliability of synthetic personae and open up new avenues for HCI research. ",
    "url": "https://arxiv.org/abs/2404.10890",
    "authors": [
      "Rafael Arias Gonzalez",
      "Steve DiPaola"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2404.10897",
    "title": "The Future of Research on Social Technologies: CCC Workshop Visioning  Report",
    "abstract": "Social technologies are the systems, interfaces, features, infrastructures, and architectures that allow people to interact with each other online. These technologies dramatically shape the fabric of our everyday lives, from the information we consume to the people we interact with to the foundations of our culture and politics. While the benefits of social technologies are well documented, the harms, too, have cast a long shadow. To address widespread problems like harassment, disinformation, information access, and mental health concerns, we need to rethink the foundations of how social technologies are designed, sustained, and governed. This report is based on discussions at the Computing Community Consortium Workshop, The Future of Research on Social Technologies, that was held November 2-3, 2023 in Washington, DC. The visioning workshop came together to focus on two questions. What should we know about social technologies, and what is needed to get there? The workshop brought together over 50 information and computer scientists, social scientists, communication and journalism scholars, and policy experts. We used a discussion format, with one day of guiding topics and a second day using an unconference model where participants created discussion topics. The interdisciplinary group of attendees discussed gaps in existing scholarship and the methods, resources, access, and collective effort needed to address those gaps. We also discussed approaches for translating scholarship for various audiences including citizens, funders, educators, industry professionals, and policymakers. This report presents a synthesis of major themes during our discussions. The themes presented are not a summary of what we know already, they are an exploration of what we do not know enough about, and what we should spend more effort and investment on in the coming years. ",
    "url": "https://arxiv.org/abs/2404.10897",
    "authors": [
      "Motahhare Eslami",
      "Eric Gilbert",
      "Sarita Schoenebeck",
      "Eric P. S. Baumer",
      "Eshwar Chandrasekharan",
      "Michelle De Mooy",
      "Karrie Karahalios",
      "David Karger",
      "Tressie McMillan Cottom",
      "Andrés Monroy-Hernández",
      "Loren Terveen",
      "John Wihbey"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2404.10901",
    "title": "CrossGP: Cross-Day Glucose Prediction Excluding Physiological  Information",
    "abstract": "The increasing number of diabetic patients is a serious issue in society today, which has significant negative impacts on people's health and the country's financial expenditures. Because diabetes may develop into potential serious complications, early glucose prediction for diabetic patients is necessary for timely medical treatment. Existing glucose prediction methods typically utilize patients' private data (e.g. age, gender, ethnicity) and physiological parameters (e.g. blood pressure, heart rate) as reference features for glucose prediction, which inevitably leads to privacy protection concerns. Moreover, these models generally focus on either long-term (monthly-based) or short-term (minute-based) predictions. Long-term prediction methods are generally inaccurate because of the external uncertainties that can greatly affect the glucose values, while short-term ones fail to provide timely medical guidance. Based on the above issues, we propose CrossGP, a novel machine-learning framework for cross-day glucose prediction solely based on the patient's external activities without involving any physiological parameters. Meanwhile, we implement three baseline models for comparison. Extensive experiments on Anderson's dataset strongly demonstrate the superior performance of CrossGP and prove its potential for future real-life applications. ",
    "url": "https://arxiv.org/abs/2404.10901",
    "authors": [
      "Ziyi Zhou",
      "Ming Cheng",
      "Yanjun Cui",
      "Xingjian Diao",
      "Zhaorui Ma"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.10904",
    "title": "Multi-Task Multi-Modal Self-Supervised Learning for Facial Expression  Recognition",
    "abstract": "Human communication is multi-modal; e.g., face-to-face interaction involves auditory signals (speech) and visual signals (face movements and hand gestures). Hence, it is essential to exploit multiple modalities when designing machine learning-based facial expression recognition systems. In addition, given the ever-growing quantities of video data that capture human facial expressions, such systems should utilize raw unlabeled videos without requiring expensive annotations. Therefore, in this work, we employ a multitask multi-modal self-supervised learning method for facial expression recognition from in-the-wild video data. Our model combines three self-supervised objective functions: First, a multi-modal contrastive loss, that pulls diverse data modalities of the same video together in the representation space. Second, a multi-modal clustering loss that preserves the semantic structure of input data in the representation space. Finally, a multi-modal data reconstruction loss. We conduct a comprehensive study on this multimodal multi-task self-supervised learning method on three facial expression recognition benchmarks. To that end, we examine the performance of learning through different combinations of self-supervised tasks on the facial expression recognition downstream task. Our model ConCluGen outperforms several multi-modal self-supervised and fully supervised baselines on the CMU-MOSEI dataset. Our results generally show that multi-modal self-supervision tasks offer large performance gains for challenging tasks such as facial expression recognition, while also reducing the amount of manual annotations required. We release our pre-trained models as well as source code publicly ",
    "url": "https://arxiv.org/abs/2404.10904",
    "authors": [
      "Marah Halawa",
      "Florian Blume",
      "Pia Bideau",
      "Martin Maier",
      "Rasha Abdel Rahman",
      "Olaf Hellwich"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.10906",
    "title": "Towards a Research Community in Interpretable Reinforcement Learning:  the InterpPol Workshop",
    "abstract": "Embracing the pursuit of intrinsically explainable reinforcement learning raises crucial questions: what distinguishes explainability from interpretability? Should explainable and interpretable agents be developed outside of domains where transparency is imperative? What advantages do interpretable policies offer over neural networks? How can we rigorously define and measure interpretability in policies, without user studies? What reinforcement learning paradigms,are the most suited to develop interpretable agents? Can Markov Decision Processes integrate interpretable state representations? In addition to motivate an Interpretable RL community centered around the aforementioned questions, we propose the first venue dedicated to Interpretable RL: the InterpPol Workshop. ",
    "url": "https://arxiv.org/abs/2404.10906",
    "authors": [
      "Hector Kohler",
      "Quentin Delfosse",
      "Paul Festor",
      "Philippe Preux"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)",
      "Symbolic Computation (cs.SC)"
    ]
  },
  {
    "id": "arXiv:2404.10907",
    "title": "Causal Effect Estimation Using Random Hyperplane Tessellations",
    "abstract": "Matching is one of the simplest approaches for estimating causal effects from observational data. Matching techniques compare the observed outcomes across pairs of individuals with similar covariate values but different treatment statuses in order to estimate causal effects. However, traditional matching techniques are unreliable given high-dimensional covariates due to the infamous curse of dimensionality. To overcome this challenge, we propose a simple, fast, yet highly effective approach to matching using Random Hyperplane Tessellations (RHPT). First, we prove that the RHPT representation is an approximate balancing score -- thus maintaining the strong ignorability assumption -- and provide empirical evidence for this claim. Second, we report results of extensive experiments showing that matching using RHPT outperforms traditional matching techniques and is competitive with state-of-the-art deep learning methods for causal effect estimation. In addition, RHPT avoids the need for computationally expensive training of deep neural networks. ",
    "url": "https://arxiv.org/abs/2404.10907",
    "authors": [
      "Abhishek Dalvi",
      "Neil Ashtekar",
      "Vasant Honavar"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.10917",
    "title": "Which questions should I answer? Salience Prediction of Inquisitive  Questions",
    "abstract": "Inquisitive questions -- open-ended, curiosity-driven questions people ask as they read -- are an integral part of discourse processing (Kehler and Rohde, 2017; Onea, 2016) and comprehension (Prince, 2004). Recent work in NLP has taken advantage of question generation capabilities of LLMs to enhance a wide range of applications. But the space of inquisitive questions is vast: many questions can be evoked from a given context. So which of those should be prioritized to find answers? Linguistic theories, unfortunately, have not yet provided an answer to this question. This paper presents QSALIENCE, a salience predictor of inquisitive questions. QSALIENCE is instruction-tuned over our dataset of linguist-annotated salience scores of 1,766 (context, question) pairs. A question scores high on salience if answering it would greatly enhance the understanding of the text (Van Rooy, 2003). We show that highly salient questions are empirically more likely to be answered in the same article, bridging potential questions (Onea, 2016) with Questions Under Discussion (Roberts, 2012). We further validate our findings by showing that answering salient questions is an indicator of summarization quality in news. ",
    "url": "https://arxiv.org/abs/2404.10917",
    "authors": [
      "Yating Wu",
      "Ritika Mangla",
      "Alexandros G. Dimakis",
      "Greg Durrett",
      "Junyi Jessy Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.10924",
    "title": "Binder: Hierarchical Concept Representation through Order Embedding of  Binary Vectors",
    "abstract": "For natural language understanding and generation, embedding concepts using an order-based representation is an essential task. Unlike traditional point vector based representation, an order-based representation imposes geometric constraints on the representation vectors for explicitly capturing various semantic relationships that may exist between a pair of concepts. In existing literature, several approaches on order-based embedding have been proposed, mostly focusing on capturing hierarchical relationships; examples include vectors in Euclidean space, complex, Hyperbolic, order, and Box Embedding. Box embedding creates region-based rich representation of concepts, but along the process it sacrifices simplicity, requiring a custom-made optimization scheme for learning the representation. Hyperbolic embedding improves embedding quality by exploiting the ever-expanding property of Hyperbolic space, but it also suffers from the same fate as box embedding as gradient descent like optimization is not simple in the Hyperbolic space. In this work, we propose Binder, a novel approach for order-based representation. Binder uses binary vectors for embedding, so the embedding vectors are compact with an order of magnitude smaller footprint than other methods. Binder uses a simple and efficient optimization scheme for learning representation vectors with a linear time complexity. Our comprehensive experimental results show that Binder is very accurate, yielding competitive results on the representation task. But Binder stands out from its competitors on the transitive closure link prediction task as it can learn concept embeddings just from the direct edges, whereas all existing order-based approaches rely on the indirect edges. ",
    "url": "https://arxiv.org/abs/2404.10924",
    "authors": [
      "Croix Gyurek",
      "Niloy Talukder",
      "Mohammad Al Hasan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.10929",
    "title": "Decreasing Wages in Gig Economy: A Game Theoretic Explanation Using  Mathematical Program Networks",
    "abstract": "Gig economy consists of two market groups connected via an intermediary. Popular examples are rideshares where passengers and drivers are mediated via platforms such as Uber and Lyft. In a duopoly market, the platforms must compete to attract not only the passengers by providing a lower rate but also the drivers by providing better wages. While this should indicate better driver payout, as platforms compete to attract the driver pool, real world statistics does not indicate such. This goes completely against the intuition that the worker side of a gig economy, given their importance, should always earn better. We attempt to answer the low wages of drivers in the gig economy by modeling the ridesharing game between duopoly platforms, drivers, and passengers using Mathematical Program Networks. Our model is parsimonious, expressive, models the same-side and cross-side externalities of the economy, and has interpretations under both single-homing and multi-homing regimes. We derive the conditions for the existence of a profitable duopoly and show that it can only happen if the platforms collude together to pay the bare minimum to the drivers. This not only answers why drivers are paid less but also provides strong managerial insights to any interested policy maker. ",
    "url": "https://arxiv.org/abs/2404.10929",
    "authors": [
      "Pravesh Koirala",
      "Forrest Laine"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2404.10934",
    "title": "Shears: Unstructured Sparsity with Neural Low-rank Adapter Search",
    "abstract": "Recently, several approaches successfully demonstrated that weight-sharing Neural Architecture Search (NAS) can effectively explore a search space of elastic low-rank adapters (LoRA), allowing the parameter-efficient fine-tuning (PEFT) and compression of large language models. In this paper, we introduce a novel approach called Shears, demonstrating how the integration of cost-effective sparsity and a proposed Neural Low-rank adapter Search (NLS) algorithm can further improve the efficiency of PEFT approaches. Results demonstrate the benefits of Shears compared to other methods, reaching high sparsity levels while improving or with little drop in accuracy, utilizing a single GPU for a pair of hours. ",
    "url": "https://arxiv.org/abs/2404.10934",
    "authors": [
      "J. Pablo Muñoz",
      "Jinjie Yuan",
      "Nilesh Jain"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.10940",
    "title": "Neuromorphic Vision-based Motion Segmentation with Graph Transformer  Neural Network",
    "abstract": "Moving object segmentation is critical to interpret scene dynamics for robotic navigation systems in challenging environments. Neuromorphic vision sensors are tailored for motion perception due to their asynchronous nature, high temporal resolution, and reduced power consumption. However, their unconventional output requires novel perception paradigms to leverage their spatially sparse and temporally dense nature. In this work, we propose a novel event-based motion segmentation algorithm using a Graph Transformer Neural Network, dubbed GTNN. Our proposed algorithm processes event streams as 3D graphs by a series of nonlinear transformations to unveil local and global spatiotemporal correlations between events. Based on these correlations, events belonging to moving objects are segmented from the background without prior knowledge of the dynamic scene geometry. The algorithm is trained on publicly available datasets including MOD, EV-IMO, and \\textcolor{black}{EV-IMO2} using the proposed training scheme to facilitate efficient training on extensive datasets. Moreover, we introduce the Dynamic Object Mask-aware Event Labeling (DOMEL) approach for generating approximate ground-truth labels for event-based motion segmentation datasets. We use DOMEL to label our own recorded Event dataset for Motion Segmentation (EMS-DOMEL), which we release to the public for further research and benchmarking. Rigorous experiments are conducted on several unseen publicly-available datasets where the results revealed that GTNN outperforms state-of-the-art methods in the presence of dynamic background variations, motion patterns, and multiple dynamic objects with varying sizes and velocities. GTNN achieves significant performance gains with an average increase of 9.4% and 4.5% in terms of motion segmentation accuracy (IoU%) and detection rate (DR%), respectively. ",
    "url": "https://arxiv.org/abs/2404.10940",
    "authors": [
      "Yusra Alkendi",
      "Rana Azzam",
      "Sajid Javed",
      "Lakmal Seneviratne",
      "Yahya Zweiri"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.10944",
    "title": "Threat Behavior Textual Search by Attention Graph Isomorphism",
    "abstract": "Cyber attacks cause over \\$1 trillion loss every year. An important task for cyber security analysts is attack forensics. It entails understanding malware behaviors and attack origins. However, existing automated or manual malware analysis can only disclose a subset of behaviors due to inherent difficulties (e.g., malware cloaking and obfuscation). As such, analysts often resort to text search techniques to identify existing malware reports based on the symptoms they observe, exploiting the fact that malware samples share a lot of similarity, especially those from the same origin. In this paper, we propose a novel malware behavior search technique that is based on graph isomorphism at the attention layers of Transformer models. We also compose a large dataset collected from various agencies to facilitate such research. Our technique outperforms state-of-the-art methods, such as those based on sentence embeddings and keywords by 6-14%. In the case study of 10 real-world malwares, our technique can correctly attribute 8 of them to their ground truth origins while using Google only works for 3 cases. ",
    "url": "https://arxiv.org/abs/2404.10944",
    "authors": [
      "Chanwoo Bae",
      "Guanhong Tao",
      "Zhuo Zhang",
      "Xiangyu Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2404.10947",
    "title": "Residual Connections Harm Self-Supervised Abstract Feature Learning",
    "abstract": "We demonstrate that adding a weighting factor to decay the strength of identity shortcuts within residual networks substantially improves semantic feature learning in the state-of-the-art self-supervised masked autoencoding (MAE) paradigm. Our modification to the identity shortcuts within a VIT-B/16 backbone of an MAE boosts linear probing accuracy on ImageNet from 67.3% to 72.3%. This significant gap suggests that, while residual connection structure serves an essential role in facilitating gradient propagation, it may have a harmful side effect of reducing capacity for abstract learning by virtue of injecting an echo of shallower representations into deeper layers. We ameliorate this downside via a fixed formula for monotonically decreasing the contribution of identity connections as layer depth increases. Our design promotes the gradual development of feature abstractions, without impacting network trainability. Analyzing the representations learned by our modified residual networks, we find correlation between low effective feature rank and downstream task performance. ",
    "url": "https://arxiv.org/abs/2404.10947",
    "authors": [
      "Xiao Zhang",
      "Ruoxi Jiang",
      "William Gao",
      "Rebecca Willett",
      "Michael Maire"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.10969",
    "title": "Integrated Communication, Navigation, and Remote Sensing in LEO Networks  with Vehicular Applications",
    "abstract": "Traditionally, communication, navigation, and remote sensing (CNR) satellites are separately performed, leading to resource waste, information isolation, and independent optimization for each functionality. Taking future automated driving as an example, it faces great challenges in providing high-reliable and low-latency lane-level positioning, decimeter-level transportation observation, and huge traffic sensing information downloading. To this end, this article proposes an integrated CNR (ICNR) framework based on low earth orbit (LEO) satellite mega-constellations from the perspective of vehicular applications. After introducing the main working principles of the CNR functionalities to serve as the technological basis, we characterize the potentials of the integration gain in vehicular use cases. Then, we investigate the ICNR framework in different integration levels, which sheds strong light on qualitative performance improvement by sophisticatedly sharing orbit constellation, wireless resource, and data information towards meeting the requirements of vehicular applications. We also instantiate a fundamental numerical case study to demonstrate the integration gain and highlight the main tradeoffs in managing the ICNR networks from the perspective of vehicular applications. ",
    "url": "https://arxiv.org/abs/2404.10969",
    "authors": [
      "Min Sheng",
      "Chongtao Guo",
      "Lei Huang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2404.10976",
    "title": "Group-Aware Coordination Graph for Multi-Agent Reinforcement Learning",
    "abstract": "Cooperative Multi-Agent Reinforcement Learning (MARL) necessitates seamless collaboration among agents, often represented by an underlying relation graph. Existing methods for learning this graph primarily focus on agent-pair relations, neglecting higher-order relationships. While several approaches attempt to extend cooperation modelling to encompass behaviour similarities within groups, they commonly fall short in concurrently learning the latent graph, thereby constraining the information exchange among partially observed agents. To overcome these limitations, we present a novel approach to infer the Group-Aware Coordination Graph (GACG), which is designed to capture both the cooperation between agent pairs based on current observations and group-level dependencies from behaviour patterns observed across trajectories. This graph is further used in graph convolution for information exchange between agents during decision-making. To further ensure behavioural consistency among agents within the same group, we introduce a group distance loss, which promotes group cohesion and encourages specialization between groups. Our evaluations, conducted on StarCraft II micromanagement tasks, demonstrate GACG's superior performance. An ablation study further provides experimental evidence of the effectiveness of each component of our method. ",
    "url": "https://arxiv.org/abs/2404.10976",
    "authors": [
      "Wei Duan",
      "Jie Lu",
      "Junyu Xuan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2404.10978",
    "title": "Leveraging 3D LiDAR Sensors to Enable Enhanced Urban Safety and Public  Health: Pedestrian Monitoring and Abnormal Activity Detection",
    "abstract": "The integration of Light Detection and Ranging (LiDAR) and Internet of Things (IoT) technologies offers transformative opportunities for public health informatics in urban safety and pedestrian well-being. This paper proposes a novel framework utilizing these technologies for enhanced 3D object detection and activity classification in urban traffic scenarios. By employing elevated LiDAR, we obtain detailed 3D point cloud data, enabling precise pedestrian activity monitoring. To overcome urban data scarcity, we create a specialized dataset through simulated traffic environments in Blender, facilitating targeted model training. Our approach employs a modified Point Voxel-Region-based Convolutional Neural Network (PV-RCNN) for robust 3D detection and PointNet for classifying pedestrian activities, significantly benefiting urban traffic management and public health by offering insights into pedestrian behavior and promoting safer urban environments. Our dual-model approach not only enhances urban traffic management but also contributes significantly to public health by providing insights into pedestrian behavior and promoting safer urban environment. ",
    "url": "https://arxiv.org/abs/2404.10978",
    "authors": [
      "Nawfal Guefrachi",
      "Jian Shi",
      "Hakim Ghazzai",
      "Ahmad Alsharoa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.10984",
    "title": "Graph Continual Learning with Debiased Lossless Memory Replay",
    "abstract": "Real-life graph data often expands continually, rendering the learning of graph neural networks (GNNs) on static graph data impractical. Graph continual learning (GCL) tackles this problem by continually adapting GNNs to the expanded graph of the current task while maintaining the performance over the graph of previous tasks. Memory replay-based methods, which aim to replay data of previous tasks when learning new tasks, have been explored as one principled approach to mitigate the forgetting of the knowledge learned from the previous tasks. In this paper we extend this methodology with a novel framework, called Debiased Lossless Memory replay (DeLoMe). Unlike existing methods that sample nodes/edges of previous graphs to construct the memory, DeLoMe learns small lossless synthetic node representations as the memory. The learned memory can not only preserve the graph data privacy but also capture the holistic graph information, for which the sampling-based methods are not viable. Further, prior methods suffer from bias toward the current task due to the data imbalance between the classes in the memory data and the current data. A debiased GCL loss function is devised in DeLoMe to effectively alleviate this bias. Extensive experiments on four graph datasets show the effectiveness of DeLoMe under both class- and task-incremental learning settings. ",
    "url": "https://arxiv.org/abs/2404.10984",
    "authors": [
      "Chaoxi Niu",
      "Guansong Pang",
      "Ling Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.11003",
    "title": "InfoMatch: Entropy Neural Estimation for Semi-Supervised Image  Classification",
    "abstract": "Semi-supervised image classification, leveraging pseudo supervision and consistency regularization, has demonstrated remarkable success. However, the ongoing challenge lies in fully exploiting the potential of unlabeled data. To address this, we employ information entropy neural estimation to harness the potential of unlabeled samples. Inspired by contrastive learning, the entropy is estimated by maximizing a lower bound on mutual information across different augmented views. Moreover, we theoretically analyze that the information entropy of the posterior of an image classifier is approximated by maximizing the likelihood function of the softmax predictions. Guided by these insights, we optimize our model from both perspectives to ensure that the predicted probability distribution closely aligns with the ground-truth distribution. Given the theoretical connection to information entropy, we name our method \\textit{InfoMatch}. Through extensive experiments, we show its superior performance. ",
    "url": "https://arxiv.org/abs/2404.11003",
    "authors": [
      "Qi Han",
      "Zhibo Tian",
      "Chengwei Xia",
      "Kun Zhan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11019",
    "title": "You do not have to train Graph Neural Networks at all on text-attributed  graphs",
    "abstract": "Graph structured data, specifically text-attributed graphs (TAG), effectively represent relationships among varied entities. Such graphs are essential for semi-supervised node classification tasks. Graph Neural Networks (GNNs) have emerged as a powerful tool for handling this graph-structured data. Although gradient descent is commonly utilized for training GNNs for node classification, this study ventures into alternative methods, eliminating the iterative optimization processes. We introduce TrainlessGNN, a linear GNN model capitalizing on the observation that text encodings from the same class often cluster together in a linear subspace. This model constructs a weight matrix to represent each class's node attribute subspace, offering an efficient approach to semi-supervised node classification on TAG. Extensive experiments reveal that our trainless models can either match or even surpass their conventionally trained counterparts, demonstrating the possibility of refraining from gradient descent in certain configurations. ",
    "url": "https://arxiv.org/abs/2404.11019",
    "authors": [
      "Kaiwen Dong",
      "Zhichun Guo",
      "Nitesh V. Chawla"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.11023",
    "title": "Advancing Social Intelligence in AI Agents: Technical Challenges and  Open Questions",
    "abstract": "Building socially-intelligent AI agents (Social-AI) is a multidisciplinary, multimodal research goal that involves creating agents that can sense, perceive, reason about, learn from, and respond to affect, behavior, and cognition of other agents (human or artificial). Progress towards Social-AI has accelerated in the past decade across several computing communities, including natural language processing, machine learning, robotics, human-machine interaction, computer vision, and speech. Natural language processing, in particular, has been prominent in Social-AI research, as language plays a key role in constructing the social world. In this position paper, we identify a set of underlying technical challenges and open questions for researchers across computing communities to advance Social-AI. We anchor our discussion in the context of social intelligence concepts and prior progress in Social-AI research. ",
    "url": "https://arxiv.org/abs/2404.11023",
    "authors": [
      "Leena Mathur",
      "Paul Pu Liang",
      "Louis-Philippe Morency"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.11032",
    "title": "CORE: Data Augmentation for Link Prediction via Information Bottleneck",
    "abstract": "Link prediction (LP) is a fundamental task in graph representation learning, with numerous applications in diverse domains. However, the generalizability of LP models is often compromised due to the presence of noisy or spurious information in graphs and the inherent incompleteness of graph data. To address these challenges, we draw inspiration from the Information Bottleneck principle and propose a novel data augmentation method, COmplete and REduce (CORE) to learn compact and predictive augmentations for LP models. In particular, CORE aims to recover missing edges in graphs while simultaneously removing noise from the graph structures, thereby enhancing the model's robustness and performance. Extensive experiments on multiple benchmark datasets demonstrate the applicability and superiority of CORE over state-of-the-art methods, showcasing its potential as a leading approach for robust LP in graph representation learning. ",
    "url": "https://arxiv.org/abs/2404.11032",
    "authors": [
      "Kaiwen Dong",
      "Zhichun Guo",
      "Nitesh V. Chawla"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2404.11033",
    "title": "Building Defect Prediction Models by Online Learning Considering Defect  Overlooking",
    "abstract": "Building defect prediction models based on online learning can enhance prediction accuracy. It continuously rebuilds a new prediction model, when a new data point is added. However, a module predicted as \"non-defective\" can result in fewer test cases for such modules. Thus, a defective module can be overlooked during testing. The erroneous test results are used as learning data by online learning, which could negatively affect prediction accuracy. To suppress the negative influence, we propose to apply a method that fixes the prediction as positive during the initial stage of online learning. Additionally, we improved the method to consider the probability of the overlooking. In our experiment, we demonstrate this negative influence on prediction accuracy, and the effectiveness of our approach. The results show that our approach did not negatively affect AUC but significantly improved recall. ",
    "url": "https://arxiv.org/abs/2404.11033",
    "authors": [
      "Nikolay Fedorov",
      "Yuta Yamasaki",
      "Masateru Tsunoda",
      "Akito Monden",
      "Amjed Tahir",
      "Kwabena Ebo Bennin",
      "Koji Toda",
      "Keitaro Nakasai"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.11036",
    "title": "Cross-Platform Hate Speech Detection with Weakly Supervised Causal  Disentanglement",
    "abstract": "Content moderation faces a challenging task as social media's ability to spread hate speech contrasts with its role in promoting global connectivity. With rapidly evolving slang and hate speech, the adaptability of conventional deep learning to the fluid landscape of online dialogue remains limited. In response, causality inspired disentanglement has shown promise by segregating platform specific peculiarities from universal hate indicators. However, its dependency on available ground truth target labels for discerning these nuances faces practical hurdles with the incessant evolution of platforms and the mutable nature of hate speech. Using confidence based reweighting and contrastive regularization, this study presents HATE WATCH, a novel framework of weakly supervised causal disentanglement that circumvents the need for explicit target labeling and effectively disentangles input features into invariant representations of hate. Empirical validation across platforms two with target labels and two without positions HATE WATCH as a novel method in cross platform hate speech detection with superior performance. HATE WATCH advances scalable content moderation techniques towards developing safer online communities. ",
    "url": "https://arxiv.org/abs/2404.11036",
    "authors": [
      "Paras Sheth",
      "Tharindu Kumarage",
      "Raha Moraffah",
      "Aman Chadha",
      "Huan Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.11040",
    "title": "The Effect of Defect (Re) Prediction on Software Testing",
    "abstract": "Background: Cross-project defect prediction (CPDP) aims to use data from external projects as historical data may not be available from the same project. In CPDP, deciding on a particular historical project to build a training model can be difficult. To help with this decision, a Bandit Algorithm (BA) based approach has been proposed in prior research to select the most suitable learning project. However, this BA method could lead to the selection of unsuitable data during the early iteration of BA (i.e., early stage of software testing). Selecting an unsuitable model can reduce the prediction accuracy, leading to potential defect overlooking. This study aims to improve the BA method to reduce defects overlooking, especially during the early stage of testing. Once all modules have been tested, modules tested in the early stage are re-predicted, and some modules are retested based on the re-prediction. To assess the impact of re-prediction and retesting, we applied five kinds of BA methods, using 8, 16, and 32 OSS projects as learning data. The results show that the newly proposed approach steadily reduced the probability of defect overlooking on 86.7% of the BA methods and projects combinations. ",
    "url": "https://arxiv.org/abs/2404.11040",
    "authors": [
      "Yukasa Murakami",
      "Yuta Yamasaki",
      "Masateru Tsunoda",
      "Akito Monden",
      "Amjed Tahir",
      "Kwabena Ebo Bennin",
      "Koji Toda",
      "Keitaro Nakasai"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.11054",
    "title": "Multilateral Temporal-view Pyramid Transformer for Video Inpainting  Detection",
    "abstract": "The task of video inpainting detection is to expose the pixel-level inpainted regions within a video sequence. Existing methods usually focus on leveraging spatial and temporal inconsistencies. However, these methods typically employ fixed operations to combine spatial and temporal clues, limiting their applicability in different scenarios. In this paper, we introduce a novel Multilateral Temporal-view Pyramid Transformer ({\\em MumPy}) that collaborates spatial-temporal clues flexibly. Our method utilizes a newly designed multilateral temporal-view encoder to extract various collaborations of spatial-temporal clues and introduces a deformable window-based temporal-view interaction module to enhance the diversity of these collaborations. Subsequently, we develop a multi-pyramid decoder to aggregate the various types of features and generate detection maps. By adjusting the contribution strength of spatial and temporal clues, our method can effectively identify inpainted regions. We validate our method on existing datasets and also introduce a new challenging and large-scale Video Inpainting dataset based on the YouTube-VOS dataset, which employs several more recent inpainting methods. The results demonstrate the superiority of our method in both in-domain and cross-domain evaluation scenarios. ",
    "url": "https://arxiv.org/abs/2404.11054",
    "authors": [
      "Ying Zhang",
      "Bo Peng",
      "Jiaran Zhou",
      "Huiyu Zhou",
      "Junyu Dong",
      "Yuezun Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11055",
    "title": "On the Causal Nature of Sentiment Analysis",
    "abstract": "Sentiment analysis (SA) aims to identify the sentiment expressed in a text, such as a product review. Given a review and the sentiment associated with it, this paper formulates SA as a combination of two tasks: (1) a causal discovery task that distinguishes whether a review \"primes\" the sentiment (Causal Hypothesis C1), or the sentiment \"primes\" the review (Causal Hypothesis C2); and (2) the traditional prediction task to model the sentiment using the review as input. Using the peak-end rule in psychology, we classify a sample as C1 if its overall sentiment score approximates an average of all the sentence-level sentiments in the review, and C2 if the overall sentiment score approximates an average of the peak and end sentiments. For the prediction task, we use the discovered causal mechanisms behind the samples to improve the performance of LLMs by proposing causal prompts that give the models an inductive bias of the underlying causal graph, leading to substantial improvements by up to 32.13 F1 points on zero-shot five-class SA. Our code is at https://github.com/cogito233/causal-sa ",
    "url": "https://arxiv.org/abs/2404.11055",
    "authors": [
      "Zhiheng Lyu",
      "Zhijing Jin",
      "Fernando Gonzalez",
      "Rada Mihalcea",
      "Bernhard Schoelkopf",
      "Mrinmaya Sachan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.11067",
    "title": "Complex hypergraph analysis of Australian MPs' professional connections,  1947-2019",
    "abstract": "We propose a suit of methods to analyse the professional networks of MPs, showing how to analyse weak-tie connections between legislators and the connections between background charactersitic attributes. Applied to a novel dataset on the backgrounds of Australian MPs in the Australian Labor Party and the Liberal Party of Australia (1947-2019), we show that our approach can help to describe and explain the decline in working-class and trade unionist MPs from the Labor Party, the homogeneous elitism of the mid-20 century Liberal Party, and the increasing similarity of both parties' professional networks, occuring in the period of party cartellisation from the 1980s onward. Our paper's finding show that our method has clear potential for broader applications in the study of political representation, diversity, and elite political networks. ",
    "url": "https://arxiv.org/abs/2404.11067",
    "authors": [
      "Eve Cheng",
      "Danny Cocks",
      "Patrick Leslie"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2404.11075",
    "title": "EEG_GLT-Net: Optimising EEG Graphs for Real-time Motor Imagery Signals  Classification",
    "abstract": "Brain-Computer Interfaces connect the brain to external control devices, necessitating the accurate translation of brain signals such as from electroencephalography (EEG) into executable commands. Graph Neural Networks (GCN) have been increasingly applied for classifying EEG Motor Imagery signals, primarily because they incorporates the spatial relationships among EEG channels, resulting in improved accuracy over traditional convolutional methods. Recent advances by GCNs-Net in real-time EEG MI signal classification utilised Pearson Coefficient Correlation (PCC) for constructing adjacency matrices, yielding significant results on the PhysioNet dataset. Our paper introduces the EEG Graph Lottery Ticket (EEG_GLT) algorithm, an innovative technique for constructing adjacency matrices for EEG channels. It does not require pre-existing knowledge of inter-channel relationships, and it can be tailored to suit both individual subjects and GCN model architectures. Our findings demonstrated that the PCC method outperformed the Geodesic approach by 9.65% in mean accuracy, while our EEG_GLT matrix consistently exceeded the performance of the PCC method by a mean accuracy of 13.39%. Also, we found that the construction of the adjacency matrix significantly influenced accuracy, to a greater extent than GCN model configurations. A basic GCN configuration utilising our EEG_GLT matrix exceeded the performance of even the most complex GCN setup with a PCC matrix in average accuracy. Our EEG_GLT method also reduced MACs by up to 97% compared to the PCC method, while maintaining or enhancing accuracy. In conclusion, the EEG_GLT algorithm marks a breakthrough in the development of optimal adjacency matrices, effectively boosting both computational accuracy and efficiency, making it well-suited for real-time classification of EEG MI signals that demand intensive computational resources. ",
    "url": "https://arxiv.org/abs/2404.11075",
    "authors": [
      "Htoo Wai Aung",
      "Jiao Jiao Li",
      "Yang An",
      "Steven W. Su"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2404.11119",
    "title": "DRepMRec: A Dual Representation Learning Framework for Multimodal  Recommendation",
    "abstract": "Multimodal Recommendation focuses mainly on how to effectively integrate behavior and multimodal information in the recommendation task. Previous works suffer from two major issues. Firstly, the training process tightly couples the behavior module and multimodal module by jointly optimizing them using the sharing model parameters, which leads to suboptimal performance since behavior signals and modality signals often provide opposite guidance for the parameters updates. Secondly, previous approaches fail to take into account the significant distribution differences between behavior and modality when they attempt to fuse behavior and modality information. This resulted in a misalignment between the representations of behavior and modality. To address these challenges, in this paper, we propose a novel Dual Representation learning framework for Multimodal Recommendation called DRepMRec, which introduce separate dual lines for coupling problem and Behavior-Modal Alignment (BMA) for misalignment problem. Specifically, DRepMRec leverages two independent lines of representation learning to calculate behavior and modal representations. After obtaining separate behavior and modal representations, we design a Behavior-Modal Alignment Module (BMA) to align and fuse the dual representations to solve the misalignment problem. Furthermore, we integrate the BMA into other recommendation models, resulting in consistent performance improvements. To ensure dual representations maintain their semantic independence during alignment, we introduce Similarity-Supervised Signal (SSS) for representation learning. We conduct extensive experiments on three public datasets and our method achieves state-of-the-art (SOTA) results. The source code will be available upon acceptance. ",
    "url": "https://arxiv.org/abs/2404.11119",
    "authors": [
      "Kangning Zhang",
      "Yingjie Qin",
      "Ruilong Su",
      "Yifan Liu",
      "Jiarui Jin",
      "Weinan Zhang",
      "Yong Yu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2404.11120",
    "title": "TiNO-Edit: Timestep and Noise Optimization for Robust Diffusion-Based  Image Editing",
    "abstract": "Despite many attempts to leverage pre-trained text-to-image models (T2I) like Stable Diffusion (SD) for controllable image editing, producing good predictable results remains a challenge. Previous approaches have focused on either fine-tuning pre-trained T2I models on specific datasets to generate certain kinds of images (e.g., with a specific object or person), or on optimizing the weights, text prompts, and/or learning features for each input image in an attempt to coax the image generator to produce the desired result. However, these approaches all have shortcomings and fail to produce good results in a predictable and controllable manner. To address this problem, we present TiNO-Edit, an SD-based method that focuses on optimizing the noise patterns and diffusion timesteps during editing, something previously unexplored in the literature. With this simple change, we are able to generate results that both better align with the original images and reflect the desired result. Furthermore, we propose a set of new loss functions that operate in the latent domain of SD, greatly speeding up the optimization when compared to prior approaches, which operate in the pixel domain. Our method can be easily applied to variations of SD including Textual Inversion and DreamBooth that encode new concepts and incorporate them into the edited results. We present a host of image-editing capabilities enabled by our approach. Our code is publicly available at https://github.com/SherryXTChen/TiNO-Edit. ",
    "url": "https://arxiv.org/abs/2404.11120",
    "authors": [
      "Sherry X. Chen",
      "Yaron Vaxman",
      "Elad Ben Baruch",
      "David Asulin",
      "Aviad Moreshet",
      "Kuo-Chin Lien",
      "Misha Sra",
      "Pradeep Sen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11127",
    "title": "D-Aug: Enhancing Data Augmentation for Dynamic LiDAR Scenes",
    "abstract": "Creating large LiDAR datasets with pixel-level labeling poses significant challenges. While numerous data augmentation methods have been developed to reduce the reliance on manual labeling, these methods predominantly focus on static scenes and they overlook the importance of data augmentation for dynamic scenes, which is critical for autonomous driving. To address this issue, we propose D-Aug, a LiDAR data augmentation method tailored for augmenting dynamic scenes. D-Aug extracts objects and inserts them into dynamic scenes, considering the continuity of these objects across consecutive frames. For seamless insertion into dynamic scenes, we propose a reference-guided method that involves dynamic collision detection and rotation alignment. Additionally, we present a pixel-level road identification strategy to efficiently determine suitable insertion positions. We validated our method using the nuScenes dataset with various 3D detection and tracking methods. Comparative experiments demonstrate the superiority of D-Aug. ",
    "url": "https://arxiv.org/abs/2404.11127",
    "authors": [
      "Jiaxing Zhao",
      "Peng Zheng",
      "Rui Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11132",
    "title": "A Novel ICD Coding Framework Based on Associated and Hierarchical Code  Description Distillation",
    "abstract": "ICD(International Classification of Diseases) coding involves assigning ICD codes to patients visit based on their medical notes. ICD coding is a challenging multilabel text classification problem due to noisy medical document inputs. Recent advancements in automated ICD coding have enhanced performance by integrating additional data and knowledge bases with the encoding of medical notes and codes. However, most of them ignore the code hierarchy, leading to improper code assignments. To address these problems, we propose a novel framework based on associated and hierarchical code description distillation (AHDD) for better code representation learning and avoidance of improper code assignment.we utilize the code description and the hierarchical structure inherent to the ICD codes. Therefore, in this paper, we leverage the code description and the hierarchical structure inherent to the ICD codes. The code description is also applied to aware the attention layer and output layer. Experimental results on the benchmark dataset show the superiority of the proposed framework over several state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2404.11132",
    "authors": [
      "Bin Zhang",
      "Junli Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.11136",
    "title": "On the Performance of RIS-assisted Networks with HQAM",
    "abstract": "In this paper, we investigate the application of hexagonal quadrature amplitude modulation (HQAM) in reconfigurable intelligent surface (RIS)-assisted networks, specifically focusing on its efficiency in reducing the number of required reflecting elements. Specifically, we present analytical expressions for the average symbol error probability (ASEP) and propose a new metric for conditioned energy efficiency, which assesses the network energy consumption while ensuring the ASEP remains below a certain threshold. Additionally, we introduce an innovative detection algorithm for HQAM constellations that implements sphere decoding in O(1) complexity. Finally, our study reveals that HQAM significantly enhances both the ASEP and energy efficiency compared to traditional quadrature amplitude modulation (QAM) schemes. ",
    "url": "https://arxiv.org/abs/2404.11136",
    "authors": [
      "Thrassos K. Oikonomou",
      "Dimitrios Tyrovolas",
      "Sotiris A. Tegos",
      "Panagiotis D. Diamantoulakis",
      "Panagiotis Sarigiannidis",
      "George K. Karagiannidis"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2404.11141",
    "title": "Context-Aware Siamese Networks for Efficient Emotion Recognition in  Conversation",
    "abstract": "The advent of deep learning models has made a considerable contribution to the achievement of Emotion Recognition in Conversation (ERC). However, this task still remains an important challenge due to the plurality and subjectivity of human emotions. Previous work on ERC provides predictive models using mostly graph-based conversation representations. In this work, we propose a way to model the conversational context that we incorporate into a metric learning training strategy, with a two-step process. This allows us to perform ERC in a flexible classification scenario and to end up with a lightweight yet efficient model. Using metric learning through a Siamese Network architecture, we achieve 57.71 in macro F1 score for emotion classification in conversation on DailyDialog dataset, which outperforms the related work. This state-of-the-art result is promising regarding the use of metric learning for emotion recognition, yet perfectible compared to the microF1 score obtained. ",
    "url": "https://arxiv.org/abs/2404.11141",
    "authors": [
      "Barbara Gendron",
      "Gaël Guibon"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.11160",
    "title": "Low-Cost Language Models: Survey and Performance Evaluation on Python  Code Generation",
    "abstract": "Large Language Models (LLMs) have become the go-to solution for many Natural Language Processing (NLP) tasks due to their ability to tackle various problems and produce high-quality results. Specifically, they are increasingly used to automatically generate code, easing the burden on developers by handling repetitive tasks. However, this improvement in quality has led to high computational and memory demands, making LLMs inaccessible to users with limited resources. In this paper, we focus on Central Processing Unit (CPU)-compatible models and conduct a thorough semi-manual evaluation of their strengths and weaknesses in generating Python code. We enhance their performance by introducing a Chain-of-Thought prompt that guides the model in problem-solving. Additionally, we propose a dataset of 60 programming problems with varying difficulty levels for evaluation purposes. Our assessment also includes testing these models on two state-of-the-art datasets: HumanEval and EvalPlus. We commit to sharing our dataset and experimental results publicly to ensure transparency. ",
    "url": "https://arxiv.org/abs/2404.11160",
    "authors": [
      "Jessica López Espejel",
      "Mahaman Sanoussi Yahaya Alassan",
      "Merieme Bouhandi",
      "Walid Dahhane",
      "El Hassane Ettifouri"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11171",
    "title": "Personalized Heart Disease Detection via ECG Digital Twin Generation",
    "abstract": "Heart diseases rank among the leading causes of global mortality, demonstrating a crucial need for early diagnosis and intervention. Most traditional electrocardiogram (ECG) based automated diagnosis methods are trained at population level, neglecting the customization of personalized ECGs to enhance individual healthcare management. A potential solution to address this limitation is to employ digital twins to simulate symptoms of diseases in real patients. In this paper, we present an innovative prospective learning approach for personalized heart disease detection, which generates digital twins of healthy individuals' anomalous ECGs and enhances the model sensitivity to the personalized symptoms. In our approach, a vector quantized feature separator is proposed to locate and isolate the disease symptom and normal segments in ECG signals with ECG report guidance. Thus, the ECG digital twins can simulate specific heart diseases used to train a personalized heart disease detection model. Experiments demonstrate that our approach not only excels in generating high-fidelity ECG signals but also improves personalized heart disease detection. Moreover, our approach ensures robust privacy protection, safeguarding patient data in model development. ",
    "url": "https://arxiv.org/abs/2404.11171",
    "authors": [
      "Yaojun Hu",
      "Jintai Chen",
      "Lianting Hu",
      "Dantong Li",
      "Jiahuan Yan",
      "Haochao Ying",
      "Huiying Liang",
      "Jian Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2404.11172",
    "title": "Deep Neural Networks via Complex Network Theory: a Perspective",
    "abstract": "Deep Neural Networks (DNNs) can be represented as graphs whose links and vertices iteratively process data and solve tasks sub-optimally. Complex Network Theory (CNT), merging statistical physics with graph theory, provides a method for interpreting neural networks by analysing their weights and neuron structures. However, classic works adapt CNT metrics that only permit a topological analysis as they do not account for the effect of the input data. In addition, CNT metrics have been applied to a limited range of architectures, mainly including Fully Connected neural networks. In this work, we extend the existing CNT metrics with measures that sample from the DNNs' training distribution, shifting from a purely topological analysis to one that connects with the interpretability of deep learning. For the novel metrics, in addition to the existing ones, we provide a mathematical formalisation for Fully Connected, AutoEncoder, Convolutional and Recurrent neural networks, of which we vary the activation functions and the number of hidden layers. We show that these metrics differentiate DNNs based on the architecture, the number of hidden layers, and the activation function. Our contribution provides a method rooted in physics for interpreting DNNs that offers insights beyond the traditional input-output relationship and the CNT topological analysis. ",
    "url": "https://arxiv.org/abs/2404.11172",
    "authors": [
      "Emanuele La Malfa",
      "Gabriele La Malfa",
      "Giuseppe Nicosia",
      "Vito Latora"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11180",
    "title": "Causal Deconfounding via Confounder Disentanglement for Dual-Target  Cross-Domain Recommendation",
    "abstract": "In recent years, dual-target Cross-Domain Recommendation (CDR) has been proposed to capture comprehensive user preferences in order to ultimately enhance the recommendation accuracy in both data-richer and data-sparser domains simultaneously. However, in addition to users' true preferences, the user-item interactions might also be affected by confounders (e.g., free shipping, sales promotion). As a result, dual-target CDR has to meet two challenges: (1) how to effectively decouple observed confounders, including single-domain confounders and cross-domain confounders, and (2) how to preserve the positive effects of observed confounders on predicted interactions, while eliminating their negative effects on capturing comprehensive user preferences. To address the above two challenges, we propose a Causal Deconfounding framework via Confounder Disentanglement for dual-target Cross-Domain Recommendation, called CD2CDR. In CD2CDR, we first propose a confounder disentanglement module to effectively decouple observed single-domain and cross-domain confounders. We then propose a causal deconfounding module to preserve the positive effects of such observed confounders and eliminate their negative effects via backdoor adjustment, thereby enhancing the recommendation accuracy in each domain. Extensive experiments conducted on five real-world datasets demonstrate that CD2CDR significantly outperforms the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2404.11180",
    "authors": [
      "Jiajie Zhu",
      "Yan Wang",
      "Feng Zhu",
      "Zhu Sun"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2404.11181",
    "title": "KI-GAN: Knowledge-Informed Generative Adversarial Networks for Enhanced  Multi-Vehicle Trajectory Forecasting at Signalized Intersections",
    "abstract": "Reliable prediction of vehicle trajectories at signalized intersections is crucial to urban traffic management and autonomous driving systems. However, it presents unique challenges, due to the complex roadway layout at intersections, involvement of traffic signal controls, and interactions among different types of road users. To address these issues, we present in this paper a novel model called Knowledge-Informed Generative Adversarial Network (KI-GAN), which integrates both traffic signal information and multi-vehicle interactions to predict vehicle trajectories accurately. Additionally, we propose a specialized attention pooling method that accounts for vehicle orientation and proximity at intersections. Based on the SinD dataset, our KI-GAN model is able to achieve an Average Displacement Error (ADE) of 0.05 and a Final Displacement Error (FDE) of 0.12 for a 6-second observation and 6-second prediction cycle. When the prediction window is extended to 9 seconds, the ADE and FDE values are further reduced to 0.11 and 0.26, respectively. These results demonstrate the effectiveness of the proposed KI-GAN model in vehicle trajectory prediction under complex scenarios at signalized intersections, which represents a significant advancement in the target field. ",
    "url": "https://arxiv.org/abs/2404.11181",
    "authors": [
      "Chuheng Wei",
      "Guoyuan Wu",
      "Matthew J. Barth",
      "Amr Abdelraouf",
      "Rohit Gupta",
      "Kyungtae Han"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2404.11184",
    "title": "FIZZ: Factual Inconsistency Detection by Zoom-in Summary and Zoom-out  Document",
    "abstract": "Through the advent of pre-trained language models, there have been notable advancements in abstractive summarization systems. Simultaneously, a considerable number of novel methods for evaluating factual consistency in abstractive summarization systems has been developed. But these evaluation approaches incorporate substantial limitations, especially on refinement and interpretability. In this work, we propose highly effective and interpretable factual inconsistency detection method metric Factual Inconsistency Detection by Zoom-in Summary and Zoom-out Document for abstractive summarization systems that is based on fine-grained atomic facts decomposition. Moreover, we align atomic facts decomposed from the summary with the source document through adaptive granularity expansion. These atomic facts represent a more fine-grained unit of information, facilitating detailed understanding and interpretability of the summary's factual inconsistency. Experimental results demonstrate that our proposed factual consistency checking system significantly outperforms existing systems. We release the code at https://github.com/plm3332/FIZZ. ",
    "url": "https://arxiv.org/abs/2404.11184",
    "authors": [
      "Joonho Yang",
      "Seunghyun Yoon",
      "Byeongjeong Kim",
      "Hwanhee Lee"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.11206",
    "title": "Prompt-tuning for Clickbait Detection via Text Summarization",
    "abstract": "Clickbaits are surprising social posts or deceptive news headlines that attempt to lure users for more clicks, which have posted at unprecedented rates for more profit or commercial revenue. The spread of clickbait has significant negative impacts on the users, which brings users misleading or even click-jacking attacks. Different from fake news, the crucial problem in clickbait detection is determining whether the headline matches the corresponding content. Most existing methods compute the semantic similarity between the headlines and contents for detecting clickbait. However, due to significant differences in length and semantic features between headlines and contents, directly calculating semantic similarity is often difficult to summarize the relationship between them. To address this problem, we propose a prompt-tuning method for clickbait detection via text summarization in this paper, text summarization is introduced to summarize the contents, and clickbait detection is performed based on the similarity between the generated summary and the contents. Specifically, we first introduce a two-stage text summarization model to produce high-quality news summaries based on pre-trained language models, and then both the headlines and new generated summaries are incorporated as the inputs for prompt-tuning. Additionally, a variety of strategies are conducted to incorporate external knowledge for improving the performance of clickbait detection. The extensive experiments on well-known clickbait detection datasets demonstrate that our method achieved state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2404.11206",
    "authors": [
      "Haoxiang Deng",
      "Yi Zhu",
      "Ye Wang",
      "Jipeng Qiang",
      "Yunhao Yuan",
      "Yun Li",
      "Runmei Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.11214",
    "title": "Feature Corrective Transfer Learning: End-to-End Solutions to Object  Detection in Non-Ideal Visual Conditions",
    "abstract": "A significant challenge in the field of object detection lies in the system's performance under non-ideal imaging conditions, such as rain, fog, low illumination, or raw Bayer images that lack ISP processing. Our study introduces \"Feature Corrective Transfer Learning\", a novel approach that leverages transfer learning and a bespoke loss function to facilitate the end-to-end detection of objects in these challenging scenarios without the need to convert non-ideal images into their RGB counterparts. In our methodology, we initially train a comprehensive model on a pristine RGB image dataset. Subsequently, non-ideal images are processed by comparing their feature maps against those from the initial ideal RGB model. This comparison employs the Extended Area Novel Structural Discrepancy Loss (EANSDL), a novel loss function designed to quantify similarities and integrate them into the detection loss. This approach refines the model's ability to perform object detection across varying conditions through direct feature map correction, encapsulating the essence of Feature Corrective Transfer Learning. Experimental validation on variants of the KITTI dataset demonstrates a significant improvement in mean Average Precision (mAP), resulting in a 3.8-8.1% relative enhancement in detection under non-ideal conditions compared to the baseline model, and a less marginal performance difference within 1.3% of the mAP@[0.5:0.95] achieved under ideal conditions by the standard Faster RCNN algorithm. ",
    "url": "https://arxiv.org/abs/2404.11214",
    "authors": [
      "Chuheng Wei",
      "Guoyuan Wu",
      "Matthew J. Barth"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11223",
    "title": "AndroLog: Android Instrumentation and Code Coverage Analysis",
    "abstract": "Dynamic analysis has emerged as a pivotal technique for testing Android apps, enabling the detection of bugs, malicious code, and vulnerabilities. A key metric in evaluating the efficacy of tools employed by both research and practitioner communities for this purpose is code coverage. Obtaining code coverage typically requires planting probes within apps to gather coverage data during runtime. Due to the general unavailability of source code to analysts, there is a necessity for instrumenting apps to insert these probes in black-box environments. However, the tools available for such instrumentation are limited in their reliability and require intrusive changes interfering with apps' functionalities. This paper introduces AndroLog a novel tool developed on top of the Soot framework, designed to provide fine-grained coverage information at multiple levels, including class, methods, statements, and Android components. In contrast to existing tools, AndroLog leaves the responsibility to test apps to analysts, and its motto is simplicity. As demonstrated in this paper, AndroLog can instrument up to 98% of recent Android apps compared to existing tools with 79% and 48% respectively for COSMO and ACVTool. AndroLog also stands out for its potential for future enhancements to increase granularity on demand. We make AndroLog available to the community and provide a video demonstration of AndroLog (see section 8). ",
    "url": "https://arxiv.org/abs/2404.11223",
    "authors": [
      "Jordan Samhi",
      "Andreas Zeller"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.11226",
    "title": "Simple In-place Data Augmentation for Surveillance Object Detection",
    "abstract": "Motivated by the need to improve model performance in traffic monitoring tasks with limited labeled samples, we propose a straightforward augmentation technique tailored for object detection datasets, specifically designed for stationary camera-based applications. Our approach focuses on placing objects in the same positions as the originals to ensure its effectiveness. By applying in-place augmentation on objects from the same camera input image, we address the challenge of overlapping with original and previously selected objects. Through extensive testing on two traffic monitoring datasets, we illustrate the efficacy of our augmentation strategy in improving model performance, particularly in scenarios with limited labeled samples and imbalanced class distributions. Notably, our method achieves comparable performance to models trained on the entire dataset while utilizing only 8.5 percent of the original data. Moreover, we report significant improvements, with mAP@.5 increasing from 0.4798 to 0.5025, and the mAP@.5:.95 rising from 0.29 to 0.3138 on the FishEye8K dataset. These results highlight the potential of our augmentation approach in enhancing object detection models for traffic monitoring applications. ",
    "url": "https://arxiv.org/abs/2404.11226",
    "authors": [
      "Munkh-Erdene Otgonbold",
      "Ganzorig Batnasan",
      "Munkhjargal Gochoo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11230",
    "title": "Energy-Efficient Uncertainty-Aware Biomass Composition Prediction at the  Edge",
    "abstract": "Clover fixates nitrogen from the atmosphere to the ground, making grass-clover mixtures highly desirable to reduce external nitrogen fertilization. Herbage containing clover additionally promotes higher food intake, resulting in higher milk production. Herbage probing however remains largely unused as it requires a time-intensive manual laboratory analysis. Without this information, farmers are unable to perform localized clover sowing or take targeted fertilization decisions. Deep learning algorithms have been proposed with the goal to estimate the dry biomass composition from images of the grass directly in the fields. The energy-intensive nature of deep learning however limits deployment to practical edge devices such as smartphones. This paper proposes to fill this gap by applying filter pruning to reduce the energy requirement of existing deep learning solutions. We report that although pruned networks are accurate on controlled, high-quality images of the grass, they struggle to generalize to real-world smartphone images that are blurry or taken from challenging angles. We address this challenge by training filter-pruned models using a variance attenuation loss so they can predict the uncertainty of their predictions. When the uncertainty exceeds a threshold, we re-infer using a more accurate unpruned model. This hybrid approach allows us to reduce energy consumption while retaining a high accuracy. We evaluate our algorithm on two datasets: the GrassClover and the Irish clover using an NVIDIA Jetson Nano edge device. We find that we reduce energy reduction with respect to state-of-the-art solutions by 50% on average with only 4% accuracy loss. ",
    "url": "https://arxiv.org/abs/2404.11230",
    "authors": [
      "Muhammad Zawish",
      "Paul Albert",
      "Flavio Esposito",
      "Steven Davy",
      "Lizy Abraham"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11243",
    "title": "Optical Image-to-Image Translation Using Denoising Diffusion Models:  Heterogeneous Change Detection as a Use Case",
    "abstract": "We introduce an innovative deep learning-based method that uses a denoising diffusion-based model to translate low-resolution images to high-resolution ones from different optical sensors while preserving the contents and avoiding undesired artifacts. The proposed method is trained and tested on a large and diverse data set of paired Sentinel-II and Planet Dove images. We show that it can solve serious image generation issues observed when the popular classifier-free guided Denoising Diffusion Implicit Model (DDIM) framework is used in the task of Image-to-Image Translation of multi-sensor optical remote sensing images and that it can generate large images with highly consistent patches, both in colors and in features. Moreover, we demonstrate how our method improves heterogeneous change detection results in two urban areas: Beirut, Lebanon, and Austin, USA. Our contributions are: i) a new training and testing algorithm based on denoising diffusion models for optical image translation; ii) a comprehensive image quality evaluation and ablation study; iii) a comparison with the classifier-free guided DDIM framework; and iv) change detection experiments on heterogeneous data. ",
    "url": "https://arxiv.org/abs/2404.11243",
    "authors": [
      "João Gabriel Vinholi",
      "Marco Chini",
      "Anis Amziane",
      "Renato Machado",
      "Danilo Silva",
      "Patrick Matgen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11246",
    "title": "Learning Social Navigation from Demonstrations with Deep Neural Networks",
    "abstract": "Traditional path-planning techniques treat humans as obstacles. This has changed since robots started to enter human environments. On modern robots, social navigation has become an important aspect of navigation systems. To use learning-based techniques to achieve social navigation, a powerful framework that is capable of representing complex functions with as few data as possible is required. In this study, we benefited from recent advances in deep learning at both global and local planning levels to achieve human-aware navigation on a simulated robot. Two distinct deep models are trained with respective objectives: one for global planning and one for local planning. These models are then employed in the simulated robot. In the end, it has been shown that our model can successfully carry out both global and local planning tasks. We have shown that our system could generate paths that successfully reach targets while avoiding obstacles with better performance compared to feed-forward neural networks. ",
    "url": "https://arxiv.org/abs/2404.11246",
    "authors": [
      "Yigit Yildirim",
      "Emre Ugur"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2404.11262",
    "title": "Sampling-based Pseudo-Likelihood for Membership Inference Attacks",
    "abstract": "Large Language Models (LLMs) are trained on large-scale web data, which makes it difficult to grasp the contribution of each text. This poses the risk of leaking inappropriate data such as benchmarks, personal information, and copyrighted texts in the training data. Membership Inference Attacks (MIA), which determine whether a given text is included in the model's training data, have been attracting attention. Previous studies of MIAs revealed that likelihood-based classification is effective for detecting leaks in LLMs. However, the existing methods cannot be applied to some proprietary models like ChatGPT or Claude 3 because the likelihood is unavailable to the user. In this study, we propose a Sampling-based Pseudo-Likelihood (\\textbf{SPL}) method for MIA (\\textbf{SaMIA}) that calculates SPL using only the text generated by an LLM to detect leaks. The SaMIA treats the target text as the reference text and multiple outputs from the LLM as text samples, calculates the degree of $n$-gram match as SPL, and determines the membership of the text in the training data. Even without likelihoods, SaMIA performed on par with existing likelihood-based methods. ",
    "url": "https://arxiv.org/abs/2404.11262",
    "authors": [
      "Masahiro Kaneko",
      "Youmi Ma",
      "Yuki Wata",
      "Naoaki Okazaki"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.11266",
    "title": "Criteria for Uncertainty-based Corner Cases Detection in Instance  Segmentation",
    "abstract": "The operating environment of a highly automated vehicle is subject to change, e.g., weather, illumination, or the scenario containing different objects and other participants in which the highly automated vehicle has to navigate its passengers safely. These situations must be considered when developing and validating highly automated driving functions. This already poses a problem for training and evaluating deep learning models because without the costly labeling of thousands of recordings, not knowing whether the data contains relevant, interesting data for further model training, it is a guess under which conditions and situations the model performs poorly. For this purpose, we present corner case criteria based on the predictive uncertainty. With our corner case criteria, we are able to detect uncertainty-based corner cases of an object instance segmentation model without relying on ground truth (GT) data. We evaluated each corner case criterion using the COCO and the NuImages dataset to analyze the potential of our approach. We also provide a corner case decision function that allows us to distinguish each object into True Positive (TP), localization and/or classification corner case, or False Positive (FP). We also present our first results of an iterative training cycle that outperforms the baseline and where the data added to the training dataset is selected based on the corner case decision function. ",
    "url": "https://arxiv.org/abs/2404.11266",
    "authors": [
      "Florian Heidecker",
      "Ahmad El-Khateeb",
      "Maarten Bieshaar",
      "Bernhard Sick"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11269",
    "title": "DACAD: Domain Adaptation Contrastive Learning for Anomaly Detection in  Multivariate Time Series",
    "abstract": "Time series anomaly detection (TAD) faces a significant challenge due to the scarcity of labelled data, which hinders the development of accurate detection models. Unsupervised domain adaptation (UDA) addresses this challenge by leveraging a labelled dataset from a related domain to detect anomalies in a target dataset. Existing domain adaptation techniques assume that the number of anomalous classes does not change between the source and target domains. In this paper, we propose a novel Domain Adaptation Contrastive learning for Anomaly Detection in multivariate time series (DACAD) model to address this issue by combining UDA and contrastive representation learning. DACAD's approach includes an anomaly injection mechanism that introduces various types of synthetic anomalies, enhancing the model's ability to generalise across unseen anomalous classes in different domains. This method significantly broadens the model's adaptability and robustness. Additionally, we propose a supervised contrastive loss for the source domain and a self-supervised contrastive triplet loss for the target domain, improving comprehensive feature representation learning and extraction of domain-invariant features. Finally, an effective Centre-based Entropy Classifier (CEC) is proposed specifically for anomaly detection, facilitating accurate learning of normal boundaries in the source domain. Our extensive evaluation across multiple real-world datasets against leading models in time series anomaly detection and UDA underscores DACAD's effectiveness. The results validate DACAD's superiority in transferring knowledge across domains and its potential to mitigate the challenge of limited labelled data in time series anomaly detection. ",
    "url": "https://arxiv.org/abs/2404.11269",
    "authors": [
      "Zahra Zamanzadeh Darban",
      "Geoffrey I. Webb",
      "Mahsa Salehi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11280",
    "title": "Image Generative Semantic Communication with Multi-Modal Similarity  Estimation for Resource-Limited Networks",
    "abstract": "To reduce network traffic and support environments with limited resources, a method for transmitting images with low amounts of transmission data is required. Machine learning-based image compression methods, which compress the data size of images while maintaining their features, have been proposed. However, in certain situations, reconstructing a part of semantic information of images at the receiver end may be sufficient. To realize this concept, semantic-information-based communication, called semantic communication, has been proposed, along with an image transmission method using semantic communication. This method transmits only the semantic information of an image, and the receiver reconstructs the image using an image-generation model. This method utilizes one type of semantic information, but reconstructing images similar to the original image using only it is challenging. This study proposes a multi-modal image transmission method that leverages diverse semantic information for efficient semantic communication. The proposed method extracts multi-modal semantic information from an image and transmits only it. Subsequently, the receiver generates multiple images using an image-generation model and selects an output based on semantic similarity. The receiver must select the output based only on the received features; however, evaluating semantic similarity using conventional metrics is challenging. Therefore, this study explored new metrics to evaluate the similarity between semantic features of images and proposes two scoring procedures. The results indicate that the proposed procedures can compare semantic similarities, such as position and composition, between semantic features of the original and generated images. Thus, the proposed method can facilitate the transmission and utilization of photographs through mobile networks for various service applications. ",
    "url": "https://arxiv.org/abs/2404.11280",
    "authors": [
      "Eri Hosonuma",
      "Taku Yamazaki",
      "Takumi Miyoshi",
      "Akihito Taya",
      "Yuuki Nishiyama",
      "Kaoru Sezaki"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11294",
    "title": "LogSD: Detecting Anomalies from System Logs through Self-supervised  Learning and Frequency-based Masking",
    "abstract": "Log analysis is one of the main techniques that engineers use for troubleshooting large-scale software systems. Over the years, many supervised, semi-supervised, and unsupervised log analysis methods have been proposed to detect system anomalies by analyzing system logs. Among these, semi-supervised methods have garnered increasing attention as they strike a balance between relaxed labeled data requirements and optimal detection performance, contrasting with their supervised and unsupervised counterparts. However, existing semi-supervised methods overlook the potential bias introduced by highly frequent log messages on the learned normal patterns, which leads to their less than satisfactory performance. In this study, we propose LogSD, a novel semi-supervised self-supervised learning approach. LogSD employs a dual-network architecture and incorporates a frequency-based masking scheme, a global-to-local reconstruction paradigm and three self-supervised learning tasks. These features enable LogSD to focus more on relatively infrequent log messages, thereby effectively learning less biased and more discriminative patterns from historical normal data. This emphasis ultimately leads to improved anomaly detection performance. Extensive experiments have been conducted on three commonly-used datasets and the results show that LogSD significantly outperforms eight state-of-the-art benchmark methods. ",
    "url": "https://arxiv.org/abs/2404.11294",
    "authors": [
      "Yongzheng Xie",
      "Hongyu Zhang",
      "Muhammad Ali Babar"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.11311",
    "title": "Use of Parallel Explanatory Models to Enhance Transparency of Neural  Network Configurations for Cell Degradation Detection",
    "abstract": "In a previous paper, we have shown that a recurrent neural network (RNN) can be used to detect cellular network radio signal degradations accurately. We unexpectedly found, though, that accuracy gains diminished as we added layers to the RNN. To investigate this, in this paper, we build a parallel model to illuminate and understand the internal operation of neural networks, such as the RNN, which store their internal state in order to process sequential inputs. This model is widely applicable in that it can be used with any input domain where the inputs can be represented by a Gaussian mixture. By looking at the RNN processing from a probability density function perspective, we are able to show how each layer of the RNN transforms the input distributions to increase detection accuracy. At the same time we also discover a side effect acting to limit the improvement in accuracy. To demonstrate the fidelity of the model we validate it against each stage of RNN processing as well as the output predictions. As a result, we have been able to explain the reasons for the RNN performance limits with useful insights for future designs for RNNs and similar types of neural network. ",
    "url": "https://arxiv.org/abs/2404.11311",
    "authors": [
      "David Mulvey",
      "Chuan Heng Foh",
      "Muhammad Ali Imran",
      "Rahim Tafazolli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.11314",
    "title": "Destructive and constructive RIS beamforming in an ISAC-multi-user MIMO  network",
    "abstract": "Integrated sensing and communication (ISAC) has already established itself as a promising solution to the spectrum scarcity problem, even more so when paired with a reconfigurable intelligent surface (RIS) as RISs can shape the propagation environment by adjusting their phase-shift coefficients. Albeit the potential performance gain, a RIS also poses a security threat to the system: in this paper, we explore both sides of the RIS presence in a multi-user MIMO (multiple-input multiple-output) ISAC network. We first develop an alternating optimization algorithm, obtaining the active and passive beamforming vectors maximizing the sensing signal-to-noise ratio (SNR) under minimum signal-to-interference-plus-noise ratio (SINR) constraints for the communication users and finite power budget. We also investigate the destructive potential of RIS by devising a RIS phase-shift optimization algorithm that minimizes sensing SNR while preserving the same minimum communication SINR previously guaranteed by the system. We further investigate the impact of the RIS's individual element failures on the system performances. The simulation results show that the RIS performance-boosting potential is as good as its destructive one and that both of our optimization strategies show some resilience towards the investigated impairments. ",
    "url": "https://arxiv.org/abs/2404.11314",
    "authors": [
      "Steven Rivetti",
      "Ozlem Tugfe Demir",
      "Emil Bjornson",
      "Mikael Skoglund"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2404.11318",
    "title": "Leveraging Fine-Grained Information and Noise Decoupling for Remote  Sensing Change Detection",
    "abstract": "Change detection aims to identify remote sense object changes by analyzing data between bitemporal image pairs. Due to the large temporal and spatial span of data collection in change detection image pairs, there are often a significant amount of task-specific and task-agnostic noise. Previous effort has focused excessively on denoising, with this goes a great deal of loss of fine-grained information. In this paper, we revisit the importance of fine-grained features in change detection and propose a series of operations for fine-grained information compensation and noise decoupling (FINO). First, the context is utilized to compensate for the fine-grained information in the feature space. Next, a shape-aware and a brightness-aware module are designed to improve the capacity for representation learning. The shape-aware module guides the backbone for more precise shape estimation, guiding the backbone network in extracting object shape features. The brightness-aware module learns a overall brightness estimation to improve the model's robustness to task-agnostic noise. Finally, a task-specific noise decoupling structure is designed as a way to improve the model's ability to separate noise interference from feature similarity. With these training schemes, our proposed method achieves new state-of-the-art (SOTA) results in multiple change detection benchmarks. The code will be made available. ",
    "url": "https://arxiv.org/abs/2404.11318",
    "authors": [
      "Qiangang Du",
      "Jinlong Peng",
      "Changan Wang",
      "Xu Chen",
      "Qingdong He",
      "Wenbing Zhu",
      "Mingmin Chi",
      "Yabiao Wang",
      "Chengjie Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11326",
    "title": "Single-temporal Supervised Remote Change Detection for Domain  Generalization",
    "abstract": "Change detection is widely applied in remote sensing image analysis. Existing methods require training models separately for each dataset, which leads to poor domain generalization. Moreover, these methods rely heavily on large amounts of high-quality pair-labelled data for training, which is expensive and impractical. In this paper, we propose a multimodal contrastive learning (ChangeCLIP) based on visual-language pre-training for change detection domain generalization. Additionally, we propose a dynamic context optimization for prompt learning. Meanwhile, to address the data dependency issue of existing methods, we introduce a single-temporal and controllable AI-generated training strategy (SAIN). This allows us to train the model using a large number of single-temporal images without image pairs in the real world, achieving excellent generalization. Extensive experiments on series of real change detection datasets validate the superiority and strong generalization of ChangeCLIP, outperforming state-of-the-art change detection methods. Code will be available. ",
    "url": "https://arxiv.org/abs/2404.11326",
    "authors": [
      "Qiangang Du",
      "Jinlong Peng",
      "Xu Chen",
      "Qingdong He",
      "Qiang Nie",
      "Wenbing Zhu",
      "Mingmin Chi",
      "Yabiao Wang",
      "Chengjie Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11327",
    "title": "Following the Human Thread in Social Navigation",
    "abstract": "The success of collaboration between humans and robots in shared environments relies on the robot's real-time adaptation to human motion. Specifically, in Social Navigation, the agent should be close enough to assist but ready to back up to let the human move freely, avoiding collisions. Human trajectories emerge as crucial cues in Social Navigation, but they are partially observable from the robot's egocentric view and computationally complex to process. We propose the first Social Dynamics Adaptation model (SDA) based on the robot's state-action history to infer the social dynamics. We propose a two-stage Reinforcement Learning framework: the first learns to encode the human trajectories into social dynamics and learns a motion policy conditioned on this encoded information, the current status, and the previous action. Here, the trajectories are fully visible, i.e., assumed as privileged information. In the second stage, the trained policy operates without direct access to trajectories. Instead, the model infers the social dynamics solely from the history of previous actions and statuses in real-time. Tested on the novel Habitat 3.0 platform, SDA sets a novel state of the art (SoA) performance in finding and following humans. ",
    "url": "https://arxiv.org/abs/2404.11327",
    "authors": [
      "Luca Scofano",
      "Alessio Sampieri",
      "Tommaso Campari",
      "Valentino Sacco",
      "Indro Spinelli",
      "Lamberto Ballan",
      "Fabio Galasso"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11341",
    "title": "The Causal Chambers: Real Physical Systems as a Testbed for AI  Methodology",
    "abstract": "In some fields of AI, machine learning and statistics, the validation of new methods and algorithms is often hindered by the scarcity of suitable real-world datasets. Researchers must often turn to simulated data, which yields limited information about the applicability of the proposed methods to real problems. As a step forward, we have constructed two devices that allow us to quickly and inexpensively produce large datasets from non-trivial but well-understood physical systems. The devices, which we call causal chambers, are computer-controlled laboratories that allow us to manipulate and measure an array of variables from these physical systems, providing a rich testbed for algorithms from a variety of fields. We illustrate potential applications through a series of case studies in fields such as causal discovery, out-of-distribution generalization, change point detection, independent component analysis, and symbolic regression. For applications to causal inference, the chambers allow us to carefully perform interventions. We also provide and empirically validate a causal model of each chamber, which can be used as ground truth for different tasks. All hardware and software is made open source, and the datasets are publicly available at causalchamber.org or through the Python package causalchamber. ",
    "url": "https://arxiv.org/abs/2404.11341",
    "authors": [
      "Juan L. Gamella",
      "Jonas Peters",
      "Peter Bühlmann"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2404.11355",
    "title": "Consisaug: A Consistency-based Augmentation for Polyp Detection in  Endoscopy Image Analysis",
    "abstract": "Colorectal cancer (CRC), which frequently originates from initially benign polyps, remains a significant contributor to global cancer-related mortality. Early and accurate detection of these polyps via colonoscopy is crucial for CRC prevention. However, traditional colonoscopy methods depend heavily on the operator's experience, leading to suboptimal polyp detection rates. Besides, the public database are limited in polyp size and shape diversity. To enhance the available data for polyp detection, we introduce Consisaug, an innovative and effective methodology to augment data that leverages deep learning. We utilize the constraint that when the image is flipped the class label should be equal and the bonding boxes should be consistent. We implement our Consisaug on five public polyp datasets and at three backbones, and the results show the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2404.11355",
    "authors": [
      "Ziyu Zhou",
      "Wenyuan Shen",
      "Chang Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11357",
    "title": "Detector Collapse: Backdooring Object Detection to Catastrophic Overload  or Blindness",
    "abstract": "Object detection tasks, crucial in safety-critical systems like autonomous driving, focus on pinpointing object locations. These detectors are known to be susceptible to backdoor attacks. However, existing backdoor techniques have primarily been adapted from classification tasks, overlooking deeper vulnerabilities specific to object detection. This paper is dedicated to bridging this gap by introducing Detector Collapse} (DC), a brand-new backdoor attack paradigm tailored for object detection. DC is designed to instantly incapacitate detectors (i.e., severely impairing detector's performance and culminating in a denial-of-service). To this end, we develop two innovative attack schemes: Sponge for triggering widespread misidentifications and Blinding for rendering objects invisible. Remarkably, we introduce a novel poisoning strategy exploiting natural objects, enabling DC to act as a practical backdoor in real-world environments. Our experiments on different detectors across several benchmarks show a significant improvement ($\\sim$10\\%-60\\% absolute and $\\sim$2-7$\\times$ relative) in attack efficacy over state-of-the-art attacks. ",
    "url": "https://arxiv.org/abs/2404.11357",
    "authors": [
      "Hangtao Zhang",
      "Shengshan Hu",
      "Yichen Wang",
      "Leo Yu Zhang",
      "Ziqi Zhou",
      "Xianlong Wang",
      "Yanjun Zhang",
      "Chao Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11374",
    "title": "Tensor Factorisation for Polypharmacy Side Effect Prediction",
    "abstract": "Adverse reactions caused by drug combinations are an increasingly common phenomenon, making their accurate prediction an important challenge in modern medicine. However, the polynomial nature of this problem renders lab-based identification of adverse reactions insufficient. Dozens of computational approaches have therefore been proposed for the task in recent years, with varying degrees of success. One group of methods that has seemingly been under-utilised in this area is tensor factorisation, despite their clear applicability to this type of data. In this work, we apply three such models to a benchmark dataset in order to compare them against established techniques. We find, in contrast to previous reports, that for this task tensor factorisation models are competitive with state-of-the-art graph neural network models and we recommend that future work in this field considers cheaper methods with linear complexity before running costly deep learning processes. ",
    "url": "https://arxiv.org/abs/2404.11374",
    "authors": [
      "Oliver Lloyd",
      "Yi Liu",
      "Tom R. Gaunt"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2404.11384",
    "title": "Exploring Key Point Analysis with Pairwise Generation and Graph  Partitioning",
    "abstract": "Key Point Analysis (KPA), the summarization of multiple arguments into a concise collection of key points, continues to be a significant and unresolved issue within the field of argument mining. Existing models adapt a two-stage pipeline of clustering arguments or generating key points for argument clusters. This approach rely on semantic similarity instead of measuring the existence of shared key points among arguments. Additionally, it only models the intra-cluster relationship among arguments, disregarding the inter-cluster relationship between arguments that do not share key points. To address these limitations, we propose a novel approach for KPA with pairwise generation and graph partitioning. Our objective is to train a generative model that can simultaneously provide a score indicating the presence of shared key point between a pair of arguments and generate the shared key point. Subsequently, to map generated redundant key points to a concise set of key points, we proceed to construct an arguments graph by considering the arguments as vertices, the generated key points as edges, and the scores as edge weights. We then propose a graph partitioning algorithm to partition all arguments sharing the same key points to the same subgraph. Notably, our experimental findings demonstrate that our proposed model surpasses previous models when evaluated on both the ArgKP and QAM datasets. ",
    "url": "https://arxiv.org/abs/2404.11384",
    "authors": [
      "Xiao Li",
      "Yong Jiang",
      "Shen Huang",
      "Pengjun Xie",
      "Gong Cheng",
      "Fei Huang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.11388",
    "title": "Enhancing Data Privacy In Wireless Sensor Networks: Investigating  Techniques And Protocols To Protect Privacy Of Data Transmitted Over Wireless  Sensor Networks In Critical Applications Of Healthcare And National Security",
    "abstract": "The article discusses the emergence of Wireless Sensor Networks (WSNs) as a groundbreaking technology in data processing and communication. It outlines how WSNs, composed of dispersed autonomous sensors, are utilized to monitor physical and environmental factors, transmitting data wirelessly for analysis. The article explores various applications of WSNs in healthcare, national security, emergency response, and infrastructure monitoring, highlighting their roles in enhancing patient care, public health surveillance, border security, disaster management, and military operations. Additionally, it examines the foundational concepts of data privacy in WSNs, focusing on encryption techniques, authentication mechanisms, anonymization techniques, and access control mechanisms. The article also addresses vulnerabilities, threats, and challenges related to data privacy in healthcare and national security contexts, emphasizing regulatory compliance, ethical considerations, and socio-economic factors. Furthermore, it introduces the Diffusion of Innovation Theory as a framework for understanding the adoption of privacy-enhancing technologies in WSNs. Finally, the article reviews empirical studies demonstrating the efficacy of security solutions in preserving data privacy in WSNs, offering insights into advancements in safeguarding sensitive information. ",
    "url": "https://arxiv.org/abs/2404.11388",
    "authors": [
      "Akinsola Ahmed",
      "Ejiofor Oluomachi",
      "Akinde Abdullah",
      "Njoku Tochukwu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2404.11394",
    "title": "What-if Analysis Framework for Digital Twins in 6G Wireless Network  Management",
    "abstract": "This study explores implementing a digital twin network (DTN) for efficient 6G wireless network management, aligning with the fault, configuration, accounting, performance, and security (FCAPS) model. The DTN architecture comprises the Physical Twin Layer, implemented using NS-3, and the Service Layer, featuring machine learning and reinforcement learning for optimizing carrier sensitivity threshold and transmit power control in wireless networks. We introduce a robust \"What-if Analysis\" module, utilizing conditional tabular generative adversarial network (CTGAN) for synthetic data generation to mimic various network scenarios. These scenarios assess four network performance metrics: throughput, latency, packet loss, and coverage. Our findings demonstrate the efficiency of the proposed what-if analysis framework in managing complex network conditions, highlighting the importance of the scenario-maker step and the impact of twinning intervals on network performance. ",
    "url": "https://arxiv.org/abs/2404.11394",
    "authors": [
      "Elif Ak",
      "Berk Canberk",
      "Vishal Sharma",
      "Octavia A. Dobre",
      "Trung Q. Duong"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2404.11401",
    "title": "RainyScape: Unsupervised Rainy Scene Reconstruction using Decoupled  Neural Rendering",
    "abstract": "We propose RainyScape, an unsupervised framework for reconstructing clean scenes from a collection of multi-view rainy images. RainyScape consists of two main modules: a neural rendering module and a rain-prediction module that incorporates a predictor network and a learnable latent embedding that captures the rain characteristics of the scene. Specifically, based on the spectral bias property of neural networks, we first optimize the neural rendering pipeline to obtain a low-frequency scene representation. Subsequently, we jointly optimize the two modules, driven by the proposed adaptive direction-sensitive gradient-based reconstruction loss, which encourages the network to distinguish between scene details and rain streaks, facilitating the propagation of gradients to the relevant components. Extensive experiments on both the classic neural radiance field and the recently proposed 3D Gaussian splatting demonstrate the superiority of our method in effectively eliminating rain streaks and rendering clean images, achieving state-of-the-art performance. The constructed high-quality dataset and source code will be publicly available. ",
    "url": "https://arxiv.org/abs/2404.11401",
    "authors": [
      "Xianqiang Lyu",
      "Hui Liu",
      "Junhui Hou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11408",
    "title": "DUPE: Detection Undermining via Prompt Engineering for Deepfake Text",
    "abstract": "As large language models (LLMs) become increasingly commonplace, concern about distinguishing between human and AI text increases as well. The growing power of these models is of particular concern to teachers, who may worry that students will use LLMs to write school assignments. Facing a technology with which they are unfamiliar, teachers may turn to publicly-available AI text detectors. Yet the accuracy of many of these detectors has not been thoroughly verified, posing potential harm to students who are falsely accused of academic dishonesty. In this paper, we evaluate three different AI text detectors-Kirchenbauer et al. watermarks, ZeroGPT, and GPTZero-against human and AI-generated essays. We find that watermarking results in a high false positive rate, and that ZeroGPT has both high false positive and false negative rates. Further, we are able to significantly increase the false negative rate of all detectors by using ChatGPT 3.5 to paraphrase the original AI-generated texts, thereby effectively bypassing the detectors. ",
    "url": "https://arxiv.org/abs/2404.11408",
    "authors": [
      "James Weichert",
      "Chinecherem Dimobi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11416",
    "title": "Neural Shrödinger Bridge Matching for Pansharpening",
    "abstract": "Recent diffusion probabilistic models (DPM) in the field of pansharpening have been gradually gaining attention and have achieved state-of-the-art (SOTA) performance. In this paper, we identify shortcomings in directly applying DPMs to the task of pansharpening as an inverse problem: 1) initiating sampling directly from Gaussian noise neglects the low-resolution multispectral image (LRMS) as a prior; 2) low sampling efficiency often necessitates a higher number of sampling steps. We first reformulate pansharpening into the stochastic differential equation (SDE) form of an inverse problem. Building upon this, we propose a Schr\\\"odinger bridge matching method that addresses both issues. We design an efficient deep neural network architecture tailored for the proposed SB matching. In comparison to the well-established DL-regressive-based framework and the recent DPM framework, our method demonstrates SOTA performance with fewer sampling steps. Moreover, we discuss the relationship between SB matching and other methods based on SDEs and ordinary differential equations (ODEs), as well as its connection with optimal transport. Code will be available. ",
    "url": "https://arxiv.org/abs/2404.11416",
    "authors": [
      "Zihan Cao",
      "Xiao Wu",
      "Liang-Jian Deng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11419",
    "title": "SLAIM: Robust Dense Neural SLAM for Online Tracking and Mapping",
    "abstract": "We present SLAIM - Simultaneous Localization and Implicit Mapping. We propose a novel coarse-to-fine tracking model tailored for Neural Radiance Field SLAM (NeRF-SLAM) to achieve state-of-the-art tracking performance. Notably, existing NeRF-SLAM systems consistently exhibit inferior tracking performance compared to traditional SLAM algorithms. NeRF-SLAM methods solve camera tracking via image alignment and photometric bundle-adjustment. Such optimization processes are difficult to optimize due to the narrow basin of attraction of the optimization loss in image space (local minima) and the lack of initial correspondences. We mitigate these limitations by implementing a Gaussian pyramid filter on top of NeRF, facilitating a coarse-to-fine tracking optimization strategy. Furthermore, NeRF systems encounter challenges in converging to the right geometry with limited input views. While prior approaches use a Signed-Distance Function (SDF)-based NeRF and directly supervise SDF values by approximating ground truth SDF through depth measurements, this often results in suboptimal geometry. In contrast, our method employs a volume density representation and introduces a novel KL regularizer on the ray termination distribution, constraining scene geometry to consist of empty space and opaque surfaces. Our solution implements both local and global bundle-adjustment to produce a robust (coarse-to-fine) and accurate (KL regularizer) SLAM solution. We conduct experiments on multiple datasets (ScanNet, TUM, Replica) showing state-of-the-art results in tracking and in reconstruction accuracy. ",
    "url": "https://arxiv.org/abs/2404.11419",
    "authors": [
      "Vincent Cartillier",
      "Grant Schindler",
      "Irfan Essa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11422",
    "title": "Short-term wind speed forecasting model based on an attention-gated  recurrent neural network and error correction strategy",
    "abstract": "The accurate wind speed series forecast is very pivotal to security of grid dispatching and the application of wind power. Nevertheless, on account of their nonlinear and non-stationary nature, their short-term forecast is extremely challenging. Therefore, this dissertation raises one short-term wind speed forecast pattern on the foundation of attention with an improved gated recurrent neural network (AtGRU) and a tactic of error correction. That model uses the AtGRU model as the preliminary predictor and the GRU model as the error corrector. At the beginning, SSA (singular spectrum analysis) is employed in previous wind speed series for lessening the noise. Subsequently, historical wind speed series is going to be used for the predictor training. During this process, the prediction can have certain errors. The sequence of these errors processed by variational modal decomposition (VMD) is used to train the corrector of error. The eventual forecast consequence is just the sum of predictor forecast and error corrector. The proposed SSA-AtGRU-VMD-GRU model outperforms the compared models in three case studies on Woodburn, St. Thomas, and Santa Cruz. It is indicated that the model evidently enhances the correction of the wind speed forecast. ",
    "url": "https://arxiv.org/abs/2404.11422",
    "authors": [
      "Haojian Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)"
    ]
  },
  {
    "id": "arXiv:2404.11443",
    "title": "Prediction of Unmanned Surface Vessel Motion Attitude Based on  CEEMDAN-PSO-SVM",
    "abstract": "Unmanned boats, while navigating at sea, utilize active compensation systems to mitigate wave disturbances experienced by onboard instruments and equipment. However, there exists a lag in the measurement of unmanned boat attitudes, thus introducing unmanned boat motion attitude prediction to compensate for the lag in the signal acquisition process. This paper, based on the basic principles of waves, derives the disturbance patterns of waves on unmanned boats from the wave energy spectrum. Through simulation analysis of unmanned boat motion attitudes, motion attitude data is obtained, providing experimental data for subsequent work. A combined prediction model based on Complete Ensemble Empirical Mode Decomposition with Adaptive Noise (CEEMDAN), Particle Swarm Optimization (PSO), and Support Vector Machine (SVM) is designed to predict the motion attitude of unmanned boats. Simulation results validate its superior prediction accuracy compared to traditional prediction models. For example, in terms of mean absolute error, it improves by 17% compared to the EMD-PSO-SVM model. ",
    "url": "https://arxiv.org/abs/2404.11443",
    "authors": [
      "Zhuoya Geng",
      "Jianmei Chen",
      "Wanqiang Zhu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11449",
    "title": "AI-Enhanced Cognitive Behavioral Therapy: Deep Learning and Large  Language Models for Extracting Cognitive Pathways from Social Media Texts",
    "abstract": "Cognitive Behavioral Therapy (CBT) is an effective technique for addressing the irrational thoughts stemming from mental illnesses, but it necessitates precise identification of cognitive pathways to be successfully implemented in patient care. In current society, individuals frequently express negative emotions on social media on specific topics, often exhibiting cognitive distortions, including suicidal behaviors in extreme cases. Yet, there is a notable absence of methodologies for analyzing cognitive pathways that could aid psychotherapists in conducting effective interventions online. In this study, we gathered data from social media and established the task of extracting cognitive pathways, annotating the data based on a cognitive theoretical framework. We initially categorized the task of extracting cognitive pathways as a hierarchical text classification with four main categories and nineteen subcategories. Following this, we structured a text summarization task to help psychotherapists quickly grasp the essential information. Our experiments evaluate the performance of deep learning and large language models (LLMs) on these tasks. The results demonstrate that our deep learning method achieved a micro-F1 score of 62.34% in the hierarchical text classification task. Meanwhile, in the text summarization task, GPT-4 attained a Rouge-1 score of 54.92 and a Rouge-2 score of 30.86, surpassing the experimental deep learning model's performance. However, it may suffer from an issue of hallucination. We have made all models and codes publicly available to support further research in this field. ",
    "url": "https://arxiv.org/abs/2404.11449",
    "authors": [
      "Meng Jiang",
      "Yi Jing Yu",
      "Qing Zhao",
      "Jianqiang Li",
      "Changwei Song",
      "Hongzhi Qi",
      "Wei Zhai",
      "Dan Luo",
      "Xiaoqin Wang",
      "Guanghui Fu",
      "Bing Xiang Yang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.11450",
    "title": "Real-Time Trajectory Synthesis with Local Differential Privacy",
    "abstract": "Trajectory streams are being generated from location-aware devices, such as smartphones and in-vehicle navigation systems. Due to the sensitive nature of the location data, directly sharing user trajectories suffers from privacy leakage issues. Local differential privacy (LDP), which perturbs sensitive data on the user side before it is shared or analyzed, emerges as a promising solution for private trajectory stream collection and analysis. Unfortunately, existing stream release approaches often neglect the rich spatial-temporal context information within trajectory streams, resulting in suboptimal utility and limited types of downstream applications. To this end, we propose RetraSyn, a novel real-time trajectory synthesis framework, which is able to perform on-the-fly trajectory synthesis based on the mobility patterns privately extracted from users' trajectory streams. Thus, the downstream trajectory analysis can be performed on the high-utility synthesized data with privacy protection. We also take the genuine behaviors of real-world mobile travelers into consideration, ensuring authenticity and practicality. The key components of RetraSyn include the global mobility model, dynamic mobility update mechanism, real-time synthesis, and adaptive allocation strategy. We conduct extensive experiments on multiple real-world and synthetic trajectory datasets under various location-based utility metrics, encompassing both streaming and historical scenarios. The empirical results demonstrate the superiority and versatility of our proposed framework. ",
    "url": "https://arxiv.org/abs/2404.11450",
    "authors": [
      "Yujia Hu",
      "Yuntao Du",
      "Zhikun Zhang",
      "Ziquan Fang",
      "Lu Chen",
      "Kai Zheng",
      "Yunjun Gao"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.11456",
    "title": "Deep Pattern Network for Click-Through Rate Prediction",
    "abstract": "Click-through rate (CTR) prediction tasks play a pivotal role in real-world applications, particularly in recommendation systems and online advertising. A significant research branch in this domain focuses on user behavior modeling. Current research predominantly centers on modeling co-occurrence relationships between the target item and items previously interacted with by users in their historical data. However, this focus neglects the intricate modeling of user behavior patterns. In reality, the abundance of user interaction records encompasses diverse behavior patterns, indicative of a spectrum of habitual paradigms. These patterns harbor substantial potential to significantly enhance CTR prediction performance. To harness the informational potential within user behavior patterns, we extend Target Attention (TA) to Target Pattern Attention (TPA) to model pattern-level dependencies. Furthermore, three critical challenges demand attention: the inclusion of unrelated items within behavior patterns, data sparsity in behavior patterns, and computational complexity arising from numerous patterns. To address these challenges, we introduce the Deep Pattern Network (DPN), designed to comprehensively leverage information from user behavior patterns. DPN efficiently retrieves target-related user behavior patterns using a target-aware attention mechanism. Additionally, it contributes to refining user behavior patterns through a pre-training paradigm based on self-supervised learning while promoting dependency learning within sparse patterns. Our comprehensive experiments, conducted across three public datasets, substantiate the superior performance and broad compatibility of DPN. ",
    "url": "https://arxiv.org/abs/2404.11456",
    "authors": [
      "Hengyu Zhang",
      "Junwei Pan",
      "Dapeng Liu",
      "Jie Jiang",
      "Xiu Li"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2404.11465",
    "title": "X-posing Free Speech: Examining the Impact of Moderation Relaxation on  Online Social Networks",
    "abstract": "We investigate the impact of free speech and the relaxation of moderation on online social media platforms using Elon Musk's takeover of Twitter as a case study. By curating a dataset of over 10 million tweets, our study employs a novel framework combining content and network analysis. Our findings reveal a significant increase in the distribution of certain forms of hate content, particularly targeting the LGBTQ+ community and liberals. Network analysis reveals the formation of cohesive hate communities facilitated by influential bridge users, with substantial growth in interactions hinting at increased hate production and diffusion. By tracking the temporal evolution of PageRank, we identify key influencers, primarily self-identified far-right supporters disseminating hate against liberals and woke culture. Ironically, embracing free speech principles appears to have enabled hate speech against the very concept of freedom of expression and free speech itself. Our findings underscore the delicate balance platforms must strike between open expression and robust moderation to curb the proliferation of hate online. ",
    "url": "https://arxiv.org/abs/2404.11465",
    "authors": [
      "Arvindh Arun",
      "Saurav Chhatani",
      "Jisun An",
      "Ponnurangam Kumaraguru"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2404.11470",
    "title": "A Federated Learning Approach to Privacy Preserving Offensive Language  Identification",
    "abstract": "The spread of various forms of offensive speech online is an important concern in social media. While platforms have been investing heavily in ways of coping with this problem, the question of privacy remains largely unaddressed. Models trained to detect offensive language on social media are trained and/or fine-tuned using large amounts of data often stored in centralized servers. Since most social media data originates from end users, we propose a privacy preserving decentralized architecture for identifying offensive language online by introducing Federated Learning (FL) in the context of offensive language identification. FL is a decentralized architecture that allows multiple models to be trained locally without the need for data sharing hence preserving users' privacy. We propose a model fusion approach to perform FL. We trained multiple deep learning models on four publicly available English benchmark datasets (AHSD, HASOC, HateXplain, OLID) and evaluated their performance in detail. We also present initial cross-lingual experiments in English and Spanish. We show that the proposed model fusion approach outperforms baselines in all the datasets while preserving privacy. ",
    "url": "https://arxiv.org/abs/2404.11470",
    "authors": [
      "Marcos Zampieri",
      "Damith Premasiri",
      "Tharindu Ranasinghe"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.11488",
    "title": "Multi-resolution Rescored ByteTrack for Video Object Detection on  Ultra-low-power Embedded Systems",
    "abstract": "This paper introduces Multi-Resolution Rescored Byte-Track (MR2-ByteTrack), a novel video object detection framework for ultra-low-power embedded processors. This method reduces the average compute load of an off-the-shelf Deep Neural Network (DNN) based object detector by up to 2.25$\\times$ by alternating the processing of high-resolution images (320$\\times$320 pixels) with multiple down-sized frames (192$\\times$192 pixels). To tackle the accuracy degradation due to the reduced image input size, MR2-ByteTrack correlates the output detections over time using the ByteTrack tracker and corrects potential misclassification using a novel probabilistic Rescore algorithm. By interleaving two down-sized images for every high-resolution one as the input of different state-of-the-art DNN object detectors with our MR2-ByteTrack, we demonstrate an average accuracy increase of 2.16% and a latency reduction of 43% on the GAP9 microcontroller compared to a baseline frame-by-frame inference scheme using exclusively full-resolution images. Code available at: https://github.com/Bomps4/Multi_Resolution_Rescored_ByteTrack ",
    "url": "https://arxiv.org/abs/2404.11488",
    "authors": [
      "Luca Bompani",
      "Manuele Rusci",
      "Daniele Palossi",
      "Francesco Conti",
      "Luca Benini"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11496",
    "title": "Runtime Analysis of Evolutionary Diversity Optimization on the  Multi-objective (LeadingOnes, TrailingZeros) Problem",
    "abstract": "The diversity optimization is the class of optimization problems, in which we aim at finding a diverse set of good solutions. One of the frequently used approaches to solve such problems is to use evolutionary algorithms which evolve a desired diverse population. This approach is called evolutionary diversity optimization (EDO). In this paper, we analyse EDO on a 3-objective function LOTZ$_k$, which is a modification of the 2-objective benchmark function (LeadingOnes, TrailingZeros). We prove that the GSEMO computes a set of all Pareto-optimal solutions in $O(kn^3)$ expected iterations. We also analyze the runtime of the GSEMO$_D$ (a modification of the GSEMO for diversity optimization) until it finds a population with the best possible diversity for two different diversity measures, the total imbalance and the sorted imbalances vector. For the first measure we show that the GSEMO$_D$ optimizes it asymptotically faster than it finds a Pareto-optimal population, in $O(kn^2\\log(n))$ expected iterations, and for the second measure we show an upper bound of $O(k^2n^3\\log(n))$ expected iterations. We complement our theoretical analysis with an empirical study, which shows a very similar behavior for both diversity measures that is close to the theory predictions. ",
    "url": "https://arxiv.org/abs/2404.11496",
    "authors": [
      "Denis Antipov",
      "Aneta Neumann",
      "Frank Neumann. Andrew M. Sutton"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11499",
    "title": "A Data-Driven Representation for Sign Language Production",
    "abstract": "Phonetic representations are used when recording spoken languages, but no equivalent exists for recording signed languages. As a result, linguists have proposed several annotation systems that operate on the gloss or sub-unit level; however, these resources are notably irregular and scarce. Sign Language Production (SLP) aims to automatically translate spoken language sentences into continuous sequences of sign language. However, current state-of-the-art approaches rely on scarce linguistic resources to work. This has limited progress in the field. This paper introduces an innovative solution by transforming the continuous pose generation problem into a discrete sequence generation problem. Thus, overcoming the need for costly annotation. Although, if available, we leverage the additional information to enhance our approach. By applying Vector Quantisation (VQ) to sign language data, we first learn a codebook of short motions that can be combined to create a natural sequence of sign. Where each token in the codebook can be thought of as the lexicon of our representation. Then using a transformer we perform a translation from spoken language text to a sequence of codebook tokens. Each token can be directly mapped to a sequence of poses allowing the translation to be performed by a single network. Furthermore, we present a sign stitching method to effectively join tokens together. We evaluate on the RWTH-PHOENIX-Weather-2014T (PHOENIX14T) and the more challenging Meine DGS Annotated (mDGS) datasets. An extensive evaluation shows our approach outperforms previous methods, increasing the BLEU-1 back translation score by up to 72%. ",
    "url": "https://arxiv.org/abs/2404.11499",
    "authors": [
      "Harry Walsh",
      "Abolfazl Ravanshad",
      "Mariam Rahmani",
      "Richard Bowden"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11515",
    "title": "Embedding Privacy in Computational Social Science and Artificial  Intelligence Research",
    "abstract": "Privacy is a human right. It ensures that individuals are free to engage in discussions, participate in groups, and form relationships online or offline without fear of their data being inappropriately harvested, analyzed, or otherwise used to harm them. Preserving privacy has emerged as a critical factor in research, particularly in the computational social science (CSS), artificial intelligence (AI) and data science domains, given their reliance on individuals' data for novel insights. The increasing use of advanced computational models stands to exacerbate privacy concerns because, if inappropriately used, they can quickly infringe privacy rights and lead to adverse effects for individuals - especially vulnerable groups - and society. We have already witnessed a host of privacy issues emerge with the advent of large language models (LLMs), such as ChatGPT, which further demonstrate the importance of embedding privacy from the start. This article contributes to the field by discussing the role of privacy and the primary issues that researchers working in CSS, AI, data science and related domains are likely to face. It then presents several key considerations for researchers to ensure participant privacy is best preserved in their research design, data collection and use, analysis, and dissemination of research results. ",
    "url": "https://arxiv.org/abs/2404.11515",
    "authors": [
      "Keenan Jones",
      "Fatima Zahrah",
      "Jason R.C. Nurse"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Emerging Technologies (cs.ET)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2404.11519",
    "title": "Disentangled Cascaded Graph Convolution Networks for Multi-Behavior  Recommendation",
    "abstract": "Multi-behavioral recommender systems have emerged as a solution to address data sparsity and cold-start issues by incorporating auxiliary behaviors alongside target behaviors. However, existing models struggle to accurately capture varying user preferences across different behaviors and fail to account for diverse item preferences within behaviors. Various user preference factors (such as price or quality) entangled in the behavior may lead to sub-optimization problems. Furthermore, these models overlook the personalized nature of user behavioral preferences by employing uniform transformation networks for all users and items. To tackle these challenges, we propose the Disentangled Cascaded Graph Convolutional Network (Disen-CGCN), a novel multi-behavior recommendation model. Disen-CGCN employs disentangled representation techniques to effectively separate factors within user and item representations, ensuring their independence. In addition, it incorporates a multi-behavioral meta-network, enabling personalized feature transformation across user and item behaviors. Furthermore, an attention mechanism captures user preferences for different item factors within each behavior. By leveraging attention weights, we aggregate user and item embeddings separately for each behavior, computing preference scores that predict overall user preferences for items. Our evaluation on benchmark datasets demonstrates the superiority of Disen-CGCN over state-of-the-art models, showcasing an average performance improvement of 7.07% and 9.00% on respective datasets. These results highlight Disen-CGCN's ability to effectively leverage multi-behavioral data, leading to more accurate recommendations. ",
    "url": "https://arxiv.org/abs/2404.11519",
    "authors": [
      "Zhiyong Cheng",
      "Jianhua Dong",
      "Fan Liu",
      "Lei Zhu",
      "Xun Yang",
      "Meng Wang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2404.11532",
    "title": "Select and Reorder: A Novel Approach for Neural Sign Language Production",
    "abstract": "Sign languages, often categorised as low-resource languages, face significant challenges in achieving accurate translation due to the scarcity of parallel annotated datasets. This paper introduces Select and Reorder (S&R), a novel approach that addresses data scarcity by breaking down the translation process into two distinct steps: Gloss Selection (GS) and Gloss Reordering (GR). Our method leverages large spoken language models and the substantial lexical overlap between source spoken languages and target sign languages to establish an initial alignment. Both steps make use of Non-AutoRegressive (NAR) decoding for reduced computation and faster inference speeds. Through this disentanglement of tasks, we achieve state-of-the-art BLEU and Rouge scores on the Meine DGS Annotated (mDGS) dataset, demonstrating a substantial BLUE-1 improvement of 37.88% in Text to Gloss (T2G) Translation. This innovative approach paves the way for more effective translation models for sign languages, even in resource-constrained settings. ",
    "url": "https://arxiv.org/abs/2404.11532",
    "authors": [
      "Harry Walsh",
      "Ben Saunders",
      "Richard Bowden"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.11538",
    "title": "GenFighter: A Generative and Evolutive Textual Attack Removal",
    "abstract": "Adversarial attacks pose significant challenges to deep neural networks (DNNs) such as Transformer models in natural language processing (NLP). This paper introduces a novel defense strategy, called GenFighter, which enhances adversarial robustness by learning and reasoning on the training classification distribution. GenFighter identifies potentially malicious instances deviating from the distribution, transforms them into semantically equivalent instances aligned with the training data, and employs ensemble techniques for a unified and robust response. By conducting extensive experiments, we show that GenFighter outperforms state-of-the-art defenses in accuracy under attack and attack success rate metrics. Additionally, it requires a high number of queries per attack, making the attack more challenging in real scenarios. The ablation study shows that our approach integrates transfer learning, a generative/evolutive procedure, and an ensemble method, providing an effective defense against NLP adversarial attacks. ",
    "url": "https://arxiv.org/abs/2404.11538",
    "authors": [
      "Md Athikul Islam",
      "Edoardo Serra",
      "Sushil Jajodia"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.11545",
    "title": "Strategic Network Inspection with Location-Specific Detection  Capabilities",
    "abstract": "We consider a two-person network inspection game, in which a defender positions a limited number of detectors to detect multiple attacks caused by an attacker. We assume that detection is imperfect, and each detector location is associated with a probability of detecting attacks within its set of monitored network components. The objective of the defender (resp. attacker) is to minimize (resp. maximize) the expected number of undetected attacks. To compute Nash Equilibria (NE) for this large-scale zero-sum game, we formulate a linear program with a small number of constraints, which we solve via column generation. We provide an exact mixed-integer program for the pricing problem, which entails computing a defender's pure best response, and leverage its supermodular structure to derive two efficient approaches to obtain approximate NE with theoretical guarantees: A column generation and a multiplicative weights update (MWU) algorithm with approximate best responses. To address the computational challenges posed by combinatorial attacker strategies, each iteration of our MWU algorithm requires computing a projection under the unnormalized relative entropy. We provide a closed-form solution and a linear-time algorithm for the projection problem. Our computational results in real-world gas distribution networks illustrate the performance and scalability of our solution approaches. ",
    "url": "https://arxiv.org/abs/2404.11545",
    "authors": [
      "Bastián Bahamondes",
      "Mathieu Dahan"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2404.11568",
    "title": "On the Scalability of GNNs for Molecular Graphs",
    "abstract": "Scaling deep learning models has been at the heart of recent revolutions in language modelling and image generation. Practitioners have observed a strong relationship between model size, dataset size, and performance. However, structure-based architectures such as Graph Neural Networks (GNNs) are yet to show the benefits of scale mainly due to the lower efficiency of sparse operations, large data requirements, and lack of clarity about the effectiveness of various architectures. We address this drawback of GNNs by studying their scaling behavior. Specifically, we analyze message-passing networks, graph Transformers, and hybrid architectures on the largest public collection of 2D molecular graphs. For the first time, we observe that GNNs benefit tremendously from the increasing scale of depth, width, number of molecules, number of labels, and the diversity in the pretraining datasets, resulting in a 30.25% improvement when scaling to 1 billion parameters and 28.98% improvement when increasing size of dataset to eightfold. We further demonstrate strong finetuning scaling behavior on 38 tasks, outclassing previous large models. We hope that our work paves the way for an era where foundational GNNs drive pharmaceutical drug discovery. ",
    "url": "https://arxiv.org/abs/2404.11568",
    "authors": [
      "Maciej Sypetkowski",
      "Frederik Wenkel",
      "Farimah Poursafaei",
      "Nia Dickson",
      "Karush Suri",
      "Philip Fradkin",
      "Dominique Beaini"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.11576",
    "title": "State-space Decomposition Model for Video Prediction Considering  Long-term Motion Trend",
    "abstract": "Stochastic video prediction enables the consideration of uncertainty in future motion, thereby providing a better reflection of the dynamic nature of the environment. Stochastic video prediction methods based on image auto-regressive recurrent models need to feed their predictions back into the latent space. Conversely, the state-space models, which decouple frame synthesis and temporal prediction, proves to be more efficient. However, inferring long-term temporal information about motion and generalizing to dynamic scenarios under non-stationary assumptions remains an unresolved challenge. In this paper, we propose a state-space decomposition stochastic video prediction model that decomposes the overall video frame generation into deterministic appearance prediction and stochastic motion prediction. Through adaptive decomposition, the model's generalization capability to dynamic scenarios is enhanced. In the context of motion prediction, obtaining a prior on the long-term trend of future motion is crucial. Thus, in the stochastic motion prediction branch, we infer the long-term motion trend from conditional frames to guide the generation of future frames that exhibit high consistency with the conditional frames. Experimental results demonstrate that our model outperforms baselines on multiple datasets. ",
    "url": "https://arxiv.org/abs/2404.11576",
    "authors": [
      "Fei Cui",
      "Jiaojiao Fang",
      "Xiaojiang Wu",
      "Zelong Lai",
      "Mengke Yang",
      "Menghan Jia",
      "Guizhong Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11585",
    "title": "Spatial Context-based Self-Supervised Learning for Handwritten Text  Recognition",
    "abstract": "Handwritten Text Recognition (HTR) is a relevant problem in computer vision, and implies unique challenges owing to its inherent variability and the rich contextualization required for its interpretation. Despite the success of Self-Supervised Learning (SSL) in computer vision, its application to HTR has been rather scattered, leaving key SSL methodologies unexplored. This work focuses on one of them, namely Spatial Context-based SSL. We investigate how this family of approaches can be adapted and optimized for HTR and propose new workflows that leverage the unique features of handwritten text. Our experiments demonstrate that the methods considered lead to advancements in the state-of-the-art of SSL for HTR in a number of benchmark cases. ",
    "url": "https://arxiv.org/abs/2404.11585",
    "authors": [
      "Carlos Penarrubia",
      "Carlos Garrido-Munoz",
      "Jose J. Valero-Mas",
      "Jorge Calvo-Zaragoza"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11591",
    "title": "The EDGE Language: Extended General Einsums for Graph Algorithms",
    "abstract": "In this work, we propose a unified abstraction for graph algorithms: the Extended General Einsums language, or EDGE. The EDGE language expresses graph algorithms in the language of tensor algebra, providing a rigorous, succinct, and expressive mathematical framework. EDGE leverages two ideas: (1) the well-known foundations provided by the graph-matrix duality, where a graph is simply a 2D tensor, and (2) the power and expressivity of Einsum notation in the tensor algebra world. In this work, we describe our design goals for EDGE and walk through the extensions we add to Einsums to support more complex operations common in graph algorithms. Additionally, we provide a few examples of how to express graph algorithms in our proposed notation. We hope that a single, mathematical notation for graph algorithms will (1) allow researchers to more easily compare different algorithms and different implementations of a graph algorithm; (2) enable developers to factor complexity by separating the concerns of what to compute (described with the extended Einsum notation) from the lower level details of how to compute; and (3) enable the discovery of different algorithmic variants of a problem through algebraic manipulations and transformations on a given EDGE expression. ",
    "url": "https://arxiv.org/abs/2404.11591",
    "authors": [
      "Toluwanimi O. Odemuyiwa",
      "Joel S. Emer",
      "John D. Owens"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2404.11597",
    "title": "Explainable Artificial Intelligence Techniques for Accurate Fault  Detection and Diagnosis: A Review",
    "abstract": "As the manufacturing industry advances with sensor integration and automation, the opaque nature of deep learning models in machine learning poses a significant challenge for fault detection and diagnosis. And despite the related predictive insights Artificial Intelligence (AI) can deliver, advanced machine learning engines often remain a black box. This paper reviews the eXplainable AI (XAI) tools and techniques in this context. We explore various XAI methodologies, focusing on their role in making AI decision-making transparent, particularly in critical scenarios where humans are involved. We also discuss current limitations and potential future research that aims to balance explainability with model performance while improving trustworthiness in the context of AI applications for critical industrial use cases. ",
    "url": "https://arxiv.org/abs/2404.11597",
    "authors": [
      "Ahmed Maged",
      "Salah Haridy",
      "Herman Shen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.09307",
    "title": "Cost-effective company response policy for product co-creation in  company-sponsored online community",
    "abstract": "Product co-creation based on company-sponsored online community has come to be a paradigm of developing new products collaboratively with customers. In such a product co-creation campaign, the sponsoring company needs to interact intensively with active community members about the design scheme of the product. We call the collection of the rates of the company's response to active community members at all time in the co-creation campaign as a company response policy (CRP). This paper addresses the problem of finding a cost-effective CRP (the CRP problem). First, we introduce a novel community state evolutionary model and, thereby, establish an optimal control model for the CRP problem (the CRP model). Second, based on the optimality system for the CRP model, we present an iterative algorithm for solving the CRP model (the CRP algorithm). Thirdly, through extensive numerical experiments, we conclude that the CRP algorithm converges and the resulting CRP exhibits excellent cost benefit. Consequently, we recommend the resulting CRP to companies that embrace product co-creation. Next, we discuss how to implement the resulting CRP. Finally, we investigate the effect of some factors on the cost benefit of the resulting CRP. To our knowledge, this work is the first attempt to study value co-creation through optimal control theoretic approach. ",
    "url": "https://arxiv.org/abs/2404.09307",
    "authors": [
      "Jiamin Hu",
      "Lu-Xing Yang",
      "Xiaofan Yang",
      "Kaifan Huang",
      "Gang Li",
      "Yong Xiang"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2404.10888",
    "title": "The sandwich problem for odd-hole-free and even-hole-free graphs",
    "abstract": "For a property $\\mathcal{P}$ of graphs, the $\\mathcal{P}$-\\textsc{Sandwich-Problem}, introduced by Golumbic and Shamir (1993), is the following: Given a pair of graphs $(G_1, G_2)$ on the same vertex set $V$, does there exist a graph $G$ such that $V(G)=V$, $E(G_{1})\\subseteq E(G) \\subseteq E(G_{2})$, and $G$ satisfies $\\mathcal{P}$? A {\\em hole} in a graph is an induced subgraph which is a cycle of length at least four. An odd (respectively even) hole is a hole of odd (respectively even) length. Given a class of graphs $\\mathcal{C}$ and a graph $G$ we say that $G$ is {\\em $\\mathcal{C}$-free} if it contains no induced subgraph isomorphic to a member of $\\mathcal{C}$. In this paper we prove that if $\\mathcal{P}$ is the property of being odd-hole-free or the property of being even-hole-free, then the $\\mathcal{P}$-\\textsc{Sandwich-Problem} is NP-hard. ",
    "url": "https://arxiv.org/abs/2404.10888",
    "authors": [
      "Kathie Cameron",
      "Aristotelis Chaniotis",
      "Celina M. H. de Figueiredo",
      "Sophie Spirkl"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2404.10935",
    "title": "Molecular relaxation by reverse diffusion with time step prediction",
    "abstract": "Molecular relaxation, finding the equilibrium state of a non-equilibrium structure, is an essential component of computational chemistry to understand reactivity. Classical force field methods often rely on insufficient local energy minimization, while neural network force field models require large labeled datasets encompassing both equilibrium and non-equilibrium structures. As a remedy, we propose MoreRed, molecular relaxation by reverse diffusion, a conceptually novel and purely statistical approach where non-equilibrium structures are treated as noisy instances of their corresponding equilibrium states. To enable the denoising of arbitrarily noisy inputs via a generative diffusion model, we further introduce a novel diffusion time step predictor. Notably, MoreRed learns a simpler pseudo potential energy surface instead of the complex physical potential energy surface. It is trained on a significantly smaller, and thus computationally cheaper, dataset consisting of solely unlabeled equilibrium structures, avoiding the computation of non-equilibrium structures altogether. We compare MoreRed to classical force fields, equivariant neural network force fields trained on a large dataset of equilibrium and non-equilibrium data, as well as a semi-empirical tight-binding model. To assess this quantitatively, we evaluate the root-mean-square deviation between the found equilibrium structures and the reference equilibrium structures as well as their DFT energies. ",
    "url": "https://arxiv.org/abs/2404.10935",
    "authors": [
      "Khaled Kahouli",
      "Stefaan Simon Pierre Hessmann",
      "Klaus-Robert Müller",
      "Shinichi Nakajima",
      "Stefan Gugler",
      "Niklas Wolf Andreas Gebauer"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2404.10946",
    "title": "Information encoding and decoding in in-vitro neural networks on micro  electrode arrays through stimulation timing",
    "abstract": "A primary challenge in utilizing in-vitro biological neural networks for computations is finding good encoding and decoding schemes for inputting and decoding data to and from the networks. Furthermore, identifying the optimal parameter settings for a given combination of encoding and decoding schemes adds additional complexity to this challenge. In this study we explore stimulation timing as an encoding method, i.e. we encode information as the delay between stimulation pulses and identify the bounds and acuity of stimulation timings which produce linearly separable spike responses. We also examine the optimal readout parameters for a linear decoder in the form of epoch length, time bin size and epoch offset. Our results suggest that stimulation timings between 36 and 436ms may be optimal for encoding and that different combinations of readout parameters may be optimal at different parts of the evoked spike response. ",
    "url": "https://arxiv.org/abs/2404.10946",
    "authors": [
      "Trym A. E. Lindell",
      "Ola H. Ramstad",
      "Ionna Sandvig",
      "Axel Sandvig",
      "Stefano Nichele"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.10995",
    "title": "Clipped SGD Algorithms for Privacy Preserving Performative Prediction:  Bias Amplification and Remedies",
    "abstract": "Clipped stochastic gradient descent (SGD) algorithms are among the most popular algorithms for privacy preserving optimization that reduces the leakage of users' identity in model training. This paper studies the convergence properties of these algorithms in a performative prediction setting, where the data distribution may shift due to the deployed prediction model. For example, the latter is caused by strategical users during the training of loan policy for banks. Our contributions are two-fold. First, we show that the straightforward implementation of a projected clipped SGD (PCSGD) algorithm may converge to a biased solution compared to the performative stable solution. We quantify the lower and upper bound for the magnitude of the bias and demonstrate a bias amplification phenomenon where the bias grows with the sensitivity of the data distribution. Second, we suggest two remedies to the bias amplification effect. The first one utilizes an optimal step size design for PCSGD that takes the privacy guarantee into account. The second one uses the recently proposed DiceSGD algorithm [Zhang et al., 2024]. We show that the latter can successfully remove the bias and converge to the performative stable solution. Numerical experiments verify our analysis. ",
    "url": "https://arxiv.org/abs/2404.10995",
    "authors": [
      "Qiang Li",
      "Michal Yemini",
      "Hoi-To Wai"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.11024",
    "title": "Duality induced by an embedding structure of determinantal point process",
    "abstract": "This paper investigates the information geometrical structure of a determinantal point process (DPP). It demonstrates that a DPP is embedded in the exponential family of log-linear models. The extent of deviation from an exponential family is analyzed using the $\\mathrm{e}$-embedding curvature tensor, which identifies partially flat parameters of a DPP. On the basis of this embedding structure, the duality related to a marginal kernel and an $L$-ensemble kernel is discovered. ",
    "url": "https://arxiv.org/abs/2404.11024",
    "authors": [
      "Hideitsu Hino",
      "Keisuke Yano"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Information Theory (cs.IT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2404.11093",
    "title": "Neural Network Approach for Non-Markovian Dissipative Dynamics of  Many-Body Open Quantum Systems",
    "abstract": "Simulating the dynamics of open quantum systems coupled to non-Markovian environments remains an outstanding challenge due to exponentially scaling computational costs. We present an artificial intelligence strategy to overcome this obstacle by integrating the neural quantum states approach into the dissipaton-embedded quantum master equation in second quantization (DQME-SQ). Our approach utilizes restricted Boltzmann machines (RBMs) to compactly represent the reduced density tensor, explicitly encoding the combined effects of system-environment correlations and nonMarkovian memory. Applied to model systems exhibiting prominent effects of system-environment correlation and non-Markovian memory, our approach achieves comparable accuracy to conventional hierarchical equations of motion, while requiring significantly fewer dynamical variables. The novel RBM-based DQME-SQ approach paves the way for investigating non-Markovian open quantum dynamics in previously intractable regimes, with implications spanning various frontiers of modern science. ",
    "url": "https://arxiv.org/abs/2404.11093",
    "authors": [
      "Long Cao",
      "Liwei Ge",
      "Daochi Zhang",
      "Xiang Li",
      "Yao Wang",
      "Rui-Xue Xu",
      "YiJing Yan",
      "Xiao Zheng"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.11152",
    "title": "Multi-target and multi-stage liver lesion segmentation and detection in  multi-phase computed tomography scans",
    "abstract": "Multi-phase computed tomography (CT) scans use contrast agents to highlight different anatomical structures within the body to improve the probability of identifying and detecting anatomical structures of interest and abnormalities such as liver lesions. Yet, detecting these lesions remains a challenging task as these lesions vary significantly in their size, shape, texture, and contrast with respect to surrounding tissue. Therefore, radiologists need to have an extensive experience to be able to identify and detect these lesions. Segmentation-based neural networks can assist radiologists with this task. Current state-of-the-art lesion segmentation networks use the encoder-decoder design paradigm based on the UNet architecture where the multi-phase CT scan volume is fed to the network as a multi-channel input. Although this approach utilizes information from all the phases and outperform single-phase segmentation networks, we demonstrate that their performance is not optimal and can be further improved by incorporating the learning from models trained on each single-phase individually. Our approach comprises three stages. The first stage identifies the regions within the liver where there might be lesions at three different scales (4, 8, and 16 mm). The second stage includes the main segmentation model trained using all the phases as well as a segmentation model trained on each of the phases individually. The third stage uses the multi-phase CT volumes together with the predictions from each of the segmentation models to generate the final segmentation map. Overall, our approach improves relative liver lesion segmentation performance by 1.6% while reducing performance variability across subjects by 8% when compared to the current state-of-the-art models. ",
    "url": "https://arxiv.org/abs/2404.11152",
    "authors": [
      "Abdullah F. Al-Battal",
      "Soan T. M. Duong",
      "Van Ha Tang",
      "Quang Duc Tran",
      "Steven Q. H. Truong",
      "Chien Phan",
      "Truong Q. Nguyen",
      "Cheolhong An"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11277",
    "title": "Quantum-inspired Techniques in Tensor Networks for Industrial Contexts",
    "abstract": "In this paper we present a study of the applicability and feasibility of quantum-inspired algorithms and techniques in tensor networks for industrial environments and contexts, with a compilation of the available literature and an analysis of the use cases that may be affected by such methods. In addition, we explore the limitations of such techniques in order to determine their potential scalability. ",
    "url": "https://arxiv.org/abs/2404.11277",
    "authors": [
      "Alejandro Mata Ali",
      "Iñigo Perez Delgado",
      "Aitor Moreno Fdez. de Leceta"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2404.11330",
    "title": "Toward Understanding the Disagreement Problem in Neural Network Feature  Attribution",
    "abstract": "In recent years, neural networks have demonstrated their remarkable ability to discern intricate patterns and relationships from raw data. However, understanding the inner workings of these black box models remains challenging, yet crucial for high-stake decisions. Among the prominent approaches for explaining these black boxes are feature attribution methods, which assign relevance or contribution scores to each input variable for a model prediction. Despite the plethora of proposed techniques, ranging from gradient-based to backpropagation-based methods, a significant debate persists about which method to use. Various evaluation metrics have been proposed to assess the trustworthiness or robustness of their results. However, current research highlights disagreement among state-of-the-art methods in their explanations. Our work addresses this confusion by investigating the explanations' fundamental and distributional behavior. Additionally, through a comprehensive simulation study, we illustrate the impact of common scaling and encoding techniques on the explanation quality, assess their efficacy across different effect sizes, and demonstrate the origin of inconsistency in rank-based evaluation metrics. ",
    "url": "https://arxiv.org/abs/2404.11330",
    "authors": [
      "Niklas Koenen",
      "Marvin N. Wright"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.11389",
    "title": "Finding $d$-Cuts in Graphs of Bounded Diameter, Graphs of Bounded Radius  and $H$-Free Graphs",
    "abstract": "The $d$-Cut problem is to decide if a graph has an edge cut such that each vertex has at most $d$ neighbours at the opposite side of the cut. If $d=1$, we obtain the intensively studied Matching Cut problem. The $d$-Cut problem has been studied as well, but a systematic study for special graph classes was lacking. We initiate such a study and consider classes of bounded diameter, bounded radius and $H$-free graphs. We prove that for all $d\\geq 2$, $d$-Cut is polynomial-time solvable for graphs of diameter $2$, $(P_3+P_4)$-free graphs and $P_5$-free graphs. These results extend known results for $d=1$. However, we also prove several NP-hardness results for $d$-Cut that contrast known polynomial-time results for $d=1$. Our results lead to full dichotomies for bounded diameter and bounded radius and to almost-complete dichotomies for $H$-free graphs. ",
    "url": "https://arxiv.org/abs/2404.11389",
    "authors": [
      "Felicia Lucke",
      "Ali Momeni",
      "Daniël Paulusma",
      "Siani Smith"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2404.11399",
    "title": "In situ sound absorption estimation with the discrete complex image  source method",
    "abstract": "Estimating the sound absorption in situ relies on accurately describing the measured sound field. Evidence suggests that modeling the reflection of impinging spherical waves is important, especially for compact measurement systems. This article proposes a method for estimating the sound absorption coefficient of a material sample by mapping the sound pressure, measured by a microphone array, to a distribution of monopoles along a line in the complex plane. The proposed method is compared to modeling the sound field as a superposition of two sources (a monopole and an image source). The obtained inverse problems are solved with Tikhonov regularization, with automatic choice of the regularization parameter by the L-curve criterion. The sound absorption measurement is tested with simulations of the sound field above infinite and finite porous absorbers. The approaches are compared to the plane-wave absorption coefficient and the one obtained by spherical wave incidence. Experimental analysis of two porous samples and one resonant absorber is also carried out in situ. Four arrays were tested with an increasing aperture and number of sensors. It was demonstrated that measurements are feasible even with an array with only a few microphones. The discretization of the integral equation led to a more accurate reconstruction of the sound pressure and particle velocity at the sample's surface. The resulting absorption coefficient agrees with the one obtained for spherical wave incidence, indicating that including more monopoles along the complex line is an essential feature of the sound field. ",
    "url": "https://arxiv.org/abs/2404.11399",
    "authors": [
      "Eric Brandao",
      "William Fonseca",
      "Paulo Mareze",
      "Carlos Resende",
      "Gabriel Azzuz",
      "Joao Pontalti",
      "Efren Fernandez-Grande"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)",
      "Classical Physics (physics.class-ph)"
    ]
  },
  {
    "id": "arXiv:2404.11596",
    "title": "Urban highways are barriers to social ties",
    "abstract": "Urban highways are common, especially in the US, making cities more car-centric. They promise the annihilation of distance but obstruct pedestrian mobility, thus playing a key role in limiting social interactions locally. Although this limiting role is widely acknowledged in urban studies, the quantitative relationship between urban highways and social ties is barely tested. Here we define a Barrier Score that relates massive, geolocated online social network data to highways in the 50 largest US cities. At the unprecedented granularity of individual social ties, we show that urban highways are associated with decreased social connectivity. This barrier effect is especially strong for short distances and consistent with historical cases of highways that were built to purposefully disrupt or isolate Black neighborhoods. By combining spatial infrastructure with social tie data, our method adds a new dimension to demographic studies of social segregation. Our study can inform reparative planning for an evidence-based reduction of spatial inequality, and more generally, support a better integration of the social fabric in urban planning. ",
    "url": "https://arxiv.org/abs/2404.11596",
    "authors": [
      "Luca Maria Aiello",
      "Anastassia Vybornova",
      "Sándor Juhász",
      "Michael Szell",
      "Eszter Bokányi"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:1905.08772",
    "title": "A Text Classification Framework for Simple and Effective Early  Depression Detection Over Social Media Streams",
    "abstract": " Comments: Highlights: (*) A novel text classifier having the ability to visually explain its rationale; (*) Domain-independent classification that does not require feature engineering; (*) Support for incremental learning and text classification over streams; (*) Efficient framework for addressing early risk detection problems; (*) State-of-the-art performance on early depression detection task ",
    "url": "https://arxiv.org/abs/1905.08772",
    "authors": [
      "Sergio G. Burdisso",
      "Marcelo Errecalde",
      "Manuel Montes-y-Gómez"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2110.14553",
    "title": "GenURL: A General Framework for Unsupervised Representation Learning",
    "abstract": " Comments: TNNLS 2024 version with 13 pages and 14 figures ",
    "url": "https://arxiv.org/abs/2110.14553",
    "authors": [
      "Siyuan Li",
      "Zicheng Liu",
      "Zelin Zang",
      "Di Wu",
      "Zhiyuan Chen",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.13354",
    "title": "Graph Set-colorings And Hypergraphs In Topological Coding",
    "abstract": " Title: Graph Set-colorings And Hypergraphs In Topological Coding ",
    "url": "https://arxiv.org/abs/2201.13354",
    "authors": [
      "Bing Yao",
      "Fei Ma"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2205.05100",
    "title": "Bounds on Path Energy of Graphs",
    "abstract": " Title: Bounds on Path Energy of Graphs ",
    "url": "https://arxiv.org/abs/2205.05100",
    "authors": [
      "Amol P. Narke",
      "Prashant P. Malavadkar",
      "Maruti M. Shikare"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2206.03735",
    "title": "Motiflets -- Simple and Accurate Detection of Motifs in Time Series",
    "abstract": " Title: Motiflets -- Simple and Accurate Detection of Motifs in Time Series ",
    "url": "https://arxiv.org/abs/2206.03735",
    "authors": [
      "Patrick Schäfer",
      "Ulf Leser"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2206.10177",
    "title": "TCJA-SNN: Temporal-Channel Joint Attention for Spiking Neural Networks",
    "abstract": " Comments: Accepted by IEEE Transactions on Neural Networks and Learning Systems ",
    "url": "https://arxiv.org/abs/2206.10177",
    "authors": [
      "Rui-Jie Zhu",
      "Malu Zhang",
      "Qihang Zhao",
      "Haoyu Deng",
      "Yule Duan",
      "Liang-Jian Deng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.10971",
    "title": "Kinematics Modeling Network for Video-based Human Pose Estimation",
    "abstract": " Title: Kinematics Modeling Network for Video-based Human Pose Estimation ",
    "url": "https://arxiv.org/abs/2207.10971",
    "authors": [
      "Yonghao Dang",
      "Jianqin Yin",
      "Shaojie Zhang",
      "Jiping Liu",
      "Yanzhu Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.11050",
    "title": "Tunable Hybrid Proposal Networks for the Open World",
    "abstract": " Comments: Published in WACV 2024. 22 pages, 9 figures, 12 tables ",
    "url": "https://arxiv.org/abs/2208.11050",
    "authors": [
      "Matthew Inkawhich",
      "Nathan Inkawhich",
      "Hai Li",
      "Yiran Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.04589",
    "title": "Causal Intervention for Fairness in Multi-behavior Recommendation",
    "abstract": " Comments: This paper is accepted by IEEE Transactions on Computational Social Systems ",
    "url": "https://arxiv.org/abs/2209.04589",
    "authors": [
      "Xi Wang",
      "Wenjie Wang",
      "Fuli Feng",
      "Wenge Rong",
      "Chuantao Yin",
      "Zhang Xiong"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.13072",
    "title": "A note on graphs with purely imaginary per-spectrum",
    "abstract": " Title: A note on graphs with purely imaginary per-spectrum ",
    "url": "https://arxiv.org/abs/2211.13072",
    "authors": [
      "Ranveer Singh",
      "Hitesh Wankhede"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2212.10017",
    "title": "Unveiling Code Pre-Trained Models: Investigating Syntax and Semantics  Capacities",
    "abstract": " Title: Unveiling Code Pre-Trained Models: Investigating Syntax and Semantics  Capacities ",
    "url": "https://arxiv.org/abs/2212.10017",
    "authors": [
      "Wei Ma",
      "Shangqing Liu",
      "Mengjie Zhao",
      "Xiaofei Xie",
      "Wenhan Wang",
      "Qiang Hu",
      "Jie Zhang",
      "Yang Liu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.12054",
    "title": "Influencer Backdoor Attack on Semantic Segmentation",
    "abstract": " Title: Influencer Backdoor Attack on Semantic Segmentation ",
    "url": "https://arxiv.org/abs/2303.12054",
    "authors": [
      "Haoheng Lan",
      "Jindong Gu",
      "Philip Torr",
      "Hengshuang Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01996",
    "title": "ANTN: Bridging Autoregressive Neural Networks and Tensor Networks for  Quantum Many-Body Simulation",
    "abstract": " Title: ANTN: Bridging Autoregressive Neural Networks and Tensor Networks for  Quantum Many-Body Simulation ",
    "url": "https://arxiv.org/abs/2304.01996",
    "authors": [
      "Zhuo Chen",
      "Laker Newhouse",
      "Eddie Chen",
      "Di Luo",
      "Marin Soljačić"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Strongly Correlated Electrons (cond-mat.str-el)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2304.03145",
    "title": "Evaluating the Robustness of Machine Reading Comprehension Models to Low  Resource Entity Renaming",
    "abstract": " Comments: Accepted at The AfricaNLP Workshop 2023 colocated with ICLR 2023 ",
    "url": "https://arxiv.org/abs/2304.03145",
    "authors": [
      "Clemencia Siro",
      "Tunde Oluwaseyi Ajayi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.09846",
    "title": "CPL-NoViD: Context-Aware Prompt-based Learning for Norm Violation  Detection in Online Communities",
    "abstract": " Title: CPL-NoViD: Context-Aware Prompt-based Learning for Norm Violation  Detection in Online Communities ",
    "url": "https://arxiv.org/abs/2305.09846",
    "authors": [
      "Zihao He",
      "Jonathan May",
      "Kristina Lerman"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.16351",
    "title": "Federated Learning Model Aggregation in Heterogenous Aerial and Space  Networks",
    "abstract": " Comments: 6 pages, 7 figures, accepted by IEEE ICC workshop on emerging technologies in aerial and space networks 2024 ",
    "url": "https://arxiv.org/abs/2305.16351",
    "authors": [
      "Fan Dong",
      "Ali Abbasi",
      "Henry Leung",
      "Xin Wang",
      "Jiayu Zhou",
      "Steve Drew"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2306.01187",
    "title": "Training neural operators to preserve invariant measures of chaotic  attractors",
    "abstract": " Comments: Accepted at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2306.01187",
    "authors": [
      "Ruoxi Jiang",
      "Peter Y. Lu",
      "Elena Orlova",
      "Rebecca Willett"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2306.03492",
    "title": "Efficient Anomaly Detection with Budget Annotation Using Semi-Supervised  Residual Transformer",
    "abstract": " Comments: 20 pages,6 figures ",
    "url": "https://arxiv.org/abs/2306.03492",
    "authors": [
      "Hanxi Li",
      "Jingqi Wu",
      "Hao Chen",
      "Mingwen Wang",
      "Chunhua Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.10060",
    "title": "MUBen: Benchmarking the Uncertainty of Molecular Representation Models",
    "abstract": " Comments: 58 pages, 10 figures, 39 tables, in TMLR ",
    "url": "https://arxiv.org/abs/2306.10060",
    "authors": [
      "Yinghao Li",
      "Lingkai Kong",
      "Yuanqi Du",
      "Yue Yu",
      "Yuchen Zhuang",
      "Wenhao Mu",
      "Chao Zhang"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.13938",
    "title": "Improving Semi-Supervised Semantic Segmentation with Dual-Level Siamese  Structure Network",
    "abstract": " Comments: ACM MM 2023 ",
    "url": "https://arxiv.org/abs/2307.13938",
    "authors": [
      "Zhibo Tain",
      "Xiaolin Zhang",
      "Peng Zhang",
      "Kun Zhan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.14649",
    "title": "Composition in Differential Privacy for General Granularity Notions  (Long Version)",
    "abstract": " Comments: This is the long version of the paper accepted at the 37th IEEE Computer Security Foundations Symposium (2024) ",
    "url": "https://arxiv.org/abs/2308.14649",
    "authors": [
      "Patricia Guerra-Balboa",
      "Àlex Miranda-Pascual",
      "Javier Parra-Arnau",
      "Thorsten Strufe"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2308.16429",
    "title": "Solving Poisson Problems in Polygonal Domains with Singularity Enriched  Physics Informed Neural Networks",
    "abstract": " Comments: 32 pages, to appear at SIAM Journal on Scientific Computing ",
    "url": "https://arxiv.org/abs/2308.16429",
    "authors": [
      "Tianhao Hu",
      "Bangti Jin",
      "Zhi Zhou"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2309.11651",
    "title": "Drift Control of High-Dimensional RBM: A Computational Method Based on  Neural Networks",
    "abstract": " Title: Drift Control of High-Dimensional RBM: A Computational Method Based on  Neural Networks ",
    "url": "https://arxiv.org/abs/2309.11651",
    "authors": [
      "Baris Ata",
      "J. Michael Harrison",
      "Nian Si"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Analysis of PDEs (math.AP)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2310.07793",
    "title": "GenTKG: Generative Forecasting on Temporal Knowledge Graph with Large  Language Models",
    "abstract": " Comments: 14 pages, Findings of NAACL 2024, Spotlight on TGL@NeurIPS2023 ",
    "url": "https://arxiv.org/abs/2310.07793",
    "authors": [
      "Ruotong Liao",
      "Xu Jia",
      "Yangzhe Li",
      "Yunpu Ma",
      "Volker Tresp"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.09276",
    "title": "Transformer-based Multimodal Change Detection with Multitask Consistency  Constraints",
    "abstract": " Title: Transformer-based Multimodal Change Detection with Multitask Consistency  Constraints ",
    "url": "https://arxiv.org/abs/2310.09276",
    "authors": [
      "Biyuan Liu",
      "Huaixin Chen",
      "Kun Li",
      "Michael Ying Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.20621",
    "title": "Deepfake detection by exploiting surface anomalies: the SurFake approach",
    "abstract": " Title: Deepfake detection by exploiting surface anomalies: the SurFake approach ",
    "url": "https://arxiv.org/abs/2310.20621",
    "authors": [
      "Andrea Ciamarra",
      "Roberto Caldelli",
      "Federico Becattini",
      "Lorenzo Seidenari",
      "Alberto Del Bimbo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.09835",
    "title": "ML-Bench: Evaluating Large Language Models for Code Generation in  Repository-Level Machine Learning Tasks",
    "abstract": " Title: ML-Bench: Evaluating Large Language Models for Code Generation in  Repository-Level Machine Learning Tasks ",
    "url": "https://arxiv.org/abs/2311.09835",
    "authors": [
      "Yuliang Liu",
      "Xiangru Tang",
      "Zefan Cai",
      "Junjie Lu",
      "Yichi Zhang",
      "Yanjun Shao",
      "Zexuan Deng",
      "Helan Hu",
      "Kaikai An",
      "Ruijun Huang",
      "Shuzheng Si",
      "Sheng Chen",
      "Haozhe Zhao",
      "Liang Chen",
      "Yan Wang",
      "Tianyu Liu",
      "Zhiwei Jiang",
      "Baobao Chang",
      "Yujia Qin",
      "Wangchunshu Zhou",
      "Yilun Zhao",
      "Arman Cohan",
      "Mark Gerstein"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.12275",
    "title": "Enabling On-Device Large Language Model Personalization with  Self-Supervised Data Selection and Synthesis",
    "abstract": " Comments: Accepted by 2024 61th ACM/IEEE Design Automation Conference (DAC) ",
    "url": "https://arxiv.org/abs/2311.12275",
    "authors": [
      "Ruiyang Qin",
      "Jun Xia",
      "Zhenge Jia",
      "Meng Jiang",
      "Ahmed Abbasi",
      "Peipei Zhou",
      "Jingtong Hu",
      "Yiyu Shi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.17121",
    "title": "ScribbleGen: Generative Data Augmentation Improves Scribble-supervised  Semantic Segmentation",
    "abstract": " Title: ScribbleGen: Generative Data Augmentation Improves Scribble-supervised  Semantic Segmentation ",
    "url": "https://arxiv.org/abs/2311.17121",
    "authors": [
      "Jacob Schnell",
      "Jieke Wang",
      "Lu Qi",
      "Vincent Tao Hu",
      "Meng Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.01201",
    "title": "PAC Privacy Preserving Diffusion Models",
    "abstract": " Title: PAC Privacy Preserving Diffusion Models ",
    "url": "https://arxiv.org/abs/2312.01201",
    "authors": [
      "Qipan Xu",
      "Youlong Ding",
      "Xinxi Zhang",
      "Jie Gao",
      "Hao Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.04865",
    "title": "StructComp: Substituting propagation with Structural Compression in  Training Graph Contrastive Learning",
    "abstract": " Comments: Accepted by ICLR 2024 ",
    "url": "https://arxiv.org/abs/2312.04865",
    "authors": [
      "Shengzhong Zhang",
      "Wenjie Yang",
      "Xinyuan Cao",
      "Hongwei Zhang",
      "Zengfeng Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.16168",
    "title": "Social-Transmotion: Promptable Human Trajectory Prediction",
    "abstract": " Comments: ICLR 2024 ",
    "url": "https://arxiv.org/abs/2312.16168",
    "authors": [
      "Saeed Saadatnejad",
      "Yang Gao",
      "Kaouther Messaoud",
      "Alexandre Alahi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.03907",
    "title": "RoboFusion: Towards Robust Multi-Modal 3D Object Detection via SAM",
    "abstract": " Title: RoboFusion: Towards Robust Multi-Modal 3D Object Detection via SAM ",
    "url": "https://arxiv.org/abs/2401.03907",
    "authors": [
      "Ziying Song",
      "Guoxing Zhang",
      "Lin Liu",
      "Lei Yang",
      "Shaoqing Xu",
      "Caiyan Jia",
      "Feiyang Jia",
      "Li Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.01203",
    "title": "Neural Language of Thought Models",
    "abstract": " Comments: Accepted in ICLR 2024 ",
    "url": "https://arxiv.org/abs/2402.01203",
    "authors": [
      "Yi-Fu Wu",
      "Minseung Lee",
      "Sungjin Ahn"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.01805",
    "title": "Can LLMs perform structured graph reasoning?",
    "abstract": " Title: Can LLMs perform structured graph reasoning? ",
    "url": "https://arxiv.org/abs/2402.01805",
    "authors": [
      "Palaash Agrawal",
      "Shavak Vasania",
      "Cheston Tan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.02286",
    "title": "Multi-Level Feature Aggregation and Recursive Alignment Network for  Real-Time Semantic Segmentation",
    "abstract": " Comments: 15 pages, 9 figures and 12 Tables. Manuscript completed on April 30, 2022 ",
    "url": "https://arxiv.org/abs/2402.02286",
    "authors": [
      "Yanhua Zhang",
      "Ke Zhang",
      "Jingyu Wang",
      "Yulin Wu",
      "Wuwei Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.03557",
    "title": "Robust Analysis of Multi-Task Learning Efficiency: New Benchmarks on  Light-Weighed Backbones and Effective Measurement of Multi-Task Learning  Challenges by Feature Disentanglement",
    "abstract": " Title: Robust Analysis of Multi-Task Learning Efficiency: New Benchmarks on  Light-Weighed Backbones and Effective Measurement of Multi-Task Learning  Challenges by Feature Disentanglement ",
    "url": "https://arxiv.org/abs/2402.03557",
    "authors": [
      "Dayou Mao",
      "Yuhao Chen",
      "Yifan Wu",
      "Maximilian Gilles",
      "Alexander Wong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.09108",
    "title": "Web 3.0 and Quantum Security: Long-Distance Free-Space QSDC for Global  Web 3.0 Networks",
    "abstract": " Comments: 16 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2402.09108",
    "authors": [
      "Yew Kee Wong",
      "Yifan Zhou",
      "Xinlin Zhou",
      "Yan Shing Liang",
      "Zi Yan Li"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.12716",
    "title": "Off-Path TCP Hijacking in Wi-Fi Networks: A Packet-Size Side Channel  Attack",
    "abstract": " Title: Off-Path TCP Hijacking in Wi-Fi Networks: A Packet-Size Side Channel  Attack ",
    "url": "https://arxiv.org/abs/2402.12716",
    "authors": [
      "Ziqiang Wang",
      "Xuewei Feng",
      "Qi Li",
      "Kun Sun",
      "Yuxiang Yang",
      "Mengyuan Li",
      "Ganqiu Du",
      "Ke Xu",
      "Jianping Wu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.13756",
    "title": "High-throughput Visual Nano-drone to Nano-drone Relative Localization  using Onboard Fully Convolutional Networks",
    "abstract": " Comments: ICRA 2024, IEEE Conference ",
    "url": "https://arxiv.org/abs/2402.13756",
    "authors": [
      "Luca Crupi",
      "Alessandro Giusti",
      "Daniele Palossi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2402.15903",
    "title": "ESFL: Efficient Split Federated Learning over Resource-Constrained  Heterogeneous Wireless Devices",
    "abstract": " Title: ESFL: Efficient Split Federated Learning over Resource-Constrained  Heterogeneous Wireless Devices ",
    "url": "https://arxiv.org/abs/2402.15903",
    "authors": [
      "Guangyu Zhu",
      "Yiqin Deng",
      "Xianhao Chen",
      "Haixia Zhang",
      "Yuguang Fang",
      "Tan F. Wong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2402.17092",
    "title": "An Innovative Information Theory-based Approach to Tackle and Enhance  The Transparency in Phishing Detection",
    "abstract": " Title: An Innovative Information Theory-based Approach to Tackle and Enhance  The Transparency in Phishing Detection ",
    "url": "https://arxiv.org/abs/2402.17092",
    "authors": [
      "Van Nguyen",
      "Tingmin Wu",
      "Xingliang Yuan",
      "Marthie Grobler",
      "Surya Nepal",
      "Carsten Rudolph"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.17187",
    "title": "PE-MVCNet: Multi-view and Cross-modal Fusion Network for Pulmonary  Embolism Prediction",
    "abstract": " Title: PE-MVCNet: Multi-view and Cross-modal Fusion Network for Pulmonary  Embolism Prediction ",
    "url": "https://arxiv.org/abs/2402.17187",
    "authors": [
      "Zhaoxin Guo",
      "Zhipeng Wang",
      "Ruiquan Ge",
      "Jianxun Yu",
      "Feiwei Qin",
      "Yuan Tian",
      "Yuqing Peng",
      "Yonghong Li",
      "Changmiao Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.18771",
    "title": "NARUTO: Neural Active Reconstruction from Uncertain Target Observations",
    "abstract": " Comments: Accepted to CVPR2024. Project page: this https URL Code: this https URL ",
    "url": "https://arxiv.org/abs/2402.18771",
    "authors": [
      "Ziyue Feng",
      "Huangying Zhan",
      "Zheng Chen",
      "Qingan Yan",
      "Xiangyu Xu",
      "Changjiang Cai",
      "Bing Li",
      "Qilun Zhu",
      "Yi Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.00303",
    "title": "ODM: A Text-Image Further Alignment Pre-training Approach for Scene Text  Detection and Spotting",
    "abstract": " Comments: Accepted by CVPR2024 ",
    "url": "https://arxiv.org/abs/2403.00303",
    "authors": [
      "Chen Duan",
      "Pei Fu",
      "Shan Guo",
      "Qianyi Jiang",
      "Xiaoming Wei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.09080",
    "title": "Ciphertext-Only Attack on a Secure $k$-NN Computation on Cloud",
    "abstract": " Title: Ciphertext-Only Attack on a Secure $k$-NN Computation on Cloud ",
    "url": "https://arxiv.org/abs/2403.09080",
    "authors": [
      "Shyam Murthy",
      "Santosh Kumar Upadhyaya",
      "Srinivas Vivek"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.11456",
    "title": "HateCOT: An Explanation-Enhanced Dataset for Generalizable Offensive  Speech Detection via Large Language Models",
    "abstract": " Comments: Preprint ",
    "url": "https://arxiv.org/abs/2403.11456",
    "authors": [
      "Huy Nghiem",
      "Hal Daumé III"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.17142",
    "title": "Approximation with Random Shallow ReLU Networks with Applications to  Model Reference Adaptive Control",
    "abstract": " Comments: Under Review for Conference on Decision and Control ",
    "url": "https://arxiv.org/abs/2403.17142",
    "authors": [
      "Andrew Lamperski",
      "Tyler Lekang"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.20156",
    "title": "CAESAR: Enhancing Federated RL in Heterogeneous MDPs through  Convergence-Aware Sampling with Screening",
    "abstract": " Title: CAESAR: Enhancing Federated RL in Heterogeneous MDPs through  Convergence-Aware Sampling with Screening ",
    "url": "https://arxiv.org/abs/2403.20156",
    "authors": [
      "Hei Yi Mak",
      "Flint Xiaofeng Fan",
      "Luca A. Lanzendörfer",
      "Cheston Tan",
      "Wei Tsang Ooi",
      "Roger Wattenhofer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.02155",
    "title": "Alpha Invariance: On Inverse Scaling Between Distance and Volume Density  in Neural Radiance Fields",
    "abstract": " Comments: CVPR 2024. project page this https URL ",
    "url": "https://arxiv.org/abs/2404.02155",
    "authors": [
      "Joshua Ahn",
      "Haochen Wang",
      "Raymond A. Yeh",
      "Greg Shakhnarovich"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.02562",
    "title": "Representation Alignment Contrastive Regularization for Multi-Object  Tracking",
    "abstract": " Title: Representation Alignment Contrastive Regularization for Multi-Object  Tracking ",
    "url": "https://arxiv.org/abs/2404.02562",
    "authors": [
      "Zhonglin Liu",
      "Shujie Chen",
      "Jianfeng Dong",
      "Xun Wang",
      "Di Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.03048",
    "title": "Decentralised Moderation for Interoperable Social Networks: A  Conversation-based Approach for Pleroma and the Fediverse",
    "abstract": " Comments: Accepted at International AAAI Conference on Web and Social Media (ICWSM) 2024. Please cite accordingly! ",
    "url": "https://arxiv.org/abs/2404.03048",
    "authors": [
      "Vibhor Agarwal",
      "Aravindh Raman",
      "Nishanth Sastry",
      "Ahmed M. Abdelmoniem",
      "Gareth Tyson",
      "Ignacio Castro"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.03696",
    "title": "Convolutional variational autoencoders for secure lossy image  compression in remote sensing",
    "abstract": " Comments: Accepted at SPIE Defense + Commercial Sensing: {Paper No.13062-18,Tracking No. DCS24-DCS314-13} ",
    "url": "https://arxiv.org/abs/2404.03696",
    "authors": [
      "Alessandro Giuliano",
      "S. Andrew Gadsden",
      "Waleed Hilal",
      "John Yawney"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.04587",
    "title": "Neuroevolving Electronic Dynamical Networks",
    "abstract": " Comments: 8 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2404.04587",
    "authors": [
      "Derek Whitley"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2404.05085",
    "title": "Fork is All You Need in Heterogeneous Systems",
    "abstract": " Comments: Presented at the 3rd Workshop on Heterogeneous Composable and Disaggregated Systems (HCDS 2024) ",
    "url": "https://arxiv.org/abs/2404.05085",
    "authors": [
      "Zixuan Wang",
      "Jishen Zhao"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2404.07175",
    "title": "Temperature Prediction for Stored Grain: A Multi-model Fusion Approach  Based on Machine Learning",
    "abstract": " Title: Temperature Prediction for Stored Grain: A Multi-model Fusion Approach  Based on Machine Learning ",
    "url": "https://arxiv.org/abs/2404.07175",
    "authors": [
      "Donghao Chen",
      "Binkun Liu"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2404.07219",
    "title": "Leave No One Behind: Online Self-Supervised Self-Distillation for  Sequential Recommendation",
    "abstract": " Title: Leave No One Behind: Online Self-Supervised Self-Distillation for  Sequential Recommendation ",
    "url": "https://arxiv.org/abs/2404.07219",
    "authors": [
      "Shaowei Wei",
      "Zhengwei Wu",
      "Xin Li",
      "Qintong Wu",
      "Zhiqiang Zhang",
      "Jun Zhou",
      "Lihong Gu",
      "Jinjie Gu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.07773",
    "title": "ConsistencyDet: A Robust Object Detector with a Denoising Paradigm of  Consistency Model",
    "abstract": " Title: ConsistencyDet: A Robust Object Detector with a Denoising Paradigm of  Consistency Model ",
    "url": "https://arxiv.org/abs/2404.07773",
    "authors": [
      "Lifan Jiang",
      "Zhihui Wang",
      "Changmiao Wang",
      "Ming Li",
      "Jiaxu Leng",
      "Xindong Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.07942",
    "title": "On Unified Prompt Tuning for Request Quality Assurance in Public Code  Review",
    "abstract": " Comments: The 29th International Conference on Database Systems for Advanced Applications (DASFAA) ",
    "url": "https://arxiv.org/abs/2404.07942",
    "authors": [
      "Xinyu Chen",
      "Lin Li",
      "Rui Zhang",
      "Peng Liang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.08161",
    "title": "R2 Indicator and Deep Reinforcement Learning Enhanced Adaptive  Multi-Objective Evolutionary Algorithm",
    "abstract": " Title: R2 Indicator and Deep Reinforcement Learning Enhanced Adaptive  Multi-Objective Evolutionary Algorithm ",
    "url": "https://arxiv.org/abs/2404.08161",
    "authors": [
      "Farajollah Tahernezhad-Javazm",
      "Debbie Rankin",
      "Naomi Du Bois",
      "Alice E. Smith",
      "Damien Coyle"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.08483",
    "title": "Semantic Communication for Cooperative Multi-Task Processing over  Wireless Networks",
    "abstract": " Comments: This work has been submitted to the IEEE Wireless Communications Letters ",
    "url": "https://arxiv.org/abs/2404.08483",
    "authors": [
      "Ahmad Halimi Razlighi",
      "Carsten Bockelmann",
      "Armin Dekorsy"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.09471",
    "title": "LightningSimV2: Faster and Scalable Simulation for High-Level Synthesis  via Graph Compilation and Optimization",
    "abstract": " Comments: 11 pages, 6 figures. Accepted at FCCM 2024 ",
    "url": "https://arxiv.org/abs/2404.09471",
    "authors": [
      "Rishov Sarkar",
      "Rachel Paul",
      "Cong Hao"
    ],
    "subjectives": [
      "Performance (cs.PF)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2404.09831",
    "title": "Digging into contrastive learning for robust depth estimation with  diffusion models",
    "abstract": " Comments: 8 pages,6 figures ",
    "url": "https://arxiv.org/abs/2404.09831",
    "authors": [
      "Jiyuan Wang",
      "Chunyu Lin",
      "Lang Nie",
      "Kang Liao",
      "Shuwei Shao",
      "Yao Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.10096",
    "title": "Vision Augmentation Prediction Autoencoder with Attention Design  (VAPAAD)",
    "abstract": " Comments: 12 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2404.10096",
    "authors": [
      "Yiqiao Yin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.10295",
    "title": "ControlMTR: Control-Guided Motion Transformer with Scene-Compliant  Intention Points for Feasible Motion Prediction",
    "abstract": " Title: ControlMTR: Control-Guided Motion Transformer with Scene-Compliant  Intention Points for Feasible Motion Prediction ",
    "url": "https://arxiv.org/abs/2404.10295",
    "authors": [
      "Jiawei Sun",
      "Chengran Yuan",
      "Shuo Sun",
      "Shanze Wang",
      "Yuhang Han",
      "Shuailei Ma",
      "Zefan Huang",
      "Anthony Wong",
      "Keng Peng Tee",
      "Marcelo H. Ang Jr"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2404.10357",
    "title": "Optimization of Prompt Learning via Multi-Knowledge Representation for  Vision-Language Models",
    "abstract": " Title: Optimization of Prompt Learning via Multi-Knowledge Representation for  Vision-Language Models ",
    "url": "https://arxiv.org/abs/2404.10357",
    "authors": [
      "Enming Zhang",
      "Bingke Zhu",
      "Yingying Chen",
      "Qinghai Miao",
      "Ming Tang",
      "Jinqiao Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.10588",
    "title": "Do Counterfactual Examples Complicate Adversarial Training?",
    "abstract": " Comments: Accepted as a short paper to the GCV Workshop at CVPR'24 ",
    "url": "https://arxiv.org/abs/2404.10588",
    "authors": [
      "Eric Yeats",
      "Cameron Darwin",
      "Eduardo Ortega",
      "Frank Liu",
      "Hai Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]