[
  {
    "id": "arXiv:2109.13235",
    "title": "Probabilistic modeling of lake surface water temperature using a  Bayesian spatio-temporal graph convolutional neural network",
    "abstract": "Accurate lake temperature estimation is essential for numerous problems tackled in both hydrological and ecological domains. Nowadays physical models are developed to estimate lake dynamics; however, computations needed for accurate estimation of lake surface temperature can get prohibitively expensive. We propose to aggregate simulations of lake temperature at a certain depth together with a range of meteorological features to probabilistically estimate lake surface temperature. Accordingly, we introduce a spatio-temporal neural network that combines Bayesian recurrent neural networks and Bayesian graph convolutional neural networks. This work demonstrates that the proposed graphical model can deliver homogeneously good performance covering the whole lake surface despite having sparse training data available. Quantitative results are compared with a state-of-the-art Bayesian deep learning method. Code for the developed architectural layers, as well as demo scripts, are available on https://renkulab.io/projects/das/bstnn. ",
    "url": "https://arxiv.org/abs/2109.13235",
    "authors": [
      "Michael Stalder",
      "Firat Ozdemir",
      "Artur Safin",
      "Jonas Sukys",
      "Damien Bouffard",
      "Fernando Perez-Cruz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.13312",
    "title": "LSTM-based approach to detect cyber attacks on market-based congestion  management methods",
    "abstract": "Market-based congestion management methods adopt Demand Side Management (DSM) techniques to alleviate congestion in the day-ahead market. Reliance of these methods on the communication layer makes it prone to cyber attacks affecting the security, reliability, and economic operation of the distribution network. In this paper, we focus on Load Altering Attacks that would compromise the operation of market-based congestion management methods. A detection technique is proposed using Long Short-term Memory (LSTM) Recurrent Neural Networks (RNN). IEEE 33 bus system is used as a case study to demonstrate the effectiveness of the proposed technique. An accuracy of 97% was obtained proving the capability of using LSTM-RNN to detect a load altering cyber attack compromising aggregators in the network. ",
    "url": "https://arxiv.org/abs/2109.13312",
    "authors": [
      "Omniyah Gul M Khan",
      "Amr Youssef",
      "Ehab El-Saadany",
      "Magdy Salama"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2109.13536",
    "title": "A hierarchical residual network with compact triplet-center loss for  sketch recognition",
    "abstract": "With the widespread use of touch-screen devices, it is more and more convenient for people to draw sketches on screen. This results in the demand for automatically understanding the sketches. Thus, the sketch recognition task becomes more significant than before. To accomplish this task, it is necessary to solve the critical issue of improving the distinction of the sketch features. To this end, we have made efforts in three aspects. First, a novel multi-scale residual block is designed. Compared with the conventional basic residual block, it can better perceive multi-scale information and reduce the number of parameters during training. Second, a hierarchical residual structure is built by stacking multi-scale residual blocks in a specific way. In contrast with the single-level residual structure, the learned features from this structure are more sufficient. Last but not least, the compact triplet-center loss is proposed specifically for the sketch recognition task. It can solve the problem that the triplet-center loss does not fully consider too large intra-class space and too small inter-class space in sketch field. By studying the above modules, a hierarchical residual network as a whole is proposed for sketch recognition and evaluated on Tu-Berlin benchmark thoroughly. The experimental results show that the proposed network outperforms most of baseline methods and it is excellent among non-sequential models at present. ",
    "url": "https://arxiv.org/abs/2109.13536",
    "authors": [
      "Lei Wang",
      "Shihui Zhang",
      "Huan He",
      "Xiaoxiao Zhang",
      "Yu Sang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.13627",
    "title": "Generalising the achromatic number to Zaslavsky's colourings of signed  graphs",
    "abstract": "The chromatic number, which refers to the minimum number of colours required to colour the vertices of graphs properly, is one of the most central notions of the graph chromatic theory. Several of its aspects of interest have been investigated in the literature, including variants for modifications of proper colourings. These variants include, notably, the achromatic number of graphs, which is the maximum number of colours required to colour the vertices of graphs properly so that each possible combination of distinct colours is assigned along some edge. The behaviours of this parameter have led to many investigations of interest, bringing to light both similarities and discrepancies with the chromatic number. This work takes place in a recent trend aiming at extending the chromatic theory of graphs to the realm of signed graphs, and, in particular, at investigating how classic results adapt to the signed context. Most of the works done in that line to date are with respect to two main generalisations of proper colourings of signed graphs, attributed to Zaslavsky and Guenin. Generalising the achromatic number to signed graphs was initiated recently by Lajou, his investigations being related to Guenin's colourings. We here pursue this line of research, but with taking Zaslavsky's colourings as our notion of proper colourings. We study the general behaviour of our resulting variant of the achromatic number, mainly by investigating how known results on the classic achromatic number generalise to our context. Our results cover, notably, bounds, standard operations on graphs, and complexity aspects. ",
    "url": "https://arxiv.org/abs/2109.13627",
    "authors": [
      "Julien Bensmail",
      "François Dross",
      "Nacim Oijid",
      "Éric Sopena"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2109.13685",
    "title": "Machine learning methods for prediction of cancer driver genes: a survey  paper",
    "abstract": "Identifying the genes and mutations that drive the emergence of tumors is a major step to improve understanding of cancer and identify new directions for disease diagnosis and treatment. Despite the large volume of genomics data, the precise detection of driver mutations and their carrying genes, known as cancer driver genes, from the millions of possible somatic mutations remains a challenge. Computational methods play an increasingly important role in identifying genomic patterns associated with cancer drivers and developing models to predict driver events. Machine learning (ML) has been the engine behind many of these efforts and provides excellent opportunities for tackling remaining gaps in the field. Thus, this survey aims to perform a comprehensive analysis of ML-based computational approaches to identify cancer driver mutations and genes, providing an integrated, panoramic view of the broad data and algorithmic landscape within this scientific problem. We discuss how the interactions among data types and ML algorithms have been explored in previous solutions and outline current analytical limitations that deserve further attention from the scientific community. We hope that by helping readers become more familiar with significant developments in the field brought by ML, we may inspire new researchers to address open problems and advance our knowledge towards cancer driver discovery. ",
    "url": "https://arxiv.org/abs/2109.13685",
    "authors": [
      "Renan Andrades",
      "Mariana Recamonde-Mendoza"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Genomics (q-bio.GN)"
    ]
  },
  {
    "id": "arXiv:2109.13834",
    "title": "Touchtone leakage attacks via smartphone sensors: mitigation without  hardware modification",
    "abstract": "Smartphone motion sensors provide a concealed mechanism for eavesdropping on acoustic information, like touchtones, emitted by a device. Eavesdropping on touchtones exposes credit card information, banking pins, and social security card numbers to malicious 3rd party apps requiring only motion sensor data. This paper's primary contribution is an analysis rooted in physics and signal processing theory of several eavesdropping mitigations, which could be implemented in a smartphone update. We verify our analysis imperially to show how previously suggested mitigations, i.e. a low-pass filter, can undesirably reduce the motion sensor data to all applications by 83% but only reduce an advanced adversary's accuracy by less than one percent. Other designs, i.e. anti-aliasing filters, can fully preserve the motion sensor data to support benign application functionality while reducing attack accuracy by 50.1%. We intend for this analysis to motivate the need for deployable mitigations against acoustic leakage on smartphone motion sensors, including but not limited to touchtones, while also providing a basis for future mitigations to improve upon. ",
    "url": "https://arxiv.org/abs/2109.13834",
    "authors": [
      "Connor Bolton",
      "Yan Long",
      "Jun Han",
      "Josiah Hester",
      "Kevin Fu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2109.13885",
    "title": "Turning old models fashion again: Recycling classical CNN networks using  the Lattice Transformation",
    "abstract": "In the early 1990s, the first signs of life of the CNN era were given: LeCun et al. proposed a CNN model trained by the backpropagation algorithm to classify low-resolution images of handwritten digits. Undoubtedly, it was a breakthrough in the field of computer vision. But with the rise of other classification methods, it fell out fashion. That was until 2012, when Krizhevsky et al. revived the interest in CNNs by exhibiting considerably higher image classification accuracy on the ImageNet challenge. Since then, the complexity of the architectures are exponentially increasing and many structures are rapidly becoming obsolete. Using multistream networks as a base and the feature infusion precept, we explore the proposed LCNN cross-fusion strategy to use the backbones of former state-of-the-art networks on image classification in order to discover if the technique is able to put these designs back in the game. In this paper, we showed that we can obtain an increase of accuracy up to 63.21% on the NORB dataset we comparing with the original structure. However, no technique is definitive. While our goal is to try to reuse previous state-of-the-art architectures with few modifications, we also expose the disadvantages of our explored strategy. ",
    "url": "https://arxiv.org/abs/2109.13885",
    "authors": [
      "Ana Paula G. S. de Almeida",
      "Flavio de Barros Vidal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.13913",
    "title": "$f$-Cal: Calibrated aleatoric uncertainty estimation from neural  networks for robot perception",
    "abstract": "While modern deep neural networks are performant perception modules, performance (accuracy) alone is insufficient, particularly for safety-critical robotic applications such as self-driving vehicles. Robot autonomy stacks also require these otherwise blackbox models to produce reliable and calibrated measures of confidence on their predictions. Existing approaches estimate uncertainty from these neural network perception stacks by modifying network architectures, inference procedure, or loss functions. However, in general, these methods lack calibration, meaning that the predictive uncertainties do not faithfully represent the true underlying uncertainties (process noise). Our key insight is that calibration is only achieved by imposing constraints across multiple examples, such as those in a mini-batch; as opposed to existing approaches which only impose constraints per-sample, often leading to overconfident (thus miscalibrated) uncertainty estimates. By enforcing the distribution of outputs of a neural network to resemble a target distribution by minimizing an $f$-divergence, we obtain significantly better-calibrated models compared to prior approaches. Our approach, $f$-Cal, outperforms existing uncertainty calibration approaches on robot perception tasks such as object detection and monocular depth estimation over multiple real-world benchmarks. ",
    "url": "https://arxiv.org/abs/2109.13913",
    "authors": [
      "Dhaivat Bhatt",
      "Kaustubh Mani",
      "Dishank Bansal",
      "Krishna Murthy",
      "Hanju Lee",
      "Liam Paull"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2109.13247",
    "title": "The edge of chaos: quantum field theory and deep neural networks",
    "abstract": "We explicitly construct the quantum field theory corresponding to a general class of deep neural networks encompassing both recurrent and feedforward architectures. We first consider the mean-field theory (MFT) obtained as the leading saddlepoint in the action, and derive the condition for criticality via the largest Lyapunov exponent. We then compute the loop corrections to the correlation function in a perturbative expansion in the ratio of depth $T$ to width $N$, and find a precise analogy with the well-studied $O(N)$ vector model, in which the variance of the weight initializations plays the role of the 't Hooft coupling. In particular, we compute both the $\\mathcal{O}(1)$ corrections quantifying fluctuations from typicality in the ensemble of networks, and the subleading $\\mathcal{O}(T/N)$ corrections due to finite-width effects. These provide corrections to the correlation length that controls the depth to which information can propagate through the network, and thereby sets the scale at which such networks are trainable by gradient descent. Our analysis provides a first-principles approach to the rapidly emerging NN-QFT correspondence, and opens several interesting avenues to the study of criticality in deep neural networks. ",
    "url": "https://arxiv.org/abs/2109.13247",
    "authors": [
      "Kevin T. Grosvenor",
      "Ro Jefferson"
    ],
    "subjectives": [
      "High Energy Physics - Theory (hep-th)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2109.13376",
    "title": "Counting colorings of triangle-free graphs",
    "abstract": "By a theorem of Johansson, every triangle-free graph $G$ of maximum degree $\\Delta$ has chromatic number at most $(C+o(1))\\Delta/\\log \\Delta$ for some universal constant $C > 0$. Using the entropy compression method, Molloy proved that one can in fact take $C = 1$. Here we show that for every $q \\geq (1 + o(1))\\Delta/\\log \\Delta$, the number $c(G,q)$ of proper $q$-colorings of $G$ satisfies $c(G, q) \\,\\geq\\, \\left(1 - \\frac{1}{q}\\right)^m ((1-o(1))q)^n$, where $n = |V(G)|$ and $m = |E(G)|$. Except for the $o(1)$ term, this lower bound is best possible as witnessed by random $\\Delta$-regular graphs. When $q = (1 + o(1)) \\Delta/\\log \\Delta$, our result yields the inequality $c(G,q) \\,\\geq\\, \\exp\\left((1 - o(1)) \\frac{\\log \\Delta}{2} n\\right)$, which implies the optimal lower bound on the number of independent sets in $G$ due to Davies, Jenssen, Perkins, and Roberts. An important ingredient in our proof is the counting method that was recently developed by Rosenfeld. As a byproduct, we obtain an alternative proof of Molloy's bound $\\chi(G) \\leq (1 + o(1))\\Delta/\\log \\Delta$ using Rosenfeld's method in place of entropy compression. ",
    "url": "https://arxiv.org/abs/2109.13376",
    "authors": [
      "Anton Bernshteyn",
      "Tyler Brazelton",
      "Ruijia Cao",
      "Akum Kang"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2109.13672",
    "title": "Improved prediction rule ensembling through model-based data generation",
    "abstract": "Prediction rule ensembles (PRE) provide interpretable prediction models with relatively high accuracy.PRE obtain a large set of decision rules from a (boosted) decision tree ensemble, and achieves sparsitythrough application of Lasso-penalized regression. This article examines the use of surrogate modelsto improve performance of PRE, wherein the Lasso regression is trained with the help of a massivedataset generated by the (boosted) decision tree ensemble. This use of model-based data generationmay improve the stability and consistency of the Lasso step, thus leading to improved overallperformance. We propose two surrogacy approaches, and evaluate them on simulated and existingdatasets, in terms of sparsity and predictive accuracy. The results indicate that the use of surrogacymodels can substantially improve the sparsity of PRE, while retaining predictive accuracy, especiallythrough the use of a nested surrogacy approach. ",
    "url": "https://arxiv.org/abs/2109.13672",
    "authors": [
      "Benny Markovitch",
      "Marjolein Fokkema"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.13797",
    "title": "Photonic spiking neural networks and CMOS-compatible graphene-on-silicon  spiking neurons",
    "abstract": "Spiking neural networks are known to be superior over artificial neural networks for their computational power efficiency and noise robustness. The benefits of spiking coupled with the high-bandwidth and low-latency of photonics can enable highly-efficient, noise-robust, high-speed neural processors. The landscape of photonic spiking neurons consists of an overwhelming majority of excitable lasers and a few demonstrations on nonlinear optical cavities. The silicon platform is best poised to host a scalable photonic technology given its CMOS-compatibility and low optical loss. Here, we present a survey of existing photonic spiking neurons, and propose a novel spiking neuron based on a hybrid graphene-on-silicon microring cavity. A comparison among a representative sample of photonic spiking devices is also presented. Finally, we discuss methods employed in training spiking neural networks, their challenges as well as the application domain that can be enabled by photonic spiking neural hardware. ",
    "url": "https://arxiv.org/abs/2109.13797",
    "authors": [
      "Aashu Jha",
      "Chaoran Huang",
      "Hsuan-Tung Peng",
      "Bhavin Shastri",
      "Paul R. Prucnal"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2103.06168",
    "title": "Towards clinically applicable automated aneurysm detection in TOF-MRA:  weak labels, anatomical knowledge, and open data",
    "abstract": " Comments: Paper under review for the journal \"Radiology: Artificial Intelligence\" ",
    "url": "https://arxiv.org/abs/2103.06168",
    "authors": [
      "Tommaso Di Noto",
      "Guillaume Marie",
      "Sebastien Tourbier",
      "Yasser Alemán-Gómez",
      "Oscar Esteban",
      "Guillaume Saliou",
      "Meritxell Bach Cuadra",
      "Patric Hagmann",
      "Jonas Richiardi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.00394",
    "title": "Deep graph matching meets mixed-integer linear programming: Relax at  your own risk ?",
    "abstract": " Comments: The paper is under consideration at Pattern Recognition ",
    "url": "https://arxiv.org/abs/2108.00394",
    "authors": [
      "Zhoubo Xu",
      "Puqing Chen",
      "Romain Raveaux",
      "Xin Yang",
      "Huadong Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2108.13844",
    "title": "Fiducial marker recovery and detection from severely truncated data in  navigation assisted spine surgery",
    "abstract": " Title: Fiducial marker recovery and detection from severely truncated data in  navigation assisted spine surgery ",
    "url": "https://arxiv.org/abs/2108.13844",
    "authors": [
      "Fuxin Fan",
      "Björn Kreher",
      "Holger Keil",
      "Andreas Maier",
      "Yixing Huang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.08527",
    "title": "An open GPS trajectory dataset and benchmark for travel mode detection",
    "abstract": " Title: An open GPS trajectory dataset and benchmark for travel mode detection ",
    "url": "https://arxiv.org/abs/2109.08527",
    "authors": [
      "Jinyu Chen",
      "Haoran Zhang",
      "Xuan Song",
      "Ryosuke Shibasaki"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2109.12692",
    "title": "Equilibria and learning dynamics in mixed network  coordination/anti-coordination games",
    "abstract": " Title: Equilibria and learning dynamics in mixed network  coordination/anti-coordination games ",
    "url": "https://arxiv.org/abs/2109.12692",
    "authors": [
      "Laura Arditti",
      "Giacomo Como",
      "Fabio Fagnani",
      "Martina Vanelli"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)",
      "Social and Information Networks (cs.SI)",
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2109.12985",
    "title": "Synerise at RecSys 2021: Twitter user engagement prediction with a fast  neural model",
    "abstract": " Title: Synerise at RecSys 2021: Twitter user engagement prediction with a fast  neural model ",
    "url": "https://arxiv.org/abs/2109.12985",
    "authors": [
      "Michał Daniluk",
      "Jacek Dąbrowski",
      "Barbara Rychalska",
      "Konrad Gołuchowski"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  }
]