[
  {
    "id": "arXiv:2208.05476",
    "title": "Sequence Feature Extraction for Malware Family Analysis via Graph Neural  Network",
    "abstract": "Malicious software (malware) causes much harm to our devices and life. We are eager to understand the malware behavior and the threat it made. Most of the record files of malware are variable length and text-based files with time stamps, such as event log data and dynamic analysis profiles. Using the time stamps, we can sort such data into sequence-based data for the following analysis. However, dealing with the text-based sequences with variable lengths is difficult. In addition, unlike natural language text data, most sequential data in information security have specific properties and structure, such as loop, repeated call, noise, etc. To deeply analyze the API call sequences with their structure, we use graphs to represent the sequences, which can further investigate the information and structure, such as the Markov model. Therefore, we design and implement an Attention Aware Graph Neural Network (AWGCN) to analyze the API call sequences. Through AWGCN, we can obtain the sequence embeddings to analyze the behavior of the malware. Moreover, the classification experiment result shows that AWGCN outperforms other classifiers in the call-like datasets, and the embedding can further improve the classic model's performance. ",
    "url": "https://arxiv.org/abs/2208.05476",
    "authors": [
      "S. W. Hsiao",
      "P. Y. Chu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.05477",
    "title": "Customized Watermarking for Deep Neural Networks via Label Distribution  Perturbation",
    "abstract": "With the increasing application value of machine learning, the intellectual property (IP) rights of deep neural networks (DNN) are getting more and more attention. With our analysis, most of the existing DNN watermarking methods can resist fine-tuning and pruning attack, but distillation attack. To address these problem, we propose a new DNN watermarking framework, Unified Soft-label Perturbation (USP), having a detector paired with the model to be watermarked, and Customized Soft-label Perturbation (CSP), embedding watermark via adding perturbation into the model output probability distribution. Experimental results show that our methods can resist all watermark removal attacks and outperform in distillation attack. Besides, we also have an excellent trade-off between the main task and watermarking that achieving 98.68% watermark accuracy while only affecting the main task accuracy by 0.59%. ",
    "url": "https://arxiv.org/abs/2208.05477",
    "authors": [
      "Tzu-Yun Chien",
      "Chih-Ya Shen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.05514",
    "title": "Are Gradients on Graph Structure Reliable in Gray-box Attacks?",
    "abstract": "Graph edge perturbations are dedicated to damaging the prediction of graph neural networks by modifying the graph structure. Previous gray-box attackers employ gradients from the surrogate model to locate the vulnerable edges to perturb the graph structure. However, unreliability exists in gradients on graph structures, which is rarely studied by previous works. In this paper, we discuss and analyze the errors caused by the unreliability of the structural gradients. These errors arise from rough gradient usage due to the discreteness of the graph structure and from the unreliability in the meta-gradient on the graph structure. In order to address these problems, we propose a novel attack model with methods to reduce the errors inside the structural gradients. We propose edge discrete sampling to select the edge perturbations associated with hierarchical candidate selection to ensure computational efficiency. In addition, semantic invariance and momentum gradient ensemble are proposed to address the gradient fluctuation on semantic-augmented graphs and the instability of the surrogate model. Experiments are conducted in untargeted gray-box poisoning scenarios and demonstrate the improvement in the performance of our approach. ",
    "url": "https://arxiv.org/abs/2208.05514",
    "authors": [
      "Zihan Liu",
      "Yun Luo",
      "Lirong Wu",
      "Siyuan Li",
      "Zicheng Liu",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.05516",
    "title": "Quality Not Quantity: On the Interaction between Dataset Design and  Robustness of CLIP",
    "abstract": "Web-crawled datasets have enabled remarkable generalization capabilities in recent image-text models such as CLIP (Contrastive Language-Image pre-training) or Flamingo, but little is known about the dataset creation processes. In this work, we introduce a testbed of six publicly available data sources - YFCC, LAION, Conceptual Captions, WIT, RedCaps, Shutterstock - to investigate how pre-training distributions induce robustness in CLIP. We find that the performance of the pre-training data varies substantially across distribution shifts, with no single data source dominating. Moreover, we systematically study the interactions between these data sources and find that combining multiple sources does not necessarily yield better models, but rather dilutes the robustness of the best individual data source. We complement our empirical findings with theoretical insights from a simple setting, where combining the training data also results in diluted robustness. In addition, our theoretical model provides a candidate explanation for the success of the CLIP-based data filtering technique recently employed in the LAION dataset. Overall our results demonstrate that simply gathering a large amount of data from the web is not the most effective way to build a pre-training dataset for robust generalization, necessitating further study into dataset design. ",
    "url": "https://arxiv.org/abs/2208.05516",
    "authors": [
      "Thao Nguyen",
      "Gabriel Ilharco",
      "Mitchell Wortsman",
      "Sewoong Oh",
      "Ludwig Schmidt"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05540",
    "title": "Augmented Driver Behavior Models for High-Fidelity Simulation Study of  Crash Detection Algorithms",
    "abstract": "Developing safety and efficiency applications for Connected and Automated Vehicles (CAVs) require a great deal of testing and evaluation. The need for the operation of these systems in critical and dangerous situations makes the burden of their evaluation very costly, possibly dangerous, and time-consuming. As an alternative, researchers attempt to study and evaluate their algorithms and designs using simulation platforms. Modeling the behavior of drivers or human operators in CAVs or other vehicles interacting with them is one of the main challenges of such simulations. While developing a perfect model for human behavior is a challenging task and an open problem, we present a significant augmentation of the current models used in simulators for driver behavior. In this paper, we present a simulation platform for a hybrid transportation system that includes both human-driven and automated vehicles. In addition, we decompose the human driving task and offer a modular approach to simulating a large-scale traffic scenario, allowing for a thorough investigation of automated and active safety systems. Such representation through Interconnected modules offers a human-interpretable system that can be tuned to represent different classes of drivers. Additionally, we analyze a large driving dataset to extract expressive parameters that would best describe different driving characteristics. Finally, we recreate a similarly dense traffic scenario within our simulator and conduct a thorough analysis of various human-specific and system-specific factors, studying their effect on traffic network performance and safety. ",
    "url": "https://arxiv.org/abs/2208.05540",
    "authors": [
      "Ahura Jami",
      "Mahdi Razzaghpour",
      "Hussein Alnuweiri",
      "Yaser P. Fallah"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2208.05561",
    "title": "SSDBCODI: Semi-Supervised Density-Based Clustering with Outliers  Detection Integrated",
    "abstract": "Clustering analysis is one of the critical tasks in machine learning. Traditionally, clustering has been an independent task, separate from outlier detection. Due to the fact that the performance of clustering can be significantly eroded by outliers, a small number of algorithms try to incorporate outlier detection in the process of clustering. However, most of those algorithms are based on unsupervised partition-based algorithms such as k-means. Given the nature of those algorithms, they often fail to deal with clusters of complex, non-convex shapes. To tackle this challenge, we have proposed SSDBCODI, a semi-supervised density-based algorithm. SSDBCODI combines the advantage of density-based algorithms, which are capable of dealing with clusters of complex shapes, with the semi-supervised element, which offers flexibility to adjust the clustering results based on a few user labels. We also merge an outlier detection component with the clustering process. Potential outliers are detected based on three scores generated during the process: (1) reachability-score, which measures how density-reachable a point is to a labeled normal object, (2) local-density-score, which measures the neighboring density of data objects, and (3) similarity-score, which measures the closeness of a point to its nearest labeled outliers. Then in the following step, instance weights are generated for each data instance based on those three scores before being used to train a classifier for further clustering and outlier detection. To enhance the understanding of the proposed algorithm, for our evaluation, we have run our proposed algorithm against some of the state-of-art approaches on multiple datasets and separately listed the results of outlier detection apart from clustering. Our results indicate that our algorithm can achieve superior results with a small percentage of labels. ",
    "url": "https://arxiv.org/abs/2208.05561",
    "authors": [
      "Jiahao Deng",
      "Eli T. Brown"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.05565",
    "title": "Stable Homology-Based Cycle Centrality Measures for Weighted Graphs",
    "abstract": "Network centrality measures are concerned with evaluating the importance of nodes, paths, or cycles based on directed or reciprocal interactions inherent within graph structures encoded by vertices and edges. To accommodate higher-order connections between nodes, Estrada and Ross extended graph-based centrality measures to simplicial complexes by expanding node centrality to simplices. We follow this extension but digress in the approach in that we propose novel centrality measures by considering algebraically-computable topological signatures of cycles and their homological persistence. We apply tools from algebraic topology to extract multi-scale signatures within cycle spaces of weighted graphs by tracking homology generators that persist across a weight-induced filtration of simplicial complexes built over graphs. We take these persistent signatures, as well as the merge information of homology classes along the filtration to design centrality measures that quantify cycle importance not only via its geometric and topological significance, but also by its homological influence on other cycles. We also show that these measures are stable under small perturbations allowed by an appropriate metric. ",
    "url": "https://arxiv.org/abs/2208.05565",
    "authors": [
      "John Rick D. Manzanares",
      "Paul Samuel P. Ignacio"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2208.05568",
    "title": "The emergence of division of labor through decentralized social  sanctioning",
    "abstract": "Human ecological success relies on our characteristic ability to flexibly self-organize in cooperative social groups. Successful groups employ substantial specialization and division of labor. Unlike most other animals, humans learn by trial and error during their lives what role to take on. However, when some critical roles are more attractive than others, and individuals are self-interested, then there is a social dilemma: each individual would prefer others take on the critical-but-unremunerative roles so they may remain free to take one that pays better. But disaster occurs if all act thusly and a critical role goes unfilled. In such situations learning an optimum role distribution may not be possible. Consequently, a fundamental question is: how can division of labor emerge in groups of self-interested lifetime-learning individuals? Here we show that by introducing a model of social norms, which we regard as patterns of decentralized social sanctioning, it becomes possible for groups of self-interested individuals to learn a productive division of labor involving all critical roles. Such social norms work by redistributing rewards within the population to disincentivize antisocial roles while incentivizing prosocial roles that do not intrinsically pay as well as others. ",
    "url": "https://arxiv.org/abs/2208.05568",
    "authors": [
      "Anil Yaman",
      "Joel Z. Leibo",
      "Giovanni Iacca",
      "Sang Wan Lee"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2208.05573",
    "title": "Data Augmentation for Improving Emotion Recognition in Software  Engineering Communication",
    "abstract": "Emotions (e.g., Joy, Anger) are prevalent in daily software engineering (SE) activities, and are known to be significant indicators of work productivity (e.g., bug fixing efficiency). Recent studies have shown that directly applying general purpose emotion classification tools to SE corpora is not effective. Even within the SE domain, tool performance degrades significantly when trained on one communication channel and evaluated on another (e.g, StackOverflow vs. GitHub comments). Retraining a tool with channel-specific data takes significant effort since manually annotating large datasets of ground truth data is expensive. In this paper, we address this data scarcity problem by automatically creating new training data using a data augmentation technique. Based on an analysis of the types of errors made by popular SE-specific emotion recognition tools, we specifically target our data augmentation strategy in order to improve the performance of emotion recognition. Our results show an average improvement of 9.3% in micro F1-Score for three existing emotion classification tools (ESEM-E, EMTk, SEntiMoji) when trained with our best augmentation strategy. ",
    "url": "https://arxiv.org/abs/2208.05573",
    "authors": [
      "Mia Mohammad Imran",
      "Yashasvi Jain",
      "Preetha Chatterjee",
      "Kostadin Damevski"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2208.05605",
    "title": "Symbolic Music Loop Generation with Neural Discrete Representations",
    "abstract": "Since most of music has repetitive structures from motifs to phrases, repeating musical ideas can be a basic operation for music composition. The basic block that we focus on is conceptualized as loops which are essential ingredients of music. Furthermore, meaningful note patterns can be formed in a finite space, so it is sufficient to represent them with combinations of discrete symbols as done in other domains. In this work, we propose symbolic music loop generation via learning discrete representations. We first extract loops from MIDI datasets using a loop detector and then learn an autoregressive model trained by discrete latent codes of the extracted loops. We show that our model outperforms well-known music generative models in terms of both fidelity and diversity, evaluating on random space. Our code and supplementary materials are available at https://github.com/sjhan91/Loop_VQVAE_Official. ",
    "url": "https://arxiv.org/abs/2208.05605",
    "authors": [
      "Sangjun Han",
      "Hyeongrae Ihm",
      "Moontae Lee",
      "Woohyung Lim"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2208.05606",
    "title": "Multi-fidelity wavelet neural operator with application to uncertainty  quantification",
    "abstract": "Operator learning frameworks, because of their ability to learn nonlinear maps between two infinite dimensional functional spaces and utilization of neural networks in doing so, have recently emerged as one of the more pertinent areas in the field of applied machine learning. Although these frameworks are extremely capable when it comes to modeling complex phenomena, they require an extensive amount of data for successful training which is often not available or is too expensive. However, this issue can be alleviated with the use of multi-fidelity learning, where a model is trained by making use of a large amount of inexpensive low-fidelity data along with a small amount of expensive high-fidelity data. To this end, we develop a new framework based on the wavelet neural operator which is capable of learning from a multi-fidelity dataset. The developed model's excellent learning capabilities are demonstrated by solving different problems which require effective correlation learning between the two fidelities for surrogate construction. Furthermore, we also assess the application of the developed framework for uncertainty quantification. The results obtained from this work illustrate the excellent performance of the proposed framework. ",
    "url": "https://arxiv.org/abs/2208.05606",
    "authors": [
      "Akshay Thakur",
      "Tapas Tripura",
      "Souvik Chakraborty"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2208.05610",
    "title": "Memorizing Complementation Network for Few-Shot Class-Incremental  Learning",
    "abstract": "Few-shot Class-Incremental Learning (FSCIL) aims at learning new concepts continually with only a few samples, which is prone to suffer the catastrophic forgetting and overfitting problems. The inaccessibility of old classes and the scarcity of the novel samples make it formidable to realize the trade-off between retaining old knowledge and learning novel concepts. Inspired by that different models memorize different knowledge when learning novel concepts, we propose a Memorizing Complementation Network (MCNet) to ensemble multiple models that complements the different memorized knowledge with each other in novel tasks. Additionally, to update the model with few novel samples, we develop a Prototype Smoothing Hard-mining Triplet (PSHT) loss to push the novel samples away from not only each other in current task but also the old distribution. Extensive experiments on three benchmark datasets, e.g., CIFAR100, miniImageNet and CUB200, have demonstrated the superiority of our proposed method. ",
    "url": "https://arxiv.org/abs/2208.05610",
    "authors": [
      "Zhong Ji",
      "Zhishen Hou",
      "Xiyao Liu",
      "Yanwei Pang",
      "Xuelong Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.05636",
    "title": "Locality-aware Attention Network with Discriminative Dynamics Learning  for Weakly Supervised Anomaly Detection",
    "abstract": "Video anomaly detection is recently formulated as a multiple instance learning task under weak supervision, in which each video is treated as a bag of snippets to be determined whether contains anomalies. Previous efforts mainly focus on the discrimination of the snippet itself without modeling the temporal dynamics, which refers to the variation of adjacent snippets. Therefore, we propose a Discriminative Dynamics Learning (DDL) method with two objective functions, i.e., dynamics ranking loss and dynamics alignment loss. The former aims to enlarge the score dynamics gap between positive and negative bags while the latter performs temporal alignment of the feature dynamics and score dynamics within the bag. Moreover, a Locality-aware Attention Network (LA-Net) is constructed to capture global correlations and re-calibrate the location preference across snippets, followed by a multilayer perceptron with causal convolution to obtain anomaly scores. Experimental results show that our method achieves significant improvements on two challenging benchmarks, i.e., UCF-Crime and XD-Violence. ",
    "url": "https://arxiv.org/abs/2208.05636",
    "authors": [
      "Yujiang Pu",
      "Xiaoyu Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05641",
    "title": "Towards Automated Key-Point Detection in Images with Partial Pool View",
    "abstract": "Sports analytics has been an up-and-coming field of research among professional sporting organizations and academic institutions alike. With the insurgence and collection of athlete data, the primary goal of such analysis is to improve athletes' performance in a measurable and quantifiable manner. This work is aimed at alleviating some of the challenges encountered in the collection of adequate swimming data. Past works on this subject have shown that the detection and tracking of swimmers is feasible, but not without challenges. Among these challenges are pool localization and determining the relative positions of the swimmers relative to the pool. This work presents two contributions towards solving these challenges. First, we present a pool model with invariant key-points relevant for swimming analytics. Second, we study the detectability of such key-points in images with partial pool view, which are challenging but also quite common in swimming race videos. ",
    "url": "https://arxiv.org/abs/2208.05641",
    "authors": [
      "T. J. Woinoski",
      "I. V. Bajic"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05645",
    "title": "Solving MathWord Problems Automatically with Heterogeneous Line Graph  Transformer for Online Learning",
    "abstract": "This paper describes the design and implementation of a new machine learning model for online learning systems.We aim at improving the intelligent level of the systems by enabling an automated math word problem solver which can support a wide range of functions such as homework correction, difficulty estimation, and priority recommendation. We originally planned to employ existing models but realized that they processed a math word problem as a sequence or a homogeneous graph of tokens. Relationships between the multiple types of tokens such as entity, unit, rate, and number were ignored.We decided to design and implement a novel model to use such relational data to bridge the information gap between human-readable language and machine-understandable logical form. We propose a heterogeneous line graph transformer (HLGT) model that constructs a heterogeneous line graph via semantic role labeling on math word problems and then perform node representation learning aware of edge types. We add numerical comparison as an auxiliary task to improve model training for real-world use. Experimental results show that the proposed model achieves a better performance than existing models and suggest that it is still far below human performance. Information utilization and knowledge discovery is continuously needed to improve the online learning systems. ",
    "url": "https://arxiv.org/abs/2208.05645",
    "authors": [
      "Zijian Hu",
      "Meng Jiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.05647",
    "title": "PPMN: Pixel-Phrase Matching Network for One-Stage Panoptic Narrative  Grounding",
    "abstract": "Panoptic Narrative Grounding (PNG) is an emerging task whose goal is to segment visual objects of things and stuff categories described by dense narrative captions of a still image. The previous two-stage approach first extracts segmentation region proposals by an off-the-shelf panoptic segmentation model, then conducts coarse region-phrase matching to ground the candidate regions for each noun phrase. However, the two-stage pipeline usually suffers from the performance limitation of low-quality proposals in the first stage and the loss of spatial details caused by region feature pooling, as well as complicated strategies designed for things and stuff categories separately. To alleviate these drawbacks, we propose a one-stage end-to-end Pixel-Phrase Matching Network (PPMN), which directly matches each phrase to its corresponding pixels instead of region proposals and outputs panoptic segmentation by simple combination. Thus, our model can exploit sufficient and finer cross-modal semantic correspondence from the supervision of densely annotated pixel-phrase pairs rather than sparse region-phrase pairs. In addition, we also propose a Language-Compatible Pixel Aggregation (LCPA) module to further enhance the discriminative ability of phrase features through multi-round refinement, which selects the most compatible pixels for each phrase to adaptively aggregate the corresponding visual context. Extensive experiments show that our method achieves new state-of-the-art performance on the PNG benchmark with 4.0 absolute Average Recall gains. ",
    "url": "https://arxiv.org/abs/2208.05647",
    "authors": [
      "Zihan Ding",
      "Zi-han Ding",
      "Tianrui Hui",
      "Junshi Huang",
      "Xiaoming Wei",
      "Xiaolin Wei",
      "Si Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2208.05648",
    "title": "Embedding Compression with Hashing for Efficient Representation Learning  in Large-Scale Graph",
    "abstract": "Graph neural networks (GNNs) are deep learning models designed specifically for graph data, and they typically rely on node features as the input to the first layer. When applying such a type of network on the graph without node features, one can extract simple graph-based node features (e.g., number of degrees) or learn the input node representations (i.e., embeddings) when training the network. While the latter approach, which trains node embeddings, more likely leads to better performance, the number of parameters associated with the embeddings grows linearly with the number of nodes. It is therefore impractical to train the input node embeddings together with GNNs within graphics processing unit (GPU) memory in an end-to-end fashion when dealing with industrial-scale graph data. Inspired by the embedding compression methods developed for natural language processing (NLP) tasks, we develop a node embedding compression method where each node is compactly represented with a bit vector instead of a floating-point vector. The parameters utilized in the compression method can be trained together with GNNs. We show that the proposed node embedding compression method achieves superior performance compared to the alternatives. ",
    "url": "https://arxiv.org/abs/2208.05648",
    "authors": [
      "Chin-Chia Michael Yeh",
      "Mengting Gu",
      "Yan Zheng",
      "Huiyuan Chen",
      "Javid Ebrahimi",
      "Zhongfang Zhuang",
      "Junpeng Wang",
      "Liang Wang",
      "Wei Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2208.05650",
    "title": "Diverse Generative Adversarial Perturbations on Attention Space for  Transferable Adversarial Attacks",
    "abstract": "Adversarial attacks with improved transferability - the ability of an adversarial example crafted on a known model to also fool unknown models - have recently received much attention due to their practicality. Nevertheless, existing transferable attacks craft perturbations in a deterministic manner and often fail to fully explore the loss surface, thus falling into a poor local optimum and suffering from low transferability. To solve this problem, we propose Attentive-Diversity Attack (ADA), which disrupts diverse salient features in a stochastic manner to improve transferability. Primarily, we perturb the image attention to disrupt universal features shared by different models. Then, to effectively avoid poor local optima, we disrupt these features in a stochastic manner and explore the search space of transferable perturbations more exhaustively. More specifically, we use a generator to produce adversarial perturbations that each disturbs features in different ways depending on an input latent code. Extensive experimental evaluations demonstrate the effectiveness of our method, outperforming the transferability of state-of-the-art methods. Codes are available at https://github.com/wkim97/ADA. ",
    "url": "https://arxiv.org/abs/2208.05650",
    "authors": [
      "Woo Jae Kim",
      "Seunghoon Hong",
      "Sung-Eui Yoon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05675",
    "title": "Correlating Effectiveness of Pointer Analysis Techniques with Patterns  in Embedded System Code",
    "abstract": "A pointer analysis maps the pointers in a program to the memory locations they point to. In this work, we study the effectiveness of the three flavors of pointer analysis namely flow sensitive, flow insensitive, and context sensitive analysis on seven embedded code sets used in the industry. We compare precision gain i.e., the reduction in the number of spurious memory locations pointed by a pointer in each of these settings. We found that in 90% of cases the pointer information was same in all three settings. In other cases, context sensitive analysis was 2.6% more precise than flow sensitive analysis which was 6.8% more precise than flow insensitive analysis on average. We correlate precision gain with coding patterns in the embedded systems-which we believe to be first of its kind activity. ",
    "url": "https://arxiv.org/abs/2208.05675",
    "authors": [
      "Komal Pathade"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2208.05680",
    "title": "A Trust-Based Malicious RSU Detection Mechanism in Edge-Enabled  Vehicular Ad Hoc Networks",
    "abstract": "Edge-enabled Vehicular Ad Hoc Network (VANET) introduces real-time services and storage, computation, and communication facilities to the vehicles through Roadside Units (RSUs). Nevertheless, RSUs are often easy targets for security assaults due to their placement in an open, unprotected environment and resource-constrained nature. The malicious RSUs compromised by security attacks impose threats to human safety by impeding the operations of VANETs. Hence, an effective malevolent RSU detection mechanism is crucial for VANETs. Existing trust-based detection mechanisms assign trust scores to RSUs based on their interactions with moving vehicles where precise detection of rogue RSUs depends on the accuracy of trust scores. However, brief interaction of RSUs with the running vehicles permits inadequate time to estimate trust accurately. Besides, current works use only vehicle speed and density in beacon messages to assess trust without considering the sensor-detected data in the same messages. Nonetheless, sensor data is useful for traffic management, and neglecting them creates inaccuracy in trust estimation. In this paper, we address these limitations and propose a trust-based scheme to detect malicious RSUs that uses stable and frequent RSU-to-RSU (R2R) interaction to precisely analyze the behavior of an RSU. We also offer a mechanism to detect alteration of sensor-detected data in beacon content and incorporate this scheme in the trust calculation of RSUs. The experimental results show that the proposed solution effectively detects approximately 92% malicious RSUs, even in the presence of hostile vehicles. Moreover, integrating the proposed solution with the VANET routing protocols improves routing efficiency. ",
    "url": "https://arxiv.org/abs/2208.05680",
    "authors": [
      "Farhana Siddiqua",
      "Mosarrat Jahan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.05708",
    "title": "Robust Coordinated Longitudinal Control of MAV Based on Energy State",
    "abstract": "Fixed-wing Miniature Air Vehicle (MAV) is not only coupled with longitudinal motion, but also more susceptible to wind disturbance due to its lighter weight, which brings more challenges to its altitude and airspeed controller design. Therefore, in this paper, an improved longitudinal control strategy based on energy state, is proposed to address the above-mentioned issues. The control strategy utilizes the Linear Extended State Observer (LESO) to observe the energy states and the disturbance of the MAV, and then designs a Multiple-Input Multiple-Output (MIMO) controller based on a more coordinated Total Energy Control (TEC) strategy to control the airspeed and altitude of the MAV. The performance of this control strategy has been successfully verified in a Model-in-the-Loop (MIL) simulation with Simulink, and a comparative test with the classical TEC algorithm is carried out. ",
    "url": "https://arxiv.org/abs/2208.05708",
    "authors": [
      "Chenlong Zhang",
      "Dawei Li",
      "Haodong Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.05716",
    "title": "Task Aligned Meta-learning based Augmented Graph for Cold-Start  Recommendation",
    "abstract": "The cold-start problem is a long-standing challenge in recommender systems due to the lack of user-item interactions, which significantly hurts the recommendation effect over new users and items. Recently, meta-learning based methods attempt to learn globally shared prior knowledge across all users, which can be rapidly adapted to new users and items with very few interactions. Though with significant performance improvement, the globally shared parameter may lead to local optimum. Besides, they are oblivious to the inherent information and feature interactions existing in the new users and items, which are critical in cold-start scenarios. In this paper, we propose a Task aligned Meta-learning based Augmented Graph (TMAG) to address cold-start recommendation. Specifically, a fine-grained task aligned constructor is proposed to cluster similar users and divide tasks for meta-learning, enabling consistent optimization direction. Besides, an augmented graph neural network with two graph enhanced approaches is designed to alleviate data sparsity and capture the high-order user-item interactions. We validate our approach on three real-world datasets in various cold-start scenarios, showing the superiority of TMAG over state-of-the-art methods for cold-start recommendation. ",
    "url": "https://arxiv.org/abs/2208.05716",
    "authors": [
      "Yuxiang Shi",
      "Yue Ding",
      "Bo Chen",
      "Yuyang Huang",
      "Ruiming Tang",
      "Dong Wang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2208.05728",
    "title": "Continual Transfer Learning for Cross-Domain Click-Through Rate  Prediction at Taobao",
    "abstract": "As one of the largest e-commerce platforms in the world, Taobao's recommendation systems (RSs) serve the demands of shopping for hundreds of millions of customers. Click-Through Rate (CTR) prediction is a core component of the RS. One of the biggest characteristics in CTR prediction at Taobao is that there exist multiple recommendation domains where the scales of different domains vary significantly. Therefore, it is crucial to perform cross-domain CTR prediction to transfer knowledge from large domains to small domains to alleviate the data sparsity issue. However, existing cross-domain CTR prediction methods are proposed for static knowledge transfer, ignoring that all domains in real-world RSs are continually time-evolving. In light of this, we present a necessary but novel task named Continual Transfer Learning (CTL), which transfers knowledge from a time-evolving source domain to a time-evolving target domain. In this work, we propose a simple and effective CTL model called CTNet to solve the problem of continual cross-domain CTR prediction at Taobao, and CTNet can be trained efficiently. Particularly, CTNet considers an important characteristic in the industry that models has been continually well-trained for a very long time. So CTNet aims to fully utilize all the well-trained model parameters in both source domain and target domain to avoid losing historically acquired knowledge, and only needs incremental target domain data for training to guarantee efficiency. Extensive offline experiments and online A/B testing at Taobao demonstrate the efficiency and effectiveness of CTNet. CTNet is now deployed online in the recommender systems of Taobao, serving the main traffic of hundreds of millions of active users. ",
    "url": "https://arxiv.org/abs/2208.05728",
    "authors": [
      "Lixin Liu",
      "Yanling Wang",
      "Tianming Wang",
      "Dong Guan",
      "Jiawei Wu",
      "Jingxu Chen",
      "Rong Xiao",
      "Wenxiang Zhu",
      "Fei Fang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2208.05736",
    "title": "Learning Point Processes using Recurrent Graph Network",
    "abstract": "We present a novel Recurrent Graph Network (RGN) approach for predicting discrete marked event sequences by learning the underlying complex stochastic process. Using the framework of Point Processes, we interpret a marked discrete event sequence as the superposition of different sequences each of a unique type. The nodes of the Graph Network use LSTM to incorporate past information whereas a Graph Attention Network (GAT Network) introduces strong inductive biases to capture the interaction between these different types of events. By changing the self-attention mechanism from attending over past events to attending over event types, we obtain a reduction in time and space complexity from $\\mathcal{O}(N^2)$ (total number of events) to $\\mathcal{O}(|\\mathcal{Y}|^2)$ (number of event types). Experiments show that the proposed approach improves performance in log-likelihood, prediction and goodness-of-fit tasks with lower time and space complexity compared to state-of-the art Transformer based architectures. ",
    "url": "https://arxiv.org/abs/2208.05736",
    "authors": [
      "Saurabh Dash",
      "Xueyuan She",
      "Saibal Mukhopadhyay"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.05740",
    "title": "General Cutting Planes for Bound-Propagation-Based Neural Network  Verification",
    "abstract": "Bound propagation methods, when combined with branch and bound, are among the most effective methods to formally verify properties of deep neural networks such as correctness, robustness, and safety. However, existing works cannot handle the general form of cutting plane constraints widely accepted in traditional solvers, which are crucial for strengthening verifiers with tightened convex relaxations. In this paper, we generalize the bound propagation procedure to allow the addition of arbitrary cutting plane constraints, including those involving relaxed integer variables that do not appear in existing bound propagation formulations. Our generalized bound propagation method, GCP-CROWN, opens up the opportunity to apply general cutting plane methods} for neural network verification while benefiting from the efficiency and GPU acceleration of bound propagation methods. As a case study, we investigate the use of cutting planes generated by off-the-shelf mixed integer programming (MIP) solver. We find that MIP solvers can generate high-quality cutting planes for strengthening bound-propagation-based verifiers using our new formulation. Since the branching-focused bound propagation procedure and the cutting-plane-focused MIP solver can run in parallel utilizing different types of hardware (GPUs and CPUs), their combination can quickly explore a large number of branches with strong cutting planes, leading to strong verification performance. Experiments demonstrate that our method is the first verifier that can completely solve the oval20 benchmark and verify twice as many instances on the oval21 benchmark compared to the best tool in VNN-COMP 2021, and also noticeably outperforms state-of-the-art verifiers on a wide range of benchmarks. GCP-CROWN is part of the $\\alpha$,$\\beta$-CROWN verifier, the VNN-COMP 2022 winner. Code is available at this http URL ",
    "url": "https://arxiv.org/abs/2208.05740",
    "authors": [
      "Huan Zhang",
      "Shiqi Wang",
      "Kaidi Xu",
      "Linyi Li",
      "Bo Li",
      "Suman Jana",
      "Cho-Jui Hsieh",
      "J. Zico Kolter"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.05744",
    "title": "On the Pros and Cons of Momentum Encoder in Self-Supervised Visual  Representation Learning",
    "abstract": "Exponential Moving Average (EMA or momentum) is widely used in modern self-supervised learning (SSL) approaches, such as MoCo, for enhancing performance. We demonstrate that such momentum can also be plugged into momentum-free SSL frameworks, such as SimCLR, for a performance boost. Despite its wide use as a fundamental component in modern SSL frameworks, the benefit caused by momentum is not well understood. We find that its success can be at least partly attributed to the stability effect. In the first attempt, we analyze how EMA affects each part of the encoder and reveal that the portion near the encoder's input plays an insignificant role while the latter parts have much more influence. By monitoring the gradient of the overall loss with respect to the output of each block in the encoder, we observe that the final layers tend to fluctuate much more than other layers during backpropagation, i.e. less stability. Interestingly, we show that using EMA to the final part of the SSL encoder, i.e. projector, instead of the whole deep network encoder can give comparable or preferable performance. Our proposed projector-only momentum helps maintain the benefit of EMA but avoids the double forward computation. ",
    "url": "https://arxiv.org/abs/2208.05744",
    "authors": [
      "Trung Pham",
      "Chaoning Zhang",
      "Axi Niu",
      "Kang Zhang",
      "Chang D. Yoo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05748",
    "title": "Twisted by the Pools: Detection of Selfish Anomalies in Proof-of-Work  Mining",
    "abstract": "The core of many cryptocurrencies is the decentralised validation network operating on proof-of-work technology. In these systems, validation is done by so-called miners who can digitally sign blocks once they solve a computationally-hard problem. Conventional wisdom generally considers this protocol as secure and stable as miners are incentivised to follow the behaviour of the majority. However, whether some strategic mining behaviours occur in practice is still a major concern. In this paper we target this question by focusing on a security threat: a selfish mining attack in which malicious miners deviate from protocol by not immediately revealing their newly mined blocks. We propose a statistical test to analyse each miner's behaviour in five popular cryptocurrencies: Bitcoin, Litecoin, Monacoin, Ethereum and Bitcoin Cash. Our method is based on the realisation that selfish mining behaviour will cause identifiable anomalies in the statistics of miner's successive blocks discovery. Secondly, we apply heuristics-based address clustering to improve the detectability of this kind of behaviour. We find a marked presence of abnormal miners in Monacoin and Bitcoin Cash, and, to a lesser extent, in Ethereum. Finally, we extend our method to detect coordinated selfish mining attacks, finding mining cartels in Monacoin where miners might secretly share information about newly mined blocks in advance. Our analysis contributes to the research on security in cryptocurrency systems by providing the first empirical evidence that the aforementioned strategic mining behaviours do take place in practice. ",
    "url": "https://arxiv.org/abs/2208.05748",
    "authors": [
      "Sheng-Nan Li",
      "Carlo Campajola",
      "Claudio J. Tessone"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.05750",
    "title": "A Survey of MulVAL Extensions and Their Attack Scenarios Coverage",
    "abstract": "Organizations employ various adversary models in order to assess the risk and potential impact of attacks on their networks. Attack graphs represent vulnerabilities and actions an attacker can take to identify and compromise an organization's assets. Attack graphs facilitate both visual presentation and algorithmic analysis of attack scenarios in the form of attack paths. MulVAL is a generic open-source framework for constructing logical attack graphs, which has been widely used by researchers and practitioners and extended by them with additional attack scenarios. This paper surveys all of the existing MulVAL extensions, and maps all MulVAL interaction rules to MITRE ATT&CK Techniques to estimate their attack scenarios coverage. This survey aligns current MulVAL extensions along unified ontological concepts and highlights the existing gaps. It paves the way for methodical improvement of MulVAL and the comprehensive modeling of the entire landscape of adversarial behaviors captured in MITRE ATT&CK. ",
    "url": "https://arxiv.org/abs/2208.05750",
    "authors": [
      "David Tayouri",
      "Nick Baum",
      "Asaf Shabtai",
      "Rami Puzis"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.05751",
    "title": "FDNeRF: Few-shot Dynamic Neural Radiance Fields for Face Reconstruction  and Expression Editing",
    "abstract": "We propose a Few-shot Dynamic Neural Radiance Field (FDNeRF), the first NeRF-based method capable of reconstruction and expression editing of 3D faces based on a small number of dynamic images. Unlike existing dynamic NeRFs that require dense images as input and can only be modeled for a single identity, our method enables face reconstruction across different persons with few-shot inputs. Compared to state-of-the-art few-shot NeRFs designed for modeling static scenes, the proposed FDNeRF accepts view-inconsistent dynamic inputs and supports arbitrary facial expression editing, i.e., producing faces with novel expressions beyond the input ones. To handle the inconsistencies between dynamic inputs, we introduce a well-designed conditional feature warping (CFW) module to perform expression conditioned warping in 2D feature space, which is also identity adaptive and 3D constrained. As a result, features of different expressions are transformed into the target ones. We then construct a radiance field based on these view-consistent features and use volumetric rendering to synthesize novel views of the modeled faces. Extensive experiments with quantitative and qualitative evaluation demonstrate that our method outperforms existing dynamic and few-shot NeRFs on both 3D face reconstruction and expression editing tasks. Our code and model will be available upon acceptance. ",
    "url": "https://arxiv.org/abs/2208.05751",
    "authors": [
      "Jingbo Zhang",
      "Xiaoyu Li",
      "Ziyu Wan",
      "Can Wang",
      "Jing Liao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05764",
    "title": "The dynamics of belief: continuously monitoring and visualising complex  systems",
    "abstract": "The rise of AI in human contexts places new demands on systems to be transparent and explainable. We examine some anthropomorphic ideas and principles relevant to such accountablity in order to develop a theoretical framework for thinking about digital systems in complex human contexts and the problem of explaining their behaviour. Structurally, complex systems are made of modular and hierachical components, which we model abstractly using a new notion of modes and mode transitions. A mode is an independent component of the system with its own objectives, monitoring data, and algorithms. The behaviour of a mode, including its transitions to other modes, is determined by belief functions that interpret the mode's monitoring data in the light of its objectives and algorithms. We show how these belief functions can help explain system behaviour by visualising their evaluation in higher dimensional geometric spaces. These ideas are formalised by abstract and concrete simplicial complexes. ",
    "url": "https://arxiv.org/abs/2208.05764",
    "authors": [
      "Edwin J. Beggs",
      "John V. Tucker"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.05767",
    "title": "Distributionally Robust Model-Based Offline Reinforcement Learning with  Near-Optimal Sample Complexity",
    "abstract": "This paper concerns the central issues of model robustness and sample efficiency in offline reinforcement learning (RL), which aims to learn to perform decision making from history data without active exploration. Due to uncertainties and variabilities of the environment, it is critical to learn a robust policy -- with as few samples as possible -- that performs well even when the deployed environment deviates from the nominal one used to collect the history dataset. We consider a distributionally robust formulation of offline RL, focusing on a tabular non-stationary finite-horizon robust Markov decision process with an uncertainty set specified by the Kullback-Leibler divergence. To combat with sample scarcity, a model-based algorithm that combines distributionally robust value iteration with the principle of pessimism in the face of uncertainty is proposed, by penalizing the robust value estimates with a carefully designed data-driven penalty term. Under a mild and tailored assumption of the history dataset that measures distribution shift without requiring full coverage of the state-action space, we establish the finite-sample complexity of the proposed algorithm, and further show it is almost unimprovable in light of a nearly-matching information-theoretic lower bound up to a polynomial factor of the horizon length. To the best our knowledge, this provides the first provably near-optimal robust offline RL algorithm that learns under model uncertainty and partial coverage. ",
    "url": "https://arxiv.org/abs/2208.05767",
    "authors": [
      "Laixi Shi",
      "Yuejie Chi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.05781",
    "title": "Path-aware Siamese Graph Neural Network for Link Prediction",
    "abstract": "In this paper, we propose an algorithm of Path-aware Siamese Graph neural network(PSG) for link prediction tasks. Firstly, PSG can capture both nodes and edge features for given two nodes, namely the structure information of k-neighborhoods and relay paths information of the nodes. Furthermore, siamese graph neural network is utilized by PSG for representation learning of two contrastive links, which are a positive link and a negative link. We evaluate the proposed algorithm PSG on a link property prediction dataset of Open Graph Benchmark (OGB), ogbl-ddi. PSG achieves top 1 performance on ogbl-ddi. The experimental results verify the superiority of PSG. ",
    "url": "https://arxiv.org/abs/2208.05781",
    "authors": [
      "Jingsong Lv",
      "Zhao Li",
      "Hongyang Chen",
      "Yao Qi",
      "Chunqi Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.05785",
    "title": "Neural Mesh-Based Graphics",
    "abstract": "We revisit NPBG, the popular approach to novel view synthesis that introduced the ubiquitous point feature neural rendering paradigm. We are interested in particular in data-efficient learning with fast view synthesis. We achieve this through a view-dependent mesh-based denser point descriptor rasterization, in addition to a foreground/background scene rendering split, and an improved loss. By training solely on a single scene, we outperform NPBG, which has been trained on ScanNet and then scene finetuned. We also perform competitively with respect to the state-of-the-art method SVS, which has been trained on the full dataset (DTU and Tanks and Temples) and then scene finetuned, in spite of their deeper neural renderer. ",
    "url": "https://arxiv.org/abs/2208.05785",
    "authors": [
      "Shubhendu Jena",
      "Franck Multon",
      "Adnane Boukhayma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05787",
    "title": "Unsupervised Face Morphing Attack Detection via Self-paced Anomaly  Detection",
    "abstract": "The supervised-learning-based morphing attack detection (MAD) solutions achieve outstanding success in dealing with attacks from known morphing techniques and known data sources. However, given variations in the morphing attacks, the performance of supervised MAD solutions drops significantly due to the insufficient diversity and quantity of the existing MAD datasets. To address this concern, we propose a completely unsupervised MAD solution via self-paced anomaly detection (SPL-MAD) by leveraging the existing large-scale face recognition (FR) datasets and the unsupervised nature of convolutional autoencoders. Using general FR datasets that might contain unintentionally and unlabeled manipulated samples to train an autoencoder can lead to a diverse reconstruction behavior of attack and bona fide samples. We analyze this behavior empirically to provide a solid theoretical ground for designing our unsupervised MAD solution. This also results in proposing to integrate our adapted modified self-paced learning paradigm to enhance the reconstruction error separability between the bona fide and attack samples in a completely unsupervised manner. Our experimental results on a diverse set of MAD evaluation datasets show that the proposed unsupervised SPL-MAD solution outperforms the overall performance of a wide range of supervised MAD solutions and provides higher generalizability on unknown attacks. ",
    "url": "https://arxiv.org/abs/2208.05787",
    "authors": [
      "Meiling Fang",
      "Fadi Boutros",
      "Naser Damer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05800",
    "title": "Regressing Relative Fine-Grained Change for Sub-Groups in Unreliable  Heterogeneous Data Through Deep Multi-Task Metric Learning",
    "abstract": "Fine-Grained Change Detection and Regression Analysis are essential in many applications of ArtificialIntelligence. In practice, this task is often challenging owing to the lack of reliable ground truth information andcomplexity arising from interactions between the many underlying factors affecting a system. Therefore,developing a framework which can represent the relatedness and reliability of multiple sources of informationbecomes critical. In this paper, we investigate how techniques in multi-task metric learning can be applied for theregression of fine-grained change in real data.The key idea is that if we incorporate the incremental change in a metric of interest between specific instancesof an individual object as one of the tasks in a multi-task metric learning framework, then interpreting thatdimension will allow the user to be alerted to fine-grained change invariant to what the overall metric isgeneralised to be. The techniques investigated are specifically tailored for handling heterogeneous data sources,i.e. the input data for each of the tasks might contain missing values, the scale and resolution of the values is notconsistent across tasks and the data contains non-independent and identically distributed (non-IID) instances. Wepresent the results of our initial experimental implementations of this idea and discuss related research in thisdomain which may offer direction for further research. ",
    "url": "https://arxiv.org/abs/2208.05800",
    "authors": [
      "Niall O' Mahony",
      "Sean Campbell",
      "Lenka Krpalkova",
      "Joseph Walsh",
      "Daniel Riordan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.05820",
    "title": "Hybrid Transformer Network for Deepfake Detection",
    "abstract": "Deepfake media is becoming widespread nowadays because of the easily available tools and mobile apps which can generate realistic looking deepfake videos/images without requiring any technical knowledge. With further advances in this field of technology in the near future, the quantity and quality of deepfake media is also expected to flourish, while making deepfake media a likely new practical tool to spread mis/disinformation. Because of these concerns, the deepfake media detection tools are becoming a necessity. In this study, we propose a novel hybrid transformer network utilizing early feature fusion strategy for deepfake video detection. Our model employs two different CNN networks, i.e., (1) XceptionNet and (2) EfficientNet-B4 as feature extractors. We train both feature extractors along with the transformer in an end-to-end manner on FaceForensics++, DFDC benchmarks. Our model, while having relatively straightforward architecture, achieves comparable results to other more advanced state-of-the-art approaches when evaluated on FaceForensics++ and DFDC benchmarks. Besides this, we also propose novel face cut-out augmentations, as well as random cut-out augmentations. We show that the proposed augmentations improve the detection performance of our model and reduce overfitting. In addition to that, we show that our model is capable of learning from considerably small amount of data. ",
    "url": "https://arxiv.org/abs/2208.05820",
    "authors": [
      "Sohail Ahmed Khan",
      "Duc-Tien Dang-Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05827",
    "title": "K-UNN: k-Space Interpolation With Untrained Neural Network",
    "abstract": "Recently, untrained neural networks (UNNs) have shown satisfactory performances for MR image reconstruction on random sampling trajectories without using additional full-sampled training data. However, the existing UNN-based approach does not fully use the MR image physical priors, resulting in poor performance in some common scenarios (e.g., partial Fourier, regular sampling, etc.) and the lack of theoretical guarantees for reconstruction accuracy. To bridge this gap, we propose a safeguarded k-space interpolation method for MRI using a specially designed UNN with a tripled architecture driven by three physical priors of the MR images (or k-space data), including sparsity, coil sensitivity smoothness, and phase smoothness. We also prove that the proposed method guarantees tight bounds for interpolated k-space data accuracy. Finally, ablation experiments show that the proposed method can more accurately characterize the physical priors of MR images than existing traditional methods. Additionally, under a series of commonly used sampling trajectories, experiments also show that the proposed method consistently outperforms traditional parallel imaging methods and existing UNNs, and even outperforms the state-of-the-art supervised-trained k-space deep learning methods in some cases. ",
    "url": "https://arxiv.org/abs/2208.05827",
    "authors": [
      "Zhuo-Xu Cui",
      "Sen Jia",
      "Qingyong Zhu",
      "Congcong Liu",
      "Zhilang Qiu",
      "Yuanyuan Liu",
      "Jing Cheng",
      "Haifeng Wang",
      "Yanjie Zhu",
      "Dong Liang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05834",
    "title": "Joint reconstruction-segmentation on graphs",
    "abstract": "Practical image segmentation tasks concern images which must be reconstructed from noisy, distorted, and/or incomplete observations. A recent approach for solving such tasks is to perform this reconstruction jointly with the segmentation, using each to guide the other. However, this work has so far employed relatively simple segmentation methods, such as the Chan--Vese algorithm. In this paper, we present a method for joint reconstruction-segmentation using graph-based segmentation methods, which have been seeing increasing recent interest. Complications arise due to the large size of the matrices involved, and we show how these complications can be managed. We then analyse the convergence properties of our scheme. Finally, we apply this scheme to distorted versions of ``two cows'' images familiar from previous graph-based segmentation literature, first to a highly noised version and second to a blurred version, achieving highly accurate segmentations in both cases. We compare these results to those obtained by sequential reconstruction-segmentation approaches, finding that our method competes with, or even outperforms, those approaches in terms of reconstruction and segmentation accuracy. ",
    "url": "https://arxiv.org/abs/2208.05834",
    "authors": [
      "Jeremy Budd",
      "Yves van Gennip",
      "Jonas Latz",
      "Simone Parisotto",
      "Carola-Bibiane Schönlieb"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05836",
    "title": "HyperTime: Implicit Neural Representation for Time Series",
    "abstract": "Implicit neural representations (INRs) have recently emerged as a powerful tool that provides an accurate and resolution-independent encoding of data. Their robustness as general approximators has been shown in a wide variety of data sources, with applications on image, sound, and 3D scene representation. However, little attention has been given to leveraging these architectures for the representation and analysis of time series data. In this paper, we analyze the representation of time series using INRs, comparing different activation functions in terms of reconstruction accuracy and training convergence speed. We show how these networks can be leveraged for the imputation of time series, with applications on both univariate and multivariate data. Finally, we propose a hypernetwork architecture that leverages INRs to learn a compressed latent representation of an entire time series dataset. We introduce an FFT-based loss to guide training so that all frequencies are preserved in the time series. We show that this network can be used to encode time series as INRs, and their embeddings can be interpolated to generate new time series from existing ones. We evaluate our generative method by using it for data augmentation, and show that it is competitive against current state-of-the-art approaches for augmentation of time series. ",
    "url": "https://arxiv.org/abs/2208.05836",
    "authors": [
      "Elizabeth Fons",
      "Alejandro Sztrajman",
      "Yousef El-laham",
      "Alexandros Iosifidis",
      "Svitlana Vyetrenko"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.05838",
    "title": "Differencing based Self-supervised pretraining for Scene Change  Detection",
    "abstract": "Scene change detection (SCD), a crucial perception task, identifies changes by comparing scenes captured at different times. SCD is challenging due to noisy changes in illumination, seasonal variations, and perspective differences across a pair of views. Deep neural network based solutions require a large quantity of annotated data which is tedious and expensive to obtain. On the other hand, transfer learning from large datasets induces domain shift. To address these challenges, we propose a novel \\textit{Differencing self-supervised pretraining (DSP)} method that uses feature differencing to learn discriminatory representations corresponding to the changed regions while simultaneously tackling the noisy changes by enforcing temporal invariance across views. Our experimental results on SCD datasets demonstrate the effectiveness of our method, specifically to differences in camera viewpoints and lighting conditions. Compared against the self-supervised Barlow Twins and the standard ImageNet pretraining that uses more than a million additional labeled images, DSP can surpass it without using any additional data. Our results also demonstrate the robustness of DSP to natural corruptions, distribution shift, and learning under limited labeled data. ",
    "url": "https://arxiv.org/abs/2208.05838",
    "authors": [
      "Vijaya Raghavan T. Ramkumar",
      "Elahe Arani",
      "Bahram Zonooz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05845",
    "title": "A Comprehensive Analysis of AI Biases in DeepFake Detection With  Massively Annotated Databases",
    "abstract": "In recent years, image and video manipulations with DeepFake have become a severe concern for security and society. Therefore, many detection models and databases have been proposed to detect DeepFake data reliably. However, there is an increased concern that these models and training databases might be biased and thus, cause DeepFake detectors to fail. In this work, we tackle these issues by (a) providing large-scale demographic and non-demographic attribute annotations of 41 different attributes for five popular DeepFake datasets and (b) comprehensively analysing AI-bias of multiple state-of-the-art DeepFake detection models on these databases. The investigation analyses the influence of a large variety of distinctive attributes (from over 65M labels) on the detection performance, including demographic (age, gender, ethnicity) and non-demographic (hair, skin, accessories, etc.) information. The results indicate that investigated databases lack diversity and, more importantly, show that the utilised DeepFake detection models are strongly biased towards many investigated attributes. Moreover, the results show that the models' decision-making might be based on several questionable (biased) assumptions, such if a person is smiling or wearing a hat. Depending on the application of such DeepFake detection methods, these biases can lead to generalizability, fairness, and security issues. We hope that the findings of this study and the annotation databases will help to evaluate and mitigate bias in future DeepFake detection techniques. Our annotation datasets are made publicly available. ",
    "url": "https://arxiv.org/abs/2208.05845",
    "authors": [
      "Ying Xu",
      "Philipp Terhörst",
      "Kiran Raja",
      "Marius Pedersen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.05862",
    "title": "Network Emulation in Large-Scale Virtual Edge Testbeds: A Note of  Caution and the Way Forward",
    "abstract": "The growing research and industry interest in the Internet of Things and the edge computing paradigm has increased the need for cost-efficient virtual testbeds for large-scale distributed applications. Researchers, students, and practitioners need to test and evaluate the interplay of hundreds or thousands of real software components and services connected with a realistic edge network without access to physical infrastructure. While advances in virtualization technologies have enabled parts of this, network emulation as a crucial part in the development of edge testbeds is lagging behind: As we show in this paper, NetEm, the current state-of-the-art network emulation tooling included in the Linux kernel, imposes prohibitive scalability limits. We quantify these limits, investigate possible causes, and present a way forward for network emulation in large-scale virtual edge testbeds based on eBPFs. ",
    "url": "https://arxiv.org/abs/2208.05862",
    "authors": [
      "Soeren Becker",
      "Tobias Pfandzelter",
      "Nils Japke",
      "David Bermbach",
      "Odej Kao"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2208.05863",
    "title": "GEM-2: Next Generation Molecular Property Prediction Network with  Many-body and Full-range Interaction Modeling",
    "abstract": "Molecular property prediction is a fundamental task in the drug and material industries. Physically, the properties of a molecule are determined by its own electronic structure, which can be exactly described by the Schr\\\"odinger equation. However, solving the Schr\\\"odinger equation for most molecules is extremely challenging due to long-range interactions in the behavior of a quantum many-body system. While deep learning methods have proven to be effective in molecular property prediction, we design a novel method, namely GEM-2, which comprehensively considers both the long-range and many-body interactions in molecules. GEM-2 consists of two interacted tracks: an atom-level track modeling both the local and global correlation between any two atoms, and a pair-level track modeling the correlation between all atom pairs, which embed information between any 3 or 4 atoms. Extensive experiments demonstrated the superiority of GEM-2 over multiple baseline methods in quantum chemistry and drug discovery tasks. ",
    "url": "https://arxiv.org/abs/2208.05863",
    "authors": [
      "Lihang Liu",
      "Donglong He",
      "Xiaomin Fang",
      "Shanzhuo Zhang",
      "Fan Wang",
      "Jingzhou He",
      "Hua Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)",
      "Molecular Networks (q-bio.MN)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2208.05864",
    "title": "Face Morphing Attacks and Face Image Quality: The Effect of Morphing and  the Unsupervised Attack Detection by Quality",
    "abstract": "Morphing attacks are a form of presentation attacks that gathered increasing attention in recent years. A morphed image can be successfully verified to multiple identities. This operation, therefore, poses serious security issues related to the ability of a travel or identity document to be verified to belong to multiple persons. Previous works touched on the issue of the quality of morphing attack images, however, with the main goal of quantitatively proofing the realistic appearance of the produced morphing attacks. We theorize that the morphing processes might have an effect on both, the perceptual image quality and the image utility in face recognition (FR) when compared to bona fide samples. Towards investigating this theory, this work provides an extensive analysis of the effect of morphing on face image quality, including both general image quality measures and face image utility measures. This analysis is not limited to a single morphing technique, but rather looks at six different morphing techniques and five different data sources using ten different quality measures. This analysis reveals consistent separability between the quality scores of morphing attack and bona fide samples measured by certain quality measures. Our study goes further to build on this effect and investigate the possibility of performing unsupervised morphing attack detection (MAD) based on quality scores. Our study looks intointra and inter-dataset detectability to evaluate the generalizability of such a detection concept on different morphing techniques and bona fide sources. Our final results point out that a set of quality measures, such as MagFace and CNNNIQA, can be used to perform unsupervised and generalized MAD with a correct classification accuracy of over 70%. ",
    "url": "https://arxiv.org/abs/2208.05864",
    "authors": [
      "Biying Fu",
      "Naser Damer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05870",
    "title": "Constrained and unconstrained stable discrete minimizations for p-robust  local reconstructions in vertex patches in the de Rham complex",
    "abstract": "We analyze constrained and unconstrained minimization problems on patches of tetrahedra sharing a common vertex with discontinuous piecewise polynomial data of degree p. We show that the discrete minimizers in the spaces of piecewise polynomials of degree p conforming in the H1, H(curl), or H(div) spaces are as good as the minimizers in these entire (infinite-dimensional) Sobolev spaces, up to a constant that is independent of p. These results are useful in the analysis and design of finite element methods, namely for devising stable local commuting projectors and establishing local-best/global-best equivalences in a priori analysis and in the context of a posteriori error estimation. Unconstrained minimization in H1 and constrained minimization in H(div) have been previously treated in the literature. Along with improvement of the results in the H1 and H(div) cases, our key contribution is the treatment of the H(curl) framework. This enables us to cover the whole De Rham diagram in three space dimensions in a single setting. ",
    "url": "https://arxiv.org/abs/2208.05870",
    "authors": [
      "T. Chaumont-Frelet",
      "M. Vohralik"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Analysis of PDEs (math.AP)"
    ]
  },
  {
    "id": "arXiv:2208.05895",
    "title": "Shielding Federated Learning Systems against Inference Attacks with ARM  TrustZone",
    "abstract": "Federated Learning (FL) opens new perspectives for training machine learning models while keeping personal data on the users premises. Specifically, in FL, models are trained on the users devices and only model updates (i.e., gradients) are sent to a central server for aggregation purposes. However, the long list of inference attacks that leak private data from gradients, published in the recent years, have emphasized the need of devising effective protection mechanisms to incentivize the adoption of FL at scale. While there exist solutions to mitigate these attacks on the server side, little has been done to protect users from attacks performed on the client side. In this context, the use of Trusted Execution Environments (TEEs) on the client side are among the most proposing solutions. However, existing frameworks (e.g., DarkneTZ) require statically putting a large portion of the machine learning model into the TEE to effectively protect against complex attacks or a combination of attacks. We present GradSec, a solution that allows protecting in a TEE only sensitive layers of a machine learning model, either statically or dynamically, hence reducing both the TCB size and the overall training time by up to 30% and 56%, respectively compared to state-of-the-art competitors. ",
    "url": "https://arxiv.org/abs/2208.05895",
    "authors": [
      "Aghiles Ait Messaoud",
      "Sonia Ben Mokhtar",
      "Vlad Nitu",
      "Valerio Shiavoni"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.05908",
    "title": "Uncertainty Quantification of Sparse Travel Demand Prediction with  Spatial-Temporal Graph Neural Networks",
    "abstract": "Origin-Destination (O-D) travel demand prediction is a fundamental challenge in transportation. Recently, spatial-temporal deep learning models demonstrate the tremendous potential to enhance prediction accuracy. However, few studies tackled the uncertainty and sparsity issues in fine-grained O-D matrices. This presents a serious problem, because a vast number of zeros deviate from the Gaussian assumption underlying the deterministic deep learning models. To address this issue, we design a Spatial-Temporal Zero-Inflated Negative Binomial Graph Neural Network (STZINB-GNN) to quantify the uncertainty of the sparse travel demand. It analyzes spatial and temporal correlations using diffusion and temporal convolution networks, which are then fused to parameterize the probabilistic distributions of travel demand. The STZINB-GNN is examined using two real-world datasets with various spatial and temporal resolutions. The results demonstrate the superiority of STZINB-GNN over benchmark models, especially under high spatial-temporal resolutions, because of its high accuracy, tight confidence intervals, and interpretable parameters. The sparsity parameter of the STZINB-GNN has physical interpretation for various transportation applications. ",
    "url": "https://arxiv.org/abs/2208.05908",
    "authors": [
      "Dingyi Zhuang",
      "Shenhao Wang",
      "Haris N. Koutsopoulos",
      "Jinhua Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.05922",
    "title": "Privacy Preservation Among Honest-but-Curious Edge Nodes: A Survey",
    "abstract": "Users care greatly about preserving the privacy of their personal data gathered during their use of information systems. This extends to both the data they actively provide in exchange for services as well as the metadata passively generated in many aspects of their computing experiences. However, new technologies are at a great risk of being inadequate to protect a user's privacy if researchers focus primarily on the use cases of these technologies without giving sufficient consideration to incorporating privacy at a fundamental level. Edge computing has been introduced as a promising networking paradigm for processing the incredible magnitude of data produced by modern IoT networks. As edge computing is still considered a relatively new technology, the edge computing community has a responsibility to ensure privacy protection is interwoven into its implementations at a foundational level. In this paper, I first introduce the concepts of user privacy and edge computing; I then provide a state-of-the-art overview of current literature as it relates to privacy preservation in honest-but-curious edge computing. Finally, I provide future research recommendations in the hope that the edge computing research and development community will be inspired to ensure strong privacy protections in their current and future work. ",
    "url": "https://arxiv.org/abs/2208.05922",
    "authors": [
      "Christian Badolato"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2208.05924",
    "title": "Regularizing Deep Neural Networks with Stochastic Estimators of Hessian  Trace",
    "abstract": "In this paper we develop a novel regularization method for deep neural networks by penalizing the trace of Hessian. This regularizer is motivated by a recent guarantee bound of the generalization error. Hutchinson method is a classical unbiased estimator for the trace of a matrix, but it is very time-consuming on deep learning models. Hence a dropout scheme is proposed to efficiently implements the Hutchinson method. Then we discuss a connection to linear stability of a nonlinear dynamical system and flat/sharp minima. Experiments demonstrate that our method outperforms existing regularizers and data augmentation methods, such as Jacobian, confidence penalty, and label smoothing, cutout and mixup. ",
    "url": "https://arxiv.org/abs/2208.05924",
    "authors": [
      "Yucong Liu",
      "Shixing Yu",
      "Tong Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.05944",
    "title": "Barrier Certificate based Safe Control for LiDAR-based Systems under  Sensor Faults and Attacks",
    "abstract": "Autonomous Cyber-Physical Systems (CPS) fuse proprioceptive sensors such as GPS and exteroceptive sensors including Light Detection and Ranging (LiDAR) and cameras for state estimation and environmental observation. It has been shown that both types of sensors can be compromised by malicious attacks, leading to unacceptable safety violations. We study the problem of safety-critical control of a LiDAR-based system under sensor faults and attacks. We propose a framework consisting of fault tolerant estimation and fault tolerant control. The former reconstructs a LiDAR scan with state estimations, and excludes the possible faulty estimations that are not aligned with LiDAR measurements. We also verify the correctness of LiDAR scans by comparing them with the reconstructed ones and removing the possibly compromised sector in the scan. Fault tolerant control computes a control signal with the remaining estimations at each time step. We prove that the synthesized control input guarantees system safety using control barrier certificates. We validate our proposed framework using a UAV delivery system in an urban environment. We show that our proposed approach guarantees safety for the UAV whereas a baseline fails. ",
    "url": "https://arxiv.org/abs/2208.05944",
    "authors": [
      "Hongchao Zhang",
      "Shiyu Cheng",
      "Luyao Niu",
      "Andrew Clark"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.05950",
    "title": "Interactive Code Generation via Test-Driven User-Intent Formalization",
    "abstract": "Pre-trained large language models (LLMs) such as OpenAI Codex have shown immense potential in automating significant aspects of coding by producing natural code from informal natural language (NL) intent. However, the code produced does not have any correctness guarantees around satisfying user's intent. In fact, it is hard to define a notion of correctness since natural language can be ambiguous and lacks a formal semantics. In this paper, we take a first step towards addressing the problem above by proposing the workflow of test-driven user-intent formalization (TDUIF), which leverages lightweight user feedback to jointly (a) formalize the user intent as tests (a partial specification), and (b) generates code that meets the formal user intent. To perform a scalable and large-scale automated evaluation of the algorithms without requiring a user in the loop, we describe how to simulate user interaction with high-fidelity using a reference solution. We also describe and implement alternate implementations of several algorithmic components (including mutating and ranking a set of tests) that can be composed for efficient solutions to the TDUIF problem. We have developed a system TICODER that implements several solutions to TDUIF, and compare their relative effectiveness on the MBPP academic code generation benchmark. Our results are promising with using the OpenAI Codex LLM on MBPP: our best algorithm improves the pass@1 code generation accuracy metric from 48.39% to 70.49% with a single user query, and up to 85.48% with up to 5 user queries. Second, we can generate a non-trivial functional unit test consistent with the user intent within an average of 1.69 user queries for 90.40% of the examples for this dataset. ",
    "url": "https://arxiv.org/abs/2208.05950",
    "authors": [
      "Shuvendu K. Lahiri",
      "Aaditya Naik",
      "Georgios Sakkas",
      "Piali Choudhury",
      "Curtis von Veh",
      "Madanlal Musuvathi",
      "Jeevana Priya Inala",
      "Chenglong Wang",
      "Jianfeng Gao"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2208.05484",
    "title": "Neural Embedding: Learning the Embedding of Manifold of Physics Data",
    "abstract": "In this paper, we present a method of embedding physics data manifolds with metric structure into lower dimensional spaces with simpler metrics, such as Euclidean and Hyperbolic spaces. We then demonstrate that it can be a powerful step in the data analysis pipeline for many applications. Using progressively more realistic simulated collisions at the Large Hadron Collider, we show that this embedding approach learns the underlying latent structure. With the notion of volume in Euclidean spaces, we provide for the first time a viable solution to quantifying the true search capability of model agnostic search algorithms in collider physics (i.e. anomaly detection). Finally, we discuss how the ideas presented in this paper can be employed to solve many practical challenges that require the extraction of physically meaningful representations from information in complex high dimensional datasets. ",
    "url": "https://arxiv.org/abs/2208.05484",
    "authors": [
      "Sang Eon Park",
      "Philip Harris",
      "Bryan Ostdiek"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)"
    ]
  },
  {
    "id": "arXiv:2208.05536",
    "title": "Cell Polarity and Movement with Reaction-Diffusion and Moving Boundary:  Rigorous Modeling and Robust Simulations",
    "abstract": "Cell polarity and movement are fundamental to many biological functions. Experimental and theoretically studies have indicated that interactions of certain proteins lead to the cell polarization which plays a key role in controlling the cell movement. We study the cell polarity and movement based on a class of biophysical models that consist of reaction-diffusion equations for different proteins and the dynamics of moving cell boundary. Such a moving boundary is often simulated by a phase-filed model. We first apply the matched asymptotic analysis to give a rigorous derivation of the sharp-interface model of the cell boundary from a phase-field model. We then develop a robust numerical approach that combines the level-set method to track the sharp boundary of a moving cell and accurate discretization techniques for solving the reaction-diffusion equations on the moving cell region. Our extensive numerical simulations predict the cell polarization under various kinds of stimulus, and capture both the linear and circular trajectories of a moving cell for a long period of time. In particular, we have identified some key parameters controlling different cell trajectories that are less accurately predicted by reduced models. Our work has linked different models and also developed tools that can be adapted for the challenging three-dimensional simulations. ",
    "url": "https://arxiv.org/abs/2208.05536",
    "authors": [
      "Shuang Liu",
      "Li-Tien Cheng",
      "Bo Li"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2208.05616",
    "title": "OpenMedIA: Open-Source Medical Image Analysis Toolbox and Benchmark  under Heterogeneous AI Computing Platforms",
    "abstract": "In this paper, we present OpenMedIA, an open-source toolbox library containing a rich set of deep learning methods for medical image analysis under heterogeneous Artificial Intelligence (AI) computing platforms. Various medical image analysis methods, including 2D$/$3D medical image classification, segmentation, localisation, and detection, have been included in the toolbox with PyTorch and$/$or MindSpore implementations under heterogeneous NVIDIA and Huawei Ascend computing systems. To our best knowledge, OpenMedIA is the first open-source algorithm library providing compared PyTorch and MindSp ",
    "url": "https://arxiv.org/abs/2208.05616",
    "authors": [
      "Jia-Xin Zhuang",
      "Xiansong Huang",
      "Yang Yang",
      "Jiancong Chen",
      "Yue Yu",
      "Wei Gao",
      "Ge Li",
      "Jie Chen",
      "Tong Zhang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.05637",
    "title": "Scalable neural quantum states architecture for quantum chemistry",
    "abstract": "Variational optimization of neural-network representations of quantum states has been successfully applied to solve interacting fermionic problems. Despite rapid developments, significant scalability challenges arise when considering molecules of large scale, which correspond to non-locally interacting quantum spin Hamiltonians consisting of sums of thousands or even millions of Pauli operators. In this work, we introduce scalable parallelization strategies to improve neural-network-based variational quantum Monte Carlo calculations for ab-initio quantum chemistry applications. We establish GPU-supported local energy parallelism to compute the optimization objective for Hamiltonians of potentially complex molecules. Using autoregressive sampling techniques, we demonstrate systematic improvement in wall-clock timings required to achieve CCSD baseline target energies. The performance is further enhanced by accommodating the structure of resultant spin Hamiltonians into the autoregressive sampling ordering. The algorithm achieves promising performance in comparison with the classical approximate methods and exhibits both running time and scalability advantages over existing neural-network based methods. ",
    "url": "https://arxiv.org/abs/2208.05637",
    "authors": [
      "Tianchen Zhao",
      "James Stokes",
      "Shravan Veerapaneni"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2208.05693",
    "title": "Dynamics of cold random hyperbolic graphs with link persistence",
    "abstract": "We consider and analyze a dynamic model of random hyperbolic graphs with link persistence. In the model, both connections and disconnections can be propagated from the current to the next snapshot with probability $\\omega \\in [0, 1)$. Otherwise, with probability $1-\\omega$, connections are reestablished according to the random hyperbolic graphs model. We show that while the persistence probability $\\omega$ affects the averages of the contact and intercontact distributions, it does not affect the tails of these distributions, which decay as power laws with exponents that do not depend on $\\omega$. We also consider examples of real temporal networks and show that the considered model can adequately reproduce several of their dynamical properties. Our results advance our understanding of realistically modeling of temporal networks and of the effects of link persistence. ",
    "url": "https://arxiv.org/abs/2208.05693",
    "authors": [
      "Sofoclis Zambirinis",
      "Harrison Hartle",
      "Fragkiskos Papadopoulos"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Social and Information Networks (cs.SI)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2208.05703",
    "title": "Two-Component 3D Atomic Bose-Einstein Condensates Support Complex Stable  Patterns",
    "abstract": "We report the computational discovery of complex, topologically charged, and spectrally stable states in three-dimensional multi-component nonlinear wave systems of nonlinear Schr{\\\"o}dinger type. While our computations relate to two-component atomic Bose-Einstein condensates in parabolic traps, our methods can be broadly applied to high-dimensional, nonlinear systems of partial differential equations. The combination of the so-called deflation technique with a careful selection of initial guesses enables the computation of an unprecedented breadth of patterns, including ones combining vortex lines, rings, stars, and \"vortex labyrinths\". Despite their complexity, they may be dynamically robust and amenable to experimental observation, as confirmed by Bogolyubov-de Gennes spectral analysis and numerical evolution simulations. ",
    "url": "https://arxiv.org/abs/2208.05703",
    "authors": [
      "N. Boullé",
      "I. Newell",
      "P. E. Farrell",
      "P. G. Kevrekidis"
    ],
    "subjectives": [
      "Pattern Formation and Solitons (nlin.PS)",
      "Dynamical Systems (math.DS)",
      "Numerical Analysis (math.NA)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2208.05758",
    "title": "NEO-QEC: Neural Network Enhanced Online Superconducting Decoder for  Surface Codes",
    "abstract": "Quantum Error Correction (QEC) is essential for quantum computing to mitigate the effect of errors on qubits, and Surface code (SC) is one of the most promising QEC methods. Decoding SCs is the most computational expensive task in the control device of quantum computers (QCs), and many works focus on accurate decoding algorithms for SCs, including ones with neural networks (NNs). Practical QCs also require low-latency decoding because slow decoding leads to the accumulation of errors on qubits, resulting in logical failures. For QCs with superconducting qubits, a practical decoder must be very power-efficient in addition to high accuracy and low latency. In order to reduce the hardware complexity of QC, we are supposed to decode SCs in a cryogenic environment with a limited power budget, where superconducting qubits operate. In this paper, we propose an NN-based accurate, fast, and low-power decoder capable of decoding SCs and lattice surgery (LS) operations with measurement errors on ancillary qubits. To achieve both accuracy and hardware efficiency of SC decoder, we apply a binarized neural network. We design a neural processing unit (NPU) for the decoder with SFQ-based digital circuits and evaluate it with a SPICE-level simulation. We evaluate the decoder performance by a quantum error simulator for the single logical qubit protection and the minimum operation of LS with code distances up to 13, and it achieves 2.5% and 1.0% accuracy thresholds, respectively. ",
    "url": "https://arxiv.org/abs/2208.05758",
    "authors": [
      "Yosuke Ueno",
      "Masaaki Kondo",
      "Masamitsu Tanaka",
      "Yasunari Suzuki",
      "Yutaka Tabuchi"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2208.05776",
    "title": "Neural Networks for Scalar Input and Functional Output",
    "abstract": "The regression of a functional response on a set of scalar predictors can be a challenging task, especially if there is a large number of predictors, these predictors have interaction effects, or the relationship between those predictors and the response is nonlinear. In this work, we propose a solution to this problem: a feed-forward neural network (NN) designed to predict a functional response using scalar inputs. First, we transform the functional response to a finite-dimension representation and then we construct a NN that outputs this representation. We proposed different objective functions to train the NN. The proposed models are suited for both regularly and irregularly spaced data and also provide multiple ways to apply a roughness penalty to control the smoothness of the predicted curve. The difficulty in implementing both those features lies in the definition of objective functions that can be back-propagated. In our experiments, we demonstrate that our model outperforms the conventional function-on-scalar regression model in multiple scenarios while computationally scaling better with the dimension of the predictors. ",
    "url": "https://arxiv.org/abs/2208.05776",
    "authors": [
      "Sidi Wu",
      "Cédric Beaulac",
      "Jiguo Cao"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2208.05868",
    "title": "TotalSegmentator: robust segmentation of 104 anatomical structures in CT  images",
    "abstract": "In this work we focus on automatic segmentation of multiple anatomical structures in (whole body) CT images. Many segmentation algorithms exist for this task. However, in most cases they suffer from 3 problems: 1. They are difficult to use (the code and data is not publicly available or difficult to use). 2. They do not generalize (often the training dataset was curated to only contain very clean images which do not reflect the image distribution found during clinical routine), 3. The algorithm can only segment one anatomical structure. For more structures several algorithms have to be used which increases the effort required to set up the system. In this work we publish a new dataset and segmentation toolkit which solves all three of these problems: In 1204 CT images we segmented 104 anatomical structures (27 organs, 59 bones, 10 muscles, 8 vessels) covering a majority of relevant classes for most use cases. We show an improved workflow for the creation of ground truth segmentations which speeds up the process by over 10x. The CT images were randomly sampled from clinical routine, thus representing a real world dataset which generalizes to clinical application. The dataset contains a wide range of different pathologies, scanners, sequences and sites. Finally, we train a segmentation algorithm on this new dataset. We call this algorithm TotalSegmentator and make it easily available as a pretrained python pip package (pip install totalsegmentator). Usage is as simple as TotalSegmentator -i ct.nii.gz -o seg and it works well for most CT images. The code is available at https://github.com/wasserth/TotalSegmentator and the dataset at https://doi.org/10.5281/zenodo.6802613. ",
    "url": "https://arxiv.org/abs/2208.05868",
    "authors": [
      "Jakob Wasserthal",
      "Manfred Meyer",
      "Hanns-Christian Breit",
      "Joshy Cyriac",
      "Shan Yang",
      "Martin Segeroth"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.05881",
    "title": "Uncertainty-Aware Blob Detection with an Application to Integrated-Light  Stellar Population Recoveries",
    "abstract": "Context. Blob detection is a common problem in astronomy. One example is in stellar population modelling, where the distribution of stellar ages and metallicities in a galaxy is inferred from observations. In this context, blobs may correspond to stars born in-situ versus those accreted from satellites, and the task of blob detection is to disentangle these components. A difficulty arises when the distributions come with significant uncertainties, as is the case for stellar population recoveries inferred from modelling spectra of unresolved stellar systems. There is currently no satisfactory method for blob detection with uncertainties. Aims. We introduce a method for uncertainty-aware blob detection developed in the context of stellar population modelling of integrated-light spectra of stellar systems. Methods. We develop theory and computational tools for an uncertainty-aware version of the classic Laplacian-of-Gaussians method for blob detection, which we call ULoG. This identifies significant blobs considering a variety of scales. As a prerequisite to apply ULoG to stellar population modelling, we introduce a method for efficient computation of uncertainties for spectral modelling. This method is based on the truncated Singular Value Decomposition and Markov Chain Monte Carlo sampling (SVD-MCMC). Results. We apply the methods to data of the star cluster M54. We show that the SVD-MCMC inferences match those from standard MCMC, but are a factor 5-10 faster to compute. We apply ULoG to the inferred M54 age/metallicity distributions, identifying between 2 or 3 significant, distinct populations amongst its stars. ",
    "url": "https://arxiv.org/abs/2208.05881",
    "authors": [
      "Prashin Jethwa",
      "Fabian Parzer",
      "Otmar Scherzer",
      "Glenn van de Ven"
    ],
    "subjectives": [
      "Astrophysics of Galaxies (astro-ph.GA)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2208.05910",
    "title": "Machine learning in front of statistical methods for prediction spread  SARS-CoV-2 in Colombia",
    "abstract": "An analytical study of the disease COVID-19 in Colombia was carried out using mathematical models such as Susceptible-Exposed-Infectious-Removed (SEIR), Logistic Regression (LR), and a machine learning method called Polynomial Regression Method. Previous analysis has been performed on the daily number of cases, deaths, infected people, and people who were exposed to the virus, all of them in a timeline of 550 days. Moreover, it has made the fitting of infection spread detailing the most efficient and optimal methods with lower propagation error and the presence of statistical biases. Finally, four different prevention scenarios were proposed to evaluate the ratio of each one of the parameters related to the disease. ",
    "url": "https://arxiv.org/abs/2208.05910",
    "authors": [
      "A. Estupiñán",
      "J. Acuña",
      "A. Rodriguez",
      "A. Ayala",
      "C. Estupiñán",
      "Ramon E. R. Gonzalez",
      "D. A. Triana-Camacho",
      "K. L. Cristiano-Rodríguez"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.05939",
    "title": "Heatmap Regression for Lesion Detection using Pointwise Annotations",
    "abstract": "In many clinical contexts, detecting all lesions is imperative for evaluating disease activity. Standard approaches pose lesion detection as a segmentation problem despite the time-consuming nature of acquiring segmentation labels. In this paper, we present a lesion detection method which relies only on point labels. Our model, which is trained via heatmap regression, can detect a variable number of lesions in a probabilistic manner. In fact, our proposed post-processing method offers a reliable way of directly estimating the lesion existence uncertainty. Experimental results on Gad lesion detection show our point-based method performs competitively compared to training on expensive segmentation labels. Finally, our detection model provides a suitable pre-training for segmentation. When fine-tuning on only 17 segmentation samples, we achieve comparable performance to training with the full dataset. ",
    "url": "https://arxiv.org/abs/2208.05939",
    "authors": [
      "Chelsea Myers-Colet",
      "Julien Schroeter",
      "Douglas L. Arnold",
      "Tal Arbel"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.05949",
    "title": "Valid Inference after Causal Discovery",
    "abstract": "Causal graph discovery and causal effect estimation are two fundamental tasks in causal inference. While many methods have been developed for each task individually, statistical challenges arise when applying these methods jointly: estimating causal effects after running causal discovery algorithms on the same data leads to \"double dipping,\" invalidating coverage guarantees of classical confidence intervals. To this end, we develop tools for valid post-causal-discovery inference. One key contribution is a randomized version of the greedy equivalence search (GES) algorithm, which permits a valid, finite-sample correction of classical confidence intervals. Across empirical studies, we show that a naive combination of causal discovery and subsequent inference algorithms typically leads to highly inflated miscoverage rates; at the same time, our noisy GES method provides reliable coverage control while achieving more accurate causal graph recovery than data splitting. ",
    "url": "https://arxiv.org/abs/2208.05949",
    "authors": [
      "Paula Gradu",
      "Tijana Zrnic",
      "Yixin Wang",
      "Michael I. Jordan"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.05952",
    "title": "Partition Pooling for Convolutional Graph Network Applications in  Particle Physics",
    "abstract": "Convolutional graph networks are used in particle physics for effective event reconstructions and classifications. However, their performances can be limited by the considerable amount of sensors used in modern particle detectors if applied to sensor-level data. We present a pooling scheme that uses partitioning to create pooling kernels on graphs, similar to pooling on images. Partition pooling can be used to adopt successful image recognition architectures for graph neural network applications in particle physics. The reduced computational resources allow for deeper networks and more extensive hyperparameter optimizations. To show its applicability, we construct a convolutional graph network with partition pooling that reconstructs simulated interaction vertices for an idealized neutrino detector. The pooling network yields improved performance and is less susceptible to overfitting than a similar network without pooling. The lower resource requirements allow the construction of a deeper network with further improved performance. ",
    "url": "https://arxiv.org/abs/2208.05952",
    "authors": [
      "M. Bachlechner",
      "T. Birkenfeld",
      "P. Soldin",
      "A. Stahl",
      "C. Wiebusch"
    ],
    "subjectives": [
      "High Energy Physics - Experiment (hep-ex)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.05955",
    "title": "Robust Control Barrier Functions for Nonlinear Control Systems with  Uncertainty: A Duality-based Approach",
    "abstract": "This paper studies the design of controllers that guarantee stability and safety of nonlinear control affine systems with parametric uncertainty in both the drift and control vector fields. To this end, we introduce novel classes of robust control barrier functions (RCBF) and robust control Lyapunov functions (RCLF) that facilitate the synthesis of safety-critical controllers in the presence of parametric uncertainty using quadratic programming. Since the initial bounds on the system uncertainty may be highly conservative, we present a data-driven approach to reducing such bounds using input-output data collected online. In particular, we leverage an integral set-membership identification algorithm that iteratively shrinks the set of possible system parameters online and guarantees stability and safety during learning. The efficacy of the developed approach is illustrated on two numerical examples. ",
    "url": "https://arxiv.org/abs/2208.05955",
    "authors": [
      "Max H. Cohen",
      "Calin Belta",
      "Roberto Tron"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2002.05998",
    "title": "On $k$-Bend and Monotonic $\\ell$-Bend Edge Intersection Graphs of Paths  on a Grid",
    "abstract": " Title: On $k$-Bend and Monotonic $\\ell$-Bend Edge Intersection Graphs of Paths  on a Grid ",
    "url": "https://arxiv.org/abs/2002.05998",
    "authors": [
      "Eranda Cela",
      "Elisabeth Gaar"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2007.13982",
    "title": "Distributionally Robust Losses for Latent Covariate Mixtures",
    "abstract": " Comments: First released in 2019 on a personal website; published in Operations Research in 2022 ",
    "url": "https://arxiv.org/abs/2007.13982",
    "authors": [
      "John Duchi",
      "Tatsunori Hashimoto",
      "Hongseok Namkoong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2008.02724",
    "title": "Zeroing Neural Networks : an Introduction to Predictive Computations for  Time-varying Matrix Problems via ZNN",
    "abstract": " Comments: 34 pages, 2 images ",
    "url": "https://arxiv.org/abs/2008.02724",
    "authors": [
      "Frank Uhlig"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "History and Overview (math.HO)"
    ]
  },
  {
    "id": "arXiv:2012.14528",
    "title": "Trivial colors in colorings of Kneser graphs",
    "abstract": " Title: Trivial colors in colorings of Kneser graphs ",
    "url": "https://arxiv.org/abs/2012.14528",
    "authors": [
      "Sergei Kiselev",
      "Andrey Kupavskii"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2104.07916",
    "title": "Augmenting Deep Classifiers with Polynomial Neural Networks",
    "abstract": " Comments: Accepted at ECCV'22 ",
    "url": "https://arxiv.org/abs/2104.07916",
    "authors": [
      "Grigorios G Chrysos",
      "Markos Georgopoulos",
      "Jiankang Deng",
      "Jean Kossaifi",
      "Yannis Panagakis",
      "Anima Anandkumar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.10271",
    "title": "End-to-end Temporal Action Detection with Transformer",
    "abstract": " Comments: Accepted by IEEE Transactions on Image Processing (TIP). Code: this https URL ",
    "url": "https://arxiv.org/abs/2106.10271",
    "authors": [
      "Xiaolong Liu",
      "Qimeng Wang",
      "Yao Hu",
      "Xu Tang",
      "Shiwei Zhang",
      "Song Bai",
      "Xiang Bai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.07002",
    "title": "Change is Everywhere: Single-Temporal Supervised Object Change Detection  in Remote Sensing Imagery",
    "abstract": " Comments: Accepted by ICCV 2021 ",
    "url": "https://arxiv.org/abs/2108.07002",
    "authors": [
      "Zhuo Zheng",
      "Ailong Ma",
      "Liangpei Zhang",
      "Yanfei Zhong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.11056",
    "title": "Social Norm Bias: Residual Harms of Fairness-Aware Algorithms",
    "abstract": " Comments: Spotlighted at the 2021 ICML Machine Learning for Data Workshop and presented at the 2021 ICML Socially Responsible Machine Learning Workshop ",
    "url": "https://arxiv.org/abs/2108.11056",
    "authors": [
      "Myra Cheng",
      "Maria De-Arteaga",
      "Lester Mackey",
      "Adam Tauman Kalai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2109.04269",
    "title": "Asynchronous Federated Learning on Heterogeneous Devices: A Survey",
    "abstract": " Title: Asynchronous Federated Learning on Heterogeneous Devices: A Survey ",
    "url": "https://arxiv.org/abs/2109.04269",
    "authors": [
      "Chenhao Xu",
      "Youyang Qu",
      "Yong Xiang",
      "Longxiang Gao"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2201.12929",
    "title": "The Geometry of Robust Value Functions",
    "abstract": " Title: The Geometry of Robust Value Functions ",
    "url": "https://arxiv.org/abs/2201.12929",
    "authors": [
      "Kaixin Wang",
      "Navdeep Kumar",
      "Kuangqi Zhou",
      "Bryan Hooi",
      "Jiashi Feng",
      "Shie Mannor"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.03325",
    "title": "Differential Privacy for Symbolic Systems with Application to Markov  Chains",
    "abstract": " Comments: 16 pages, 9 figures, submitted to Automatica ",
    "url": "https://arxiv.org/abs/2202.03325",
    "authors": [
      "Bo Chen",
      "Kevin Leahy",
      "Austin Jones",
      "Matthew Hale"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Symbolic Computation (cs.SC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.06907",
    "title": "Hierarchical Memory Learning for Fine-Grained Scene Graph Generation",
    "abstract": " Title: Hierarchical Memory Learning for Fine-Grained Scene Graph Generation ",
    "url": "https://arxiv.org/abs/2203.06907",
    "authors": [
      "Youming Deng",
      "Yansheng Li",
      "Yongjun Zhang",
      "Xiang Xiang",
      "Jian Wang",
      "Jingdong Chen",
      "Jiayi Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.10204",
    "title": "Inferring topological transitions in pattern-forming processes with  self-supervised learning",
    "abstract": " Comments: 17 pages, 6 figures, 8 pages of supplementary information ",
    "url": "https://arxiv.org/abs/2203.10204",
    "authors": [
      "Marcin Abram",
      "Keith Burghardt",
      "Greg Ver Steeg",
      "Aram Galstyan",
      "Remi Dingreville"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.13181",
    "title": "The Cost-Accuracy Trade-Off In Operator Learning With Neural Networks",
    "abstract": " Comments: 48 pages, 19 figures ",
    "url": "https://arxiv.org/abs/2203.13181",
    "authors": [
      "Maarten V. de Hoop",
      "Daniel Zhengyu Huang",
      "Elizabeth Qian",
      "Andrew M. Stuart"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2203.13641",
    "title": "StretchBEV: Stretching Future Instance Prediction Spatially and  Temporally",
    "abstract": " Comments: ECCV 2022 ",
    "url": "https://arxiv.org/abs/2203.13641",
    "authors": [
      "Adil Kaan Akan",
      "Fatma Güney"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.16417",
    "title": "Low-complexity Near-optimum Symbol Detection Based on Neural Enhancement  of Factor Graphs",
    "abstract": " Comments: revised version ",
    "url": "https://arxiv.org/abs/2203.16417",
    "authors": [
      "Luca Schmid",
      "Laurent Schmalen"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.00888",
    "title": "Learning List-wise Representation in Reinforcement Learning for Ads  Allocation with Multiple Auxiliary Tasks",
    "abstract": " Comments: Accepted by CIKM-22 ",
    "url": "https://arxiv.org/abs/2204.00888",
    "authors": [
      "Ze Wang",
      "Guogang Liao",
      "Xiaowen Shi",
      "Xiaoxu Wu",
      "Chuheng Zhang",
      "Yongkang Wang",
      "Xingxing Wang",
      "Dong Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.07050",
    "title": "DECONET: an Unfolding Network for Analysis-based Compressed Sensing with  Generalization Error Estimates",
    "abstract": " Title: DECONET: an Unfolding Network for Analysis-based Compressed Sensing with  Generalization Error Estimates ",
    "url": "https://arxiv.org/abs/2205.07050",
    "authors": [
      "Vicky Kouni",
      "Yannis Panagakis"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.14552",
    "title": "Graph Agnostic Estimators with Staggered Rollout Designs under Network  Interference",
    "abstract": " Comments: 24 pages, 16 figures, submitted to Thirty-sixth Conference on Neural Information Processing Systems (NeurIPS 2022) ",
    "url": "https://arxiv.org/abs/2205.14552",
    "authors": [
      "Mayleen Cortez",
      "Matthew Eichhorn",
      "Christina Lee Yu"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2206.00786",
    "title": "Neural Decoding with Optimization of Node Activations",
    "abstract": " Comments: IEEE Communications Letters ",
    "url": "https://arxiv.org/abs/2206.00786",
    "authors": [
      "Eliya Nachmani",
      "Yair Be'ery"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.01693",
    "title": "Three-dimensional microstructure generation using generative adversarial  neural networks in the context of continuum micromechanics",
    "abstract": " Title: Three-dimensional microstructure generation using generative adversarial  neural networks in the context of continuum micromechanics ",
    "url": "https://arxiv.org/abs/2206.01693",
    "authors": [
      "Alexander Henkes",
      "Henning Wessels"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.08083",
    "title": "CARLANE: A Lane Detection Benchmark for Unsupervised Domain Adaptation  from Simulation to multiple Real-World Domains",
    "abstract": " Comments: 22 pages, 11 figures, under review at Neural Information Processing Systems Track on Datasets and Benchmarks ",
    "url": "https://arxiv.org/abs/2206.08083",
    "authors": [
      "Julian Gebele",
      "Bonifaz Stuhr",
      "Johann Haselberger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.04186",
    "title": "A Study on Self-Supervised Object Detection Pretraining",
    "abstract": " Title: A Study on Self-Supervised Object Detection Pretraining ",
    "url": "https://arxiv.org/abs/2207.04186",
    "authors": [
      "Trung Dang",
      "Simon Kornblith",
      "Huy Thong Nguyen",
      "Peter Chin",
      "Maryam Khademi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.05723",
    "title": "Latent Variable Models for Bayesian Causal Discovery",
    "abstract": " Comments: 7 figures, Published at the ICML 2022 Workshop on Spurious Correlations, Invariance, and Stability ",
    "url": "https://arxiv.org/abs/2207.05723",
    "authors": [
      "Jithendaraa Subramanian",
      "Yashas Annadani",
      "Ivaxi Sheth",
      "Stefan Bauer",
      "Derek Nowrouzezahrai",
      "Samira Ebrahimi Kahou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2207.09460",
    "title": "Money and Trust in Metaverses, Bitcoin and Stablecoins in global social  XR",
    "abstract": " Title: Money and Trust in Metaverses, Bitcoin and Stablecoins in global social  XR ",
    "url": "https://arxiv.org/abs/2207.09460",
    "authors": [
      "John Joseph O'Hare",
      "Allen Fairchild",
      "Umran Ali"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2207.09531",
    "title": "LR-Net: A Block-based Convolutional Neural Network for Low-Resolution  Image Classification",
    "abstract": " Comments: 7 pages, 5 figures and 2 tables ",
    "url": "https://arxiv.org/abs/2207.09531",
    "authors": [
      "Ashkan Ganj",
      "Mohsen Ebadpour",
      "Mahdi Darvish",
      "Hamid Bahador"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.13821",
    "title": "Multi-Objective Provisioning of Network Slices using Deep Reinforcement  Learning",
    "abstract": " Title: Multi-Objective Provisioning of Network Slices using Deep Reinforcement  Learning ",
    "url": "https://arxiv.org/abs/2207.13821",
    "authors": [
      "Chien-Cheng Wu",
      "Vasilis Friderikos",
      "Cedomir Stefanovic"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.01220",
    "title": "GeoECG: Data Augmentation via Wasserstein Geodesic Perturbation for  Robust Electrocardiogram Prediction",
    "abstract": " Comments: 26 pages, Figure 13, Machine Learning for Healthcare 2022 ",
    "url": "https://arxiv.org/abs/2208.01220",
    "authors": [
      "Jiacheng Zhu",
      "Jielin Qiu",
      "Zhuolin Yang",
      "Douglas Weber",
      "Michael A. Rosenberg",
      "Emerson Liu",
      "Bo Li",
      "Ding Zhao"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2208.03135",
    "title": "Modeling Price Elasticity for Occupancy Prediction in Hotel Dynamic  Pricing",
    "abstract": " Title: Modeling Price Elasticity for Occupancy Prediction in Hotel Dynamic  Pricing ",
    "url": "https://arxiv.org/abs/2208.03135",
    "authors": [
      "Fanwei Zhu",
      "Wendong Xiao",
      "Yao Yu",
      "Ziyi Wang",
      "Zulong Chen",
      "Quan Lu",
      "Zemin Liu",
      "Minghui Wu",
      "Shenghua Ni"
    ],
    "subjectives": [
      "General Economics (econ.GN)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03666",
    "title": "See What You See: Self-supervised Cross-modal Retrieval of Visual  Stimuli from Brain Activity",
    "abstract": " Title: See What You See: Self-supervised Cross-modal Retrieval of Visual  Stimuli from Brain Activity ",
    "url": "https://arxiv.org/abs/2208.03666",
    "authors": [
      "Zesheng Ye",
      "Lina Yao",
      "Yu Zhang",
      "Sylvia Gustin"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2208.04924",
    "title": "On the Activation Function Dependence of the Spectral Bias of Neural  Networks",
    "abstract": " Title: On the Activation Function Dependence of the Spectral Bias of Neural  Networks ",
    "url": "https://arxiv.org/abs/2208.04924",
    "authors": [
      "Qingguo Hong",
      "Qinyang Tan",
      "Jonathan W. Siegel",
      "Jinchao Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.05198",
    "title": "A Detection Method of Temporally Operated Videos Using Robust Hashing",
    "abstract": " Comments: To appear in 2022 IEEE 11th Global Conference on Consumer Electronics (GCCE 2022) ",
    "url": "https://arxiv.org/abs/2208.05198",
    "authors": [
      "Shoko Niwa",
      "Miki Tanaka",
      "Hitoshi Kiya"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]