[
  {
    "id": "arXiv:2302.07294",
    "title": "Derandomized Novelty Detection with FDR Control via Conformal E-values",
    "abstract": "Conformal prediction and other randomized model-free inference techniques are gaining increasing attention as general solutions to rigorously calibrate the output of any machine learning algorithm for novelty detection. This paper contributes to the field by developing a novel method for mitigating their algorithmic randomness, leading to an even more interpretable and reliable framework for powerful novelty detection under false discovery rate control. The idea is to leverage suitable conformal e-values instead of p-values to quantify the significance of each finding, which allows the evidence gathered from multiple mutually dependent analyses of the same data to be seamlessly aggregated. Further, the proposed method can reduce randomness without much loss of power, partly thanks to an innovative way of weighting conformal e-values based on additional side information carefully extracted from the same data. Simulations with synthetic and real data confirm this solution can be effective at eliminating random noise in the inferences obtained with state-of-the-art alternative techniques, sometimes also leading to higher power. ",
    "url": "https://arxiv.org/abs/2302.07294",
    "authors": [
      "Meshi Bashari",
      "Amir Epstein",
      "Yaniv Romano",
      "Matteo Sesia"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2302.07300",
    "title": "MSDA: Monocular Self-supervised Domain Adaptation for 6D Object Pose  Estimation",
    "abstract": "Acquiring labeled 6D poses from real images is an expensive and time-consuming task. Though massive amounts of synthetic RGB images are easy to obtain, the models trained on them suffer from noticeable performance degradation due to the synthetic-to-real domain gap. To mitigate this degradation, we propose a practical self-supervised domain adaptation approach that takes advantage of real RGB(-D) data without needing real pose labels. We first pre-train the model with synthetic RGB images and then utilize real RGB(-D) images to fine-tune the pre-trained model. The fine-tuning process is self-supervised by the RGB-based pose-aware consistency and the depth-guided object distance pseudo-label, which does not require the time-consuming online differentiable rendering. We build our domain adaptation method based on the recent pose estimator SC6D and evaluate it on the YCB-Video dataset. We experimentally demonstrate that our method achieves comparable performance against its fully-supervised counterpart while outperforming existing state-of-the-art approaches. ",
    "url": "https://arxiv.org/abs/2302.07300",
    "authors": [
      "Dingding Cai",
      "Janne Heikkilä",
      "Esa Rahtu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.07305",
    "title": "FedLE: Federated Learning Client Selection with Lifespan Extension for  Edge IoT Networks",
    "abstract": "Federated learning (FL) is a distributed and privacy-preserving learning framework for predictive modeling with massive data generated at the edge by Internet of Things (IoT) devices. One major challenge preventing the wide adoption of FL in IoT is the pervasive power supply constraints of IoT devices due to the intensive energy consumption of battery-powered clients for local training and model updates. Low battery levels of clients eventually lead to their early dropouts from edge networks, loss of training data jeopardizing the performance of FL, and their availability to perform other designated tasks. In this paper, we propose FedLE, an energy-efficient client selection framework that enables lifespan extension of edge IoT networks. In FedLE, the clients first run for a minimum epoch to generate their local model update. The models are partially uploaded to the server for calculating similarities between each pair of clients. Clustering is performed against these client pairs to identify those with similar model distributions. In each round, low-powered clients have a lower probability of being selected, delaying the draining of their batteries. Empirical studies show that FedLE outperforms baselines on benchmark datasets and lasts more training rounds than FedAvg with battery power constraints. ",
    "url": "https://arxiv.org/abs/2302.07305",
    "authors": [
      "Jiajun Wu",
      "Steve Drew",
      "Jiayu Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2302.07319",
    "title": "Frustratingly Simple but Effective Zero-shot Detection and Segmentation:  Analysis and a Strong Baseline",
    "abstract": "Methods for object detection and segmentation often require abundant instance-level annotations for training, which are time-consuming and expensive to collect. To address this, the task of zero-shot object detection (or segmentation) aims at learning effective methods for identifying and localizing object instances for the categories that have no supervision available. Constructing architectures for these tasks requires choosing from a myriad of design options, ranging from the form of the class encoding used to transfer information from seen to unseen categories, to the nature of the function being optimized for learning. In this work, we extensively study these design choices, and carefully construct a simple yet extremely effective zero-shot recognition method. Through extensive experiments on the MSCOCO dataset on object detection and segmentation, we highlight that our proposed method outperforms existing, considerably more complex, architectures. Our findings and method, which we propose as a competitive future baseline, point towards the need to revisit some of the recent design trends in zero-shot detection / segmentation. ",
    "url": "https://arxiv.org/abs/2302.07319",
    "authors": [
      "Siddhesh Khandelwal",
      "Anirudth Nambirajan",
      "Behjat Siddiquie",
      "Jayan Eledath",
      "Leonid Sigal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.07328",
    "title": "Hybrid Spiking Neural Network Fine-tuning for Hippocampus Segmentation",
    "abstract": "Over the past decade, artificial neural networks (ANNs) have made tremendous advances, in part due to the increased availability of annotated data. However, ANNs typically require significant power and memory consumptions to reach their full potential. Spiking neural networks (SNNs) have recently emerged as a low-power alternative to ANNs due to their sparsity nature. SNN, however, are not as easy to train as ANNs. In this work, we propose a hybrid SNN training scheme and apply it to segment human hippocampi from magnetic resonance images. Our approach takes ANN-SNN conversion as an initialization step and relies on spike-based backpropagation to fine-tune the network. Compared with the conversion and direct training solutions, our method has advantages in both segmentation accuracy and training efficiency. Experiments demonstrate the effectiveness of our model in achieving the design goals. ",
    "url": "https://arxiv.org/abs/2302.07328",
    "authors": [
      "Ye Yue",
      "Marc Baltes",
      "Nidal Abujahar",
      "Tao Sun",
      "Charles D. Smith",
      "Trevor Bihl",
      "Jundong Liu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2302.07337",
    "title": "Graph Attention Multi-Agent Fleet Autonomy for Advanced Air Mobility",
    "abstract": "Autonomous mobility is emerging as a new mode of urban transportation for moving cargo and passengers. However, such fleet coordination schemes face significant challenges in scaling to accommodate fast-growing fleet sizes that vary in their operational range, capacity, and communication capabilities. We introduce the concept of partially observable advanced air mobility games to coordinate a fleet of aerial vehicle agents accounting for their heterogeneity and self-interest inherent to commercial mobility fleets. We propose a novel heterogeneous graph attention-based encoder-decoder (HetGAT Enc-Dec) neural network to construct a generalizable stochastic policy stemming from the inter- and intra-agent relations within the mobility system. We train our policy by leveraging deep multi-agent reinforcement learning, allowing decentralized decision-making for the agents using their local observations. Through extensive experimentation, we show that the fleets operating under the HetGAT Enc-Dec policy outperform other state-of-the-art graph neural network-based policies by achieving the highest fleet reward and fulfillment ratios in an on-demand mobility network. ",
    "url": "https://arxiv.org/abs/2302.07337",
    "authors": [
      "Malintha Fernando",
      "Ransalu Senanayake",
      "Heeyoul Choi",
      "Martin Swany"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2302.07341",
    "title": "Cooperative Perception for Safe Control of Autonomous Vehicles under  LiDAR Spoofing Attacks",
    "abstract": "Autonomous vehicles rely on LiDAR sensors to detect obstacles such as pedestrians, other vehicles, and fixed infrastructures. LiDAR spoofing attacks have been demonstrated that either create erroneous obstacles or prevent detection of real obstacles, resulting in unsafe driving behaviors. In this paper, we propose an approach to detect and mitigate LiDAR spoofing attacks by leveraging LiDAR scan data from other neighboring vehicles. This approach exploits the fact that spoofing attacks can typically only be mounted on one vehicle at a time, and introduce additional points into the victim's scan that can be readily detected by comparison from other, non-modified scans. We develop a Fault Detection, Identification, and Isolation procedure that identifies non-existing obstacle, physical removal, and adversarial object attacks, while also estimating the actual locations of obstacles. We propose a control algorithm that guarantees that these estimated object locations are avoided. We validate our framework using a CARLA simulation study, in which we verify that our FDII algorithm correctly detects each attack pattern. ",
    "url": "https://arxiv.org/abs/2302.07341",
    "authors": [
      "Hongchao Zhang",
      "Zhouchi Li",
      "Shiyu Cheng",
      "Andrew Clark"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.07350",
    "title": "Graph schemas as abstractions for transfer learning, inference, and  planning",
    "abstract": "We propose schemas as a model for abstractions that can be used for rapid transfer learning, inference, and planning. Common structured representations of concepts and behaviors -- schemas -- have been proposed as a powerful way to encode abstractions. Latent graph learning is emerging as a new computational model of the hippocampus to explain map learning and transitive inference. We build on this work to show that learned latent graphs in these models have a slot structure -- schemas -- that allow for quick knowledge transfer across environments. In a new environment, an agent can rapidly learn new bindings between the sensory stream to multiple latent schemas and select the best fitting one to guide behavior. To evaluate these graph schemas, we use two previously published challenging tasks: the memory & planning game and one-shot StreetLearn, that are designed to test rapid task solving in novel environments. Graph schemas can be learned in far fewer episodes than previous baselines, and can model and plan in a few steps in novel variations of these tasks. We further demonstrate learning, matching, and reusing graph schemas in navigation tasks in more challenging environments with aliased observations and size variations, and show how different schemas can be composed to model larger 2D and 3D environments. ",
    "url": "https://arxiv.org/abs/2302.07350",
    "authors": [
      "J. Swaroop Guntupalli",
      "Rajkumar Vasudeva Raju",
      "Shrinu Kushagra",
      "Carter Wendelken",
      "Danny Sawyer",
      "Ishan Deshpande",
      "Guangyao Zhou",
      "Miguel Lázaro-Gredilla",
      "Dileep George"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2302.07352",
    "title": "Reachability-based Trajectory Design with Neural Implicit Safety  Constraints",
    "abstract": "Generating safe motion plans in real-time is a key requirement for deploying robot manipulators to assist humans in collaborative settings. In particular, robots must satisfy strict safety requirements to avoid self-damage or harming nearby humans. Satisfying these requirements is particularly challenging if the robot must also operate in real-time to adjust to changes in its environment.This paper addresses these challenges by proposing Reachability-based Signed Distance Functions (RDFs) as a neural implicit representation for robot safety. RDF, which can be constructed using supervised learning in a tractable fashion, accurately predicts the distance between the swept volume of a robot arm and an obstacle. RDF's inference and gradient computations are fast and scale linearly with the dimension of the system; these features enable its use within a novel real-time trajectory planning framework as a continuous-time collision-avoidance constraint. The planning method using RDF is compared to a variety of state-of-the-art techniques and is demonstrated to successfully solve challenging motion planning tasks for high-dimensional systems faster and more reliably than all tested methods. ",
    "url": "https://arxiv.org/abs/2302.07352",
    "authors": [
      "Jonathan Michaux",
      "Qingyi Chen",
      "Yongseok Kwon",
      "Ram Vasudevan"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.07360",
    "title": "Self-supervised learning of object pose estimation using keypoint  prediction",
    "abstract": "This paper describes recent developments in object specific pose and shape prediction from single images. The main contribution is a new approach to camera pose prediction by self-supervised learning of keypoints corresponding to locations on a category specific deformable shape. We designed a network to generate a proxy ground-truth heatmap from a set of keypoints distributed all over the category-specific mean shape, where each is represented by a unique color on a labeled texture. The proxy ground-truth heatmap is used to train a deep keypoint prediction network, which can be used in online inference. The proposed approach to camera pose prediction show significant improvements when compared with state-of-the-art methods. Our approach to camera pose prediction is used to infer 3D objects from 2D image frames of video sequences online. To train the reconstruction model, it receives only a silhouette mask from a single frame of a video sequence in every training step and a category-specific mean object shape. We conducted experiments using three different datasets representing the bird category: the CUB [51] image dataset, YouTubeVos and the Davis video datasets. The network is trained on the CUB dataset and tested on all three datasets. The online experiments are demonstrated on YouTubeVos and Davis [56] video sequences using a network trained on the CUB training set. ",
    "url": "https://arxiv.org/abs/2302.07360",
    "authors": [
      "Zahra Gharaee",
      "Felix Järemö Lawin",
      "Per-Erik Forssén"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07363",
    "title": "Attacking Fake News Detectors via Manipulating News Social Engagement",
    "abstract": "Social media is one of the main sources for news consumption, especially among the younger generation. With the increasing popularity of news consumption on various social media platforms, there has been a surge of misinformation which includes false information or unfounded claims. As various text- and social context-based fake news detectors are proposed to detect misinformation on social media, recent works start to focus on the vulnerabilities of fake news detectors. In this paper, we present the first adversarial attack framework against Graph Neural Network (GNN)-based fake news detectors to probe their robustness. Specifically, we leverage a multi-agent reinforcement learning (MARL) framework to simulate the adversarial behavior of fraudsters on social media. Research has shown that in real-world settings, fraudsters coordinate with each other to share different news in order to evade the detection of fake news detectors. Therefore, we modeled our MARL framework as a Markov Game with bot, cyborg, and crowd worker agents, which have their own distinctive cost, budget, and influence. We then use deep Q-learning to search for the optimal policy that maximizes the rewards. Extensive experimental results on two real-world fake news propagation datasets demonstrate that our proposed framework can effectively sabotage the GNN-based fake news detector performance. We hope this paper can provide insights for future research on fake news detection. ",
    "url": "https://arxiv.org/abs/2302.07363",
    "authors": [
      "Haoran Wang",
      "Yingtong Dou",
      "Canyu Chen",
      "Lichao Sun",
      "Philip S. Yu",
      "Kai Shu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.07371",
    "title": "AutoBiasTest: Controllable Sentence Generation for Automated and  Open-Ended Social Bias Testing in Language Models",
    "abstract": "Social bias in Pretrained Language Models (PLMs) affects text generation and other downstream NLP tasks. Existing bias testing methods rely predominantly on manual templates or on expensive crowd-sourced data. We propose a novel AutoBiasTest method that automatically generates sentences for testing bias in PLMs, hence providing a flexible and low-cost alternative. Our approach uses another PLM for generation and controls the generation of sentences by conditioning on social group and attribute terms. We show that generated sentences are natural and similar to human-produced content in terms of word length and diversity. We illustrate that larger models used for generation produce estimates of social bias with lower variance. We find that our bias scores are well correlated with manual templates, but AutoBiasTest highlights biases not captured by these templates due to more diverse and realistic test sentences. By automating large-scale test sentence generation, we enable better estimation of underlying bias distributions ",
    "url": "https://arxiv.org/abs/2302.07371",
    "authors": [
      "Rafal Kocielnik",
      "Shrimai Prabhumoye",
      "Vivian Zhang",
      "R. Michael Alvarez",
      "Anima Anandkumar"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2302.07372",
    "title": "Same Same, But Different: Conditional Multi-Task Learning for  Demographic-Specific Toxicity Detection",
    "abstract": "Algorithmic bias often arises as a result of differential subgroup validity, in which predictive relationships vary across groups. For example, in toxic language detection, comments targeting different demographic groups can vary markedly across groups. In such settings, trained models can be dominated by the relationships that best fit the majority group, leading to disparate performance. We propose framing toxicity detection as multi-task learning (MTL), allowing a model to specialize on the relationships that are relevant to each demographic group while also leveraging shared properties across groups. With toxicity detection, each task corresponds to identifying toxicity against a particular demographic group. However, traditional MTL requires labels for all tasks to be present for every data point. To address this, we propose Conditional MTL (CondMTL), wherein only training examples relevant to the given demographic group are considered by the loss function. This lets us learn group specific representations in each branch which are not cross contaminated by irrelevant labels. Results on synthetic and real data show that using CondMTL improves predictive recall over various baselines in general and for the minority demographic group in particular, while having similar overall accuracy. ",
    "url": "https://arxiv.org/abs/2302.07372",
    "authors": [
      "Soumyajit Gupta",
      "Sooyong Lee",
      "Maria De-Arteaga",
      "Matthew Lease"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.07384",
    "title": "The Geometry of Neural Nets' Parameter Spaces Under Reparametrization",
    "abstract": "Model reparametrization -- transforming the parameter space via a bijective differentiable map -- is a popular way to improve the training of neural networks. But reparametrizations have also been problematic since they induce inconsistencies in, e.g., Hessian-based flatness measures, optimization trajectories, and modes of probability density functions. This complicates downstream analyses, e.g. one cannot make a definitive statement about the connection between flatness and generalization. In this work, we study the invariance quantities of neural nets under reparametrization from the perspective of Riemannian geometry. We show that this notion of invariance is an inherent property of any neural net, as long as one acknowledges the assumptions about the metric that is always present, albeit often implicitly, and uses the correct transformation rules under reparametrization. We present discussions on measuring the flatness of minima, in optimization, and in probability-density maximization, along with applications in studying the biases of optimizers and in Bayesian inference. ",
    "url": "https://arxiv.org/abs/2302.07384",
    "authors": [
      "Agustinus Kristiadi",
      "Felix Dangel",
      "Philipp Hennig"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.07396",
    "title": "Convolutional unitary or orthogonal recurrent neural networks",
    "abstract": "Recurrent neural networks are extremely powerful yet hard to train. One of their issues is the vanishing gradient problem, whereby propagation of training signals may be exponentially attenuated, freezing training. Use of orthogonal or unitary matrices, whose powers neither explode nor decay, has been proposed to mitigate this issue, but their computational expense has hindered their use. Here we show that in the specific case of convolutional RNNs, we can define a convolutional exponential and that this operation transforms antisymmetric or anti-Hermitian convolution kernels into orthogonal or unitary convolution kernels. We explicitly derive FFT-based algorithms to compute the kernels and their derivatives. The computational complexity of parametrizing this subspace of orthogonal transformations is thus the same as the networks' iteration. ",
    "url": "https://arxiv.org/abs/2302.07396",
    "authors": [
      "Marcelo O. Magnasco"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Artificial Intelligence (cs.AI)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2302.07405",
    "title": "Unsupervised physics-informed neural network in reaction-diffusion  biology models (Ulcerative colitis and Crohn's disease cases) A preliminary  study",
    "abstract": "We propose to explore the potential of physics-informed neural networks (PINNs) in solving a class of partial differential equations (PDEs) used to model the propagation of chronic inflammatory bowel diseases, such as Crohn's disease and ulcerative colitis. An unsupervised approach was privileged during the deep neural network training. Given the complexity of the underlying biological system, characterized by intricate feedback loops and limited availability of high-quality data, the aim of this study is to explore the potential of PINNs in solving PDEs. In addition to providing this exploratory assessment, we also aim to emphasize the principles of reproducibility and transparency in our approach, with a specific focus on ensuring the robustness and generalizability through the use of artificial intelligence. We will quantify the relevance of the PINN method with several linear and non-linear PDEs in relation to biology. However, it is important to note that the final solution is dependent on the initial conditions, chosen boundary conditions, and neural network architectures. ",
    "url": "https://arxiv.org/abs/2302.07405",
    "authors": [
      "Ahmed Rebai",
      "Louay Boukhris",
      "Radhi Toujani",
      "Ahmed Gueddiche",
      "Fayad Ali Banna",
      "Fares Souissi",
      "Ahmed Lasram",
      "Elyes Ben Rayana",
      "Hatem Zaag"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Analysis of PDEs (math.AP)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2302.07416",
    "title": "Deep Convolutional Neural Network for Plume Rise Measurements in  Industrial Environments",
    "abstract": "The estimation of plume cloud height is essential for air-quality transport models, local environmental assessment cases, and global climate models. When pollutants are released by a smokestack, plume rise is the constant height at which the plume cloud is carried downwind as its momentum dissipates and the temperatures of the plume cloud and the ambient equalize. Although different parameterizations and equations are used in most air quality models to predict plume rise, verification of these parameterizations has been limited in the past three decades. Beyond validation, there is also value in real-time measurement of plume rise to improve the accuracy of air quality forecasting. In this paper, we propose a low-cost measurement technology that can monitor smokestack plumes and make long-term, real-time measurements of plume rise, improving predictability. To do this, a two-stage method is developed based on deep convolutional neural networks. In the first stage, an improved Mask R-CNN is applied to detect the plume cloud borders and distinguish the plume from its background and other objects. This proposed model is called Deep Plume Rise Net (DPRNet). In the second stage, a geometric transformation phase is applied through the wind direction information from a nearby monitoring station to obtain real-life measurements of different parameters. Finally, the plume cloud boundaries are obtained to calculate the plume rise. Various images with different atmospheric conditions, including day, night, cloudy, and foggy, have been selected for DPRNet training algorithm. Obtained results show the proposed method outperforms widely-used networks in plume cloud border detection and recognition. ",
    "url": "https://arxiv.org/abs/2302.07416",
    "authors": [
      "Mohammad Koushafar",
      "Gunho Sohn",
      "Mark Gordon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07425",
    "title": "Bandit Social Learning: Exploration under Myopic Behavior",
    "abstract": "We study social learning dynamics where the agents collectively follow a simple multi-armed bandit protocol. Agents arrive sequentially, choose arms and receive associated rewards. Each agent observes the full history (arms and rewards) of the previous agents, and there are no private signals. While collectively the agents face exploration-exploitation tradeoff, each agent acts myopically, without regards to exploration. Motivating scenarios concern reviews and ratings on online platforms. We allow a wide range of myopic behaviors that are consistent with (parameterized) confidence intervals, including the \"unbiased\" behavior as well as various behaviorial biases. While extreme versions of these behaviors correspond to well-known bandit algorithms, we prove that more moderate versions lead to stark exploration failures, and consequently to regret rates that are linear in the number of agents. We provide matching upper bounds on regret by analyzing \"moderately optimistic\" agents. As a special case of independent interest, we obtain a general result on failure of the greedy algorithm in multi-armed bandits. This is the first such result in the literature, to the best of our knowledge ",
    "url": "https://arxiv.org/abs/2302.07425",
    "authors": [
      "Kiarash Banihashem",
      "MohammadTaghi Hajiaghayi",
      "Suho Shin",
      "Aleksandrs Slivkins"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07426",
    "title": "Efficiently Learning Neural Networks: What Assumptions May Suffice?",
    "abstract": "Understanding when neural networks can be learned efficiently is a fundamental question in learning theory. Existing hardness results suggest that assumptions on both the input distribution and the network's weights are necessary for obtaining efficient algorithms. Moreover, it was previously shown that depth-$2$ networks can be efficiently learned under the assumptions that the input distribution is Gaussian, and the weight matrix is non-degenerate. In this work, we study whether such assumptions may suffice for learning deeper networks and prove negative results. We show that learning depth-$3$ ReLU networks under the Gaussian input distribution is hard even in the smoothed-analysis framework, where a random noise is added to the network's parameters. It implies that learning depth-$3$ ReLU networks under the Gaussian distribution is hard even if the weight matrices are non-degenerate. Moreover, we consider depth-$2$ networks, and show hardness of learning in the smoothed-analysis framework, where both the network parameters and the input distribution are smoothed. Our hardness results are under a well-studied assumption on the existence of local pseudorandom generators. ",
    "url": "https://arxiv.org/abs/2302.07426",
    "authors": [
      "Amit Daniely",
      "Nathan Srebro",
      "Gal Vardi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.07427",
    "title": "Studying the effect of AI Code Generators on Supporting Novice Learners  in Introductory Programming",
    "abstract": "AI code generators like OpenAI Codex have the potential to assist novice programmers by generating code from natural language descriptions, however, over-reliance might negatively impact learning and retention. To explore the implications that AI code generators have on introductory programming, we conducted a controlled experiment with 69 novices (ages 10-17). Learners worked on 45 Python code-authoring tasks, for which half of the learners had access to Codex, each followed by a code-modification task. Our results show that using Codex significantly increased code-authoring performance (1.15x increased completion rate and 1.8x higher scores) while not decreasing performance on manual code-modification tasks. Additionally, learners with access to Codex during the training phase performed slightly better on the evaluation post-tests conducted one week later, although this difference did not reach statistical significance. Of interest, learners with higher Scratch pre-test scores performed significantly better on retention post-tests, if they had prior access to Codex. ",
    "url": "https://arxiv.org/abs/2302.07427",
    "authors": [
      "Majeed Kazemitabaar",
      "Justin Chow",
      "Carl Ka To Ma",
      "Barbara J. Ericson",
      "David Weintrop",
      "Tovi Grossman"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2302.07429",
    "title": "Dual Graph Multitask Framework for Imbalanced Delivery Time Estimation",
    "abstract": "Delivery Time Estimation (DTE) is a crucial component of the e-commerce supply chain that predicts delivery time based on merchant information, sending address, receiving address, and payment time. Accurate DTE can boost platform revenue and reduce customer complaints and refunds. However, the imbalanced nature of industrial data impedes previous models from reaching satisfactory prediction performance. Although imbalanced regression methods can be applied to the DTE task, we experimentally find that they improve the prediction performance of low-shot data samples at the sacrifice of overall performance. To address the issue, we propose a novel Dual Graph Multitask framework for imbalanced Delivery Time Estimation (DGM-DTE). Our framework first classifies package delivery time as head and tail data. Then, a dual graph-based model is utilized to learn representations of the two categories of data. In particular, DGM-DTE re-weights the embedding of tail data by estimating its kernel density. We fuse two graph-based representations to capture both high- and low-shot data representations. Experiments on real-world Taobao logistics datasets demonstrate the superior performance of DGM-DTE compared to baselines. ",
    "url": "https://arxiv.org/abs/2302.07429",
    "authors": [
      "Lei Zhang",
      "Mingliang Wang",
      "Xin Zhou",
      "Xingyu Wu",
      "Yiming Cao",
      "Yonghui Xu",
      "Lizhen Cui",
      "Zhiqi Shen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2302.07445",
    "title": "Silent Vulnerable Dependency Alert Prediction with Vulnerability Key  Aspect Explanation",
    "abstract": "Due to convenience, open-source software is widely used. For beneficial reasons, open-source maintainers often fix the vulnerabilities silently, exposing their users unaware of the updates to threats. Previous works all focus on black-box binary detection of the silent dependency alerts that suffer from high false-positive rates. Open-source software users need to analyze and explain AI prediction themselves. Explainable AI becomes remarkable as a complementary of black-box AI models, providing details in various forms to explain AI decisions. Noticing there is still no technique that can discover silent dependency alert on time, in this work, we propose a framework using an encoder-decoder model with a binary detector to provide explainable silent dependency alert prediction. Our model generates 4 types of vulnerability key aspects including vulnerability type, root cause, attack vector, and impact to enhance the trustworthiness and users' acceptance to alert prediction. By experiments with several models and inputs, we confirm CodeBERT with both commit messages and code changes achieves the best results. Our user study shows that explainable alert predictions can help users find silent dependency alert more easily than black-box predictions. To the best of our knowledge, this is the first research work on the application of Explainable AI in silent dependency alert prediction, which opens the door of the related domains. ",
    "url": "https://arxiv.org/abs/2302.07445",
    "authors": [
      "Jiamou Sun",
      "Zhenchang Xing",
      "Qinghua Lu",
      "Xiwei Xu",
      "Liming Zhu",
      "Thong Hoang",
      "Dehai Zhao"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2302.07452",
    "title": "How to Train Your DRAGON: Diverse Augmentation Towards Generalizable  Dense Retrieval",
    "abstract": "Various techniques have been developed in recent years to improve dense retrieval (DR), such as unsupervised contrastive learning and pseudo-query generation. Existing DRs, however, often suffer from effectiveness tradeoffs between supervised and zero-shot retrieval, which some argue was due to the limited model capacity. We contradict this hypothesis and show that a generalizable DR can be trained to achieve high accuracy in both supervised and zero-shot retrieval without increasing model size. In particular, we systematically examine the contrastive learning of DRs, under the framework of Data Augmentation (DA). Our study shows that common DA practices such as query augmentation with generative models and pseudo-relevance label creation using a cross-encoder, are often inefficient and sub-optimal. We hence propose a new DA approach with diverse queries and sources of supervision to progressively train a generalizable DR. As a result, DRAGON, our dense retriever trained with diverse augmentation, is the first BERT-base-sized DR to achieve state-of-the-art effectiveness in both supervised and zero-shot evaluations and even competes with models using more complex late interaction (ColBERTv2 and SPLADE++). ",
    "url": "https://arxiv.org/abs/2302.07452",
    "authors": [
      "Sheng-Chieh Lin",
      "Akari Asai",
      "Minghan Li",
      "Barlas Oguz",
      "Jimmy Lin",
      "Yashar Mehdad",
      "Wen-tau Yih",
      "Xilun Chen"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.07455",
    "title": "A lightweight network for photovoltaic cell defect detection in  electroluminescence images based on neural architecture search and knowledge  distillation",
    "abstract": "Nowadays, the rapid development of photovoltaic(PV) power stations requires increasingly reliable maintenance and fault diagnosis of PV modules in the field. Due to the effectiveness, convolutional neural network (CNN) has been widely used in the existing automatic defect detection of PV cells. However, the parameters of these CNN-based models are very large, which require stringent hardware resources and it is difficult to be applied in actual industrial projects. To solve these problems, we propose a novel lightweight high-performance model for automatic defect detection of PV cells in electroluminescence(EL) images based on neural architecture search and knowledge distillation. To auto-design an effective lightweight model, we introduce neural architecture search to the field of PV cell defect classification for the first time. Since the defect can be any size, we design a proper search structure of network to better exploit the multi-scale characteristic. To improve the overall performance of the searched lightweight model, we further transfer the knowledge learned by the existing pre-trained large-scale model based on knowledge distillation. Different kinds of knowledge are exploited and transferred, including attention information, feature information, logit information and task-oriented information. Experiments have demonstrated that the proposed model achieves the state-of-the-art performance on the public PV cell dataset of EL images under online data augmentation with accuracy of 91.74% and the parameters of 1.85M. The proposed lightweight high-performance model can be easily deployed to the end devices of the actual industrial projects and retain the accuracy. ",
    "url": "https://arxiv.org/abs/2302.07455",
    "authors": [
      "Jinxia Zhang",
      "Xinyi Chen",
      "Haikun Wei",
      "Kanjian Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.07458",
    "title": "CUTS: Neural Causal Discovery from Irregular Time-Series Data",
    "abstract": "Causal discovery from time-series data has been a central task in machine learning. Recently, Granger causality inference is gaining momentum due to its good explainability and high compatibility with emerging deep neural networks. However, most existing methods assume structured input data and degenerate greatly when encountering data with randomly missing entries or non-uniform sampling frequencies, which hampers their applications in real scenarios. To address this issue, here we present CUTS, a neural Granger causal discovery algorithm to jointly impute unobserved data points and build causal graphs, via plugging in two mutually boosting modules in an iterative framework: (i) Latent data prediction stage: designs a Delayed Supervision Graph Neural Network (DSGNN) to hallucinate and register unstructured data which might be of high dimension and with complex distribution; (ii) Causal graph fitting stage: builds a causal adjacency matrix with imputed data under sparse penalty. Experiments show that CUTS effectively infers causal graphs from unstructured time-series data, with significantly superior performance to existing methods. Our approach constitutes a promising step towards applying causal discovery to real applications with non-ideal observations. ",
    "url": "https://arxiv.org/abs/2302.07458",
    "authors": [
      "Yuxiao Cheng",
      "Runzhao Yang",
      "Tingxiong Xiao",
      "Zongren Li",
      "Jinli Suo",
      "Kunlun He",
      "Qionghai Dai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2302.07469",
    "title": "Robust Safety under Stochastic Uncertainty with Discrete-Time Control  Barrier Functions",
    "abstract": "Robots deployed in unstructured, real-world environments operate under considerable uncertainty due to imperfect state estimates, model error, and disturbances. Given this real-world context, the goal of this paper is to develop controllers that are provably safe under uncertainties. To this end, we leverage Control Barrier Functions (CBFs) which guarantee that a robot remains in a ``safe set'' during its operation -- yet CBFs (and their associated guarantees) are traditionally studied in the context of continuous-time, deterministic systems with bounded uncertainties. In this work, we study the safety properties of discrete-time CBFs (DTCBFs) for systems with discrete-time dynamics and unbounded stochastic disturbances. Using tools from martingale theory, we develop probabilistic bounds for the safety (over a finite time horizon) of systems whose dynamics satisfy the discrete-time barrier function condition in expectation, and analyze the effect of Jensen's inequality on DTCBF-based controllers. Finally, we present several examples of our method synthesizing safe control inputs for systems subject to significant process noise, including an inverted pendulum, a double integrator, and a quadruped locomoting on a narrow path. ",
    "url": "https://arxiv.org/abs/2302.07469",
    "authors": [
      "Ryan K. Cosner",
      "Preston Culbertson",
      "Andrew J. Taylor",
      "Aaron D. Ames"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.07491",
    "title": "Self-Supervised Temporal Graph learning with Temporal and Structural  Intensity Alignment",
    "abstract": "Temporal graph learning aims to generate high-quality representations for graph-based tasks along with dynamic information, which has recently drawn increasing attention. Unlike the static graph, a temporal graph is usually organized in the form of node interaction sequences over continuous time instead of an adjacency matrix. Most temporal graph learning methods model current interactions by combining historical information over time. However, such methods merely consider the first-order temporal information while ignoring the important high-order structural information, leading to sub-optimal performance. To solve this issue, by extracting both temporal and structural information to learn more informative node representations, we propose a self-supervised method termed S2T for temporal graph learning. Note that the first-order temporal information and the high-order structural information are combined in different ways by the initial node representations to calculate two conditional intensities, respectively. Then the alignment loss is introduced to optimize the node representations to be more informative by narrowing the gap between the two intensities. Concretely, besides modeling temporal information using historical neighbor sequences, we further consider the structural information from both local and global levels. At the local level, we generate structural intensity by aggregating features from the high-order neighbor sequences. At the global level, a global representation is generated based on all nodes to adjust the structural intensity according to the active statuses on different nodes. Extensive experiments demonstrate that the proposed method S2T achieves at most 10.13% performance improvement compared with the state-of-the-art competitors on several datasets. ",
    "url": "https://arxiv.org/abs/2302.07491",
    "authors": [
      "Meng Liu",
      "Ke Liang",
      "Bin Xiao",
      "Sihang Zhou",
      "Wenxuan Tu",
      "Yue Liu",
      "Xihong Yang",
      "Xinwang Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.07511",
    "title": "Consensus-based Networked Tracking in Presence of Heterogeneous  Time-Delays",
    "abstract": "We propose a distributed (single) target tracking scheme based on networked estimation and consensus algorithms over static sensor networks. The tracking part is based on linear time-difference-of-arrival (TDOA) measurement proposed in our previous works. This paper, in particular, develops delay-tolerant distributed filtering solutions over sparse data-transmission networks. We assume general arbitrary heterogeneous delays at different links. This may occur in many realistic large-scale applications where the data-sharing between different nodes is subject to latency due to communication-resource constraints or large spatially distributed sensor networks. The solution we propose in this work shows improved performance (verified by both theory and simulations) in such scenarios. Another privilege of such distributed schemes is the possibility to add localized fault-detection and isolation (FDI) strategies along with survivable graph-theoretic design, which opens many follow-up venues to this research. To our best knowledge no such delay-tolerant distributed linear algorithm is given in the existing distributed tracking literature. ",
    "url": "https://arxiv.org/abs/2302.07511",
    "authors": [
      "Mohammadreza Doostmohammadian",
      "Mohammad Pirani",
      "Usman A. Khan"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Signal Processing (eess.SP)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2302.07512",
    "title": "Path-sensitive Type Analysis with Backward Analysis for Quality  Assurance of Dynamic Typed Language Code",
    "abstract": "Precise and fast static type analysis for dynamically typed language is very difficult. This is mainly because the lack of static type information makes it difficult to approximate all possible values of a variable. Actually, the existing static type analysis methods are imprecise or slow. In this paper, we propose a novel method to improve the precision of static type analysis for Python code, where a backward analysis is used to obtain the path-sensitivity. By doing so, our method aims to obtain more precise static type information, which contributes to the overall improvement of static analysis. To show the effectiveness of our method, we conducted a preliminary experiment to compare our method implementation and the existing analysis tool with respect to precision and time efficiency. The result shows our method provides more precise type analysis with fewer false positives than the existing static type analysis tool. Also it shows our proposed method increases the analysis time, but it is still within the range of practical use. ",
    "url": "https://arxiv.org/abs/2302.07512",
    "authors": [
      "Ryutaro Kodama",
      "Yoshitaka Arahori",
      "Kathuhiko Gondow"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2302.07513",
    "title": "Design, Performance, and Complexity of CRC-Aided List Decoding of  Convolutional and Polar Codes for Short Messages",
    "abstract": "Motivated by the need to communicate short control messages in 5G and beyond, this paper carefully designs codes for cyclic redundancy check (CRC)-aided list decoding of tail-biting convolutional codes (TBCCs) and polar codes. Both codes send a 32-bit message using an 11-bit CRC and 512 transmitted bits. We aim to provide a careful, fair comparison of the error performance and decoding complexity of polar and TBCC techniques for a specific case. Specifically, a TBCC is designed to match the rate of a (512, 43) polar code, and optimal 11-bit CRCs for both codes are designed. The paper examines the distance spectra of the polar and TBCC codes, illuminating the different distance structures for the two code types. We consider both adaptive and non-adaptive CRC-aided list decoding schemes. For polar codes, an adaptive decoder must start with a larger list size to avoid an error floor. For rate-32/512 codes with an 11-bit CRC, the optimized CRC-TBCC design achieves a lower total failure rate than the optimized CRC-polar design. Simulations showed that the optimized CRC-TBCC design achieved significantly higher throughput than the optimized CRC-polar design, so that the TBCC solution achieved a lower total failure rate while requiring less computational complexity. ",
    "url": "https://arxiv.org/abs/2302.07513",
    "authors": [
      "Jacob King",
      "Hanwen Yao",
      "William Ryan",
      "Richard D. Wesel"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2302.07524",
    "title": "Revisiting Initializing Then Refining: An Incomplete and Missing Graph  Imputation Network",
    "abstract": "With the development of various applications, such as social networks and knowledge graphs, graph data has been ubiquitous in the real world. Unfortunately, graphs usually suffer from being absent due to privacy-protecting policies or copyright restrictions during data collection. The absence of graph data can be roughly categorized into attribute-incomplete and attribute-missing circumstances. Specifically, attribute-incomplete indicates that a part of the attribute vectors of all nodes are incomplete, while attribute-missing indicates that the whole attribute vectors of partial nodes are missing. Although many efforts have been devoted, none of them is custom-designed for a common situation where both types of graph data absence exist simultaneously. To fill this gap, we develop a novel network termed Revisiting Initializing Then Refining (RITR), where we complete both attribute-incomplete and attribute-missing samples under the guidance of a novel initializing-then-refining imputation criterion. Specifically, to complete attribute-incomplete samples, we first initialize the incomplete attributes using Gaussian noise before network learning, and then introduce a structure-attribute consistency constraint to refine incomplete values by approximating a structure-attribute correlation matrix to a high-order structural matrix. To complete attribute-missing samples, we first adopt structure embeddings of attribute-missing samples as the embedding initialization, and then refine these initial values by adaptively aggregating the reliable information of attribute-incomplete samples according to a dynamic affinity structure. To the best of our knowledge, this newly designed method is the first unsupervised framework dedicated to handling hybrid-absent graphs. Extensive experiments on four datasets have verified that our methods consistently outperform existing state-of-the-art competitors. ",
    "url": "https://arxiv.org/abs/2302.07524",
    "authors": [
      "Wenxuan Tu",
      "Bin Xiao",
      "Xinwang Liu",
      "Sihang Zhou",
      "Zhiping Cai",
      "Jieren Cheng"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07530",
    "title": "Feature-Enhanced Network with Hybrid Debiasing Strategies for Unbiased  Learning to Rank",
    "abstract": "Unbiased learning to rank (ULTR) aims to mitigate various biases existing in user clicks, such as position bias, trust bias, presentation bias, and learn an effective ranker. In this paper, we introduce our winning approach for the \"Unbiased Learning to Rank\" task in WSDM Cup 2023. We find that the provided data is severely biased so neural models trained directly with the top 10 results with click information are unsatisfactory. So we extract multiple heuristic-based features for multi-fields of the results, adjust the click labels, add true negatives, and re-weight the samples during model training. Since the propensities learned by existing ULTR methods are not decreasing w.r.t. positions, we also calibrate the propensities according to the click ratios and ensemble the models trained in two different ways. Our method won the 3rd prize with a DCG@10 score of 9.80, which is 1.1% worse than the 2nd and 25.3% higher than the 4th. ",
    "url": "https://arxiv.org/abs/2302.07530",
    "authors": [
      "Lulu Yu",
      "Yiting Wang",
      "Xiaojie Sun",
      "Keping Bi",
      "Jiafeng Guo"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2302.07566",
    "title": "Qualitative Data Augmentation for Performance Prediction in VLSI  circuits",
    "abstract": "Various studies have shown the advantages of using Machine Learning (ML) techniques for analog and digital IC design automation and optimization. Data scarcity is still an issue for electronic designs, while training highly accurate ML models. This work proposes generating and evaluating artificial data using generative adversarial networks (GANs) for circuit data to aid and improve the accuracy of ML models trained with a small training data set. The training data is obtained by various simulations in the Cadence Virtuoso, HSPICE, and Microcap design environment with TSMC 180nm and 22nm CMOS technology nodes. The artificial data is generated and tested for an appropriate set of analog and digital circuits. The experimental results show that the proposed artificial data generation significantly improves ML models and reduces the percentage error by more than 50\\% of the original percentage error, which were previously trained with insufficient data. Furthermore, this research aims to contribute to the extensive application of AI/ML in the field of VLSI design and technology by relieving the training data availability-related challenges. ",
    "url": "https://arxiv.org/abs/2302.07566",
    "authors": [
      "Prasha Srivastava",
      "Pawan Kumar",
      "Zia Abbas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07577",
    "title": "Efficient Teacher: Semi-Supervised Object Detection for YOLOv5",
    "abstract": "Semi-Supervised Object Detection (SSOD) has been successful in improving the performance of both R-CNN series and anchor-free detectors. However, one-stage anchor-based detectors lack the structure to generate high-quality or flexible pseudo labels, leading to serious inconsistency problems in SSOD, such as YOLOv5. In this paper, we propose the Efficient Teacher framework for scalable and effective one-stage anchor-based SSOD training, consisting of Dense Detector, Pseudo Label Assigner, and Epoch Adaptor. Dense Detector is a baseline model that extends RetinaNet with dense sampling techniques inspired by YOLOv5. The Efficient Teacher framework introduces a novel pseudo label assignment mechanism, named Pseudo Label Assigner, which makes more refined use of pseudo labels from Dense Detector. Epoch Adaptor is a method that enables a stable and efficient end-to-end semi-supervised training schedule for Dense Detector. The Pseudo Label Assigner prevents the occurrence of bias caused by a large number of low-quality pseudo labels that may interfere with the Dense Detector during the student-teacher mutual learning mechanism, and the Epoch Adaptor utilizes domain and distribution adaptation to allow Dense Detector to learn globally distributed consistent features, making the training independent of the proportion of labeled data. Our experiments show that the Efficient Teacher framework achieves state-of-the-art results on VOC, COCO-standard, and COCO-additional using fewer FLOPs than previous methods. To the best of our knowledge, this is the first attempt to apply Semi-Supervised Object Detection to YOLOv5. ",
    "url": "https://arxiv.org/abs/2302.07577",
    "authors": [
      "Bowen Xu",
      "Mingtao Chen",
      "Wenlong Guan",
      "Lulu Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.07579",
    "title": "Semi-Supervised Deep Regression with Uncertainty Consistency and  Variational Model Ensembling via Bayesian Neural Networks",
    "abstract": "Deep regression is an important problem with numerous applications. These range from computer vision tasks such as age estimation from photographs, to medical tasks such as ejection fraction estimation from echocardiograms for disease tracking. Semi-supervised approaches for deep regression are notably under-explored compared to classification and segmentation tasks, however. Unlike classification tasks, which rely on thresholding functions for generating class pseudo-labels, regression tasks use real number target predictions directly as pseudo-labels, making them more sensitive to prediction quality. In this work, we propose a novel approach to semi-supervised regression, namely Uncertainty-Consistent Variational Model Ensembling (UCVME), which improves training by generating high-quality pseudo-labels and uncertainty estimates for heteroscedastic regression. Given that aleatoric uncertainty is only dependent on input data by definition and should be equal for the same inputs, we present a novel uncertainty consistency loss for co-trained models. Our consistency loss significantly improves uncertainty estimates and allows higher quality pseudo-labels to be assigned greater importance under heteroscedastic regression. Furthermore, we introduce a novel variational model ensembling approach to reduce prediction noise and generate more robust pseudo-labels. We analytically show our method generates higher quality targets for unlabeled data and further improves training. Experiments show that our method outperforms state-of-the-art alternatives on different tasks and can be competitive with supervised methods that use full labels. Our code is available at https://github.com/xmed-lab/UCVME. ",
    "url": "https://arxiv.org/abs/2302.07579",
    "authors": [
      "Weihang Dai",
      "Xiaomeng Li",
      "Kwang-Ting Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.07583",
    "title": "ForceFormer: Exploring Social Force and Transformer for Pedestrian  Trajectory Prediction",
    "abstract": "Predicting trajectories of pedestrians based on goal information in highly interactive scenes is a crucial step toward Intelligent Transportation Systems and Autonomous Driving. The challenges of this task come from two key sources: (1) complex social interactions in high pedestrian density scenarios and (2) limited utilization of goal information to effectively associate with past motion information. To address these difficulties, we integrate social forces into a Transformer-based stochastic generative model backbone and propose a new goal-based trajectory predictor called ForceFormer. Differentiating from most prior works that simply use the destination position as an input feature, we leverage the driving force from the destination to efficiently simulate the guidance of a target on a pedestrian. Additionally, repulsive forces are used as another input feature to describe the avoidance action among neighboring pedestrians. Extensive experiments show that our proposed method achieves on-par performance measured by distance errors with the state-of-the-art models but evidently decreases collisions, especially in dense pedestrian scenarios on widely used pedestrian datasets. ",
    "url": "https://arxiv.org/abs/2302.07583",
    "authors": [
      "Weicheng Zhang",
      "Hao Cheng",
      "Fatema T. Johora",
      "Monika Sester"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multiagent Systems (cs.MA)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.07586",
    "title": "Vulnerability Analysis of Digital Banks' Mobile Applications",
    "abstract": "There is a rapid increase in the number of mobile banking applications' users due to an increase in smart mobile devices. Mobile banking is a financial transaction and service offered through mobile devices. Almost all financial institutions now provide mobile banking services to their customers. However, the security of mobile banking applications is of huge concern because of the amount of personal data and information they collect. If an attacker gets hold of personal information, they can access bank payment or card accounts. This research aims to analyze the vulnerability of the UK digital banks' applications to identify vulnerabilities in the apps and proffer countermeasures that can help improve the security of the bank applications. Androbugs, a vulnerability scanner, was used to analyze the vulnerability of six digital banks' android applications. Starling, Monese, Atom bank, Transferwise, Monzo, and Revolut were scanned. All the scanned digital banks' applications have vulnerabilities; however, some have more vulnerabilities than others. For example, Revolut's mobile application has the highest number of identified vulnerabilities. Therefore, there is need for more security in the digital banks' applications as well as other mobile banking applications. ",
    "url": "https://arxiv.org/abs/2302.07586",
    "authors": [
      "Polra Victor Falade",
      "Grace Bunmi Ogundele"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.07588",
    "title": "Word class representations spontaneously emerge in a deep neural network  trained on next word prediction",
    "abstract": "How do humans learn language, and can the first language be learned at all? These fundamental questions are still hotly debated. In contemporary linguistics, there are two major schools of thought that give completely opposite answers. According to Chomsky's theory of universal grammar, language cannot be learned because children are not exposed to sufficient data in their linguistic environment. In contrast, usage-based models of language assume a profound relationship between language structure and language use. In particular, contextual mental processing and mental representations are assumed to have the cognitive capacity to capture the complexity of actual language use at all levels. The prime example is syntax, i.e., the rules by which words are assembled into larger units such as sentences. Typically, syntactic rules are expressed as sequences of word classes. However, it remains unclear whether word classes are innate, as implied by universal grammar, or whether they emerge during language acquisition, as suggested by usage-based approaches. Here, we address this issue from a machine learning and natural language processing perspective. In particular, we trained an artificial deep neural network on predicting the next word, provided sequences of consecutive words as input. Subsequently, we analyzed the emerging activation patterns in the hidden layers of the neural network. Strikingly, we find that the internal representations of nine-word input sequences cluster according to the word class of the tenth word to be predicted as output, even though the neural network did not receive any explicit information about syntactic rules or word classes during training. This surprising result suggests, that also in the human brain, abstract representational categories such as word classes may naturally emerge as a consequence of predictive coding and processing during language acquisition. ",
    "url": "https://arxiv.org/abs/2302.07588",
    "authors": [
      "Kishore Surendra",
      "Achim Schilling",
      "Paul Stoewer",
      "Andreas Maier",
      "Patrick Krauss"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2302.07589",
    "title": "ARGUS: Context-Based Detection of Stealthy IoT Infiltration Attacks",
    "abstract": "IoT application domains, device diversity and connectivity are rapidly growing. IoT devices control various functions in smart homes and buildings, smart cities, and smart factories, making these devices an attractive target for attackers. On the other hand, the large variability of different application scenarios and inherent heterogeneity of devices make it very challenging to reliably detect abnormal IoT device behaviors and distinguish these from benign behaviors. Existing approaches for detecting attacks are mostly limited to attacks directly compromising individual IoT devices, or, require predefined detection policies. They cannot detect attacks that utilize the control plane of the IoT system to trigger actions in an unintended/malicious context, e.g., opening a smart lock while the smart home residents are absent. In this paper, we tackle this problem and propose ARGUS, the first self-learning intrusion detection system for detecting contextual attacks on IoT environments, in which the attacker maliciously invokes IoT device actions to reach its goals. ARGUS monitors the contextual setting based on the state and actions of IoT devices in the environment. An unsupervised Deep Neural Network (DNN) is used for modeling the typical contextual device behavior and detecting actions taking place in abnormal contextual settings. This unsupervised approach ensures that ARGUS is not restricted to detecting previously known attacks but is also able to detect new attacks. We evaluated ARGUS on heterogeneous real-world smart-home settings and achieve at least an F1-Score of 99.64% for each setup, with a false positive rate (FPR) of at most 0.03%. ",
    "url": "https://arxiv.org/abs/2302.07589",
    "authors": [
      "Phillip Rieger",
      "Marco Chilese",
      "Reham Mohamed",
      "Markus Miettinen",
      "Hossein Fereidooni",
      "Ahmad-Reza Sadeghi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07605",
    "title": "Prescribed Time Time-varying Output Formation Tracking for Uncertain  Heterogeneous Multi-agent Systems",
    "abstract": "The time-varying output formation tracking for the heterogeneous multi-agent systems (MAS) is investigated in this paper. First, a distributed observer is constructed for followers to estimate the states of the leader, which can ensure that the estimation error converges to the origin in the prescribed time. Then, the local formation controller is designed for each follower based on the estimation of the observer, under which, the formation errors converge to the origin in the prescribed time as well. That is, the settling time of the whole system can be predefined in advance. It's noted that not only the uncertainties in the state matrix but also the uncertainties in the input matrix are considered, which makes the problem more practical. Last, a simulation is performed to show the effectiveness of the proposed approach. ",
    "url": "https://arxiv.org/abs/2302.07605",
    "authors": [
      "Binghe An",
      "Bo Wang",
      "Huijin Fan",
      "Lei Liu",
      "Yongji Wang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.07608",
    "title": "Uncertainty-Estimation with Normalized Logits for Out-of-Distribution  Detection",
    "abstract": "Out-of-distribution (OOD) detection is critical for preventing deep learning models from making incorrect predictions to ensure the safety of artificial intelligence systems. Especially in safety-critical applications such as medical diagnosis and autonomous driving, the cost of incorrect decisions is usually unbearable. However, neural networks often suffer from the overconfidence issue, making high confidence for OOD data which are never seen during training process and may be irrelevant to training data, namely in-distribution (ID) data. Determining the reliability of the prediction is still a difficult and challenging task. In this work, we propose Uncertainty-Estimation with Normalized Logits (UE-NL), a robust learning method for OOD detection, which has three main benefits. (1) Neural networks with UE-NL treat every ID sample equally by predicting the uncertainty score of input data and the uncertainty is added into softmax function to adjust the learning strength of easy and hard samples during training phase, making the model learn robustly and accurately. (2) UE-NL enforces a constant vector norm on the logits to decouple the effect of the increasing output norm from optimization process, which causes the overconfidence issue to some extent. (3) UE-NL provides a new metric, the magnitude of uncertainty score, to detect OOD data. Experiments demonstrate that UE-NL achieves top performance on common OOD benchmarks and is more robust to noisy ID data that may be misjudged as OOD data by other methods. ",
    "url": "https://arxiv.org/abs/2302.07608",
    "authors": [
      "Mouxiao Huang",
      "Yu Qiao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.07609",
    "title": "DiffSeer: Difference-based Dynamic Weighted Graph Visualization",
    "abstract": "Existing dynamic weighted graph visualization approaches rely on users' mental comparison to perceive temporal evolution of dynamic weighted graphs, hindering users from effectively analyzing changes across multiple timeslices. We propose DiffSeer, a novel approach for dynamic weighted graph visualization by explicitly visualizing the differences of graph structures (e.g., edge weight differences) between adjacent timeslices. Specifically, we present a novel nested matrix design that overviews the graph structure differences over a time period as well as shows graph structure details in the timeslices of user interest. By collectively considering the overall temporal evolution and structure details in each timeslice, an optimization-based node reordering strategy is developed to group nodes with similar evolution patterns and highlight interesting graph structure details in each timeslice. We conducted two case studies on real-world graph datasets and in-depth interviews with 12 target users to evaluate DiffSeer. The results demonstrate its effectiveness in visualizing dynamic weighted graphs. ",
    "url": "https://arxiv.org/abs/2302.07609",
    "authors": [
      "Xiaolin Wen",
      "Yong Wang",
      "Meixuan Wu",
      "Fengjie Wang",
      "Xuanwu Yue",
      "Qiaomu Shen",
      "Yuxin Ma",
      "Min Zhu"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2302.07636",
    "title": "DP-BART for Privatized Text Rewriting under Local Differential Privacy",
    "abstract": "Privatized text rewriting with local differential privacy (LDP) is a recent approach that enables sharing of sensitive textual documents while formally guaranteeing privacy protection to individuals. However, existing systems face several issues, such as formal mathematical flaws, unrealistic privacy guarantees, privatization of only individual words, as well as a lack of transparency and reproducibility. In this paper, we propose a new system 'DP-BART' that largely outperforms existing LDP systems. Our approach uses a novel clipping method, iterative pruning, and further training of internal representations which drastically reduces the amount of noise required for DP guarantees. We run experiments on five textual datasets of varying sizes, rewriting them at different privacy guarantees and evaluating the rewritten texts on downstream text classification tasks. Finally, we thoroughly discuss the privatized text rewriting approach and its limitations, including the problem of the strict text adjacency constraint in the LDP paradigm that leads to the high noise requirement. ",
    "url": "https://arxiv.org/abs/2302.07636",
    "authors": [
      "Timour Igamberdiev",
      "Ivan Habernal"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.07643",
    "title": "A Subspace Projection Approach to Autoencoder-based Anomaly Detection",
    "abstract": "Autoencoder (AE) is a neural network (NN) architecture that is trained to reconstruct an input at its output. By measuring the reconstruction errors of new input samples, AE can detect anomalous samples deviated from the trained data distribution. The key to success is to achieve high-fidelity reconstruction (HFR) while restricting AE's capability of generalization beyond training data, which should be balanced commonly via iterative re-training. Alternatively, we propose a novel framework of AE-based anomaly detection, coined HFR-AE, by projecting new inputs into a subspace wherein the trained AE achieves HFR, thereby increasing the gap between normal and anomalous sample reconstruction errors. Simulation results corroborate that HFR-AE improves the area under receiver operating characteristic curve (AUROC) under different AE architectures and settings by up to 13.4% compared to Vanilla AE-based anomaly detection. ",
    "url": "https://arxiv.org/abs/2302.07643",
    "authors": [
      "Jinho Choi",
      "Jihong Park",
      "Abhinav Japesh",
      "Adarsh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2302.07666",
    "title": "Forbidden Patterns in Temporal Graphs Resulting from Encounters in a  Corridor",
    "abstract": "In this paper, we study temporal graphs arising from mobility models where some agents move in a space and where edges appear each time two agents meet. We propose a rather natural one-dimensional model. If each pair of agents meets exactly once, we get a temporal clique where each possible edge appears exactly once. By ordering the edges according to meeting times, we get a subset of the temporal cliques. We introduce the first notion of of forbidden patterns in temporal graphs, which leads to a characterization of this class of graphs. We provide, thanks to classical combinatorial results, the number of such cliques for a given number of agents. We consider specific cases where some of the nodes are frozen, and again provide a characterization by forbidden patterns. We give a forbidden pattern when we allow multiple crossings between agents, and leave open the question of a characterization in this situation. ",
    "url": "https://arxiv.org/abs/2302.07666",
    "authors": [
      "Michel Habib",
      "Minh-Hang Nguyen",
      "Mikaël Rabie",
      "Laurent Viennot"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2302.07672",
    "title": "LiveHand: Real-time and Photorealistic Neural Hand Rendering",
    "abstract": "The human hand is the main medium through which we interact with our surroundings. Hence, its digitization is of uttermost importance, with direct applications in VR/AR, gaming, and media production amongst other areas. While there are several works for modeling the geometry and articulations of hands, little attention has been dedicated to capturing photo-realistic appearance. In addition, for applications in extended reality and gaming, real-time rendering is critical. In this work, we present the first neural-implicit approach to photo-realistically render hands in real-time. This is a challenging problem as hands are textured and undergo strong articulations with various pose-dependent effects. However, we show that this can be achieved through our carefully designed method. This includes training on a low-resolution rendering of a neural radiance field, together with a 3D-consistent super-resolution module and mesh-guided space canonicalization and sampling. In addition, we show the novel application of a perceptual loss on the image space is critical for achieving photorealism. We show rendering results for several identities, and demonstrate that our method captures pose- and view-dependent appearance effects. We also show a live demo of our method where we photo-realistically render the human hand in real-time for the first time in literature. We ablate all our design choices and show that our design optimizes for both photorealism and rendering speed. Our code will be released to encourage further research in this area. ",
    "url": "https://arxiv.org/abs/2302.07672",
    "authors": [
      "Akshay Mundra",
      "Mallikarjun B R",
      "Jiayi Wang",
      "Marc Habermann",
      "Christian Theobalt",
      "Mohamed Elgharib"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2302.07689",
    "title": "Event-guided Multi-patch Network with Self-supervision for Non-uniform  Motion Deblurring",
    "abstract": "Contemporary deep learning multi-scale deblurring models suffer from many issues: 1) They perform poorly on non-uniformly blurred images/videos; 2) Simply increasing the model depth with finer-scale levels cannot improve deblurring; 3) Individual RGB frames contain a limited motion information for deblurring; 4) Previous models have a limited robustness to spatial transformations and noise. Below, we extend the DMPHN model by several mechanisms to address the above issues: I) We present a novel self-supervised event-guided deep hierarchical Multi-patch Network (MPN) to deal with blurry images and videos via fine-to-coarse hierarchical localized representations; II) We propose a novel stacked pipeline, StackMPN, to improve the deblurring performance under the increased network depth; III) We propose an event-guided architecture to exploit motion cues contained in videos to tackle complex blur in videos; IV) We propose a novel self-supervised step to expose the model to random transformations (rotations, scale changes), and make it robust to Gaussian noises. Our MPN achieves the state of the art on the GoPro and VideoDeblur datasets with a 40x faster runtime compared to current multi-scale methods. With 30ms to process an image at 1280x720 resolution, it is the first real-time deep motion deblurring model for 720p images at 30fps. For StackMPN, we obtain significant improvements over 1.2dB on the GoPro dataset by increasing the network depth. Utilizing the event information and self-supervision further boost results to 33.83dB. ",
    "url": "https://arxiv.org/abs/2302.07689",
    "authors": [
      "Hongguang Zhang",
      "Limeng Zhang",
      "Yuchao Dai",
      "Hongdong Li",
      "Piotr Koniusz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2302.07715",
    "title": "Risk Management Core -- Towards an Explicit Representation of Risk in  Automated Driving",
    "abstract": "While current automotive safety standards provide implicit guidance on how unreasonable risk can be avoided, manufacturers are required to specify risk acceptance criteria for automated driving systems (SAE Level 3+). However, the 'unreasonable' level of risk of automated driving systems (SAE Level 3+) is not yet concisely defined. Solely applying current safety standards to such novel systems could potentially not be sufficient for their acceptance. As risk is managed with implicit knowledge about safety measures in existing automotive standards, an explicit alignment with risk acceptance criteria is challenging. Hence, we propose an approach for an explicit representation and management of risk, which we call the Risk Management Core. The proposal of this process framework is based on requirements elicited from current safety standards and apply the Risk Management Core to the task of specifying safe behavior for an automated driving system in an example scenario. ",
    "url": "https://arxiv.org/abs/2302.07715",
    "authors": [
      "Nayel Fabian Salem",
      "Thomas Kirschbaum",
      "Marcus Nolte",
      "Christian Lalitsch-Schneider",
      "Robert Graubohm",
      "Jan Reich",
      "Markus Maurer"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2302.07729",
    "title": "Generation of Highlights from Research Papers Using Pointer-Generator  Networks and SciBERT Embeddings",
    "abstract": "Nowadays many research articles are prefaced with research highlights to summarize the main findings of the paper. Highlights not only help researchers precisely and quickly identify the contributions of a paper, they also enhance the discoverability of the article via search engines. We aim to automatically construct research highlights given certain segments of the research paper. We use a pointer-generator network with coverage mechanism and a contextual embedding layer at the input that encodes the input tokens into SciBERT embeddings. We test our model on a benchmark dataset, CSPubSum and also present MixSub, a new multi-disciplinary corpus of papers for automatic research highlight generation. For both CSPubSum and MixSub, we have observed that the proposed model achieves the best performance compared to related variants and other models proposed in the literature. On the CSPubSum data set, our model achieves the best performance when the input is only the abstract of a paper as opposed to other segments of the paper. It produces ROUGE-1, ROUGE-2 and ROUGE-L F1-scores of 38.26, 14.26 and 35.51, respectively, METEOR F1-score of 32.62, and BERTScore F1 of 86.65 which outperform all other baselines. On the new MixSub data set, where only the abstract is the input, our proposed model (when trained on the whole training corpus without distinguishing between the subject categories) achieves ROUGE-1, ROUGE-2 and ROUGE-L F1-scores of 31.78, 9.76 and 29.3, respectively, METEOR F1-score of 24.00, and BERTScore F1 of 85.25, outperforming other models. ",
    "url": "https://arxiv.org/abs/2302.07729",
    "authors": [
      "Tohida Rehman",
      "Debarshi Kumar Sanyal",
      "Samiran Chattopadhyay",
      "Plaban Kumar Bhowmick",
      "Partha Pratim Das"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07731",
    "title": "Combat AI With AI: Counteract Machine-Generated Fake Restaurant Reviews  on Social Media",
    "abstract": "Recent advances in generative models such as GPT may be used to fabricate indistinguishable fake customer reviews at a much lower cost, thus posing challenges for social media platforms to detect these machine-generated fake reviews. We propose to leverage the high-quality elite restaurant reviews verified by Yelp to generate fake reviews from the OpenAI GPT review creator and ultimately fine-tune a GPT output detector to predict fake reviews that significantly outperforms existing solutions. We further apply the model to predict non-elite reviews and identify the patterns across several dimensions, such as review, user and restaurant characteristics, and writing style. We show that social media platforms are continuously challenged by machine-generated fake reviews, although they may implement detection systems to filter out suspicious reviews. ",
    "url": "https://arxiv.org/abs/2302.07731",
    "authors": [
      "Alessandro Gambetti",
      "Qiwei Han"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07735",
    "title": "Targeted Attack on GPT-Neo for the SATML Language Model Data Extraction  Challenge",
    "abstract": "Previous work has shown that Large Language Models are susceptible to so-called data extraction attacks. This allows an attacker to extract a sample that was contained in the training data, which has massive privacy implications. The construction of data extraction attacks is challenging, current attacks are quite inefficient, and there exists a significant gap in the extraction capabilities of untargeted attacks and memorization. Thus, targeted attacks are proposed, which identify if a given sample from the training data, is extractable from a model. In this work, we apply a targeted data extraction attack to the SATML2023 Language Model Training Data Extraction Challenge. We apply a two-step approach. In the first step, we maximise the recall of the model and are able to extract the suffix for 69% of the samples. In the second step, we use a classifier-based Membership Inference Attack on the generations. Our AutoSklearn classifier achieves a precision of 0.841. The full approach reaches a score of 0.405 recall at a 10% false positive rate, which is an improvement of 34% over the baseline of 0.301. ",
    "url": "https://arxiv.org/abs/2302.07735",
    "authors": [
      "Ali Al-Kaswan",
      "Maliheh Izadi",
      "Arie van Deursen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.07739",
    "title": "Meta-Learning Triplet Network with Adaptive Margins for Few-Shot Named  Entity Recognition",
    "abstract": "Meta-learning methods have been widely used in few-shot named entity recognition (NER), especially prototype-based methods. However, the Other(O) class is difficult to be represented by a prototype vector because there are generally a large number of samples in the class that have miscellaneous semantics. To solve the problem, we propose MeTNet, which generates prototype vectors for entity types only but not O-class. We design an improved triplet network to map samples and prototype vectors into a low-dimensional space that is easier to be classified and propose an adaptive margin for each entity type. The margin plays as a radius and controls a region with adaptive size in the low-dimensional space. Based on the regions, we propose a new inference procedure to predict the label of a query instance. We conduct extensive experiments in both in-domain and cross-domain settings to show the superiority of MeTNet over other state-of-the-art methods. In particular, we release a Chinese few-shot NER dataset FEW-COMM extracted from a well-known e-commerce platform. To the best of our knowledge, this is the first Chinese few-shot NER dataset. All the datasets and codes are provided at https://github.com/hccngu/MeTNet. ",
    "url": "https://arxiv.org/abs/2302.07739",
    "authors": [
      "Chengcheng Han",
      "Renyu Zhu",
      "Jun Kuang",
      "FengJiao Chen",
      "Xiang Li",
      "Ming Gao",
      "Xuezhi Cao",
      "Wei Wu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2302.07751",
    "title": "Robust and Listening-Efficient Contention Resolution",
    "abstract": "This paper shows how to achieve contention resolution on a shared communication channel using only a small number of channel accesses -- both for listening and sending -- and the resulting algorithm is resistant to adversarial noise. The shared channel operates over a sequence of synchronized time slots, and in any slot agents may attempt to broadcast a packet. An agent's broadcast succeeds if no other agent broadcasts during that slot. If two or more agents broadcast in the same slot, then the broadcasts collide and both broadcasts fail. An agent listening on the channel during a slot receives ternary feedback, learning whether that slot had silence, a successful broadcast, or a collision. Agents are (adversarially) injected into the system over time. The goal is to coordinate the agents so that each is able to successfully broadcast its packet. A contention-resolution protocol is measured both in terms of its throughput and the number of slots during which an agent broadcasts or listens. Most prior work assumes that listening is free and only tries to minimize the number of broadcasts. This paper answers two foundational questions. First, is constant throughput achievable when using polylogarithmic channel accesses per agent, both for listening and broadcasting? Second, is constant throughput still achievable when an adversary jams some slots by broadcasting noise in them? Specifically, for $N$ packets arriving over time and $J$ jammed slots, we give an algorithm that with high probability in $N+J$ guarantees $\\Theta(1)$ throughput and achieves on average $O(\\texttt{polylog}(N+J))$ channel accesses against an adaptive adversary. We also have per-agent high-probability guarantees on the number of channel accesses -- either $O(\\texttt{polylog}(N+J))$ or $O((J+1) \\texttt{polylog}(N))$, depending on how quickly the adversary can react to what is being broadcast. ",
    "url": "https://arxiv.org/abs/2302.07751",
    "authors": [
      "Michael A. Bender",
      "Jeremy T. Fineman",
      "Seth Gilbert",
      "John Kuszmaul",
      "Maxwell Young"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2302.07753",
    "title": "From Prediction to Planning With Goal Conditioned Lane Graph Traversals",
    "abstract": "The field of motion prediction for automated driving has seen tremendous progress recently, bearing ever-more mighty neural network architectures. Leveraging these powerful models bears great potential for the closely related planning task. In this letter we propose a novel goal-conditioning method and show its potential to transform a state-of-the-art prediction model into a goal-directed planner. Our key insight is that conditioning prediction on a navigation goal at the behaviour level outperforms other widely adopted methods, with the additional benefit of increased model interpretability. We train our model on a large open-source dataset and show promising performance in a comprehensive benchmark. ",
    "url": "https://arxiv.org/abs/2302.07753",
    "authors": [
      "Marcel Hallgarten",
      "Martin Stoll",
      "Andreas Zell"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.07755",
    "title": "SynGraphy: Succinct Summarisation of Large Networks via Small Synthetic  Representative Graphs",
    "abstract": "We describe SynGraphy, a method for visually summarising the structure of large network datasets that works by drawing smaller graphs generated to have similar structural properties to the input graphs. Visualising complex networks is crucial to understand and make sense of networked data and the relationships it represents. Due to the large size of many networks, visualisation is extremely difficult; the simple method of drawing large networks like those of Facebook or Twitter leads to graphics that convey little or no information. While modern graph layout algorithms can scale computationally to large networks, their output tends to a common \"hairball\" look, which makes it difficult to even distinguish different graphs from each other. Graph sampling and graph coarsening techniques partially address these limitations but they are only able to preserve a subset of the properties of the original graphs. In this paper we take the problem of visualising large graphs from a novel perspective: we leave the original graph's nodes and edges behind, and instead summarise its properties such as the clustering coefficient and bipartivity by generating a completely new graph whose structural properties match that of the original graph. To verify the utility of this approach as compared to other graph visualisation algorithms, we perform an experimental evaluation in which we repeatedly asked experimental subjects (professionals in graph mining and related areas) to determine which of two given graphs has a given structural property and then assess which visualisation algorithm helped in identifying the correct answer. Our summarisation approach SynGraphy compares favourably to other techniques on a variety of networks. ",
    "url": "https://arxiv.org/abs/2302.07755",
    "authors": [
      "Jérôme Kunegis",
      "Pawan Kumar",
      "Jun Sun",
      "Anna Samoilenko",
      "Giuseppe Pirró"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07769",
    "title": "XploreNAS: Explore Adversarially Robust & Hardware-efficient Neural  Architectures for Non-ideal Xbars",
    "abstract": "Compute In-Memory platforms such as memristive crossbars are gaining focus as they facilitate acceleration of Deep Neural Networks (DNNs) with high area and compute-efficiencies. However, the intrinsic non-idealities associated with the analog nature of computing in crossbars limits the performance of the deployed DNNs. Furthermore, DNNs are shown to be vulnerable to adversarial attacks leading to severe security threats in their large-scale deployment. Thus, finding adversarially robust DNN architectures for non-ideal crossbars is critical to the safe and secure deployment of DNNs on the edge. This work proposes a two-phase algorithm-hardware co-optimization approach called XploreNAS that searches for hardware-efficient & adversarially robust neural architectures for non-ideal crossbar platforms. We use the one-shot Neural Architecture Search (NAS) approach to train a large Supernet with crossbar-awareness and sample adversarially robust Subnets therefrom, maintaining competitive hardware-efficiency. Our experiments on crossbars with benchmark datasets (SVHN, CIFAR10 & CIFAR100) show upto ~8-16% improvement in the adversarial robustness of the searched Subnets against a baseline ResNet-18 model subjected to crossbar-aware adversarial training. We benchmark our robust Subnets for Energy-Delay-Area-Products (EDAPs) using the Neurosim tool and find that with additional hardware-efficiency driven optimizations, the Subnets attain ~1.5-1.6x lower EDAPs than ResNet-18 baseline. ",
    "url": "https://arxiv.org/abs/2302.07769",
    "authors": [
      "Abhiroop Bhattacharjee",
      "Abhishek Moitra",
      "Priyadarshini Panda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2302.07788",
    "title": "Fight Fire with Fire: Hacktivists' Take on Social Media Misinformation",
    "abstract": "In this study, we interviewed 22 prominent hacktivists to learn their take on the increased proliferation of misinformation on social media. We found that none of them welcomes the nefarious appropriation of trolling and memes for the purpose of political (counter)argumentation and dissemination of propaganda. True to the original hacker ethos, misinformation is seen as a threat to the democratic vision of the Internet, and as such, it must be confronted on the face with tried hacktivists' methods like deplatforming the \"misinformers\" and doxing or leaking data about their funding and recruitment. The majority of the hacktivists also recommended interventions for raising misinformation literacy in addition to targeted hacking campaigns. We discuss the implications of these findings relative to the emergent recasting of hacktivism in defense of a constructive and factual social media discourse. ",
    "url": "https://arxiv.org/abs/2302.07788",
    "authors": [
      "Filipo Sharevski",
      "Benjamin Kessell"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2302.07801",
    "title": "Data Forensics in Diffusion Models: A Systematic Analysis of Membership  Privacy",
    "abstract": "In recent years, diffusion models have achieved tremendous success in the field of image generation, becoming the stateof-the-art technology for AI-based image processing applications. Despite the numerous benefits brought by recent advances in diffusion models, there are also concerns about their potential misuse, specifically in terms of privacy breaches and intellectual property infringement. In particular, some of their unique characteristics open up new attack surfaces when considering the real-world deployment of such models. With a thorough investigation of the attack vectors, we develop a systematic analysis of membership inference attacks on diffusion models and propose novel attack methods tailored to each attack scenario specifically relevant to diffusion models. Our approach exploits easily obtainable quantities and is highly effective, achieving near-perfect attack performance (>0.9 AUCROC) in realistic scenarios. Our extensive experiments demonstrate the effectiveness of our method, highlighting the importance of considering privacy and intellectual property risks when using diffusion models in image generation tasks. ",
    "url": "https://arxiv.org/abs/2302.07801",
    "authors": [
      "Derui Zhu",
      "Dingfan Chen",
      "Jens Grossklags",
      "Mario Fritz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.07817",
    "title": "Tri-Perspective View for Vision-Based 3D Semantic Occupancy Prediction",
    "abstract": "Modern methods for vision-centric autonomous driving perception widely adopt the bird's-eye-view (BEV) representation to describe a 3D scene. Despite its better efficiency than voxel representation, it has difficulty describing the fine-grained 3D structure of a scene with a single plane. To address this, we propose a tri-perspective view (TPV) representation which accompanies BEV with two additional perpendicular planes. We model each point in the 3D space by summing its projected features on the three planes. To lift image features to the 3D TPV space, we further propose a transformer-based TPV encoder (TPVFormer) to obtain the TPV features effectively. We employ the attention mechanism to aggregate the image features corresponding to each query in each TPV plane. Experiments show that our model trained with sparse supervision effectively predicts the semantic occupancy for all voxels. We demonstrate for the first time that using only camera inputs can achieve comparable performance with LiDAR-based methods on the LiDAR segmentation task on nuScenes. Code: https://github.com/wzzheng/TPVFormer. ",
    "url": "https://arxiv.org/abs/2302.07817",
    "authors": [
      "Yuanhui Huang",
      "Wenzhao Zheng",
      "Yunpeng Zhang",
      "Jie Zhou",
      "Jiwen Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07829",
    "title": "Optical Networks and Interconnects",
    "abstract": "The rapid evolution of communication technologies such as 5G and beyond, rely on optical networks to support the challenging and ambitious requirements that include both capacity and reliability. This chapter begins by giving an overview of the evolution of optical access networks, focusing on Passive Optical Networks (PONs). The development of the different PON standards and requirements aiming at longer reach, higher client count and delivered bandwidth are presented. PON virtualization is also introduced as the flexibility enabler. Triggered by the increase of bandwidth supported by access and aggregation network segments, core networks have also evolved, as presented in the second part of the chapter. Scaling the physical infrastructure requires high investment and hence, operators are considering alternatives to optimize the use of the existing capacity. This chapter introduces different planning problems such as Routing and Spectrum Assignment problems, placement problems for regenerators and wavelength converters, and how to offer resilience to different failures. An overview of control and management is also provided. Moreover, motivated by the increasing importance of data storage and data processing, this chapter also addresses different aspects of optical data center interconnects. Data centers have become critical infrastructure to operate any service. They are also forced to take advantage of optical technology in order to keep up with the growing capacity demand and power consumption. This chapter gives an overview of different optical data center network architectures as well as some expected directions to improve the resource utilization and increase the network capacity. ",
    "url": "https://arxiv.org/abs/2302.07829",
    "authors": [
      "Carmen Mas-Machuca",
      "Lena Wosinska",
      "Marco Ruffini",
      "Jiajia Chen"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2302.07832",
    "title": "Deep Anomaly Detection under Labeling Budget Constraints",
    "abstract": "Selecting informative data points for expert feedback can significantly improve the performance of anomaly detection (AD) in various contexts, such as medical diagnostics or fraud detection. In this paper, we determine a set of theoretical conditions under which anomaly scores generalize from labeled queries to unlabeled data. Motivated by these results, we propose a data labeling strategy with optimal data coverage under labeling budget constraints. In addition, we propose a new learning framework for semi-supervised AD. Extensive experiments on image, tabular, and video data sets show that our approach results in state-of-the-art semi-supervised AD performance under labeling budget constraints. ",
    "url": "https://arxiv.org/abs/2302.07832",
    "authors": [
      "Aodong Li",
      "Chen Qiu",
      "Padhraic Smyth",
      "Marius Kloft",
      "Stephan Mandt",
      "Maja Rudolph"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.07849",
    "title": "Zero-Shot Anomaly Detection without Foundation Models",
    "abstract": "Anomaly detection (AD) tries to identify data instances that deviate from the norm in a given data set. Since data distributions are subject to distribution shifts, our concept of ``normality\" may also drift, raising the need for zero-shot adaptation approaches for anomaly detection. However, the fact that current zero-shot AD methods rely on foundation models that are restricted in their domain (natural language and natural images), are costly, and oftentimes proprietary, asks for alternative approaches. In this paper, we propose a simple and highly effective zero-shot AD approach compatible with a variety of established AD methods. Our solution relies on training an off-the-shelf anomaly detector (such as a deep SVDD) on a set of inter-related data distributions in combination with batch normalization. This simple recipe--batch normalization plus meta-training--is a highly effective and versatile tool. Our results demonstrate the first zero-shot anomaly detection results for tabular data and SOTA zero-shot AD results for image data from specialized domains. ",
    "url": "https://arxiv.org/abs/2302.07849",
    "authors": [
      "Aodong Li",
      "Chen Qiu",
      "Marius Kloft",
      "Padhraic Smyth",
      "Maja Rudolph",
      "Stephan Mandt"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.07864",
    "title": "Denoising Diffusion Probabilistic Models for Robust Image  Super-Resolution in the Wild",
    "abstract": "Diffusion models have shown promising results on single-image super-resolution and other image- to-image translation tasks. Despite this success, they have not outperformed state-of-the-art GAN models on the more challenging blind super-resolution task, where the input images are out of distribution, with unknown degradations. This paper introduces SR3+, a diffusion-based model for blind super-resolution, establishing a new state-of-the-art. To this end, we advocate self-supervised training with a combination of composite, parameterized degradations for self-supervised training, and noise-conditioing augmentation during training and testing. With these innovations, a large-scale convolutional architecture, and large-scale datasets, SR3+ greatly outperforms SR3. It outperforms Real-ESRGAN when trained on the same data, with a DRealSR FID score of 36.82 vs. 37.22, which further improves to FID of 32.37 with larger models, and further still with larger training sets. ",
    "url": "https://arxiv.org/abs/2302.07864",
    "authors": [
      "Hshmat Sahak",
      "Daniel Watson",
      "Chitwan Saharia",
      "David Fleet"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2302.07866",
    "title": "Do Deep Neural Networks Capture Compositionality in Arithmetic  Reasoning?",
    "abstract": "Compositionality is a pivotal property of symbolic reasoning. However, how well recent neural models capture compositionality remains underexplored in the symbolic reasoning tasks. This study empirically addresses this question by systematically examining recently published pre-trained seq2seq models with a carefully controlled dataset of multi-hop arithmetic symbolic reasoning. We introduce a skill tree on compositionality in arithmetic symbolic reasoning that defines the hierarchical levels of complexity along with three compositionality dimensions: systematicity, productivity, and substitutivity. Our experiments revealed that among the three types of composition, the models struggled most with systematicity, performing poorly even with relatively simple compositions. That difficulty was not resolved even after training the models with intermediate reasoning steps. ",
    "url": "https://arxiv.org/abs/2302.07866",
    "authors": [
      "Keito Kudo",
      "Yoichi Aoki",
      "Tatsuki Kuribayashi",
      "Ana Brassard",
      "Masashi Yoshikawa",
      "Keisuke Sakaguchi",
      "Kentaro Inui"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.07867",
    "title": "Learning Performance-Improving Code Edits",
    "abstract": "The waning of Moore's Law has shifted the focus of the tech industry towards alternative methods for continued performance gains. While optimizing compilers are a standard tool to help increase program efficiency, programmers continue to shoulder much responsibility in crafting and refactoring code with better performance characteristics. In this paper, we investigate the ability of large language models (LLMs) to suggest functionally correct, performance improving code edits. We hypothesize that language models can suggest such edits in ways that would be impractical for static analysis alone. We investigate these questions by curating a large-scale dataset of Performance-Improving Edits, PIE. PIE contains trajectories of programs, where a programmer begins with an initial, slower version and iteratively makes changes to improve the program's performance. We use PIE to evaluate and improve the capacity of large language models. Specifically, use examples from PIE to fine-tune multiple variants of CODEGEN, a billion-scale Transformer-decoder model. Additionally, we use examples from PIE to prompt OpenAI's CODEX using a few-shot prompting. By leveraging PIE, we find that both CODEX and CODEGEN can generate performance-improving edits, with speedups of more than 2.5x for over 25% of the programs, for C++ and Python, even after the C++ programs were compiled using the O3 optimization level. Crucially, we show that PIE allows CODEGEN, an open-sourced and 10x smaller model than CODEX, to match the performance of CODEX on this challenging task. Overall, this work opens new doors for creating systems and methods that can help programmers write efficient code. ",
    "url": "https://arxiv.org/abs/2302.07867",
    "authors": [
      "Aman Madaan",
      "Alexander Shypula",
      "Uri Alon",
      "Milad Hashemi",
      "Parthasarathy Ranganathan",
      "Yiming Yang",
      "Graham Neubig",
      "Amir Yazdanbakhsh"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2302.07868",
    "title": "Target Specific De Novo Design of Drug Candidate Molecules with Graph  Transformer-based Generative Adversarial Networks",
    "abstract": "Discovering novel drug candidate molecules is one of the most fundamental and critical steps in drug development. Generative deep learning models, which create synthetic data given a probability distribution, have been developed with the purpose of picking completely new samples from a partially known space. Generative models offer high potential for designing de novo molecules; however, in order for them to be useful in real-life drug development pipelines, these models should be able to design target-specific molecules, which is the next step in this field. In this study, we propose DrugGEN, for the de novo design of drug candidate molecules that interact with selected target proteins. The proposed system represents compounds and protein structures as graphs and processes them via serially connected two generative adversarial networks comprising graph transformers. DrugGEN is trained using a large dataset of compounds from ChEMBL and target-specific bioactive molecules, to design effective and specific inhibitory molecules against the AKT1 protein, which has critical importance for developing treatments against various types of cancer. On fundamental benchmarks, DrugGEN models have either competitive or better performance against other methods. To assess the target-specific generation performance, we conducted further in silico analysis with molecular docking and deep learning-based bioactivity prediction. Results indicate that de novo molecules have high potential for interacting with the AKT1 protein structure in the level of its native ligand. DrugGEN can be used to design completely novel and effective target-specific drug candidate molecules for any druggable protein, given target features and a dataset of experimental bioactivities. Code base, datasets, results and trained models of DrugGEN are available at https://github.com/HUBioDataLab/DrugGEN ",
    "url": "https://arxiv.org/abs/2302.07868",
    "authors": [
      "Atabey Ünlü",
      "Elif Çevrim",
      "Ahmet Sarıgün",
      "Hayriye Çelikbilek",
      "Heval Ataş Güvenilir",
      "Altay Koyaş",
      "Deniz Cansen Kahraman",
      "Ahmet Rifaioğlu",
      "Abdurrahman Olğaç"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2302.07869",
    "title": "Improved Online Conformal Prediction via Strongly Adaptive Online  Learning",
    "abstract": "We study the problem of uncertainty quantification via prediction sets, in an online setting where the data distribution may vary arbitrarily over time. Recent work develops online conformal prediction techniques that leverage regret minimization algorithms from the online learning literature to learn prediction sets with approximately valid coverage and small regret. However, standard regret minimization could be insufficient for handling changing environments, where performance guarantees may be desired not only over the full time horizon but also in all (sub-)intervals of time. We develop new online conformal prediction methods that minimize the strongly adaptive regret, which measures the worst-case regret over all intervals of a fixed length. We prove that our methods achieve near-optimal strongly adaptive regret for all interval lengths simultaneously, and approximately valid coverage. Experiments show that our methods consistently obtain better coverage and smaller prediction sets than existing methods on real-world tasks, such as time series forecasting and image classification under distribution shift. ",
    "url": "https://arxiv.org/abs/2302.07869",
    "authors": [
      "Aadyot Bhatnagar",
      "Huan Wang",
      "Caiming Xiong",
      "Yu Bai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Statistics Theory (math.ST)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.07315",
    "title": "A dataset for Audio-Visual Sound Event Detection in Movies",
    "abstract": "Audio event detection is a widely studied audio processing task, with applications ranging from self-driving cars to healthcare. In-the-wild datasets such as Audioset have propelled research in this field. However, many efforts typically involve manual annotation and verification, which is expensive to perform at scale. Movies depict various real-life and fictional scenarios which makes them a rich resource for mining a wide-range of audio events. In this work, we present a dataset of audio events called Subtitle-Aligned Movie Sounds (SAM-S). We use publicly-available closed-caption transcripts to automatically mine over 110K audio events from 430 movies. We identify three dimensions to categorize audio events: sound, source, quality, and present the steps involved to produce a final taxonomy of 245 sounds. We discuss the choices involved in generating the taxonomy, and also highlight the human-centered nature of sounds in our dataset. We establish a baseline performance for audio-only sound classification of 34.76% mean average precision and show that incorporating visual information can further improve the performance by about 5%. Data and code are made available for research at https://github.com/usc-sail/mica-subtitle-aligned-movie-sounds ",
    "url": "https://arxiv.org/abs/2302.07315",
    "authors": [
      "Rajat Hebbar",
      "Digbalay Bose",
      "Krishna Somandepalli",
      "Veena Vijai",
      "Shrikanth Narayanan"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2302.07419",
    "title": "Spatially heterogeneous learning by a deep student machine",
    "abstract": "Despite the spectacular successes, deep neural networks (DNN) with a huge number of adjustable parameters remain largely black boxes. To shed light on the hidden layers of DNN, we study supervised learning by a DNN of width $N$ and depth $L$ consisting of perceptrons with $c$ inputs by a statistical mechanics approach called the teacher-student setting. We consider an ensemble of student machines that exactly reproduce $M$ sets of $N$ dimensional input/output relations provided by a teacher machine. We analyze the ensemble theoretically using a replica method (H. Yoshino (2020)) and numerically performing greedy Monte Carlo simulations. The replica theory which works on high dimensional data $N \\gg 1$ becomes exact in 'dense limit' $N \\gg c \\gg 1$ and $M \\gg 1$ with fixed $\\alpha=M/c$. Both the theory and the simulation suggest learning by the DNN is quite heterogeneous in the network space: configurations of the machines are more correlated within the layers closer to the input/output boundaries while the central region remains much less correlated due to over-parametrization. Deep enough systems relax faster thanks to the less correlated central region. Remarkably both the theory and simulation suggest generalization-ability of the student machines does not vanish even in the deep limit $L \\gg 1$ where the system becomes strongly over-parametrized. We also consider the impact of effective dimension $D(\\leq N)$ of data by incorporating the hidden manifold model (S. Goldt et al (2020)) into our model. The replica theory implies that the loop corrections to the dense limit, which reflect correlations between different nodes in the network, become enhanced by either decreasing the width $\\ N$ or decreasing the effective dimension $D$ of the data. Simulation suggests both leads to significant improvements in generalization-ability. ",
    "url": "https://arxiv.org/abs/2302.07419",
    "authors": [
      "Hajime Yoshino"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.07555",
    "title": "Firmware implementation of a recurrent neural network for the  computation of the energy deposited in the liquid argon calorimeter of the  ATLAS experiment",
    "abstract": "The ATLAS experiment measures the properties of particles that are products of proton-proton collisions at the LHC. The ATLAS detector will undergo a major upgrade before the high luminosity phase of the LHC. The ATLAS liquid argon calorimeter measures the energy of particles interacting electromagnetically in the detector. The readout electronics of this calorimeter will be replaced during the aforementioned ATLAS upgrade. The new electronic boards will be based on state-of-the-art field-programmable gate arrays (FPGA) from Intel allowing the implementation of neural networks embedded in firmware. Neural networks have been shown to outperform the current optimal filtering algorithms used to compute the energy deposited in the calorimeter. This article presents the implementation of a recurrent neural network (RNN) allowing the reconstruction of the energy deposited in the calorimeter on Stratix 10 FPGAs. The implementation in high level synthesis (HLS) language allowed fast prototyping but fell short of meeting the stringent requirements in terms of resource usage and latency. Further optimisations in Very High-Speed Integrated Circuit Hardware Description Language (VHDL) allowed fulfilment of the requirements of processing 384 channels per FPGA with a latency smaller than 125 ns. ",
    "url": "https://arxiv.org/abs/2302.07555",
    "authors": [
      "Georges Aad",
      "Thomas Calvet",
      "Nemer Chiedde",
      "Robert Faure",
      "Etienne Marie Fortin",
      "Lauri Laatu",
      "Emmanuel Monnier",
      "Nairit Sur"
    ],
    "subjectives": [
      "Instrumentation and Detectors (physics.ins-det)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)"
    ]
  },
  {
    "id": "arXiv:2302.07584",
    "title": "Fast Blind Audio Copy-Move Detection and Localization Using Local  Feature Tensors in Noise",
    "abstract": "The increasing availability of audio editing software altering digital audios and their ease of use allows create forgeries at low cost. A copy-move forgery (CMF) is one of easiest and popular audio forgeries, which created by copying and pasting audio segments within the same audio, and potentially post-processing it. Three main approaches to audio copy-move detection exist nowadays: samples/frames comparison, acoustic features coherence searching and dynamic time warping. But these approaches will suffer from computational complexity and/or sensitive to noise and post-processing. In this paper, we propose a new local feature tensors-based copy-move detection algorithm that can be applied to transformed duplicates detection and localization problem to a special locality sensitive hash like procedure. The experimental results with massive online real-time audios datasets reveal that the proposed technique effectively determines and locating copy-move forgeries even on a forged speech segment are as short as fractional second. This method is also computational efficient and robust against the audios processed with severe nonlinear transformation, such as resampling, filtering, jsittering, compression and cropping, even contaminated with background noise and music. Hence, the proposed technique provides an efficient and reliable way of copy-move forgery detection that increases the credibility of audio in practical forensics applications ",
    "url": "https://arxiv.org/abs/2302.07584",
    "authors": [
      "Dong Yang",
      "Mingle Liu",
      "Muyong Cao"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Information Theory (cs.IT)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2302.07591",
    "title": "Unique Compact Representation of Magnetic Fields using Truncated Solid  Harmonic Expansions",
    "abstract": "Precise knowledge of magnetic fields is crucial in many medical imaging applications like magnetic resonance imaging or magnetic particle imaging (MPI) as they are the foundation of these imaging systems. For the investigation of the influence of field imperfections on imaging, a compact and unique representation of the magnetic fields using real solid spherical harmonics, which can be obtained by measuring a few points of the magnetic field only, is of great assistance. In this manuscript, we review real solid harmonic expansions as a general solution of Laplace's equation including an efficient calculation of their coefficients using spherical t-designs. We also provide a method to shift the reference point of an expansion by calculating the coefficients of the shifted expansion from the initial ones. These methods are used to obtain the magnetic fields of an MPI system. Here, the field-free-point of the spatial encoding field serves as unique expansion point. Lastly, we quantify the severity of the distortions of the static and dynamic fields in MPI by analyzing the expansion coefficients. ",
    "url": "https://arxiv.org/abs/2302.07591",
    "authors": [
      "Marija Boberg",
      "Tobias Knopp",
      "Martin Möddel"
    ],
    "subjectives": [
      "Medical Physics (physics.med-ph)",
      "Mathematical Software (cs.MS)"
    ]
  },
  {
    "id": "arXiv:2302.07648",
    "title": "Atrial Fibrillation Detection Using RR-Intervals for Application in  Photoplethysmographs",
    "abstract": "Atrial Fibrillation is a common form of irregular heart rhythm that can be very dangerous. Our primary goal is to analyze Atrial Fibrillation data within ECGs to develop a model based only on RR-Intervals, or the length between heart-beats, to create a real time classification model for Atrial Fibrillation to be implemented in common heart-rate monitors on the market today. Physionet's MIT-BIH Atrial Fibrillation Database \\cite{goldberger2000physiobank} and 2017 Challenge Database \\cite{clifford2017af} were used to identify patterns of Atrial Fibrillation and test classification models on. These two datasets are very different. The MIT-BIH database contains long samples taken with a medical grade device, which is not useful for simulating a consumer device, but is useful for Atrial Fibrillation pattern detection. The 2017 Challenge database includes short ($<60sec$) samples taken with a portable device and reveals many of the challenges of Atrial Fibrillation classification in a real-time device. We developed multiple SVM models with three sets of extracted features as predictor variables which gave us moderately high accuracies with low computational intensity. With robust filtering techniques already applied in many Photoplethysmograph-based consumer heart-rate monitors, this method can be used to develop a reliable real time model for Atrial Fibrillation detection in consumer-grade heart-rate monitors. ",
    "url": "https://arxiv.org/abs/2302.07648",
    "authors": [
      "Georgia Smith",
      "Yishi Wang"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07675",
    "title": "Guaranteed Dynamic Scheduling of Ultra-Reliable Low-Latency Traffic via  Conformal Prediction",
    "abstract": "The dynamic scheduling of ultra-reliable and low-latency traffic (URLLC) in the uplink can significantly enhance the efficiency of coexisting services, such as enhanced mobile broadband (eMBB) devices, by only allocating resources when necessary. The main challenge is posed by the uncertainty in the process of URLLC packet generation, which mandates the use of predictors for URLLC traffic in the coming frames. In practice, such prediction may overestimate or underestimate the amount of URLLC data to be generated, yielding either an excessive or an insufficient amount of resources to be pre-emptively allocated for URLLC packets. In this paper, we introduce a novel scheduler for URLLC packets that provides formal guarantees on reliability and latency irrespective of the quality of the URLLC traffic predictor. The proposed method leverages recent advances in online conformal prediction (CP), and follows the principle of dynamically adjusting the amount of allocated resources so as to meet reliability and latency requirements set by the designer. ",
    "url": "https://arxiv.org/abs/2302.07675",
    "authors": [
      "Kfir M. Cohen",
      "Sangwoo Park",
      "Osvaldo Simeone",
      "Petar Popovski",
      "Shlomo Shamai"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2302.07700",
    "title": "Self-Supervised Learning for Modeling Gamma-ray Variability in Blazars",
    "abstract": "Blazars are active galactic nuclei with relativistic jets pointed almost directly at Earth. Blazars are characterized by strong, apparently stochastic flux variability at virtually all observed wavelengths and timescales, from minutes to years, the physical origin of which is still poorly understood. In the high-energy gamma-ray band, the Large Area Telescope aboard the Fermi space telescope (Fermi-LAT) has conducted regular monitoring of thousands of blazars since 2008. Deep learning can help uncover structure in gamma-ray blazars' complex variability patterns that traditional methods based on parametric statistical modeling or manual feature engineering may miss. In this work, we propose using a self-supervised Transformer encoder architecture to construct an effective representation of blazar gamma-ray variability. Measurement errors, upper limits, and missing data are accommodated using learned encodings. The model predicts a set of quantiles for the flux probability distribution at each time step, an architecture naturally suited for describing data generated by a stochastic process. As a proof of concept for how the model output can be analyzed to extract scientifically relevant information, a preliminary search for weekly-timescale time-reversal asymmetry in gamma-ray blazar light curves was conducted, finding no significant evidence for asymmetry. ",
    "url": "https://arxiv.org/abs/2302.07700",
    "authors": [
      "Aryeh Brill"
    ],
    "subjectives": [
      "High Energy Astrophysical Phenomena (astro-ph.HE)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07797",
    "title": "'Aariz: A Benchmark Dataset for Automatic Cephalometric Landmark  Detection and CVM Stage Classification",
    "abstract": "The accurate identification and precise localization of cephalometric landmarks enable the classification and quantification of anatomical abnormalities. The traditional way of marking cephalometric landmarks on lateral cephalograms is a monotonous and time-consuming job. Endeavours to develop automated landmark detection systems have persistently been made, however, they are inadequate for orthodontic applications due to unavailability of a reliable dataset. We proposed a new state-of-the-art dataset to facilitate the development of robust AI solutions for quantitative morphometric analysis. The dataset includes 1000 lateral cephalometric radiographs (LCRs) obtained from 7 different radiographic imaging devices with varying resolutions, making it the most diverse and comprehensive cephalometric dataset to date. The clinical experts of our team meticulously annotated each radiograph with 29 cephalometric landmarks, including the most significant soft tissue landmarks ever marked in any publicly available dataset. Additionally, our experts also labelled the cervical vertebral maturation (CVM) stage of the patient in a radiograph, making this dataset the first standard resource for CVM classification. We believe that this dataset will be instrumental in the development of reliable automated landmark detection frameworks for use in orthodontics and beyond. ",
    "url": "https://arxiv.org/abs/2302.07797",
    "authors": [
      "Muhammad Anwaar Khalid",
      "Kanwal Zulfiqar",
      "Ulfat Bashir",
      "Areeba Shaheen",
      "Rida Iqbal",
      "Zarnab Rizwan",
      "Ghina Rizwan",
      "Muhammad Moazam Fraz"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:1910.11819",
    "title": "An End-to-End Network for Co-Saliency Detection in One Single Image",
    "abstract": " Title: An End-to-End Network for Co-Saliency Detection in One Single Image ",
    "url": "https://arxiv.org/abs/1910.11819",
    "authors": [
      "Yuanhao Yue",
      "Qin Zou",
      "Hongkai Yu",
      "Qian Wang",
      "Zhongyuan Wang",
      "Song Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2006.03438",
    "title": "Evolutionary Matrix-Game Dynamics Under Imitation in Heterogeneous  Populations",
    "abstract": " Title: Evolutionary Matrix-Game Dynamics Under Imitation in Heterogeneous  Populations ",
    "url": "https://arxiv.org/abs/2006.03438",
    "authors": [
      "Yiheng Fu",
      "Pouria Ramazi"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2007.09018",
    "title": "Flow-augmentation II: Undirected graphs",
    "abstract": " Comments: v2. Major update of all three flow-augmentation papers. The partial dichotomy part has been removed from this work, as it is superseded by the full dichotomy of Flow-Augmentation III (arXiv:2207.07422) ",
    "url": "https://arxiv.org/abs/2007.09018",
    "authors": [
      "Eun Jung Kim",
      "Stefan Kratsch",
      "Marcin Pilipczuk",
      "Magnus Wahlström"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2104.03525",
    "title": "A Neural Pre-Conditioning Active Learning Algorithm to Reduce Label  Complexity",
    "abstract": " Comments: NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2104.03525",
    "authors": [
      "Seo Taek Kong",
      "Soomin Jeon",
      "Dongbin Na",
      "Jaewon Lee",
      "Hong-Seok Lee",
      "Kyu-Hwan Jung"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2105.08633",
    "title": "PDE-constrained Models with Neural Network Terms: Optimization and  Global Convergence",
    "abstract": " Title: PDE-constrained Models with Neural Network Terms: Optimization and  Global Convergence ",
    "url": "https://arxiv.org/abs/2105.08633",
    "authors": [
      "Justin Sirignano",
      "Jonathan MacArt",
      "Konstantinos Spiliopoulos"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.03107",
    "title": "Approximation Guarantees for Min-max-min Robust Optimization and  K-Adaptability under Objective Uncertainty",
    "abstract": " Comments: This is a completely revised version of my previous preprint \"New complexity results and algorithms for min-max-min robust combinatorial optimization\". Some results were removed while several new results were added ",
    "url": "https://arxiv.org/abs/2106.03107",
    "authors": [
      "Jannis Kurtz"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2111.03005",
    "title": "Parallel Global Edge Switching for the Uniform Sampling of Simple Graphs  with Prescribed Degrees",
    "abstract": " Title: Parallel Global Edge Switching for the Uniform Sampling of Simple Graphs  with Prescribed Degrees ",
    "url": "https://arxiv.org/abs/2111.03005",
    "authors": [
      "Daniel Allendorf",
      "Ulrich Meyer",
      "Manuel Penschuck",
      "Hung Tran"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2111.03450",
    "title": "Flow-augmentation I: Directed graphs",
    "abstract": " Comments: v2. Major update of three flow-augmentation papers. Includes a deterministic version. Weighted Almost 2-SAT algorithm has been removed, as it is superseded by a more general algorithm of Flow-Augmentation III (arXiv:2207.07422) ",
    "url": "https://arxiv.org/abs/2111.03450",
    "authors": [
      "Eun Jung Kim",
      "Stefan Kratsch",
      "Marcin Pilipczuk",
      "Magnus Wahlström"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2202.13321",
    "title": "Bayesian Robust Tensor Ring Model for Incomplete Multiway Data",
    "abstract": " Title: Bayesian Robust Tensor Ring Model for Incomplete Multiway Data ",
    "url": "https://arxiv.org/abs/2202.13321",
    "authors": [
      "Zhenhao Huang",
      "Yuning Qiu",
      "Xinqi Chen",
      "Weijun Sun",
      "Guoxu Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.00849",
    "title": "Adversarially Robust Learning with Tolerance",
    "abstract": " Comments: The paper was accepted for ALT 2023 ",
    "url": "https://arxiv.org/abs/2203.00849",
    "authors": [
      "Hassan Ashtiani",
      "Vinayak Pathak",
      "Ruth Urner"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.13166",
    "title": "Self-supervised Video-centralised Transformer for Video Face Clustering",
    "abstract": " Comments: Accepted to IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) ",
    "url": "https://arxiv.org/abs/2203.13166",
    "authors": [
      "Yujiang Wang",
      "Mingzhi Dong",
      "Jie Shen",
      "Yiming Luo",
      "Yiming Lin",
      "Pingchuan Ma",
      "Stavros Petridis",
      "Maja Pantic"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.02033",
    "title": "Learning to Reduce Information Bottleneck for Object Detection in Aerial  Images",
    "abstract": " Comments: 5 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2204.02033",
    "authors": [
      "Yuchen Shen",
      "Dong Zhang",
      "Zhihao Song",
      "Xuesong Jiang",
      "Qiaolin Ye"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.08738",
    "title": "3D-VFD: A Victim-free Detector against 3D Adversarial Point Clouds",
    "abstract": " Comments: 6 pages, 13pages ",
    "url": "https://arxiv.org/abs/2205.08738",
    "authors": [
      "Jiahao Zhu",
      "Huajun Zhou",
      "Zixuan Chen",
      "Yi Zhou",
      "Xiaohua Xie"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2206.06410",
    "title": "Estimating Causal Effects Under Image Confounding Bias with an  Application to Poverty in Africa",
    "abstract": " Title: Estimating Causal Effects Under Image Confounding Bias with an  Application to Poverty in Africa ",
    "url": "https://arxiv.org/abs/2206.06410",
    "authors": [
      "Connor T. Jerzak",
      "Fredrik Johansson",
      "Adel Daoud"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2207.01223",
    "title": "A Survey on Label-efficient Deep Image Segmentation: Bridging the Gap  between Weak Supervision and Dense Prediction",
    "abstract": " Comments: Accepted to IEEE TPAMI ",
    "url": "https://arxiv.org/abs/2207.01223",
    "authors": [
      "Wei Shen",
      "Zelin Peng",
      "Xuehui Wang",
      "Huayu Wang",
      "Jiazhong Cen",
      "Dongsheng Jiang",
      "Lingxi Xie",
      "Xiaokang Yang",
      "Qi Tian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.02918",
    "title": "Heterogeneous Anomaly Detection for Software Systems via Attentive  Multi-modal Learning",
    "abstract": " Comments: The updated version of this paper has been submitted at arXiv:2302.06914 via another account. This duplicated and old version should be discarded ",
    "url": "https://arxiv.org/abs/2207.02918",
    "authors": [
      "Baitong Li",
      "Tianyi Yang",
      "Zhuangbin Chen",
      "Yuxin Su",
      "Yongqiang Yang",
      "Michael R. Lyu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2207.06680",
    "title": "Equivariant Hypergraph Diffusion Neural Operators",
    "abstract": " Comments: Code: this https URL ",
    "url": "https://arxiv.org/abs/2207.06680",
    "authors": [
      "Peihao Wang",
      "Shenghao Yang",
      "Yunyu Liu",
      "Zhangyang Wang",
      "Pan Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2207.08773",
    "title": "Having your Privacy Cake and Eating it Too: Platform-supported Auditing  of Social Media Algorithms for Public Interest",
    "abstract": " Title: Having your Privacy Cake and Eating it Too: Platform-supported Auditing  of Social Media Algorithms for Public Interest ",
    "url": "https://arxiv.org/abs/2207.08773",
    "authors": [
      "Basileal Imana",
      "Aleksandra Korolova",
      "John Heidemann"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2208.03274",
    "title": "A Holistic Approach to Undesired Content Detection in the Real World",
    "abstract": " Comments: Oral presentation at AAAI-23 ",
    "url": "https://arxiv.org/abs/2208.03274",
    "authors": [
      "Todor Markov",
      "Chong Zhang",
      "Sandhini Agarwal",
      "Tyna Eloundou",
      "Teddy Lee",
      "Steven Adler",
      "Angela Jiang",
      "Lilian Weng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.00110",
    "title": "Complexity of diameter on AT-free graphs is linear",
    "abstract": " Title: Complexity of diameter on AT-free graphs is linear ",
    "url": "https://arxiv.org/abs/2209.00110",
    "authors": [
      "Oleksiy Al-saadi",
      "Jitender Deogun"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2209.06275",
    "title": "PANCETTA: Phoneme Aware Neural Completion to Elicit Tongue Twisters  Automatically",
    "abstract": " Comments: EACL 2023. Code at this https URL ",
    "url": "https://arxiv.org/abs/2209.06275",
    "authors": [
      "Sedrick Scott Keh",
      "Steven Y. Feng",
      "Varun Gangal",
      "Malihe Alikhani",
      "Eduard Hovy"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.08185",
    "title": "LEARNEST: LEARNing Enhanced Model-based State ESTimation for Robots  using Knowledge-based Neural Ordinary Differential Equations",
    "abstract": " Comments: 7 pages, 3 figures, 1 table. Accepted at 2023 IEEE International Conference on Robotics and Automation (ICRA) ",
    "url": "https://arxiv.org/abs/2209.08185",
    "authors": [
      "Kong Yao Chee",
      "M. Ani Hsieh"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2209.10788",
    "title": "How Does It Feel? Self-Supervised Costmap Learning for Off-Road Vehicle  Traversability",
    "abstract": " Title: How Does It Feel? Self-Supervised Costmap Learning for Off-Road Vehicle  Traversability ",
    "url": "https://arxiv.org/abs/2209.10788",
    "authors": [
      "Mateo Guaman Castro",
      "Samuel Triest",
      "Wenshan Wang",
      "Jason M. Gregory",
      "Felix Sanchez",
      "John G. Rogers III",
      "Sebastian Scherer"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.14566",
    "title": "Diffusion Adversarial Representation Learning for Self-supervised Vessel  Segmentation",
    "abstract": " Comments: Accepted at ICLR 2023 ",
    "url": "https://arxiv.org/abs/2209.14566",
    "authors": [
      "Boah Kim",
      "Yujin Oh",
      "Jong Chul Ye"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.14855",
    "title": "Continuous PDE Dynamics Forecasting with Implicit Neural Representations",
    "abstract": " Title: Continuous PDE Dynamics Forecasting with Implicit Neural Representations ",
    "url": "https://arxiv.org/abs/2209.14855",
    "authors": [
      "Yuan Yin",
      "Matthieu Kirchmeyer",
      "Jean-Yves Franceschi",
      "Alain Rakotomamonjy",
      "Patrick Gallinari"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.15214",
    "title": "Construction and Applications of Billion-Scale Pre-trained Multimodal  Business Knowledge Graph",
    "abstract": " Comments: OpenBG. Accepted by ICDE 2023 ",
    "url": "https://arxiv.org/abs/2209.15214",
    "authors": [
      "Shumin Deng",
      "Chengming Wang",
      "Zhoubo Li",
      "Ningyu Zhang",
      "Zelin Dai",
      "Hehong Chen",
      "Feiyu Xiong",
      "Ming Yan",
      "Qiang Chen",
      "Mosha Chen",
      "Jiaoyan Chen",
      "Jeff Z. Pan",
      "Bryan Hooi",
      "Huajun Chen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.02992",
    "title": "COVID-19 Detection Using Segmentation, Region Extraction and  Classification Pipeline",
    "abstract": " Title: COVID-19 Detection Using Segmentation, Region Extraction and  Classification Pipeline ",
    "url": "https://arxiv.org/abs/2210.02992",
    "authors": [
      "Kenan Morani"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.14016",
    "title": "Shortest Edit Path Crossover: A Theory-driven Solution to the  Permutation Problem in Evolutionary Neural Architecture Search",
    "abstract": " Comments: 19 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2210.14016",
    "authors": [
      "Xin Qiu",
      "Risto Miikkulainen"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.01856",
    "title": "Human Biophysics as Network Weights: Conditional Generative Models for  Dynamic Simulation",
    "abstract": " Title: Human Biophysics as Network Weights: Conditional Generative Models for  Dynamic Simulation ",
    "url": "https://arxiv.org/abs/2211.01856",
    "authors": [
      "Shihan Ma",
      "Alexander Kenneth Clarke",
      "Kostiantyn Maksymenko",
      "Samuel Deslauriers-Gauthier",
      "Xinjun Sheng",
      "Xiangyang Zhu",
      "Dario Farina"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Signal Processing (eess.SP)",
      "Biological Physics (physics.bio-ph)"
    ]
  },
  {
    "id": "arXiv:2211.11587",
    "title": "Timely Target Tracking in Cognitive Radar Networks",
    "abstract": " Comments: 6 pages, 6 figures. Presented at IEEE RadarConf 2023 ",
    "url": "https://arxiv.org/abs/2211.11587",
    "authors": [
      "William W. Howard",
      "Charles E. Thornton",
      "R. Michael Buehrer"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2212.02047",
    "title": "Towards Neural Decoding of Imagined Speech based on Spoken Speech",
    "abstract": " Comments: 4 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2212.02047",
    "authors": [
      "Seo-Hyun Lee",
      "Young-Eun Lee",
      "Soowon Kim",
      "Byung-Kwan Ko",
      "Seong-Whan Lee"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2212.06898",
    "title": "Bridging Graph Position Encodings for Transformers with Weighted  Graph-Walking Automata",
    "abstract": " Comments: Made various fixes, clarifications, and additions regarding typos, mathematical details, and experimental details ",
    "url": "https://arxiv.org/abs/2212.06898",
    "authors": [
      "Patrick Soga",
      "David Chiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08474",
    "title": "Trade Privacy for Utility: A Learning-Based Privacy Pricing Game in  Federated Learning",
    "abstract": " Comments: Accepted by IEEE ICC2023 ",
    "url": "https://arxiv.org/abs/2301.08474",
    "authors": [
      "Yuntao Wang",
      "Zhou Su",
      "Yanghe Pan",
      "Abderrahim Benslimane",
      "Yiliang Liu",
      "Tom H. Luan",
      "Ruidong Li"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2301.12471",
    "title": "Maximising Weather Forecasting Accuracy through the Utilisation of Graph  Neural Networks and Dynamic GNNs",
    "abstract": " Comments: Errors in the Results sections. Experiments are conducted to rectify the errors ",
    "url": "https://arxiv.org/abs/2301.12471",
    "authors": [
      "Gaganpreet Singh",
      "Surya Durbha",
      "Shreelakshmi C R"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.12519",
    "title": "3D Object Detection in LiDAR Point Clouds using Graph Neural Networks",
    "abstract": " Comments: Errors in the results section. Experiments are carried out to rectify the results ",
    "url": "https://arxiv.org/abs/2301.12519",
    "authors": [
      "Shreelakshmi C R",
      "Surya S. Durbha",
      "Gaganpreet Singh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.13154",
    "title": "Protein Representation Learning via Knowledge Enhanced Primary Structure  Modeling",
    "abstract": " Comments: Camera ready atICLR 2023. Code and models are available at this https URL ",
    "url": "https://arxiv.org/abs/2301.13154",
    "authors": [
      "Hong-Yu Zhou",
      "Yunxiang Fu",
      "Zhicheng Zhang",
      "Cheng Bian",
      "Yizhou Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2301.13155",
    "title": "Advancing Radiograph Representation Learning with Masked Record Modeling",
    "abstract": " Comments: Camera ready at ICLR 2023. Code and models are available at this https URL ",
    "url": "https://arxiv.org/abs/2301.13155",
    "authors": [
      "Hong-Yu Zhou",
      "Chenyu Lian",
      "Liansheng Wang",
      "Yizhou Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.00651",
    "title": "Ngram-LSTM Open Rate Prediction Model (NLORP) and Error_accuracy@C  metric: Simple effective, and easy to implement approach to predict open  rates for marketing email",
    "abstract": " Title: Ngram-LSTM Open Rate Prediction Model (NLORP) and Error_accuracy@C  metric: Simple effective, and easy to implement approach to predict open  rates for marketing email ",
    "url": "https://arxiv.org/abs/2302.00651",
    "authors": [
      "Shubham Joshi",
      "Indradumna Banerjee"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2302.01748",
    "title": "Chaining of Maximal Exact Matches in Graphs",
    "abstract": " Comments: 19 pages, 1 figure ",
    "url": "https://arxiv.org/abs/2302.01748",
    "authors": [
      "Nicola Rizzo",
      "Manuel Cáceres",
      "Veli Mäkinen"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2302.02215",
    "title": "On 2-strong connectivity orientations of mixed graphs and related  problems",
    "abstract": " Title: On 2-strong connectivity orientations of mixed graphs and related  problems ",
    "url": "https://arxiv.org/abs/2302.02215",
    "authors": [
      "Loukas Georgiadis",
      "Dionysios Kefallinos",
      "Evangelos Kosinas"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2302.03266",
    "title": "Learning to Count Isomorphisms with Graph Neural Networks",
    "abstract": " Comments: AAAI-23 main track ",
    "url": "https://arxiv.org/abs/2302.03266",
    "authors": [
      "Xingtong Yu",
      "Zemin Liu",
      "Yuan Fang",
      "Xinming Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.03461",
    "title": "Degree-3 Planar Graphs as Topological Minors of Wall Graphs in  Polynomial Time",
    "abstract": " Comments: Updated to fix an error in the proof pointed out by Mika\\\"el Monet ",
    "url": "https://arxiv.org/abs/2302.03461",
    "authors": [
      "Antoine Amarilli"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2302.06586",
    "title": "Stitchable Neural Networks",
    "abstract": " Comments: Project is available at this https URL ",
    "url": "https://arxiv.org/abs/2302.06586",
    "authors": [
      "Zizheng Pan",
      "Jianfei Cai",
      "Bohan Zhuang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06751",
    "title": "OpenHLS: High-Level Synthesis for Low-Latency Deep Neural Networks for  Experimental Science",
    "abstract": " Title: OpenHLS: High-Level Synthesis for Low-Latency Deep Neural Networks for  Experimental Science ",
    "url": "https://arxiv.org/abs/2302.06751",
    "authors": [
      "Maksim Levental",
      "Arham Khan",
      "Ryan Chard",
      "Kazutomo Yoshi",
      "Kyle Chard",
      "Ian Foster"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.06805",
    "title": "Learning with Noisy labels via Self-supervised Adversarial Noisy Masking",
    "abstract": " Title: Learning with Noisy labels via Self-supervised Adversarial Noisy Masking ",
    "url": "https://arxiv.org/abs/2302.06805",
    "authors": [
      "Yuanpeng Tu",
      "Boshen Zhang",
      "Yuxi Li",
      "Liang Liu",
      "Jian Li",
      "Jiangning Zhang",
      "Yabiao Wang",
      "Chengjie Wang",
      "Cai Rong Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06815",
    "title": "Self-supervised Likelihood Estimation with Energy Guidance for Anomaly  Segmentation in Urban Scenes",
    "abstract": " Title: Self-supervised Likelihood Estimation with Energy Guidance for Anomaly  Segmentation in Urban Scenes ",
    "url": "https://arxiv.org/abs/2302.06815",
    "authors": [
      "Yuanpeng Tu",
      "Yuxi Li",
      "Boshen Zhang",
      "Liang Liu",
      "Jiangning Zhang",
      "Yabiao Wang",
      "Chengjie Wang",
      "Cai Rong Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06912",
    "title": "Regret-Based Optimization for Robust Reinforcement Learning",
    "abstract": " Title: Regret-Based Optimization for Robust Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2302.06912",
    "authors": [
      "Roman Belaire",
      "Pradeep Varakantham",
      "David Lo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.07116",
    "title": "Team DETR: Guide Queries as a Professional Team in Detection  Transformers",
    "abstract": " Title: Team DETR: Guide Queries as a Professional Team in Detection  Transformers ",
    "url": "https://arxiv.org/abs/2302.07116",
    "authors": [
      "Tian Qiu",
      "Linyun Zhou",
      "Wenxiang Xu",
      "Lechao Cheng",
      "Zunlei Feng",
      "Mingli Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]