[
  {
    "id": "arXiv:2106.06595",
    "title": "Bucket-brigade inspired power line network protocol for sensed quantity  profile acquisition with smart sensors deployed as a queue in harsh  environment",
    "abstract": "Pressure and temperature profile are key data for safe production in oil and gas wells. In this paper, a bucket-brigade inspired sensor network protocol is proposed which can be used to extract sensed data profile from the nanoscale up to kilometer long structures. The PHY/MAC layers are discussed. This protocol is best suited for low data rate exchanges in small fixed-size packets, named buckets, transmitted as time-domain bursts among high-precision smart sensors deployed as a queue. There is only one coordinator, which is not directly accessible by most of the sensor nodes. The coordinator is responsible for collecting the measurement profile and send it to a supervisory node. There is no need for complex routing mechanism, as the network topology is determined during deployment. There are many applications which require sensors to be deployed as a long queue and sensed data could be transmitted at low data rates. Examples of such monitoring applications are: neural connected artificial skin, oil/gas/water pipeline integrity, power transmission line tower integrity, (rail)road/highway lighting and integrity, individualized monitoring in vineyard or re-foresting or plantation, underwater telecommunications cable integrity, oil/gas riser integrity, oil/gas well temperature and pressure profile, among others. For robustness and reduced electromagnetic interference, wired network is preferred. Besides in some harsh environment wireless is not feasible. To reduce wiring, communications can be carried out in the same cable used to supply electrical power. ",
    "url": "https://arxiv.org/abs/2106.06595",
    "authors": [
      "Edval J. P. Santos"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2106.06615",
    "title": "Precise characterization of the prior predictive distribution of deep  ReLU networks",
    "abstract": "Recent works on Bayesian neural networks (BNNs) have highlighted the need to better understand the implications of using Gaussian priors in combination with the compositional structure of the network architecture. Similar in spirit to the kind of analysis that has been developed to devise better initialization schemes for neural networks (cf. He- or Xavier initialization), we derive a precise characterization of the prior predictive distribution of finite-width ReLU networks with Gaussian weights. While theoretical results have been obtained for their heavy-tailedness, the full characterization of the prior predictive distribution (i.e. its density, CDF and moments), remained unknown prior to this work. Our analysis, based on the Meijer-G function, allows us to quantify the influence of architectural choices such as the width or depth of the network on the resulting shape of the prior predictive distribution. We also formally connect our results to previous work in the infinite width setting, demonstrating that the moments of the distribution converge to those of a normal log-normal mixture in the infinite depth limit. Finally, our results provide valuable guidance on prior design: for instance, controlling the predictive variance with depth- and width-informed priors on the weights of the network. ",
    "url": "https://arxiv.org/abs/2106.06615",
    "authors": [
      "Lorenzo Noci",
      "Gregor Bachmann",
      "Kevin Roth",
      "Sebastian Nowozin",
      "Thomas Hofmann"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.06720",
    "title": "BIOPAK Flasher: Epidemic disease monitoring and detection in Pakistan  using text mining",
    "abstract": "Infectious disease outbreak has a significant impact on morbidity, mortality and can cause economic instability of many countries. As global trade is growing, goods and individuals are expected to travel across the border, an infected epidemic area carrier can pose a great danger to his hostile. If a disease outbreak is recognized promptly, then commercial products and travelers (traders/visitors) will be effectively vaccinated, and therefore the disease stopped. Early detection of outbreaks plays an important role here, and beware of the rapid implementation of control measures by citizens, public health organizations, and government. Many indicators have valuable information, such as online news sources (RSS) and social media sources (Twitter, Facebook) that can be used, but are unstructured and bulky, to extract information about disease outbreaks. Few early warning outbreak systems exist with some limitation of linguistic (Urdu) and covering areas (Pakistan). In Pakistan, few channels are published the outbreak news in Urdu or English. The aim is to procure information from Pakistan's English and Urdu news channels and then investigate process, integrate, and visualize the disease epidemic. Urdu ontology is not existed before to match extracted diseases, so we also build that ontology of disease. ",
    "url": "https://arxiv.org/abs/2106.06720",
    "authors": [
      "Muhammad Nasir",
      "Maheen Bakhtyar",
      "Junaid Baber",
      "Sadia Lakho",
      "Bilal Ahmed",
      "Waheed Noor"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.06770",
    "title": "What can linearized neural networks actually say about generalization?",
    "abstract": "For certain infinitely-wide neural networks, the neural tangent kernel (NTK) theory fully characterizes generalization. However, for the networks used in practice, the empirical NTK represents only a rough first-order approximation of these architectures. Still, a growing body of work keeps leveraging this approximation to successfully analyze important deep learning phenomena and derive algorithms for new applications. In our work, we provide strong empirical evidence to determine the practical validity of such approximation by conducting a systematic comparison of the behaviour of different neural networks and their linear approximations on different tasks. We show that the linear approximations can indeed rank the learning complexity of certain tasks for neural networks, albeit with important nuances. Specifically, we discover that, in contrast to what was previously observed, neural networks do not always perform better than their kernel approximations, and reveal that their performance gap heavily depends on architecture, number of samples and training task. In fact, we show that during training, deep networks increase the alignment of their empirical NTK with the target task, which explains why linear approximations at the end of training can better explain the dynamics of deep networks. Overall, our work provides concrete examples of novel deep learning phenomena which can inspire future theoretical research, as well as provides a new perspective on the use of the NTK approximation in deep learning. ",
    "url": "https://arxiv.org/abs/2106.06770",
    "authors": [
      "Guillermo Ortiz-Jiménez",
      "Seyed-Mohsen Moosavi-Dezfooli",
      "Pascal Frossard"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.06988",
    "title": "NDPNet: A novel non-linear data projection network for few-shot  fine-gained image classification",
    "abstract": "Metric-based few-shot fine-grained image classification (FSFGIC) aims to learn a transferable feature embedding network by estimating the similarities between query images and support classes from very few examples. In this work, we propose, for the first time, to introduce the non-linear data projection concept into the design of FSFGIC architecture in order to address the limited sample problem in few-shot learning and at the same time to increase the discriminability of the model for fine-grained image classification. Specifically, we first design a feature re-abstraction embedding network that has the ability to not only obtain the required semantic features for effective metric learning but also re-enhance such features with finer details from input images. Then the descriptors of the query images and the support classes are projected into different non-linear spaces in our proposed similarity metric learning network to learn discriminative projection factors. This design can effectively operate in the challenging and restricted condition of a FSFGIC task for making the distance between the samples within the same class smaller and the distance between samples from different classes larger and for reducing the coupling relationship between samples from different categories. Furthermore, a novel similarity measure based on the proposed non-linear data project is presented for evaluating the relationships of feature information between a query image and a support set. It is worth to note that our proposed architecture can be easily embedded into any episodic training mechanisms for end-to-end training from scratch. Extensive experiments on FSFGIC tasks demonstrate the superiority of the proposed methods over the state-of-the-art benchmarks. ",
    "url": "https://arxiv.org/abs/2106.06988",
    "authors": [
      "Weichuan Zhangy",
      "Xuefang Liuy",
      "Zhe Xue",
      "Yongsheng Gao",
      "Changming Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.06997",
    "title": "Post-hoc loss-calibration for Bayesian neural networks",
    "abstract": "Bayesian decision theory provides an elegant framework for acting optimally under uncertainty when tractable posterior distributions are available. Modern Bayesian models, however, typically involve intractable posteriors that are approximated with, potentially crude, surrogates. This difficulty has engendered loss-calibrated techniques that aim to learn posterior approximations that favor high-utility decisions. In this paper, focusing on Bayesian neural networks, we develop methods for correcting approximate posterior predictive distributions encouraging them to prefer high-utility decisions. In contrast to previous work, our approach is agnostic to the choice of the approximate inference algorithm, allows for efficient test time decision making through amortization, and empirically produces higher quality decisions. We demonstrate the effectiveness of our approach through controlled experiments spanning a diversity of tasks and datasets. ",
    "url": "https://arxiv.org/abs/2106.06997",
    "authors": [
      "Meet P. Vadera",
      "Soumya Ghosh",
      "Kenney Ng",
      "Benjamin M. Marlin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.07051",
    "title": "Comparative analysis of quality of service scheduling classes in mobile  ad-hoc networks",
    "abstract": "Quality of Service (QoS) is now regarded as a requirement for all networks in managing resources like bandwidth and avoidance of network impairments like packet loss, jitter, and delay. Media transfer or streaming would be virtually impossible if QoS parameters were not used even if the streaming protocols were perfectly designed. QoS Scheduling classes help in network traffic optimization and the priority management of packets. This paper presents an analysis of QoS scheduling classes using video traffic in a MANET. The main objective was to identify a scheduling class that provides better QoS for video streaming. A simulation was conducted using NetSim and results were analyzed according to throughput, jitter, and delay. The overall results showed that extended real-time Polling Service (ertPS) outperformed the other classes. ertPS has hybrid features of both real-time Polling Service (rtPS) and Unsolicited Grant Service(UGS) hence the enhanced performance. It is recommended that ertPS scheduling class should be used in MANET where QoS consideration is utmost particularly in multimedia streaming applications. ",
    "url": "https://arxiv.org/abs/2106.07051",
    "authors": [
      "Thulani Phakathi",
      "Bukohwo Michael Esiefarienrhe",
      "Francis Lugayizi"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2106.07095",
    "title": "Linear representation of categorical values",
    "abstract": "We propose a binary representation of categorical values using a linear map. This linear representation preserves the neighborhood structure of categorical values. In the context of evolutionary algorithms, it means that every categorical value can be reached in a single mutation. The linear representation is embedded into standard metaheuristics, applied to the problem of Sudoku puzzles, and compared to the more traditional direct binary encoding. It shows promising results in fixed-budget experiments and empirical cumulative distribution functions with high dimension instances, and also in fixed-target experiments with small dimension instances. ",
    "url": "https://arxiv.org/abs/2106.07095",
    "authors": [
      "Arnaud Berny"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2106.07224",
    "title": "SGE net: Video object detection with squeezed GRU and information  entropy map",
    "abstract": "Recently, deep learning based video object detection has attracted more and more attention. Compared with object detection of static images, video object detection is more challenging due to the motion of objects, while providing rich temporal information. The RNN-based algorithm is an effective way to enhance detection performance in videos with temporal information. However, most studies in this area only focus on accuracy while ignoring the calculation cost and the number of parameters. In this paper, we propose an efficient method that combines channel-reduced convolutional GRU (Squeezed GRU), and Information Entropy map for video object detection (SGE-Net). The experimental results validate the accuracy improvement, computational savings of the Squeezed GRU, and superiority of the information entropy attention mechanism on the classification performance. The mAP has increased by 3.7 contrasted with the baseline, and the number of parameters has decreased from 6.33 million to 0.67 million compared with the standard GRU. ",
    "url": "https://arxiv.org/abs/2106.07224",
    "authors": [
      "Rui Su",
      "Wenjing Huang",
      "Haoyu Ma",
      "Xiaowei Song",
      "Jinglu Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.07273",
    "title": "Flexible dual-branched message passing neural network for quantum  mechanical property prediction with molecular conformation",
    "abstract": "A molecule is a complex of heterogeneous components, and the spatial arrangements of these components determine the whole molecular properties and characteristics. With the advent of deep learning in computational chemistry, several studies have focused on how to predict molecular properties based on molecular configurations. Message passing neural network provides an effective framework for capturing molecular geometric features with the perspective of a molecule as a graph. However, most of these studies assumed that all heterogeneous molecular features, such as atomic charge, bond length, or other geometric features always contribute equivalently to the target prediction, regardless of the task type. In this study, we propose a dual-branched neural network for molecular property prediction based on message-passing framework. Our model learns heterogeneous molecular features with different scales, which are trained flexibly according to each prediction target. In addition, we introduce a discrete branch to learn single atom features without local aggregation, apart from message-passing steps. We verify that this novel structure can improve the model performance with faster convergence in most targets. The proposed model outperforms other recent models with sparser representations. Our experimental results indicate that in the chemical property prediction tasks, the diverse chemical nature of targets should be carefully considered for both model performance and generalizability. ",
    "url": "https://arxiv.org/abs/2106.07273",
    "authors": [
      "Jeonghee Jo",
      "Bumju Kwak",
      "Byunghan Lee",
      "Sungroh Yoon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2106.07395",
    "title": "Dilated filters for edge detection algorithms",
    "abstract": "Edges are a basic and fundamental feature in image processing, that are used directly or indirectly in huge amount of applications. Inspired by the expansion of image resolution and processing power dilated convolution techniques appeared. Dilated convolution have impressive results in machine learning, we discuss here the idea of dilating the standard filters which are used in edge detection algorithms. In this work we try to put together all our previous and current results by using instead of the classical convolution filters a dilated one. We compare the results of the edge detection algorithms using the proposed dilation filters with original filters or custom variants. Experimental results confirm our statement that dilation of filters have positive impact for edge detection algorithms form simple to rather complex algorithms. ",
    "url": "https://arxiv.org/abs/2106.07395",
    "authors": [
      "Ciprian Orhei",
      "Victor Bogdan",
      "Cosmin Bonchis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.07441",
    "title": "Automatically eliminating seam lines with Poisson editing in complex  relative radiometric normalization mosaicking scenarios",
    "abstract": "Relative radiometric normalization (RRN) mosaicking among multiple remote sensing images is crucial for the downstream tasks, including map-making, image recognition, semantic segmentation, and change detection. However, there are often seam lines on the mosaic boundary and radiometric contrast left, especially in complex scenarios, making the appearance of mosaic images unsightly and reducing the accuracy of the latter classification/recognition algorithms. This paper renders a novel automatical approach to eliminate seam lines in complex RRN mosaicking scenarios. It utilizes the histogram matching on the overlap area to alleviate radiometric contrast, Poisson editing to remove the seam lines, and merging procedure to determine the normalization transfer order. Our method can handle the mosaicking seam lines with arbitrary shapes and images with extreme topological relationships (with a small intersection area). These conditions make the main feathering or blending methods, e.g., linear weighted blending and Laplacian pyramid blending, unavailable. In the experiment, our approach visually surpasses the automatic methods without Poisson editing and the manual blurring and feathering method using GIMP software. ",
    "url": "https://arxiv.org/abs/2106.07441",
    "authors": [
      "Shiqi Liu",
      "Jie Lian",
      "Xuchen Zhan",
      "Cong Liu",
      "Yuze Tian",
      "Hongwei Duan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.07548",
    "title": "A scalable multi-step least squares method for network identification  with unknown disturbance topology",
    "abstract": "Identification methods for dynamic networks typically require prior knowledge of the network and disturbance topology, and often rely on solving poorly scalable non-convex optimization problems. While methods for estimating network topology are available in the literature, less attention has been paid to estimating the disturbance topology, i.e., the (spatial) noise correlation structure and the noise rank. In this work we present an identification method for dynamic networks, in which an estimation of the disturbance topology precedes the identification of the full dynamic network with known network topology. To this end we extend the multi-step Sequential Linear Regression and Weighted Null Space Fitting methods to deal with reduced rank noise, and use these methods to estimate the disturbance topology and the network dynamics. As a result, we provide a multi-step least squares algorithm with parallel computation capabilities and that rely only on explicit analytical solutions, thereby avoiding the usual non-convex optimizations involved. Consequently we consistently estimate dynamic networks of Box Jenkins model structure, while keeping the computational burden low. We provide a consistency proof that includes path-based data informativity conditions for allocation of excitation signals in the experimental design. Numerical simulations performed on a dynamic network with reduced rank noise clearly illustrate the potential of this method. ",
    "url": "https://arxiv.org/abs/2106.07548",
    "authors": [
      "Stefanie J.M. Fonken",
      "Karthik R. Ramaswamy",
      "Paul M.J. Van den Hof"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.06858",
    "title": "Improving weakly supervised sound event detection with self-supervised  auxiliary tasks",
    "abstract": "While multitask and transfer learning has shown to improve the performance of neural networks in limited data settings, they require pretraining of the model on large datasets beforehand. In this paper, we focus on improving the performance of weakly supervised sound event detection in low data and noisy settings simultaneously without requiring any pretraining task. To that extent, we propose a shared encoder architecture with sound event detection as a primary task and an additional secondary decoder for a self-supervised auxiliary task. We empirically evaluate the proposed framework for weakly supervised sound event detection on a remix dataset of the DCASE 2019 task 1 acoustic scene data with DCASE 2018 Task 2 sounds event data under 0, 10 and 20 dB SNR. To ensure we retain the localisation information of multiple sound events, we propose a two-step attention pooling mechanism that provides a time-frequency localisation of multiple audio events in the clip. The proposed framework with two-step attention outperforms existing benchmark models by 22.3%, 12.8%, 5.9% on 0, 10 and 20 dB SNR respectively. We carry out an ablation study to determine the contribution of the auxiliary task and two-step attention pooling to the SED performance improvement. ",
    "url": "https://arxiv.org/abs/2106.06858",
    "authors": [
      "Soham Deshmukh",
      "Bhiksha Raj",
      "Rita Singh"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.06881",
    "title": "A public transit network optimization model for equitable access to  social services",
    "abstract": "We present a flexible public transit network design model which optimizes a social access objective while guaranteeing that the system's costs and transit times remain within a preset margin of their current levels. The purpose of the model is to find a set of minor, immediate modifications to an existing bus network that can give more communities access to the chosen services while having a minimal impact on the current network's operator costs and user costs. Design decisions consist of reallocation of existing resources in order to adjust line frequencies and capacities. We present a hybrid tabu search/simulated annealing algorithm for the solution of this optimization-based model. As a case study we apply the model to the problem of improving equity of access to primary health care facilities in the Chicago metropolitan area. The results of the model suggest that it is possible to achieve better primary care access equity through reassignment of existing buses and implementation of express runs, while leaving overall service levels relatively unaffected. ",
    "url": "https://arxiv.org/abs/2106.06881",
    "authors": [
      "Adam Rumpf",
      "Hemanshu Kaul"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2106.07044",
    "title": "Optimal detection of the feature matching map in presence of noise and  outliers",
    "abstract": "We consider the problem of finding the matching map between two sets of $d$ dimensional vectors from noisy observations, where the second set contains outliers. The matching map is then an injection, which can be consistently estimated only if the vectors of the second set are well separated. The main result shows that, in the high-dimensional setting, a detection region of unknown injection can be characterized by the sets of vectors for which the inlier-inlier distance is of order at least $d^{1/4}$ and the inlier-outlier distance is of order at least $d^{1/2}$. These rates are achieved using the estimated matching minimizing the sum of logarithms of distances between matched pairs of points. We also prove lower bounds establishing optimality of these rates. Finally, we report results of numerical experiments on both synthetic and real world data that illustrate our theoretical results and provide further insight into the properties of the estimators studied in this work. ",
    "url": "https://arxiv.org/abs/2106.07044",
    "authors": [
      "Tigran Galstyan",
      "Arshak Minasyan",
      "Arnak Dalalyan"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.07202",
    "title": "Optimal transport in multilayer networks",
    "abstract": "Modeling traffic distribution and extracting optimal flows in multilayer networks is of utmost importance to design efficient multi-modal network infrastructures. Recent results based on optimal transport theory provide powerful and computationally efficient methods to address this problem, but they are mainly focused on modeling single-layer networks. Here we adapt these results to study how optimal flows distribute on multilayer networks. We propose a model where optimal flows on different layers contribute differently to the total cost to be minimized. This is done by means of a parameter that varies with layers, which allows to flexibly tune the sensitivity to traffic congestion of the various layers. As an application, we consider transportation networks, where each layer is associated to a different transportation system and show how the traffic distribution varies as we tune this parameter across layers. We show an example of this result on the real 2-layer network of the city of Bordeaux with bus and tram, where we find that in certain regimes the presence of the tram network significantly unburdens the traffic on the road network. Our model paves the way to further analysis of optimal flows and navigability strategies in real multilayer networks. ",
    "url": "https://arxiv.org/abs/2106.07202",
    "authors": [
      "Abdullahi Adinoyi Ibrahim",
      "Alessandro Lonardi",
      "Caterina De Bacco"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:1907.04793",
    "title": "Uniform stability of a class of large-scale parallel server networks",
    "abstract": " Comments: 29 pages ",
    "url": "https://arxiv.org/abs/1907.04793",
    "authors": [
      "Hassan Hmedi",
      "Ari Arapostathis",
      "Guodong Pang"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2005.07496",
    "title": "Foundations and modelling of dynamic networks using Dynamic Graph Neural  Networks: A survey",
    "abstract": " Comments: 28 pages, 9 figures, 8 tables ",
    "url": "https://arxiv.org/abs/2005.07496",
    "authors": [
      "Joakim Skarding",
      "Bogdan Gabrys",
      "Katarzyna Musial"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2010.09670",
    "title": "RobustBench: a standardized adversarial robustness benchmark",
    "abstract": " Comments: Version 2: 90+ evaluations, 60+ models, 5 leaderboards (Linf, L2, common corruptions), significantly expanded analysis part (calibration, fairness, privacy leakage, smoothness, transferability) ",
    "url": "https://arxiv.org/abs/2010.09670",
    "authors": [
      "Francesco Croce",
      "Maksym Andriushchenko",
      "Vikash Sehwag",
      "Edoardo Debenedetti",
      "Nicolas Flammarion",
      "Mung Chiang",
      "Prateek Mittal",
      "Matthias Hein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2102.06810",
    "title": "Understanding self-supervised Learning Dynamics without Contrastive  Pairs",
    "abstract": " Comments: ICML 2021 camera ready ",
    "url": "https://arxiv.org/abs/2102.06810",
    "authors": [
      "Yuandong Tian",
      "Xinlei Chen",
      "Surya Ganguli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2102.07238",
    "title": "Double-descent curves in neural networks: a new perspective using  Gaussian processes",
    "abstract": " Title: Double-descent curves in neural networks: a new perspective using  Gaussian processes ",
    "url": "https://arxiv.org/abs/2102.07238",
    "authors": [
      "Ouns El Harzli",
      "Guillermo Valle-Pérez",
      "Ard A. Louis"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.05017",
    "title": "Estimating articulatory movements in speech production with transformer  networks",
    "abstract": " Comments: accepted for oral presentation at INTERSPEECH 2021 ",
    "url": "https://arxiv.org/abs/2104.05017",
    "authors": [
      "Sathvik Udupa",
      "Anwesha Roy",
      "Abhayjeet Singh",
      "Aravind Illa",
      "Prasanta Kumar Ghosh"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2104.10683",
    "title": "Explainable artificial intelligence for mechanics: physics-informing  neural networks for constitutive models",
    "abstract": " Comments: Preprint - Rev-1 (minor grammatical changes; prevent Google from archiving) ",
    "url": "https://arxiv.org/abs/2104.10683",
    "authors": [
      "Arnd Koeppe",
      "Franz Bamer",
      "Michael Selzer",
      "Britta Nestler",
      "Bernd Markert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2105.13010",
    "title": "An error analysis of generative adversarial networks for learning  distributions",
    "abstract": " Title: An error analysis of generative adversarial networks for learning  distributions ",
    "url": "https://arxiv.org/abs/2105.13010",
    "authors": [
      "Jian Huang",
      "Yuling Jiao",
      "Zhen Li",
      "Shiao Liu",
      "Yang Wang",
      "Yunfei Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.02245",
    "title": "Towards offensive language detection and reduction in four Software  Engineering communities",
    "abstract": " Title: Towards offensive language detection and reduction in four Software  Engineering communities ",
    "url": "https://arxiv.org/abs/2106.02245",
    "authors": [
      "Jithin Cheriyan",
      "Bastin Tony Roy Savarimuthu",
      "Stephen Cranefield"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2106.03107",
    "title": "New complexity results and algorithms for min-max-min robust  combinatorial optimization",
    "abstract": " Title: New complexity results and algorithms for min-max-min robust  combinatorial optimization ",
    "url": "https://arxiv.org/abs/2106.03107",
    "authors": [
      "Jannis Kurtz"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Computational Complexity (cs.CC)"
    ]
  }
]