[
  {
    "id": "arXiv:2209.03958",
    "title": "The Science Gateway Community Institute's Consulting Services Program:  Lessons for Research Software Engineering Organizations",
    "abstract": "The Science Gateways Community Institute (SGCI) is an NSF Software Infrastructure for Sustained Innovation (S2I2) funded project that leads and supports the science gateway community. Major activities for SGCI include a) sustainability training, including the Focus Week week-long course designed to help science gateway operators develop sustainability plans, and the Jumpstart virtual short-course; b) usability and user experience consulting; c) a community catalog of science gateways and science gateway software; d) workforce development activities, including a coding institute for students, internship opportunities, and hackathons; e) an annual conference; and f) in-depth technical support for client gateway projects. The goals of SGCI's Embedded Technical Support component are to help the institute's clients to create new science gateways or to significantly enhance existing science gateways. Examples of the latter include helping to implement major new capabilities and to implement significant usability improvements suggested by SGCI's usability consultants. The Embedded Technical Support component was managed by Indiana University and involved research software engineers at San Diego Supercomputer Center, Texas Advanced Computing Center, Indiana University, and Purdue University (through 2019). Since 2016, the component has involved 20 research software engineers as consultants and has conducted 59 client consultations. This short paper provides a summary of lessons learned from the Embedded Technical Support program that may be useful for the research software engineering community. ",
    "url": "https://arxiv.org/abs/2209.03958",
    "authors": [
      "Marlon Pierce",
      "Michael Zentner",
      "Maytal Dahan",
      "Sandra Gesing",
      "Claire Stirm",
      "Linda Bailey Hayden"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2209.03984",
    "title": "$Δ$-PINNs: physics-informed neural networks on complex geometries",
    "abstract": "Physics-informed neural networks (PINNs) have demonstrated promise in solving forward and inverse problems involving partial differential equations. Despite recent progress on expanding the class of problems that can be tackled by PINNs, most of existing use-cases involve simple geometric domains. To date, there is no clear way to inform PINNs about the topology of the domain where the problem is being solved. In this work, we propose a novel positional encoding mechanism for PINNs based on the eigenfunctions of the Laplace-Beltrami operator. This technique allows to create an input space for the neural network that represents the geometry of a given object. We approximate the eigenfunctions as well as the operators involved in the partial differential equations with finite elements. We extensively test and compare the proposed methodology against traditional PINNs in complex shapes, such as a coil, a heat sink and a bunny, with different physics, such as the Eikonal equation and heat transfer. We also study the sensitivity of our method to the number of eigenfunctions used, as well as the discretization used for the eigenfunctions and the underlying operators. Our results show excellent agreement with the ground truth data in cases where traditional PINNs fail to produce a meaningful solution. We envision this new technique will expand the effectiveness of PINNs to more realistic applications. ",
    "url": "https://arxiv.org/abs/2209.03984",
    "authors": [
      "Francisco Sahli Costabal",
      "Simone Pezzuto",
      "Paris Perdikaris"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.04007",
    "title": "FedDAR: Federated Domain-Aware Representation Learning",
    "abstract": "Cross-silo Federated learning (FL) has become a promising tool in machine learning applications for healthcare. It allows hospitals/institutions to train models with sufficient data while the data is kept private. To make sure the FL model is robust when facing heterogeneous data among FL clients, most efforts focus on personalizing models for clients. However, the latent relationships between clients' data are ignored. In this work, we focus on a special non-iid FL problem, called Domain-mixed FL, where each client's data distribution is assumed to be a mixture of several predefined domains. Recognizing the diversity of domains and the similarity within domains, we propose a novel method, FedDAR, which learns a domain shared representation and domain-wise personalized prediction heads in a decoupled manner. For simplified linear regression settings, we have theoretically proved that FedDAR enjoys a linear convergence rate. For general settings, we have performed intensive empirical studies on both synthetic and real-world medical datasets which demonstrate its superiority over prior FL methods. ",
    "url": "https://arxiv.org/abs/2209.04007",
    "authors": [
      "Aoxiao Zhong",
      "Hao He",
      "Zhaolin Ren",
      "Na Li",
      "Quanzheng Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.04022",
    "title": "Privacy of Autonomous Vehicles: Risks, Protection Methods, and Future  Directions",
    "abstract": "Recent advances in machine learning have enabled its wide application in different domains, and one of the most exciting applications is autonomous vehicles (AVs), which have encouraged the development of a number of ML algorithms from perception to prediction to planning. However, training AVs usually requires a large amount of training data collected from different driving environments (e.g., cities) as well as different types of personal information (e.g., working hours and routes). Such collected large data, treated as the new oil for ML in the data-centric AI era, usually contains a large amount of privacy-sensitive information which is hard to remove or even audit. Although existing privacy protection approaches have achieved certain theoretical and empirical success, there is still a gap when applying them to real-world applications such as autonomous vehicles. For instance, when training AVs, not only can individually identifiable information reveal privacy-sensitive information, but also population-level information such as road construction within a city, and proprietary-level commercial secrets of AVs. Thus, it is critical to revisit the frontier of privacy risks and corresponding protection approaches in AVs to bridge this gap. Following this goal, in this work, we provide a new taxonomy for privacy risks and protection methods in AVs, and we categorize privacy in AVs into three levels: individual, population, and proprietary. We explicitly list out recent challenges to protect each of these levels of privacy, summarize existing solutions to these challenges, discuss the lessons and conclusions, and provide potential future directions and opportunities for both researchers and practitioners. We believe this work will help to shape the privacy research in AV and guide the privacy protection technology design. ",
    "url": "https://arxiv.org/abs/2209.04022",
    "authors": [
      "Chulin Xie",
      "Zhong Cao",
      "Yunhui Long",
      "Diange Yang",
      "Ding Zhao",
      "Bo Li"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.04030",
    "title": "Uncovering the Connection Between Differential Privacy and Certified  Robustness of Federated Learning against Poisoning Attacks",
    "abstract": "Federated learning (FL) provides an efficient paradigm to jointly train a global model leveraging data from distributed users. As the local training data come from different users who may not be trustworthy, several studies have shown that FL is vulnerable to poisoning attacks. Meanwhile, to protect the privacy of local users, FL is always trained in a differentially private way (DPFL). Thus, in this paper, we ask: Can we leverage the innate privacy property of DPFL to provide certified robustness against poisoning attacks? Can we further improve the privacy of FL to improve such certification? We first investigate both user-level and instance-level privacy of FL and propose novel mechanisms to achieve improved instance-level privacy. We then provide two robustness certification criteria: certified prediction and certified attack cost for DPFL on both levels. Theoretically, we prove the certified robustness of DPFL under a bounded number of adversarial users or instances. Empirically, we conduct extensive experiments to verify our theories under a range of attacks on different datasets. We show that DPFL with a tighter privacy guarantee always provides stronger robustness certification in terms of certified attack cost, but the optimal certified prediction is achieved under a proper balance between privacy protection and utility loss. ",
    "url": "https://arxiv.org/abs/2209.04030",
    "authors": [
      "Chulin Xie",
      "Yunhui Long",
      "Pin-Yu Chen",
      "Bo Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.04053",
    "title": "Algorithms with More Granular Differential Privacy Guarantees",
    "abstract": "Differential privacy is often applied with a privacy parameter that is larger than the theory suggests is ideal; various informal justifications for tolerating large privacy parameters have been proposed. In this work, we consider partial differential privacy (DP), which allows quantifying the privacy guarantee on a per-attribute basis. In this framework, we study several basic data analysis and learning tasks, and design algorithms whose per-attribute privacy parameter is smaller that the best possible privacy parameter for the entire record of a person (i.e., all the attributes). ",
    "url": "https://arxiv.org/abs/2209.04053",
    "authors": [
      "Badih Ghazi",
      "Ravi Kumar",
      "Pasin Manurangsi",
      "Thomas Steinke"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.04061",
    "title": "im2nerf: Image to Neural Radiance Field in the Wild",
    "abstract": "We propose im2nerf, a learning framework that predicts a continuous neural object representation given a single input image in the wild, supervised by only segmentation output from off-the-shelf recognition methods. The standard approach to constructing neural radiance fields takes advantage of multi-view consistency and requires many calibrated views of a scene, a requirement that cannot be satisfied when learning on large-scale image data in the wild. We take a step towards addressing this shortcoming by introducing a model that encodes the input image into a disentangled object representation that contains a code for object shape, a code for object appearance, and an estimated camera pose from which the object image is captured. Our model conditions a NeRF on the predicted object representation and uses volume rendering to generate images from novel views. We train the model end-to-end on a large collection of input images. As the model is only provided with single-view images, the problem is highly under-constrained. Therefore, in addition to using a reconstruction loss on the synthesized input view, we use an auxiliary adversarial loss on the novel rendered views. Furthermore, we leverage object symmetry and cycle camera pose consistency. We conduct extensive quantitative and qualitative experiments on the ShapeNet dataset as well as qualitative experiments on Open Images dataset. We show that in all cases, im2nerf achieves the state-of-the-art performance for novel view synthesis from a single-view unposed image in the wild. ",
    "url": "https://arxiv.org/abs/2209.04061",
    "authors": [
      "Lu Mi",
      "Abhijit Kundu",
      "David Ross",
      "Frank Dellaert",
      "Noah Snavely",
      "Alireza Fathi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.04071",
    "title": "Audio Analytics-based Human Trafficking Detection Framework for  Autonomous Vehicles",
    "abstract": "Human trafficking is a universal problem, persistent despite numerous efforts to combat it globally. Individuals of any age, race, ethnicity, sex, gender identity, sexual orientation, nationality, immigration status, cultural background, religion, socioeconomic class, and education can be a victim of human trafficking. With the advancements in technology and the introduction of autonomous vehicles (AVs), human traffickers will adopt new ways to transport victims, which could accelerate the growth of organized human trafficking networks, which can make the detection of trafficking in persons more challenging for law enforcement agencies. The objective of this study is to develop an innovative audio analytics-based human trafficking detection framework for autonomous vehicles. The primary contributions of this study are to: (i) define four non-trivial, feasible, and realistic human trafficking scenarios for AVs; (ii) create a new and comprehensive audio dataset related to human trafficking with five classes i.e., crying, screaming, car door banging, car noise, and conversation; and (iii) develop a deep 1-D Convolution Neural Network (CNN) architecture for audio data classification related to human trafficking. We have also conducted a case study using the new audio dataset and evaluated the audio classification performance of the deep 1-D CNN. Our analyses reveal that the deep 1-D CNN can distinguish sound coming from a human trafficking victim from a non-human trafficking sound with an accuracy of 95%, which proves the efficacy of our framework. ",
    "url": "https://arxiv.org/abs/2209.04071",
    "authors": [
      "Sagar Dasgupta",
      "Kazi Shakib",
      "Mizanur Rahman",
      "Silvana V Croope",
      "Steven Jones"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2209.04077",
    "title": "Prediction method of Soundscape Impressions using Environmental Sounds  and Aerial Photographs",
    "abstract": "We investigate an method for quantifying city characteristics based on impressions of a sound environment. The quantification of the city characteristics will be beneficial to government policy planning, tourism projects, etc. In this study, we try to predict two soundscape impressions, meaning pleasantness and eventfulness, using sound data collected by the cloud-sensing method. The collected sounds comprise meta information of recording location using Global Positioning System. Furthermore, the soundscape impressions and sound-source features are separately assigned to the cloud-sensing sounds by assessments defined using Swedish Soundscape-Quality Protocol, assessing the quality of the acoustic environment. The prediction models are built using deep neural networks with multi-layer perceptron for the input of 10-second sound and the aerial photographs of its location. An acoustic feature comprises equivalent noise level and outputs of octave-band filters every second, and statistics of them in 10~s. An image feature is extracted from an aerial photograph using ResNet-50 and autoencoder architecture. We perform comparison experiments to demonstrate the benefit of each feature. As a result of the comparison, aerial photographs and sound-source features are efficient to predict impression information. Additionally, even if the sound-source features are predicted using acoustic and image features, the features also show fine results to predict the soundscape impression close to the result of oracle sound-source features. ",
    "url": "https://arxiv.org/abs/2209.04077",
    "authors": [
      "Yusuke Ono",
      "Sunao Hara",
      "Masanobu Abe"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2209.04093",
    "title": "Learning Audio-Visual embedding for Wild Person Verification",
    "abstract": "It has already been observed that audio-visual embedding can be extracted from these two modalities to gain robustness for person verification. However, the aggregator that used to generate a single utterance representation from each frame does not seem to be well explored. In this article, we proposed an audio-visual network that considers aggregator from a fusion perspective. We introduced improved attentive statistics pooling for the first time in face verification. Then we find that strong correlation exists between modalities during pooling, so joint attentive pooling is proposed which contains cycle consistency to learn the implicit inter-frame weight. Finally, fuse the modality with a gated attention mechanism. All the proposed models are trained on the VoxCeleb2 dev dataset and the best system obtains 0.18\\%, 0.27\\%, and 0.49\\% EER on three official trail lists of VoxCeleb1 respectively, which is to our knowledge the best-published results for person verification. As an analysis, visualization maps are generated to explain how this system interact between modalities. ",
    "url": "https://arxiv.org/abs/2209.04093",
    "authors": [
      "Peiwen Sun",
      "Shanshan Zhang",
      "Zishan Liu",
      "Yougen Yuan",
      "Taotao Zhang",
      "Honggang Zhang",
      "Pengfei Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2209.04113",
    "title": "Robust and Lossless Fingerprinting of Deep Neural Networks via Pooled  Membership Inference",
    "abstract": "Deep neural networks (DNNs) have already achieved great success in a lot of application areas and brought profound changes to our society. However, it also raises new security problems, among which how to protect the intellectual property (IP) of DNNs against infringement is one of the most important yet very challenging topics. To deal with this problem, recent studies focus on the IP protection of DNNs by applying digital watermarking, which embeds source information and/or authentication data into DNN models by tuning network parameters directly or indirectly. However, tuning network parameters inevitably distorts the DNN and therefore surely impairs the performance of the DNN model on its original task regardless of the degree of the performance degradation. It has motivated the authors in this paper to propose a novel technique called \\emph{pooled membership inference (PMI)} so as to protect the IP of the DNN models. The proposed PMI neither alters the network parameters of the given DNN model nor fine-tunes the DNN model with a sequence of carefully crafted trigger samples. Instead, it leaves the original DNN model unchanged, but can determine the ownership of the DNN model by inferring which mini-dataset among multiple mini-datasets was once used to train the target DNN model, which differs from previous arts and has remarkable potential in practice. Experiments also have demonstrated the superiority and applicability of this work. ",
    "url": "https://arxiv.org/abs/2209.04113",
    "authors": [
      "Hanzhou Wu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.04114",
    "title": "An Artificial Chemistry Implementation of a Gene Regulatory Network",
    "abstract": "Gene Regulatory Networks are networks of interactions in biological organisms responsible for determining the production levels of proteins and peptides. Proteins are workers of a cell factory, and their production defines the goal of a cell and its development. Various attempts have been made to model such networks both to understand these biological systems better and to use inspiration from understanding them to solve computational problems. In this work, a biologically more realistic model for gene regulatory networks is proposed, which incorporates Cellular Automata and Artificial Chemistry to model the interactions between regulatory proteins called the Transcription Factors and the regulatory sites of genes. The result of this work shows complex dynamics close to what can be observed in nature. Here, an analysis of the impact of the initial states of the system on the produced dynamics is performed, showing that such evolvable models can be directed towards producing desired protein dynamics. ",
    "url": "https://arxiv.org/abs/2209.04114",
    "authors": [
      "Iliya Miralavy",
      "Wolfgang Banzhaf"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2209.04121",
    "title": "Fast Neural Kernel Embeddings for General Activations",
    "abstract": "Infinite width limit has shed light on generalization and optimization aspects of deep learning by establishing connections between neural networks and kernel methods. Despite their importance, the utility of these kernel methods was limited in large-scale learning settings due to their (super-)quadratic runtime and memory complexities. Moreover, most prior works on neural kernels have focused on the ReLU activation, mainly due to its popularity but also due to the difficulty of computing such kernels for general activations. In this work, we overcome such difficulties by providing methods to work with general activations. First, we compile and expand the list of activation functions admitting exact dual activation expressions to compute neural kernels. When the exact computation is unknown, we present methods to effectively approximate them. We propose a fast sketching method that approximates any multi-layered Neural Network Gaussian Process (NNGP) kernel and Neural Tangent Kernel (NTK) matrices for a wide range of activation functions, going beyond the commonly analyzed ReLU activation. This is done by showing how to approximate the neural kernels using the truncated Hermite expansion of any desired activation functions. While most prior works require data points on the unit sphere, our methods do not suffer from such limitations and are applicable to any dataset of points in $\\mathbb{R}^d$. Furthermore, we provide a subspace embedding for NNGP and NTK matrices with near input-sparsity runtime and near-optimal target dimension which applies to any \\emph{homogeneous} dual activation functions with rapidly convergent Taylor expansion. Empirically, with respect to exact convolutional NTK (CNTK) computation, our method achieves $106\\times$ speedup for approximate CNTK of a 5-layer Myrtle network on CIFAR-10 dataset. ",
    "url": "https://arxiv.org/abs/2209.04121",
    "authors": [
      "Insu Han",
      "Amir Zandieh",
      "Jaehoon Lee",
      "Roman Novak",
      "Lechao Xiao",
      "Amin Karbasi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2209.04129",
    "title": "A Worldwide Look Into Mobile Access Networks Through the Eyes of AmiGos",
    "abstract": "Mobile phones are nowadays the predominant way for users to access the Internet. Despite modern phones are often more powerful than fixed devices, the majority of users worldwide still rely on simple devices, with limited hardware capabilities (small CPUs and memory, 2.4Ghz WiFi). In this paper, we investigate the user experience of low-end mobile devices world-wide. The goal is to answer high level questions like \"which performance can you expect at a 10$ cost around the world?\", as well as low level questions like \"what is the culprit of a slowdown? the low-end device or network provisioning?\". This is a challenging study we tackled by building the AmiGo test-bed, which relies on friends (hence the name) to carry - not use - mobile phones while traveling, guaranteeing network connectivity, i.e., WiFi and/or mobile data when possible. We deployed this test-bed through 31 low-end devices which traveled across 24 countries over a month. Our analysis shows that the performance of mobile networks varies significantly across the globe, where only a hands-full of networks manage to achieve excellent network performance across a stack of experiments. Specifically: a) 50% of the mobile networks show a 40-70% chance of encountering a low data rate, b) only 20% of mobile networks are characterized by low latencies (<20ms to popular domains), c) networks across Asia, central/south America, and Africa have much higher CDN download times compared to Europe, exceeding a 10x increase in the case of Africa, d) most news websites load slowly, whereas YouTube achieves satisfactory performance, overall. ",
    "url": "https://arxiv.org/abs/2209.04129",
    "authors": [
      "Matteo Varvello",
      "Yasir Zaki"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2209.04137",
    "title": "Machine Learning-based Selection of Graph Partitioning Strategy Using  the Characteristics of Graph Data and Algorithm",
    "abstract": "Analyzing large graph data is an essential part of many modern applications, such as social networks. Due to its large computational complexity, distributed processing is frequently employed. This requires graph data to be divided across nodes, and the choice of partitioning strategy has a great impact on the execution time of the task. Yet, there is no one-size-fits-all partitioning strategy that performs well on arbitrary graph data and algorithms. The performance of a strategy depends on the characteristics of the graph data and algorithms. Moreover, due to the complexity of graph data and algorithms, manually identifying the best partitioning strategy is also infeasible. In this work, we propose a machine learning-based approach to select the most appropriate partitioning strategy for a given graph and processing algorithm. Our approach enumerates viable partitioning strategies, predicts the execution time of the target algorithm for each, and selects the partitioning strategy with the fastest estimated execution time. Our machine learning model is trained on features extracted from graph data and algorithm pseudo-code. We also propose a method that augments real execution logs of graph tasks to create a large synthetic dataset. Evaluation results show that the strategies selected by our approach lead to 1.46X faster execution time on average compared with the mean execution time of the partitioning strategies and about 0.95X the performance compared to the best partitioning strategy. ",
    "url": "https://arxiv.org/abs/2209.04137",
    "authors": [
      "YoungJoon Park",
      "DongKyu Lee",
      "Tien-Cuong Bui"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2209.04142",
    "title": "Joint Non-parametric Point Process model for Treatments and Outcomes:  Counterfactual Time-series Prediction Under Policy Interventions",
    "abstract": "Policy makers need to predict the progression of an outcome before adopting a new treatment policy, which defines when and how a sequence of treatments affecting the outcome occurs in continuous time. Commonly, algorithms that predict interventional future outcome trajectories take a fixed sequence of future treatments as input. This either neglects the dependence of future treatments on outcomes preceding them or implicitly assumes the treatment policy is known, and hence excludes scenarios where the policy is unknown or a counterfactual analysis is needed. To handle these limitations, we develop a joint model for treatments and outcomes, which allows for the estimation of treatment policies and effects from sequential treatment--outcome data. It can answer interventional and counterfactual queries about interventions on treatment policies, as we show with real-world data on blood glucose progression and a simulation study building on top of this. ",
    "url": "https://arxiv.org/abs/2209.04142",
    "authors": [
      "Çağlar Hızlı",
      "ST John",
      "Anne Juuti",
      "Tuure Saarinen",
      "Kirsi Pietiläinen",
      "Pekka Marttinen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2209.04148",
    "title": "Domain-specific Learning of Multi-scale Facial Dynamics for Apparent  Personality Traits Prediction",
    "abstract": "Human personality decides various aspects of their daily life and working behaviors. Since personality traits are relatively stable over time and unique for each subject, previous approaches frequently infer personality from a single frame or short-term behaviors. Moreover, most of them failed to specifically extract person-specific and unique cues for personality recognition. In this paper, we propose a novel video-based automatic personality traits recognition approach which consists of: (1) a \\textbf{domain-specific facial behavior modelling} module that extracts personality-related multi-scale short-term human facial behavior features; (2) a \\textbf{long-term behavior modelling} module that summarizes all short-term features of a video as a long-term/video-level personality representation and (3) a \\textbf{multi-task personality traits prediction module} that models underlying relationship among all traits and jointly predict them based on the video-level personality representation. We conducted the experiments on ChaLearn First Impression dataset, and our approach achieved comparable results to the state-of-the-art. Importantly, we show that all three proposed modules brought important benefits for personality recognition. ",
    "url": "https://arxiv.org/abs/2209.04148",
    "authors": [
      "Fang Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.04154",
    "title": "SUPER-Rec: SUrrounding Position-Enhanced Representation for  Recommendation",
    "abstract": "Collaborative filtering problems are commonly solved based on matrix completion techniques which recover the missing values of user-item interaction matrices. In a matrix, the rating position specifically represents the user given and the item rated. Previous matrix completion techniques tend to neglect the position of each element (user, item and ratings) in the matrix but mainly focus on semantic similarity between users and items to predict the missing value in a matrix. This paper proposes a novel position-enhanced user/item representation training model for recommendation, SUPER-Rec. We first capture the rating position in the matrix using the relative positional rating encoding and store the position-enhanced rating information and its user-item relationship to the fixed dimension of embedding that is not affected by the matrix size. Then, we apply the trained position-enhanced user and item representations to the simplest traditional machine learning models to highlight the pure novelty of our representation learning model. We contribute the first formal introduction and quantitative analysis of position-enhanced item representation in the recommendation domain and produce a principled discussion about our SUPER-Rec to the outperformed performance of typical collaborative filtering recommendation tasks with both explicit and implicit feedback. ",
    "url": "https://arxiv.org/abs/2209.04154",
    "authors": [
      "Taejun Lim",
      "Siqu Long",
      "Josiah Poon",
      "Soyeon Caren Han"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.04156",
    "title": "Multi-grained Label Refinement Network with Dependency Structures for  Joint Intent Detection and Slot Filling",
    "abstract": "Slot filling and intent detection are two fundamental tasks in the field of natural language understanding. Due to the strong correlation between these two tasks, previous studies make efforts on modeling them with multi-task learning or designing feature interaction modules to improve the performance of each task. However, none of the existing approaches consider the relevance between the structural information of sentences and the label semantics of two tasks. The intent and semantic components of a utterance are dependent on the syntactic elements of a sentence. In this paper, we investigate a multi-grained label refinement network, which utilizes dependency structures and label semantic embeddings. Considering to enhance syntactic representations, we introduce the dependency structures of sentences into our model by graph attention layer. To capture the semantic dependency between the syntactic information and task labels, we combine the task specific features with corresponding label embeddings by attention mechanism. The experimental results demonstrate that our model achieves the competitive performance on two public datasets. ",
    "url": "https://arxiv.org/abs/2209.04156",
    "authors": [
      "Baohang Zhou",
      "Ying Zhang",
      "Xuhui Sui",
      "Kehui Song",
      "Xiaojie Yuan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.04167",
    "title": "Overlapped speech and gender detection with WavLM pre-trained features",
    "abstract": "This article focuses on overlapped speech and gender detection in order to study interactions between women and men in French audiovisual media (Gender Equality Monitoring project). In this application context, we need to automatically segment the speech signal according to speakers gender, and to identify when at least two speakers speak at the same time. We propose to use WavLM model which has the advantage of being pre-trained on a huge amount of speech data, to build an overlapped speech detection (OSD) and a gender detection (GD) systems. In this study, we use two different corpora. The DIHARD III corpus which is well adapted for the OSD task but lack gender information. The ALLIES corpus fits with the project application context. Our best OSD system is a Temporal Convolutional Network (TCN) with WavLM pre-trained features as input, which reaches a new state-of-the-art F1-score performance on DIHARD. A neural GD is trained with WavLM inputs on a gender balanced subset of the French broadcast news ALLIES data, and obtains an accuracy of 97.9%. This work opens new perspectives for human science researchers regarding the differences of representation between women and men in French media. ",
    "url": "https://arxiv.org/abs/2209.04167",
    "authors": [
      "Martin Lebourdais",
      "Marie Tahon",
      "Antoine Laurent",
      "Sylvain Meignier"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2209.04173",
    "title": "Explanation Method for Anomaly Detection on Mixed Numerical and  Categorical Spaces",
    "abstract": "Most proposals in the anomaly detection field focus exclusively on the detection stage, specially in the recent deep learning approaches. While providing highly accurate predictions, these models often lack transparency, acting as \"black boxes\". This criticism has grown to the point that explanation is now considered very relevant in terms of acceptability and reliability. In this paper, we addressed this issue by inspecting the ADMNC (Anomaly Detection on Mixed Numerical and Categorical Spaces) model, an existing very accurate although opaque anomaly detector capable to operate with both numerical and categorical inputs. This work presents the extension EADMNC (Explainable Anomaly Detection on Mixed Numerical and Categorical spaces), which adds explainability to the predictions obtained with the original model. We preserved the scalability of the original method thanks to the Apache Spark framework. EADMNC leverages the formulation of the previous ADMNC model to offer pre hoc and post hoc explainability, while maintaining the accuracy of the original architecture. We present a pre hoc model that globally explains the outputs by segmenting input data into homogeneous groups, described with only a few variables. We designed a graphical representation based on regression trees, which supervisors can inspect to understand the differences between normal and anomalous data. Our post hoc explanations consist of a text-based template method that locally provides textual arguments supporting each detection. We report experimental results on extensive real-world data, particularly in the domain of network intrusion detection. The usefulness of the explanations is assessed by theory analysis using expert knowledge in the network intrusion domain. ",
    "url": "https://arxiv.org/abs/2209.04173",
    "authors": [
      "Iñigo López-Riobóo Botana",
      "Carlos Eiras-Franco",
      "Julio Hernandez-Castro",
      "Amparo Alonso-Betanzos"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2209.04184",
    "title": "Anomaly Detection through Unsupervised Federated Learning",
    "abstract": "Federated learning (FL) is proving to be one of the most promising paradigms for leveraging distributed resources, enabling a set of clients to collaboratively train a machine learning model while keeping the data decentralized. The explosive growth of interest in the topic has led to rapid advancements in several core aspects like communication efficiency, handling non-IID data, privacy, and security capabilities. However, the majority of FL works only deal with supervised tasks, assuming that clients' training sets are labeled. To leverage the enormous unlabeled data on distributed edge devices, in this paper, we aim to extend the FL paradigm to unsupervised tasks by addressing the problem of anomaly detection in decentralized settings. In particular, we propose a novel method in which, through a preprocessing phase, clients are grouped into communities, each having similar majority (i.e., inlier) patterns. Subsequently, each community of clients trains the same anomaly detection model (i.e., autoencoders) in a federated fashion. The resulting model is then shared and used to detect anomalies within the clients of the same community that joined the corresponding federated process. Experiments show that our method is robust, and it can detect communities consistent with the ideal partitioning in which groups of clients having the same inlier patterns are known. Furthermore, the performance is significantly better than those in which clients train models exclusively on local data and comparable with federated models of ideal communities' partition. ",
    "url": "https://arxiv.org/abs/2209.04184",
    "authors": [
      "Mirko Nardi",
      "Lorenzo Valerio",
      "Andrea Passarella"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.04185",
    "title": "Simple and Powerful Architecture for Inductive Recommendation Using  Knowledge Graph Convolutions",
    "abstract": "Using graph models with relational information in recommender systems has shown promising results. Yet, most methods are transductive, i.e., they are based on dimensionality reduction architectures. Hence, they require heavy retraining every time new items or users are added. Conversely, inductive methods promise to solve these issues. Nonetheless, all inductive methods rely only on interactions, making recommendations for users with few interactions sub-optimal and even impossible for new items. Therefore, we focus on inductive methods able to also exploit knowledge graphs (KGs). In this work, we propose SimpleRec, a strong baseline that uses a graph neural network and a KG to provide better recommendations than related inductive methods for new users and items. We show that it is unnecessary to create complex model architectures for user representations, but it is enough to allow users to be represented by the few ratings they provide and the indirect connections among them without any user metadata. As a result, we re-evaluate state-of-the-art methods, identify better evaluation protocols, highlight unwarranted conclusions from previous proposals, and showcase a novel, stronger baseline for this task. ",
    "url": "https://arxiv.org/abs/2209.04185",
    "authors": [
      "Theis E. Jendal",
      "Matteo Lissandrini",
      "Peter Dolog",
      "Katja Hose"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2209.04187",
    "title": "Efficient Multi-view Clustering via Unified and Discrete Bipartite Graph  Learning",
    "abstract": "Although previous graph-based multi-view clustering algorithms have gained significant progress, most of them are still faced with three limitations. First, they often suffer from high computational complexity, which restricts their applications in large-scale scenarios. Second, they usually perform graph learning either at the single-view level or at the view-consensus level, but often neglect the possibility of the joint learning of single-view and consensus graphs. Third, many of them rely on the $k$-means for discretization of the spectral embeddings, which lack the ability to directly learn the graph with discrete cluster structure. In light of this, this paper presents an efficient multi-view clustering approach via unified and discrete bipartite graph learning (UDBGL). Specifically, the anchor-based subspace learning is incorporated to learn the view-specific bipartite graphs from multiple views, upon which the bipartite graph fusion is leveraged to learn a view-consensus bipartite graph with adaptive weight learning. Further, the Laplacian rank constraint is imposed to ensure that the fused bipartite graph has discrete cluster structures (with a specific number of connected components). By simultaneously formulating the view-specific bipartite graph learning, the view-consensus bipartite graph learning, and the discrete cluster structure learning into a unified objective function, an efficient minimization algorithm is then designed to tackle this optimization problem and directly achieve a discrete clustering solution without requiring additional partitioning, which notably has linear time complexity in data size. Experiments on a variety of multi-view datasets demonstrate the robustness and efficiency of our UDBGL approach. ",
    "url": "https://arxiv.org/abs/2209.04187",
    "authors": [
      "Si-Guo Fang",
      "Dong Huang",
      "Xiao-Sha Cai",
      "Chang-Dong Wang",
      "Chaobo He",
      "Yong Tang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.04203",
    "title": "An Indian Roads Dataset for Supported and Suspended Traffic Lights  Detection",
    "abstract": "Autonomous vehicles are growing rapidly, in well-developed nations like America, Europe, and China. Tech giants like Google, Tesla, Audi, BMW, and Mercedes are building highly efficient self-driving vehicles. However, the technology is still not mainstream for developing nations like India, Thailand, Africa, etc., In this paper, we present a thorough comparison of the existing datasets based on well-developed nations as well as Indian roads. We then developed a new dataset \"Indian Roads Dataset\" (IRD) having more than 8000 annotations extracted from 3000+ images shot using a 64 (megapixel) camera. All the annotations are manually labelled adhering to the strict rules of annotations. Real-time video sequences have been captured from two different cities in India namely New Delhi and Chandigarh during the day and night-light conditions. Our dataset exceeds previous Indian traffic light datasets in size, annotations, and variance. We prove the amelioration of our dataset by providing an extensive comparison with existing Indian datasets. Various dataset criteria like size, capturing device, a number of cities, and variations of traffic light orientations are considered. The dataset can be downloaded from here https://sites.google.com/view/ird-dataset/home ",
    "url": "https://arxiv.org/abs/2209.04203",
    "authors": [
      "Sarita Gautam",
      "Anuj Kumar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.04218",
    "title": "Self-supervised Learning for Heterogeneous Graph via Structure  Information based on Metapath",
    "abstract": "graph neural networks (GNNs) are the dominant paradigm for modeling and handling graph structure data by learning universal node representation. The traditional way of training GNNs depends on a great many labeled data, which results in high requirements on cost and time. In some special scene, it is even unavailable and impracticable. Self-supervised representation learning, which can generate labels by graph structure data itself, is a potential approach to tackle this problem. And turning to research on self-supervised learning problem for heterogeneous graphs is more challenging than dealing with homogeneous graphs, also there are fewer studies about it. In this paper, we propose a SElfsupervised learning method for heterogeneous graph via Structure Information based on Metapath (SESIM). The proposed model can construct pretext tasks by predicting jump number between nodes in each metapath to improve the representation ability of primary task. In order to predict jump number, SESIM uses data itself to generate labels, avoiding time-consuming manual labeling. Moreover, predicting jump number in each metapath can effectively utilize graph structure information, which is the essential property between nodes. Therefore, SESIM deepens the understanding of models for graph structure. At last, we train primary task and pretext tasks jointly, and use meta-learning to balance the contribution of pretext tasks for primary task. Empirical results validate the performance of SESIM method and demonstrate that this method can improve the representation ability of traditional neural networks on link prediction task and node classification task. ",
    "url": "https://arxiv.org/abs/2209.04218",
    "authors": [
      "Shuai Ma",
      "Jian-wei Liu",
      "Xin Zuo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.04220",
    "title": "A Software Package for Queueing Networks and Markov Chains analysis",
    "abstract": "Queueing networks and Markov chains are widely used for conducting performance and reliability studies. In this paper we describe the queueing package, a free software package for queueing networks and Markov chain analysis for GNU Octave. The queueing package provides implementations of numerical algorithms for computing transient and steady-state performance measures of discrete and continuous Markov chains, and for steady-state analysis of single-station queueing systems and queueing networks. We illustrate the design principles of the queueing package, describe its most salient features and provide some usage examples. ",
    "url": "https://arxiv.org/abs/2209.04220",
    "authors": [
      "Moreno Marzolla"
    ],
    "subjectives": [
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2209.04238",
    "title": "An asymptotic preserving hybrid-dG method for convection-diffusion  equations on pipe networks",
    "abstract": "We study the numerical approximation of singularly perturbed convection-diffusion problems on one-dimensional pipe networks. In the vanishing diffusion limit, the number and type of boundary conditions and coupling conditions at network junctions changes, which gives rise to singular layers at the outflow boundaries of the pipes. A hybrid discontinuous Galerkin method is proposed, which provides a natural upwind mechanism for the convection-dominated case. Moreover, the method automatically handles the variable coupling and boundary conditions in the vanishing diffusion limit, leading to an asymptotic-preserving scheme. A detailed analysis of the singularities of the solution and the discretization error is presented, and an adaptive strategy is proposed, leading to order optimal error estimates that hold uniformly in the singular perturbation limit. The theoretical results are confirmed by numerical tests. ",
    "url": "https://arxiv.org/abs/2209.04238",
    "authors": [
      "Herbert Egger",
      "Nora Philippi"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2209.04254",
    "title": "Shapley value-based approaches to explain the robustness of classifiers  in machine learning",
    "abstract": "In machine learning, the use of algorithm-agnostic approaches is an emerging area of research for explaining the contribution of individual features towards the predicted outcome. Whilst there is a focus on explaining the prediction itself, a little has been done on explaining the robustness of these models, that is, how each feature contributes towards achieving that robustness. In this paper, we propose the use of Shapley values to explain the contribution of each feature towards the model's robustness, measured in terms of Receiver-operating Characteristics (ROC) curve and the Area under the ROC curve (AUC). With the help of an illustrative example, we demonstrate the proposed idea of explaining the ROC curve, and visualising the uncertainties in these curves. For imbalanced datasets, the use of Precision-Recall Curve (PRC) is considered more appropriate, therefore we also demonstrate how to explain the PRCs with the help of Shapley values. ",
    "url": "https://arxiv.org/abs/2209.04254",
    "authors": [
      "Guilherme Dean Pelegrina",
      "Sajid Siraj"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.04265",
    "title": "Location-Routing Planning for Last-Mile Deliveries Using Mobile Parcel  Lockers: A Hybrid Q-Learning Network Approach",
    "abstract": "Mobile parcel lockers (MPLs) have been recently proposed by logistics operators as a technology that could help reduce traffic congestion and operational costs in urban freight distribution. Given their ability to relocate throughout their area of deployment, they hold the potential to improve customer accessibility and convenience. In this study, we formulate the Mobile Parcel Locker Problem (MPLP), a special case of the Location-Routing Problem (LRP) which determines the optimal stopover location for MPLs throughout the day and plans corresponding delivery routes. A Hybrid Q-Learning-Network-based Method (HQM) is developed to resolve the computational complexity of the resulting large problem instances while escaping local optima. In addition, the HQM is integrated with global and local search mechanisms to resolve the dilemma of exploration and exploitation faced by classic reinforcement learning (RL) methods. We examine the performance of HQM under different problem sizes (up to 200 nodes) and benchmarked it against the Genetic Algorithm (GA). Our results indicate that the average reward obtained by HQM is 1.96 times greater than GA, which demonstrates that HQM has a better optimisation ability. Finally, we identify critical factors that contribute to fleet size requirements, travel distances, and service delays. Our findings outline that the efficiency of MPLs is mainly contingent on the length of time windows and the deployment of MPL stopovers. ",
    "url": "https://arxiv.org/abs/2209.04265",
    "authors": [
      "Yubin Liu",
      "Qiming Ye",
      "Jose Escribano-Macias",
      "Yuxiang Feng",
      "Panagiotis Angeloudis"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.04293",
    "title": "Robust-by-Design Classification via Unitary-Gradient Neural Networks",
    "abstract": "The use of neural networks in safety-critical systems requires safe and robust models, due to the existence of adversarial attacks. Knowing the minimal adversarial perturbation of any input x, or, equivalently, knowing the distance of x from the classification boundary, allows evaluating the classification robustness, providing certifiable predictions. Unfortunately, state-of-the-art techniques for computing such a distance are computationally expensive and hence not suited for online applications. This work proposes a novel family of classifiers, namely Signed Distance Classifiers (SDCs), that, from a theoretical perspective, directly output the exact distance of x from the classification boundary, rather than a probability score (e.g., SoftMax). SDCs represent a family of robust-by-design classifiers. To practically address the theoretical requirements of a SDC, a novel network architecture named Unitary-Gradient Neural Network is presented. Experimental results show that the proposed architecture approximates a signed distance classifier, hence allowing an online certifiable classification of x at the cost of a single inference. ",
    "url": "https://arxiv.org/abs/2209.04293",
    "authors": [
      "Fabio Brau",
      "Giulio Rossolini",
      "Alessandro Biondi",
      "Giorgio Buttazzo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Differential Geometry (math.DG)",
      "Metric Geometry (math.MG)"
    ]
  },
  {
    "id": "arXiv:2209.04333",
    "title": "Ranking-Enhanced Unsupervised Sentence Representation Learning",
    "abstract": "Previous unsupervised sentence embedding studies have focused on data augmentation methods such as dropout masking and rule-based sentence transformation methods. However, these approaches have a limitation of controlling the fine-grained semantics of augmented views of a sentence. This results in inadequate supervision signals for capturing a semantic similarity of similar sentences. In this work, we found that using neighbor sentences enables capturing a more accurate semantic similarity between similar sentences. Based on this finding, we propose RankEncoder, which uses relations between an input sentence and sentences in a corpus for training unsupervised sentence encoders. We evaluate RankEncoder from three perspectives: 1) the semantic textual similarity performance, 2) the efficacy on similar sentence pairs, and 3) the universality of RankEncoder. Experimental results show that RankEncoder achieves 80.07\\% Spearman's correlation, a 1.1% absolute improvement compared to the previous state-of-the-art performance. The improvement is even more significant, a 1.73% improvement, on similar sentence pairs. Also, we demonstrate that RankEncoder is universally applicable to existing unsupervised sentence encoders. ",
    "url": "https://arxiv.org/abs/2209.04333",
    "authors": [
      "Yeon Seonwoo",
      "Guoyin Wang",
      "Sajal Choudhary",
      "Changmin Seo",
      "Jiwei Li",
      "Xiang Li",
      "Puyang Xu",
      "Sunghyun Park",
      "Alice Oh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2209.04354",
    "title": "On Specification-based Cyber-Attack Detection in Smart Grids",
    "abstract": "The transformation of power grids into intelligent cyber-physical systems brings numerous benefits, but also significantly increases the surface for cyber-attacks, demanding appropriate countermeasures. However, the development, validation, and testing of data-driven countermeasures against cyber-attacks, such as machine learning-based detection approaches, lack important data from real-world cyber incidents. Unlike attack data from real-world cyber incidents, infrastructure knowledge and standards are accessible through expert and domain knowledge. Our proposed approach uses domain knowledge to define the behavior of a smart grid under non-attack conditions and detect attack patterns and anomalies. Using a graph-based specification formalism, we combine cross-domain knowledge that enables the generation of whitelisting rules not only for statically defined protocol fields but also for communication ows and technical operation boundaries. Finally, we evaluate our specification-based intrusion detection system against various attack scenarios and assess detection quality and performance. In particular, we investigate a data manipulation attack in a future-orientated use case of an IEC 60870-based SCADA system that controls distributed energy resources in the distribution grid. Our approach can detect severe data manipulation attacks with high accuracy in a timely and reliable manner. ",
    "url": "https://arxiv.org/abs/2209.04354",
    "authors": [
      "Ömer Sen Dennis van der Velde",
      "Maik Lühman",
      "Florian Sprünken",
      "Immanuel Hacker",
      "Andreas Ulbig",
      "Michael Andres",
      "Martin Henze"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.04362",
    "title": "EDeNN: Event Decay Neural Networks for low latency vision",
    "abstract": "Despite the success of neural networks in computer vision tasks, digital 'neurons' are a very loose approximation of biological neurons. Today's learning approaches are designed to function on digital devices with digital data representations such as image frames. In contrast, biological vision systems are generally much more capable and efficient than state-of-the-art digital computer vision algorithms. Event cameras are an emerging sensor technology which imitates biological vision with asynchronously firing pixels, eschewing the concept of the image frame. To leverage modern learning techniques, many event-based algorithms are forced to accumulate events back to image frames, somewhat squandering the advantages of event cameras. We follow the opposite paradigm and develop a new type of neural network which operates closer to the original event data stream. We demonstrate state-of-the-art performance in angular velocity regression and competitive optical flow estimation, while avoiding difficulties related to training SNN. Furthermore, the processing latency of our proposed approached is less than 1/10 any other implementation, while continuous inference increases this improvement by another order of magnitude. ",
    "url": "https://arxiv.org/abs/2209.04362",
    "authors": [
      "Celyn Walters",
      "Simon Hadfield"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2209.04381",
    "title": "Resilient Consensus via Voronoi Communication Graphs",
    "abstract": "Consensus algorithms form the foundation for many distributed algorithms by enabling multiple robots to converge to consistent estimates of global variables using only local communication. However, standard consensus protocols can be easily led astray by non-cooperative team members. As such, the study of resilient forms of consensus is necessary for designing resilient distributed algorithms. W-MSR consensus is one such resilient consensus algorithm that allows for resilient consensus with only local knowledge of the communication graph and no a priori model for the data being shared. However, the verification that a given communication graph meets the strict graph connectivity requirement makes W-MSR difficult to use in practice. In this paper, we show that a commonly used communication graph structure in robotics literature, the communication graph built based on the Voronoi tessellation, automatically results in a sufficiently connected graph to reject a single non-cooperative team member. Further, we show how this graph can be enhanced to reject two non-cooperative team members and provide a roadmap for modifications for further resilience. This contribution will allow for the easy application of resilient consensus to algorithms that already rely on Voronoi-based communication such as distributed coverage and exploration algorithms. ",
    "url": "https://arxiv.org/abs/2209.04381",
    "authors": [
      "Kelsey Saulnier",
      "Lifeng Zhou",
      "George Pappas",
      "Vijay Kumar"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.04402",
    "title": "Proceedings of the 30th International Symposium on Graph Drawing and  Network Visualization (GD 2022)",
    "abstract": "This is the arXiv index for the electronic proceedings of GD 2022, which is held at the Tokyo Institute of Technology, Tokyo, Japan, on September 13 - 16, 2022. It contains the peer-reviewed and revised accepted papers with an optional appendix. Proceedings (without appendices) are also to be published by Springer in the Lecture Notes in Computer Science series. ",
    "url": "https://arxiv.org/abs/2209.04402",
    "authors": [
      "Patrizio Angelini",
      "Reinhard von Hanxleden"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)",
      "Human-Computer Interaction (cs.HC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2209.04436",
    "title": "Multi-NeuS: 3D Head Portraits from Single Image with Neural Implicit  Functions",
    "abstract": "We present an approach for the reconstruction of textured 3D meshes of human heads from one or few views. Since such few-shot reconstruction is underconstrained, it requires prior knowledge which is hard to impose on traditional 3D reconstruction algorithms. In this work, we rely on the recently introduced 3D representation $\\unicode{x2013}$ neural implicit functions $\\unicode{x2013}$ which, being based on neural networks, allows to naturally learn priors about human heads from data, and is directly convertible to textured mesh. Namely, we extend NeuS, a state-of-the-art neural implicit function formulation, to represent multiple objects of a class (human heads in our case) simultaneously. The underlying neural net architecture is designed to learn the commonalities among these objects and to generalize to unseen ones. Our model is trained on just a hundred smartphone videos and does not require any scanned 3D data. Afterwards, the model can fit novel heads in the few-shot or one-shot modes with good results. ",
    "url": "https://arxiv.org/abs/2209.04436",
    "authors": [
      "Egor Burkov",
      "Ruslan Rakhimov",
      "Aleksandr Safin",
      "Evgeny Burnaev",
      "Victor Lempitsky"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.04036",
    "title": "Functional dimension of feedforward ReLU neural networks",
    "abstract": "It is well-known that the parameterized family of functions representable by fully-connected feedforward neural networks with ReLU activation function is precisely the class of piecewise linear functions with finitely many pieces. It is less well-known that for every fixed architecture of ReLU neural network, the parameter space admits positive-dimensional spaces of symmetries, and hence the local functional dimension near any given parameter is lower than the parametric dimension. In this work we carefully define the notion of functional dimension, show that it is inhomogeneous across the parameter space of ReLU neural network functions, and continue an investigation - initiated in [14] and [5] - into when the functional dimension achieves its theoretical maximum. We also study the quotient space and fibers of the realization map from parameter space to function space, supplying examples of fibers that are disconnected, fibers upon which functional dimension is non-constant, and fibers upon which the symmetry group acts non-transitively. ",
    "url": "https://arxiv.org/abs/2209.04036",
    "authors": [
      "J. Elisenda Grigsby",
      "Kathryn Lindsey",
      "Robert Meyerhoff",
      "Chenxi Wu"
    ],
    "subjectives": [
      "Metric Geometry (math.MG)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.04048",
    "title": "Studying Drowsiness Detection Performance while Driving through Scalable  Machine Learning Models using Electroencephalography",
    "abstract": "Drowsiness is a major concern for drivers and one of the leading causes of traffic accidents. Advances in Cognitive Neuroscience and Computer Science have enabled the detection of drivers' drowsiness by using Brain-Computer Interfaces (BCIs) and Machine Learning (ML). Nevertheless, several challenges remain open and should be faced. First, a comprehensive enough evaluation of drowsiness detection performance using a heterogeneous set of ML algorithms is missing in the literature. Last, it is needed to study the detection performance of scalable ML models suitable for groups of subjects and compare it with the individual models proposed in the literature. To improve these limitations, this work presents an intelligent framework that employs BCIs and features based on electroencephalography (EEG) for detecting drowsiness in driving scenarios. The SEED-VIG dataset is used to feed different ML regressors and three-class classifiers and then evaluate, analyze, and compare the best-performing models for individual subjects and groups of them. More in detail, regarding individual models, Random Forest (RF) obtained a 78% f1-score, improving the 58% obtained by models used in the literature such as Support Vector Machine (SVM). Concerning scalable models, RF reached a 79% f1-score, demonstrating the effectiveness of these approaches. The lessons learned can be summarized as follows: i) not only SVM but also other models not sufficiently explored in the literature are relevant for drowsiness detection, and ii) scalable approaches suitable for groups of subjects are effective to detect drowsiness, even when new subjects that are not included in the models training are evaluated. ",
    "url": "https://arxiv.org/abs/2209.04048",
    "authors": [
      "José Manuel Hidalgo Rogel",
      "Enrique Tomás Martínez Beltrán",
      "Mario Quiles Pérez",
      "Sergio López Bernal",
      "Gregorio Martínez Pérez",
      "Alberto Huertas Celdrán"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.04326",
    "title": "Saliency Guided Adversarial Training for Learning Generalizable Features  with Applications to Medical Imaging Classification System",
    "abstract": "This work tackles a central machine learning problem of performance degradation on out-of-distribution (OOD) test sets. The problem is particularly salient in medical imaging based diagnosis system that appears to be accurate but fails when tested in new hospitals/datasets. Recent studies indicate the system might learn shortcut and non-relevant features instead of generalizable features, so-called good features. We hypothesize that adversarial training can eliminate shortcut features whereas saliency guided training can filter out non-relevant features; both are nuisance features accounting for the performance degradation on OOD test sets. With that, we formulate a novel model training scheme for the deep neural network to learn good features for classification and/or detection tasks ensuring a consistent generalization performance on OOD test sets. The experimental results qualitatively and quantitatively demonstrate the superior performance of our method using the benchmark CXR image data sets on classification tasks. ",
    "url": "https://arxiv.org/abs/2209.04326",
    "authors": [
      "Xin Li",
      "Yao Qiang",
      "Chengyin Li",
      "Sijia Liu",
      "Dongxiao Zhu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.04407",
    "title": "e-G2C: A 0.14-to-8.31 $μ$J/Inference NN-based Processor with  Continuous On-chip Adaptation for Anomaly Detection and ECG Conversion from  EGM",
    "abstract": "This work presents the first silicon-validated dedicated EGM-to-ECG (G2C) processor, dubbed e-G2C, featuring continuous lightweight anomaly detection, event-driven coarse/precise conversion, and on-chip adaptation. e-G2C utilizes neural network (NN) based G2C conversion and integrates 1) an architecture supporting anomaly detection and coarse/precise conversion via time multiplexing to balance the effectiveness and power, 2) an algorithm-hardware co-designed vector-wise sparsity resulting in a 1.6-1.7$\\times$ speedup, 3) hybrid dataflows for enhancing near 100% utilization for normal/depth-wise(DW)/point-wise(PW) convolutions (Convs), and 4) an on-chip detection threshold adaptation engine for continuous effectiveness. The achieved 0.14-8.31 $\\mu$J/inference energy efficiency outperforms prior arts under similar complexity, promising real-time detection/conversion and possibly life-critical interventions ",
    "url": "https://arxiv.org/abs/2209.04407",
    "authors": [
      "Yang Zhao",
      "Yongan Zhang",
      "Yonggan Fu",
      "Xu Ouyang",
      "Cheng Wan",
      "Shang Wu",
      "Anton Banta",
      "Mathews M. John",
      "Allison Post",
      "Mehdi Razavi",
      "Joseph Cavallaro",
      "Behnaam Aazhang",
      "Yingyan Lin"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2209.04415",
    "title": "Non-convex Quadratic Programming Using Coherent Optical Networks",
    "abstract": "We investigate the possibility of solving continuous non-convex optimization problems using a network of interacting quantum optical oscillators. We propose a native encoding of continuous variables in analog signals associated with the quadrature operators of a set of quantum optical modes. Optical coupling of the modes and noise introduced by vacuum fluctuations from external reservoirs or by weak measurements of the modes are used to optically simulate a diffusion process on a set of continuous random variables. The process is run sufficiently long for it to relax into the steady state of an energy potential defined on a continuous domain. As a first demonstration, we numerically benchmark solving box-constrained quadratic programming (BoxQP) problems using these settings. We consider delay-line and measurement-feedback variants of the experiment. Our benchmarking results demonstrate that in both cases the optical network is capable of solving BoxQP problems over three orders of magnitude faster than a state-of-the-art classical heuristic. ",
    "url": "https://arxiv.org/abs/2209.04415",
    "authors": [
      "Farhad Khosravi",
      "Ugur Yildiz",
      "Artur Scherer",
      "Pooya Ronagh"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Data Structures and Algorithms (cs.DS)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2003.00120",
    "title": "Improving Certified Robustness via Statistical Learning with Logical  Reasoning",
    "abstract": " Title: Improving Certified Robustness via Statistical Learning with Logical  Reasoning ",
    "url": "https://arxiv.org/abs/2003.00120",
    "authors": [
      "Zhuolin Yang",
      "Zhikuan Zhao",
      "Boxin Wang",
      "Jiawei Zhang",
      "Linyi Li",
      "Hengzhi Pei",
      "Bojan Karlas",
      "Ji Liu",
      "Heng Guo",
      "Ce Zhang",
      "Bo Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2004.07636",
    "title": "Hcore-Init: Neural Network Initialization based on Graph Degeneracy",
    "abstract": " Title: Hcore-Init: Neural Network Initialization based on Graph Degeneracy ",
    "url": "https://arxiv.org/abs/2004.07636",
    "authors": [
      "Stratis Limnios",
      "George Dasoulas",
      "Dimitrios M. Thilikos",
      "Michalis Vazirgiannis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2006.02567",
    "title": "Extracting a Knowledge Base of COVID-19 Events from Social Media",
    "abstract": " Comments: Accepted at COLING 2022 ",
    "url": "https://arxiv.org/abs/2006.02567",
    "authors": [
      "Shi Zong",
      "Ashutosh Baheti",
      "Wei Xu",
      "Alan Ritter"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2007.15776",
    "title": "Random Vector Functional Link Networks for Function Approximation on  Manifolds",
    "abstract": " Comments: 40 pages, 1 figure ",
    "url": "https://arxiv.org/abs/2007.15776",
    "authors": [
      "Deanna Needell",
      "Aaron A. Nelson",
      "Rayan Saab",
      "Palina Salanevich"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2011.01183",
    "title": "Adversarial Examples in Constrained Domains",
    "abstract": " Comments: Accepted to IOS Press Journal of Computer Security ",
    "url": "https://arxiv.org/abs/2011.01183",
    "authors": [
      "Ryan Sheatsley",
      "Nicolas Papernot",
      "Michael Weisman",
      "Gunjan Verma",
      "Patrick McDaniel"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2102.05855",
    "title": "Differential Privacy Dynamics of Langevin Diffusion and Noisy Gradient  Descent",
    "abstract": " Title: Differential Privacy Dynamics of Langevin Diffusion and Noisy Gradient  Descent ",
    "url": "https://arxiv.org/abs/2102.05855",
    "authors": [
      "Rishav Chourasia",
      "Jiayuan Ye",
      "Reza Shokri"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.12322",
    "title": "Distributed coloring and the local structure of unit-disk graphs",
    "abstract": " Comments: 25 pages, corrects a mistake in the proceedings version of the paper. A preliminary version of this work appeared in the proceedings of the 17th International Symposium on Algorithms and Experiments for Wireless Sensor Networks (ALGOSENSORS 2021) ",
    "url": "https://arxiv.org/abs/2106.12322",
    "authors": [
      "Louis Esperet",
      "Sébastien Julliot",
      "Arnaud de Mesmay"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computational Geometry (cs.CG)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2106.14784",
    "title": "Clarifying How Degree Entropies and Degree-Degree Correlations Relate to  Network Robustness",
    "abstract": " Comments: 13 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2106.14784",
    "authors": [
      "Chris Jones",
      "Karoline Wiesner"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2107.01495",
    "title": "On Positional and Structural Node Features for Graph Neural Networks on  Non-attributed Graphs",
    "abstract": " Comments: Accepted to CIKM 2022. The previous version is accepted for KDD-DLG Workshop 2021 (spotlight, no proceedings) ",
    "url": "https://arxiv.org/abs/2107.01495",
    "authors": [
      "Hejie Cui",
      "Zijie Lu",
      "Pan Li",
      "Carl Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2107.01614",
    "title": "Survey: Leakage and Privacy at Inference Time",
    "abstract": " Title: Survey: Leakage and Privacy at Inference Time ",
    "url": "https://arxiv.org/abs/2107.01614",
    "authors": [
      "Marija Jegorova",
      "Chaitanya Kaul",
      "Charlie Mayor",
      "Alison Q. O'Neil",
      "Alexander Weir",
      "Roderick Murray-Smith",
      "Sotirios A. Tsaftaris"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.03001",
    "title": "Learning to Rank Ace Neural Architectures via Normalized Discounted  Cumulative Gain",
    "abstract": " Comments: Code: this https URL ",
    "url": "https://arxiv.org/abs/2108.03001",
    "authors": [
      "Yuge Zhang",
      "Quanlu Zhang",
      "Li Lyna Zhang",
      "Yaming Yang",
      "Chenqian Yan",
      "Xiaotian Gao",
      "Yuqing Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.07986",
    "title": "Harnessing Perceptual Adversarial Patches for Crowd Counting",
    "abstract": " Title: Harnessing Perceptual Adversarial Patches for Crowd Counting ",
    "url": "https://arxiv.org/abs/2109.07986",
    "authors": [
      "Shunchang Liu",
      "Jiakai Wang",
      "Aishan Liu",
      "Yingwei Li",
      "Yijie Gao",
      "Xianglong Liu",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.06740",
    "title": "Review of Pedestrian Trajectory Prediction Methods: Comparing Deep  Learning and Knowledge-based Approaches",
    "abstract": " Comments: 20 pages, 7 tables, 4 figures ",
    "url": "https://arxiv.org/abs/2111.06740",
    "authors": [
      "Raphael Korbmacher",
      "Antoine Tordeux"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Physics and Society (physics.soc-ph)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.01401",
    "title": "Newton methods based convolution neural networks using parallel  processing",
    "abstract": " Title: Newton methods based convolution neural networks using parallel  processing ",
    "url": "https://arxiv.org/abs/2112.01401",
    "authors": [
      "Ujjwal Thakur",
      "Anuj Sharma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.09400",
    "title": "Equivariant Transporter Network",
    "abstract": " Comments: Project Website: this https URL ",
    "url": "https://arxiv.org/abs/2202.09400",
    "authors": [
      "Haojie Huang",
      "Dian Wang",
      "Robin Walters",
      "Robert Platt"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2203.02662",
    "title": "A Survey on Metaverse: Fundamentals, Security, and Privacy",
    "abstract": " Comments: 32 pages, 17 figures, 11 tables. Accepted by IEEE Communications Surveys & Tutorials, 2022 ",
    "url": "https://arxiv.org/abs/2203.02662",
    "authors": [
      "Yuntao Wang",
      "Zhou Su",
      "Ning Zhang",
      "Rui Xing",
      "Dongxiao Liu",
      "Tom H. Luan",
      "Xuemin Shen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.11720",
    "title": "Continuous Detection, Rapidly React: Unseen Rumors Detection based on  Continual Prompt-Tuning",
    "abstract": " Comments: final version, accpeted by COLING 2022 ",
    "url": "https://arxiv.org/abs/2203.11720",
    "authors": [
      "Yuhui Zuo",
      "Wei Zhu",
      "Guoyong Cai"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2205.07770",
    "title": "JR2net: A Joint Non-Linear Representation and Recovery Network for  Compressive Spectral Imaging",
    "abstract": " Title: JR2net: A Joint Non-Linear Representation and Recovery Network for  Compressive Spectral Imaging ",
    "url": "https://arxiv.org/abs/2205.07770",
    "authors": [
      "Brayan Monroy",
      "Jorge Bacca",
      "Henry Arguello"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.07746",
    "title": "Condensing Graphs via One-Step Gradient Matching",
    "abstract": " Comments: 11 pages, KDD2022; updated code link ",
    "url": "https://arxiv.org/abs/2206.07746",
    "authors": [
      "Wei Jin",
      "Xianfeng Tang",
      "Haoming Jiang",
      "Zheng Li",
      "Danqing Zhang",
      "Jiliang Tang",
      "Bing Yin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.05514",
    "title": "Are Gradients on Graph Structure Reliable in Gray-box Attacks?",
    "abstract": " Comments: Preprint of a full paper accepted by CIKM 2022 ",
    "url": "https://arxiv.org/abs/2208.05514",
    "authors": [
      "Zihan Liu",
      "Yun Luo",
      "Lirong Wu",
      "Siyuan Li",
      "Zicheng Liu",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.07498",
    "title": "Universal Solutions of Feedforward ReLU Networks for Interpolations",
    "abstract": " Comments: v2: minor revision ",
    "url": "https://arxiv.org/abs/2208.07498",
    "authors": [
      "Changcun Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2208.08094",
    "title": "SelF-Eval: Self-supervised Fine-grained Dialogue Evaluation",
    "abstract": " Comments: 11 pages, 2 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2208.08094",
    "authors": [
      "Longxuan Ma",
      "Ziyu Zhuang",
      "Weinan Zhang",
      "Mingda Li",
      "Ting Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.08713",
    "title": "Learning Generative Models for Active Inference using Tensor Networks",
    "abstract": " Comments: Accepted as a workshop paper at IWAI2022 @ ECML/PKDD2022 ",
    "url": "https://arxiv.org/abs/2208.08713",
    "authors": [
      "Samuel T. Wauthier",
      "Bram Vanhecke",
      "Tim Verbelen",
      "Bart Dhoedt"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.13685",
    "title": "FedEgo: Privacy-preserving Personalized Federated Graph Learning with  Ego-graphs",
    "abstract": " Comments: 25 pages, submitted to ACM Transactions on Knowledge Discovery from Data (TKDD) ",
    "url": "https://arxiv.org/abs/2208.13685",
    "authors": [
      "Taolin Zhang",
      "Chuan Chen",
      "Yaomin Chang",
      "Lin Shu",
      "Zibin Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.00209",
    "title": "Invariant and Dual Invariant Subspaces of $k$-valued Networks",
    "abstract": " Comments: 15 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2209.00209",
    "authors": [
      "Daizhan Cheng",
      "Hongsheng Qi",
      "Xiao Zhang",
      "Zhengping Ji"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2209.01802",
    "title": "Sound Event Localization and Detection for Real Spatial Sound Scenes:  Event-Independent Network and Data Augmentation Chains",
    "abstract": " Comments: Submitted to DCASE 2022 Workshop. Code is available at this https URL ",
    "url": "https://arxiv.org/abs/2209.01802",
    "authors": [
      "Jinbo Hu",
      "Yin Cao",
      "Ming Wu",
      "Qiuqiang Kong",
      "Feiran Yang",
      "Mark D. Plumbley",
      "Jun Yang"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2209.02048",
    "title": "Fuzzy Attention Neural Network to Tackle Discontinuity in Airway  Segmentation",
    "abstract": " Comments: 12 pages, 5 figures, Submitted to IEEE TNNLS ",
    "url": "https://arxiv.org/abs/2209.02048",
    "authors": [
      "Yang Nan",
      "Javier Del Ser",
      "Zeyu Tang",
      "Peng Tang",
      "Xiaodan Xing",
      "Yingying Fang",
      "Francisco Herrera",
      "Witold Pedrycz",
      "Simon Walsh",
      "Guang Yang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.02145",
    "title": "Rare but Severe Neural Machine Translation Errors Induced by Minimal  Deletion: An Empirical Study on Chinese and English",
    "abstract": " Comments: Accepted to COLING 2022 ",
    "url": "https://arxiv.org/abs/2209.02145",
    "authors": [
      "Ruikang Shi",
      "Alvin Grissom II",
      "Duc Minh Trinh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.02544",
    "title": "XSimGCL: Towards Extremely Simple Graph Contrastive Learning for  Recommendation",
    "abstract": " Comments: Extension of our SIGIR'22 paper \"Are Graph Augmentations Necessary? Simple Graph Contrastive Learning for Recommendation\", submitted to TKDE ",
    "url": "https://arxiv.org/abs/2209.02544",
    "authors": [
      "Junliang Yu",
      "Xin Xia",
      "Tong Chen",
      "Lizhen Cui",
      "Nguyen Quoc Viet Hung",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2209.03148",
    "title": "Improving Out-of-Distribution Detection via Epistemic Uncertainty  Adversarial Training",
    "abstract": " Comments: 8 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2209.03148",
    "authors": [
      "Derek Everett",
      "Andre T. Nguyen",
      "Luke E. Richards",
      "Edward Raff"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.03683",
    "title": "Known by the company we keep: `Triadic influence' as a proxy for  compatibility in social relationships",
    "abstract": " Title: Known by the company we keep: `Triadic influence' as a proxy for  compatibility in social relationships ",
    "url": "https://arxiv.org/abs/2209.03683",
    "authors": [
      "Miguel Ruíz-García",
      "Juan Ozaita",
      "María Pereda",
      "Antonio Alfonso",
      "Pablo Brañas-Garza",
      "Jose A. Cuesta",
      "Ángel Sánchez"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (stat.ML)"
    ]
  }
]