[
  {
    "id": "arXiv:2301.08751",
    "title": "Towards Understanding How Self-training Tolerates Data Backdoor  Poisoning",
    "abstract": "Recent studies on backdoor attacks in model training have shown that polluting a small portion of training data is sufficient to produce incorrect manipulated predictions on poisoned test-time data while maintaining high clean accuracy in downstream tasks. The stealthiness of backdoor attacks has imposed tremendous defense challenges in today's machine learning paradigm. In this paper, we explore the potential of self-training via additional unlabeled data for mitigating backdoor attacks. We begin by making a pilot study to show that vanilla self-training is not effective in backdoor mitigation. Spurred by that, we propose to defend the backdoor attacks by leveraging strong but proper data augmentations in the self-training pseudo-labeling stage. We find that the new self-training regime help in defending against backdoor attacks to a great extent. Its effectiveness is demonstrated through experiments for different backdoor triggers on CIFAR-10 and a combination of CIFAR-10 with an additional unlabeled 500K TinyImages dataset. Finally, we explore the direction of combining self-supervised representation learning with self-training for further improvement in backdoor defense. ",
    "url": "https://arxiv.org/abs/2301.08751",
    "authors": [
      "Soumyadeep Pal",
      "Ren Wang",
      "Yuguang Yao",
      "Sijia Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2301.08771",
    "title": "Matching Exemplar as Next Sentence Prediction (MeNSP): Zero-shot Prompt  Learning for Automatic Scoring in Science Education",
    "abstract": "Developing models to automatically score students' written responses to science problems is critical for science education. However, collecting and labeling sufficient student responses for training models is time and cost-consuming. Recent studies suggest that pre-trained language models (PLMs) can be adapted to downstream tasks without fine-tuning with prompts. However, no research has employed such a prompt approach in science education. As student responses are presented with natural language, aligning the scoring procedure as the next sentence prediction task using prompts can skip the costly fine-tuning stage. In this study, we developed a zero-shot approach to automatically score student responses via Matching Exemplars as Next Sentence Prediction (MeNSP). This approach employs no training samples. We first apply MeNSP in scoring three assessment tasks of scientific argumentation and found machine-human scoring agreements, Cohen's Kappa ranges from 0.30 to 0.57, and F1 score ranges from 0.54 to 0.81. To improve the performance, we extend our research to the few-shots setting, either randomly selecting labeled student responses or manually constructing responses to fine-tune the models. We find that one task's performance is improved with more samples, Cohen's Kappa from 0.30 to 0.38, and F1 score from 0.54 to 0.59; for the two others, scoring performance is not improved. We also find that randomly selected few-shots perform better than the human expert-crafted approach. This study suggests that MeNSP can yield referable automatic scoring for student responses while significantly reducing the cost of model training. This method can benefit low-stakes classroom assessment practices in science education. Future research should further explore the applicability of the MeNSP in different types of assessment tasks in science education and improve the model performance. ",
    "url": "https://arxiv.org/abs/2301.08771",
    "authors": [
      "Xuansheng Wu",
      "Xinyu He",
      "Tianming Li",
      "Ninghao Liu",
      "Xiaoming Zhai"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.08774",
    "title": "DoubleH: Twitter User Stance Detection via Bipartite Graph Neural  Networks",
    "abstract": "Given the development and abundance of social media, studying the stance of social media users is a challenging and pressing issue. Social media users express their stance by posting tweets and retweeting. Therefore, the homogeneous relationship between users and the heterogeneous relationship between users and tweets are relevant for the stance detection task. Recently, graph neural networks (GNNs) have developed rapidly and have been applied to social media research. In this paper, we crawl a large-scale dataset of the 2020 US presidential election and automatically label all users by manually tagged hashtags. Subsequently, we propose a bipartite graph neural network model, DoubleH, which aims to better utilize homogeneous and heterogeneous information in user stance detection tasks. Specifically, we first construct a bipartite graph based on posting and retweeting relations for two kinds of nodes, including users and tweets. We then iteratively update the node's representation by extracting and separately processing heterogeneous and homogeneous information in the node's neighbors. Finally, the representations of user nodes are used for user stance classification. Experimental results show that DoubleH outperforms the state-of-the-art methods on popular benchmarks. Further analysis illustrates the model's utilization of information and demonstrates stability and efficiency at different numbers of layers. ",
    "url": "https://arxiv.org/abs/2301.08774",
    "authors": [
      "Chong Zhang",
      "Zhenkun Zhou",
      "Xingyu Peng",
      "Ke Xu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.08783",
    "title": "An Asynchronous Intensity Representation for Framed and Event Video  Sources",
    "abstract": "Neuromorphic \"event\" cameras, designed to mimic the human vision system with asynchronous sensing, unlock a new realm of high-speed and high dynamic range applications. However, researchers often either revert to a framed representation of event data for applications, or build bespoke applications for a particular camera's event data type. To usher in the next era of video systems, accommodate new event camera designs, and explore the benefits to asynchronous video in classical applications, we argue that there is a need for an asynchronous, source-agnostic video representation. In this paper, we introduce a novel, asynchronous intensity representation for both framed and non-framed data sources. We show that our representation can increase intensity precision and greatly reduce the number of samples per pixel compared to grid-based representations. With framed sources, we demonstrate that by permitting a small amount of loss through the temporal averaging of similar pixel values, we can reduce our representational sample rate by more than half, while incurring a drop in VMAF quality score of only 4.5. We also demonstrate lower latency than the state-of-the-art method for fusing and transcoding framed and event camera data to an intensity representation, while maintaining $2000\\times$ the temporal resolution. We argue that our method provides the computational efficiency and temporal granularity necessary to build real-time intensity-based applications for event cameras. ",
    "url": "https://arxiv.org/abs/2301.08783",
    "authors": [
      "Andrew C. Freeman",
      "Montek Singh",
      "Ketan Mayer-Patel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2301.08792",
    "title": "Inherent Limits on Topology-Based Link Prediction",
    "abstract": "Link prediction systems (e.g. recommender systems) typically use graph topology as one of their main sources of information. We calculate hard upper bounds on how well the structure alone enables link prediction for a wide variety of real-world graphs. We find that in the sparsest of these graphs the upper bounds are non-trivially low, thereby demonstrating that if a link prediction system is going to perform well in a sparse context, it will almost certainly need more information than the network topology alone. ",
    "url": "https://arxiv.org/abs/2301.08792",
    "authors": [
      "Justus I. Hibshman",
      "Tim Weninger"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2301.08796",
    "title": "User Trajectory Prediction in Mobile Wireless Networks Using Quantum  Reservoir Computing",
    "abstract": "This paper applies a quantum machine learning technique to predict mobile users' trajectories in mobile wireless networks using an approach called quantum reservoir computing (QRC). Mobile users' trajectories prediction belongs to the task of temporal information processing and it is a mobility management problem that is essential for self-organizing and autonomous 6G networks. Our aim is to accurately predict the future positions of mobile users in wireless networks using QRC. To do so, we use a real-world time series dataset to model mobile users' trajectories. The QRC approach has two components: reservoir computing (RC) and quantum computing (QC). In RC, the training is more computational-efficient than the training of simple recurrent neural networks (RNN) since, in RC, only the weights of the output layer are trainable. The internal part of RC is what is called the reservoir. For the RC to perform well, the weights of the reservoir should be chosen carefully to create highly complex and nonlinear dynamics. The QC is used to create such dynamical reservoir that maps the input time series into higher dimensional computational space composed of dynamical states. After obtaining the high-dimensional dynamical states, a simple linear regression is performed to train the output weights and thus the prediction of the mobile users' trajectories can be performed efficiently. In this paper, we apply a QRC approach based on the Hamiltonian time evolution of a quantum system. We simulate the time evolution using IBM gate-based quantum computers and we show in the experimental results that the use of QRC to predict the mobile users' trajectories with only a few qubits is efficient and is able to outperform the classical approaches such as the long short-term memory (LSTM) approach and the echo-state networks (ESN) approach. ",
    "url": "https://arxiv.org/abs/2301.08796",
    "authors": [
      "Zoubeir Mlika",
      "Soumaya Cherkaoui",
      "Jean Frédéric Laprade",
      "Simon Corbeil-Letourneau"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2301.08811",
    "title": "Differential Privacy in Cooperative Multiagent Planning",
    "abstract": "Privacy-aware multiagent systems must protect agents' sensitive data while simultaneously ensuring that agents accomplish their shared objectives. Towards this goal, we propose a framework to privatize inter-agent communications in cooperative multiagent decision-making problems. We study sequential decision-making problems formulated as cooperative Markov games with reach-avoid objectives. We apply a differential privacy mechanism to privatize agents' communicated symbolic state trajectories, and then we analyze tradeoffs between the strength of privacy and the team's performance. For a given level of privacy, this tradeoff is shown to depend critically upon the total correlation among agents' state-action processes. We synthesize policies that are robust to privacy by reducing the value of the total correlation. Numerical experiments demonstrate that the team's performance under these policies decreases by only 3 percent when comparing private versus non-private implementations of communication. By contrast, the team's performance decreases by roughly 86 percent when using baseline policies that ignore total correlation and only optimize team performance. ",
    "url": "https://arxiv.org/abs/2301.08811",
    "authors": [
      "Bo Chen",
      "Calvin Hawkins",
      "Mustafa O. Karabag",
      "Cyrus Neary",
      "Matthew Hale",
      "Ufuk Topcu"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.08824",
    "title": "An Automated Vulnerability Detection Framework for Smart Contracts",
    "abstract": "With the increase of the adoption of blockchain technology in providing decentralized solutions to various problems, smart contracts have become more popular to the point that billions of US Dollars are currently exchanged every day through such technology. Meanwhile, various vulnerabilities in smart contracts have been exploited by attackers to steal cryptocurrencies worth millions of dollars. The automatic detection of smart contract vulnerabilities therefore is an essential research problem. Existing solutions to this problem particularly rely on human experts to define features or different rules to detect vulnerabilities. However, this often causes many vulnerabilities to be ignored, and they are inefficient in detecting new vulnerabilities. In this study, to overcome such challenges, we propose a framework to automatically detect vulnerabilities in smart contracts on the blockchain. More specifically, first, we utilize novel feature vector generation techniques from bytecode of smart contract since the source code of smart contracts are rarely available in public. Next, the collected vectors are fed into our novel metric learning-based deep neural network(DNN) to get the detection result. We conduct comprehensive experiments on large-scale benchmarks, and the quantitative results demonstrate the effectiveness and efficiency of our approach. ",
    "url": "https://arxiv.org/abs/2301.08824",
    "authors": [
      "Feng Mi",
      "Chen Zhao",
      "Zhuoyi Wang",
      "Sadaf MD Halim",
      "Xiaodi Li",
      "Zhouxiang Wu",
      "Latifur Khan",
      "Bhavani Thuraisingham"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08831",
    "title": "Explainable Multilayer Graph Neural Network for Cancer Gene Prediction",
    "abstract": "The identification of cancer genes is a critical, yet challenging problem in cancer genomics research. Recently, several computational methods have been developed to address this issue, including deep neural networks. However, these methods fail to exploit the multilayered gene-gene interactions and provide little to no explanation for their predictions. Results: In this study, we propose an Explainable Multilayer Graph Neural Network (EMGNN) approach to identify cancer genes, by leveraging multiple gene-gene interaction networks and multi-omics data. Compared to conventional graph learning methods, EMGNN learned complementary information in multiple graphs to accurately predict cancer genes. Our method consistently outperforms existing approaches while providing valuable biological insights into its predictions. We further release our novel cancer gene predictions and connect them with known cancer patterns, aiming to accelerate the progress of cancer research ",
    "url": "https://arxiv.org/abs/2301.08831",
    "authors": [
      "Michail Chatzianastasis",
      "Michalis Vazirgiannis",
      "Zijun Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08832",
    "title": "Same Words, Different Meanings: Interpretable Predictions of  Polarization Trends in Broadcast Media Language and Granger Causal Effects on  Public Discourse",
    "abstract": "With the growth of online news over the past decade, empirical studies on political discourse and news consumption have focused on the phenomenon of filter bubbles and echo chambers. Yet recently, scholars have revealed limited evidence around the impact of such phenomenon, leading some to argue that partisan segregation across news audiences cannot be fully explained by online news consumption alone and that the role of traditional legacy media may be as salient in polarizing public discourse around current events. In this work, we expand the scope of analysis to include both online and more traditional media by investigating the relationship between broadcast news media language and social media discourse. By analyzing a decade's worth of closed captions (2 million speaker turns) from CNN and Fox News along with topically corresponding discourse from Twitter, we provide a novel framework for measuring semantic polarization between America's two major broadcast networks to demonstrate how semantic polarization between these outlets has evolved (Study 1), peaked (Study 2) and influenced partisan discussions on Twitter (Study 3) across the last decade. Our results demonstrate a sharp increase in polarization in how topically important keywords are discussed between the two channels, especially after 2016, with overall highest peaks occurring in 2020. The two stations discuss identical topics in drastically distinct contexts in 2020, to the extent that there is barely any linguistic overlap in how identical keywords are contextually discussed. Further, we demonstrate at scale, how such partisan division in broadcast media language significantly shapes semantic polarity trends on Twitter (and vice-versa), empirically linking for the first time, how online discussions are influenced by televised media. ",
    "url": "https://arxiv.org/abs/2301.08832",
    "authors": [
      "Xiaohan Ding",
      "Mike Horning",
      "Eugenia H. Rho"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Human-Computer Interaction (cs.HC)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2301.08838",
    "title": "AQuaMaM: An Autoregressive, Quaternion Manifold Model for Rapidly  Estimating Complex SO(3) Distributions",
    "abstract": "Accurately modeling complex, multimodal distributions is necessary for optimal decision-making, but doing so for rotations in three-dimensions, i.e., the SO(3) group, is challenging due to the curvature of the rotation manifold. The recently described implicit-PDF (IPDF) is a simple, elegant, and effective approach for learning arbitrary distributions on SO(3) up to a given precision. However, inference with IPDF requires $N$ forward passes through the network's final multilayer perceptron (where $N$ places an upper bound on the likelihood that can be calculated by the model), which is prohibitively slow for those without the computational resources necessary to parallelize the queries. In this paper, I introduce AQuaMaM, a neural network capable of both learning complex distributions on the rotation manifold and calculating exact likelihoods for query rotations in a single forward pass. Specifically, AQuaMaM autoregressively models the projected components of unit quaternions as mixtures of uniform distributions that partition their geometrically-restricted domain of values. When trained on an \"infinite\" toy dataset with ambiguous viewpoints, AQuaMaM rapidly converges to a sampling distribution closely matching the true data distribution. In contrast, the sampling distribution for IPDF dramatically diverges from the true data distribution, despite IPDF approaching its theoretical minimum evaluation loss during training. When trained on a constructed dataset of 500,000 renders of a die in different rotations, AQuaMaM reaches a test log-likelihood 14% higher than IPDF. Further, compared to IPDF, AQuaMaM uses 24% fewer parameters, has a prediction throughput 52$\\times$ faster on a single GPU, and converges in a similar amount of time during training. ",
    "url": "https://arxiv.org/abs/2301.08838",
    "authors": [
      "Michael A. Alcorn"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08842",
    "title": "Limitations of Piecewise Linearity for Efficient Robustness  Certification",
    "abstract": "Certified defenses against small-norm adversarial examples have received growing attention in recent years; though certified accuracies of state-of-the-art methods remain far below their non-robust counterparts, despite the fact that benchmark datasets have been shown to be well-separated at far larger radii than the literature generally attempts to certify. In this work, we offer insights that identify potential factors in this performance gap. Specifically, our analysis reveals that piecewise linearity imposes fundamental limitations on the tightness of leading certification techniques. These limitations are felt in practical terms as a greater need for capacity in models hoped to be certified efficiently. Moreover, this is in addition to the capacity necessary to learn a robust boundary, studied in prior work. However, we argue that addressing the limitations of piecewise linearity through scaling up model capacity may give rise to potential difficulties -- particularly regarding robust generalization -- therefore, we conclude by suggesting that developing smooth activation functions may be the way forward for advancing the performance of certified neural networks. ",
    "url": "https://arxiv.org/abs/2301.08842",
    "authors": [
      "Klas Leino"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08849",
    "title": "CADA-GAN: Context-Aware GAN with Data Augmentation",
    "abstract": "Current child face generators are restricted by the limited size of the available datasets. In addition, feature selection can prove to be a significant challenge, especially due to the large amount of features that need to be trained for. To manage these problems, we proposed CADA-GAN, a \\textbf{C}ontext-\\textbf{A}ware GAN that allows optimal feature extraction, with added robustness from additional \\textbf{D}ata \\textbf{A}ugmentation. CADA-GAN is adapted from the popular StyleGAN2-Ada model, with attention on augmentation and segmentation of the parent images. The model has the lowest \\textit{Mean Squared Error Loss} (MSEloss) on latent feature representations and the generated child image is robust compared with the one that generated from baseline models. ",
    "url": "https://arxiv.org/abs/2301.08849",
    "authors": [
      "Sofie Daniels",
      "Jiugeng Sun",
      "Jiaqing Xie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.08855",
    "title": "ProKD: An Unsupervised Prototypical Knowledge Distillation Network for  Zero-Resource Cross-Lingual Named Entity Recognition",
    "abstract": "For named entity recognition (NER) in zero-resource languages, utilizing knowledge distillation methods to transfer language-independent knowledge from the rich-resource source languages to zero-resource languages is an effective means. Typically, these approaches adopt a teacher-student architecture, where the teacher network is trained in the source language, and the student network seeks to learn knowledge from the teacher network and is expected to perform well in the target language. Despite the impressive performance achieved by these methods, we argue that they have two limitations. Firstly, the teacher network fails to effectively learn language-independent knowledge shared across languages due to the differences in the feature distribution between the source and target languages. Secondly, the student network acquires all of its knowledge from the teacher network and ignores the learning of target language-specific knowledge. Undesirably, these limitations would hinder the model's performance in the target language. This paper proposes an unsupervised prototype knowledge distillation network (ProKD) to address these issues. Specifically, ProKD presents a contrastive learning-based prototype alignment method to achieve class feature alignment by adjusting the distance among prototypes in the source and target languages, boosting the teacher network's capacity to acquire language-independent knowledge. In addition, ProKD introduces a prototypical self-training method to learn the intrinsic structure of the language by retraining the student network on the target data using samples' distance information from prototypes, thereby enhancing the student network's ability to acquire language-specific knowledge. Extensive experiments on three benchmark cross-lingual NER datasets demonstrate the effectiveness of our approach. ",
    "url": "https://arxiv.org/abs/2301.08855",
    "authors": [
      "Ling Ge",
      "Chuming Hu",
      "Guanghui Ma",
      "Hong Zhang",
      "Jihong Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.08857",
    "title": "CoBigICP: Robust and Precise Point Set Registration using Correntropy  Metrics and Bidirectional Correspondence",
    "abstract": "In this paper, we propose a novel probabilistic variant of iterative closest point (ICP) dubbed as CoBigICP. The method leverages both local geometrical information and global noise characteristics. Locally, the 3D structure of both target and source clouds are incorporated into the objective function through bidirectional correspondence. Globally, error metric of correntropy is introduced as noise model to resist outliers. Importantly, the close resemblance between normal-distributions transform (NDT) and correntropy is revealed. To ease the minimization step, an on-manifold parameterization of the special Euclidean group is proposed. Extensive experiments validate that CoBigICP outperforms several well-known and state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2301.08857",
    "authors": [
      "Pengyu Yin",
      "Di Wang",
      "Shaoyi Du",
      "Shihui Ying",
      "Yue Gao",
      "Nanning Zheng"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.08859",
    "title": "Logical Message Passing Networks with One-hop Inference on Atomic  Formulas",
    "abstract": "Complex Query Answering (CQA) over Knowledge Graphs (KGs) has attracted a lot of attention to potentially support many applications. Given that KGs are usually incomplete, neural models are proposed to answer logical queries by parameterizing set operators with complex neural networks. However, such methods usually train neural set operators with a large number of entity and relation embeddings from zero, where whether and how the embeddings or the neural set operators contribute to the performance remains not clear. In this paper, we propose a simple framework for complex query answering that decomposes the KG embeddings from neural set operators. We propose to represent the complex queries in the query graph. On top of the query graph, we propose the Logical Message Passing Neural Network (LMPNN) that connects the \\textit{local} one-hop inferences on atomic formulas to the \\textit{global} logical reasoning for complex query answering. We leverage existing effective KG embeddings to conduct one-hop inferences on atomic formulas, the results of which are regarded as the messages passed in LMPNN. The reasoning process over the overall logical formulas is turned into the forward pass of LMPNN that incrementally aggregates local information to predict the answers' embeddings finally. The complex logical inference across different types of queries will then be learned from training examples based on the LMPNN architecture. Theoretically, our query-graph representation is more general than the prevailing operator-tree formulation, so our approach applies to a broader range of complex KG queries. Empirically, our approach yields a new state-of-the-art neural CQA model. Our research bridges the gap between complex KG query answering tasks and the long-standing achievements of knowledge graph representation learning. ",
    "url": "https://arxiv.org/abs/2301.08859",
    "authors": [
      "Zihao Wang",
      "Yangqiu Song",
      "Ginny Y. Wong",
      "Simon See"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2301.08861",
    "title": "Data-Driven Distributionally Robust Scheduling of Community Integrated  Energy Systems with Uncertain Renewable Generations Considering Integrated  Demand Response",
    "abstract": "A community integrated energy system (CIES) is an important carrier of the energy internet and smart city in geographical and functional terms. Its emergence provides a new solution to the problems of energy utilization and environmental pollution. To coordinate the integrated demand response and uncertainty of renewable energy generation (RGs), a data-driven two-stage distributionally robust optimization (DRO) model is constructed. A comprehensive norm consisting of the 1-norm and infinity-norm is used as the uncertainty probability distribution information set, thereby avoiding complex probability density information. To address multiple uncertainties of RGs, a generative adversarial network based on the Wasserstein distance with gradient penalty is proposed to generate RG scenarios, which has wide applicability. To further tap the potential of the demand response, we take into account the ambiguity of human thermal comfort and the thermal inertia of buildings. Thus, an integrated demand response mechanism is developed that effectively promotes the consumption of renewable energy. The proposed method is simulated in an actual CIES in North China. In comparison with traditional stochastic programming and robust optimization, it is verified that the proposed DRO model properly balances the relationship between economical operation and robustness while exhibiting stronger adaptability. Furthermore, our approach outperforms other commonly used DRO methods with better operational economy, lower renewable power curtailment rate, and higher computational efficiency. ",
    "url": "https://arxiv.org/abs/2301.08861",
    "authors": [
      "Yang Li",
      "Meng Han",
      "Mohammad Shahidehpour",
      "Jiazheng Li",
      "Chao Long"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.08871",
    "title": "Ti-MAE: Self-Supervised Masked Time Series Autoencoders",
    "abstract": "Multivariate Time Series forecasting has been an increasingly popular topic in various applications and scenarios. Recently, contrastive learning and Transformer-based models have achieved good performance in many long-term series forecasting tasks. However, there are still several issues in existing methods. First, the training paradigm of contrastive learning and downstream prediction tasks are inconsistent, leading to inaccurate prediction results. Second, existing Transformer-based models which resort to similar patterns in historical time series data for predicting future values generally induce severe distribution shift problems, and do not fully leverage the sequence information compared to self-supervised methods. To address these issues, we propose a novel framework named Ti-MAE, in which the input time series are assumed to follow an integrate distribution. In detail, Ti-MAE randomly masks out embedded time series data and learns an autoencoder to reconstruct them at the point-level. Ti-MAE adopts mask modeling (rather than contrastive learning) as the auxiliary task and bridges the connection between existing representation learning and generative Transformer-based methods, reducing the difference between upstream and downstream forecasting tasks while maintaining the utilization of original time series data. Experiments on several public real-world datasets demonstrate that our framework of masked autoencoding could learn strong representations directly from the raw data, yielding better performance in time series forecasting and classification tasks. ",
    "url": "https://arxiv.org/abs/2301.08871",
    "authors": [
      "Zhe Li",
      "Zhongwen Rao",
      "Lujia Pan",
      "Pengyun Wang",
      "Zenglin Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08881",
    "title": "Dr.Spider: A Diagnostic Evaluation Benchmark towards Text-to-SQL  Robustness",
    "abstract": "Neural text-to-SQL models have achieved remarkable performance in translating natural language questions into SQL queries. However, recent studies reveal that text-to-SQL models are vulnerable to task-specific perturbations. Previous curated robustness test sets usually focus on individual phenomena. In this paper, we propose a comprehensive robustness benchmark based on Spider, a cross-domain text-to-SQL benchmark, to diagnose the model robustness. We design 17 perturbations on databases, natural language questions, and SQL queries to measure the robustness from different angles. In order to collect more diversified natural question perturbations, we utilize large pretrained language models (PLMs) to simulate human behaviors in creating natural questions. We conduct a diagnostic study of the state-of-the-art models on the robustness set. Experimental results reveal that even the most robust model suffers from a 14.0% performance drop overall and a 50.7% performance drop on the most challenging perturbation. We also present a breakdown analysis regarding text-to-SQL model designs and provide insights for improving model robustness. ",
    "url": "https://arxiv.org/abs/2301.08881",
    "authors": [
      "Shuaichen Chang",
      "Jun Wang",
      "Mingwen Dong",
      "Lin Pan",
      "Henghui Zhu",
      "Alexander Hanbo Li",
      "Wuwei Lan",
      "Sheng Zhang",
      "Jiarong Jiang",
      "Joseph Lilien",
      "Steve Ash",
      "William Yang Wang",
      "Zhiguo Wang",
      "Vittorio Castelli",
      "Patrick Ng",
      "Bing Xiang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.08883",
    "title": "Versatile Neural Processes for Learning Implicit Neural Representations",
    "abstract": "Representing a signal as a continuous function parameterized by neural network (a.k.a. Implicit Neural Representations, INRs) has attracted increasing attention in recent years. Neural Processes (NPs), which model the distributions over functions conditioned on partial observations (context set), provide a practical solution for fast inference of continuous functions. However, existing NP architectures suffer from inferior modeling capability for complex signals. In this paper, we propose an efficient NP framework dubbed Versatile Neural Processes (VNP), which largely increases the capability of approximating functions. Specifically, we introduce a bottleneck encoder that produces fewer and informative context tokens, relieving the high computational cost while providing high modeling capability. At the decoder side, we hierarchically learn multiple global latent variables that jointly model the global structure and the uncertainty of a function, enabling our model to capture the distribution of complex signals. We demonstrate the effectiveness of the proposed VNP on a variety of tasks involving 1D, 2D and 3D signals. Particularly, our method shows promise in learning accurate INRs w.r.t. a 3D scene without further finetuning. ",
    "url": "https://arxiv.org/abs/2301.08883",
    "authors": [
      "Zongyu Guo",
      "Cuiling Lan",
      "Zhizheng Zhang",
      "Zhibo Chen",
      "Yan Lu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.08892",
    "title": "Fast likelihood-based change point detection",
    "abstract": "Change point detection plays a fundamental role in many real-world applications, where the goal is to analyze and monitor the behaviour of a data stream. In this paper, we study change detection in binary streams. To this end, we use a likelihood ratio between two models as a measure for indicating change. The first model is a single bernoulli variable while the second model divides the stored data in two segments, and models each segment with its own bernoulli variable. Finding the optimal split can be done in $O(n)$ time, where $n$ is the number of entries since the last change point. This is too expensive for large $n$. To combat this we propose an approximation scheme that yields $(1 - \\epsilon)$ approximation in $O(\\epsilon^{-1} \\log^2 n)$ time. The speed-up consists of several steps: First we reduce the number of possible candidates by adopting a known result from segmentation problems. We then show that for fixed bernoulli parameters we can find the optimal change point in logarithmic time. Finally, we show how to construct a candidate list of size $O(\\epsilon^{-1} \\log n)$ for model parameters. We demonstrate empirically the approximation quality and the running time of our algorithm, showing that we can gain a significant speed-up with a minimal average loss in optimality. ",
    "url": "https://arxiv.org/abs/2301.08892",
    "authors": [
      "Nikolaj Tatti"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2301.08893",
    "title": "Spatial Attention Kinetic Networks with E(n)-Equivariance",
    "abstract": "Neural networks that are equivariant to rotations, translations, reflections, and permutations on n-dimensional geometric space have shown promise in physical modeling for tasks such as accurately but inexpensively modeling complex potential energy surfaces to guiding the sampling of complex dynamical systems or forecasting their time evolution. Current state-of-the-art methods employ spherical harmonics to encode higher-order interactions among particles, which are computationally expensive. In this paper, we propose a simple alternative functional form that uses neurally parametrized linear combinations of edge vectors to achieve equivariance while still universally approximating node environments. Incorporating this insight, we design spatial attention kinetic networks with E(n)-equivariance, or SAKE, which are competitive in many-body system modeling tasks while being significantly faster. ",
    "url": "https://arxiv.org/abs/2301.08893",
    "authors": [
      "Yuanqing Wang",
      "John D. Chodera"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:2301.08904",
    "title": "Outage Performance of Fluid Antenna System (FAS)-aided Terahertz  Communication Networks",
    "abstract": "Millimeter-wave networks have already been successfully rolled out in many countries and now the research direction heads toward new technologies and standards to enable Tbps rates for future sixth-generation (6G) wireless communication systems. This work studies a point-to-point terahertz (THz) communication network exploiting the concept of a fluid antenna system (FAS) over correlated alpha-mu fading channels, nicely fitting the THz communication. Furthermore, the considered system is expanded to the selection-combining-FAS (SC-FAS) and maximum-gain-combining- FAS (MGC-FAS) diversity variates at the receiver side. The proposed FAS and its diversity configuration techniques are aimed to combat the high path loss, blockages, and molecular absorption effect related to the THz band. Our contribution includes comprehensive outage probability (OP) performance analysis for the THz band given the non-diversity and diversity FAS receivers. Moreover, the derived outage probability formulas are verified via Monte Carlo simulations. Numerical results have confirmed the superior performance of the MGC-FAS scheme in terms of OP. Finally, this work justifies that a higher number of antenna ports dramatically improves the system performance, even in the presence of correlation. ",
    "url": "https://arxiv.org/abs/2301.08904",
    "authors": [
      "Leila Tlebaldiyeva",
      "Sultangali Arzykulov",
      "Khaled M. Rabie",
      "Xingwang Li",
      "Galymzhan Nauryzbayev"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.08913",
    "title": "Unifying Structure Reasoning and Language Model Pre-training for Complex  Reasoning",
    "abstract": "Recent knowledge enhanced pre-trained language models have shown remarkable performance on downstream tasks by incorporating structured knowledge from external sources into language models. However, they usually suffer from a heterogeneous information alignment problem and a noisy knowledge injection problem. For complex reasoning, the contexts contain rich knowledge that typically exists in complex and sparse forms. In order to model structured knowledge in the context and avoid these two problems, we propose to unify structure reasoning and language model pre-training. It identifies four types of elementary knowledge structures from contexts to construct structured queries, and utilizes the box embedding method to conduct explicit structure reasoning along queries during language modeling. To fuse textual and structured semantics, we utilize contextual language representations of knowledge structures to initialize their box embeddings for structure reasoning. We conduct experiments on complex language reasoning and knowledge graph (KG) reasoning tasks. The results show that our model can effectively enhance the performance of complex reasoning of both language and KG modalities. ",
    "url": "https://arxiv.org/abs/2301.08913",
    "authors": [
      "Siyuan Wang",
      "Zhongyu Wei",
      "Jiarong Xu",
      "Zhihao Fan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.08914",
    "title": "ExClaim: Explainable Neural Claim Verification Using Rationalization",
    "abstract": "With the advent of deep learning, text generation language models have improved dramatically, with text at a similar level as human-written text. This can lead to rampant misinformation because content can now be created cheaply and distributed quickly. Automated claim verification methods exist to validate claims, but they lack foundational data and often use mainstream news as evidence sources that are strongly biased towards a specific agenda. Current claim verification methods use deep neural network models and complex algorithms for a high classification accuracy but it is at the expense of model explainability. The models are black-boxes and their decision-making process and the steps it took to arrive at a final prediction are obfuscated from the user. We introduce a novel claim verification approach, namely: ExClaim, that attempts to provide an explainable claim verification system with foundational evidence. Inspired by the legal system, ExClaim leverages rationalization to provide a verdict for the claim and justifies the verdict through a natural language explanation (rationale) to describe the model's decision-making process. ExClaim treats the verdict classification task as a question-answer problem and achieves a performance of 0.93 F1 score. It provides subtasks explanations to also justify the intermediate outcomes. Statistical and Explainable AI (XAI) evaluations are conducted to ensure valid and trustworthy outcomes. Ensuring claim verification systems are assured, rational, and explainable is an essential step toward improving Human-AI trust and the accessibility of black-box systems. ",
    "url": "https://arxiv.org/abs/2301.08914",
    "authors": [
      "Sai Gurrapu",
      "Lifu Huang",
      "Feras A. Batarseh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.08918",
    "title": "Is Signed Message Essential for Graph Neural Networks?",
    "abstract": "Message-passing Graph Neural Networks (GNNs), which collect information from adjacent nodes, achieve satisfying results on homophilic graphs. However, their performances are dismal in heterophilous graphs, and many researchers have proposed a plethora of schemes to solve this problem. Especially, flipping the sign of edges is rooted in a strong theoretical foundation, and attains significant performance enhancements. Nonetheless, previous analyses assume a binary class scenario and they may suffer from confined applicability. This paper extends the prior understandings to multi-class scenarios and points out two drawbacks: (1) the sign of multi-hop neighbors depends on the message propagation paths and may incur inconsistency, (2) it also increases the prediction uncertainty (e.g., conflict evidence) which can impede the stability of the algorithm. Based on the theoretical understanding, we introduce a novel strategy that is applicable to multi-class graphs. The proposed scheme combines confidence calibration to secure robustness while reducing uncertainty. We show the efficacy of our theorem through extensive experiments on six benchmark graph datasets. ",
    "url": "https://arxiv.org/abs/2301.08918",
    "authors": [
      "Yoonhyuk Choi",
      "Jiho Choi",
      "Taewook Ko",
      "Chong-Kwon Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2301.08930",
    "title": "Dense RGB SLAM with Neural Implicit Maps",
    "abstract": "There is an emerging trend of using neural implicit functions for map representation in Simultaneous Localization and Mapping (SLAM). Some pioneer works have achieved encouraging results on RGB-D SLAM. In this paper, we present a dense RGB SLAM method with neural implicit map representation. To reach this challenging goal without depth input, we introduce a hierarchical feature volume to facilitate the implicit map decoder. This design effectively fuses shape cues across different scales to facilitate map reconstruction. Our method simultaneously solves the camera motion and the neural implicit map by matching the rendered and input video frames. To facilitate optimization, we further propose a photometric warping loss in the spirit of multi-view stereo to better constrain the camera pose and scene geometry. We evaluate our method on commonly used benchmarks and compare it with modern RGB and RGB-D SLAM systems. Our method achieves favorable results than previous methods and even surpasses some recent RGB-D SLAM methods. Our source code will be publicly available. ",
    "url": "https://arxiv.org/abs/2301.08930",
    "authors": [
      "Heng Li",
      "Xiaodong Gu",
      "Weihao Yuan",
      "Luwei Yang",
      "Zilong Dong",
      "Ping Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.08939",
    "title": "Counterfactual Explanation and Instance-Generation using  Cycle-Consistent Generative Adversarial Networks",
    "abstract": "The image-based diagnosis is now a vital aspect of modern automation assisted diagnosis. To enable models to produce pixel-level diagnosis, pixel-level ground-truth labels are essentially required. However, since it is often not straight forward to obtain the labels in many application domains such as in medical image, classification-based approaches have become the de facto standard to perform the diagnosis. Though they can identify class-salient regions, they may not be useful for diagnosis where capturing all of the evidences is important requirement. Alternatively, a counterfactual explanation (CX) aims at providing explanations using a casual reasoning process of form \"If X has not happend, Y would not heppend\". Existing CX approaches, however, use classifier to explain features that can change its predictions. Thus, they can only explain class-salient features, rather than entire object of interest. This hence motivates us to propose a novel CX strategy that is not reliant on image classification. This work is inspired from the recent developments in generative adversarial networks (GANs) based image-to-image domain translation, and leverages to translate an abnormal image to counterpart normal image (i.e. counterfactual instance CI) to find discrepancy maps between the two. Since it is generally not possible to obtain abnormal and normal image pairs, we leverage Cycle-Consistency principle (a.k.a CycleGAN) to perform the translation in unsupervised way. We formulate CX in terms of a discrepancy map that, when added from the abnormal image, will make it indistinguishable from the CI. We evaluate our method on three datasets including a synthetic, tuberculosis and BraTS dataset. All these experiments confirm the supremacy of propose method in generating accurate CX and CI. ",
    "url": "https://arxiv.org/abs/2301.08939",
    "authors": [
      "Tehseen Zia",
      "Zeeshan Nisar",
      "Shakeeb Murtaza"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.08941",
    "title": "On the Algebraic Properties of Flame Graphs",
    "abstract": "Flame graphs are a popular way of representing profiling data. In this paper we propose a possible mathematical definition of flame graphs. In doing so, we gain some interesting algebraic properties almost for free, which in turn allow us to define some operations that can allow to perform an in-depth performance regression analysis. The typical documented use of a flame graph is via its graphical representation, whereby one scans the picture for the largest plateaux. Whilst this method is effective at finding the main sources of performance issues, it leaves quite a large amount of data potentially unused. By combining a mathematical precise definition of flame graphs with some statistical methods we show how to generalise this visual procedure and make the best of the full set of collected profiling data. ",
    "url": "https://arxiv.org/abs/2301.08941",
    "authors": [
      "Gabriele N. Tornetta"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2301.08949",
    "title": "Estimation of Sea State Parameters from Ship Motion Responses Using  Attention-based Neural Networks",
    "abstract": "On-site estimation of sea state parameters is crucial for ship navigation systems' accuracy, stability, and efficiency. Extensive research has been conducted on model-based estimating methods utilizing only ship motion responses. Model-free approaches based on machine learning (ML) have recently gained popularity, and estimation from time-series of ship motion responses using deep learning (DL) methods has given promising results. Accordingly, in this study, we apply the novel, attention-based neural network (AT-NN) for estimating sea state parameters (wave height, zero-crossing period, and relative wave direction) from raw time-series data of ship pitch, heave, and roll motions. Despite using reduced input data, it has been successfully demonstrated that the proposed approaches by modified state-of-the-art techniques (based on convolutional neural networks (CNN) for regression, multivariate long short-term memory CNN, and sliding puzzle neural network) reduced estimation MSE by 23% and MAE by 16% compared to the original methods. Furthermore, the proposed technique based on AT-NN outperformed all tested methods (original and enhanced), reducing estimation MSE by up to 94% and MAE by up to 70%. Finally, we also proposed a novel approach for interpreting the uncertainty estimation of neural network outputs based on the Monte-Carlo dropout method to enhance the model's trustworthiness. ",
    "url": "https://arxiv.org/abs/2301.08949",
    "authors": [
      "Denis Selimović",
      "Franko Hržić",
      "Jasna Prpić-Oršić",
      "Jonatan Lerga"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.08950",
    "title": "Genetically Modified Wolf Optimization with Stochastic Gradient Descent  for Optimising Deep Neural Networks",
    "abstract": "When training Convolutional Neural Networks (CNNs) there is a large emphasis on creating efficient optimization algorithms and highly accurate networks. The state-of-the-art method of optimizing the networks is done by using gradient descent algorithms, such as Stochastic Gradient Descent (SGD). However, there are some limitations presented when using gradient descent methods. The major drawback is the lack of exploration, and over-reliance on exploitation. Hence, this research aims to analyze an alternative approach to optimizing neural network (NN) weights, with the use of population-based metaheuristic algorithms. A hybrid between Grey Wolf Optimizer (GWO) and Genetic Algorithms (GA) is explored, in conjunction with SGD; producing a Genetically Modified Wolf optimization algorithm boosted with SGD (GMW-SGD). This algorithm allows for a combination between exploitation and exploration, whilst also tackling the issue of high-dimensionality, affecting the performance of standard metaheuristic algorithms. The proposed algorithm was trained and tested on CIFAR-10 where it performs comparably to the SGD algorithm, reaching high test accuracy, and significantly outperforms standard metaheuristic algorithms. ",
    "url": "https://arxiv.org/abs/2301.08950",
    "authors": [
      "Manuel Bradicic",
      "Michal Sitarz",
      "Felix Sylvest Olesen"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2301.08951",
    "title": "Time-Conditioned Generative Modeling of Object-Centric Representations  for Video Decomposition and Prediction",
    "abstract": "When perceiving the world from multiple viewpoints, humans have the ability to reason about the complete objects in a compositional manner even when the object is completely occluded from partial viewpoints. Meanwhile, humans can imagine the novel views after observing multiple viewpoints. The remarkable recent advance in multi-view object-centric learning leaves some problems: 1) the partially or completely occluded shape of objects can not be well reconstructed. 2) the novel viewpoint prediction depends on expensive viewpoint annotations rather than implicit view rules. This makes the agent fail to perform like humans. In this paper, we introduce a time-conditioned generative model for videos. To reconstruct the complete shape of the object accurately, we enhance the disentanglement between different latent representations: view latent representations are jointly inferred based on the Transformer and then cooperate with the sequential extension of Slot Attention to learn object-centric representations. The model also achieves the new ability: Gaussian processes are employed as priors of view latent variables for generation and novel-view prediction without viewpoint annotations. Experiments on multiple specifically designed synthetic datasets have shown that the proposed model can 1) make the video decomposition, 2) reconstruct the complete shapes of objects, and 3) make the novel viewpoint prediction without viewpoint annotations. ",
    "url": "https://arxiv.org/abs/2301.08951",
    "authors": [
      "Chengmin Gao",
      "Bin Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08956",
    "title": "Using deterministic tourist walk as a small-world metric on  Watts-Strogatz networks",
    "abstract": "The Watts-Strogatz model (WS) has been demonstrated to effectively describe real-world networks due to its ability to reproduce the small-world properties commonly observed in a variety of systems, including social networks, computer networks, biochemical reactions, and neural networks. As the presence of small-world properties is a prevalent characteristic in many real-world networks, the measurement of \"small-worldness\" has become a crucial metric in the field of network science, leading to the development of various methods for its assessment over the past two decades. In contrast, the deterministic tourist walk (DTW) method has emerged as a prominent technique for texture analysis and network classification. In this paper, we propose the use of a modified version of the DTW method to classify networks into three categories: regular networks, random networks, and small-world networks. Additionally, we construct a small-world metric, denoted by the coefficient $\\chi$, from the DTW method. Results indicate that the proposed method demonstrates excellent performance in the task of network classification, achieving over $90\\%$ accuracy. Furthermore, the results obtained using the coefficient $\\chi$ on real-world networks provide evidence that the proposed method effectively serves as a satisfactory small-world metric. ",
    "url": "https://arxiv.org/abs/2301.08956",
    "authors": [
      "Joao V. Merenda",
      "Odemir M. Bruno"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2301.08957",
    "title": "Slice Transformer and Self-supervised Learning for 6DoF Localization in  3D Point Cloud Maps",
    "abstract": "Precise localization is critical for autonomous vehicles. We present a self-supervised learning method that employs Transformers for the first time for the task of outdoor localization using LiDAR data. We propose a pre-text task that reorganizes the slices of a $360^\\circ$ LiDAR scan to leverage its axial properties. Our model, called Slice Transformer, employs multi-head attention while systematically processing the slices. To the best of our knowledge, this is the first instance of leveraging multi-head attention for outdoor point clouds. We additionally introduce the Perth-WA dataset, which provides a large-scale LiDAR map of Perth city in Western Australia, covering $\\sim$4km$^2$ area. Localization annotations are provided for Perth-WA. The proposed localization method is thoroughly evaluated on Perth-WA and Appollo-SouthBay datasets. We also establish the efficacy of our self-supervised learning approach for the common downstream task of object classification using ModelNet40 and ScanNN datasets. The code and Perth-WA data will be publicly released. ",
    "url": "https://arxiv.org/abs/2301.08957",
    "authors": [
      "Muhammad Ibrahim",
      "Naveed Akhtar",
      "Saeed Anwar",
      "Michael Wise",
      "Ajmal Mian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.08962",
    "title": "Leveraging Spatial and Temporal Correlations for Network Traffic  Compression",
    "abstract": "The deployment of modern network applications is increasing the network size and traffic volumes at an unprecedented pace. Storing network-related information (e.g., traffic traces) is key to enable efficient network management. However, this task is becoming more challenging due to the ever-increasing data transmission rates and traffic volumes. In this paper, we present a novel method for network traffic compression that exploits spatial and temporal patterns naturally present in network traffic. We consider a realistic scenario where traffic measurements are performed at multiple links of a network topology using tools like SNMP or NetFlow. Such measurements can be seen as multiple time series that exhibit spatial and temporal correlations induced by the network topology, routing or user behavior. Our method leverages graph learning methods to effectively exploit both types of correlations for traffic compression. The experimental results show that our solution is able to outperform GZIP, the \\textit{de facto} traffic compression method, improving by 50\\%-65\\% the compression ratio on three real-world networks. ",
    "url": "https://arxiv.org/abs/2301.08962",
    "authors": [
      "Paul Almasan",
      "Krzysztof Rusek",
      "Shihan Xiao",
      "Xiang Shi",
      "Xiangle Cheng",
      "Albert Cabellos-Aparicio",
      "Pere Barlet-Ros"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2301.08965",
    "title": "Raw or Cooked? Object Detection on RAW Images",
    "abstract": "Images fed to a deep neural network have in general undergone several handcrafted image signal processing (ISP) operations, all of which have been optimized to produce visually pleasing images. In this work, we investigate the hypothesis that the intermediate representation of visually pleasing images is sub-optimal for downstream computer vision tasks compared to the RAW image representation. We suggest that the operations of the ISP instead should be optimized towards the end task, by learning the parameters of the operations jointly during training. We extend previous works on this topic and propose a new learnable operation that enables an object detector to achieve superior performance when compared to both previous works and traditional RGB images. In experiments on the open PASCALRAW dataset, we empirically confirm our hypothesis. ",
    "url": "https://arxiv.org/abs/2301.08965",
    "authors": [
      "William Ljungbergh",
      "Joakim Johnander",
      "Christoffer Petersson",
      "Michael Felsberg"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08987",
    "title": "Tier Balancing: Towards Dynamic Fairness over Underlying Causal Factors",
    "abstract": "The pursuit of long-term fairness involves the interplay between decision-making and the underlying data generating process. In this paper, through causal modeling with a directed acyclic graph (DAG) on the decision-distribution interplay, we investigate the possibility of achieving long-term fairness from a dynamic perspective. We propose Tier Balancing, a technically more challenging but more natural notion to achieve in the context of long-term, dynamic fairness analysis. Different from previous fairness notions that are defined purely on observed variables, our notion goes one step further, capturing behind-the-scenes situation changes on the unobserved latent causal factors that directly carry out the influence from the current decision to the future data distribution. Under the specified dynamics, we prove that in general one cannot achieve the long-term fairness goal only through one-step interventions. Furthermore, in the effort of approaching long-term fairness, we consider the mission of \"getting closer to\" the long-term fairness goal and present possibility and impossibility results accordingly. ",
    "url": "https://arxiv.org/abs/2301.08987",
    "authors": [
      "Zeyu Tang",
      "Yatong Chen",
      "Yang Liu",
      "Kun Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.08995",
    "title": "REDAffectiveLM: Leveraging Affect Enriched Embedding and  Transformer-based Neural Language Model for Readers' Emotion Detection",
    "abstract": "Technological advancements in web platforms allow people to express and share emotions towards textual write-ups written and shared by others. This brings about different interesting domains for analysis; emotion expressed by the writer and emotion elicited from the readers. In this paper, we propose a novel approach for Readers' Emotion Detection from short-text documents using a deep learning model called REDAffectiveLM. Within state-of-the-art NLP tasks, it is well understood that utilizing context-specific representations from transformer-based pre-trained language models helps achieve improved performance. Within this affective computing task, we explore how incorporating affective information can further enhance performance. Towards this, we leverage context-specific and affect enriched representations by using a transformer-based pre-trained language model in tandem with affect enriched Bi-LSTM+Attention. For empirical evaluation, we procure a new dataset REN-20k, besides using RENh-4k and SemEval-2007. We evaluate the performance of our REDAffectiveLM rigorously across these datasets, against a vast set of state-of-the-art baselines, where our model consistently outperforms baselines and obtains statistically significant results. Our results establish that utilizing affect enriched representation along with context-specific representation within a neural architecture can considerably enhance readers' emotion detection. Since the impact of affect enrichment specifically in readers' emotion detection isn't well explored, we conduct a detailed analysis over affect enriched Bi-LSTM+Attention using qualitative and quantitative model behavior evaluation techniques. We observe that compared to conventional semantic embedding, affect enriched embedding increases ability of the network to effectively identify and assign weightage to key terms responsible for readers' emotion detection. ",
    "url": "https://arxiv.org/abs/2301.08995",
    "authors": [
      "Anoop Kadan",
      "Deepak P.",
      "Manjary P. Gangan",
      "Savitha Sam Abraham",
      "Lajish V. L"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.08998",
    "title": "Syntax-guided Neural Module Distillation to Probe Compositionality in  Sentence Embeddings",
    "abstract": "Past work probing compositionality in sentence embedding models faces issues determining the causal impact of implicit syntax representations. Given a sentence, we construct a neural module net based on its syntax parse and train it end-to-end to approximate the sentence's embedding generated by a transformer model. The distillability of a transformer to a Syntactic NeurAl Module Net (SynNaMoN) then captures whether syntax is a strong causal model of its compositional ability. Furthermore, we address questions about the geometry of semantic composition by specifying individual SynNaMoN modules' internal architecture & linearity. We find differences in the distillability of various sentence embedding models that broadly correlate with their performance, but observe that distillability doesn't considerably vary by model size. We also present preliminary evidence that much syntax-guided composition in sentence embedding models is linear, and that non-linearities may serve primarily to handle non-compositional phrases. ",
    "url": "https://arxiv.org/abs/2301.08998",
    "authors": [
      "Rohan Pandey"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.09003",
    "title": "Blacks is to Anger as Whites is to Joy? Understanding Latent Affective  Bias in Large Pre-trained Neural Language Models",
    "abstract": "Groundbreaking inventions and highly significant performance improvements in deep learning based Natural Language Processing are witnessed through the development of transformer based large Pre-trained Language Models (PLMs). The wide availability of unlabeled data within human generated data deluge along with self-supervised learning strategy helps to accelerate the success of large PLMs in language generation, language understanding, etc. But at the same time, latent historical bias/unfairness in human minds towards a particular gender, race, etc., encoded unintentionally/intentionally into the corpora harms and questions the utility and efficacy of large PLMs in many real-world applications, particularly for the protected groups. In this paper, we present an extensive investigation towards understanding the existence of \"Affective Bias\" in large PLMs to unveil any biased association of emotions such as anger, fear, joy, etc., towards a particular gender, race or religion with respect to the downstream task of textual emotion detection. We conduct our exploration of affective bias from the very initial stage of corpus level affective bias analysis by searching for imbalanced distribution of affective words within a domain, in large scale corpora that are used to pre-train and fine-tune PLMs. Later, to quantify affective bias in model predictions, we perform an extensive set of class-based and intensity-based evaluations using various bias evaluation corpora. Our results show the existence of statistically significant affective bias in the PLM based emotion detection systems, indicating biased association of certain emotions towards a particular gender, race, and religion. ",
    "url": "https://arxiv.org/abs/2301.09003",
    "authors": [
      "Anoop Kadan",
      "Deepak P.",
      "Sahely Bhadra",
      "Manjary P. Gangan",
      "Lajish V. L"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.09009",
    "title": "A Semantic Modular Framework for Events Topic Modeling in Social Media",
    "abstract": "The advancement of social media contributes to the growing amount of content they share frequently. This framework provides a sophisticated place for people to report various real-life events. Detecting these events with the help of natural language processing has received researchers' attention, and various algorithms have been developed for this goal. In this paper, we propose a Semantic Modular Model (SMM) consisting of 5 different modules, namely Distributional Denoising Autoencoder, Incremental Clustering, Semantic Denoising, Defragmentation, and Ranking and Processing. The proposed model aims to (1) cluster various documents and ignore the documents that might not contribute to the identification of events, (2) identify more important and descriptive keywords. Compared to the state-of-the-art methods, the results show that the proposed model has a higher performance in identifying events with lower ranks and extracting keywords for more important events in three English Twitter datasets: FACup, SuperTuesday, and USElection. The proposed method outperformed the best reported results in the mean keyword-precision metric by 7.9\\%. ",
    "url": "https://arxiv.org/abs/2301.09009",
    "authors": [
      "Arya Hadizadeh Moghaddam",
      "Saeedeh Momtazi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.09027",
    "title": "Cellular Network Speech Enhancement: Removing Background and  Transmission Noise",
    "abstract": "The primary objective of speech enhancement is to reduce background noise while preserving the target's speech. A common dilemma occurs when a speaker is confined to a noisy environment and receives a call with high background and transmission noise. To address this problem, the Deep Noise Suppression (DNS) Challenge focuses on removing the background noise with the next-generation deep learning models to enhance the target's speech; however, researchers fail to consider Voice Over IP (VoIP) applications their transmission noise. Focusing on Google Meet and its cellular application, our work achieves state-of-the-art performance on the Google Meet To Phone Track of the VoIP DNS Challenge. This paper demonstrates how to beat industrial performance and achieve 1.92 PESQ and 0.88 STOI, as well as superior acoustic fidelity, perceptual quality, and intelligibility in various metrics. ",
    "url": "https://arxiv.org/abs/2301.09027",
    "authors": [
      "Amanda Shu",
      "Hamza Khalid",
      "Haohui Liu",
      "Shikhar Agnihotri",
      "Joseph Konan",
      "Ojas Bhargave"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2301.09028",
    "title": "Characterization and Learning of Causal Graphs with Small Conditioning  Sets",
    "abstract": "Constraint-based causal discovery algorithms learn part of the causal graph structure by systematically testing conditional independences observed in the data. These algorithms, such as the PC algorithm and its variants, rely on graphical characterizations of the so-called equivalence class of causal graphs proposed by Pearl. However, constraint-based causal discovery algorithms struggle when data is limited since conditional independence tests quickly lose their statistical power, especially when the conditioning set is large. To address this, we propose using conditional independence tests where the size of the conditioning set is upper bounded by some integer $k$ for robust causal discovery. The existing graphical characterizations of the equivalence classes of causal graphs are not applicable when we cannot leverage all the conditional independence statements. We first define the notion of $k$-Markov equivalence: Two causal graphs are $k$-Markov equivalent if they entail the same conditional independence constraints where the conditioning set size is upper bounded by $k$. We propose a novel representation that allows us to graphically characterize $k$-Markov equivalence between two causal graphs. We propose a sound constraint-based algorithm called the $k$-PC algorithm for learning this equivalence class. Finally, we conduct synthetic, and semi-synthetic experiments to demonstrate that the $k$-PC algorithm enables more robust causal discovery in the small sample regime compared to the baseline PC algorithm. ",
    "url": "https://arxiv.org/abs/2301.09028",
    "authors": [
      "Murat Kocaoglu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.09030",
    "title": "Condition monitoring and anomaly detection in cyber-physical systems",
    "abstract": "The modern industrial environment is equipping myriads of smart manufacturing machines where the state of each device can be monitored continuously. Such monitoring can help identify possible future failures and develop a cost-effective maintenance plan. However, it is a daunting task to perform early detection with low false positives and negatives from the huge volume of collected data. This requires developing a holistic machine learning framework to address the issues in condition monitoring of high-priority components and develop efficient techniques to detect anomalies that can detect and possibly localize the faulty components. This paper presents a comparative analysis of recent machine learning approaches for robust, cost-effective anomaly detection in cyber-physical systems. While detection has been extensively studied, very few researchers have analyzed the localization of the anomalies. We show that supervised learning outperforms unsupervised algorithms. For supervised cases, we achieve near-perfect accuracy of 98 percent (specifically for tree-based algorithms). In contrast, the best-case accuracy in the unsupervised cases was 63 percent :the area under the receiver operating characteristic curve (AUC) exhibits similar outcomes as an additional metric. ",
    "url": "https://arxiv.org/abs/2301.09030",
    "authors": [
      "William Marfo",
      "Deepak K. Tosh",
      "Shirley V. Moore"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09038",
    "title": "Graph Convolutional Neural Networks for Optimal Power Flow Locational  Marginal Price",
    "abstract": "The real-time electricity market with the integration of renewable energies and electric vehicles have been receiving significant attention recently. So far most of the literature addresses the optimal power flow (OPF) problem in the real-time electricity market context by iterative methods. However, solving OPF problems in real-time is challenging due to the high computational complexity by the iterative methods. Motivated by this fact, in this paper, we propose a Chebyshev Graph Convolutional Neural Networks (ChebGCN) to improve the efficiency of integrating low-carbon energy sources into power grids and to address scalability and adaptivity of end-to-end existing OPF solutions. The proposed GCN method is capable to predict the optimal energy market marginal prices in real time. Numerical analysis is used to benchmark the results and validate the improvement. ",
    "url": "https://arxiv.org/abs/2301.09038",
    "authors": [
      "Adrian-Petru Surani",
      "Rahul Sahetiya"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.09043",
    "title": "CodeScore: Evaluating Code Generation by Learning Code Execution",
    "abstract": "A proper code evaluation metric (CEM) profoundly impacts the evolution of code generation, which is an important research field in NLP and software engineering. Prevailing CEMs can be categorized into match-based CEMs (e.g., BLEU, Accuracy, and CodeBLEU) and execution-based CEMs (e.g., AvgPassRatio and Pass@k), but both of them suffer from some issues. The former only measures differences in surface form regardless of the functional equivalence of codes, while the latter has huge execution overheads, including collecting expensive test cases, resolving tedious execution dependencies, and enormous execution time. To address these issues, in this paper, we propose CodeScore, an efficient and effective CEM for code generation, which estimates test case PassRatio of generated code without executing code. We also present a framework named UniCE for training unified code evaluation models by learning code execution, i.e., learning PassRatio and Executability of generated code. In order to learn code execution comprehensively, we construct more than 100 test cases for each task in several popular benchmark datasets, covering MBPP, APPS, and HumanEval. Experimental results show that CodeScore has obtained a state-of-the-art correlation with execution-based CEMs. CodeScore is strongly correlated with AvgPassPatio, and binary CodeScore is moderately correlated with Pass@1. In particular, CodeScore eliminates the need for test cases and execution dependencies in inference, and CodeScore reduces execution time by three orders of magnitude compared to AvgPassPatio and Pass@1. ",
    "url": "https://arxiv.org/abs/2301.09043",
    "authors": [
      "Yihong Dong",
      "Jiazheng Ding",
      "Xue Jiang",
      "Zhuo Li",
      "Ge Li",
      "Zhi Jin"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2301.09063",
    "title": "DASTSiam: Spatio-Temporal Fusion and Discriminative Augmentation for  Improved Siamese Tracking",
    "abstract": "Tracking tasks based on deep neural networks have greatly improved with the emergence of Siamese trackers. However, the appearance of targets often changes during tracking, which can reduce the robustness of the tracker when facing challenges such as aspect ratio change, occlusion, and scale variation. In addition, cluttered backgrounds can lead to multiple high response points in the response map, leading to incorrect target positioning. In this paper, we introduce two transformer-based modules to improve Siamese tracking called DASTSiam: the spatio-temporal (ST) fusion module and the Discriminative Augmentation (DA) module. The ST module uses cross-attention based accumulation of historical cues to improve robustness against object appearance changes, while the DA module associates semantic information between the template and search region to improve target discrimination. Moreover, Modifying the label assignment of anchors also improves the reliability of the object location. Our modules can be used with all Siamese trackers and show improved performance on several public datasets through comparative and ablation experiments. ",
    "url": "https://arxiv.org/abs/2301.09063",
    "authors": [
      "Yucheng Huang",
      "Eksan Firkat",
      "Ziwang Xiao",
      "Jihong Zhu",
      "Askar Hamdulla"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09069",
    "title": "Provable Unrestricted Adversarial Training without Compromise with  Generalizability",
    "abstract": "Adversarial training (AT) is widely considered as the most promising strategy to defend against adversarial attacks and has drawn increasing interest from researchers. However, the existing AT methods still suffer from two challenges. First, they are unable to handle unrestricted adversarial examples (UAEs), which are built from scratch, as opposed to restricted adversarial examples (RAEs), which are created by adding perturbations bound by an $l_p$ norm to observed examples. Second, the existing AT methods often achieve adversarial robustness at the expense of standard generalizability (i.e., the accuracy on natural examples) because they make a tradeoff between them. To overcome these challenges, we propose a unique viewpoint that understands UAEs as imperceptibly perturbed unobserved examples. Also, we find that the tradeoff results from the separation of the distributions of adversarial examples and natural examples. Based on these ideas, we propose a novel AT approach called Provable Unrestricted Adversarial Training (PUAT), which can provide a target classifier with comprehensive adversarial robustness against both UAE and RAE, and simultaneously improve its standard generalizability. Particularly, PUAT utilizes partially labeled data to achieve effective UAE generation by accurately capturing the natural data distribution through a novel augmented triple-GAN. At the same time, PUAT extends the traditional AT by introducing the supervised loss of the target classifier into the adversarial loss and achieves the alignment between the UAE distribution, the natural data distribution, and the distribution learned by the classifier, with the collaboration of the augmented triple-GAN. Finally, the solid theoretical analysis and extensive experiments conducted on widely-used benchmarks demonstrate the superiority of PUAT. ",
    "url": "https://arxiv.org/abs/2301.09069",
    "authors": [
      "Lilin Zhang",
      "Ning Yang",
      "Yanchao Sun",
      "Philip S. Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09070",
    "title": "Power System Stability Analysis using Neural Network",
    "abstract": "This work focuses on the design of modern power system controllers for automatic voltage regulators (AVR) and the applications of machine learning (ML) algorithms to correctly classify the stability of the IEEE 14 bus system. The LQG controller performs the best time domain characteristics compared to PID and LQG, while the sensor and amplifier gain is changed in a dynamic passion. After that, the IEEE 14 bus system is modeled, and contingency scenarios are simulated in the System Modelica Dymola environment. Application of the Monte Carlo principle with modified Poissons probability distribution principle is reviewed from the literature that reduces the total contingency from 1000k to 20k. The damping ratio of the contingency is then extracted, pre-processed, and fed to ML algorithms, such as logistic regression, support vector machine, decision trees, random forests, Naive Bayes, and k-nearest neighbor. A neural network (NN) of one, two, three, five, seven, and ten hidden layers with 25%, 50%, 75%, and 100% data size is considered to observe and compare the prediction time, accuracy, precision, and recall value. At lower data size, 25%, in the neural network with two-hidden layers and a single hidden layer, the accuracy becomes 95.70% and 97.38%, respectively. Increasing the hidden layer of NN beyond a second does not increase the overall score and takes a much longer prediction time; thus could be discarded for similar analysis. Moreover, when five, seven, and ten hidden layers are used, the F1 score reduces. However, in practical scenarios, where the data set contains more features and a variety of classes, higher data size is required for NN for proper training. This research will provide more insight into the damping ratio-based system stability prediction with traditional ML algorithms and neural networks. ",
    "url": "https://arxiv.org/abs/2301.09070",
    "authors": [
      "Md. Rayid Hasan Mojumder"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.09072",
    "title": "ContraBERT: Enhancing Code Pre-trained Models via Contrastive Learning",
    "abstract": "Large-scale pre-trained models such as CodeBERT, GraphCodeBERT have earned widespread attention from both academia and industry. Attributed to the superior ability in code representation, they have been further applied in multiple downstream tasks such as clone detection, code search and code translation. However, it is also observed that these state-of-the-art pre-trained models are susceptible to adversarial attacks. The performance of these pre-trained models drops significantly with simple perturbations such as renaming variable names. This weakness may be inherited by their downstream models and thereby amplified at an unprecedented scale. To this end, we propose an approach namely ContraBERT that aims to improve the robustness of pre-trained models via contrastive learning. Specifically, we design nine kinds of simple and complex data augmentation operators on the programming language (PL) and natural language (NL) data to construct different variants. Furthermore, we continue to train the existing pre-trained models by masked language modeling (MLM) and contrastive pre-training task on the original samples with their augmented variants to enhance the robustness of the model. The extensive experiments demonstrate that ContraBERT can effectively improve the robustness of the existing pre-trained models. Further study also confirms that these robustness-enhanced models provide improvements as compared to original models over four popular downstream tasks. ",
    "url": "https://arxiv.org/abs/2301.09072",
    "authors": [
      "Shangqing Liu",
      "Bozhi Wu",
      "Xiaofei Xie",
      "Guozhu Meng",
      "Yang Liu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2301.09077",
    "title": "Bidirectional Propagation for Cross-Modal 3D Object Detection",
    "abstract": "Recent works have revealed the superiority of feature-level fusion for cross-modal 3D object detection, where fine-grained feature propagation from 2D image pixels to 3D LiDAR points has been widely adopted for performance improvement. Still, the potential of heterogeneous feature propagation between 2D and 3D domains has not been fully explored. In this paper, in contrast to existing pixel-to-point feature propagation, we investigate an opposite point-to-pixel direction, allowing point-wise features to flow inversely into the 2D image branch. Thus, when jointly optimizing the 2D and 3D streams, the gradients back-propagated from the 2D image branch can boost the representation ability of the 3D backbone network working on LiDAR point clouds. Then, combining pixel-to-point and point-to-pixel information flow mechanisms, we construct an bidirectional feature propagation framework, dubbed BiProDet. In addition to the architectural design, we also propose normalized local coordinates map estimation, a new 2D auxiliary task for the training of the 2D image branch, which facilitates learning local spatial-aware features from the image modality and implicitly enhances the overall 3D detection performance. Extensive experiments and ablation studies validate the effectiveness of our method. Notably, we rank $\\mathbf{1^{\\mathrm{st}}}$ on the highly competitive KITTI benchmark on the cyclist class by the time of submission. The source code is available at https://github.com/Eaphan/BiProDet. ",
    "url": "https://arxiv.org/abs/2301.09077",
    "authors": [
      "Yifan Zhang",
      "Qijian Zhang",
      "Junhui Hou",
      "Yixuan Yuan",
      "Guoliang Xing"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09093",
    "title": "RIS-assisted Cell-Free MIMO with Dynamic Arrivals and Departures of  Users: A Novel Network Stability Approach",
    "abstract": "Reconfigurable Intelligent Surfaces (RIS) have recently emerged as a hot research topic, being widely advocated as a candidate technology for next generation wireless communications. These surfaces passively alter the behavior of propagation environments enhancing the performance of wireless communication systems. In this paper, we study the use of RIS in cell-free multiple-input multiple-output (MIMO) setting where distributed service antennas, called Access Points (APs), simultaneously serve the users in the network. While most existing works focus on the physical layer improvements RIS carry, less attention has been paid to the impact of dynamic arrivals and departures of the users. In such a case, ensuring the stability of the network is the main goal. For that, we propose an optimization framework of the phase shifts, for which we derived a low-complexity solution. We then provide a theoretical analysis of the network stability and show that our framework stabilizes the network whenever it is possible. We also prove that a low complexity solution of our framework stabilizes a guaranteed fraction (higher than 78.5%) of the stability region. We provide also numerical results that corroborate the theoretical claims. ",
    "url": "https://arxiv.org/abs/2301.09093",
    "authors": [
      "Charbel Bou Chaaya",
      "Mohamad Assaad",
      "Tijani Chahed"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2301.09096",
    "title": "Initial Access Optimization for RIS-assisted Millimeter Wave Wireless  Networks",
    "abstract": "Reconfigurable Intelligent Surfaces (RIS) are considered a key enabler to achieve the vision of Smart Radio Environments, where the propagation environment can be programmed and controlled to enhance the efficiency of wireless systems. These surfaces correspond to planar sheets comprising a large number of small and low-cost reflecting elements whose parameters are adaptively selected with a programmable controller. Hence, by optimizing these coefficients, the information signals can be directed in a customized fashion. On the other hand, the initial access procedure used in 5G is beam sweeping, where the base station sequentially changes the active beam direction in order to scan all users in the cell. This conventional protocol results in an initial access latency. The aim of this paper is to minimize this delay by optimizing the activated beams in each timeslot, while leveraging the presence of the RIS in the network. The problem is formulated as a hard optimization problem. We propose an efficient solution based on jointly alternating optimization and Semi Definite Relaxation (SDR) techniques. Numerical results are provided to assess the superiority of our scheme as compared to conventional beam sweeping. ",
    "url": "https://arxiv.org/abs/2301.09096",
    "authors": [
      "Charbel Bou Chaaya",
      "Mohamad Assaad",
      "Tijani Chahed"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2301.09123",
    "title": "Face Generation from Textual Features using Conditionally Trained Inputs  to Generative Adversarial Networks",
    "abstract": "Generative Networks have proved to be extremely effective in image restoration and reconstruction in the past few years. Generating faces from textual descriptions is one such application where the power of generative algorithms can be used. The task of generating faces can be useful for a number of applications such as finding missing persons, identifying criminals, etc. This paper discusses a novel approach to generating human faces given a textual description regarding the facial features. We use the power of state of the art natural language processing models to convert face descriptions into learnable latent vectors which are then fed to a generative adversarial network which generates faces corresponding to those features. While this paper focuses on high level descriptions of faces only, the same approach can be tailored to generate any image based on fine grained textual features. ",
    "url": "https://arxiv.org/abs/2301.09123",
    "authors": [
      "Sandeep Shinde",
      "Tejas Pradhan",
      "Aniket Ghorpade",
      "Mihir Tale"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.09125",
    "title": "Selecting a suitable Parallel Label-propagation based algorithm for  Disjoint Community Detection",
    "abstract": "Community detection is an essential task in network analysis as it helps identify groups and patterns within a network. High-speed community detection algorithms are necessary to analyze large-scale networks in a reasonable amount of time. Researchers have made significant contributions in the development of high-speed community detection algorithms, particularly in the area of label-propagation based disjoint community detection. These algorithms have been proven to be highly effective in analyzing large-scale networks in a reasonable amount of time. However, it is important to evaluate the performance and accuracy of these existing methods to determine which algorithm is best suited for a particular type of network and specific research problem. In this report, we investigate the RAK, COPRA, and SLPA, three label-propagation-based static community discovery techniques. We pay close attention to each algorithm's minute details as we implement both its single-threaded and multi-threaded OpenMP-based variants, making any necessary adjustments or optimizations and obtaining the right parameter values. The RAK algorithm is found to perform well with a tolerance of 0.05 and OpenMP-based strict RAK with 12 threads was 6.75x faster than the sequential non-strict RAK. The COPRA algorithm works well with a single label for road networks and max labels of 4-16 for other classes of graphs. The SLPA algorithm performs well with increasing memory size, but overall doesn't offer a favourable return on investment. The RAK algorithm is recommended for label-propagation based disjoint community detection. ",
    "url": "https://arxiv.org/abs/2301.09125",
    "authors": [
      "Subhajit Sahu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2301.09164",
    "title": "Unifying Synergies between Self-supervised Learning and Dynamic  Computation",
    "abstract": "Self-supervised learning (SSL) approaches have made major strides forward by emulating the performance of their supervised counterparts on several computer vision benchmarks. This, however, comes at a cost of substantially larger model sizes, and computationally expensive training strategies, which eventually lead to larger inference times making it impractical for resource constrained industrial settings. Techniques like knowledge distillation (KD), dynamic computation (DC), and pruning are often used to obtain a lightweight sub-network, which usually involves multiple epochs of fine-tuning of a large pre-trained model, making it more computationally challenging. In this work we propose a novel perspective on the interplay between SSL and DC paradigms that can be leveraged to simultaneously learn a dense and gated (sparse/lightweight) sub-network from scratch offering a good accuracy-efficiency trade-off, and therefore yielding a generic and multi-purpose architecture for application specific industrial settings. Our study overall conveys a constructive message: exhaustive experiments on several image classification benchmarks: CIFAR-10, STL-10, CIFAR-100, and ImageNet-100, demonstrates that the proposed training strategy provides a dense and corresponding sparse sub-network that achieves comparable (on-par) performance compared with the vanilla self-supervised setting, but at a significant reduction in computation in terms of FLOPs under a range of target budgets. ",
    "url": "https://arxiv.org/abs/2301.09164",
    "authors": [
      "Tarun Krishna",
      "Ayush K Rai",
      "Alexandru Drimbarean",
      "Alan F Smeaton",
      "Kevin McGuinness",
      "Noel E O'Connor"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09165",
    "title": "Energy Prediction using Federated Learning",
    "abstract": "In this work, we demonstrate the viability of using federated learning to successfully predict energy consumption as well as solar production for all households within a certain network using low-power and low-space consuming embedded devices. We also demonstrate our prediction performance improving over time without the need for sharing private consumer energy data. We simulate a system with four nodes using data for one year to show this. ",
    "url": "https://arxiv.org/abs/2301.09165",
    "authors": [
      "Meghana Bharadwaj",
      "Sanjana Sarda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.09187",
    "title": "A graph isomorphism invariant based on neighborhood aggregation",
    "abstract": "This paper presents a new graph isomorphism invariant, called $\\mathfrak{w}$-labeling, that can be used to design a polynomial-time algorithm for solving the graph isomorphism problem for various graph classes. For example, all non-cospectral graph pairs are distinguished by the proposed combinatorial method, furthermore, even non-isomorphic cospectral graphs can be distinguished assuming certain properties of their eigenspaces. We also investigate a refinement of the aforementioned labeling, called $\\mathfrak{s}^k$-labeling, which has both theoretical and practical applications. Among others, it can be used to generate graph fingerprints, which uniquely identify all graphs in the considered databases, including all strongly regular graphs on at most 64 nodes and all graphs on at most 12 nodes. It provably identifies all trees and 3-connected planar graphs up to isomorphism, which -- as a byproduct -- gives a new isomorphism algorithm for both graph classes. The practical importance of this fingerprint lies in significantly speeding up searching in graph databases, which is a commonly required task in biological and chemical applications. ",
    "url": "https://arxiv.org/abs/2301.09187",
    "authors": [
      "Alpár Jüttner",
      "Péter Madarasi"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2301.09201",
    "title": "SPEC5G: A Dataset for 5G Cellular Network Protocol Analysis",
    "abstract": "5G is the 5th generation cellular network protocol. It is the state-of-the-art global wireless standard that enables an advanced kind of network designed to connect virtually everyone and everything with increased speed and reduced latency. Therefore, its development, analysis, and security are critical. However, all approaches to the 5G protocol development and security analysis, e.g., property extraction, protocol summarization, and semantic analysis of the protocol specifications and implementations are completely manual. To reduce such manual effort, in this paper, we curate SPEC5G the first-ever public 5G dataset for NLP research. The dataset contains 3,547,586 sentences with 134M words, from 13094 cellular network specifications and 13 online websites. By leveraging large-scale pre-trained language models that have achieved state-of-the-art results on NLP tasks, we use this dataset for security-related text classification and summarization. Security-related text classification can be used to extract relevant security-related properties for protocol testing. On the other hand, summarization can help developers and practitioners understand the high level of the protocol, which is itself a daunting task. Our results show the value of our 5G-centric dataset in 5G protocol analysis automation. We believe that SPEC5G will enable a new research direction into automatic analyses for the 5G cellular network protocol and numerous related downstream tasks. Our data and code are publicly available. ",
    "url": "https://arxiv.org/abs/2301.09201",
    "authors": [
      "Imtiaz Karim",
      "Kazi Samin Mubasshir",
      "Mirza Masfiqur Rahman",
      "Elisa Bertino"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09203",
    "title": "Relaxed Models for Adversarial Streaming: The Advice Model and the  Bounded Interruptions Model",
    "abstract": "Streaming algorithms are typically analyzed in the oblivious setting, where we assume that the input stream is fixed in advance. Recently, there is a growing interest in designing adversarially robust streaming algorithms that must maintain utility even when the input stream is chosen adaptively and adversarially as the execution progresses. While several fascinating results are known for the adversarial setting, in general, it comes at a very high cost in terms of the required space. Motivated by this, in this work we set out to explore intermediate models that allow us to interpolate between the oblivious and the adversarial models. Specifically, we put forward the following two models: (1) *The advice model*, in which the streaming algorithm may occasionally ask for one bit of advice. (2) *The bounded interruptions model*, in which we assume that the adversary is only partially adaptive. We present both positive and negative results for each of these two models. In particular, we present generic reductions from each of these models to the oblivious model. This allows us to design robust algorithms with significantly improved space complexity compared to what is known in the plain adversarial model. ",
    "url": "https://arxiv.org/abs/2301.09203",
    "authors": [
      "Menachem Sadigurschi",
      "Moshe Shechner",
      "Uri Stemmer"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09213",
    "title": "FRAME: Fast and Robust Autonomous 3D point cloud Map-merging for  Egocentric multi-robot exploration",
    "abstract": "This article presents a 3D point cloud map-merging framework for egocentric heterogeneous multi-robot exploration, based on overlap detection and alignment, that is independent of a manual initial guess or prior knowledge of the robots' poses. The novel proposed solution utilizes state-of-the-art place recognition learned descriptors, that through the framework's main pipeline, offer a fast and robust region overlap estimation, hence eliminating the need for the time-consuming global feature extraction and feature matching process that is typically used in 3D map integration. The region overlap estimation provides a homogeneous rigid transform that is applied as an initial condition in the point cloud registration algorithm Fast-GICP, which provides the final and refined alignment. The efficacy of the proposed framework is experimentally evaluated based on multiple field multi-robot exploration missions in underground environments, where both ground and aerial robots are deployed, with different sensor configurations. ",
    "url": "https://arxiv.org/abs/2301.09213",
    "authors": [
      "Nikolaos Stathoulopoulos",
      "Anton Koval",
      "Ali-akbar Agha-mohammadi",
      "George Nikolakopoulos"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09231",
    "title": "GP-NAS-ensemble: a model for NAS Performance Prediction",
    "abstract": "It is of great significance to estimate the performance of a given model architecture without training in the application of Neural Architecture Search (NAS) as it may take a lot of time to evaluate the performance of an architecture. In this paper, a novel NAS framework called GP-NAS-ensemble is proposed to predict the performance of a neural network architecture with a small training dataset. We make several improvements on the GP-NAS model to make it share the advantage of ensemble learning methods. Our method ranks second in the CVPR2022 second lightweight NAS challenge performance prediction track. ",
    "url": "https://arxiv.org/abs/2301.09231",
    "authors": [
      "Kunlong Chen",
      "Liu Yang",
      "Yitian Chen",
      "Kunjin Chen",
      "Yidan Xu",
      "Lujun Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.09232",
    "title": "Optimising complexity of CNN models for resource constrained devices:  QRS detection case study",
    "abstract": "Traditional DL models are complex and resource hungry and thus, care needs to be taken in designing Internet of (medical) things (IoT, or IoMT) applications balancing efficiency-complexity trade-off. Recent IoT solutions tend to avoid using deep-learning methods due to such complexities, and rather classical filter-based methods are commonly used. We hypothesize that a shallow CNN model can offer satisfactory level of performance in combination by leveraging other essential solution-components, such as post-processing that is suitable for resource constrained environment. In an IoMT application context, QRS-detection and R-peak localisation from ECG signal as a case study, the complexities of CNN models and post-processing were varied to identify a set of combinations suitable for a range of target resource-limited environments. To the best of our knowledge, finding a deploy-able configuration, by incrementally increasing the CNN model complexity, as required to match the target's resource capacity, and leveraging the strength of post-processing, is the first of its kind. The results show that a shallow 2-layer CNN with a suitable post-processing can achieve $>$90\\% F1-score, and the scores continue to improving for 8-32 layer CNNs, which can be used to profile target constraint environment. The outcome shows that it is possible to design an optimal DL solution with known target performance characteristics and resource (computing capacity, and memory) constraints. ",
    "url": "https://arxiv.org/abs/2301.09232",
    "authors": [
      "Ahsan Habib",
      "Chandan Karmakar",
      "John Yearwood"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.09245",
    "title": "Towards NeuroAI: Introducing Neuronal Diversity into Artificial Neural  Networks",
    "abstract": "Throughout history, the development of artificial intelligence, particularly artificial neural networks, has been open to and constantly inspired by the increasingly deepened understanding of the brain, such as the inspiration of neocognitron, which is the pioneering work of convolutional neural networks. Per the motives of the emerging field: NeuroAI, a great amount of neuroscience knowledge can help catalyze the next generation of AI by endowing a network with more powerful capabilities. As we know, the human brain has numerous morphologically and functionally different neurons, while artificial neural networks are almost exclusively built on a single neuron type. In the human brain, neuronal diversity is an enabling factor for all kinds of biological intelligent behaviors. Since an artificial network is a miniature of the human brain, introducing neuronal diversity should be valuable in terms of addressing those essential problems of artificial networks such as efficiency, interpretability, and memory. In this Primer, we first discuss the preliminaries of biological neuronal diversity and the characteristics of information transmission and processing in a biological neuron. Then, we review studies of designing new neurons for artificial networks. Next, we discuss what gains can neuronal diversity bring into artificial networks and exemplary applications in several important fields. Lastly, we discuss the challenges and future directions of neuronal diversity to explore the potential of NeuroAI. ",
    "url": "https://arxiv.org/abs/2301.09245",
    "authors": [
      "Feng-Lei Fan",
      "Yingxin Li",
      "Hanchuan Peng",
      "Tieyong Zeng",
      "Fei Wang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2301.09249",
    "title": "Exploring Active 3D Object Detection from a Generalization Perspective",
    "abstract": "To alleviate the high annotation cost in LiDAR-based 3D object detection, active learning is a promising solution that learns to select only a small portion of unlabeled data to annotate, without compromising model performance. Our empirical study, however, suggests that mainstream uncertainty-based and diversity-based active learning policies are not effective when applied in the 3D detection task, as they fail to balance the trade-off between point cloud informativeness and box-level annotation costs. To overcome this limitation, we jointly investigate three novel criteria in our framework Crb for point cloud acquisition - label conciseness}, feature representativeness and geometric balance, which hierarchically filters out the point clouds of redundant 3D bounding box labels, latent features and geometric characteristics (e.g., point cloud density) from the unlabeled sample pool and greedily selects informative ones with fewer objects to annotate. Our theoretical analysis demonstrates that the proposed criteria align the marginal distributions of the selected subset and the prior distributions of the unseen test set, and minimizes the upper bound of the generalization error. To validate the effectiveness and applicability of \\textsc{Crb}, we conduct extensive experiments on the two benchmark 3D object detection datasets of KITTI and Waymo and examine both one-stage (\\textit{i.e.}, \\textsc{Second}) and two-stage 3D detectors (i.e., Pv-rcnn). Experiments evidence that the proposed approach outperforms existing active learning strategies and achieves fully supervised performance requiring $1\\%$ and $8\\%$ annotations of bounding boxes and point clouds, respectively. Source code: https://github.com/Luoyadan/CRB-active-3Ddet. ",
    "url": "https://arxiv.org/abs/2301.09249",
    "authors": [
      "Yadan Luo",
      "Zhuoxiao Chen",
      "Zijian Wang",
      "Xin Yu",
      "Zi Huang",
      "Mahsa Baktashmotlagh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.09253",
    "title": "CircNet: Meshing 3D Point Clouds with Circumcenter Detection",
    "abstract": "Reconstructing 3D point clouds into triangle meshes is a key problem in computational geometry and surface reconstruction. Point cloud triangulation solves this problem by providing edge information to the input points. Since no vertex interpolation is involved, it is beneficial to preserve sharp details on the surface. Taking advantage of learning-based techniques in triangulation, existing methods enumerate the complete combinations of candidate triangles, which is both complex and inefficient. In this paper, we leverage the duality between a triangle and its circumcenter, and introduce a deep neural network that detects the circumcenters to achieve point cloud triangulation. Specifically, we introduce multiple anchor priors to divide the neighborhood space of each point. The neural network then learns to predict the presences and locations of circumcenters under the guidance of those anchors. We extract the triangles dual to the detected circumcenters to form a primitive mesh, from which an edge-manifold mesh is produced via simple post-processing. Unlike existing learning-based triangulation methods, the proposed method bypasses an exhaustive enumeration of triangle combinations and local surface parameterization. We validate the efficiency, generalization, and robustness of our method on prominent datasets of both watertight and open surfaces. The code and trained models are provided at https://github.com/Ruitao-L/CircNet. ",
    "url": "https://arxiv.org/abs/2301.09253",
    "authors": [
      "Huan Lei",
      "Ruitao Leng",
      "Liang Zheng",
      "Hongdong Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09254",
    "title": "Learning to Linearize Deep Neural Networks for Secure and Efficient  Private Inference",
    "abstract": "The large number of ReLU non-linearity operations in existing deep neural networks makes them ill-suited for latency-efficient private inference (PI). Existing techniques to reduce ReLU operations often involve manual effort and sacrifice significant accuracy. In this paper, we first present a novel measure of non-linearity layers' ReLU sensitivity, enabling mitigation of the time-consuming manual efforts in identifying the same. Based on this sensitivity, we then present SENet, a three-stage training method that for a given ReLU budget, automatically assigns per-layer ReLU counts, decides the ReLU locations for each layer's activation map, and trains a model with significantly fewer ReLUs to potentially yield latency and communication efficient PI. Experimental evaluations with multiple models on various datasets show SENet's superior performance both in terms of reduced ReLUs and improved classification accuracy compared to existing alternatives. In particular, SENet can yield models that require up to ~2x fewer ReLUs while yielding similar accuracy. For a similar ReLU budget SENet can yield models with ~2.32% improved classification accuracy, evaluated on CIFAR-100. ",
    "url": "https://arxiv.org/abs/2301.09254",
    "authors": [
      "Souvik Kundu",
      "Shunlin Lu",
      "Yuke Zhang",
      "Jacqueline Liu",
      "Peter A. Beerel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09268",
    "title": "PCBDet: An Efficient Deep Neural Network Object Detection Architecture  for Automatic PCB Component Detection on the Edge",
    "abstract": "There can be numerous electronic components on a given PCB, making the task of visual inspection to detect defects very time-consuming and prone to error, especially at scale. There has thus been significant interest in automatic PCB component detection, particularly leveraging deep learning. However, deep neural networks typically require high computational resources, possibly limiting their feasibility in real-world use cases in manufacturing, which often involve high-volume and high-throughput detection with constrained edge computing resource availability. As a result of an exploration of efficient deep neural network architectures for this use case, we introduce PCBDet, an attention condenser network design that provides state-of-the-art inference throughput while achieving superior PCB component detection performance compared to other state-of-the-art efficient architecture designs. Experimental results show that PCBDet can achieve up to 2$\\times$ inference speed-up on an ARM Cortex A72 processor when compared to an EfficientNet-based design while achieving $\\sim$2-4\\% higher mAP on the FICS-PCB benchmark dataset. ",
    "url": "https://arxiv.org/abs/2301.09268",
    "authors": [
      "Brian Li",
      "Steven Palayew",
      "Francis Li",
      "Saad Abbasi",
      "Saeejith Nair",
      "Alexander Wong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09294",
    "title": "Forecaster-aided User Association and Load Balancing in Multi-band  Mobile Networks",
    "abstract": "Cellular networks are becoming increasingly heterogeneous with higher base station (BS) densities and ever more frequency bands, making BS selection and band assignment key decisions in terms of rate and coverage. In this paper, we decompose the mobility-aware user association task into (i) forecasting of user rate and then (ii) convex utility maximization for user association accounting for the effects of BS load and handover overheads. Using a linear combination of normalized mean-squared error and normalized discounted cumulative gain as a novel loss function, a recurrent deep neural network is trained to reliably forecast the mobile users' future rates. Based on the forecast, the controller optimizes the association decisions to maximize the service rate-based network utility using our computationally efficient (speed up of 100x versus generic convex solver) algorithm based on the Frank-Wolfe method. Using an industry-grade network simulator developed by Meta, we show that the proposed model predictive control (MPC) approach improves the 5th percentile service rate by 3.5x compared to the traditional signal strength-based association, reduces the median number of handovers by 7x compared to a handover agnostic strategy, and achieves service rates close to a genie-aided scheme. Furthermore, our model-based approach is significantly more sample-efficient (needs 100x less training data) compared to model-free reinforcement learning (RL), and generalizes well across different user drop scenarios. ",
    "url": "https://arxiv.org/abs/2301.09294",
    "authors": [
      "Manan Gupta",
      "Sandeep Chinchali",
      "Paul Varkey",
      "Jeffrey G. Andrews"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.09299",
    "title": "Self-Supervised Image Representation Learning: Transcending Masking with  Paired Image Overlay",
    "abstract": "Self-supervised learning has become a popular approach in recent years for its ability to learn meaningful representations without the need for data annotation. This paper proposes a novel image augmentation technique, overlaying images, which has not been widely applied in self-supervised learning. This method is designed to provide better guidance for the model to understand underlying information, resulting in more useful representations. The proposed method is evaluated using contrastive learning, a widely used self-supervised learning method that has shown solid performance in downstream tasks. The results demonstrate the effectiveness of the proposed augmentation technique in improving the performance of self-supervised models. ",
    "url": "https://arxiv.org/abs/2301.09299",
    "authors": [
      "Yinheng Li",
      "Han Ding",
      "Shaofei Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09303",
    "title": "Downlink Transmission under Heterogeneous Blocklength Constraints:  Discrete Signaling with Single-User Decoding",
    "abstract": "In this paper, we consider the downlink broadcast channel under heterogenous blocklength constraints, where each user experiences different interference statistics across its received symbols. Different from the homogeneous blocklength case, the strong users with short blocklength transmitted symbol blocks usually cannot wait to receive the entire transmission frame and perform successive interference cancellation (SIC) owing to their stringent latency requirements. Even if SIC is feasible, it may not be perfect under finite blocklength constraints. To cope with the heterogeneity in latency and reliability requirements, we propose a practical downlink transmission scheme with discrete signaling and single-user decoding, i.e., without SIC. In addition, we derive the finite blocklength achievable rate and use it for guiding the design of channel coding and modulations. Both achievable rate and error probability simulation show that the proposed scheme can operate close to the benchmark scheme which assumes capacity-achieving signaling and perfect SIC. ",
    "url": "https://arxiv.org/abs/2301.09303",
    "authors": [
      "Min Qiu",
      "Yu-Chih Huang",
      "Jinhong Yuan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.09308",
    "title": "On the Expressive Power of Geometric Graph Neural Networks",
    "abstract": "The expressive power of Graph Neural Networks (GNNs) has been studied extensively through the Weisfeiler-Leman (WL) graph isomorphism test. However, standard GNNs and the WL framework are inapplicable for geometric graphs embedded in Euclidean space, such as biomolecules, materials, and other physical systems. In this work, we propose a geometric version of the WL test (GWL) for discriminating geometric graphs while respecting the underlying physical symmetries: permutations, rotation, reflection, and translation. We use GWL to characterise the expressive power of geometric GNNs that are invariant or equivariant to physical symmetries in terms of distinguishing geometric graphs. GWL unpacks how key design choices influence geometric GNN expressivity: (1) Invariant layers have limited expressivity as they cannot distinguish one-hop identical geometric graphs; (2) Equivariant layers distinguish a larger class of graphs by propagating geometric information beyond local neighbourhoods; (3) Higher order tensors and scalarisation enable maximally powerful geometric GNNs; and (4) GWL's discrimination-based perspective is equivalent to universal approximation. Synthetic experiments supplementing our results are available at https://github.com/chaitjo/geometric-gnn-dojo ",
    "url": "https://arxiv.org/abs/2301.09308",
    "authors": [
      "Chaitanya K. Joshi",
      "Cristian Bodnar",
      "Simon V. Mathis",
      "Taco Cohen",
      "Pietro Liò"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Group Theory (math.GR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.09312",
    "title": "Enabling Hard Constraints in Differentiable Neural Network and  Accelerator Co-Exploration",
    "abstract": "Co-exploration of an optimal neural architecture and its hardware accelerator is an approach of rising interest which addresses the computational cost problem, especially in low-profile systems. The large co-exploration space is often handled by adopting the idea of differentiable neural architecture search. However, despite the superior search efficiency of the differentiable co-exploration, it faces a critical challenge of not being able to systematically satisfy hard constraints such as frame rate. To handle the hard constraint problem of differentiable co-exploration, we propose HDX, which searches for hard-constrained solutions without compromising the global design objectives. By manipulating the gradients in the interest of the given hard constraint, high-quality solutions satisfying the constraint can be obtained. ",
    "url": "https://arxiv.org/abs/2301.09312",
    "authors": [
      "Deokki Hong",
      "Kanghyun Choi",
      "Hye Yoon Lee",
      "Joonsang Yu",
      "Noseong Park",
      "Youngsok Kim",
      "Jinho Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2301.09361",
    "title": "SMDDH: Singleton Mention detection using Deep Learning in Hindi Text",
    "abstract": "Mention detection is an important component of coreference resolution system, where mentions such as name, nominal, and pronominals are identified. These mentions can be purely coreferential mentions or singleton mentions (non-coreferential mentions). Coreferential mentions are those mentions in a text that refer to the same entities in a real world. Whereas, singleton mentions are mentioned only once in the text and do not participate in the coreference as they are not mentioned again in the following text. Filtering of these singleton mentions can substantially improve the performance of a coreference resolution process. This paper proposes a singleton mention detection module based on a fully connected network and a Convolutional neural network for Hindi text. This model utilizes a few hand-crafted features and context information, and word embedding for words. The coreference annotated Hindi dataset comprising of 3.6K sentences, and 78K tokens are used for the task. In terms of Precision, Recall, and F-measure, the experimental findings obtained are excellent. ",
    "url": "https://arxiv.org/abs/2301.09361",
    "authors": [
      "Kusum Lata",
      "Pardeep Singh",
      "Kamlesh Dutta"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09372",
    "title": "Online Network Slicing for Real Time Applications in Large-scale  Satellite Networks",
    "abstract": "In this work, we investigate resource allocation strategy for real time communication (RTC) over satellite networks with virtual network functions. Enhanced by inter-satellite links (ISLs), in-orbit computing and network virtualization technologies, large-scale satellite networks promise global coverage at low-latency and high-bandwidth for RTC applications with diversified functions. However, realizing RTC with specific function requirements using intermittent ISLs, requires efficient routing methods with fast response times. We identify that such a routing problem over time-varying graph can be formulated as an integer linear programming problem. The branch and bound method incurs $\\mathcal{O}(|\\mathcal{L}^{\\tau}| \\cdot (3 |\\mathcal{V}^{\\tau}| + |\\mathcal{L}^{\\tau}|)^{|\\mathcal{L}^{\\tau}|})$ time complexity, where $|\\mathcal{V}^{\\tau}|$ is the number of nodes, and $|\\mathcal{L}^{\\tau}|$ is the number of links during time interval ${\\tau}$. By adopting a k-shortest path-based algorithm, the theoretical worst case complexity becomes $O(|\\mathcal{V}^{\\tau}|! \\cdot |\\mathcal{V}^{\\tau}|^3)$. Although it runs fast in most cases, its solution can be sub-optimal and may not be found, resulting in compromised acceptance ratio in practice. To overcome this, we further design a graph-based algorithm by exploiting the special structure of the solution space, which can obtain the optimal solution in polynomial time with a computational complexity of $\\mathcal{O}(3|\\mathcal{L}^{\\tau}| + (2\\log{|\\mathcal{V}^{\\tau}|}+1) |\\mathcal{V}^{\\tau}|)$. Simulations conducted on starlink constellation with thousands of satellites corroborate the effectiveness of the proposed algorithm. ",
    "url": "https://arxiv.org/abs/2301.09372",
    "authors": [
      "Binquan Guo",
      "Hongyan Li",
      "Zhou Zhang",
      "Ye Yan"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2301.09378",
    "title": "Citadel: Self-Sovereign Identities on Dusk Network",
    "abstract": "The amount of sensitive information that service providers handle about their users has become a concerning fact in many use cases, where users have no other option but to trust that those companies will not misuse their personal information. To solve that, Self-Sovereign Identity (SSI) systems have become a hot topic of research in recent years: SSI systems allow users to manage their identities transparently. Recent solutions represent the rights of users to use services as Non-Fungible Tokens (NFTs) stored on Blockchains, and users prove possession of these rights using Zero-Knowledge Proofs (ZKPs). However, even when ZKPs do not leak any information about the rights, the NFTs are stored as public values linked to known accounts, and thus, they can be traced. In this paper, we design a native privacy-preserving NFT model for the Dusk Network Blockchain, and on top of it, we deploy Citadel: our novel full-privacy-preserving SSI system, where the rights of the users are privately stored on the Dusk Network Blockchain, and users can prove their ownership in a fully private manner. ",
    "url": "https://arxiv.org/abs/2301.09378",
    "authors": [
      "Xavier Salleras"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2301.09381",
    "title": "A Structural Approach to the Design of Domain Specific Neural Network  Architectures",
    "abstract": "This is a master's thesis concerning the theoretical ideas of geometric deep learning. Geometric deep learning aims to provide a structured characterization of neural network architectures, specifically focused on the ideas of invariance and equivariance of data with respect to given transformations. This thesis aims to provide a theoretical evaluation of geometric deep learning, compiling theoretical results that characterize the properties of invariant neural networks with respect to learning performance. ",
    "url": "https://arxiv.org/abs/2301.09381",
    "authors": [
      "Gerrit Nolte"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2301.09416",
    "title": "Towards Robust Video Instance Segmentation with Temporal-Aware  Transformer",
    "abstract": "Most existing transformer based video instance segmentation methods extract per frame features independently, hence it is challenging to solve the appearance deformation problem. In this paper, we observe the temporal information is important as well and we propose TAFormer to aggregate spatio-temporal features both in transformer encoder and decoder. Specifically, in transformer encoder, we propose a novel spatio-temporal joint multi-scale deformable attention module which dynamically integrates the spatial and temporal information to obtain enriched spatio-temporal features. In transformer decoder, we introduce a temporal self-attention module to enhance the frame level box queries with the temporal relation. Moreover, TAFormer adopts an instance level contrastive loss to increase the discriminability of instance query embeddings. Therefore the tracking error caused by visually similar instances can be decreased. Experimental results show that TAFormer effectively leverages the spatial and temporal information to obtain context-aware feature representation and outperforms state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2301.09416",
    "authors": [
      "Zhenghao Zhang",
      "Fangtao Shao",
      "Zuozhuo Dai",
      "Siyu Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09422",
    "title": "HALOC: Hardware-Aware Automatic Low-Rank Compression for Compact Neural  Networks",
    "abstract": "Low-rank compression is an important model compression strategy for obtaining compact neural network models. In general, because the rank values directly determine the model complexity and model accuracy, proper selection of layer-wise rank is very critical and desired. To date, though many low-rank compression approaches, either selecting the ranks in a manual or automatic way, have been proposed, they suffer from costly manual trials or unsatisfied compression performance. In addition, all of the existing works are not designed in a hardware-aware way, limiting the practical performance of the compressed models on real-world hardware platforms. To address these challenges, in this paper we propose HALOC, a hardware-aware automatic low-rank compression framework. By interpreting automatic rank selection from an architecture search perspective, we develop an end-to-end solution to determine the suitable layer-wise ranks in a differentiable and hardware-aware way. We further propose design principles and mitigation strategy to efficiently explore the rank space and reduce the potential interference problem. Experimental results on different datasets and hardware platforms demonstrate the effectiveness of our proposed approach. On CIFAR-10 dataset, HALOC enables 0.07% and 0.38% accuracy increase over the uncompressed ResNet-20 and VGG-16 models with 72.20% and 86.44% fewer FLOPs, respectively. On ImageNet dataset, HALOC achieves 0.9% higher top-1 accuracy than the original ResNet-18 model with 66.16% fewer FLOPs. HALOC also shows 0.66% higher top-1 accuracy increase than the state-of-the-art automatic low-rank compression solution with fewer computational and memory costs. In addition, HALOC demonstrates the practical speedups on different hardware platforms, verified by the measurement results on desktop GPU, embedded GPU and ASIC accelerator. ",
    "url": "https://arxiv.org/abs/2301.09422",
    "authors": [
      "Jinqi Xiao",
      "Chengming Zhang",
      "Yu Gong",
      "Miao Yin",
      "Yang Sui",
      "Lizhi Xiang",
      "Dingwen Tao",
      "Bo Yuan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09440",
    "title": "Splitting Plane Graphs to Outerplanarity",
    "abstract": "Vertex splitting replaces a vertex by two copies and partitions its incident edges amongst the copies. This problem has been studied as a graph editing operation to achieve desired properties with as few splits as possible, most often planarity, for which the problem is NP-hard. Here we study how to minimize the number of splits to turn a plane graph into an outerplane one. We tackle this problem by establishing a direct connection between splitting a plane graph to outerplanarity, finding a connected face cover, and finding a feedback vertex set in its dual. We prove NP-completeness for plane biconnected graphs, while we show that a polynomial-time algorithm exists for maximal planar graphs. Finally, we provide upper and lower bounds for certain families of maximal planar graphs. ",
    "url": "https://arxiv.org/abs/2301.09440",
    "authors": [
      "Martin Gronemann",
      "Martin Nöllenburg",
      "Anaïs Villedieu"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2301.09458",
    "title": "Dynamic Graphs Generators Analysis : an Illustrative Case Study",
    "abstract": "In this work, we investigate the analysis of generators for dynamic graphs, which are defined as graphs whose topology changes over time. We introduce a novel concept, called ''sustainability,'' to qualify the long-term evolution of dynamic graphs. A dynamic graph is considered sustainable if its evolution does not result in a static, empty, or periodic graph. To measure the dynamics of the sets of vertices and edges, we propose a metric, named ''Nervousness,'' which is derived from the Jaccard distance.As an illustration of how the analysis can be conducted, we design a parametrized generator, named D3G3 (Degree-Driven Dynamic Geometric Graphs Generator), which generates dynamic graph instances from an initial geometric graph. The evolution of these instances is driven by two rules that operate on the vertices based on their degree. By varying the parameters of the generator, different properties of the dynamic graphs can be produced.Our results show that in order to ascertain the sustainability of the generated dynamic graphs, it is necessary to study both the evolution of the order and the Nervousness for a given set of parameters. ",
    "url": "https://arxiv.org/abs/2301.09458",
    "authors": [
      "Yoann Pigné",
      "Vincent Bridonneau",
      "Frédéric Guinand"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Group Theory (math.GR)"
    ]
  },
  {
    "id": "arXiv:2301.09489",
    "title": "Contracting Skeletal Kinematic Embeddings for Anomaly Detection",
    "abstract": "Detecting the anomaly of human behavior is paramount to timely recognizing endangering situations, such as street fights or elderly falls. However, anomaly detection is complex, since anomalous events are rare and because it is an open set recognition task, i.e., what is anomalous at inference has not been observed at training. We propose COSKAD, a novel model which encodes skeletal human motion by an efficient graph convolutional network and learns to COntract SKeletal kinematic embeddings onto a latent hypersphere of minimum volume for Anomaly Detection. We propose and analyze three latent space designs for COSKAD: the commonly-adopted Euclidean, and the new spherical-radial and hyperbolic volumes. All three variants outperform the state-of-the-art, including video-based techniques, on the ShangaiTechCampus, the Avenue, and on the most recent UBnormal dataset, for which we contribute novel skeleton annotations and the selection of human-related videos. The source code and dataset will be released upon acceptance. ",
    "url": "https://arxiv.org/abs/2301.09489",
    "authors": [
      "Alessandro Flaborea",
      "Guido Maria D'Amely di Melendugno",
      "Stefano D'arrigo",
      "Marco Aurelio Sterpa",
      "Alessio Sampieri",
      "Fabio Galasso"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09496",
    "title": "ECGAN: Self-supervised generative adversarial network for  electrocardiography",
    "abstract": "High-quality synthetic data can support the development of effective predictive models for biomedical tasks, especially in rare diseases or when subject to compelling privacy constraints. These limitations, for instance, negatively impact open access to electrocardiography datasets about arrhythmias. This work introduces a self-supervised approach to the generation of synthetic electrocardiography time series which is shown to promote morphological plausibility. Our model (ECGAN) allows conditioning the generative process for specific rhythm abnormalities, enhancing synchronization and diversity across samples with respect to literature models. A dedicated sample quality assessment framework is also defined, leveraging arrhythmia classifiers. The empirical results highlight a substantial improvement against state-of-the-art generative models for sequences and audio synthesis. ",
    "url": "https://arxiv.org/abs/2301.09496",
    "authors": [
      "Lorenzo Simone",
      "Davide Bacciu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09505",
    "title": "Rethinking the Expressive Power of GNNs via Graph Biconnectivity",
    "abstract": "Designing expressive Graph Neural Networks (GNNs) is a central topic in learning graph-structured data. While numerous approaches have been proposed to improve GNNs in terms of the Weisfeiler-Lehman (WL) test, generally there is still a lack of deep understanding of what additional power they can systematically and provably gain. In this paper, we take a fundamentally different perspective to study the expressive power of GNNs beyond the WL test. Specifically, we introduce a novel class of expressivity metrics via graph biconnectivity and highlight their importance in both theory and practice. As biconnectivity can be easily calculated using simple algorithms that have linear computational costs, it is natural to expect that popular GNNs can learn it easily as well. However, after a thorough review of prior GNN architectures, we surprisingly find that most of them are not expressive for any of these metrics. The only exception is the ESAN framework (Bevilacqua et al., 2022), for which we give a theoretical justification of its power. We proceed to introduce a principled and more efficient approach, called the Generalized Distance Weisfeiler-Lehman (GD-WL), which is provably expressive for all biconnectivity metrics. Practically, we show GD-WL can be implemented by a Transformer-like architecture that preserves expressiveness and enjoys full parallelizability. A set of experiments on both synthetic and real datasets demonstrates that our approach can consistently outperform prior GNN architectures. ",
    "url": "https://arxiv.org/abs/2301.09505",
    "authors": [
      "Bohang Zhang",
      "Shengjie Luo",
      "Liwei Wang",
      "Di He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.09508",
    "title": "BayBFed: Bayesian Backdoor Defense for Federated Learning",
    "abstract": "Federated learning (FL) allows participants to jointly train a machine learning model without sharing their private data with others. However, FL is vulnerable to poisoning attacks such as backdoor attacks. Consequently, a variety of defenses have recently been proposed, which have primarily utilized intermediary states of the global model (i.e., logits) or distance of the local models (i.e., L2-norm) from the global model to detect malicious backdoors. However, as these approaches directly operate on client updates, their effectiveness depends on factors such as clients' data distribution or the adversary's attack strategies. In this paper, we introduce a novel and more generic backdoor defense framework, called BayBFed, which proposes to utilize probability distributions over client updates to detect malicious updates in FL: it computes a probabilistic measure over the clients' updates to keep track of any adjustments made in the updates, and uses a novel detection algorithm that can leverage this probabilistic measure to efficiently detect and filter out malicious updates. Thus, it overcomes the shortcomings of previous approaches that arise due to the direct usage of client updates; as our probabilistic measure will include all aspects of the local client training strategies. BayBFed utilizes two Bayesian Non-Parametric extensions: (i) a Hierarchical Beta-Bernoulli process to draw a probabilistic measure given the clients' updates, and (ii) an adaptation of the Chinese Restaurant Process (CRP), referred by us as CRP-Jensen, which leverages this probabilistic measure to detect and filter out malicious updates. We extensively evaluate our defense approach on five benchmark datasets: CIFAR10, Reddit, IoT intrusion detection, MNIST, and FMNIST, and show that it can effectively detect and eliminate malicious updates in FL without deteriorating the benign performance of the global model. ",
    "url": "https://arxiv.org/abs/2301.09508",
    "authors": [
      "Kavita Kumari",
      "Phillip Rieger",
      "Hossein Fereidooni",
      "Murtuza Jadliwala",
      "Ahmad-Reza Sadeghi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.09522",
    "title": "Optimising Event-Driven Spiking Neural Network with Regularisation and  Cutoff",
    "abstract": "Spiking neural networks (SNNs), a variant of artificial neural networks (ANNs) with the benefit of energy efficiency, have achieved the accuracy close to its ANN counterparts, on benchmark datasets such as CIFAR10/100 and ImageNet. However, comparing with frame-based input (e.g., images), event-based inputs from e.g., Dynamic Vision Sensor (DVS) can make a better use of SNNs thanks to the SNNs' asynchronous working mechanism. In this paper, we strengthen the marriage between SNNs and event-based inputs with a proposal to consider anytime optimal inference SNNs, or AOI-SNNs, which can terminate anytime during the inference to achieve optimal inference result. Two novel optimisation techniques are presented to achieve AOI-SNNs: a regularisation and a cutoff. The regularisation enables the training and construction of SNNs with optimised performance, and the cutoff technique optimises the inference of SNNs on event-driven inputs. We conduct an extensive set of experiments on multiple benchmark event-based datasets, including CIFAR10-DVS, N-Caltech101 and DVS128 Gesture. The experimental results demonstrate that our techniques are superior to the state-of-the-art with respect to the accuracy and latency. ",
    "url": "https://arxiv.org/abs/2301.09522",
    "authors": [
      "Dengyu Wu",
      "Gaojie Jin",
      "Han Yu",
      "Xinping Yi",
      "Xiaowei Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09524",
    "title": "RF+clust for Leave-One-Problem-Out Performance Prediction",
    "abstract": "Per-instance automated algorithm configuration and selection are gaining significant moments in evolutionary computation in recent years. Two crucial, sometimes implicit, ingredients for these automated machine learning (AutoML) methods are 1) feature-based representations of the problem instances and 2) performance prediction methods that take the features as input to estimate how well a specific algorithm instance will perform on a given problem instance. Non-surprisingly, common machine learning models fail to make predictions for instances whose feature-based representation is underrepresented or not covered in the training data, resulting in poor generalization ability of the models for problems not seen during training.In this work, we study leave-one-problem-out (LOPO) performance prediction. We analyze whether standard random forest (RF) model predictions can be improved by calibrating them with a weighted average of performance values obtained by the algorithm on problem instances that are sufficiently close to the problem for which a performance prediction is sought, measured by cosine similarity in feature space. While our RF+clust approach obtains more accurate performance prediction for several problems, its predictive power crucially depends on the chosen similarity threshold as well as on the feature portfolio for which the cosine similarity is measured, thereby opening a new angle for feature selection in a zero-shot learning setting, as LOPO is termed in machine learning. ",
    "url": "https://arxiv.org/abs/2301.09524",
    "authors": [
      "Ana Nikolikj",
      "Carola Doerr",
      "Tome Eftimov"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.09542",
    "title": "Improving Presentation Attack Detection for ID Cards on Remote  Verification Systems",
    "abstract": "In this paper, an updated two-stage, end-to-end Presentation Attack Detection method for remote biometric verification systems of ID cards, based on MobileNetV2, is presented. Several presentation attack species such as printed, display, composite (based on cropped and spliced areas), plastic (PVC), and synthetic ID card images using different capture sources are used. This proposal was developed using a database consisting of 190.000 real case Chilean ID card images with the support of a third-party company. Also, a new framework called PyPAD, used to estimate multi-class metrics compliant with the ISO/IEC 30107-3 standard was developed, and will be made available for research purposes. Our method is trained on two convolutional neural networks separately, reaching BPCER\\textsubscript{100} scores on ID cards attacks of 1.69\\% and 2.36\\% respectively. The two-stage method using both models together can reach a BPCER\\textsubscript{100} score of 0.92\\%. ",
    "url": "https://arxiv.org/abs/2301.09542",
    "authors": [
      "Sebastian Gonzalez",
      "Juan Tapia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09544",
    "title": "Learning to View: Decision Transformers for Active Object Detection",
    "abstract": "Active perception describes a broad class of techniques that couple planning and perception systems to move the robot in a way to give the robot more information about the environment. In most robotic systems, perception is typically independent of motion planning. For example, traditional object detection is passive: it operates only on the images it receives. However, we have a chance to improve the results if we allow planning to consume detection signals and move the robot to collect views that maximize the quality of the results. In this paper, we use reinforcement learning (RL) methods to control the robot in order to obtain images that maximize the detection quality. Specifically, we propose using a Decision Transformer with online fine-tuning, which first optimizes the policy with a pre-collected expert dataset and then improves the learned policy by exploring better solutions in the environment. We evaluate the performance of proposed method on an interactive dataset collected from an indoor scenario simulator. Experimental results demonstrate that our method outperforms all baselines, including expert policy and pure offline RL methods. We also provide exhaustive analyses of the reward distribution and observation space. ",
    "url": "https://arxiv.org/abs/2301.09544",
    "authors": [
      "Wenhao Ding",
      "Nathalie Majcherczyk",
      "Mohit Deshpande",
      "Xuewei Qi",
      "Ding Zhao",
      "Rajasimman Madhivanan",
      "Arnie Sen"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09559",
    "title": "SpArX: Sparse Argumentative Explanations for Neural Networks",
    "abstract": "Neural networks (NNs) have various applications in AI, but explaining their decision process remains challenging. Existing approaches often focus on explaining how changing individual inputs affects NNs' outputs. However, an explanation that is consistent with the input-output behaviour of an NN is not necessarily faithful to the actual mechanics thereof. In this paper, we exploit relationships between multi-layer perceptrons (MLPs) and quantitative argumentation frameworks (QAFs) to create argumentative explanations for the mechanics of MLPs. Our SpArX method first sparsifies the MLP while maintaining as much of the original mechanics as possible. It then translates the sparse MLP into an equivalent QAF to shed light on the underlying decision process of the MLP, producing global and/or local explanations. We demonstrate experimentally that SpArX can give more faithful explanations than existing approaches, while simultaneously providing deeper insights into the actual reasoning process of MLPs. ",
    "url": "https://arxiv.org/abs/2301.09559",
    "authors": [
      "Hamed Ayoobi",
      "Nico Potyka",
      "Francesca Toni"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.09588",
    "title": "A Digital Delay Model Supporting Large Adversarial Delay Variations",
    "abstract": "Dynamic digital timing analysis is a promising alternative to analog simulations for verifying particularly timing-critical parts of a circuit. A necessary prerequisite is a digital delay model, which allows to accurately predict the input-to-output delay of a given transition in the input signal(s) of a gate. Since all existing digital delay models for dynamic digital timing analysis are deterministic, however, they cannot cover delay fluctuations caused by PVT variations, aging and analog signal noise. The only exception known to us is the $\\eta$-IDM introduced by F\\\"ugger et al. at DATE'18, which allows to add (very) small adversarially chosen delay variations to the deterministic involution delay model, without endangering its faithfulness. In this paper, we show that it is possible to extend the range of allowed delay variations so significantly that realistic PVT variations and aging are covered by the resulting extended $\\eta$-IDM. ",
    "url": "https://arxiv.org/abs/2301.09588",
    "authors": [
      "Daniel Öhlinger",
      "Ulrich Schmid"
    ],
    "subjectives": [
      "Other Computer Science (cs.OH)"
    ]
  },
  {
    "id": "arXiv:2301.09602",
    "title": "Adapting the Hypersphere Loss Function from Anomaly Detection to Anomaly  Segmentation",
    "abstract": "We propose an incremental improvement to Fully Convolutional Data Description (FCDD), an adaptation of the one-class classification approach from anomaly detection to image anomaly segmentation (a.k.a. anomaly localization). We analyze its original loss function and propose a substitute that better resembles its predecessor, the Hypersphere Classifier (HSC). Both are compared on the MVTec Anomaly Detection Dataset (MVTec-AD) -- training images are flawless objects/textures and the goal is to segment unseen defects -- showing that consistent improvement is achieved by better designing the pixel-wise supervision. ",
    "url": "https://arxiv.org/abs/2301.09602",
    "authors": [
      "Joao P. C. Bertoldo",
      "Santiago Velasco-Forero",
      "Jesus Angulo",
      "Etienne Decencière"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09607",
    "title": "Narrowband Interference Detection via Deep Learning",
    "abstract": "Due to the increased usage of spectrum caused by the exponential growth of wireless devices, detecting and avoiding interference has become an increasingly relevant problem to ensure uninterrupted wireless communications. In this paper, we focus our interest on detecting narrowband interference caused by signals that despite occupying a small portion of the spectrum only can cause significant harm to wireless systems, for example, in the case of interference with pilots and other signals that are used to equalize the effect of the channel or attain synchronization. Due to the small sizes of these signals, detection can be difficult due to their low energy footprint, while greatly impacting (or denying completely in some cases) network communications. We present a novel narrowband interference detection solution that utilizes convolutional neural networks (CNNs) to detect and locate these signals with high accuracy. To demonstrate the effectiveness of our solution, we have built a prototype that has been tested and validated on a real-world over-the-air large-scale wireless testbed. Our experimental results show that our solution is capable of detecting narrowband jamming attacks with an accuracy of up to 99%. Moreover, it is also able to detect multiple attacks affecting several frequencies at the same time even in the case of previously unseen attack patterns. Not only can our solution achieve a detection accuracy between 92% and 99%, but it does so by only adding an inference latency of 0.093ms. ",
    "url": "https://arxiv.org/abs/2301.09607",
    "authors": [
      "Clifton Paul Robinson",
      "Daniel Uvaydov",
      "Salvatore D'Oro",
      "Tommaso Melodia"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.09615",
    "title": "ESWORD: Implementation of Wireless Jamming Attacks in a Real-World  Emulated Network",
    "abstract": "Wireless jamming attacks have plagued wireless communication systems and will continue to do so going forward with technological advances. These attacks fall under the category of Electronic Warfare (EW), a continuously growing area in both attack and defense of the electromagnetic spectrum, with one subcategory being electronic attacks. Jamming attacks fall under this specific subcategory of EW as they comprise adversarial signals that attempt to disrupt, deny, degrade, destroy, or deceive legitimate signals in the electromagnetic spectrum. While jamming is not going away, recent research advances have started to get the upper hand against these attacks by leveraging new methods and techniques, such as machine learning. However, testing such jamming solutions on a wide and realistic scale is a daunting task due to strict regulations on spectrum emissions. In this paper, we introduce eSWORD, the first large-scale framework that allows users to safely conduct real-time and controlled jamming experiments with hardware-in-the-loop. This is done by integrating eSWORD into the Colosseum wireless network emulator that enables large-scale experiments with up to 50 software-defined radio nodes. We compare the performance of eSWORD with that of real-world jamming systems by using an over-the-air wireless testbed (ensuring safe measures were taken when conducting experiments). Our experimental results demonstrate that eSWORD follows similar patterns in throughput, signal-to-noise ratio, and link status to real-world jamming experiments, testifying to the high accuracy of the emulated eSWORD setup. ",
    "url": "https://arxiv.org/abs/2301.09615",
    "authors": [
      "Clifton Paul Robinson",
      "Leonardo Bonati",
      "Tara Van Nieuwstadt",
      "Teddy Reiss",
      "Pedram Johari",
      "Michele Polese",
      "Hieu Nguyen",
      "Curtis Watson",
      "Tommaso Melodia"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2301.09617",
    "title": "Fully transformer-based biomarker prediction from colorectal cancer  histology: a large-scale multicentric study",
    "abstract": "Background: Deep learning (DL) can extract predictive and prognostic biomarkers from routine pathology slides in colorectal cancer. For example, a DL test for the diagnosis of microsatellite instability (MSI) in CRC has been approved in 2022. Current approaches rely on convolutional neural networks (CNNs). Transformer networks are outperforming CNNs and are replacing them in many applications, but have not been used for biomarker prediction in cancer at a large scale. In addition, most DL approaches have been trained on small patient cohorts, which limits their clinical utility. Methods: In this study, we developed a new fully transformer-based pipeline for end-to-end biomarker prediction from pathology slides. We combine a pre-trained transformer encoder and a transformer network for patch aggregation, capable of yielding single and multi-target prediction at patient level. We train our pipeline on over 9,000 patients from 10 colorectal cancer cohorts. Results: A fully transformer-based approach massively improves the performance, generalizability, data efficiency, and interpretability as compared with current state-of-the-art algorithms. After training on a large multicenter cohort, we achieve a sensitivity of 0.97 with a negative predictive value of 0.99 for MSI prediction on surgical resection specimens. We demonstrate for the first time that resection specimen-only training reaches clinical-grade performance on endoscopic biopsy tissue, solving a long-standing diagnostic problem. Interpretation: A fully transformer-based end-to-end pipeline trained on thousands of pathology slides yields clinical-grade performance for biomarker prediction on surgical resections and biopsies. Our new methods are freely available under an open source license. ",
    "url": "https://arxiv.org/abs/2301.09617",
    "authors": [
      "Sophia J. Wagner",
      "Daniel Reisenbüchler",
      "Nicholas P. West",
      "Jan Moritz Niehues",
      "Gregory Patrick Veldhuizen",
      "Philip Quirke",
      "Heike I. Grabsch",
      "Piet A. van den Brandt",
      "Gordon G. A. Hutchins",
      "Susan D. Richman",
      "Tanwei Yuan",
      "Rupert Langer",
      "Josien Christina Anna Jenniskens",
      "Kelly Offermans",
      "Wolfram Mueller",
      "Richard Gray",
      "Stephen B. Gruber",
      "Joel K. Greenson",
      "Gad Rennert",
      "Joseph D. Bonner",
      "Daniel Schmolze",
      "Jacqueline A. James",
      "Maurice B. Loughrey",
      "Manuel Salto-Tellez",
      "Hermann Brenner",
      "Michael Hoffmeister",
      "Daniel Truhn",
      "Julia A. Schnabel",
      "Melanie Boxberg",
      "Tingying Peng",
      "Jakob Nikolas Kather"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09620",
    "title": "Tracking the industrial growth of modern China with high-resolution  panchromatic imagery: A sequential convolutional approach",
    "abstract": "Due to insufficient or difficult to obtain data on development in inaccessible regions, remote sensing data is an important tool for interested stakeholders to collect information on economic growth. To date, no studies have utilized deep learning to estimate industrial growth at the level of individual sites. In this study, we harness high-resolution panchromatic imagery to estimate development over time at 419 industrial sites in the People's Republic of China using a multi-tier computer vision framework. We present two methods for approximating development: (1) structural area coverage estimated through a Mask R-CNN segmentation algorithm, and (2) imputing development directly with visible & infrared radiance from the Visible Infrared Imaging Radiometer Suite (VIIRS). Labels generated from these methods are comparatively evaluated and tested. On a dataset of 2,078 50 cm resolution images spanning 19 years, the results indicate that two dimensions of industrial development can be estimated using high-resolution daytime imagery, including (a) the total square meters of industrial development (average error of 0.021 $\\textrm{km}^2$), and (b) the radiance of lights (average error of 9.8 $\\mathrm{\\frac{nW}{cm^{2}sr}}$). Trend analysis of the techniques reveal estimates from a Mask R-CNN-labeled CNN-LSTM track ground truth measurements most closely. The Mask R-CNN estimates positive growth at every site from the oldest image to the most recent, with an average change of 4,084 $\\textrm{m}^2$. ",
    "url": "https://arxiv.org/abs/2301.09620",
    "authors": [
      "Ethan Brewer",
      "Zhonghui Lv",
      "Dan Runfola"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09632",
    "title": "HexPlane: A Fast Representation for Dynamic Scenes",
    "abstract": "Modeling and re-rendering dynamic 3D scenes is a challenging task in 3D vision. Prior approaches build on NeRF and rely on implicit representations. This is slow since it requires many MLP evaluations, constraining real-world applications. We show that dynamic 3D scenes can be explicitly represented by six planes of learned features, leading to an elegant solution we call HexPlane. A HexPlane computes features for points in spacetime by fusing vectors extracted from each plane, which is highly efficient. Pairing a HexPlane with a tiny MLP to regress output colors and training via volume rendering gives impressive results for novel view synthesis on dynamic scenes, matching the image quality of prior work but reducing training time by more than $100\\times$. Extensive ablations confirm our HexPlane design and show that it is robust to different feature fusion mechanisms, coordinate systems, and decoding mechanisms. HexPlanes are a simple and effective solution for representing 4D volumes, and we hope they can broadly contribute to modeling spacetime for dynamic 3D scenes. ",
    "url": "https://arxiv.org/abs/2301.09632",
    "authors": [
      "Ang Cao",
      "Justin Johnson"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:1611.09265",
    "title": "Image Processing with Dipole-Coupled Nanomagnets: Noise Suppression and  Edge Enhancement Detection",
    "abstract": "Hardware based image processing offers speed and convenience not found in software-centric approaches. Here, we show theoretically that a two-dimensional periodic array of dipole-coupled elliptical nanomagnets, delineated on a piezoelectric substrate, can act as a dynamical system for specific image processing functions. Each nanomagnet has two stable magnetization states that encode pixel color (black or white). An image containing black and white pixels is first converted to voltage states and then mapped into the magnetization states of a nanomagnet array with magneto-tunneling junctions (MTJs). The same MTJs are employed to read out the processed pixel colors later. Dipole interaction between the nanomagnets implements specific image processing tasks such as noise reduction and edge enhancement detection. These functions are triggered by applying a global strain to the nanomagnets with a voltage dropped across the piezoelectric substrate. An image containing an arbitrary number of black and white pixels can be processed in few nanoseconds with very low energy cost. ",
    "url": "https://arxiv.org/abs/1611.09265",
    "authors": [
      "Md Ahsanul Abeed",
      "Ayan K. Biswas",
      "Md Mamun Al-Rashid",
      "Jayasimha Atulasimha",
      "Supriyo Bandyopadhyay"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Mesoscale and Nanoscale Physics (cond-mat.mes-hall)",
      "Image and Video Processing (eess.IV)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.07541",
    "title": "Generative Adversarial Networks to infer velocity components in rotating  turbulent flows",
    "abstract": "Inference problems for two-dimensional snapshots of rotating turbulent flows are studied. We perform a systematic quantitative benchmark of point-wise and statistical reconstruction capabilities of the linear Extended Proper Orthogonal Decomposition (EPOD) method, a non-linear Convolutional Neural Network (CNN) and a Generative Adversarial Network (GAN). We attack the important task of inferring one velocity component out of the measurement of a second one, and two cases are studied: (I) both components lay in the plane orthogonal to the rotation axis and (II) one of the two is parallel to the rotation axis. We show that EPOD method works well only for the former case where both components are strongly correlated, while CNN and GAN always outperform EPOD both concerning point-wise and statistical reconstructions. For case (II), when the input and output data are weakly correlated, all methods fail to reconstruct faithfully the point-wise information. In this case, only GAN is able to reconstruct the field in a statistical sense. The analysis is performed using both standard validation tools based on L2 spatial distance between the prediction and the ground truth and more sophisticated multi-scale analysis using wavelet decomposition. Statistical validation is based on standard Jensen-Shannon divergence between the probability density functions, spectral properties and multi-scale flatness. ",
    "url": "https://arxiv.org/abs/2301.07541",
    "authors": [
      "Tianyi Li",
      "Michele Buzzicotti",
      "Luca Biferale",
      "Fabio Bonaccorso"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Chaotic Dynamics (nlin.CD)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2301.07769",
    "title": "Reconstructing Rayleigh-Benard flows out of temperature-only  measurements using Physics-Informed Neural Networks",
    "abstract": "We investigate the capabilities of Physics-Informed Neural Networks (PINNs) to reconstruct turbulent Rayleigh-Benard flows using only temperature information. We perform a quantitative analysis of the quality of the reconstructions at various amounts of low-passed-filtered information and turbulent intensities. We compare our results with those obtained via nudging, a classical equation-informed data assimilation technique. At low Rayleigh numbers, PINNs are able to reconstruct with high precision, comparable to the one achieved with nudging. At high Rayleigh numbers, PINNs outperform nudging and are able to achieve satisfactory reconstruction of the velocity fields only when data for temperature is provided with high spatial and temporal density. When data becomes sparse, the PINNs performance worsens, not only in a point-to-point error sense but also, and contrary to nudging, in a statistical sense, as can be seen in the probability density functions and energy spectra. ",
    "url": "https://arxiv.org/abs/2301.07769",
    "authors": [
      "Patricio Clark Di Leoni",
      "Lokahith Agasthya",
      "Michele Buzzicotti",
      "Luca Biferale"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Chaotic Dynamics (nlin.CD)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2301.08782",
    "title": "Estimation of mitral valve hinge point coordinates -- deep neural net  for echocardiogram segmentation",
    "abstract": "Cardiac image segmentation is a powerful tool in regard to diagnostics and treatment of cardiovascular diseases. Purely feature-based detection of anatomical structures like the mitral valve is a laborious task due to specifically required feature engineering and is especially challenging in echocardiograms, because of their inherently low contrast and blurry boundaries between some anatomical structures. With the publication of further annotated medical datasets and the increase in GPU processing power, deep learning-based methods in medical image segmentation became more feasible in the past years. We propose a fully automatic detection method for mitral valve hinge points, which uses a U-Net based deep neural net to segment cardiac chambers in echocardiograms in a first step, and subsequently extracts the mitral valve hinge points from the resulting segmentations in a second step. Results measured with this automatic detection method were compared to reference coordinate values, which with median absolute hinge point coordinate errors of 1.35 mm for the x- (15-85 percentile range: [0.3 mm; 3.15 mm]) and 0.75 mm for the y- coordinate (15-85 percentile range: [0.15 mm; 1.88 mm]). ",
    "url": "https://arxiv.org/abs/2301.08782",
    "authors": [
      "Christian Schmidt",
      "Heinrich Martin Overhoff"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08788",
    "title": "Causal Inference under Data Restrictions",
    "abstract": "This dissertation focuses on modern causal inference under uncertainty and data restrictions, with applications to neoadjuvant clinical trials, distributed data networks, and robust individualized decision making. In the first project, we propose a method under the principal stratification framework to identify and estimate the average treatment effects on a binary outcome, conditional on the counterfactual status of a post-treatment intermediate response. Under mild assumptions, the treatment effect of interest can be identified. We extend the approach to address censored outcome data. The proposed method is applied to a neoadjuvant clinical trial and its performance is evaluated via simulation studies. In the second project, we propose a tree-based model averaging approach to improve the estimation accuracy of conditional average treatment effects at a target site by leveraging models derived from other potentially heterogeneous sites, without them sharing subject-level data. The performance of this approach is demonstrated by a study of the causal effects of oxygen therapy on hospital survival rates and backed up by comprehensive simulations. In the third project, we propose a robust individualized decision learning framework with sensitive variables to improve the worst-case outcomes of individuals caused by sensitive variables that are unavailable at the time of decision. Unlike most existing work that uses mean-optimal objectives, we propose a robust learning framework by finding a newly defined quantile- or infimum-optimal decision rule. From a causal perspective, we also generalize the classic notion of (average) fairness to conditional fairness for individual subjects. The reliable performance of the proposed method is demonstrated through synthetic experiments and three real-data applications. ",
    "url": "https://arxiv.org/abs/2301.08788",
    "authors": [
      "Xiaoqing Tan"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08888",
    "title": "Pre-text Representation Transfer for Deep Learning with Limited  Imbalanced Data : Application to CT-based COVID-19 Detection",
    "abstract": "Annotating medical images for disease detection is often tedious and expensive. Moreover, the available training samples for a given task are generally scarce and imbalanced. These conditions are not conducive for learning effective deep neural models. Hence, it is common to 'transfer' neural networks trained on natural images to the medical image domain. However, this paradigm lacks in performance due to the large domain gap between the natural and medical image data. To address that, we propose a novel concept of Pre-text Representation Transfer (PRT). In contrast to the conventional transfer learning, which fine-tunes a source model after replacing its classification layers, PRT retains the original classification layers and updates the representation layers through an unsupervised pre-text task. The task is performed with (original, not synthetic) medical images, without utilizing any annotations. This enables representation transfer with a large amount of training data. This high-fidelity representation transfer allows us to use the resulting model as a more effective feature extractor. Moreover, we can also subsequently perform the traditional transfer learning with this model. We devise a collaborative representation based classification layer for the case when we leverage the model as a feature extractor. We fuse the output of this layer with the predictions of a model induced with the traditional transfer learning performed over our pre-text transferred model. The utility of our technique for limited and imbalanced data classification problem is demonstrated with an extensive five-fold evaluation for three large-scale models, tested for five different class-imbalance ratios for CT based COVID-19 detection. Our results show a consistent gain over the conventional transfer learning with the proposed method. ",
    "url": "https://arxiv.org/abs/2301.08888",
    "authors": [
      "Fouzia Altaf",
      "Syed M. S. Islam",
      "Naeem K. Janjua",
      "Naveed Akhtar"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08925",
    "title": "New Challenges for Content Privacy in Speech and Audio",
    "abstract": "Privacy in speech and audio has many facets. A particularly under-developed area of privacy in this domain involves consideration for information related to content and context. Speech content can include words and their meaning or even stylistic markers, pathological speech, intonation patterns, or emotion. More generally, audio captured in-the-wild may contain background speech or reveal contextual information such as markers of location, room characteristics, paralinguistic sounds, or other audible events. Audio recording devices and speech technologies are becoming increasingly commonplace in everyday life. At the same time, commercialised speech and audio technologies do not provide consumers with a range of privacy choices. Even where privacy is regulated or protected by law, technical solutions to privacy assurance and enforcement fall short. This position paper introduces three important and timely research challenges for content privacy in speech and audio. We highlight current gaps and opportunities, and identify focus areas, that could have significant implications for developing ethical and safer speech technologies. ",
    "url": "https://arxiv.org/abs/2301.08925",
    "authors": [
      "Jennifer Williams",
      "Karla Pizzi",
      "Shuvayanti Das",
      "Paul-Gauthier Noe"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Cryptography and Security (cs.CR)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2301.09024",
    "title": "Statistically Optimal Robust Mean and Covariance Estimation for  Anisotropic Gaussians",
    "abstract": "Assume that $X_{1}, \\ldots, X_{N}$ is an $\\varepsilon$-contaminated sample of $N$ independent Gaussian vectors in $\\mathbb{R}^d$ with mean $\\mu$ and covariance $\\Sigma$. In the strong $\\varepsilon$-contamination model we assume that the adversary replaced an $\\varepsilon$ fraction of vectors in the original Gaussian sample by any other vectors. We show that there is an estimator $\\widehat \\mu$ of the mean satisfying, with probability at least $1 - \\delta$, a bound of the form \\[ \\|\\widehat{\\mu} - \\mu\\|_2 \\le c\\left(\\sqrt{\\frac{\\operatorname{Tr}(\\Sigma)}{N}} + \\sqrt{\\frac{\\|\\Sigma\\|\\log(1/\\delta)}{N}} + \\varepsilon\\sqrt{\\|\\Sigma\\|}\\right), \\] where $c > 0$ is an absolute constant and $\\|\\Sigma\\|$ denotes the operator norm of $\\Sigma$. In the same contaminated Gaussian setup, we construct an estimator $\\widehat \\Sigma$ of the covariance matrix $\\Sigma$ that satisfies, with probability at least $1 - \\delta$, \\[ \\left\\|\\widehat{\\Sigma} - \\Sigma\\right\\| \\le c\\left(\\sqrt{\\frac{\\|\\Sigma\\|\\operatorname{Tr}(\\Sigma)}{N}} + \\|\\Sigma\\|\\sqrt{\\frac{\\log(1/\\delta)}{N}} + \\varepsilon\\|\\Sigma\\|\\right). \\] Both results are optimal up to multiplicative constant factors. Despite the recent significant interest in robust statistics, achieving both dimension-free bounds in the canonical Gaussian case remained open. In fact, several previously known results were either dimension-dependent and required $\\Sigma$ to be close to identity, or had a sub-optimal dependence on the contamination level $\\varepsilon$. As a part of the analysis, we derive sharp concentration inequalities for central order statistics of Gaussian, folded normal, and chi-squared distributions. ",
    "url": "https://arxiv.org/abs/2301.09024",
    "authors": [
      "Arshak Minasyan",
      "Nikita Zhivotovskiy"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09031",
    "title": "Counterfactual (Non-)identifiability of Learned Structural Causal Models",
    "abstract": "Recent advances in probabilistic generative modeling have motivated learning Structural Causal Models (SCM) from observational datasets using deep conditional generative models, also known as Deep Structural Causal Models (DSCM). If successful, DSCMs can be utilized for causal estimation tasks, e.g., for answering counterfactual queries. In this work, we warn practitioners about non-identifiability of counterfactual inference from observational data, even in the absence of unobserved confounding and assuming known causal structure. We prove counterfactual identifiability of monotonic generation mechanisms with single dimensional exogenous variables. For general generation mechanisms with multi-dimensional exogenous variables, we provide an impossibility result for counterfactual identifiability, motivating the need for parametric assumptions. As a practical approach, we propose a method for estimating worst-case errors of learned DSCMs' counterfactual predictions. The size of this error can be an essential metric for deciding whether or not DSCMs are a viable approach for counterfactual inference in a specific problem setting. In evaluation, our method confirms negligible counterfactual errors for an identifiable SCM from prior work, and also provides informative error bounds on counterfactual errors for a non-identifiable synthetic SCM. ",
    "url": "https://arxiv.org/abs/2301.09031",
    "authors": [
      "Arash Nasr-Esfahany",
      "Emre Kiciman"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09058",
    "title": "Leveraging Speaker Embeddings with Adversarial Multi-task Learning for  Age Group Classification",
    "abstract": "Recently, researchers have utilized neural network-based speaker embedding techniques in speaker-recognition tasks to identify speakers accurately. However, speaker-discriminative embeddings do not always represent speech features such as age group well. In an embedding model that has been highly trained to capture speaker traits, the task of age group classification is closer to speech information leakage. Hence, to improve age group classification performance, we consider the use of speaker-discriminative embeddings derived from adversarial multi-task learning to align features and reduce the domain discrepancy in age subgroups. In addition, we investigated different types of speaker embeddings to learn and generalize the domain-invariant representations for age groups. Experimental results on the VoxCeleb Enrichment dataset verify the effectiveness of our proposed adaptive adversarial network in multi-objective scenarios and leveraging speaker embeddings for the domain adaptation task. ",
    "url": "https://arxiv.org/abs/2301.09058",
    "authors": [
      "Kwangje Baeg",
      "Yeong-Gwan Kim",
      "Young-Sub Han",
      "Byoung-Ki Jeon"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09117",
    "title": "Design-based individual prediction",
    "abstract": "A design-based individual prediction approach is developed based on the expected cross-validation results, given the sampling design and the sample-splitting design for cross-validation. Whether the predictor is selected from an ensemble of models or a weighted average of them, valid inference of the unobserved prediction errors is defined and obtained with respect to the sampling design, while outcomes and features are treated as constants. ",
    "url": "https://arxiv.org/abs/2301.09117",
    "authors": [
      "Li-Chun Zhang",
      "Danhyang Lee"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09170",
    "title": "On the size of maximum cut in planar graphs",
    "abstract": "We show that the size of maximum cut in a planar graph with $m$ edges is at least $2m/3$. We also show that maximal planar graphs saturate this bound. ",
    "url": "https://arxiv.org/abs/2301.09170",
    "authors": [
      "Pranay Gorantla",
      "Santhoshini Velusamy"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2301.09223",
    "title": "Doubly Adversarial Federated Bandits",
    "abstract": "We study a new non-stochastic federated multi-armed bandit problem with multiple agents collaborating via a communication network. The losses of the arms are assigned by an oblivious adversary that specifies the loss of each arm not only for each time step but also for each agent, which we call ``doubly adversarial\". In this setting, different agents may choose the same arm in the same time step but observe different feedback. The goal of each agent is to find a globally best arm in hindsight that has the lowest cumulative loss averaged over all agents, which necessities the communication among agents. We provide regret lower bounds for any federated bandit algorithm under different settings, when agents have access to full-information feedback, or the bandit feedback. For the bandit feedback setting, we propose a near-optimal federated bandit algorithm called FEDEXP3. Our algorithm gives a positive answer to an open question proposed in Cesa-Bianchi et al. (2016): FEDEXP3 can guarantee a sub-linear regret without exchanging sequences of selected arm identities or loss sequences among agents. We also provide numerical evaluations of our algorithm to validate our theoretical results and demonstrate its effectiveness on synthetic and real-world datasets ",
    "url": "https://arxiv.org/abs/2301.09223",
    "authors": [
      "Jialin Yi",
      "Milan Vojnović"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2301.09305",
    "title": "Practical Adversarial Attacks Against AI-Driven Power Allocation in a  Distributed MIMO Network",
    "abstract": "In distributed multiple-input multiple-output (D-MIMO) networks, power control is crucial to optimize the spectral efficiencies of users and max-min fairness (MMF) power control is a commonly used strategy as it satisfies uniform quality-of-service to all users. The optimal solution of MMF power control requires high complexity operations and hence deep neural network based artificial intelligence (AI) solutions are proposed to decrease the complexity. Although quite accurate models can be achieved by using AI, these models have some intrinsic vulnerabilities against adversarial attacks where carefully crafted perturbations are applied to the input of the AI model. In this work, we show that threats against the target AI model which might be originated from malicious users or radio units can substantially decrease the network performance by applying a successful adversarial sample, even in the most constrained circumstances. We also demonstrate that the risk associated with these kinds of adversarial attacks is higher than the conventional attack threats. Detailed simulations reveal the effectiveness of adversarial attacks and the necessity of smart defense techniques. ",
    "url": "https://arxiv.org/abs/2301.09305",
    "authors": [
      "Ömer Faruk Tuna",
      "Fehmi Emre Kadan",
      "Leyli Karaçay"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09431",
    "title": "Multi-domain stain normalization for digital pathology: A  cycle-consistent adversarial network for whole slide images",
    "abstract": "The variation in histologic staining between different medical centers is one of the most profound challenges in the field of computer-aided diagnosis. The appearance disparity of pathological whole slide images causes algorithms to become less reliable, which in turn impedes the wide-spread applicability of downstream tasks like cancer diagnosis. Furthermore, different stainings lead to biases in the training which in case of domain shifts negatively affect the test performance. Therefore, in this paper we propose MultiStain-CycleGAN, a multi-domain approach to stain normalization based on CycleGAN. Our modifications to CycleGAN allow us to normalize images of different origins without retraining or using different models. We perform an extensive evaluation of our method using various metrics and compare it to commonly used methods that are multi-domain capable. First, we evaluate how well our method fools a domain classifier that tries to assign a medical center to an image. Then, we test our normalization on the tumor classification performance of a downstream classifier. Furthermore, we evaluate the image quality of the normalized images using the Structural similarity index and the ability to reduce the domain shift using the Fr\\'echet inception distance. We show that our method proves to be multi-domain capable, provides the highest image quality among the compared methods, and can most reliably fool the domain classifier while keeping the tumor classifier performance high. By reducing the domain influence, biases in the data can be removed on the one hand and the origin of the whole slide image can be disguised on the other, thus enhancing patient data privacy. ",
    "url": "https://arxiv.org/abs/2301.09431",
    "authors": [
      "Martin J. Hetz",
      "Tabea-Clara Bucher",
      "Titus J. Brinker"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09452",
    "title": "Fast and robust single particle reconstruction in 3D fluorescence  microscopy",
    "abstract": "Single particle reconstruction has recently emerged in 3D fluorescence microscopy as a powerful technique to improve the axial resolution and the degree of fluorescent labeling. It is based on the reconstruction of an average volume of a biological particle from the acquisition multiple views with unknown poses. Current methods are limited either by template bias, restriction to 2D data, high computational cost or a lack of robustness to low fluorescent labeling. In this work, we propose a single particle reconstruction method dedicated to convolutional models in 3D fluorescence microscopy that overcome these issues. We address the joint reconstruction and estimation of the poses of the particles, which translates into a challenging non-convex optimization problem. Our approach is based on a multilevel reformulation of this problem, and the development of efficient optimization techniques at each level. We demonstrate on synthetic data that our method outperforms the standard approaches in terms of resolution and reconstruction error, while achieving a low computational cost. We also perform successful reconstruction on real datasets of centrioles to show the potential of our method in concrete applications. ",
    "url": "https://arxiv.org/abs/2301.09452",
    "authors": [
      "Thibaut Eloy",
      "Etienne Baudrier",
      "Marine Laporte",
      "Virginie Hamel",
      "Paul Guichard",
      "Denis Fortun"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.09479",
    "title": "Modality-Agnostic Variational Compression of Implicit Neural  Representations",
    "abstract": "We introduce a modality-agnostic neural data compression algorithm based on a functional view of data and parameterised as an Implicit Neural Representation (INR). Bridging the gap between latent coding and sparsity, we obtain compact latent representations which are non-linearly mapped to a soft gating mechanism capable of specialising a shared INR base network to each data item through subnetwork selection. After obtaining a dataset of such compact latent representations, we directly optimise the rate/distortion trade-off in this modality-agnostic space using non-linear transform coding. We term this method Variational Compression of Implicit Neural Representation (VC-INR) and show both improved performance given the same representational capacity pre quantisation while also outperforming previous quantisation schemes used for other INR-based techniques. Our experiments demonstrate strong results over a large set of diverse data modalities using the same algorithm without any modality-specific inductive biases. We show results on images, climate data, 3D shapes and scenes as well as audio and video, introducing VC-INR as the first INR-based method to outperform codecs as well-known and diverse as JPEG 2000, MP3 and AVC/HEVC on their respective modalities. ",
    "url": "https://arxiv.org/abs/2301.09479",
    "authors": [
      "Jonathan Richard Schwarz",
      "Jihoon Tack",
      "Yee Whye Teh",
      "Jaeho Lee",
      "Jinwoo Shin"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.09493",
    "title": "Functionality of box intersection graphs",
    "abstract": "Functionality is a graph complexity measure that extends a variety of parameters, such as vertex degree, degeneracy, clique-width, or twin-width. In the present paper, we show that functionality is bounded for box intersection graphs in $\\mathbb{R}^1$, i.e. for interval graphs, and unbounded for box intersection graphs in $\\mathbb{R}^3$. We also study a parameter known as symmetric difference, which is intermediate between twin-width and functionality, and show that this parameter is unbounded both for interval graphs and for unit box intersection graphs in $\\mathbb{R}^2$. ",
    "url": "https://arxiv.org/abs/2301.09493",
    "authors": [
      "Clément Dallard",
      "Vadim Lozin",
      "Martin Milanič",
      "Kenny Štorgel",
      "Viktor Zamaraev"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2301.09507",
    "title": "Characterizing Polarization in Social Networks using the Signed  Relational Latent Distance Model",
    "abstract": "Graph representation learning has become a prominent tool for the characterization and understanding of the structure of networks in general and social networks in particular. Typically, these representation learning approaches embed the networks into a low-dimensional space in which the role of each individual can be characterized in terms of their latent position. A major current concern in social networks is the emergence of polarization and filter bubbles promoting a mindset of \"us-versus-them\" that may be defined by extreme positions believed to ultimately lead to political violence and the erosion of democracy. Such polarized networks are typically characterized in terms of signed links reflecting likes and dislikes. We propose the latent Signed relational Latent dIstance Model (SLIM) utilizing for the first time the Skellam distribution as a likelihood function for signed networks and extend the modeling to the characterization of distinct extreme positions by constraining the embedding space to polytopes. On four real social signed networks of polarization, we demonstrate that the model extracts low-dimensional characterizations that well predict friendships and animosity while providing interpretable visualizations defined by extreme positions when endowing the model with an embedding space restricted to polytopes. ",
    "url": "https://arxiv.org/abs/2301.09507",
    "authors": [
      "Nikolaos Nakis",
      "Abdulkadir Çelikkanat",
      "Louis Boucherie",
      "Christian Djurhuus",
      "Felix Burmester",
      "Daniel Mathias Holmelund",
      "Monika Frolcová",
      "Morten Mørup"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:1809.02362",
    "title": "A proof that artificial neural networks overcome the curse of  dimensionality in the numerical approximation of Black-Scholes partial  differential equations",
    "abstract": " Comments: 126 pages ",
    "url": "https://arxiv.org/abs/1809.02362",
    "authors": [
      "Philipp Grohs",
      "Fabian Hornung",
      "Arnulf Jentzen",
      "Philippe von Wurstemberger"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)",
      "Mathematical Finance (q-fin.MF)"
    ]
  },
  {
    "id": "arXiv:1910.11950",
    "title": "Probabilistic Surrogate Networks for Simulators with Unbounded  Randomness",
    "abstract": " Title: Probabilistic Surrogate Networks for Simulators with Unbounded  Randomness ",
    "url": "https://arxiv.org/abs/1910.11950",
    "authors": [
      "Andreas Munk",
      "Berend Zwartsenberg",
      "Adam Ścibior",
      "Atılım Güneş Baydin",
      "Andrew Stewart",
      "Goran Fernlund",
      "Anoush Poursartip",
      "Frank Wood"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2005.06284",
    "title": "Pruning coupled with learning, ensembles of minimal neural networks, and  future of XAI",
    "abstract": " Comments: Significantly modified and extended version, 23 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2005.06284",
    "authors": [
      "Alexander N. Gorban",
      "Evgeny M. Mirkes"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2104.06301",
    "title": "A single-qubit position verification protocol that is secure against  multi-qubit attacks",
    "abstract": " Comments: 29 pages, 4 figures. Updated to match the journal version ",
    "url": "https://arxiv.org/abs/2104.06301",
    "authors": [
      "Andreas Bluhm",
      "Matthias Christandl",
      "Florian Speelman"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2106.08853",
    "title": "Strategic Behavior is Bliss: Iterative Voting Improves Social Welfare",
    "abstract": " Comments: 21 pages, 5 figures, in NeurIPS 2021 ",
    "url": "https://arxiv.org/abs/2106.08853",
    "authors": [
      "Joshua Kavner",
      "Lirong Xia"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2109.13376",
    "title": "Counting colorings of triangle-free graphs",
    "abstract": " Comments: 17 pp ",
    "url": "https://arxiv.org/abs/2109.13376",
    "authors": [
      "Anton Bernshteyn",
      "Tyler Brazelton",
      "Ruijia Cao",
      "Akum Kang"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2110.02709",
    "title": "Subquadratic-time algorithm for the diameter and all eccentricities on  median graphs",
    "abstract": " Comments: 43 pages, extended abstract in STACS 2022 ",
    "url": "https://arxiv.org/abs/2110.02709",
    "authors": [
      "Pierre Bergé",
      "Guillaume Ducoffe",
      "Michel Habib"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2110.07421",
    "title": "On some batch code properties of the simplex code",
    "abstract": " Title: On some batch code properties of the simplex code ",
    "url": "https://arxiv.org/abs/2110.07421",
    "authors": [
      "Henk D.L. Hollmann",
      "Karan Khathuria",
      "Ago-Erik Riet",
      "Vitaly Skachek"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2111.04003",
    "title": "Predictive Model for Gross Community Production Rate of Coral Reefs  using Ensemble Learning Methodologies",
    "abstract": " Comments: 8 pages, 18 figures ",
    "url": "https://arxiv.org/abs/2111.04003",
    "authors": [
      "Umanandini S",
      "Rishivardhan M",
      "Aouthithiye Barathwaj SR Y",
      "Jasline Augusta J",
      "Shrirang Sapate",
      "Reenasree S",
      "Vigneash M"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.05978",
    "title": "SUPER-Net: Trustworthy Medical Image Segmentation with Uncertainty  Propagation in Encoder-Decoder Networks",
    "abstract": " Title: SUPER-Net: Trustworthy Medical Image Segmentation with Uncertainty  Propagation in Encoder-Decoder Networks ",
    "url": "https://arxiv.org/abs/2111.05978",
    "authors": [
      "Giuseppina Carannante",
      "Dimah Dera",
      "Nidhal C.Bouaynaya",
      "Hassan M. Fathallah-Shaykh",
      "Ghulam Rasool"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.08118",
    "title": "Brain Functional Connectivity Estimation Utilizing Diffusion Kernels on  a Structural Connectivity Graph",
    "abstract": " Comments: 29 pages, 6 figures, 1 table, 2 algorithms ",
    "url": "https://arxiv.org/abs/2111.08118",
    "authors": [
      "Nathan Tung",
      "Jerome Sanes",
      "Eli Upfal",
      "Ani Eloyan"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Social and Information Networks (cs.SI)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2112.09428",
    "title": "Dynamics-aware Adversarial Attack of 3D Sparse Convolution Network",
    "abstract": " Comments: We have improved the quality of this work and updated a new version to address the limitations of the proposed method ",
    "url": "https://arxiv.org/abs/2112.09428",
    "authors": [
      "An Tao",
      "Yueqi Duan",
      "He Wang",
      "Ziyi Wu",
      "Pengliang Ji",
      "Haowen Sun",
      "Jie Zhou",
      "Jiwen Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.00009",
    "title": "Improving Deep Neural Network Classification Confidence using  Heatmap-based eXplainable AI",
    "abstract": " Title: Improving Deep Neural Network Classification Confidence using  Heatmap-based eXplainable AI ",
    "url": "https://arxiv.org/abs/2201.00009",
    "authors": [
      "Erico Tjoa",
      "Hong Jing Khok",
      "Tushar Chouhan",
      "Guan Cuntai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2201.01415",
    "title": "Problem-dependent attention and effort in neural networks with  application to image resolution and model selection",
    "abstract": " Title: Problem-dependent attention and effort in neural networks with  application to image resolution and model selection ",
    "url": "https://arxiv.org/abs/2201.01415",
    "authors": [
      "Chris Rohlfs"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2201.12489",
    "title": "A Context-Integrated Transformer-Based Neural Network for Auction Design",
    "abstract": " Comments: Accepted by ICML 2022. Code is available at this https URL ",
    "url": "https://arxiv.org/abs/2201.12489",
    "authors": [
      "Zhijian Duan",
      "Jingwu Tang",
      "Yutong Yin",
      "Zhe Feng",
      "Xiang Yan",
      "Manzil Zaheer",
      "Xiaotie Deng"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2201.12825",
    "title": "Autoencoding Hyperbolic Representation for Adversarial Generation",
    "abstract": " Title: Autoencoding Hyperbolic Representation for Adversarial Generation ",
    "url": "https://arxiv.org/abs/2201.12825",
    "authors": [
      "Eric Qu",
      "Dongmian Zou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2201.13172",
    "title": "Near-Optimal Regret for Adversarial MDP with Delayed Bandit Feedback",
    "abstract": " Comments: NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2201.13172",
    "authors": [
      "Tiancheng Jin",
      "Tal Lancewicki",
      "Haipeng Luo",
      "Yishay Mansour",
      "Aviv Rosenberg"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.06198",
    "title": "Data standardization for robust lip sync",
    "abstract": " Title: Data standardization for robust lip sync ",
    "url": "https://arxiv.org/abs/2202.06198",
    "authors": [
      "Chun Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.06924",
    "title": "Do Gradient Inversion Attacks Make Federated Learning Unsafe?",
    "abstract": " Comments: Revised version; Accepted to IEEE Transactions on Medical Imaging; Improved and reformatted version of this https URL ",
    "url": "https://arxiv.org/abs/2202.06924",
    "authors": [
      "Ali Hatamizadeh",
      "Hongxu Yin",
      "Pavlo Molchanov",
      "Andriy Myronenko",
      "Wenqi Li",
      "Prerna Dogra",
      "Andrew Feng",
      "Mona G. Flores",
      "Jan Kautz",
      "Daguang Xu",
      "Holger R. Roth"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2203.00296",
    "title": "Earthquake Control: An Emerging Application for Robust Control. Theory  and Experimental Tests",
    "abstract": " Title: Earthquake Control: An Emerging Application for Robust Control. Theory  and Experimental Tests ",
    "url": "https://arxiv.org/abs/2203.00296",
    "authors": [
      "Diego Gutiérrez-Oribio",
      "Georgios Tzortzopoulos",
      "Ioannis Stefanou",
      "Franck Plestan"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2203.00710",
    "title": "Understanding Effects of Algorithmic vs. Community Label on Perceived  Accuracy of Hyper-partisan Misinformation",
    "abstract": " Title: Understanding Effects of Algorithmic vs. Community Label on Perceived  Accuracy of Hyper-partisan Misinformation ",
    "url": "https://arxiv.org/abs/2203.00710",
    "authors": [
      "Chenyan Jia",
      "Alexander Boltz",
      "Angie Zhang",
      "Anqing Chen",
      "Min Kyung Lee"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2203.01228",
    "title": "Estimating average causal effects from patient trajectories",
    "abstract": " Comments: Accepted at AAAI 2023 ",
    "url": "https://arxiv.org/abs/2203.01228",
    "authors": [
      "Dennis Frauen",
      "Tobias Hatt",
      "Valentyn Melnychuk",
      "Stefan Feuerriegel"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2203.02466",
    "title": "Social Opinion Formation Under Communication Trends",
    "abstract": " Comments: Submitted for publication ",
    "url": "https://arxiv.org/abs/2203.02466",
    "authors": [
      "Mert Kayaalp",
      "Virginia Bordignon",
      "Ali H. Sayed"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Multiagent Systems (cs.MA)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2203.02630",
    "title": "Online Adversarial Stabilization of Unknown Networked Systems",
    "abstract": " Comments: Proc. ACM Meas. Anal. Comput. Syst. 7, 1, Article 26 (March 2023), 43 pages. this https URL 3579452 ",
    "url": "https://arxiv.org/abs/2203.02630",
    "authors": [
      "Jing Yu",
      "Dimitar Ho",
      "Adam Wierman"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.12235",
    "title": "Geometry-Aware Supertagging with Heterogeneous Dynamic Convolutions",
    "abstract": " Comments: 8 pages plus references, unpublished preprint v2: fixed small typos, added appendix with a visualization of the decoding process; v3: improved presentation, improved the decoding figure ",
    "url": "https://arxiv.org/abs/2203.12235",
    "authors": [
      "Konstantinos Kogkalidis",
      "Michael Moortgat"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.13877",
    "title": "Focused Jump-and-Repair Constraint Handling for Fixed-Parameter  Tractable Graph Problems Closed Under Induced Subgraphs",
    "abstract": " Comments: A preliminary version of this paper appeared in the proceedings of FOGA 2021 ",
    "url": "https://arxiv.org/abs/2203.13877",
    "authors": [
      "Luke Branson",
      "Andrew M. Sutton"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2203.17209",
    "title": "Adversarial Examples in Random Neural Networks with General Activations",
    "abstract": " Comments: 36 pages ",
    "url": "https://arxiv.org/abs/2203.17209",
    "authors": [
      "Andrea Montanari",
      "Yuchen Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2204.07261",
    "title": "Convergence and Implicit Regularization Properties of Gradient Descent  for Deep Residual Networks",
    "abstract": " Title: Convergence and Implicit Regularization Properties of Gradient Descent  for Deep Residual Networks ",
    "url": "https://arxiv.org/abs/2204.07261",
    "authors": [
      "Rama Cont",
      "Alain Rossier",
      "RenYuan Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2205.08738",
    "title": "Passive Defense Against 3D Adversarial Point Clouds Through the Lens of  3D Steganalysis",
    "abstract": " Comments: This paper is out-of-date ",
    "url": "https://arxiv.org/abs/2205.08738",
    "authors": [
      "Jiahao Zhu"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2205.13892",
    "title": "EvenNet: Ignoring Odd-Hop Neighbors Improves Robustness of Graph Neural  Networks",
    "abstract": " Comments: 24 pages ",
    "url": "https://arxiv.org/abs/2205.13892",
    "authors": [
      "Runlin Lei",
      "Zhen Wang",
      "Yaliang Li",
      "Bolin Ding",
      "Zhewei Wei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.15769",
    "title": "Concept-level Debugging of Part-Prototype Networks",
    "abstract": " Comments: Accepted for publication at ICLR 2023 ",
    "url": "https://arxiv.org/abs/2205.15769",
    "authors": [
      "Andrea Bontempelli",
      "Stefano Teso",
      "Katya Tentori",
      "Fausto Giunchiglia",
      "Andrea Passerini"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.01003",
    "title": "Shortest Path Networks for Graph Property Prediction",
    "abstract": " Comments: Accepted as a spotlight paper at the first Learning on Graphs (LoG) conference. Code available at: this https URL This version includes further improved QM9 results following a bug fix ",
    "url": "https://arxiv.org/abs/2206.01003",
    "authors": [
      "Ralph Abboud",
      "Radoslav Dimitrov",
      "İsmail İlkan Ceylan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.02660",
    "title": "Pseudo-Hamiltonian Neural Networks with State-Dependent External Forces",
    "abstract": " Comments: 23 pages, 13 figures; v4: slight title change, expanded on methodology for more clarity, updated plots ",
    "url": "https://arxiv.org/abs/2206.02660",
    "authors": [
      "Sølve Eidnes",
      "Alexander J. Stasik",
      "Camilla Sterud",
      "Eivind Bøhn",
      "Signe Riemer-Sørensen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2206.04285",
    "title": "A Unification Framework for Euclidean and Hyperbolic Graph Neural  Networks",
    "abstract": " Title: A Unification Framework for Euclidean and Hyperbolic Graph Neural  Networks ",
    "url": "https://arxiv.org/abs/2206.04285",
    "authors": [
      "Mehrdad Khatir",
      "Nurendra Choudhary",
      "Sutanay Choudhury",
      "Khushbu Agarwal",
      "Chandan K. Reddy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2206.09326",
    "title": "Toward Robust Manufacturing Scheduling: Stochastic Job-Shop Scheduling",
    "abstract": " Title: Toward Robust Manufacturing Scheduling: Stochastic Job-Shop Scheduling ",
    "url": "https://arxiv.org/abs/2206.09326",
    "authors": [
      "Mikhail A. Bragin",
      "Matthew E. Wilhelm",
      "Nanpeng Yu",
      "Matthew D. Stuber"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2206.09372",
    "title": "mvHOTA: A multi-view higher order tracking accuracy metric to measure  spatial and temporal associations in multi-point detection",
    "abstract": " Comments: 16 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2206.09372",
    "authors": [
      "Lalith Sharan",
      "Halvar Kelm",
      "Gabriele Romano",
      "Matthias Karck",
      "Raffaele De Simone",
      "Sandy Engelhardt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.12832",
    "title": "Prediction Errors for Penalized Regressions based on Generalized  Approximate Message Passing",
    "abstract": " Comments: 73 pages, 13 figures, accepted Journal of Physics A ",
    "url": "https://arxiv.org/abs/2206.12832",
    "authors": [
      "Ayaka Sakata"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.04993",
    "title": "Embedding Recycling for Language Models",
    "abstract": " Comments: EACL Findings 2023 ",
    "url": "https://arxiv.org/abs/2207.04993",
    "authors": [
      "Jon Saad-Falcon",
      "Amanpreet Singh",
      "Luca Soldaini",
      "Mike D'Arcy",
      "Arman Cohan",
      "Doug Downey"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2207.05983",
    "title": "Data-Driven Identification of Dynamic Quality Models in Drinking Water  Networks",
    "abstract": " Title: Data-Driven Identification of Dynamic Quality Models in Drinking Water  Networks ",
    "url": "https://arxiv.org/abs/2207.05983",
    "authors": [
      "Shen Wang",
      "Ankush Chakrabarty",
      "Ahmad F. Taha"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2207.13307",
    "title": "Marker and source-marker reprogramming of Most Permissive Boolean  networks and ensembles with BoNesis",
    "abstract": " Comments: Notebook available at this https URL ",
    "url": "https://arxiv.org/abs/2207.13307",
    "authors": [
      "Loïc Paulevé"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Artificial Intelligence (cs.AI)",
      "Molecular Networks (q-bio.MN)"
    ]
  },
  {
    "id": "arXiv:2207.13798",
    "title": "Look at Adjacent Frames: Video Anomaly Detection without Offline  Training",
    "abstract": " Comments: Accepted in ECCV 2022 RWS ",
    "url": "https://arxiv.org/abs/2207.13798",
    "authors": [
      "Yuqi Ouyang",
      "Guodong Shen",
      "Victor Sanchez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.14138",
    "title": "Generating Diverse Teammates to Train Robust Agents For Ad Hoc Teamwork",
    "abstract": " Title: Generating Diverse Teammates to Train Robust Agents For Ad Hoc Teamwork ",
    "url": "https://arxiv.org/abs/2207.14138",
    "authors": [
      "Arrasy Rahman",
      "Elliot Fosong",
      "Ignacio Carlucho",
      "Stefano V. Albrecht"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.02810",
    "title": "Analyzing Data-Centric Properties for Graph Contrastive Learning",
    "abstract": " Comments: Accepted to NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2208.02810",
    "authors": [
      "Puja Trivedi",
      "Ekdeep Singh Lubana",
      "Mark Heimann",
      "Danai Koutra",
      "Jayaraman J. Thiagarajan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04018",
    "title": "Hybrid-ARQ Based Relaying Strategies for Enhancing Reliability in  Delay-Bounded Networks",
    "abstract": " Comments: 33 pages. arXiv admin note: text overlap with arXiv:2203.08381 ",
    "url": "https://arxiv.org/abs/2208.04018",
    "authors": [
      "Jaya Goel",
      "J. Harshan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2208.11050",
    "title": "Self-Trained Proposal Networks for the Open World",
    "abstract": " Comments: 19 pages, 9 figures, 10 tables ",
    "url": "https://arxiv.org/abs/2208.11050",
    "authors": [
      "Matthew Inkawhich",
      "Nathan Inkawhich",
      "Hai Li",
      "Yiran Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.07903",
    "title": "Text Detection Forgot About Document OCR",
    "abstract": " Comments: Accepted to the 26th Computer Vision Winter Workshop (CVWW), 2023 ",
    "url": "https://arxiv.org/abs/2210.07903",
    "authors": [
      "Krzysztof Olejniczak",
      "Milan Šulc"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.07791",
    "title": "A Robust Dynamic Average Consensus Algorithm that Ensures both  Differential Privacy and Accurate Convergence",
    "abstract": " Comments: IEEE CDC. arXiv admin note: substantial text overlap with arXiv:2210.16395; text overlap with arXiv:2209.01486 ",
    "url": "https://arxiv.org/abs/2211.07791",
    "authors": [
      "Yongqiang Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Multiagent Systems (cs.MA)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2211.10688",
    "title": "ReInform: Selecting paths with reinforcement learning for contextualized  link prediction",
    "abstract": " Title: ReInform: Selecting paths with reinforcement learning for contextualized  link prediction ",
    "url": "https://arxiv.org/abs/2211.10688",
    "authors": [
      "Marina Speranskaya",
      "Sameh Methias",
      "Benjamin Roth"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.13756",
    "title": "Contrastive pretraining for semantic segmentation is robust to noisy  positive pairs",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible. Compared to the previous version, large-scale changes were made to make the paper easier to understand for people less familiar with contrastive learning and to make it easier to follow certain arguments. 10 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2211.13756",
    "authors": [
      "Sebastian Gerard",
      "Josephine Sullivan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.08726",
    "title": "Learning Non-robustness using Simulation-based Testing: a Network  Traffic-shaping Case Study",
    "abstract": " Comments: This paper is accepted at the 16th IEEE International Conference on Software Testing, Verification and Validation (ICST 2023) ",
    "url": "https://arxiv.org/abs/2212.08726",
    "authors": [
      "Baharin Aliashrafi Jodat",
      "Shiva Nejati",
      "Mehrdad Sabetzadeh",
      "Patricio Saavedra"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2212.11696",
    "title": "Reversible Column Networks",
    "abstract": " Comments: Accepted by ICLR 2023 ",
    "url": "https://arxiv.org/abs/2212.11696",
    "authors": [
      "Yuxuan Cai",
      "Yizhuang Zhou",
      "Qi Han",
      "Jianjian Sun",
      "Xiangwen Kong",
      "Jun Li",
      "Xiangyu Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.01905",
    "title": "FireFly: A High-Throughput and Reconfigurable Hardware Accelerator for  Spiking Neural Networks",
    "abstract": " Title: FireFly: A High-Throughput and Reconfigurable Hardware Accelerator for  Spiking Neural Networks ",
    "url": "https://arxiv.org/abs/2301.01905",
    "authors": [
      "Jindong Li",
      "Guobin Shen",
      "Dongcheng Zhao",
      "Qian Zhang",
      "Zeng Yi"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2301.03424",
    "title": "An open unified deep graph learning framework for discovering drug leads",
    "abstract": " Comments: This article is used as the preliminary studies for the application of Lee Kuan Yew Postdoctoral Fellowship (LKYPDF) 2023 in Singapore. All rights reserved ",
    "url": "https://arxiv.org/abs/2301.03424",
    "authors": [
      "Yueming Yin",
      "Haifeng Hu",
      "Zhen Yang",
      "Jitao Yang",
      "Chun Ye",
      "Jiansheng Wu",
      "Wilson Wen Bin Goh"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.04746",
    "title": "Switchable Lightweight Anti-symmetric Processing (SLAP) with CNN  Outspeeds Data Augmentation by Smaller Sample -- Application in Gomoku  Reinforcement Learning",
    "abstract": " Comments: Change title; 6 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2301.04746",
    "authors": [
      "Chi-Hang Suen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.05489",
    "title": "Neural Image Compression with a Diffusion-Based Decoder",
    "abstract": " Comments: v1: 26 pages, 13 figures v2: corrected typo in first author name in arxiv metadata ",
    "url": "https://arxiv.org/abs/2301.05489",
    "authors": [
      "Noor Fathima Ghouse",
      "Jens Petersen",
      "Auke Wiggers",
      "Tianlin Xu",
      "Guillaume Sautière"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2301.07568",
    "title": "Beating the Best: Improving on AlphaFold2 at Protein Structure  Prediction",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2301.07568",
    "authors": [
      "Abbi Abdel-Rehim",
      "Oghenejokpeme Orhobor",
      "Hang Lou",
      "Hao Ni",
      "Ross D. King"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  }
]