[
  {
    "id": "arXiv:2109.09948",
    "title": "Neural networks with trainable matrix activation functions",
    "abstract": "The training process of neural networks usually optimize weights and bias parameters of linear transformations, while nonlinear activation functions are pre-specified and fixed. This work develops a systematic approach to constructing matrix activation functions whose entries are generalized from ReLU. The activation is based on matrix-vector multiplications using only scalar multiplications and comparisons. The proposed activation functions depend on parameters that are trained along with the weights and bias vectors. Neural networks based on this approach are simple and efficient and are shown to be robust in numerical experiments. ",
    "url": "https://arxiv.org/abs/2109.09948",
    "authors": [
      "Zhengqi Liu",
      "Yuwen Li",
      "Ludmil Zikatanov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.10021",
    "title": "Stabilizing Elastic Weight Consolidation method in practical ML tasks  and using weight importances for neural network pruning",
    "abstract": "This paper is devoted to the features of the practical application of Elastic Weight Consolidation method. Here we will more rigorously compare the known methodologies for calculating the importance of weights when applied to networks with fully connected and convolutional layers. We will also point out the problems that arise when applying the Elastic Weight Consolidation method in multilayer neural networks with convolutional layers and self-attention layers, and propose method to overcome these problems. In addition, we will notice an interesting fact about the use of various types of weight importance in the neural network pruning task. ",
    "url": "https://arxiv.org/abs/2109.10021",
    "authors": [
      "Alexey Kutalev",
      "Alisa Lapina"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.10072",
    "title": "Scenario generation for market risk models using generative neural  networks",
    "abstract": "In this research, we show how to expand existing approaches of generative adversarial networks (GANs) being used as economic scenario generators (ESG) to a whole internal model - with enough risk factors to model the full band-width of investments for an insurance company and for a one year horizon as required in Solvency 2. For validation of this approach as well as for optimisation of the GAN architecture, we develop new performance measures and provide a consistent, data-driven framework. Finally, we demonstrate that the results of a GAN-based ESG are similar to regulatory approved internal models in Europe. Therefore, GAN-based models can be seen as an assumption-free data-driven alternative way of market risk modelling. ",
    "url": "https://arxiv.org/abs/2109.10072",
    "authors": [
      "Solveig Flaig",
      "Gero Junike"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Mathematical Finance (q-fin.MF)",
      "Risk Management (q-fin.RM)"
    ]
  },
  {
    "id": "arXiv:2109.10253",
    "title": "Short-term traffic prediction using physics-aware neural networks",
    "abstract": "In this work, we propose an algorithm performing short-term predictions of the flux of vehicles on a stretch of road, using past measurements of the flux. This algorithm is based on a physics-aware recurrent neural network. A discretization of a macroscopic traffic flow model (using the so-called Traffic Reaction Model) is embedded in the architecture of the network and yields flux predictions based on estimated and predicted space-time dependent traffic parameters. These parameters are themselves obtained using a succession of LSTM ans simple recurrent neural networks. Besides, on top of the predictions, the algorithm yields a smoothing of its inputs which is also physically-constrained by the macroscopic traffic flow model. The algorithm is tested on raw flux measurements obtained from loop detectors. ",
    "url": "https://arxiv.org/abs/2109.10253",
    "authors": [
      "Mike Pereira",
      "Annika Lang",
      "Balázs Kulcsár"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2109.10319",
    "title": "Consistency of spectral clustering for directed network community  detection",
    "abstract": "Directed networks appear in various areas, such as biology, sociology, physiology and computer science. However, at present, most network analysis ignores the direction. In this paper, we construct a spectral clustering method based on the singular decomposition of the adjacency matrix to detect community in directed stochastic block model (DiSBM). By considering a sparsity parameter, under some mild conditions, we show the proposed approach can consistently recover hidden row and column communities for different scaling of degrees. By considering the degree heterogeneity of both row and column nodes, we further establish a theoretical framework for directed degree corrected stochastic block model (DiDCSBM). We show that the spectral clustering method stably yields consistent community detection for row clusters and column clusters under mild constraints on the degree heterogeneity. Our theoretical results under DiSBM and DiDCSBM provide some innovations on some special directed networks, such as directed network with balanced clusters, directed network with nodes enjoying similar degrees, and the directed Erd\\\"os-R\\'enyi graph. Furthermore, our theoretical results under DiDCSBM are consistent with those under DiSBM when DiDCSBM degenerates to DiSBM. ",
    "url": "https://arxiv.org/abs/2109.10319",
    "authors": [
      "Huan Qing",
      "Jingli Wang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1906.10207",
    "title": "State estimation under attack in partially-observed discrete event  systems",
    "abstract": " Title: State estimation under attack in partially-observed discrete event  systems ",
    "url": "https://arxiv.org/abs/1906.10207",
    "authors": [
      "Qi Zhang",
      "Carla Seatzu",
      "Zhiwu Li",
      "Alessandro Giua"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2108.00107",
    "title": "Comparing object recognition in humans and deep convolutional neural  networks -- An eye tracking study",
    "abstract": " Comments: 25 pages, 10 figures, 1 table ",
    "url": "https://arxiv.org/abs/2108.00107",
    "authors": [
      "Leonard E. van Dyck",
      "Roland Kwitt",
      "Sebastian J. Denzler",
      "Walter R. Gruber"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.09077",
    "title": "DECORAS: detection and characterization of radio-astronomical sources  using deep learning",
    "abstract": " Comments: submitted to MNRAS ",
    "url": "https://arxiv.org/abs/2109.09077",
    "authors": [
      "S.Rezaei",
      "J.P.McKean",
      "M.Biehl",
      "A.Javadpour"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Astrophysics of Galaxies (astro-ph.GA)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.09244",
    "title": "A domain-specific modeling and analysis environment for complex IoT  applications",
    "abstract": " Title: A domain-specific modeling and analysis environment for complex IoT  applications ",
    "url": "https://arxiv.org/abs/2109.09244",
    "authors": [
      "Felicien Ihirwe",
      "Davide Di Ruscio",
      "Silvia Mazzini",
      "Alfonso Pierantonio"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Programming Languages (cs.PL)"
    ]
  }
]