[
  {
    "id": "arXiv:2212.13258",
    "title": "Intelligent Feature Extraction, Data Fusion and Detection of Concrete  Bridge Cracks: Current Development and Challenges",
    "abstract": "As a common appearance defect of concrete bridges, cracks are important indices for bridge structure health assessment. Although there has been much research on crack identification, research on the evolution mechanism of bridge cracks is still far from practical applications. In this paper, the state-of-the-art research on intelligent theories and methodologies for intelligent feature extraction, data fusion and crack detection based on data-driven approaches is comprehensively reviewed. The research is discussed from three aspects: the feature extraction level of the multimodal parameters of bridge cracks, the description level and the diagnosis level of the bridge crack damage states. We focus on previous research concerning the quantitative characterization problems of multimodal parameters of bridge cracks and their implementation in crack identification, while highlighting some of their major drawbacks. In addition, the current challenges and potential future research directions are discussed. ",
    "url": "https://arxiv.org/abs/2212.13258",
    "authors": [
      "Di Wang",
      "Simon X. Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2212.13350",
    "title": "A Generalization of ViT/MLP-Mixer to Graphs",
    "abstract": "Graph Neural Networks (GNNs) have shown great potential in the field of graph representation learning. Standard GNNs define a local message-passing mechanism which propagates information over the whole graph domain by stacking multiple layers. This paradigm suffers from two major limitations, over-squashing and poor long-range dependencies, that can be solved using global attention but significantly increases the computational cost to quadratic complexity. In this work, we propose an alternative approach to overcome these structural limitations by leveraging the ViT/MLP-Mixer architectures introduced in computer vision. We introduce a new class of GNNs, called Graph MLP-Mixer, that holds three key properties. First, they capture long-range dependency and mitigate the issue of over-squashing as demonstrated on the Long Range Graph Benchmark (LRGB) and the TreeNeighbourMatch datasets. Second, they offer better speed and memory efficiency with a complexity linear to the number of nodes and edges, surpassing the related Graph Transformer and expressive GNN models. Third, they show high expressivity in terms of graph isomorphism as they can distinguish at least 3-WL non-isomorphic graphs. We test our architecture on 4 simulated datasets and 7 real-world benchmarks, and show highly competitive results on all of them. ",
    "url": "https://arxiv.org/abs/2212.13350",
    "authors": [
      "Xiaoxin He",
      "Bryan Hooi",
      "Thomas Laurent",
      "Adam Perold",
      "Yann LeCun",
      "Xavier Bresson"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13359",
    "title": "Uncertainty-Aware Performance Prediction for Highly Configurable  Software Systems via Bayesian Neural Networks",
    "abstract": "Configurable software systems are employed in many important application domains. Understanding the performance of the systems under all configurations is critical to prevent potential performance issues caused by misconfiguration. However, as the number of configurations can be prohibitively large, it is not possible to measure the system performance under all configurations. Thus, a common approach is to build a prediction model from a limited measurement data to predict the performance of all configurations as scalar values. However, it has been pointed out that there are different sources of uncertainty coming from the data collection or the modeling process, which can make the scalar predictions not certainly accurate. To address this problem, we propose a Bayesian deep learning based method, namely BDLPerf, that can incorporate uncertainty into the prediction model. BDLPerf can provide both scalar predictions for configurations' performance and the corresponding confidence intervals of these scalar predictions. We also develop a novel uncertainty calibration technique to ensure the reliability of the confidence intervals generated by a Bayesian prediction model. Finally, we suggest an efficient hyperparameter tuning technique so as to train the prediction model within a reasonable amount of time whilst achieving high accuracy. Our experimental results on 10 real-world systems show that BDLPerf achieves higher accuracy than existing approaches, in both scalar performance prediction and confidence interval estimation. ",
    "url": "https://arxiv.org/abs/2212.13359",
    "authors": [
      "Huong Ha",
      "Zongwen Fan",
      "Hongyu Zhang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13367",
    "title": "HCB: Enabling Compact Block in Ethereum Network with Secondary Pool and  Transaction Prediction",
    "abstract": "Compact block, which replaces transactions in the block with their hashes, is an effective means to speed up block propagation in the Bitcoin network. The compact block mechanism in Bitcoin counts on the fact that many nodes may already have the transactions (or most of the transactions) in the block, therefore sending the complete block containing the full transactions is unnecessary. This fact, however, does not hold in the Ethereum network. Adopting compact block directly in Ethereum may degrade the block propagation speed significantly because the probability of a node not having a transaction in the sending block is relatively high in Ethereum and requesting the missing transactions after receiving the compact block takes much additional time. This paper proposes hybrid-compact block (HCB), an efficient compact block propagation scheme for Ethereum and other similar blockchains. First, we develop a Secondary Pool to store the low-fee transactions, which are removed from the primary transaction pool, to conserve storage space. As simple auxiliary storage, the Secondary Pool does not affect the normal block processing of the primary pool in Ethereum. Second, we design a machine learning-based transaction prediction module to precisely predict the missing transactions caused by network latency and selfish behaviors. We implemented our HCB scheme and other compact-block-like schemes (as benchmarks) and deployed a number of worldwide nodes over the Ethereum MainNet to experimentally investigate them. Experimental results show that HCB performs best among the existing compact-block-like schemes and can reduce propagation time by more than half with respect to the current block propagation scheme in Ethereum. ",
    "url": "https://arxiv.org/abs/2212.13367",
    "authors": [
      "Chonghe Zhao",
      "Taotao Wang",
      "Shengli Zhang",
      "Soung Chang Liew"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2212.13390",
    "title": "Hierarchical Deep Reinforcement Learning for Age-of-Information  Minimization in IRS-aided and Wireless-powered Wireless Networks",
    "abstract": "In this paper, we focus on a wireless-powered sensor network coordinated by a multi-antenna access point (AP). Each node can generate sensing information and report the latest information to the AP using the energy harvested from the AP's signal beamforming. We aim to minimize the average age-of-information (AoI) by adapting the nodes' transmission scheduling and the transmission control strategies jointly. To reduce the transmission delay, an intelligent reflecting surface (IRS) is used to enhance the channel conditions by controlling the AP's beamforming vector and the IRS's phase shifting matrix. Considering dynamic data arrivals at different sensing nodes, we propose a hierarchical deep reinforcement learning (DRL) framework to for AoI minimization in two steps. The users' transmission scheduling is firstly determined by the outer-loop DRL approach, e.g. the DQN or PPO algorithm, and then the inner-loop optimization is used to adapt either the uplink information transmission or downlink energy transfer to all nodes. A simple and efficient approximation is also proposed to reduce the inner-loop rum time overhead. Numerical results verify that the hierarchical learning framework outperforms typical baselines in terms of the average AoI and proportional fairness among different nodes. ",
    "url": "https://arxiv.org/abs/2212.13390",
    "authors": [
      "Shimin Gong",
      "Leiyang Cui",
      "Bo Gu",
      "Bin Lyu",
      "Dinh Thai Hoang",
      "Dusit Niyato"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2212.13396",
    "title": "Bayesian Optimization Enhanced Deep Reinforcement Learning for  Trajectory Planning and Network Formation in Multi-UAV Networks",
    "abstract": "In this paper, we employ multiple UAVs coordinated by a base station (BS) to help the ground users (GUs) to offload their sensing data. Different UAVs can adapt their trajectories and network formation to expedite data transmissions via multi-hop relaying. The trajectory planning aims to collect all GUs' data, while the UAVs' network formation optimizes the multi-hop UAV network topology to minimize the energy consumption and transmission delay. The joint network formation and trajectory optimization is solved by a two-step iterative approach. Firstly, we devise the adaptive network formation scheme by using a heuristic algorithm to balance the UAVs' energy consumption and data queue size. Then, with the fixed network formation, the UAVs' trajectories are further optimized by using multi-agent deep reinforcement learning without knowing the GUs' traffic demands and spatial distribution. To improve the learning efficiency, we further employ Bayesian optimization to estimate the UAVs' flying decisions based on historical trajectory points. This helps avoid inefficient action explorations and improves the convergence rate in the model training. The simulation results reveal close spatial-temporal couplings between the UAVs' trajectory planning and network formation. Compared with several baselines, our solution can better exploit the UAVs' cooperation in data offloading, thus improving energy efficiency and delay performance. ",
    "url": "https://arxiv.org/abs/2212.13396",
    "authors": [
      "Shimin Gong",
      "Meng Wang",
      "Bo Gu",
      "Wenjie Zhang",
      "Dinh Thai Hoang",
      "Dusit Niyato"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2212.13425",
    "title": "GEDI: GEnerative and DIscriminative Training for Self-Supervised  Learning",
    "abstract": "Self-supervised learning is a popular and powerful method for utilizing large amounts of unlabeled data, for which a wide variety of training objectives have been proposed in the literature. In this study, we perform a Bayesian analysis of state-of-the-art self-supervised learning objectives and propose a unified formulation based on likelihood learning. Our analysis suggests a simple method for integrating self-supervised learning with generative models, allowing for the joint training of these two seemingly distinct approaches. We refer to this combined framework as GEDI, which stands for GEnerative and DIscriminative training. Additionally, we demonstrate an instantiation of the GEDI framework by integrating an energy-based model with a cluster-based self-supervised learning model. Through experiments on synthetic and real-world data, including SVHN, CIFAR10, and CIFAR100, we show that GEDI outperforms existing self-supervised learning strategies in terms of clustering performance by a wide margin. We also demonstrate that GEDI can be integrated into a neural-symbolic framework to address tasks in the small data regime, where it can use logical constraints to further improve clustering and classification performance. ",
    "url": "https://arxiv.org/abs/2212.13425",
    "authors": [
      "Emanuele Sansone",
      "Robin Manhaeve"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13439",
    "title": "Robust Cross-vendor Mammographic Texture Models Using Augmentation-based  Domain Adaptation for Long-term Breast Cancer Risk",
    "abstract": "The future of population-based breast cancer screening is likely personalized strategies based on clinically relevant risk models. Mammography-based risk models should remain robust to domain shifts caused by different populations and mammographic devices. Modern risk models do not ensure adaptation across vendor-domains and are often conflated to unintentionally rely on both precursors of cancer and systemic/global mammographic information associated with short- and long-term risk, respectively, which might limit performance. We developed a robust, cross-vendor model for long-term risk assessment. An augmentation-based domain adaption technique, based on flavorization of mammographic views, ensured generalization to an unseen vendor-domain. We trained on samples without diagnosed/potential malignant findings to learn systemic/global breast tissue features, called mammographic texture, indicative of future breast cancer. However, training so may cause erratic convergence. By excluding noise-inducing samples and designing a case-control dataset, a robust ensemble texture model was trained. This model was validated in two independent datasets. In 66,607 Danish women with flavorized Siemens views, the AUC was 0.71 and 0.65 for prediction of interval cancers within two years (ICs) and from two years after screening (LTCs), respectively. In a combination with established risk factors, the model's AUC increased to 0.68 for LTCs. In 25,706 Dutch women with Hologic-processed views, the AUCs were not different from the AUCs in Danish women with flavorized views. The results suggested that the model robustly estimated long-term risk while adapting to an unseen processed vendor-domain. The model identified 8.1% of Danish women accounting for 20.9% of ICs and 14.2% of LTCs. ",
    "url": "https://arxiv.org/abs/2212.13439",
    "authors": [
      "Andreas D. Lauritzen",
      "My Catarina von Euler-Chelpin",
      "Elsebeth Lynge",
      "Ilse Vejborg",
      "Mads Nielsen",
      "Nico Karssemeijer",
      "Martin Lillholm"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2212.13466",
    "title": "General GAN-generated image detection by data augmentation in  fingerprint domain",
    "abstract": "In this work, we investigate improving the generalizability of GAN-generated image detectors by performing data augmentation in the fingerprint domain. Specifically, we first separate the fingerprints and contents of the GAN-generated images using an autoencoder based GAN fingerprint extractor, followed by random perturbations of the fingerprints. Then the original fingerprints are substituted with the perturbed fingerprints and added to the original contents, to produce images that are visually invariant but with distinct fingerprints. The perturbed images can successfully imitate images generated by different GANs to improve the generalization of the detectors, which is demonstrated by the spectra visualization. To our knowledge, we are the first to conduct data augmentation in the fingerprint domain. Our work explores a novel prospect that is distinct from previous works on spatial and frequency domain augmentation. Extensive cross-GAN experiments demonstrate the effectiveness of our method compared to the state-of-the-art methods in detecting fake images generated by unknown GANs. ",
    "url": "https://arxiv.org/abs/2212.13466",
    "authors": [
      "Huaming Wang",
      "Jianwei Fei",
      "Yunshu Dai",
      "Lingyun Leng",
      "Zhihua Xia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13513",
    "title": "Anomaly detection in laser-guided vehicles' batteries: a case study",
    "abstract": "Detecting anomalous data within time series is a very relevant task in pattern recognition and machine learning, with many possible applications that range from disease prevention in medicine, e.g., detecting early alterations of the health status before it can clearly be defined as \"illness\" up to monitoring industrial plants. Regarding this latter application, detecting anomalies in an industrial plant's status firstly prevents serious damages that would require a long interruption of the production process. Secondly, it permits optimal scheduling of maintenance interventions by limiting them to urgent situations. At the same time, they typically follow a fixed prudential schedule according to which components are substituted well before the end of their expected lifetime. This paper describes a case study regarding the monitoring of the status of Laser-guided Vehicles (LGVs) batteries, on which we worked as our contribution to project SUPER (Supercomputing Unified Platform, Emilia Romagna) aimed at establishing and demonstrating a regional High-Performance Computing platform that is going to represent the main Italian supercomputing environment for both computing power and data volume. ",
    "url": "https://arxiv.org/abs/2212.13513",
    "authors": [
      "Gianfranco Lombardo",
      "Stefano Cagnoni",
      "Stefano Cavalli",
      "Juan José Contreras Gonzáles",
      "Francesco Monica",
      "Monica Mordonini",
      "Michele Tomaiuolo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13520",
    "title": "Challenges in anomaly and change point detection",
    "abstract": "This paper presents an introduction to the state-of-the-art in anomaly and change-point detection. On the one hand, the main concepts needed to understand the vast scientific literature on those subjects are introduced. On the other, a selection of important surveys and books, as well as two selected active research topics in the field, are presented. ",
    "url": "https://arxiv.org/abs/2212.13520",
    "authors": [
      "Madalina Olteanu",
      "Fabrice Rossi",
      "Florian Yger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2212.13531",
    "title": "Physics informed neural networks for elliptic equations with oscillatory  differential operators",
    "abstract": "We consider standard physics informed neural network solution methods for elliptic partial differential equations with oscillatory coefficients. We show that if the coefficient in the elliptic operator contains frequencies on the order of $1/\\epsilon$, then the Frobenius norm of the neural tangent kernel matrix associated to the loss function grows as $1/\\epsilon^2$. Numerical examples illustrate the stiffness of the optimization problem. ",
    "url": "https://arxiv.org/abs/2212.13531",
    "authors": [
      "Sean P. Carney",
      "Arnav Gangal",
      "Luis Kim"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2212.13554",
    "title": "NeRN -- Learning Neural Representations for Neural Networks",
    "abstract": "Neural Representations have recently been shown to effectively reconstruct a wide range of signals from 3D meshes and shapes to images and videos. We show that, when adapted correctly, neural representations can be used to directly represent the weights of a pre-trained convolutional neural network, resulting in a Neural Representation for Neural Networks (NeRN). Inspired by coordinate inputs of previous neural representation methods, we assign a coordinate to each convolutional kernel in our network based on its position in the architecture, and optimize a predictor network to map coordinates to their corresponding weights. Similarly to the spatial smoothness of visual scenes, we show that incorporating a smoothness constraint over the original network's weights aids NeRN towards a better reconstruction. In addition, since slight perturbations in pre-trained model weights can result in a considerable accuracy loss, we employ techniques from the field of knowledge distillation to stabilize the learning process. We demonstrate the effectiveness of NeRN in reconstructing widely used architectures on CIFAR-10, CIFAR-100, and ImageNet. Finally, we present two applications using NeRN, demonstrating the capabilities of the learned representations. ",
    "url": "https://arxiv.org/abs/2212.13554",
    "authors": [
      "Maor Ashkenazi",
      "Zohar Rimon",
      "Ron Vainshtein",
      "Shir Levi",
      "Elad Richardson",
      "Pinchas Mintz",
      "Eran Treister"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13558",
    "title": "AER: Auto-Encoder with Regression for Time Series Anomaly Detection",
    "abstract": "Anomaly detection on time series data is increasingly common across various industrial domains that monitor metrics in order to prevent potential accidents and economic losses. However, a scarcity of labeled data and ambiguous definitions of anomalies can complicate these efforts. Recent unsupervised machine learning methods have made remarkable progress in tackling this problem using either single-timestamp predictions or time series reconstructions. While traditionally considered separately, these methods are not mutually exclusive and can offer complementary perspectives on anomaly detection. This paper first highlights the successes and limitations of prediction-based and reconstruction-based methods with visualized time series signals and anomaly scores. We then propose AER (Auto-encoder with Regression), a joint model that combines a vanilla auto-encoder and an LSTM regressor to incorporate the successes and address the limitations of each method. Our model can produce bi-directional predictions while simultaneously reconstructing the original time series by optimizing a joint objective function. Furthermore, we propose several ways of combining the prediction and reconstruction errors through a series of ablation studies. Finally, we compare the performance of the AER architecture against two prediction-based methods and three reconstruction-based methods on 12 well-known univariate time series datasets from NASA, Yahoo, Numenta, and UCR. The results show that AER has the highest averaged F1 score across all datasets (a 23.5% improvement compared to ARIMA) while retaining a runtime similar to its vanilla auto-encoder and regressor components. Our model is available in Orion, an open-source benchmarking tool for time series anomaly detection. ",
    "url": "https://arxiv.org/abs/2212.13558",
    "authors": [
      "Lawrence Wong",
      "Dongyu Liu",
      "Laure Berti-Equille",
      "Sarah Alnegheimish",
      "Kalyan Veeramachaneni"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.13589",
    "title": "Co-supervised learning paradigm with conditional generative adversarial  networks for sample-efficient classification",
    "abstract": "Classification using supervised learning requires annotating a large amount of classes-balanced data for model training and testing. This has practically limited the scope of applications with supervised learning, in particular deep learning. To address the issues associated with limited and imbalanced data, this paper introduces a sample-efficient co-supervised learning paradigm (SEC-CGAN), in which a conditional generative adversarial network (CGAN) is trained alongside the classifier and supplements semantics-conditioned, confidence-aware synthesized examples to the annotated data during the training process. In this setting, the CGAN not only serves as a co-supervisor but also provides complementary quality examples to aid the classifier training in an end-to-end fashion. Experiments demonstrate that the proposed SEC-CGAN outperforms the external classifier GAN (EC-GAN) and a baseline ResNet-18 classifier. For the comparison, all classifiers in above methods adopt the ResNet-18 architecture as the backbone. Particularly, for the Street View House Numbers dataset, using the 5% of training data, a test accuracy of 90.26% is achieved by SEC-CGAN as opposed to 88.59% by EC-GAN and 87.17% by the baseline classifier; for the highway image dataset, using the 10% of training data, a test accuracy of 98.27% is achieved by SEC-CGAN, compared to 97.84% by EC-GAN and 95.52% by the baseline classifier. ",
    "url": "https://arxiv.org/abs/2212.13589",
    "authors": [
      "Hao Zhen",
      "Yucheng Shi",
      "Jidong J. Yang",
      "Javad Mohammadpour Vehni"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13596",
    "title": "Semi-supervised multiscale dual-encoding method for faulty traffic data  detection",
    "abstract": "Inspired by the recent success of deep learning in multiscale information encoding, we introduce a variational autoencoder (VAE) based semi-supervised method for detection of faulty traffic data, which is cast as a classification problem. Continuous wavelet transform (CWT) is applied to the time series of traffic volume data to obtain rich features embodied in time-frequency representation, followed by a twin of VAE models to separately encode normal data and faulty data. The resulting multiscale dual encodings are concatenated and fed to an attention-based classifier, consisting of a self-attention module and a multilayer perceptron. For comparison, the proposed architecture is evaluated against five different encoding schemes, including (1) VAE with only normal data encoding, (2) VAE with only faulty data encoding, (3) VAE with both normal and faulty data encodings, but without attention module in the classifier, (4) siamese encoding, and (5) cross-vision transformer (CViT) encoding. The first four encoding schemes adopted the same convolutional neural network (CNN) architecture while the fifth encoding scheme follows the transformer architecture of CViT. Our experiments show that the proposed architecture with the dual encoding scheme, coupled with attention module, outperforms other encoding schemes and results in classification accuracy of 96.4%, precision of 95.5%, and recall of 97.7%. ",
    "url": "https://arxiv.org/abs/2212.13596",
    "authors": [
      "Yongcan Huang",
      "Jidong J. Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13598",
    "title": "Sensing-Throughput Tradeoffs with Generative Adversarial Networks for  NextG Spectrum Sharing",
    "abstract": "Spectrum coexistence is essential for next generation (NextG) systems to share the spectrum with incumbent (primary) users and meet the growing demand for bandwidth. One example is the 3.5 GHz Citizens Broadband Radio Service (CBRS) band, where the 5G and beyond communication systems need to sense the spectrum and then access the channel in an opportunistic manner when the incumbent user (e.g., radar) is not transmitting. To that end, a high-fidelity classifier based on a deep neural network is needed for low misdetection (to protect incumbent users) and low false alarm (to achieve high throughput for NextG). In a dynamic wireless environment, the classifier can only be used for a limited period of time, i.e., coherence time. A portion of this period is used for learning to collect sensing results and train a classifier, and the rest is used for transmissions. In spectrum sharing systems, there is a well-known tradeoff between the sensing time and the transmission time. While increasing the sensing time can increase the spectrum sensing accuracy, there is less time left for data transmissions. In this paper, we present a generative adversarial network (GAN) approach to generate synthetic sensing results to augment the training data for the deep learning classifier so that the sensing time can be reduced (and thus the transmission time can be increased) while keeping high accuracy of the classifier. We consider both additive white Gaussian noise (AWGN) and Rayleigh channels, and show that this GAN-based approach can significantly improve both the protection of the high-priority user and the throughput of the NextG user (more in Rayleigh channels than AWGN channels). ",
    "url": "https://arxiv.org/abs/2212.13598",
    "authors": [
      "Yi Shi",
      "Yalin E. Sagduyu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13599",
    "title": "Brain Cancer Segmentation Using YOLOv5 Deep Neural Network",
    "abstract": "An expansion of aberrant brain cells is referred to as a brain tumor. The brain's architecture is extremely intricate, with several regions controlling various nervous system processes. Any portion of the brain or skull can develop a brain tumor, including the brain's protective coating, the base of the skull, the brainstem, the sinuses, the nasal cavity, and many other places. Over the past ten years, numerous developments in the field of computer-aided brain tumor diagnosis have been made. Recently, instance segmentation has attracted a lot of interest in numerous computer vision applications. It seeks to assign various IDs to various scene objects, even if they are members of the same class. Typically, a two-stage pipeline is used to perform instance segmentation. This study shows brain cancer segmentation using YOLOv5. Yolo takes dataset as picture format and corresponding text file. You Only Look Once (YOLO) is a viral and widely used algorithm. YOLO is famous for its object recognition properties. You Only Look Once (YOLO) is a popular algorithm that has gone viral. YOLO is well known for its ability to identify objects. YOLO V2, V3, V4, and V5 are some of the YOLO latest versions that experts have published in recent years. Early brain tumor detection is one of the most important jobs that neurologists and radiologists have. However, it can be difficult and error-prone to manually identify and segment brain tumors from Magnetic Resonance Imaging (MRI) data. For making an early diagnosis of the condition, an automated brain tumor detection system is necessary. The model of the research paper has three classes. They are respectively Meningioma, Pituitary, Glioma. The results show that, our model achieves competitive accuracy, in terms of runtime usage of M2 10 core GPU. ",
    "url": "https://arxiv.org/abs/2212.13599",
    "authors": [
      "Sudipto Paul",
      "Dr. Md Taimur Ahad",
      "Md. Mahedi Hasan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13607",
    "title": "EDoG: Adversarial Edge Detection For Graph Neural Networks",
    "abstract": "Graph Neural Networks (GNNs) have been widely applied to different tasks such as bioinformatics, drug design, and social networks. However, recent studies have shown that GNNs are vulnerable to adversarial attacks which aim to mislead the node or subgraph classification prediction by adding subtle perturbations. Detecting these attacks is challenging due to the small magnitude of perturbation and the discrete nature of graph data. In this paper, we propose a general adversarial edge detection pipeline EDoG without requiring knowledge of the attack strategies based on graph generation. Specifically, we propose a novel graph generation approach combined with link prediction to detect suspicious adversarial edges. To effectively train the graph generative model, we sample several sub-graphs from the given graph data. We show that since the number of adversarial edges is usually low in practice, with low probability the sampled sub-graphs will contain adversarial edges based on the union bound. In addition, considering the strong attacks which perturb a large number of edges, we propose a set of novel features to perform outlier detection as the preprocessing for our detection. Extensive experimental results on three real-world graph datasets including a private transaction rule dataset from a major company and two types of synthetic graphs with controlled properties show that EDoG can achieve above 0.8 AUC against four state-of-the-art unseen attack strategies without requiring any knowledge about the attack type; and around 0.85 with knowledge of the attack type. EDoG significantly outperforms traditional malicious edge detection baselines. We also show that an adaptive attack with full knowledge of our detection pipeline is difficult to bypass it. ",
    "url": "https://arxiv.org/abs/2212.13607",
    "authors": [
      "Xiaojun Xu",
      "Yue Yu",
      "Hanzhang Wang",
      "Alok Lal",
      "Carl A. Gunter",
      "Bo Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.13615",
    "title": "Cache Placement in an NDN Based LEO Satellite Network Constellation",
    "abstract": "The efforts to replace the successful, albeit aging, TCP/IP Internet architecture with a better suited one have driving research interest to information-centric alternatives. The Named Data Networking (NDN) architecture is probably one of the main contenders to become the network layer of the future Internet thanks to its inbuilt support for mobility, in-network caching, security and, in general, for being better adapted to the needs of current network applications. At the same time, massive satellite constellations are currently being deployed in low Earth orbits (LEO) to provide a backend for network connectivity. It is expected that, very soon, these constellations will function as proper networks thanks to inter-satellite communication links. These new satellite networks will be able to benefit from their greenfield status and the new network architectures. In this paper we analyze how to deploy the network caches of an NDN-based LEO satellite network. In particular, we show how we can jointly select the most appropriate caching nodes for each piece of content and how to forward data across the constellation in two simple alternative ways. Performance results show that the caching and forwarding strategies proposed reduce path lengths up to a third with just a few caching nodes while, simultaneously, helping to spread the load along the network. ",
    "url": "https://arxiv.org/abs/2212.13615",
    "authors": [
      "Miguel Rodríguez-Pérez",
      "Sergio Herrería-Alonso",
      "Andrés Suárez-González",
      "José Carlos López-Ardao",
      "Raúl Rodríguez-Rubio"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2212.13626",
    "title": "LOSDD: Leave-Out Support Vector Data Description for Outlier Detection",
    "abstract": "Support Vector Machines have been successfully used for one-class classification (OCSVM, SVDD) when trained on clean data, but they work much worse on dirty data: outliers present in the training data tend to become support vectors, and are hence considered \"normal\". In this article, we improve the effectiveness to detect outliers in dirty training data with a leave-out strategy: by temporarily omitting one candidate at a time, this point can be judged using the remaining data only. We show that this is more effective at scoring the outlierness of points than using the slack term of existing SVM-based approaches. Identified outliers can then be removed from the data, such that outliers hidden by other outliers can be identified, to reduce the problem of masking. Naively, this approach would require training N individual SVMs (and training $O(N^2)$ SVMs when iteratively removing the worst outliers one at a time), which is prohibitively expensive. We will discuss that only support vectors need to be considered in each step and that by reusing SVM parameters and weights, this incremental retraining can be accelerated substantially. By removing candidates in batches, we can further improve the processing time, although it obviously remains more costly than training a single SVM. ",
    "url": "https://arxiv.org/abs/2212.13626",
    "authors": [
      "Daniel Boiar",
      "Thomas Liebig",
      "Erich Schubert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.13638",
    "title": "Battling the Coronavirus `Infodemic' Among Social Media Users in Africa",
    "abstract": "During a global pandemic, how can we best prompt social media users to demonstrate discernment in sharing information online? We ran a contextual adaptive experiment on Facebook Messenger with users in Kenya and Nigeria and tested 40 combinations of interventions aimed at decreasing intentions to share misinformation while maintaining intentions to share factual posts related to COVID-19. We estimate precise null effects of showing users warning flags or suggesting related articles alongside misleading posts, tactics used by social media platforms. Instead, users share more discerningly when they are given tips for spotting misinformation or are nudged to consider information's accuracy, reducing misinformation sharing by 7.5% and 4.5% relative to control, respectively. We find significant heterogeneity in response to these treatments across users, indicating tips and the accuracy nudge affect outcomes through separate mechanisms. These low-cost, scalable interventions have the potential to improve the quality of information circulating online. ",
    "url": "https://arxiv.org/abs/2212.13638",
    "authors": [
      "Molly Offer-Westort",
      "Leah R. Rosenzweig",
      "Susan Athey"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2212.13647",
    "title": "Does Big Data Require Complex Systems? A Performance Comparison Between  Spark and Unicage Shell Scripts",
    "abstract": "The paradigm of big data is characterized by the need to collect and process data sets of great volume, arriving at the systems with great velocity, in a variety of formats. Spark is a widely used big data processing system that can be integrated with Hadoop to provide powerful abstractions to developers, such as distributed storage through HDFS and resource management through YARN. When all the required configurations are made, Spark can also provide quality attributes, such as scalability, fault tolerance, and security. However, all of these benefits come at the cost of complexity, with high memory requirements, and additional latency in processing. An alternative approach is to use a lean software stack, like Unicage, that delegates most control back to the developer. In this work we evaluated the performance of big data processing with Spark versus Unicage, in a cluster environment hosted in the IBM Cloud. Two sets of experiments were performed: batch processing of unstructured data sets, and query processing of structured data sets. The input data sets were of significant size, ranging from 64 GB to 8192 GB in volume. The results show that the performance of Unicage scripts is superior to Spark for search workloads like grep and select, but that the abstractions of distributed storage and resource management from the Hadoop stack enable Spark to execute workloads with inter-record dependencies, such as sort and join, with correct outputs. ",
    "url": "https://arxiv.org/abs/2212.13647",
    "authors": [
      "Duarte M. Nascimento",
      "Miguel Ferreira",
      "Miguel L. Pardal"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2212.13660",
    "title": "NeMo: 3D Neural Motion Fields from Multiple Video Instances of the Same  Action",
    "abstract": "The task of reconstructing 3D human motion has wideranging applications. The gold standard Motion capture (MoCap) systems are accurate but inaccessible to the general public due to their cost, hardware and space constraints. In contrast, monocular human mesh recovery (HMR) methods are much more accessible than MoCap as they take single-view videos as inputs. Replacing the multi-view Mo- Cap systems with a monocular HMR method would break the current barriers to collecting accurate 3D motion thus making exciting applications like motion analysis and motiondriven animation accessible to the general public. However, performance of existing HMR methods degrade when the video contains challenging and dynamic motion that is not in existing MoCap datasets used for training. This reduces its appeal as dynamic motion is frequently the target in 3D motion recovery in the aforementioned applications. Our study aims to bridge the gap between monocular HMR and multi-view MoCap systems by leveraging information shared across multiple video instances of the same action. We introduce the Neural Motion (NeMo) field. It is optimized to represent the underlying 3D motions across a set of videos of the same action. Empirically, we show that NeMo can recover 3D motion in sports using videos from the Penn Action dataset, where NeMo outperforms existing HMR methods in terms of 2D keypoint detection. To further validate NeMo using 3D metrics, we collected a small MoCap dataset mimicking actions in Penn Action,and show that NeMo achieves better 3D reconstruction compared to various baselines. ",
    "url": "https://arxiv.org/abs/2212.13660",
    "authors": [
      "Kuan-Chieh Wang",
      "Zhenzhen Weng",
      "Maria Xenochristou",
      "Joao Pedro Araujo",
      "Jeffrey Gu",
      "C. Karen Liu",
      "Serena Yeung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13667",
    "title": "Learning When to Use Adaptive Adversarial Image Perturbations against  Autonomous Vehicles",
    "abstract": "The deep neural network (DNN) models for object detection using camera images are widely adopted in autonomous vehicles. However, DNN models are shown to be susceptible to adversarial image perturbations. In the existing methods of generating the adversarial image perturbations, optimizations take each incoming image frame as the decision variable to generate an image perturbation. Therefore, given a new image, the typically computationally-expensive optimization needs to start over as there is no learning between the independent optimizations. Very few approaches have been developed for attacking online image streams while considering the underlying physical dynamics of autonomous vehicles, their mission, and the environment. We propose a multi-level stochastic optimization framework that monitors an attacker's capability of generating the adversarial perturbations. Based on this capability level, a binary decision attack/not attack is introduced to enhance the effectiveness of the attacker. We evaluate our proposed multi-level image attack framework using simulations for vision-guided autonomous vehicles and actual tests with a small indoor drone in an office environment. The results show our method's capability to generate the image attack in real-time while monitoring when the attacker is proficient given state estimates. ",
    "url": "https://arxiv.org/abs/2212.13667",
    "authors": [
      "Hyung-Jin Yoon",
      "Hamidreza Jafarnejadsani",
      "Petros Voulgaris"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13669",
    "title": "Optimal algorithms for group distributionally robust optimization and  beyond",
    "abstract": "Distributionally robust optimization (DRO) can improve the robustness and fairness of learning methods. In this paper, we devise stochastic algorithms for a class of DRO problems including group DRO, subpopulation fairness, and empirical conditional value at risk (CVaR) optimization. Our new algorithms achieve faster convergence rates than existing algorithms for multiple DRO settings. We also provide a new information-theoretic lower bound that implies our bounds are tight for group DRO. Empirically, too, our algorithms outperform known methods ",
    "url": "https://arxiv.org/abs/2212.13669",
    "authors": [
      "Tasuku Soma",
      "Khashayar Gatmiry",
      "Stefanie Jegelka"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2212.13671",
    "title": "Optimizing Replacement Policies for Content Delivery Network Caching:  Beyond Belady to Attain A Seemingly Unattainable Byte Miss Ratio",
    "abstract": "When facing objects/files of differing sizes in content delivery networks (CDNs) caches, pursuing an optimal object miss ratio (OMR) by approximating Belady no longer ensures an optimal byte miss ratio (BMR), creating confusion about how to achieve a superior BMR in CDNs. To address this issue, we experimentally observe that there exists a time window to delay the eviction of the object with the longest reuse distance to improve BMR without increasing OMR. As a result, we introduce a deep reinforcement learning (RL) model to capture this time window by dynamically monitoring the changes in OMR and BMR, and implementing a BMR-friendly policy in the time window. Based on this policy, we propose a Belady and Size Eviction (LRU-BaSE) algorithm, reducing BMR while maintaining OMR. To make LRU-BaSE efficient and practical, we address the feedback delay problem of RL with a two-pronged approach. On the one hand, our observation of a rear section of the LRU cache queue containing most of the eviction candidates allows LRU-BaSE to shorten the decision region. On the other hand, the request distribution on CDNs makes it feasible to divide the learning region into multiple sub-regions that are each learned with reduced time and increased accuracy. In real CDN systems, compared to LRU, LRU-BaSE can reduce \"backing to OS\" traffic and access latency by 30.05\\% and 17.07\\%, respectively, on average. The results on the simulator confirm that LRU-BaSE outperforms the state-of-the-art cache replacement policies, where LRU-BaSE's BMR is 0.63\\% and 0.33\\% less than that of Belady and Practical Flow-based Offline Optimal (PFOO), respectively, on average. In addition, compared to Learning Relaxed Belady (LRB), LRU-BaSE can yield relatively stable performance when facing workload drift. ",
    "url": "https://arxiv.org/abs/2212.13671",
    "authors": [
      "Peng Wang",
      "Yu Liu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2212.13675",
    "title": "XMAM:X-raying Models with A Matrix to Reveal Backdoor Attacks for  Federated Learning",
    "abstract": "Federated Learning (FL) has received increasing attention due to its privacy protection capability. However, the base algorithm FedAvg is vulnerable when it suffers from so-called backdoor attacks. Former researchers proposed several robust aggregation methods. Unfortunately, many of these aggregation methods are unable to defend against backdoor attacks. What's more, the attackers recently have proposed some hiding methods that further improve backdoor attacks' stealthiness, making all the existing robust aggregation methods fail. To tackle the threat of backdoor attacks, we propose a new aggregation method, X-raying Models with A Matrix (XMAM), to reveal the malicious local model updates submitted by the backdoor attackers. Since we observe that the output of the Softmax layer exhibits distinguishable patterns between malicious and benign updates, we focus on the Softmax layer's output in which the backdoor attackers are difficult to hide their malicious behavior. Specifically, like X-ray examinations, we investigate the local model updates by using a matrix as an input to get their Softmax layer's outputs. Then, we preclude updates whose outputs are abnormal by clustering. Without any training dataset in the server, the extensive evaluations show that our XMAM can effectively distinguish malicious local model updates from benign ones. For instance, when other methods fail to defend against the backdoor attacks at no more than 20% malicious clients, our method can tolerate 45% malicious clients in the black-box mode and about 30% in Projected Gradient Descent (PGD) mode. Besides, under adaptive attacks, the results demonstrate that XMAM can still complete the global model training task even when there are 40% malicious clients. Finally, we analyze our method's screening complexity, and the results show that XMAM is about 10-10000 times faster than the existing methods. ",
    "url": "https://arxiv.org/abs/2212.13675",
    "authors": [
      "Jianyi Zhang",
      "Fangjiao Zhang",
      "Qichao Jin",
      "Zhiqiang Wang",
      "Xiaodong Lin",
      "Xiali Hei"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2212.13676",
    "title": "Circular Accessible Depth: A Robust Traversability Representation for  UGV Navigation",
    "abstract": "In this paper, we present the Circular Accessible Depth (CAD), a robust traversability representation for an unmanned ground vehicle (UGV) to learn traversability in various scenarios containing irregular obstacles. To predict CAD, we propose a neural network, namely CADNet, with an attention-based multi-frame point cloud fusion module, Stability-Attention Module (SAM), to encode the spatial features from point clouds captured by LiDAR. CAD is designed based on the polar coordinate system and focuses on predicting the border of traversable area. Since it encodes the spatial information of the surrounding environment, which enables a semi-supervised learning for the CADNet, and thus desirably avoids annotating a large amount of data. Extensive experiments demonstrate that CAD outperforms baselines in terms of robustness and precision. We also implement our method on a real UGV and show that it performs well in real-world scenarios. ",
    "url": "https://arxiv.org/abs/2212.13676",
    "authors": [
      "Shikuan Xie",
      "Ran Song",
      "Yuenan Zhao",
      "Xueqin Huang",
      "Yibin Li",
      "Wei Zhang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13689",
    "title": "ML-based Secure Low-Power Communication in Adversarial Contexts",
    "abstract": "As wireless network technology becomes more and more popular, mutual interference between various signals has become more and more severe and common. Therefore, there is often a situation in which the transmission of its own signal is interfered with by occupying the channel. Especially in a confrontational environment, Jamming has caused great harm to the security of information transmission. So I propose ML-based secure ultra-low power communication, which is an approach to use machine learning to predict future wireless traffic by capturing patterns of past wireless traffic to ensure ultra-low-power transmission of signals via backscatters. In order to be more suitable for the adversarial environment, we use backscatter to achieve ultra-low power signal transmission, and use frequency-hopping technology to achieve successful confrontation with Jamming information. In the end, we achieved a prediction success rate of 96.19%. ",
    "url": "https://arxiv.org/abs/2212.13689",
    "authors": [
      "Guanqun Song",
      "Ting Zhu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2212.13696",
    "title": "Detection of Active Emergency Vehicles using Per-Frame CNNs and Output  Smoothing",
    "abstract": "While inferring common actor states (such as position or velocity) is an important and well-explored task of the perception system aboard a self-driving vehicle (SDV), it may not always provide sufficient information to the SDV. This is especially true in the case of active emergency vehicles (EVs), where light-based signals also need to be captured to provide a full context. We consider this problem and propose a sequential methodology for the detection of active EVs, using an off-the-shelf CNN model operating at a frame level and a downstream smoother that accounts for the temporal aspect of flashing EV lights. We also explore model improvements through data augmentation and training with additional hard samples. ",
    "url": "https://arxiv.org/abs/2212.13696",
    "authors": [
      "Meng Fan",
      "Craig Bidstrup",
      "Zhaoen Su",
      "Jason Owens",
      "Gary Yang",
      "Nemanja Djuric"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13697",
    "title": "Network Characteristics of LEO Satellite Constellations: A  Starlink-Based Measurement from End Users",
    "abstract": "Low Earth orbit Satellite Networks (LSNs) have been advocated as a key infrastructure for truly global coverage in the forthcoming 6G. This paper presents our initial measurement results and observations on the end-to-end network characteristics of Starlink, arguably the largest LSN constellation to date. Our findings confirm that LSNs are a promising solution towards ubiquitous Internet coverage over the Earth; yet, we also find that the users of Starlink experience much more dynamics in throughput and latency than terrestrial network users, and even frequent outages. Its user experiences are heavily affected by environmental factors such as terrain, solar storms, rain, clouds, and temperature, so is the power consumption. We further analyze Starlink's current bent-pipe relay strategy and its limits, particularly for cross-ocean routes. We have also explored its mobility and portability potentials, and extended our experiments from urban cities to wild remote areas that are facing distinct practical and cultural challenges. ",
    "url": "https://arxiv.org/abs/2212.13697",
    "authors": [
      "Sami Ma",
      "Yi Ching Chou",
      "Haoyuan Zhao",
      "Long Chen",
      "Xiaoqiang Ma",
      "Jiangchuan Liu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2212.13700",
    "title": "Publishing Efficient On-device Models Increases Adversarial  Vulnerability",
    "abstract": "Recent increases in the computational demands of deep neural networks (DNNs) have sparked interest in efficient deep learning mechanisms, e.g., quantization or pruning. These mechanisms enable the construction of a small, efficient version of commercial-scale models with comparable accuracy, accelerating their deployment to resource-constrained devices. In this paper, we study the security considerations of publishing on-device variants of large-scale models. We first show that an adversary can exploit on-device models to make attacking the large models easier. In evaluations across 19 DNNs, by exploiting the published on-device models as a transfer prior, the adversarial vulnerability of the original commercial-scale models increases by up to 100x. We then show that the vulnerability increases as the similarity between a full-scale and its efficient model increase. Based on the insights, we propose a defense, $similarity$-$unpairing$, that fine-tunes on-device models with the objective of reducing the similarity. We evaluated our defense on all the 19 DNNs and found that it reduces the transferability up to 90% and the number of queries required by a factor of 10-100x. Our results suggest that further research is needed on the security (or even privacy) threats caused by publishing those efficient siblings. ",
    "url": "https://arxiv.org/abs/2212.13700",
    "authors": [
      "Sanghyun Hong",
      "Nicholas Carlini",
      "Alexey Kurakin"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13709",
    "title": "PersonaSAGE: A Multi-Persona Graph Neural Network",
    "abstract": "Graph Neural Networks (GNNs) have become increasingly important in recent years due to their state-of-the-art performance on many important downstream applications. Existing GNNs have mostly focused on learning a single node representation, despite that a node often exhibits polysemous behavior in different contexts. In this work, we develop a persona-based graph neural network framework called PersonaSAGE that learns multiple persona-based embeddings for each node in the graph. Such disentangled representations are more interpretable and useful than a single embedding. Furthermore, PersonaSAGE learns the appropriate set of persona embeddings for each node in the graph, and every node can have a different number of assigned persona embeddings. The framework is flexible enough and the general design helps in the wide applicability of the learned embeddings to suit the domain. We utilize publicly available benchmark datasets to evaluate our approach and against a variety of baselines. The experiments demonstrate the effectiveness of PersonaSAGE for a variety of important tasks including link prediction where we achieve an average gain of 15% while remaining competitive for node classification. Finally, we also demonstrate the utility of PersonaSAGE with a case study for personalized recommendation of different entity types in a data management platform. ",
    "url": "https://arxiv.org/abs/2212.13709",
    "authors": [
      "Gautam Choudhary",
      "Iftikhar Ahamath Burhanuddin",
      "Eunyee Koh",
      "Fan Du",
      "Ryan A. Rossi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2212.13714",
    "title": "Continuous Depth Recurrent Neural Differential Equations",
    "abstract": "Recurrent neural networks (RNNs) have brought a lot of advancements in sequence labeling tasks and sequence data. However, their effectiveness is limited when the observations in the sequence are irregularly sampled, where the observations arrive at irregular time intervals. To address this, continuous time variants of the RNNs were introduced based on neural ordinary differential equations (NODE). They learn a better representation of the data using the continuous transformation of hidden states over time, taking into account the time interval between the observations. However, they are still limited in their capability as they use the discrete transformations and a fixed discrete number of layers (depth) over an input in the sequence to produce the output observation. We intend to address this limitation by proposing RNNs based on differential equations which model continuous transformations over both depth and time to predict an output for a given input in the sequence. Specifically, we propose continuous depth recurrent neural differential equations (CDR-NDE) which generalizes RNN models by continuously evolving the hidden states in both the temporal and depth dimensions. CDR-NDE considers two separate differential equations over each of these dimensions and models the evolution in the temporal and depth directions alternatively. We also propose the CDR-NDE-heat model based on partial differential equations which treats the computation of hidden states as solving a heat equation over time. We demonstrate the effectiveness of the proposed models by comparing against the state-of-the-art RNN models on real world sequence labeling problems and data. ",
    "url": "https://arxiv.org/abs/2212.13714",
    "authors": [
      "Srinivas Anumasa",
      "Geetakrishnasai Gunapati",
      "P.K. Srijith"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13721",
    "title": "Emerging Mobile Phone-based Social Engineering Cyberattacks in the  Zambian ICT Sector",
    "abstract": "The number of registered SIM cards and active mobile phone subscribers in Zambia in 2020 surpassed the population of the country. This clearly shows that mobile phones in Zambia have become part of everyday life easing not only the way people communicate but also the way people perform financial transactions owing to the integration of mobile phone systems with financial payment systems. This development has not come without a cost. Cyberattackers, using various social engineering techniques have jumped onto the bandwagon to defraud unsuspecting users. Considering the aforesaid, this paper presents a high-order analytical approach towards mobile phone-based social engineering cyberattacks (phishing, SMishing, and Vishing) in Zambia which seek to defraud benign victims. This paper presents a baseline study to reiterate the problem at hand. Furthermore, we devise an attack model and an evaluation framework and ascertain the most prevalent types of attack. We also present a logistic regression analysis in the results section to conclude the most prevalent mobile phone-based type of social engineering attack. Based on the artifacts and observed insights, we suggest recommendations to mitigate these emergent social engineering cyberattacks. ",
    "url": "https://arxiv.org/abs/2212.13721",
    "authors": [
      "Aaron Zimba",
      "George Mukupa",
      "Victoria Chama"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2212.13725",
    "title": "Robust Sequence Networked Submodular Maximization",
    "abstract": "In this paper, we study the \\underline{R}obust \\underline{o}ptimization for \\underline{se}quence \\underline{Net}worked \\underline{s}ubmodular maximization (RoseNets) problem. We interweave the robust optimization with the sequence networked submodular maximization. The elements are connected by a directed acyclic graph and the objective function is not submodular on the elements but on the edges in the graph. Under such networked submodular scenario, the impact of removing an element from a sequence depends both on its position in the sequence and in the network. This makes the existing robust algorithms inapplicable. In this paper, we take the first step to study the RoseNets problem. We design a robust greedy algorithm, which is robust against the removal of an arbitrary subset of the selected elements. The approximation ratio of the algorithm depends both on the number of the removed elements and the network topology. We further conduct experiments on real applications of recommendation and link prediction. The experimental results demonstrate the effectiveness of the proposed algorithm. ",
    "url": "https://arxiv.org/abs/2212.13725",
    "authors": [
      "Qihao Shi",
      "Bingyang Fu",
      "Can Wang",
      "Jiawei Chen",
      "Sheng Zhou",
      "Yan Feng",
      "Chun Chen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.13726",
    "title": "A Clustering-guided Contrastive Fusion for Multi-view Representation  Learning",
    "abstract": "The past two decades have seen increasingly rapid advances in the field of multi-view representation learning due to it extracting useful information from diverse domains to facilitate the development of multi-view applications. However, the community faces two challenges: i) how to learn robust representations from a large amount of unlabeled data to against noise or incomplete views setting, and ii) how to balance view consistency and complementary for various downstream tasks. To this end, we utilize a deep fusion network to fuse view-specific representations into the view-common representation, extracting high-level semantics for obtaining robust representation. In addition, we employ a clustering task to guide the fusion network to prevent it from leading to trivial solutions. For balancing consistency and complementary, then, we design an asymmetrical contrastive strategy that aligns the view-common representation and each view-specific representation. These modules are incorporated into a unified method known as CLustering-guided cOntrastiVE fusioN (CLOVEN). We quantitatively and qualitatively evaluate the proposed method on five datasets, demonstrating that CLOVEN outperforms 11 competitive multi-view learning methods in clustering and classification. In the incomplete view scenario, our proposed method resists noise interference better than those of our competitors. Furthermore, the visualization analysis shows that CLOVEN can preserve the intrinsic structure of view-specific representation while also improving the compactness of view-commom representation. Our source code will be available soon at https://github.com/guanzhou-ke/cloven. ",
    "url": "https://arxiv.org/abs/2212.13726",
    "authors": [
      "Guanzhou Ke",
      "Guoqing Chao",
      "Xiaoli Wang",
      "Chenyang Xu",
      "Chang Xu",
      "Yongqi Zhu",
      "Yang Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13738",
    "title": "TempCLR: Temporal Alignment Representation with Contrastive Learning",
    "abstract": "Video representation learning has been successful in video-text pre-training for zero-shot transfer, where each sentence is trained to be close to the paired video clips in a common feature space. For long videos, given a paragraph of description where the sentences describe different segments of the video, by matching all sentence-clip pairs, the paragraph and the full video are aligned implicitly. However, such unit-level similarity measure may ignore the global temporal context over a long time span, which inevitably limits the generalization ability. In this paper, we propose a contrastive learning framework TempCLR to compare the full video and the paragraph explicitly. As the video/paragraph is formulated as a sequence of clips/sentences, under the constraint of their temporal order, we use dynamic time warping to compute the minimum cumulative cost over sentence-clip pairs as the sequence-level distance. To explore the temporal dynamics, we break the consistency of temporal order by shuffling the video clips or sentences according to the temporal granularity. In this way, we obtain the representations for clips/sentences, which perceive the temporal information and thus facilitate the sequence alignment. In addition to pre-training on the video and paragraph, our approach can also generalize on the matching between different video instances. We evaluate our approach on video retrieval, action step localization, and few-shot action recognition, and achieve consistent performance gain over all three tasks. Detailed ablation studies are provided to justify the approach design. ",
    "url": "https://arxiv.org/abs/2212.13738",
    "authors": [
      "Yuncong Yang",
      "Jiawei Ma",
      "Shiyuan Huang",
      "Long Chen",
      "Xudong Lin",
      "Guangxing Han",
      "Shih-Fu Chang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.13747",
    "title": "5G Network Management, Orchestration, and Architecture: A Practical  Study of the MonB5G project",
    "abstract": "The cellular device explosion in the past few decades has created many different opportunities for development for future generations. The 5G network offers a greater speed in the transmissions, a lower latency, and therefore greater capacity for remote execution. The benefits of AI for 5G network slicing orchestration and management will be discussed in this survey paper. We will study these topics in light of the EU-funded MonB5G project that works towards providing zero-touch management and orchestration in the support of network slicing at massive scales for 5G LTE and beyond. ",
    "url": "https://arxiv.org/abs/2212.13747",
    "authors": [
      "Hisham A. Kholidy",
      "Mohammed Abuzamak"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2212.13764",
    "title": "Representation Separation for Semantic Segmentation with Vision  Transformers",
    "abstract": "Vision transformers (ViTs) encoding an image as a sequence of patches bring new paradigms for semantic segmentation.We present an efficient framework of representation separation in local-patch level and global-region level for semantic segmentation with ViTs. It is targeted for the peculiar over-smoothness of ViTs in semantic segmentation, and therefore differs from current popular paradigms of context modeling and most existing related methods reinforcing the advantage of attention. We first deliver the decoupled two-pathway network in which another pathway enhances and passes down local-patch discrepancy complementary to global representations of transformers. We then propose the spatially adaptive separation module to obtain more separate deep representations and the discriminative cross-attention which yields more discriminative region representations through novel auxiliary supervisions. The proposed methods achieve some impressive results: 1) incorporated with large-scale plain ViTs, our methods achieve new state-of-the-art performances on five widely used benchmarks; 2) using masked pre-trained plain ViTs, we achieve 68.9% mIoU on Pascal Context, setting a new record; 3) pyramid ViTs integrated with the decoupled two-pathway network even surpass the well-designed high-resolution ViTs on Cityscapes; 4) the improved representations by our framework have favorable transferability in images with natural corruptions. The codes will be released publicly. ",
    "url": "https://arxiv.org/abs/2212.13764",
    "authors": [
      "Yuanduo Hong",
      "Huihui Pan",
      "Weichao Sun",
      "Xinghu Yu",
      "Huijun Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.13835",
    "title": "Representation Learning in Deep RL via Discrete Information Bottleneck",
    "abstract": "Several self-supervised representation learning methods have been proposed for reinforcement learning (RL) with rich observations. For real-world applications of RL, recovering underlying latent states is crucial, particularly when sensory inputs contain irrelevant and exogenous information. In this work, we study how information bottlenecks can be used to construct latent states efficiently in the presence of task-irrelevant information. We propose architectures that utilize variational and discrete information bottlenecks, coined as RepDIB, to learn structured factorized representations. Exploiting the expressiveness bought by factorized representations, we introduce a simple, yet effective, bottleneck that can be integrated with any existing self-supervised objective for RL. We demonstrate this across several online and offline RL benchmarks, along with a real robot arm task, where we find that compressed representations with RepDIB can lead to strong performance improvements, as the learned bottlenecks help predict only the relevant state while ignoring irrelevant information. ",
    "url": "https://arxiv.org/abs/2212.13835",
    "authors": [
      "Riashat Islam",
      "Hongyu Zang",
      "Manan Tomar",
      "Aniket Didolkar",
      "Md Mofijul Islam",
      "Samin Yeasar Arnob",
      "Tariq Iqbal",
      "Xin Li",
      "Anirudh Goyal",
      "Nicolas Heess",
      "Alex Lamb"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13847",
    "title": "Heterogeneous Graph Contrastive Learning with Meta-path Contexts and  Weighted Negative Samples",
    "abstract": "Heterogeneous graph contrastive learning has received wide attention recently. Some existing methods use meta-paths, which are sequences of object types that capture semantic relationships between objects, to construct contrastive views. However, most of them ignore the rich meta-path context information that describes how two objects are connected by meta-paths. On the other hand, they fail to distinguish hard negatives from false negatives, which could adversely affect the model performance. To address the problems, we propose MEOW, a heterogeneous graph contrastive learning model that considers both meta-path contexts and weighted negative samples. Specifically, MEOW constructs a coarse view and a fine-grained view for contrast. The former reflects which objects are connected by meta-paths, while the latter uses meta-path contexts and characterizes the details on how the objects are connected. We take node embeddings in the coarse view as anchors, and construct positive and negative samples from the fine-grained view. Further, to distinguish hard negatives from false negatives, we learn weights of negative samples based on node clustering. We also use prototypical contrastive learning to pull close embeddings of nodes in the same cluster. Finally, we conduct extensive experiments to show the superiority of MEOW against other state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2212.13847",
    "authors": [
      "Jianxiang Yu",
      "Xiang Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13848",
    "title": "Learning Lipschitz Functions by GD-trained Shallow Overparameterized  ReLU Neural Networks",
    "abstract": "We explore the ability of overparameterized shallow ReLU neural networks to learn Lipschitz, non-differentiable, bounded functions with additive noise when trained by Gradient Descent (GD). To avoid the problem that in the presence of noise, neural networks trained to nearly zero training error are inconsistent in this class, we focus on the early-stopped GD which allows us to show consistency and optimal rates. In particular, we explore this problem from the viewpoint of the Neural Tangent Kernel (NTK) approximation of a GD-trained finite-width neural network. We show that whenever some early stopping rule is guaranteed to give an optimal rate (of excess risk) on the Hilbert space of the kernel induced by the ReLU activation function, the same rule can be used to achieve minimax optimal rate for learning on the class of considered Lipschitz functions by neural networks. We discuss several data-free and data-dependent practically appealing stopping rules that yield optimal rates. ",
    "url": "https://arxiv.org/abs/2212.13848",
    "authors": [
      "Ilja Kuzborskij",
      "Csaba Szepesvári"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.13872",
    "title": "Analysis of a Peaceman-Rachford ADI scheme for Maxwell equations in  heterogeneous media",
    "abstract": "The Peaceman-Rachford alternating direction implicit (ADI) scheme for linear time-dependent Maxwell equations is analyzed on a heterogeneous cuboid. Due to discontinuities of the material parameters, the solution of the Maxwell equations is less than $H^2$-regular in space. For the ADI scheme, we prove a rigorous time-discrete error bound with a convergence rate that is half an order lower than the classical one. Our statement imposes only assumptions on the initial data and the material parameters, but not on the solution. To establish this result, we analyze the regularity of the Maxwell equations in detail in an appropriate functional analytical framework. The theoretical findings are complemented by a numerical experiment indicating that the proven convergence rate is indeed observable and optimal. ",
    "url": "https://arxiv.org/abs/2212.13872",
    "authors": [
      "Konstantin Zerulla",
      "Tobias Jahnke"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Analysis of PDEs (math.AP)"
    ]
  },
  {
    "id": "arXiv:2212.13879",
    "title": "Multi-Metric AutoRec for High Dimensional and Sparse User Behavior Data  Prediction",
    "abstract": "User behavior data produced during interaction with massive items in the significant data era are generally heterogeneous and sparse, leaving the recommender system (RS) a large diversity of underlying patterns to excavate. Deep neural network-based models have reached the state-of-the-art benchmark of the RS owing to their fitting capabilities. However, prior works mainly focus on designing an intricate architecture with fixed loss function and regulation. These single-metric models provide limited performance when facing heterogeneous and sparse user behavior data. Motivated by this finding, we propose a multi-metric AutoRec (MMA) based on the representative AutoRec. The idea of the proposed MMA is mainly two-fold: 1) apply different $L_p$-norm on loss function and regularization to form different variant models in different metric spaces, and 2) aggregate these variant models. Thus, the proposed MMA enjoys the multi-metric orientation from a set of dispersed metric spaces, achieving a comprehensive representation of user data. Theoretical studies proved that the proposed MMA could attain performance improvement. The extensive experiment on five real-world datasets proves that MMA can outperform seven other state-of-the-art models in predicting unobserved user behavior data. ",
    "url": "https://arxiv.org/abs/2212.13879",
    "authors": [
      "Cheng Liang",
      "Teng Huang",
      "Yi He",
      "Song Deng",
      "Di Wu",
      "Xin Luo"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2212.13881",
    "title": "Feature learning in neural networks and kernel machines that recursively  learn features",
    "abstract": "Neural networks have achieved impressive results on many technological and scientific tasks. Yet, their empirical successes have outpaced our fundamental understanding of their structure and function. By identifying mechanisms driving the successes of neural networks, we can provide principled approaches for improving neural network performance and develop simple and effective alternatives. In this work, we isolate the key mechanism driving feature learning in fully connected neural networks by connecting neural feature learning to the average gradient outer product. We subsequently leverage this mechanism to design \\textit{Recursive Feature Machines} (RFMs), which are kernel machines that learn features. We show that RFMs (1) accurately capture features learned by deep fully connected neural networks, (2) close the gap between kernel machines and fully connected networks, and (3) surpass a broad spectrum of models including neural networks on tabular data. Furthermore, we demonstrate that RFMs shed light on recently observed deep learning phenomena such as grokking, lottery tickets, simplicity biases, and spurious features. We provide a Python implementation to make our method broadly accessible [\\href{https://github.com/aradha/recursive_feature_machines}{GitHub}]. ",
    "url": "https://arxiv.org/abs/2212.13881",
    "authors": [
      "Adityanarayanan Radhakrishnan",
      "Daniel Beaglehole",
      "Parthe Pandit",
      "Mikhail Belkin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.13897",
    "title": "What You Like: Generating Explainable Topical Recommendations for  Twitter Using Social Annotations",
    "abstract": "With over 500 million tweets posted per day, in Twitter, it is difficult for Twitter users to discover interesting content from the deluge of uninteresting posts. In this work, we present a novel, explainable, topical recommendation system, that utilizes social annotations, to help Twitter users discover tweets, on topics of their interest. A major challenge in using traditional rating dependent recommendation systems, like collaborative filtering and content based systems, in high volume social networks is that, due to attention scarcity most items do not get any ratings. Additionally, the fact that most Twitter users are passive consumers, with 44% users never tweeting, makes it very difficult to use user ratings for generating recommendations. Further, a key challenge in developing recommendation systems is that in many cases users reject relevant recommendations if they are totally unfamiliar with the recommended item. Providing a suitable explanation, for why the item is recommended, significantly improves the acceptability of recommendation. By virtue of being a topical recommendation system our method is able to present simple topical explanations for the generated recommendations. Comparisons with state-of-the-art matrix factorization based collaborative filtering, content based and social recommendations demonstrate the efficacy of the proposed approach. ",
    "url": "https://arxiv.org/abs/2212.13897",
    "authors": [
      "Parantapa Bhattacharya",
      "Saptarshi Ghosh",
      "Muhammad Bilal Zafar",
      "Soumya K. Ghosh",
      "Niloy Ganguly"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2212.13899",
    "title": "Attentive Deep Neural Networks for Legal Document Retrieval",
    "abstract": "Legal text retrieval serves as a key component in a wide range of legal text processing tasks such as legal question answering, legal case entailment, and statute law retrieval. The performance of legal text retrieval depends, to a large extent, on the representation of text, both query and legal documents. Based on good representations, a legal text retrieval model can effectively match the query to its relevant documents. Because legal documents often contain long articles and only some parts are relevant to queries, it is quite a challenge for existing models to represent such documents. In this paper, we study the use of attentive neural network-based text representation for statute law document retrieval. We propose a general approach using deep neural networks with attention mechanisms. Based on it, we develop two hierarchical architectures with sparse attention to represent long sentences and articles, and we name them Attentive CNN and Paraformer. The methods are evaluated on datasets of different sizes and characteristics in English, Japanese, and Vietnamese. Experimental results show that: i) Attentive neural methods substantially outperform non-neural methods in terms of retrieval performance across datasets and languages; ii) Pretrained transformer-based models achieve better accuracy on small datasets at the cost of high computational complexity while lighter weight Attentive CNN achieves better accuracy on large datasets; and iii) Our proposed Paraformer outperforms state-of-the-art methods on COLIEE dataset, achieving the highest recall and F2 scores in the top-N retrieval task. ",
    "url": "https://arxiv.org/abs/2212.13899",
    "authors": [
      "Ha-Thanh Nguyen",
      "Manh-Kien Phi",
      "Xuan-Bach Ngo",
      "Vu Tran",
      "Le-Minh Nguyen",
      "Minh-Phuong Tu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.13902",
    "title": "Robust identification of non-autonomous dynamical systems using  stochastic dynamics models",
    "abstract": "This paper considers the problem of system identification (ID) of linear and nonlinear non-autonomous systems from noisy and sparse data. We propose and analyze an objective function derived from a Bayesian formulation for learning a hidden Markov model with stochastic dynamics. We then analyze this objective function in the context of several state-of-the-art approaches for both linear and nonlinear system ID. In the former, we analyze least squares approaches for Markov parameter estimation, and in the latter, we analyze the multiple shooting approach. We demonstrate the limitations of the optimization problems posed by these existing methods by showing that they can be seen as special cases of the proposed optimization objective under certain simplifying assumptions: conditional independence of data and zero model error. Furthermore, we observe that our proposed approach has improved smoothness and inherent regularization that make it well-suited for system ID and provide mathematical explanations for these characteristics' origins. Finally, numerical simulations demonstrate a mean squared error over 8.7 times lower compared to multiple shooting when data are noisy and/or sparse. Moreover, the proposed approach can identify accurate and generalizable models even when there are more parameters than data or when the underlying system exhibits chaotic behavior. ",
    "url": "https://arxiv.org/abs/2212.13902",
    "authors": [
      "Nicholas Galioto",
      "Alex Arkady Gorodetsky"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Optimization and Control (math.OC)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Computation (stat.CO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.13904",
    "title": "A Novel Self-Supervised Learning-Based Anomaly Node Detection Method  Based on an Autoencoder in Wireless Sensor Networks",
    "abstract": "Due to the issue that existing wireless sensor network (WSN)-based anomaly detection methods only consider and analyze temporal features, in this paper, a self-supervised learning-based anomaly node detection method based on an autoencoder is designed. This method integrates temporal WSN data flow feature extraction, spatial position feature extraction and intermodal WSN correlation feature extraction into the design of the autoencoder to make full use of the spatial and temporal information of the WSN for anomaly detection. First, a fully connected network is used to extract the temporal features of nodes by considering a single mode from a local spatial perspective. Second, a graph neural network (GNN) is used to introduce the WSN topology from a global spatial perspective for anomaly detection and extract the spatial and temporal features of the data flows of nodes and their neighbors by considering a single mode. Then, the adaptive fusion method involving weighted summation is used to extract the relevant features between different models. In addition, this paper introduces a gated recurrent unit (GRU) to solve the long-term dependence problem of the time dimension. Eventually, the reconstructed output of the decoder and the hidden layer representation of the autoencoder are fed into a fully connected network to calculate the anomaly probability of the current system. Since the spatial feature extraction operation is advanced, the designed method can be applied to the task of large-scale network anomaly detection by adding a clustering operation. Experiments show that the designed method outperforms the baselines, and the F1 score reaches 90.6%, which is 5.2% higher than those of the existing anomaly detection methods based on unsupervised reconstruction and prediction. Code and model are available at https://github.com/GuetYe/anomaly_detection/GLSL ",
    "url": "https://arxiv.org/abs/2212.13904",
    "authors": [
      "Miao Ye",
      "Qinghao Zhang",
      "Xingsi Xue",
      "Yong Wang",
      "Qiuxiang Jiang",
      "Hongbing Qiu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.13930",
    "title": "Towards Integrated Sensing and Communications in IEEE 802.11bf Wi-Fi  Networks",
    "abstract": "As Wi-Fi becomes ubiquitous in public and private spaces, it becomes natural to leverage its intrinsic ability to sense the surrounding environment to implement groundbreaking wireless sensing applications such as human presence detection, activity recognition, and object tracking. For this reason, the IEEE 802.11bf Task Group is defining the appropriate modifications to existing Wi-Fi standards to enhance sensing capabilities through 802.11-compliant devices. However, the new standard is expected to leave the specific sensing algorithms open to implementation. To fill this gap, this article explores the practical implications of integrating sensing and communications into Wi-Fi networks. We provide an overview of the support that will enable sensing applications, together with an in-depth analysis of the role of different devices in a Wi-Fi sensing system and a description of the open research challenges. Moreover, an experimental evaluation with off-the-shelf devices provides suggestions about the parameters to be considered when designing Wi-Fi sensing systems. To make such an evaluation replicable, we pledge to release all of our dataset and code to the community. ",
    "url": "https://arxiv.org/abs/2212.13930",
    "authors": [
      "Francesca Meneghello",
      "Cheng Chen",
      "Carlos Cordeiro",
      "Francesco Restuccia"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2212.13939",
    "title": "Data Augmentation using Transformers and Similarity Measures for  Improving Arabic Text Classification",
    "abstract": "Learning models are highly dependent on data to work effectively, and they give a better performance upon training on big datasets. Massive research exists in the literature to address the dataset adequacy issue. One promising approach for solving dataset adequacy issues is the data augmentation (DA) approach. In DA, the amount of training data instances is increased by making different transformations on the available data instances to generate new correct and representative data instances. DA increases the dataset size and its variability, which enhances the model performance and its prediction accuracy. DA also solves the class imbalance problem in the classification learning techniques. Few studies have recently considered DA in the Arabic language. These studies rely on traditional augmentation approaches, such as paraphrasing by using rules or noising-based techniques. In this paper, we propose a new Arabic DA method that employs the recent powerful modeling technique, namely the AraGPT-2, for the augmentation process. The generated sentences are evaluated in terms of context, semantics, diversity, and novelty using the Euclidean, cosine, Jaccard, and BLEU distances. Finally, the AraBERT transformer is used on sentiment classification tasks to evaluate the classification performance of the augmented Arabic dataset. The experiments were conducted on four sentiment Arabic datasets, namely AraSarcasm, ASTD, ATT, and MOVIE. The selected datasets vary in size, label number, and unbalanced classes. The results show that the proposed methodology enhanced the Arabic sentiment text classification on all datasets with an increase in F1 score by 4% in AraSarcasm, 6% in ASTD, 9% in ATT, and 13% in MOVIE. ",
    "url": "https://arxiv.org/abs/2212.13939",
    "authors": [
      "Dania Refai",
      "Saleh Abo-Soud",
      "Mohammad Abdel-Rahman"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13941",
    "title": "HeATed Alert Triage (HeAT): Transferrable Learning to Extract Multistage  Attack Campaigns",
    "abstract": "With growing sophistication and volume of cyber attacks combined with complex network structures, it is becoming extremely difficult for security analysts to corroborate evidences to identify multistage campaigns on their network. This work develops HeAT (Heated Alert Triage): given a critical indicator of compromise (IoC), e.g., a severe IDS alert, HeAT produces a HeATed Attack Campaign (HAC) depicting the multistage activities that led up to the critical event. We define the concept of \"Alert Episode Heat\" to represent the analysts opinion of how much an event contributes to the attack campaign of the critical IoC given their knowledge of the network and security expertise. Leveraging a network-agnostic feature set, HeAT learns the essence of analyst's assessment of \"HeAT\" for a small set of IoC's, and applies the learned model to extract insightful attack campaigns for IoC's not seen before, even across networks by transferring what have been learned. We demonstrate the capabilities of HeAT with data collected in Collegiate Penetration Testing Competition (CPTC) and through collaboration with a real-world SOC. We developed HeAT-Gain metrics to demonstrate how analysts may assess and benefit from the extracted attack campaigns in comparison to common practices where IP addresses are used to corroborate evidences. Our results demonstrates the practical uses of HeAT by finding campaigns that span across diverse attack stages, remove a significant volume of irrelevant alerts, and achieve coherency to the analyst's original assessments. ",
    "url": "https://arxiv.org/abs/2212.13941",
    "authors": [
      "Stephen Moskal",
      "Shanchieh Jay Yang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13970",
    "title": "Breaking the Architecture Barrier: A Method for Efficient Knowledge  Transfer Across Networks",
    "abstract": "Transfer learning is a popular technique for improving the performance of neural networks. However, existing methods are limited to transferring parameters between networks with same architectures. We present a method for transferring parameters between neural networks with different architectures. Our method, called DPIAT, uses dynamic programming to match blocks and layers between architectures and transfer parameters efficiently. Compared to existing parameter prediction and random initialization methods, it significantly improves training efficiency and validation accuracy. In experiments on ImageNet, our method improved validation accuracy by an average of 1.6 times after 50 epochs of training. DPIAT allows both researchers and neural architecture search systems to modify trained networks and reuse knowledge, avoiding the need for retraining from scratch. We also introduce a network architecture similarity measure, enabling users to choose the best source network without any training. ",
    "url": "https://arxiv.org/abs/2212.13970",
    "authors": [
      "Maciej A. Czyzewski",
      "Daniel Nowak",
      "Kamil Piechowiak"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13974",
    "title": "Adversarial Virtual Exemplar Learning for Label-Frugal Satellite Image  Change Detection",
    "abstract": "Satellite image change detection aims at finding occurrences of targeted changes in a given scene taken at different instants. This task is highly challenging due to the acquisition conditions and also to the subjectivity of changes. In this paper, we investigate satellite image change detection using active learning. Our method is interactive and relies on a question and answer model which asks the oracle (user) questions about the most informative display (dubbed as virtual exemplars), and according to the user's responses, updates change detections. The main contribution of our method consists in a novel adversarial model that allows frugally probing the oracle with only the most representative, diverse and uncertain virtual exemplars. The latter are learned to challenge the most the trained change decision criteria which ultimately leads to a better re-estimate of these criteria in the following iterations of active learning. Conducted experiments show the out-performance of our proposed adversarial display model against other display strategies as well as the related work. ",
    "url": "https://arxiv.org/abs/2212.13974",
    "authors": [
      "Hichem Sahbi",
      "Sebastien Deschamps"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.13979",
    "title": "TiG-BEV: Multi-view BEV 3D Object Detection via Target Inner-Geometry  Learning",
    "abstract": "To achieve accurate and low-cost 3D object detection, existing methods propose to benefit camera-based multi-view detectors with spatial cues provided by the LiDAR modality, e.g., dense depth supervision and bird-eye-view (BEV) feature distillation. However, they directly conduct point-to-point mimicking from LiDAR to camera, which neglects the inner-geometry of foreground targets and suffers from the modal gap between 2D-3D features. In this paper, we propose the learning scheme of Target Inner-Geometry from the LiDAR modality into camera-based BEV detectors for both dense depth and BEV features, termed as TiG-BEV. First, we introduce an inner-depth supervision module to learn the low-level relative depth relations between different foreground pixels. This enables the camera-based detector to better understand the object-wise spatial structures. Second, we design an inner-feature BEV distillation module to imitate the high-level semantics of different keypoints within foreground targets. To further alleviate the BEV feature gap between two modalities, we adopt both inter-channel and inter-keypoint distillation for feature-similarity modeling. With our target inner-geometry distillation, TiG-BEV can effectively boost BEVDepth by +2.3% NDS and +2.4% mAP, along with BEVDet by +9.1% NDS and +10.3% mAP on nuScenes val set. Code will be available at https://github.com/ADLab3Ds/TiG-BEV. ",
    "url": "https://arxiv.org/abs/2212.13979",
    "authors": [
      "Peixiang Huang",
      "Li Liu",
      "Renrui Zhang",
      "Song Zhang",
      "Xinli Xu",
      "Baichao Wang",
      "Guoyi Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.13989",
    "title": "AdvCat: Domain-Agnostic Robustness Assessment for Cybersecurity-Critical  Applications with Categorical Inputs",
    "abstract": "Machine Learning-as-a-Service systems (MLaaS) have been largely developed for cybersecurity-critical applications, such as detecting network intrusions and fake news campaigns. Despite effectiveness, their robustness against adversarial attacks is one of the key trust concerns for MLaaS deployment. We are thus motivated to assess the adversarial robustness of the Machine Learning models residing at the core of these security-critical applications with categorical inputs. Previous research efforts on accessing model robustness against manipulation of categorical inputs are specific to use cases and heavily depend on domain knowledge, or require white-box access to the target ML model. Such limitations prevent the robustness assessment from being as a domain-agnostic service provided to various real-world applications. We propose a provably optimal yet computationally highly efficient adversarial robustness assessment protocol for a wide band of ML-driven cybersecurity-critical applications. We demonstrate the use of the domain-agnostic robustness assessment method with substantial experimental study on fake news detection and intrusion detection problems. ",
    "url": "https://arxiv.org/abs/2212.13989",
    "authors": [
      "Helene Orsini",
      "Hongyan Bao",
      "Yujun Zhou",
      "Xiangrui Xu",
      "Yufei Han",
      "Longyang Yi",
      "Wei Wang",
      "Xin Gao",
      "Xiangliang Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13991",
    "title": "Detection, Explanation and Filtering of Cyber Attacks Combining Symbolic  and Sub-Symbolic Methods",
    "abstract": "Machine learning (ML) on graph-structured data has recently received deepened interest in the context of intrusion detection in the cybersecurity domain. Due to the increasing amounts of data generated by monitoring tools as well as more and more sophisticated attacks, these ML methods are gaining traction. Knowledge graphs and their corresponding learning techniques such as Graph Neural Networks (GNNs) with their ability to seamlessly integrate data from multiple domains using human-understandable vocabularies, are finding application in the cybersecurity domain. However, similar to other connectionist models, GNNs are lacking transparency in their decision making. This is especially important as there tend to be a high number of false positive alerts in the cybersecurity domain, such that triage needs to be done by domain experts, requiring a lot of man power. Therefore, we are addressing Explainable AI (XAI) for GNNs to enhance trust management by exploring combining symbolic and sub-symbolic methods in the area of cybersecurity that incorporate domain knowledge. We experimented with this approach by generating explanations in an industrial demonstrator system. The proposed method is shown to produce intuitive explanations for alerts for a diverse range of scenarios. Not only do the explanations provide deeper insights into the alerts, but they also lead to a reduction of false positive alerts by 66% and by 93% when including the fidelity metric. ",
    "url": "https://arxiv.org/abs/2212.13991",
    "authors": [
      "Anna Himmelhuber",
      "Dominik Dold",
      "Stephan Grimm",
      "Sonja Zillner",
      "Thomas Runkler"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13992",
    "title": "Social-Aware Clustered Federated Learning with Customized Privacy  Preservation",
    "abstract": "A key feature of federated learning (FL) is to preserve the data privacy of end users. However, there still exist potential privacy leakage in exchanging gradients under FL. As a result, recent research often explores the differential privacy (DP) approaches to add noises to the computing results to address privacy concerns with low overheads, which however degrade the model performance. In this paper, we strike the balance of data privacy and efficiency by utilizing the pervasive social connections between users. Specifically, we propose SCFL, a novel Social-aware Clustered Federated Learning scheme, where mutually trusted individuals can freely form a social cluster and aggregate their raw model updates (e.g., gradients) inside each cluster before uploading to the cloud for global aggregation. By mixing model updates in a social group, adversaries can only eavesdrop the social-layer combined results, but not the privacy of individuals. We unfold the design of SCFL in three steps. \\emph{i) Stable social cluster formation. Considering users' heterogeneous training samples and data distributions, we formulate the optimal social cluster formation problem as a federation game and devise a fair revenue allocation mechanism to resist free-riders. ii) Differentiated trust-privacy mapping}. For the clusters with low mutual trust, we design a customizable privacy preservation mechanism to adaptively sanitize participants' model updates depending on social trust degrees. iii) Distributed convergence}. A distributed two-sided matching algorithm is devised to attain an optimized disjoint partition with Nash-stable convergence. Experiments on Facebook network and MNIST/CIFAR-10 datasets validate that our SCFL can effectively enhance learning utility, improve user payoff, and enforce customizable privacy protection. ",
    "url": "https://arxiv.org/abs/2212.13992",
    "authors": [
      "Yuntao Wang",
      "Zhou Su",
      "Yanghe Pan",
      "Tom H Luan",
      "Ruidong Li",
      "Shui Yu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13994",
    "title": "Investigation and rectification of NIDS datasets and standratized  feature set derivation for network attack detection with graph neural  networks",
    "abstract": "Network Intrusion and Detection Systems (NIDS) are essential for malicious traffic and cyberattack detection in modern networks. Artificial intelligence-based NIDS are powerful tools that can learn complex data correlations for accurate attack prediction. Graph Neural Networks (GNNs) provide an opportunity to analyze network topology along with flow features which makes them particularly suitable for NIDS applications. However, successful application of such tool requires large amounts of carefully collected and labeled data for training and testing. In this paper we inspect different versions of ToN-IoT dataset and point out inconsistencies in some versions. We filter the full version of ToN-IoT and present a new version labeled ToN-IoT-R. To ensure generalization we propose a new standardized and compact set of flow features which are derived solely from NetFlowv5-compatible data. We separate numeric data and flags into different categories and propose a new dataset-agnostic normalization approach for numeric features. This allows us to preserve meaning of flow flags and we propose to conduct targeted analysis based on, for instance, network protocols. For flow classification we use E-GraphSage algorithm with modified node initialization technique that allows us to add node degree to node features. We achieve high classification accuracy on ToN-IoT-R and compare it with previously published results for ToN-IoT, NF-ToN-IoT, and NF-ToN-IoT-v2. We highlight the importance of careful data collection and labeling and appropriate data preprocessing choice and conclude that the proposed set of features is more applicable for real NIDS due to being less demanding to traffic monitoring equipment while preserving high flow classification accuracy. ",
    "url": "https://arxiv.org/abs/2212.13994",
    "authors": [
      "Anton Raskovalov",
      "Nikita Gabdullin",
      "Vasily Dolmatov"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Discrete Mathematics (cs.DM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14012",
    "title": "Characteristics-Informed Neural Networks for Forward and Inverse  Hyperbolic Problems",
    "abstract": "We propose characteristic-informed neural networks (CINN), a simple and efficient machine learning approach for solving forward and inverse problems involving hyperbolic PDEs. Like physics-informed neural networks (PINN), CINN is a meshless machine learning solver with universal approximation capabilities. Unlike PINN, which enforces a PDE softly via a multi-part loss function, CINN encodes the characteristics of the PDE in a general-purpose deep neural network trained with the usual MSE data-fitting regression loss and standard deep learning optimization methods. This leads to faster training and can avoid well-known pathologies of gradient descent optimization of multi-part PINN loss functions. If the characteristic ODEs can be solved exactly, which is true in important cases, the output of a CINN is an exact solution of the PDE, even at initialization, preventing the occurrence of non-physical outputs. Otherwise, the ODEs must be solved approximately, but the CINN is still trained only using a data-fitting loss function. The performance of CINN is assessed empirically in forward and inverse linear hyperbolic problems. These preliminary results indicate that CINN is able to improve on the accuracy of the baseline PINN, while being nearly twice as fast to train and avoiding non-physical solutions. Future extensions to hyperbolic PDE systems and nonlinear PDEs are also briefly discussed. ",
    "url": "https://arxiv.org/abs/2212.14012",
    "authors": [
      "Ulisses Braga-Neto"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2212.14033",
    "title": "How Do Deepfakes Move? Motion Magnification for Deepfake Source  Detection",
    "abstract": "With the proliferation of deep generative models, deepfakes are improving in quality and quantity everyday. However, there are subtle authenticity signals in pristine videos, not replicated by SOTA GANs. We contrast the movement in deepfakes and authentic videos by motion magnification towards building a generalized deepfake source detector. The sub-muscular motion in faces has different interpretations per different generative models which is reflected in their generative residue. Our approach exploits the difference between real motion and the amplified GAN fingerprints, by combining deep and traditional motion magnification, to detect whether a video is fake and its source generator if so. Evaluating our approach on two multi-source datasets, we obtain 97.17% and 94.03% for video source detection. We compare against the prior deepfake source detector and other complex architectures. We also analyze the importance of magnification amount, phase extraction window, backbone network architecture, sample counts, and sample lengths. Finally, we report our results for different skin tones to assess the bias. ",
    "url": "https://arxiv.org/abs/2212.14033",
    "authors": [
      "Umur Aybars Ciftci",
      "Ilke Demir"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.13285",
    "title": "On the Level Sets and Invariance of Neural Tuning Landscapes",
    "abstract": "Visual representations can be defined as the activations of neuronal populations in response to images. The activation of a neuron as a function over all image space has been described as a \"tuning landscape\". As a function over a high-dimensional space, what is the structure of this landscape? In this study, we characterize tuning landscapes through the lens of level sets and Morse theory. A recent study measured the in vivo two-dimensional tuning maps of neurons in different brain regions. Here, we developed a statistically reliable signature for these maps based on the change of topology in level sets. We found this topological signature changed progressively throughout the cortical hierarchy, with similar trends found for units in convolutional neural networks (CNNs). Further, we analyzed the geometry of level sets on the tuning landscapes of CNN units. We advanced the hypothesis that higher-order units can be locally regarded as isotropic radial basis functions, but not globally. This shows the power of level sets as a conceptual tool to understand neuronal activations over image space. ",
    "url": "https://arxiv.org/abs/2212.13285",
    "authors": [
      "Binxu Wang",
      "Carlos R. Ponce"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Computational Geometry (cs.CG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2212.13375",
    "title": "Power Quality Event Recognition and Classification Using an Online  Sequential Extreme Learning Machine Network based on Wavelets",
    "abstract": "Reduced system dependability and higher maintenance costs may be the consequence of poor electric power quality, which can disturb normal equipment performance, speed up aging, and even cause outright failures. This study implements and tests a prototype of an Online Sequential Extreme Learning Machine (OS-ELM) classifier based on wavelets for detecting power quality problems under transient conditions. In order to create the classifier, the OSELM-network model and the discrete wavelet transform (DWT) method are combined. First, discrete wavelet transform (DWT) multi-resolution analysis (MRA) was used to extract characteristics of the distorted signal at various resolutions. The OSELM then sorts the retrieved data by transient duration and energy features to determine the kind of disturbance. The suggested approach requires less memory space and processing time since it can minimize a large quantity of the distorted signal's characteristics without changing the signal's original quality. Several types of transient events were used to demonstrate the classifier's ability to detect and categorize various types of power disturbances, including sags, swells, momentary interruptions, oscillatory transients, harmonics, notches, spikes, flickers, sag swell, sag mi, sag harm, swell trans, sag spike, and swell spike. ",
    "url": "https://arxiv.org/abs/2212.13375",
    "authors": [
      "Rahul Kumar Dubey"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13523",
    "title": "S2S-WTV: Seismic Data Noise Attenuation Using Weighted Total Variation  Regularized Self-Supervised Learning",
    "abstract": "Seismic data often undergoes severe noise due to environmental factors, which seriously affects subsequent applications. Traditional hand-crafted denoisers such as filters and regularizations utilize interpretable domain knowledge to design generalizable denoising techniques, while their representation capacities may be inferior to deep learning denoisers, which can learn complex and representative denoising mappings from abundant training pairs. However, due to the scarcity of high-quality training pairs, deep learning denoisers may sustain some generalization issues over various scenarios. In this work, we propose a self-supervised method that combines the capacities of deep denoiser and the generalization abilities of hand-crafted regularization for seismic data random noise attenuation. Specifically, we leverage the Self2Self (S2S) learning framework with a trace-wise masking strategy for seismic data denoising by solely using the observed noisy data. Parallelly, we suggest the weighted total variation (WTV) to further capture the horizontal local smooth structure of seismic data. Our method, dubbed as S2S-WTV, enjoys both high representation abilities brought from the self-supervised deep network and good generalization abilities of the hand-crafted WTV regularizer and the self-supervised nature. Therefore, our method can more effectively and stably remove the random noise and preserve the details and edges of the clean signal. To tackle the S2S-WTV optimization model, we introduce an alternating direction multiplier method (ADMM)-based algorithm. Extensive experiments on synthetic and field noisy seismic data demonstrate the effectiveness of our method as compared with state-of-the-art traditional and deep learning-based seismic data denoising methods. ",
    "url": "https://arxiv.org/abs/2212.13523",
    "authors": [
      "Zitai Xu",
      "Yisi Luo",
      "Bangyu Wu",
      "Deyu Meng"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13578",
    "title": "Optimal radio labelings of graphs",
    "abstract": "Let $\\mathbb{N}$ be the set of positive integers. A radio labeling of a graph $G$ is a mapping $\\varphi : V(G) \\rightarrow \\mathbb{N} \\cup \\{0\\}$ such that the inequality $|\\varphi(u)-\\varphi(v)| \\geq diam(G) + 1 - d(u,v)$ holds for every pair of distinct vertices $u,v$ of $G$, where $diam(G)$ and $d(u,v)$ are the diameter of $G$ and distance between $u$ and $v$ in $G$, respectively. The radio number $rn(G)$ of $G$ is the smallest number $k$ such that $G$ has radio labeling $\\varphi$ with $\\max\\{\\varphi(v) : v \\in V(G)\\}$ = $k$. Das et al. [Discrete Math. $\\mathbf{340}$(2017) 855-861] gave a technique to find a lower bound for the radio number of graphs. In [Algorithms and Discrete Applied Mathematics: CALDAM 2019, Lecture Notes in Computer Science $\\mathbf{11394}$, springer, Cham, 2019, 161-173], Bantva modified this technique for finding an improved lower bound on the radio number of graphs and gave a necessary and sufficient condition to achieve the improved lower bound. In this paper, one more useful necessary and sufficient condition to achieve the improved lower bound for the radio number of graphs is given. Using this result, the radio number of the Cartesian product of a path and a wheel graphs is determined. ",
    "url": "https://arxiv.org/abs/2212.13578",
    "authors": [
      "Devsi Bantva"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2212.13621",
    "title": "Annealing Double-Head: An Architecture for Online Calibration of Deep  Neural Networks",
    "abstract": "Model calibration, which is concerned with how frequently the model predicts correctly, not only plays a vital part in statistical model design, but also has substantial practical applications, such as optimal decision-making in the real world. However, it has been discovered that modern deep neural networks are generally poorly calibrated due to the overestimation (or underestimation) of predictive confidence, which is closely related to overfitting. In this paper, we propose Annealing Double-Head, a simple-to-implement but highly effective architecture for calibrating the DNN during training. To be precise, we construct an additional calibration head-a shallow neural network that typically has one latent layer-on top of the last latent layer in the normal model to map the logits to the aligned confidence. Furthermore, a simple Annealing technique that dynamically scales the logits by calibration head in training procedure is developed to improve its performance. Under both the in-distribution and distributional shift circumstances, we exhaustively evaluate our Annealing Double-Head architecture on multiple pairs of contemporary DNN architectures and vision and speech datasets. We demonstrate that our method achieves state-of-the-art model calibration performance without post-processing while simultaneously providing comparable predictive accuracy in comparison to other recently proposed calibration methods on a range of learning tasks. ",
    "url": "https://arxiv.org/abs/2212.13621",
    "authors": [
      "Erdong Guo",
      "David Draper",
      "Maria De Iorio"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13715",
    "title": "MyI-Net: Fully Automatic Detection and Quantification of Myocardial  Infarction from Cardiovascular MRI Images",
    "abstract": "A \"heart attack\" or myocardial infarction (MI), occurs when an artery supplying blood to the heart is abruptly occluded. The \"gold standard\" method for imaging MI is Cardiovascular Magnetic Resonance Imaging (MRI), with intravenously administered gadolinium-based contrast (late gadolinium enhancement). However, no \"gold standard\" fully automated method for the quantification of MI exists. In this work, we propose an end-to-end fully automatic system (MyI-Net) for the detection and quantification of MI in MRI images. This has the potential to reduce the uncertainty due to the technical variability across labs and inherent problems of the data and labels. Our system consists of four processing stages designed to maintain the flow of information across scales. First, features from raw MRI images are generated using feature extractors built on ResNet and MoblieNet architectures. This is followed by the Atrous Spatial Pyramid Pooling (ASPP) to produce spatial information at different scales to preserve more image context. High-level features from ASPP and initial low-level features are concatenated at the third stage and then passed to the fourth stage where spatial information is recovered via up-sampling to produce final image segmentation output into: i) background, ii) heart muscle, iii) blood and iv) scar areas. New models were compared with state-of-art models and manual quantification. Our models showed favorable performance in global segmentation and scar tissue detection relative to state-of-the-art work, including a four-fold better performance in matching scar pixels to contours produced by clinicians. ",
    "url": "https://arxiv.org/abs/2212.13715",
    "authors": [
      "Shuihua Wang",
      "Ahmed M.S.E.K Abdelaty",
      "Kelly Parke",
      "J Ranjit Arnold",
      "Gerry P McCann",
      "Ivan Y Tyukin"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13788",
    "title": "Explainable and Lightweight Model for COVID-19 Detection Using Chest  Radiology Images",
    "abstract": "Deep learning (DL) analysis of Chest X-ray (CXR) and Computed tomography (CT) images has garnered a lot of attention in recent times due to the COVID-19 pandemic. Convolutional Neural Networks (CNNs) are well suited for the image analysis tasks when trained on humongous amounts of data. Applications developed for medical image analysis require high sensitivity and precision compared to any other fields. Most of the tools proposed for detection of COVID-19 claims to have high sensitivity and recalls but have failed to generalize and perform when tested on unseen datasets. This encouraged us to develop a CNN model, analyze and understand the performance of it by visualizing the predictions of the model using class activation maps generated using (Gradient-weighted Class Activation Mapping) Grad-CAM technique. This study provides a detailed discussion of the success and failure of the proposed model at an image level. Performance of the model is compared with state-of-the-art DL models and shown to be comparable. The data and code used are available at https://github.com/aleesuss/c19. ",
    "url": "https://arxiv.org/abs/2212.13788",
    "authors": [
      "Suba S",
      "Nita Parekh"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13887",
    "title": "Calibration-Free Driver Drowsiness Classification based on  Manifold-Level Augmentation",
    "abstract": "Drowsiness reduces concentration and increases response time, which causes fatal road accidents. Monitoring drivers' drowsiness levels by electroencephalogram (EEG) and taking action may prevent road accidents. EEG signals effectively monitor the driver's mental state as they can monitor brain dynamics. However, calibration is required in advance because EEG signals vary between and within subjects. Because of the inconvenience, calibration has reduced the accessibility of the brain-computer interface (BCI). Developing a generalized classification model is similar to domain generalization, which overcomes the domain shift problem. Especially data augmentation is frequently used. This paper proposes a calibration-free framework for driver drowsiness state classification using manifold-level augmentation. This framework increases the diversity of source domains by utilizing features. We experimented with various augmentation methods to improve the generalization performance. Based on the results of the experiments, we found that deeper models with smaller kernel sizes improved generalizability. In addition, applying an augmentation at the manifold-level resulted in an outstanding improvement. The framework demonstrated the capability for calibration-free BCI. ",
    "url": "https://arxiv.org/abs/2212.13887",
    "authors": [
      "Dong-Young Kim",
      "Dong-Kyun Han",
      "Hye-Bin Shin"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.13905",
    "title": "Tool flank wear prediction using high-frequency machine data from  industrial edge device",
    "abstract": "Tool flank wear monitoring can minimize machining downtime costs while increasing productivity and product quality. In some industrial applications, only a limited level of tool wear is allowed to attain necessary tolerances. It may become challenging to monitor a limited level of tool wear in the data collected from the machine due to the other components, such as the flexible vibrations of the machine, dominating the measurement signals. In this study, a tool wear monitoring technique to predict limited levels of tool wear from the spindle motor current and dynamometer measurements is presented. High-frequency spindle motor current data is collected with an industrial edge device while the cutting forces and torque are measured with a rotary dynamometer in drilling tests for a selected number of holes. Feature engineering is conducted to identify the statistical features of the measurement signals that are most sensitive to small changes in tool wear. A neural network based on the long short-term memory (LSTM) architecture is developed to predict tool flank wear from the measured spindle motor current and dynamometer signals. It is demonstrated that the proposed technique predicts tool flank wear with good accuracy and high computational efficiency. The proposed technique can easily be implemented in an industrial edge device as a real-time predictive maintenance application to minimize the costs due to manufacturing downtime and tool underuse or overuse. ",
    "url": "https://arxiv.org/abs/2212.13905",
    "authors": [
      "D. Bilgili",
      "G. Kecibas",
      "C. Besirova",
      "M. R. Chehrehzad",
      "G. Burun",
      "T. Pehlivan",
      "U. Uresin",
      "E. Emekli",
      "I. Lazoglu"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.13919",
    "title": "Siamese Sleep Transformer For Robust Sleep Stage Scoring With  Self-knowledge Distillation and Selective Batch Sampling",
    "abstract": "In this paper, we propose a Siamese sleep transformer (SST) that effectively extracts features from single-channel raw electroencephalogram signals for robust sleep stage scoring. Despite the significant advances in sleep stage scoring in the last few years, most of them mainly focused on the increment of model performance. However, other problems still exist: the bias of labels in datasets and the instability of model performance by repetitive training. To alleviate these problems, we propose the SST, a novel sleep stage scoring model with a selective batch sampling strategy and self-knowledge distillation. To evaluate how robust the model was to the bias of labels, we used different datasets for training and testing: the sleep heart health study and the Sleep-EDF datasets. In this condition, the SST showed competitive performance in sleep stage scoring. In addition, we demonstrated the effectiveness of the selective batch sampling strategy with a reduction of the standard deviation of performance by repetitive training. These results could show that SST extracted effective learning features against the bias of labels in datasets, and the selective batch sampling strategy worked for the model robustness in training. ",
    "url": "https://arxiv.org/abs/2212.13919",
    "authors": [
      "Heon-Gyu Kwak",
      "Young-Seok Kweon",
      "Gi-Hwan Shin"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.14006",
    "title": "Anxolotl, an Anxiety Companion App -- Stress Detection",
    "abstract": "Stress has a great effect on people's lives that can not be understated. While it can be good, since it helps humans to adapt to new and different situations, it can also be harmful when not dealt with properly, leading to chronic stress. The objective of this paper is developing a stress monitoring solution, that can be used in real life, while being able to tackle this challenge in a positive way. The SMILE data set was provided to team Anxolotl, and all it was needed was to develop a robust model. We developed a supervised learning model for classification in Python, presenting the final result of 64.1% in accuracy and a f1-score of 54.96%. The resulting solution stood the robustness test, presenting low variation between runs, which was a major point for it's possible integration in the Anxolotl app in the future. ",
    "url": "https://arxiv.org/abs/2212.14006",
    "authors": [
      "Nuno Gomes",
      "Matilde Pato",
      "Pedro Santos",
      "André Lourenço",
      "Lourenço Rodrigues"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1811.02309",
    "title": "An Enhanced Multi-Objective Biogeography-Based Optimization for  Overlapping Community Detection in Social Networks with Node Attributes",
    "abstract": " Comments: 1. This paper has been published in the journal of \"Information Sciences\". 2. this https URL ",
    "url": "https://arxiv.org/abs/1811.02309",
    "authors": [
      "Ali Reihanian",
      "Mohammad-Reza Feizi-Derakhshi",
      "Hadi S. Aghdasi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:1811.09831",
    "title": "Attention, Please! Adversarial Defense via Activation Rectification and  Preservation",
    "abstract": " Title: Attention, Please! Adversarial Defense via Activation Rectification and  Preservation ",
    "url": "https://arxiv.org/abs/1811.09831",
    "authors": [
      "Shangxi Wu",
      "Jitao Sang",
      "Kaiyuan Xu",
      "Jiaming Zhang",
      "Yanfeng Sun",
      "Liping Jing",
      "Jian Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2003.00982",
    "title": "Benchmarking Graph Neural Networks",
    "abstract": " Comments: Benchmarking framework on GitHub at this https URL ",
    "url": "https://arxiv.org/abs/2003.00982",
    "authors": [
      "Vijay Prakash Dwivedi",
      "Chaitanya K. Joshi",
      "Anh Tuan Luu",
      "Thomas Laurent",
      "Yoshua Bengio",
      "Xavier Bresson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2008.01701",
    "title": "Progressive Update Guided Interdependent Networks for Single Image  Dehazing",
    "abstract": " Comments: First two authors contributed equally. This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible. Project Website: this https URL ",
    "url": "https://arxiv.org/abs/2008.01701",
    "authors": [
      "Aupendu Kar",
      "Sobhan Kanti Dhara",
      "Debashis Sen",
      "Prabir Kumar Biswas"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2012.06568",
    "title": "Learning Energy-Based Models With Adversarial Training",
    "abstract": " Comments: ECCV2022, code is available at this https URL ",
    "url": "https://arxiv.org/abs/2012.06568",
    "authors": [
      "Xuwang Yin",
      "Shiying Li",
      "Gustavo K. Rohde"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2103.03319",
    "title": "Self-supervised 3D Representation Learning of Dressed Humans from Social  Media Videos",
    "abstract": " Title: Self-supervised 3D Representation Learning of Dressed Humans from Social  Media Videos ",
    "url": "https://arxiv.org/abs/2103.03319",
    "authors": [
      "Yasamin Jafarian",
      "Hyun Soo Park"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2103.07598",
    "title": "Internal Wasserstein Distance for Adversarial Attack and Defense",
    "abstract": " Comments: Due to the need for major revisions to the submitted manuscript, we request to withdraw this manuscript from arXiv ",
    "url": "https://arxiv.org/abs/2103.07598",
    "authors": [
      "Mingkui Tan",
      "Shuhai Zhang",
      "Jiezhang Cao",
      "Jincheng Li",
      "Yanwu Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2104.03602",
    "title": "SiT: Self-supervised vIsion Transformer",
    "abstract": " Title: SiT: Self-supervised vIsion Transformer ",
    "url": "https://arxiv.org/abs/2104.03602",
    "authors": [
      "Sara Atito",
      "Muhammad Awais",
      "Josef Kittler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.07106",
    "title": "Alignment and Comparison of Directed Networks via Transition Couplings  of Random Walks",
    "abstract": " Title: Alignment and Comparison of Directed Networks via Transition Couplings  of Random Walks ",
    "url": "https://arxiv.org/abs/2106.07106",
    "authors": [
      "Bongsoo Yi",
      "Kevin O'Connor",
      "Kevin McGoff",
      "Andrew B. Nobel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.11732",
    "title": "Federated Causal Inference in Heterogeneous Observational Data",
    "abstract": " Title: Federated Causal Inference in Heterogeneous Observational Data ",
    "url": "https://arxiv.org/abs/2107.11732",
    "authors": [
      "Ruoxuan Xiong",
      "Allison Koenecke",
      "Michael Powell",
      "Zhu Shen",
      "Joshua T. Vogelstein",
      "Susan Athey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Econometrics (econ.EM)",
      "Quantitative Methods (q-bio.QM)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2109.02473",
    "title": "A Robust Cybersecurity Topic Classification Tool",
    "abstract": " Comments: Improved formatting ",
    "url": "https://arxiv.org/abs/2109.02473",
    "authors": [
      "Elijah Pelofske",
      "Lorie M. Liebrock",
      "Vincent Urias"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.10447",
    "title": "DyFormer: A Scalable Dynamic Graph Transformer with Provable Benefits on  Generalization Ability",
    "abstract": " Title: DyFormer: A Scalable Dynamic Graph Transformer with Provable Benefits on  Generalization Ability ",
    "url": "https://arxiv.org/abs/2111.10447",
    "authors": [
      "Weilin Cong",
      "Yanhong Wu",
      "Yuandong Tian",
      "Mengting Gu",
      "Yinglong Xia",
      "Chun-cheng Jason Chen",
      "Mehrdad Mahdavi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.01102",
    "title": "Towards Transferable Unrestricted Adversarial Examples with Minimum  Changes",
    "abstract": " Comments: Accepted at SaTML 2023 ",
    "url": "https://arxiv.org/abs/2201.01102",
    "authors": [
      "Fangcheng Liu",
      "Chao Zhang",
      "Hongyang Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.06312",
    "title": "Progressive Backdoor Erasing via connecting Backdoor and Adversarial  Attacks",
    "abstract": " Title: Progressive Backdoor Erasing via connecting Backdoor and Adversarial  Attacks ",
    "url": "https://arxiv.org/abs/2202.06312",
    "authors": [
      "Bingxu Mu",
      "Zhenxing Niu",
      "Le Wang",
      "Xue Wang",
      "Rong Jin",
      "Gang Hua"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.02525",
    "title": "Mars: Near-Optimal Throughput with Shallow Buffers in Reconfigurable  Datacenter Networks",
    "abstract": " Title: Mars: Near-Optimal Throughput with Shallow Buffers in Reconfigurable  Datacenter Networks ",
    "url": "https://arxiv.org/abs/2204.02525",
    "authors": [
      "Vamsi Addanki",
      "Chen Avin",
      "Stefan Schmid"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2204.11307",
    "title": "A Comprehensive Test Pattern Generation Approach Exploiting SAT Attack  for Logic Locking",
    "abstract": " Comments: 12 pages, 7 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2204.11307",
    "authors": [
      "Yadi Zhong",
      "Ujjwal Guin"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.11023",
    "title": "AdaptivePaste: Code Adaptation through Learning Semantics-aware Variable  Usage Representations",
    "abstract": " Title: AdaptivePaste: Code Adaptation through Learning Semantics-aware Variable  Usage Representations ",
    "url": "https://arxiv.org/abs/2205.11023",
    "authors": [
      "Xiaoyu Liu",
      "Jinu Jang",
      "Neel Sundaresan",
      "Miltiadis Allamanis",
      "Alexey Svyatkovskiy"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2206.00873",
    "title": "Nearly Optimal Best-of-Both-Worlds Algorithms for Online Learning with  Feedback Graphs",
    "abstract": " Comments: Accepted at NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2206.00873",
    "authors": [
      "Shinji Ito",
      "Taira Tsuchiya",
      "Junya Honda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.02016",
    "title": "Is $L^2$ Physics-Informed Loss Always Suitable for Training  Physics-Informed Neural Network?",
    "abstract": " Title: Is $L^2$ Physics-Informed Loss Always Suitable for Training  Physics-Informed Neural Network? ",
    "url": "https://arxiv.org/abs/2206.02016",
    "authors": [
      "Chuwei Wang",
      "Shanda Li",
      "Di He",
      "Liwei Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2206.04685",
    "title": "Predictive Exit: Prediction of Fine-Grained Early Exits for Computation-  and Energy-Efficient Inference",
    "abstract": " Title: Predictive Exit: Prediction of Fine-Grained Early Exits for Computation-  and Energy-Efficient Inference ",
    "url": "https://arxiv.org/abs/2206.04685",
    "authors": [
      "Xiangjie Li",
      "Chenfei Lou",
      "Zhengping Zhu",
      "Yuchi Chen",
      "Yingtao Shen",
      "Yehan Ma",
      "An Zou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2206.09215",
    "title": "Mind the Gap: Norm-Aware Adaptive Robust Loss for Multivariate  Least-Squares Problems",
    "abstract": " Comments: 8 pages, 4 figures. This paper has been accepted for publication in IEEE Robotics and Automation Letters. V2: Update weighting in (13), (28) and re-run results. Hypothesis, methodology, and general findings remain unchanged. Update Sec. II-A to reference IRLS, and update citation [11] accordingly. Include acknowledgement to Mitchell Cohen ",
    "url": "https://arxiv.org/abs/2206.09215",
    "authors": [
      "Thomas Hitchcox",
      "James Richard Forbes"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2206.12592",
    "title": "Asymmetric Transfer Hashing with Adaptive Bipartite Graph Learning",
    "abstract": " Title: Asymmetric Transfer Hashing with Adaptive Bipartite Graph Learning ",
    "url": "https://arxiv.org/abs/2206.12592",
    "authors": [
      "Jianglin Lu",
      "Jie Zhou",
      "Yudong Chen",
      "Witold Pedrycz",
      "Kwok-Wai Hung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.00419",
    "title": "Self-Supervised Learning for Videos: A Survey",
    "abstract": " Comments: Just Accepted ",
    "url": "https://arxiv.org/abs/2207.00419",
    "authors": [
      "Madeline C. Schiappa",
      "Yogesh S. Rawat",
      "Mubarak Shah"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2207.09081",
    "title": "Generalizing Goal-Conditioned Reinforcement Learning with Variational  Causal Reasoning",
    "abstract": " Comments: Accepted to NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2207.09081",
    "authors": [
      "Wenhao Ding",
      "Haohong Lin",
      "Bo Li",
      "Ding Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2207.13243",
    "title": "Toward Transparent AI: A Survey on Interpreting the Inner Structures of  Deep Neural Networks",
    "abstract": " Title: Toward Transparent AI: A Survey on Interpreting the Inner Structures of  Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2207.13243",
    "authors": [
      "Tilman Räuker",
      "Anson Ho",
      "Stephen Casper",
      "Dylan Hadfield-Menell"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.01684",
    "title": "On the Risks of Collecting Multidimensional Data Under Local  Differential Privacy",
    "abstract": " Comments: Accepted at VLDB 2023 ",
    "url": "https://arxiv.org/abs/2209.01684",
    "authors": [
      "Héber H. Arcolezi",
      "Sébastien Gambs",
      "Jean-François Couchot",
      "Catuscia Palamidessi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2209.12888",
    "title": "Weighted Age of Information based Scheduling for Large Population Games  on Networks",
    "abstract": " Comments: This work has been submitted to IEEE for possible publication ",
    "url": "https://arxiv.org/abs/2209.12888",
    "authors": [
      "Shubham Aggarwal",
      "Muhammad Aneeq uz Zaman",
      "Melih Bastopcu",
      "Tamer Başar"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2209.15148",
    "title": "Embedded System Performance Analysis for Implementing a Portable  Drowsiness Detection System for Drivers",
    "abstract": " Comments: 26 pages, 13 figures, 4 tables ",
    "url": "https://arxiv.org/abs/2209.15148",
    "authors": [
      "Minjeong Kim",
      "Jimin Koo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2210.03526",
    "title": "A Unified Hard-Constraint Framework for Solving Geometrically Complex  PDEs",
    "abstract": " Comments: 10 pages, 6 figures, NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2210.03526",
    "authors": [
      "Songming Liu",
      "Zhongkai Hao",
      "Chengyang Ying",
      "Hang Su",
      "Jun Zhu",
      "Ze Cheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.03745",
    "title": "ProGReST: Prototypical Graph Regression Soft Trees for Molecular  Property Prediction",
    "abstract": " Comments: Accepted to SDM2023 ",
    "url": "https://arxiv.org/abs/2210.03745",
    "authors": [
      "Dawid Rymarczyk",
      "Daniel Dobrowolski",
      "Tomasz Danel"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.04699",
    "title": "FedBA: Non-IID Federated Learning Framework in UAV Networks",
    "abstract": " Title: FedBA: Non-IID Federated Learning Framework in UAV Networks ",
    "url": "https://arxiv.org/abs/2210.04699",
    "authors": [
      "Pei Li",
      "Zhijun Liu",
      "Luyi Chang",
      "Jialiang Peng",
      "Yi Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.08189",
    "title": "Parameter-free Dynamic Graph Embedding for Link Prediction",
    "abstract": " Comments: 19 pages, 9 figures, 13 tables, Thirty-Sixth Conference on Neural Information Processing Systems (NeurIPS 2022), preprint version ",
    "url": "https://arxiv.org/abs/2210.08189",
    "authors": [
      "Jiahao Liu",
      "Dongsheng Li",
      "Hansu Gu",
      "Tun Lu",
      "Peng Zhang",
      "Ning Gu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2210.10260",
    "title": "End-to-End Entity Detection with Proposer and Regressor",
    "abstract": " Title: End-to-End Entity Detection with Proposer and Regressor ",
    "url": "https://arxiv.org/abs/2210.10260",
    "authors": [
      "Xueru Wen",
      "Changjiang Zhou",
      "Haotian Tang",
      "Luguang Liang",
      "Yu Jiang",
      "Hong Qi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.12941",
    "title": "Unsupervised Graph Outlier Detection: Problem Revisit, New Insight, and  Superior Method",
    "abstract": " Title: Unsupervised Graph Outlier Detection: Problem Revisit, New Insight, and  Superior Method ",
    "url": "https://arxiv.org/abs/2210.12941",
    "authors": [
      "Yihong Huang",
      "Liping Wang",
      "Fan Zhang",
      "Xuemin Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.16525",
    "title": "Spectral Representation Learning for Conditional Moment Models",
    "abstract": " Title: Spectral Representation Learning for Conditional Moment Models ",
    "url": "https://arxiv.org/abs/2210.16525",
    "authors": [
      "Ziyu Wang",
      "Yucen Luo",
      "Yueru Li",
      "Jun Zhu",
      "Bernhard Schölkopf"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Econometrics (econ.EM)"
    ]
  },
  {
    "id": "arXiv:2211.00495",
    "title": "Efficient Graph Neural Network Inference at Large Scale",
    "abstract": " Title: Efficient Graph Neural Network Inference at Large Scale ",
    "url": "https://arxiv.org/abs/2211.00495",
    "authors": [
      "Xinyi Gao",
      "Wentao Zhang",
      "Yingxia Shao",
      "Quoc Viet Hung Nguyen",
      "Bin Cui",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.01902",
    "title": "Martian Ionosphere Electron Density Prediction Using Bagged Trees",
    "abstract": " Comments: The peer-reviewed paper is available at: this https URL ",
    "url": "https://arxiv.org/abs/2211.01902",
    "authors": [
      "Abdollah Masoud Darya",
      "Noora Alameri",
      "Muhammad Mubasshir Shaikh",
      "Ilias Fernini"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.03550",
    "title": "Underwater Image Super-Resolution using Generative Adversarial  Network-based Model",
    "abstract": " Title: Underwater Image Super-Resolution using Generative Adversarial  Network-based Model ",
    "url": "https://arxiv.org/abs/2211.03550",
    "authors": [
      "Alireza Aghelan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2211.08604",
    "title": "PU GNN: Chargeback Fraud Detection in P2E MMORPGs via Graph Attention  Networks with Imbalanced PU Labels",
    "abstract": " Comments: Under Review, Industry Track (version 03) ",
    "url": "https://arxiv.org/abs/2211.08604",
    "authors": [
      "Jiho Choi",
      "Junghoon Park",
      "Woocheol Kim",
      "Jin-Hyeok Park",
      "Yumin Suh",
      "Minchang Sung"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2211.13859",
    "title": "DATE: Dual Assignment for End-to-End Fully Convolutional Object  Detection",
    "abstract": " Title: DATE: Dual Assignment for End-to-End Fully Convolutional Object  Detection ",
    "url": "https://arxiv.org/abs/2211.13859",
    "authors": [
      "Yiqun Chen",
      "Qiang Chen",
      "Qinghao Hu",
      "Jian Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.16494",
    "title": "On the Ability of Graph Neural Networks to Model Interactions Between  Vertices",
    "abstract": " Title: On the Ability of Graph Neural Networks to Model Interactions Between  Vertices ",
    "url": "https://arxiv.org/abs/2211.16494",
    "authors": [
      "Noam Razin",
      "Tom Verbin",
      "Nadav Cohen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.00585",
    "title": "Soft Labels for Rapid Satellite Object Detection",
    "abstract": " Comments: 4 Pages, 3 Figures, 2 Tables, 21 References ",
    "url": "https://arxiv.org/abs/2212.00585",
    "authors": [
      "Matthew Ciolino",
      "Grant Rosario",
      "David Noever"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.01880",
    "title": "Deep Learning for Multiscale Damage Analysis via Physics-Informed  Recurrent Neural Network",
    "abstract": " Title: Deep Learning for Multiscale Damage Analysis via Physics-Informed  Recurrent Neural Network ",
    "url": "https://arxiv.org/abs/2212.01880",
    "authors": [
      "Shiguang Deng"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2212.03120",
    "title": "Towards a Better Understanding of the Characteristics of Fractal  Networks",
    "abstract": " Title: Towards a Better Understanding of the Characteristics of Fractal  Networks ",
    "url": "https://arxiv.org/abs/2212.03120",
    "authors": [
      "Enikő Zakar-Polyák",
      "Marcell Nagy",
      "Roland Molontay"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Discrete Mathematics (cs.DM)",
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2212.05546",
    "title": "Associations Between Natural Language Processing (NLP) Enriched Social  Determinants of Health and Suicide Death among US Veterans",
    "abstract": " Comments: Submitted to JAMA Network Open ",
    "url": "https://arxiv.org/abs/2212.05546",
    "authors": [
      "Avijit Mitra",
      "Richeek Pradhan",
      "Rachel D Melamed",
      "Kun Chen",
      "David C Hoaglin",
      "Katherine L Tucker",
      "Joel I Reisman",
      "Zhichao Yang",
      "Weisong Liu",
      "Jack Tsai",
      "Hong Yu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.08448",
    "title": "From Xception to NEXcepTion: New Design Decisions and Neural  Architecture Search",
    "abstract": " Comments: Accepted at ICPRAM 2023 for a 20 minutes oral presentation ",
    "url": "https://arxiv.org/abs/2212.08448",
    "authors": [
      "Hadar Shavit",
      "Filip Jatelnicki",
      "Pol Mor-Puigventós",
      "Wojtek Kowalczyk"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.10788",
    "title": "GraphIX: Graph-based In silico XAI(explainable artificial intelligence)  for drug repositioning from biopharmaceutical network",
    "abstract": " Comments: add supplementary materials ",
    "url": "https://arxiv.org/abs/2212.10788",
    "authors": [
      "Atsuko Takagi",
      "Mayumi Kamada",
      "Eri Hamatani",
      "Ryosuke Kojima",
      "Yasushi Okuno"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2212.12616",
    "title": "Assessing thermal imagery integration into object detection methods on  ground-based and air-based collection platforms",
    "abstract": " Comments: 18 pages, 12 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2212.12616",
    "authors": [
      "James Gallagher",
      "Edward Oughton"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.12656",
    "title": "Efficiently Hardening SGX Enclaves against Memory Access Pattern Attacks  via Dynamic Program Partitioning",
    "abstract": " Title: Efficiently Hardening SGX Enclaves against Memory Access Pattern Attacks  via Dynamic Program Partitioning ",
    "url": "https://arxiv.org/abs/2212.12656",
    "authors": [
      "Yuzhe Tang",
      "Kai Li",
      "Yibo Wang",
      "Jiaqi Chen",
      "Cheng Xu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2212.12691",
    "title": "Multi-duplicated Characterization of Graph Structures using Information  Gain Ratio for Graph Neural Networks",
    "abstract": " Comments: 20pages, 8 figures ",
    "url": "https://arxiv.org/abs/2212.12691",
    "authors": [
      "Yuga Oishi",
      "Ken kaneiwa"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.12700",
    "title": "JDNN: Jacobi Deep Neural Network for Solving Telegraph Equation",
    "abstract": " Title: JDNN: Jacobi Deep Neural Network for Solving Telegraph Equation ",
    "url": "https://arxiv.org/abs/2212.12700",
    "authors": [
      "Maryam Babaei",
      "Kimia Mohammadi Mohammadi",
      "Zeinab Hajimohammadi",
      "Kourosh Parand"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2212.12963",
    "title": "Anomaly Detection of Underwater Gliders Verified by Deployment Data",
    "abstract": " Comments: 10 pages, 16 figures, accepted by the International Symposium on Underwater Technology (UT23) ",
    "url": "https://arxiv.org/abs/2212.12963",
    "authors": [
      "Ruochu Yang",
      "Mengxue Hou",
      "Chad Lembke",
      "Catherine Edwards",
      "Fumin Zhang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2212.12992",
    "title": "Coded Caching Schemes for Two-dimensional Caching-aided Ultra-Dense  Networks",
    "abstract": " Comments: 44 pages ",
    "url": "https://arxiv.org/abs/2212.12992",
    "authors": [
      "Minquan Cheng",
      "Jinwei Xu",
      "Mingming Zhang",
      "Youlong Wu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2212.13163",
    "title": "MRTNet: Multi-Resolution Temporal Network for Video Sentence Grounding",
    "abstract": " Comments: work in progress ",
    "url": "https://arxiv.org/abs/2212.13163",
    "authors": [
      "Wei Ji",
      "Long Chen",
      "Yinwei Wei",
      "Yiming Wu",
      "Tat-Seng Chua"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]