[
  {
    "id": "arXiv:2311.04916",
    "title": "Explainable Identification of Hate Speech towards Islam using Graph  Neural Networks",
    "abstract": "Islamophobic language is a prevalent challenge on online social interaction platforms. Identifying and eliminating such hatred is a crucial step towards a future of harmony and peace. This study presents a novel paradigm for identifying and explaining hate speech towards Islam using graph neural networks. Utilizing the intrinsic ability of graph neural networks to find, extract, and use relationships across disparate data points, our model consistently achieves outstanding performance while offering explanations for the underlying correlations and causation. ",
    "url": "https://arxiv.org/abs/2311.04916",
    "authors": [
      "Azmine Toushik Wasi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.04917",
    "title": "Adapting Fake News Detection to the Era of Large Language Models",
    "abstract": "In the age of large language models (LLMs) and the widespread adoption of AI-driven content creation, the landscape of information dissemination has witnessed a paradigm shift. With the proliferation of both human-written and machine-generated real and fake news, robustly and effectively discerning the veracity of news articles has become an intricate challenge. While substantial research has been dedicated to fake news detection, this either assumes that all news articles are human-written or abruptly assumes that all machine-generated news are fake. Thus, a significant gap exists in understanding the interplay between machine-(paraphrased) real news, machine-generated fake news, human-written fake news, and human-written real news. In this paper, we study this gap by conducting a comprehensive evaluation of fake news detectors trained in various scenarios. Our primary objectives revolve around the following pivotal question: How to adapt fake news detectors to the era of LLMs? Our experiments reveal an interesting pattern that detectors trained exclusively on human-written articles can indeed perform well at detecting machine-generated fake news, but not vice versa. Moreover, due to the bias of detectors against machine-generated texts \\cite{su2023fake}, they should be trained on datasets with a lower machine-generated news ratio than the test set. Building on our findings, we provide a practical strategy for the development of robust fake news detectors. ",
    "url": "https://arxiv.org/abs/2311.04917",
    "authors": [
      "Jinyan Su",
      "Claire Cardie",
      "Preslav Nakov"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.04930",
    "title": "Large language models implicitly learn to straighten neural sentence  trajectories to construct a predictive representation of natural language",
    "abstract": "Predicting upcoming events is critical to our ability to interact with our environment. Transformer models, trained on next-word prediction, appear to construct representations of linguistic input that can support diverse downstream tasks. But how does a predictive objective shape such representations? Inspired by recent work in vision (Henaff et al., 2019), we test a hypothesis about predictive representations of autoregressive transformers. In particular, we test whether the neural trajectory of a sentence becomes progressively straighter as it passes through the network layers. The key insight is that straighter trajectories should facilitate prediction via linear extrapolation. We quantify straightness using a 1-dimensional curvature metric, and present four findings in support of the trajectory straightening hypothesis: i) In trained models, the curvature decreases from the early to the deeper layers of the network. ii) Models that perform better on the next-word prediction objective exhibit greater decreases in curvature, suggesting that this improved ability to straighten sentence trajectories may be the driver of better language modeling performance. iii) Given the same linguistic context, the sequences that are generated by the model have lower curvature than the actual continuations observed in a language corpus, suggesting that the model favors straighter trajectories for making predictions. iv) A consistent relationship holds between the average curvature and the average surprisal of sentences in the deep model layers, such that sentences with straighter trajectories also have lower surprisal. Importantly, untrained models do not exhibit these behaviors. In tandem, these results support the trajectory straightening hypothesis and provide a possible mechanism for how the geometry of the internal representations of autoregressive models supports next word prediction. ",
    "url": "https://arxiv.org/abs/2311.04930",
    "authors": [
      "Eghbal A. Hosseini",
      "Evelina Fedorenko"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.04935",
    "title": "Node-Bound Communities for Partition of Unity Interpolation on Graphs",
    "abstract": "Graph signal processing benefits significantly from the direct and highly adaptable supplementary techniques offered by partition of unity methods (PUMs) on graphs. In our approach, we demonstrate the generation of a partition of unity solely based on the underlying graph structure, employing an algorithm that relies exclusively on centrality measures and modularity, without requiring the input of the number of subdomains. Subsequently, we integrate PUMs with a local graph basis function (GBF) approximation method to develop cost-effective global interpolation schemes. We also discuss numerical experiments conducted on both synthetic and real datasets to assess the performance of this presented technique. ",
    "url": "https://arxiv.org/abs/2311.04935",
    "authors": [
      "Roberto Cavoretto",
      "Alessandra De Rossi",
      "Sandro Lancellotti",
      "Federico Romaniello"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2311.04948",
    "title": "Explained anomaly detection in text reviews: Can subjective scenarios be  correctly evaluated?",
    "abstract": "This paper presents a pipeline to detect and explain anomalous reviews in online platforms. The pipeline is made up of three modules and allows the detection of reviews that do not generate value for users due to either worthless or malicious composition. The classifications are accompanied by a normality score and an explanation that justifies the decision made. The pipeline's ability to solve the anomaly detection task was evaluated using different datasets created from a large Amazon database. Additionally, a study comparing three explainability techniques involving 241 participants was conducted to assess the explainability module. The study aimed to measure the impact of explanations on the respondents' ability to reproduce the classification model and their perceived usefulness. This work can be useful to automate tasks in review online platforms, such as those for electronic commerce, and offers inspiration for addressing similar problems in the field of anomaly detection in textual data. We also consider it interesting to have carried out a human evaluation of the capacity of different explainability techniques in a real and infrequent scenario such as the detection of anomalous reviews, as well as to reflect on whether it is possible to explain tasks as humanly subjective as this one. ",
    "url": "https://arxiv.org/abs/2311.04948",
    "authors": [
      "David Novoa-Paradela",
      "Oscar Fontenla-Romero",
      "Bertha Guijarro-Berdiñas"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.04950",
    "title": "Lightweight Diffusion Models with Distillation-Based Block Neural  Architecture Search",
    "abstract": "Diffusion models have recently shown remarkable generation ability, achieving state-of-the-art performance in many tasks. However, the high computational cost is still a troubling problem for diffusion models. To tackle this problem, we propose to automatically remove the structural redundancy in diffusion models with our proposed Diffusion Distillation-based Block-wise Neural Architecture Search (DiffNAS). Specifically, given a larger pretrained teacher, we leverage DiffNAS to search for the smallest architecture which achieves on-par or even better performance than the teacher. Considering current diffusion models are based on UNet which naturally has a block-wise structure, we perform neural architecture search independently in each block, which largely reduces the search space. Different from previous block-wise NAS methods, DiffNAS contains a block-wise local search strategy and a retraining strategy with a joint dynamic loss. Concretely, during the search process, we block-wisely select the best subnet to avoid the unfairness brought by the global search strategy used in previous works. When retraining the searched architecture, we adopt a dynamic joint loss to maintain the consistency between supernet training and subnet retraining, which also provides informative objectives for each block and shortens the paths of gradient propagation. We demonstrate this joint loss can effectively improve model performance. We also prove the necessity of the dynamic adjustment of this loss. The experiments show that our method can achieve significant computational reduction, especially on latent diffusion models with about 50% MACs and Parameter reduction. ",
    "url": "https://arxiv.org/abs/2311.04950",
    "authors": [
      "Siao Tang",
      "Xin Wang",
      "Hong Chen",
      "Chaoyu Guan",
      "Yansong Tang",
      "Wenwu zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.04986",
    "title": "Exploiting Inductive Biases in Video Modeling through Neural CDEs",
    "abstract": "We introduce a novel approach to video modeling that leverages controlled differential equations (CDEs) to address key challenges in video tasks, notably video interpolation and mask propagation. We apply CDEs at varying resolutions leading to a continuous-time U-Net architecture. Unlike traditional methods, our approach does not require explicit optical flow learning, and instead makes use of the inherent continuous-time features of CDEs to produce a highly expressive video model. We demonstrate competitive performance against state-of-the-art models for video interpolation and mask propagation tasks. ",
    "url": "https://arxiv.org/abs/2311.04986",
    "authors": [
      "Johnathan Chiu",
      "Samuel Duffield",
      "Max Hunter-Gordon",
      "Kaelan Donatella",
      "Max Aifer",
      "Andi Gu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.04999",
    "title": "Implicit Neural Representations for Breathing-compensated Volume  Reconstruction in Robotic Ultrasound Aorta Screening",
    "abstract": "Ultrasound (US) imaging is widely used in diagnosing and staging abdominal diseases due to its lack of non-ionizing radiation and prevalent availability. However, significant inter-operator variability and inconsistent image acquisition hinder the widespread adoption of extensive screening programs. Robotic ultrasound systems have emerged as a promising solution, offering standardized acquisition protocols and the possibility of automated acquisition. Additionally, these systems enable access to 3D data via robotic tracking, enhancing volumetric reconstruction for improved ultrasound interpretation and precise disease diagnosis. However, the interpretability of 3D US reconstruction of abdominal images can be affected by the patient's breathing motion. This study introduces a method to compensate for breathing motion in 3D US compounding by leveraging implicit neural representations. Our approach employs a robotic ultrasound system for automated screenings. To demonstrate the method's effectiveness, we evaluate our proposed method for the diagnosis and monitoring of abdominal aorta aneurysms as a representative use case. Our experiments demonstrate that our proposed pipeline facilitates robust automated robotic acquisition, mitigating artifacts from breathing motion, and yields smoother 3D reconstructions for enhanced screening and medical diagnosis. ",
    "url": "https://arxiv.org/abs/2311.04999",
    "authors": [
      "Yordanka Velikova",
      "Mohammad Farid Azampour",
      "Walter Simson",
      "Marco Esposito",
      "Nassir Navab"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.05006",
    "title": "Familiarity-Based Open-Set Recognition Under Adversarial Attacks",
    "abstract": "Open-set recognition (OSR), the identification of novel categories, can be a critical component when deploying classification models in real-world applications. Recent work has shown that familiarity-based scoring rules such as the Maximum Softmax Probability (MSP) or the Maximum Logit Score (MLS) are strong baselines when the closed-set accuracy is high. However, one of the potential weaknesses of familiarity-based OSR are adversarial attacks. Here, we present gradient-based adversarial attacks on familiarity scores for both types of attacks, False Familiarity and False Novelty attacks, and evaluate their effectiveness in informed and uninformed settings on TinyImageNet. ",
    "url": "https://arxiv.org/abs/2311.05006",
    "authors": [
      "Philip Enevoldsen",
      "Christian Gundersen",
      "Nico Lang",
      "Serge Belongie",
      "Christian Igel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.05029",
    "title": "S$^3$AD: Semi-supervised Small Apple Detection in Orchard Environments",
    "abstract": "Crop detection is integral for precision agriculture applications such as automated yield estimation or fruit picking. However, crop detection, e.g., apple detection in orchard environments remains challenging due to a lack of large-scale datasets and the small relative size of the crops in the image. In this work, we address these challenges by reformulating the apple detection task in a semi-supervised manner. To this end, we provide the large, high-resolution dataset MAD comprising 105 labeled images with 14,667 annotated apple instances and 4,440 unlabeled images. Utilizing this dataset, we also propose a novel Semi-Supervised Small Apple Detection system S$^3$AD based on contextual attention and selective tiling to improve the challenging detection of small apples, while limiting the computational overhead. We conduct an extensive evaluation on MAD and the MSU dataset, showing that S$^3$AD substantially outperforms strong fully-supervised baselines, including several small object detection systems, by up to $14.9\\%$. Additionally, we exploit the detailed annotations of our dataset w.r.t. apple properties to analyze the influence of relative size or level of occlusion on the results of various systems, quantifying current challenges. ",
    "url": "https://arxiv.org/abs/2311.05029",
    "authors": [
      "Robert Johanson",
      "Christian Wilms",
      "Ole Johannsen",
      "Simone Frintrop"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.05040",
    "title": "Network Flow Problems with Electric Vehicles",
    "abstract": "Electric vehicle (EV) adoption in long-distance logistics faces challenges such as range anxiety and uneven distribution of charging stations. Two pivotal questions emerge: How can EVs be efficiently routed in a charging network considering range limits, charging speeds and prices? And, can the existing charging infrastructure sustain the increasing demand for EVs in long-distance logistics? This paper addresses these questions by introducing a novel theoretical and computational framework to study the EV network flow problems. We present an EV network flow model that incorporates range constraints and nonlinear charging rates, and identify conditions under which polynomial-time solutions can be obtained for optimal single EV routing, maximum flow, and minimum-cost flow problems. Our findings provide insights for optimizing EV routing in logistics, ensuring an efficient and sustainable future. ",
    "url": "https://arxiv.org/abs/2311.05040",
    "authors": [
      "Haripriya Pulyassary",
      "Kostas Kollias",
      "Aaron Schild",
      "David Shmoys",
      "Manxi Wu"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2311.05047",
    "title": "DeepLearningBrasil@LT-EDI-2023: Exploring Deep Learning Techniques for  Detecting Depression in Social Media Text",
    "abstract": "In this paper, we delineate the strategy employed by our team, DeepLearningBrasil, which secured us the first place in the shared task DepSign-LT-EDI@RANLP-2023, achieving a 47.0% Macro F1-Score and a notable 2.4% advantage. The task was to classify social media texts into three distinct levels of depression - \"not depressed,\" \"moderately depressed,\" and \"severely depressed.\" Leveraging the power of the RoBERTa and DeBERTa models, we further pre-trained them on a collected Reddit dataset, specifically curated from mental health-related Reddit's communities (Subreddits), leading to an enhanced understanding of nuanced mental health discourse. To address lengthy textual data, we used truncation techniques that retained the essence of the content by focusing on its beginnings and endings. Our model was robust against unbalanced data by incorporating sample weights into the loss. Cross-validation and ensemble techniques were then employed to combine our k-fold trained models, delivering an optimal solution. The accompanying code is made available for transparency and further development. ",
    "url": "https://arxiv.org/abs/2311.05047",
    "authors": [
      "Eduardo Garcia",
      "Juliana Gomes",
      "Adalberto Barbosa Júnior",
      "Cardeque Borges",
      "Nádia da Silva"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.05050",
    "title": "Quantum Generative Modeling of Sequential Data with Trainable Token  Embedding",
    "abstract": "Generative models are a class of machine learning models that aim to learn the underlying probability distribution of data. Unlike discriminative models, generative models focus on capturing the data's inherent structure, allowing them to generate new samples that resemble the original data. To fully exploit the potential of modeling probability distributions using quantum physics, a quantum-inspired generative model known as the Born machines have shown great advancements in learning classical and quantum data over matrix product state(MPS) framework. The Born machines support tractable log-likelihood, autoregressive and mask sampling, and have shown outstanding performance in various unsupervised learning tasks. However, much of the current research has been centered on improving the expressive power of MPS, predominantly embedding each token directly by a corresponding tensor index. In this study, we generalize the embedding method into trainable quantum measurement operators that can be simultaneously honed with MPS. Our study indicated that combined with trainable embedding, Born machines can exhibit better performance and learn deeper correlations from the dataset. ",
    "url": "https://arxiv.org/abs/2311.05050",
    "authors": [
      "Wanda Hou",
      "Li Miao",
      "Yi-Zhuang You"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2311.05075",
    "title": "Mental Health Diagnosis in the Digital Age: Harnessing Sentiment  Analysis on Social Media Platforms upon Ultra-Sparse Feature Content",
    "abstract": "Amid growing global mental health concerns, particularly among vulnerable groups, natural language processing offers a tremendous potential for early detection and intervention of people's mental disorders via analyzing their postings and discussions on social media platforms. However, ultra-sparse training data, often due to vast vocabularies and low-frequency words, hinders the analysis accuracy. Multi-labeling and Co-occurrences of symptoms may also blur the boundaries in distinguishing similar/co-related disorders. To address these issues, we propose a novel semantic feature preprocessing technique with a three-folded structure: 1) mitigating the feature sparsity with a weak classifier, 2) adaptive feature dimension with modulus loops, and 3) deep-mining and extending features among the contexts. With enhanced semantic features, we train a machine learning model to predict and classify mental disorders. We utilize the Reddit Mental Health Dataset 2022 to examine conditions such as Anxiety, Borderline Personality Disorder (BPD), and Bipolar-Disorder (BD) and present solutions to the data sparsity challenge, highlighted by 99.81% non-zero elements. After applying our preprocessing technique, the feature sparsity decreases to 85.4%. Overall, our methods, when compared to seven benchmark models, demonstrate significant performance improvements: 8.0% in accuracy, 0.069 in precision, 0.093 in recall, 0.102 in F1 score, and 0.059 in AUC. This research provides foundational insights for mental health prediction and monitoring, providing innovative solutions to navigate challenges associated with ultra-sparse data feature and intricate multi-label classification in the domain of mental health analysis. ",
    "url": "https://arxiv.org/abs/2311.05075",
    "authors": [
      "Haijian Shao",
      "Ming Zhu",
      "Shengjie Zhai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.05079",
    "title": "Social Media Bot Detection using Dropout-GAN",
    "abstract": "Bot activity on social media platforms is a pervasive problem, undermining the credibility of online discourse and potentially leading to cybercrime. We propose an approach to bot detection using Generative Adversarial Networks (GAN). We discuss how we overcome the issue of mode collapse by utilizing multiple discriminators to train against one generator, while decoupling the discriminator to perform social media bot detection and utilizing the generator for data augmentation. In terms of classification accuracy, our approach outperforms the state-of-the-art techniques in this field. We also show how the generator in the GAN can be used to evade such a classification technique. ",
    "url": "https://arxiv.org/abs/2311.05079",
    "authors": [
      "Anant Shukla",
      "Martin Jurecek",
      "Mark Stamp"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2311.05088",
    "title": "Meta-learning of semi-supervised learning from tasks with heterogeneous  attribute spaces",
    "abstract": "We propose a meta-learning method for semi-supervised learning that learns from multiple tasks with heterogeneous attribute spaces. The existing semi-supervised meta-learning methods assume that all tasks share the same attribute space, which prevents us from learning with a wide variety of tasks. With the proposed method, the expected test performance on tasks with a small amount of labeled data is improved with unlabeled data as well as data in various tasks, where the attribute spaces are different among tasks. The proposed method embeds labeled and unlabeled data simultaneously in a task-specific space using a neural network, and the unlabeled data's labels are estimated by adapting classification or regression models in the embedding space. For the neural network, we develop variable-feature self-attention layers, which enable us to find embeddings of data with different attribute spaces with a single neural network by considering interactions among examples, attributes, and labels. Our experiments on classification and regression datasets with heterogeneous attribute spaces demonstrate that our proposed method outperforms the existing meta-learning and semi-supervised learning methods. ",
    "url": "https://arxiv.org/abs/2311.05088",
    "authors": [
      "Tomoharu Iwata",
      "Atsutoshi Kumagai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.05109",
    "title": "Reducing the Side-Effects of Oscillations in Training of Quantized YOLO  Networks",
    "abstract": "Quantized networks use less computational and memory resources and are suitable for deployment on edge devices. While quantization-aware training QAT is the well-studied approach to quantize the networks at low precision, most research focuses on over-parameterized networks for classification with limited studies on popular and edge device friendly single-shot object detection and semantic segmentation methods like YOLO. Moreover, majority of QAT methods rely on Straight-through Estimator (STE) approximation which suffers from an oscillation phenomenon resulting in sub-optimal network quantization. In this paper, we show that it is difficult to achieve extremely low precision (4-bit and lower) for efficient YOLO models even with SOTA QAT methods due to oscillation issue and existing methods to overcome this problem are not effective on these models. To mitigate the effect of oscillation, we first propose Exponentially Moving Average (EMA) based update to the QAT model. Further, we propose a simple QAT correction method, namely QC, that takes only a single epoch of training after standard QAT procedure to correct the error induced by oscillating weights and activations resulting in a more accurate quantized model. With extensive evaluation on COCO dataset using various YOLO5 and YOLO7 variants, we show that our correction method improves quantized YOLO networks consistently on both object detection and segmentation tasks at low-precision (4-bit and 3-bit). ",
    "url": "https://arxiv.org/abs/2311.05109",
    "authors": [
      "Kartik Gupta",
      "Akshay Asthana"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.05139",
    "title": "On neural and dimensional collapse in supervised and unsupervised  contrastive learning with hard negative sampling",
    "abstract": "For a widely-studied data model and general loss and sample-hardening functions we prove that the Supervised Contrastive Learning (SCL), Hard-SCL (HSCL), and Unsupervised Contrastive Learning (UCL) risks are minimized by representations that exhibit Neural Collapse (NC), i.e., the class means form an Equianglular Tight Frame (ETF) and data from the same class are mapped to the same representation. We also prove that for any representation mapping, the HSCL and Hard-UCL (HUCL) risks are lower bounded by the corresponding SCL and UCL risks. Although the optimality of ETF is known for SCL, albeit only for InfoNCE loss, its optimality for HSCL and UCL under general loss and hardening functions is novel. Moreover, our proofs are much simpler, compact, and transparent. We empirically demonstrate, for the first time, that ADAM optimization of HSCL and HUCL risks with random initialization and suitable hardness levels can indeed converge to the NC geometry if we incorporate unit-ball or unit-sphere feature normalization. Without incorporating hard negatives or feature normalization, however, the representations learned via ADAM suffer from dimensional collapse (DC) and fail to attain the NC geometry. ",
    "url": "https://arxiv.org/abs/2311.05139",
    "authors": [
      "Ruijie Jiang",
      "Thuan Nguyen",
      "Shuchin Aeron",
      "Prakash Ishwar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.05143",
    "title": "SCAAT: Improving Neural Network Interpretability via Saliency  Constrained Adaptive Adversarial Training",
    "abstract": "Deep Neural Networks (DNNs) are expected to provide explanation for users to understand their black-box predictions. Saliency map is a common form of explanation illustrating the heatmap of feature attributions, but it suffers from noise in distinguishing important features. In this paper, we propose a model-agnostic learning method called Saliency Constrained Adaptive Adversarial Training (SCAAT) to improve the quality of such DNN interpretability. By constructing adversarial samples under the guidance of saliency map, SCAAT effectively eliminates most noise and makes saliency maps sparser and more faithful without any modification to the model architecture. We apply SCAAT to multiple DNNs and evaluate the quality of the generated saliency maps on various natural and pathological image datasets. Evaluations on different domains and metrics show that SCAAT significantly improves the interpretability of DNNs by providing more faithful saliency maps without sacrificing their predictive power. ",
    "url": "https://arxiv.org/abs/2311.05143",
    "authors": [
      "Rui Xu",
      "Wenkang Qin",
      "Peixiang Huang",
      "Haowang",
      "Lin Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.05144",
    "title": "Counter-Empirical Attacking based on Adversarial Reinforcement Learning  for Time-Relevant Scoring System",
    "abstract": "Scoring systems are commonly seen for platforms in the era of big data. From credit scoring systems in financial services to membership scores in E-commerce shopping platforms, platform managers use such systems to guide users towards the encouraged activity pattern, and manage resources more effectively and more efficiently thereby. To establish such scoring systems, several \"empirical criteria\" are firstly determined, followed by dedicated top-down design for each factor of the score, which usually requires enormous effort to adjust and tune the scoring function in the new application scenario. What's worse, many fresh projects usually have no ground-truth or any experience to evaluate a reasonable scoring system, making the designing even harder. To reduce the effort of manual adjustment of the scoring function in every new scoring system, we innovatively study the scoring system from the preset empirical criteria without any ground truth, and propose a novel framework to improve the system from scratch. In this paper, we propose a \"counter-empirical attacking\" mechanism that can generate \"attacking\" behavior traces and try to break the empirical rules of the scoring system. Then an adversarial \"enhancer\" is applied to evaluate the scoring system and find the improvement strategy. By training the adversarial learning problem, a proper scoring function can be learned to be robust to the attacking activity traces that are trying to violate the empirical criteria. Extensive experiments have been conducted on two scoring systems including a shared computing resource platform and a financial credit system. The experimental results have validated the effectiveness of our proposed framework. ",
    "url": "https://arxiv.org/abs/2311.05144",
    "authors": [
      "Xiangguo Sun",
      "Hong Cheng",
      "Hang Dong",
      "Bo Qiao",
      "Si Qin",
      "Qingwei Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2311.05145",
    "title": "Enhancing power grid resilience to cyber-physical attacks using  distributed retail electricity markets",
    "abstract": "We propose using a hierarchical retail market structure to alert and dispatch resources to mitigate cyber-physical attacks on a distribution grid. We simulate attacks where a number of generation nodes in a distribution grid are attacked. We show that the market is able to successfully meet the shortfall between demand and supply by utilizing the flexibility of remaining resources while minimizing any extra power that needs to be imported from the main transmission grid. This includes utilizing upward flexibility or reserves of remaining online generators and some curtailment or shifting of flexible loads, which results in higher costs. Using price signals and market-based coordination, the grid operator can achieve its objectives without direct control over distributed energy resources and is able to accurately compensate prosumers for the grid support they provide. ",
    "url": "https://arxiv.org/abs/2311.05145",
    "authors": [
      "Vineet Jagadeesan Nair",
      "Priyank Srivastava",
      "Anuradha Annaswamy"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2311.05155",
    "title": "Weakly-supervised Deep Cognate Detection Framework for Low-Resourced  Languages Using Morphological Knowledge of Closely-Related Languages",
    "abstract": "Exploiting cognates for transfer learning in under-resourced languages is an exciting opportunity for language understanding tasks, including unsupervised machine translation, named entity recognition and information retrieval. Previous approaches mainly focused on supervised cognate detection tasks based on orthographic, phonetic or state-of-the-art contextual language models, which under-perform for most under-resourced languages. This paper proposes a novel language-agnostic weakly-supervised deep cognate detection framework for under-resourced languages using morphological knowledge from closely related languages. We train an encoder to gain morphological knowledge of a language and transfer the knowledge to perform unsupervised and weakly-supervised cognate detection tasks with and without the pivot language for the closely-related languages. While unsupervised, it overcomes the need for hand-crafted annotation of cognates. We performed experiments on different published cognate detection datasets across language families and observed not only significant improvement over the state-of-the-art but also our method outperformed the state-of-the-art supervised and unsupervised methods. Our model can be extended to a wide range of languages from any language family as it overcomes the requirement of the annotation of the cognate pairs for training. The code and dataset building scripts can be found at https://github.com/koustavagoswami/Weakly_supervised-Cognate_Detection ",
    "url": "https://arxiv.org/abs/2311.05155",
    "authors": [
      "Koustava Goswami",
      "Priya Rani",
      "Theodorus Fransen",
      "John P. McCrae"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.05160",
    "title": "RAPID: Training-free Retrieval-based Log Anomaly Detection with PLM  considering Token-level information",
    "abstract": "As the IT industry advances, system log data becomes increasingly crucial. Many computer systems rely on log texts for management due to restricted access to source code. The need for log anomaly detection is growing, especially in real-world applications, but identifying anomalies in rapidly accumulating logs remains a challenging task. Traditional deep learning-based anomaly detection models require dataset-specific training, leading to corresponding delays. Notably, most methods only focus on sequence-level log information, which makes the detection of subtle anomalies harder, and often involve inference processes that are difficult to utilize in real-time. We introduce RAPID, a model that capitalizes on the inherent features of log data to enable anomaly detection without training delays, ensuring real-time capability. RAPID treats logs as natural language, extracting representations using pre-trained language models. Given that logs can be categorized based on system context, we implement a retrieval-based technique to contrast test logs with the most similar normal logs. This strategy not only obviates the need for log-specific training but also adeptly incorporates token-level information, ensuring refined and robust detection, particularly for unseen logs. We also propose the core set technique, which can reduce the computational cost needed for comparison. Experimental results show that even without training on log data, RAPID demonstrates competitive performance compared to prior models and achieves the best performance on certain datasets. Through various research questions, we verified its capability for real-time detection without delay. ",
    "url": "https://arxiv.org/abs/2311.05160",
    "authors": [
      "Gunho No",
      "Yukyung Lee",
      "Hyeongwon Kang",
      "Pilsung Kang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.05168",
    "title": "FireMatch: A Semi-Supervised Video Fire Detection Network Based on  Consistency and Distribution Alignment",
    "abstract": "Deep learning techniques have greatly enhanced the performance of fire detection in videos. However, video-based fire detection models heavily rely on labeled data, and the process of data labeling is particularly costly and time-consuming, especially when dealing with videos. Considering the limited quantity of labeled video data, we propose a semi-supervised fire detection model called FireMatch, which is based on consistency regularization and adversarial distribution alignment. Specifically, we first combine consistency regularization with pseudo-label. For unlabeled data, we design video data augmentation to obtain corresponding weakly augmented and strongly augmented samples. The proposed model predicts weakly augmented samples and retains pseudo-label above a threshold, while training on strongly augmented samples to predict these pseudo-labels for learning more robust feature representations. Secondly, we generate video cross-set augmented samples by adversarial distribution alignment to expand the training data and alleviate the decline in classification performance caused by insufficient labeled data. Finally, we introduce a fairness loss to help the model produce diverse predictions for input samples, thereby addressing the issue of high confidence with the non-fire class in fire classification scenarios. The FireMatch achieved an accuracy of 76.92% and 91.81% on two real-world fire datasets, respectively. The experimental results demonstrate that the proposed method outperforms the current state-of-the-art semi-supervised classification methods. ",
    "url": "https://arxiv.org/abs/2311.05168",
    "authors": [
      "Qinghua Lin",
      "Zuoyong Li",
      "Kun Zeng",
      "Haoyi Fan",
      "Wei Li",
      "Xiaoguang Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.05171",
    "title": "Rethinking Residual Connection in Training Large-Scale Spiking Neural  Networks",
    "abstract": "Spiking Neural Network (SNN) is known as the most famous brain-inspired model, but the non-differentiable spiking mechanism makes it hard to train large-scale SNNs. To facilitate the training of large-scale SNNs, many training methods are borrowed from Artificial Neural Networks (ANNs), among which deep residual learning is the most commonly used. But the unique features of SNNs make prior intuition built upon ANNs not available for SNNs. Although there are a few studies that have made some pioneer attempts on the topology of Spiking ResNet, the advantages of different connections remain unclear. To tackle this issue, we analyze the merits and limitations of various residual connections and empirically demonstrate our ideas with extensive experiments. Then, based on our observations, we abstract the best-performing connections into densely additive (DA) connection, extend such a concept to other topologies, and propose four architectures for training large-scale SNNs, termed DANet, which brings up to 13.24% accuracy gain on ImageNet. Besides, in order to present a detailed methodology for designing the topology of large-scale SNNs, we further conduct in-depth discussions on their applicable scenarios in terms of their performance on various scales of datasets and demonstrate their advantages over prior architectures. At a low training expense, our best-performing ResNet-50/101/152 obtain 73.71%/76.13%/77.22% top-1 accuracy on ImageNet with 4 time steps. We believe that this work shall give more insights for future works to design the topology of their networks and promote the development of large-scale SNNs. The code will be publicly available. ",
    "url": "https://arxiv.org/abs/2311.05171",
    "authors": [
      "Yudong Li",
      "Yunlin Lei",
      "Xu Yang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2311.05185",
    "title": "Mixture of Weak & Strong Experts on Graphs",
    "abstract": "Realistic graphs contain both rich self-features of nodes and informative structures of neighborhoods, jointly handled by a GNN in the typical setup. We propose to decouple the two modalities by mixture of weak and strong experts (Mowst), where the weak expert is a light-weight Multi-layer Perceptron (MLP), and the strong expert is an off-the-shelf Graph Neural Network (GNN). To adapt the experts' collaboration to different target nodes, we propose a \"confidence\" mechanism based on the dispersion of the weak expert's prediction logits. The strong expert is conditionally activated when either the node's classification relies on neighborhood information, or the weak expert has low model quality. We reveal interesting training dynamics by analyzing the influence of the confidence function on loss: our training algorithm encourages the specialization of each expert by effectively generating soft splitting of the graph. In addition, our \"confidence\" design imposes a desirable bias toward the strong expert to benefit from GNN's better generalization capability. Mowst is easy to optimize and achieves strong expressive power, with a computation cost comparable to a single GNN. Empirically, Mowst shows significant accuracy improvement on 6 standard node classification benchmarks (including both homophilous and heterophilous graphs). ",
    "url": "https://arxiv.org/abs/2311.05185",
    "authors": [
      "Hanqing Zeng",
      "Hanjia Lyu",
      "Diyi Hu",
      "Yinglong Xia",
      "Jiebo Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.05192",
    "title": "TransReg: Cross-transformer as auto-registration module for multi-view  mammogram mass detection",
    "abstract": "Screening mammography is the most widely used method for early breast cancer detection, significantly reducing mortality rates. The integration of information from multi-view mammograms enhances radiologists' confidence and diminishes false-positive rates since they can examine on dual-view of the same breast to cross-reference the existence and location of the lesion. Inspired by this, we present TransReg, a Computer-Aided Detection (CAD) system designed to exploit the relationship between craniocaudal (CC), and mediolateral oblique (MLO) views. The system includes cross-transformer to model the relationship between the region of interest (RoIs) extracted by siamese Faster RCNN network for mass detection problems. Our work is the first time cross-transformer has been integrated into an object detection framework to model the relation between ipsilateral views. Our experimental evaluation on DDSM and VinDr-Mammo datasets shows that our TransReg, equipped with SwinT as a feature extractor achieves state-of-the-art performance. Specifically, at the false positive rate per image at 0.5, TransReg using SwinT gets a recall at 83.3% for DDSM dataset and 79.7% for VinDr-Mammo dataset. Furthermore, we conduct a comprehensive analysis to demonstrate that cross-transformer can function as an auto-registration module, aligning the masses in dual-view and utilizing this information to inform final predictions. It is a replication diagnostic workflow of expert radiologists ",
    "url": "https://arxiv.org/abs/2311.05192",
    "authors": [
      "Hoang C. Nguyen",
      "Chi Phan",
      "Hieu H. Pham"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.05197",
    "title": "Deep Learning in Computed Tomography Pulmonary Angiography Imaging: A  Dual-Pronged Approach for Pulmonary Embolism Detection",
    "abstract": "Pulmonary Embolism (PE) is a critical medical condition characterized by obstructions in the pulmonary arteries. Despite being a major health concern, it often goes underdiagnosed leading to detrimental clinical outcomes. The increasing reliance on Computed Tomography Pulmonary Angiography for diagnosis presents challenges and a pressing need for enhanced diagnostic solutions. The primary objective of this study is to leverage deep learning techniques to enhance the Computer Assisted Diagnosis of PE. This study presents a comprehensive dual-pronged approach combining classification and detection for PE diagnosis. We introduce an Attention-Guided Convolutional Neural Network (AG-CNN) for classification, addressing both global and local lesion region. For detection, state-of-the-art models are employed to pinpoint potential PE regions. Different ensembling techniques further improve detection accuracy by combining predictions from different models. Finally, a heuristic strategy integrates classifier outputs with detection results, ensuring robust and accurate PE identification. Our attention-guided classification approach, tested on the Ferdowsi University of Mashhad's Pulmonary Embolism (FUMPE) dataset, outperformed the baseline model DenseNet-121 by achieving an 8.1% increase in the Area Under the Receiver Operating Characteristic. By employing ensemble techniques with detection models, the mean average precision (mAP) was considerably enhanced by a 4.7% increase. The classifier-guided framework further refined the mAP and F1 scores over the ensemble models. Our research offers a comprehensive approach to PE diagnostics using deep learning, addressing the prevalent issues of underdiagnosis and misdiagnosis. We aim to improve PE patient care by integrating AI solutions into clinical workflows, highlighting the potential of human-AI collaboration in medical diagnostics. ",
    "url": "https://arxiv.org/abs/2311.05197",
    "authors": [
      "Fabiha Bushra",
      "Muhammad E. H. Chowdhury",
      "Rusab Sarmun",
      "Saidul Kabir",
      "Menatalla Said",
      "Sohaib Bassam Zoghoul",
      "Adam Mushtak",
      "Israa Al-Hashimi",
      "Abdulrahman Alqahtani",
      "Anwarul Hasan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.05199",
    "title": "BrainNetDiff: Generative AI Empowers Brain Network Generation via  Multimodal Diffusion Model",
    "abstract": "Brain network analysis has emerged as pivotal method for gaining a deeper understanding of brain functions and disease mechanisms. Despite the existence of various network construction approaches, shortcomings persist in the learning of correlations between structural and functional brain imaging data. In light of this, we introduce a novel method called BrainNetDiff, which combines a multi-head Transformer encoder to extract relevant features from fMRI time series and integrates a conditional latent diffusion model for brain network generation. Leveraging a conditional prompt and a fusion attention mechanism, this method significantly improves the accuracy and stability of brain network generation. To the best of our knowledge, this represents the first framework that employs diffusion for the fusion of the multimodal brain imaging and brain network generation from images to graphs. We validate applicability of this framework in the construction of brain network across healthy and neurologically impaired cohorts using the authentic dataset. Experimental results vividly demonstrate the significant effectiveness of the proposed method across the downstream disease classification tasks. These findings convincingly emphasize the prospective value in the field of brain network research, particularly its key significance in neuroimaging analysis and disease diagnosis. This research provides a valuable reference for the processing of multimodal brain imaging data and introduces a novel, efficient solution to the field of neuroimaging. ",
    "url": "https://arxiv.org/abs/2311.05199",
    "authors": [
      "Yongcheng Zong",
      "Shuqiang Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.05210",
    "title": "From \"What\" to \"When\" -- a Spiking Neural Network Predicting Rare Events  and Time to their Occurrence",
    "abstract": "In the reinforcement learning (RL) tasks, the ability to predict receiving reward in the near or more distant future means the ability to evaluate the current state as more or less close to the target state (labelled by the reward signal). In the present work, we utilize a spiking neural network (SNN) to predict time to the next target event (reward - in case of RL). In the context of SNNs, events are represented as spikes emitted by network neurons or input nodes. It is assumed that target events are indicated by spikes emitted by a special network input node. Using description of the current state encoded in the form of spikes from the other input nodes, the network should predict approximate time of the next target event. This research paper presents a novel approach to learning the corresponding predictive model by an SNN consisting of leaky integrate-and-fire (LIF) neurons. The proposed method leverages specially designed local synaptic plasticity rules and a novel columnar-layered SNN architecture. Similar to our previous works, this study places a strong emphasis on the hardware-friendliness of the proposed models, ensuring their efficient implementation on modern and future neuroprocessors. The approach proposed was tested on a simple reward prediction task in the context of one of the RL benchmark ATARI games, ping-pong. It was demonstrated that the SNN described in this paper gives superior prediction accuracy in comparison with precise machine learning techniques, such as decision tree algorithms and convolutional neural networks. ",
    "url": "https://arxiv.org/abs/2311.05210",
    "authors": [
      "Mikhail Kiselev"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2311.05227",
    "title": "Kantian Deontology Meets AI Alignment: Towards Morally Robust Fairness  Metrics",
    "abstract": "Deontological ethics, specifically understood through Immanuel Kant, provides a moral framework that emphasizes the importance of duties and principles, rather than the consequences of action. Understanding that despite the prominence of deontology, it is currently an overlooked approach in fairness metrics, this paper explores the compatibility of a Kantian deontological framework in fairness metrics, part of the AI alignment field. We revisit Kant's critique of utilitarianism, which is the primary approach in AI fairness metrics and argue that fairness principles should align with the Kantian deontological framework. By integrating Kantian ethics into AI alignment, we not only bring in a widely-accepted prominent moral theory but also strive for a more morally grounded AI landscape that better balances outcomes and procedures in pursuit of fairness and justice. ",
    "url": "https://arxiv.org/abs/2311.05227",
    "authors": [
      "Carlos Mougan",
      "Joshua Brand"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.05237",
    "title": "Widely Applicable Strong Baseline for Sports Ball Detection and Tracking",
    "abstract": "In this work, we present a novel Sports Ball Detection and Tracking (SBDT) method that can be applied to various sports categories. Our approach is composed of (1) high-resolution feature extraction, (2) position-aware model training, and (3) inference considering temporal consistency, all of which are put together as a new SBDT baseline. Besides, to validate the wide-applicability of our approach, we compare our baseline with 6 state-of-the-art SBDT methods on 5 datasets from different sports categories. We achieve this by newly introducing two SBDT datasets, providing new ball annotations for two datasets, and re-implementing all the methods to ease extensive comparison. Experimental results demonstrate that our approach is substantially superior to existing methods on all the sports categories covered by the datasets. We believe our proposed method can play as a Widely Applicable Strong Baseline (WASB) of SBDT, and our datasets and codebase will promote future SBDT research. Datasets and codes will be made publicly available. ",
    "url": "https://arxiv.org/abs/2311.05237",
    "authors": [
      "Shuhei Tarashima",
      "Muhammad Abdul Haq",
      "Yushan Wang",
      "Norio Tagawa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.05243",
    "title": "A higher-order transformation approach to the formalization and analysis  of BPMN using graph transformation systems",
    "abstract": "The Business Process Modeling Notation (BPMN) is a widely used standard notation for defining intra- and inter-organizational workflows. However, the informal description of the BPMN execution semantics leads to different interpretations of BPMN elements and difficulties in checking behavioral properties. In this article, we propose a formalization of the execution semantics of BPMN that, compared to existing approaches, covers more BPMN elements while also facilitating property checking. Our approach is based on a higher-order transformation from BPMN models to graph transformation systems. To show the capabilities of our approach, we implemented it as an open-source web-based tool. A demonstration of our tool is available at https://youtu.be/MxXbNUl6IjE. ",
    "url": "https://arxiv.org/abs/2311.05243",
    "authors": [
      "Tim Kräuter",
      "Adrian Rutle",
      "Harald König",
      "Yngve Lamo"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2311.05256",
    "title": "Latent Task-Specific Graph Network Simulators",
    "abstract": "Simulating dynamic physical interactions is a critical challenge across multiple scientific domains, with applications ranging from robotics to material science. For mesh-based simulations, Graph Network Simulators (GNSs) pose an efficient alternative to traditional physics-based simulators. Their inherent differentiability and speed make them particularly well-suited for inverse design problems. Yet, adapting to new tasks from limited available data is an important aspect for real-world applications that current methods struggle with. We frame mesh-based simulation as a meta-learning problem and use a recent Bayesian meta-learning method to improve GNSs adaptability to new scenarios by leveraging context data and handling uncertainties. Our approach, latent task-specific graph network simulator, uses non-amortized task posterior approximations to sample latent descriptions of unknown system properties. Additionally, we leverage movement primitives for efficient full trajectory prediction, effectively addressing the issue of accumulating errors encountered by previous auto-regressive methods. We validate the effectiveness of our approach through various experiments, performing on par with or better than established baseline methods. Movement primitives further allow us to accommodate various types of context data, as demonstrated through the utilization of point clouds during inference. By combining GNSs with meta-learning, we bring them closer to real-world applicability, particularly in scenarios with smaller datasets. ",
    "url": "https://arxiv.org/abs/2311.05256",
    "authors": [
      "Philipp Dahlinger",
      "Niklas Freymuth",
      "Michael Volpp",
      "Tai Hoang",
      "Gerhard Neumann"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.05261",
    "title": "RAGLog: Log Anomaly Detection using Retrieval Augmented Generation",
    "abstract": "The ability to detect log anomalies from system logs is a vital activity needed to ensure cyber resiliency of systems. It is applied for fault identification or facilitate cyber investigation and digital forensics. However, as logs belonging to different systems and components differ significantly, the challenge to perform such analysis is humanly challenging from the volume, variety and velocity of logs. This is further complicated by the lack or unavailability of anomalous log entries to develop trained machine learning or artificial intelligence models for such purposes. In this research work, we explore the use of a Retrieval Augmented Large Language Model that leverages a vector database to detect anomalies from logs. We used a Question and Answer configuration pipeline. To the best of our knowledge, our experiment which we called RAGLog is a novel one and the experimental results show much promise. ",
    "url": "https://arxiv.org/abs/2311.05261",
    "authors": [
      "Jonathan Pan",
      "Swee Liang Wong",
      "Yidi Yuan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.05286",
    "title": "Causal Inference from Text: Unveiling Interactions between Variables",
    "abstract": "Adjusting for latent covariates is crucial for estimating causal effects from observational textual data. Most existing methods only account for confounding covariates that affect both treatment and outcome, potentially leading to biased causal effects. This bias arises from insufficient consideration of non-confounding covariates, which are relevant only to either the treatment or the outcome. In this work, we aim to mitigate the bias by unveiling interactions between different variables to disentangle the non-confounding covariates when estimating causal effects from text. The disentangling process ensures covariates only contribute to their respective objectives, enabling independence between variables. Additionally, we impose a constraint to balance representations from the treatment group and control group to alleviate selection bias. We conduct experiments on two different treatment factors under various scenarios, and the proposed model significantly outperforms recent strong baselines. Furthermore, our thorough analysis on earnings call transcripts demonstrates that our model can effectively disentangle the variables, and further investigations into real-world scenarios provide guidance for investors to make informed decisions. ",
    "url": "https://arxiv.org/abs/2311.05286",
    "authors": [
      "Yuxiang Zhou",
      "Yulan He"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.05289",
    "title": "VoxNeRF: Bridging Voxel Representation and Neural Radiance Fields for  Enhanced Indoor View Synthesis",
    "abstract": "Creating high-quality view synthesis is essential for immersive applications but continues to be problematic, particularly in indoor environments and for real-time deployment. Current techniques frequently require extensive computational time for both training and rendering, and often produce less-than-ideal 3D representations due to inadequate geometric structuring. To overcome this, we introduce VoxNeRF, a novel approach that leverages volumetric representations to enhance the quality and efficiency of indoor view synthesis. Firstly, VoxNeRF constructs a structured scene geometry and converts it into a voxel-based representation. We employ multi-resolution hash grids to adaptively capture spatial features, effectively managing occlusions and the intricate geometry of indoor scenes. Secondly, we propose a unique voxel-guided efficient sampling technique. This innovation selectively focuses computational resources on the most relevant portions of ray segments, substantially reducing optimization time. We validate our approach against three public indoor datasets and demonstrate that VoxNeRF outperforms state-of-the-art methods. Remarkably, it achieves these gains while reducing both training and rendering times, surpassing even Instant-NGP in speed and bringing the technology closer to real-time. ",
    "url": "https://arxiv.org/abs/2311.05289",
    "authors": [
      "Sen Wang",
      "Wei Zhang",
      "Stefano Gasperini",
      "Shun-Cheng Wu",
      "Nassir Navab"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.05303",
    "title": "Reliable and Efficient Data Collection in UAV-based IoT Networks",
    "abstract": "Internet of Things (IoT) involves sensors for monitoring and wireless networks for efficient communication. However, resource-constrained IoT devices and limitations in existing wireless technologies hinder its full potential. Integrating Unmanned Aerial Vehicles (UAVs) into IoT networks can address some challenges by expanding its' coverage, providing security, and bringing computing closer to IoT devices. Nevertheless, effective data collection in UAV-assisted IoT networks is hampered by factors, including dynamic UAV behavior, environmental variables, connectivity instability, and security considerations. In this survey, we first explore UAV-based IoT networks, focusing on communication and networking aspects. Next, we cover various UAV-based data collection methods their advantages and disadvantages, followed by a discussion on performance metrics for data collection. As this article primarily emphasizes reliable and efficient data collection in UAV-assisted IoT networks, we briefly discuss existing research on data accuracy and consistency, network connectivity, and data security and privacy to provide insights into reliable data collection. Additionally, we discuss efficient data collection strategies in UAV-based IoT networks, covering trajectory and path planning, collision avoidance, sensor network clustering, data aggregation, UAV swarm formations, and artificial intelligence for optimization. We also present two use cases of UAVs as a service for enhancing data collection reliability and efficiency. Finally, we discuss future challenges in data collection for UAV-assisted IoT networks. ",
    "url": "https://arxiv.org/abs/2311.05303",
    "authors": [
      "Poorvi Joshi",
      "Alakesh Kalita",
      "Mohan Gurusamy"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.05316",
    "title": "ABIGX: A Unified Framework for eXplainable Fault Detection and  Classification",
    "abstract": "For explainable fault detection and classification (FDC), this paper proposes a unified framework, ABIGX (Adversarial fault reconstruction-Based Integrated Gradient eXplanation). ABIGX is derived from the essentials of previous successful fault diagnosis methods, contribution plots (CP) and reconstruction-based contribution (RBC). It is the first explanation framework that provides variable contributions for the general FDC models. The core part of ABIGX is the adversarial fault reconstruction (AFR) method, which rethinks the FR from the perspective of adversarial attack and generalizes to fault classification models with a new fault index. For fault classification, we put forward a new problem of fault class smearing, which intrinsically hinders the correct explanation. We prove that ABIGX effectively mitigates this problem and outperforms the existing gradient-based explanation methods. For fault detection, we theoretically bridge ABIGX with conventional fault diagnosis methods by proving that CP and RBC are the linear specifications of ABIGX. The experiments evaluate the explanations of FDC by quantitative metrics and intuitive illustrations, the results of which show the general superiority of ABIGX to other advanced explanation methods. ",
    "url": "https://arxiv.org/abs/2311.05316",
    "authors": [
      "Yue Zhuo",
      "Jinchuan Qian",
      "Zhihuan Song",
      "Zhiqiang Ge"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.05322",
    "title": "Numerical Modeling for Shoulder Injury Detection Using Microwave Imaging",
    "abstract": "A portable imaging system for the on-site detection of shoulder injury is necessary to identify its extent and avoid its development to severe condition. Here, firstly a microwave tomography system is introduced using state-of-the-art numerical modeling and parallel computing for imaging different tissues in the shoulder. The results show that the proposed method is capable of accurately detecting and localizing rotator cuff tears of different size. In the next step, an efficient design in terms of computing time and complexity is proposed to detect the variations in the injured model with respect to the healthy model. The method is based on finite element discretization and uses parallel preconditioners from the domain decomposition method to accelerate computations. It is implemented using the open source FreeFEM software. ",
    "url": "https://arxiv.org/abs/2311.05322",
    "authors": [
      "Sahar Borzooei",
      "Pierre-Henri Tournier",
      "Victorita Dolean",
      "Christian Pichot",
      "Nadine Joachimowicz",
      "Helene Roussel",
      "Claire Migliaccio"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Analysis of PDEs (math.AP)"
    ]
  },
  {
    "id": "arXiv:2311.05323",
    "title": "Spatial Attention-based Distribution Integration Network for Human Pose  Estimation",
    "abstract": "In recent years, human pose estimation has made significant progress through the implementation of deep learning techniques. However, these techniques still face limitations when confronted with challenging scenarios, including occlusion, diverse appearances, variations in illumination, and overlap. To cope with such drawbacks, we present the Spatial Attention-based Distribution Integration Network (SADI-NET) to improve the accuracy of localization in such situations. Our network consists of three efficient models: the receptive fortified module (RFM), spatial fusion module (SFM), and distribution learning module (DLM). Building upon the classic HourglassNet architecture, we replace the basic block with our proposed RFM. The RFM incorporates a dilated residual block and attention mechanism to expand receptive fields while enhancing sensitivity to spatial information. In addition, the SFM incorporates multi-scale characteristics by employing both global and local attention mechanisms. Furthermore, the DLM, inspired by residual log-likelihood estimation (RLE), reconfigures a predicted heatmap using a trainable distribution weight. For the purpose of determining the efficacy of our model, we conducted extensive experiments on the MPII and LSP benchmarks. Particularly, our model obtained a remarkable $92.10\\%$ percent accuracy on the MPII test dataset, demonstrating significant improvements over existing models and establishing state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2311.05323",
    "authors": [
      "Sihan Gao",
      "Jing Zhu",
      "Xiaoxuan Zhuang",
      "Zhaoyue Wang",
      "Qijin Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.05336",
    "title": "SynFacePAD 2023: Competition on Face Presentation Attack Detection Based  on Privacy-aware Synthetic Training Data",
    "abstract": "This paper presents a summary of the Competition on Face Presentation Attack Detection Based on Privacy-aware Synthetic Training Data (SynFacePAD 2023) held at the 2023 International Joint Conference on Biometrics (IJCB 2023). The competition attracted a total of 8 participating teams with valid submissions from academia and industry. The competition aimed to motivate and attract solutions that target detecting face presentation attacks while considering synthetic-based training data motivated by privacy, legal and ethical concerns associated with personal data. To achieve that, the training data used by the participants was limited to synthetic data provided by the organizers. The submitted solutions presented innovations and novel approaches that led to outperforming the considered baseline in the investigated benchmarks. ",
    "url": "https://arxiv.org/abs/2311.05336",
    "authors": [
      "Meiling Fang",
      "Marco Huber",
      "Julian Fierrez",
      "Raghavendra Ramachandra",
      "Naser Damer",
      "Alhasan Alkhaddour",
      "Maksim Kasantcev",
      "Vasiliy Pryadchenko",
      "Ziyuan Yang",
      "Huijie Huangfu",
      "Yingyu Chen",
      "Yi Zhang",
      "Yuchen Pan",
      "Junjun Jiang",
      "Xianming Liu",
      "Xianyun Sun",
      "Caiyong Wang",
      "Xingyu Liu",
      "Zhaohua Chang",
      "Guangzhe Zhao",
      "Juan Tapia",
      "Lazaro Gonzalez-Soler",
      "Carlos Aravena",
      "Daniel Schulz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.05337",
    "title": "Atom: Neural Traffic Compression with Spatio-Temporal Graph Neural  Networks",
    "abstract": "Storing network traffic data is key to efficient network management; however, it is becoming more challenging and costly due to the ever-increasing data transmission rates, traffic volumes, and connected devices. In this paper, we explore the use of neural architectures for network traffic compression. Specifically, we consider a network scenario with multiple measurement points in a network topology. Such measurements can be interpreted as multiple time series that exhibit spatial and temporal correlations induced by network topology, routing, or user behavior. We present \\textit{Atom}, a neural traffic compression method that leverages spatial and temporal correlations present in network traffic. \\textit{Atom} implements a customized spatio-temporal graph neural network design that effectively exploits both types of correlations simultaneously. The experimental results show that \\textit{Atom} can outperform GZIP's compression ratios by 50\\%-65\\% on three real-world networks. ",
    "url": "https://arxiv.org/abs/2311.05337",
    "authors": [
      "Paul Almasan",
      "Krzysztof Rusek",
      "Shihan Xiao",
      "Xiang Shi",
      "Xiangle Cheng",
      "Albert Cabellos-Aparicio",
      "Pere Barlet-Ros"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2311.05371",
    "title": "Training Robust Deep Physiological Measurement Models with Synthetic  Video-based Data",
    "abstract": "Recent advances in supervised deep learning techniques have demonstrated the possibility to remotely measure human physiological vital signs (e.g., photoplethysmograph, heart rate) just from facial videos. However, the performance of these methods heavily relies on the availability and diversity of real labeled data. Yet, collecting large-scale real-world data with high-quality labels is typically challenging and resource intensive, which also raises privacy concerns when storing personal bio-metric data. Synthetic video-based datasets (e.g., SCAMPS~\\cite{mcduff2022scamps}) with photo-realistic synthesized avatars are introduced to alleviate the issues while providing high-quality synthetic data. However, there exists a significant gap between synthetic and real-world data, which hinders the generalization of neural models trained on these synthetic datasets. In this paper, we proposed several measures to add real-world noise to synthetic physiological signals and corresponding facial videos. We experimented with individual and combined augmentation methods and evaluated our framework on three public real-world datasets. Our results show that we were able to reduce the average MAE from 6.9 to 2.0. ",
    "url": "https://arxiv.org/abs/2311.05371",
    "authors": [
      "Yuxuan Ou",
      "Yuzhe Zhang",
      "Yuntang Wang",
      "Shwetak Patel",
      "Daniel McDuf",
      "Xin Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.05379",
    "title": "Memorisation Cartography: Mapping out the Memorisation-Generalisation  Continuum in Neural Machine Translation",
    "abstract": "When training a neural network, it will quickly memorise some source-target mappings from your dataset but never learn some others. Yet, memorisation is not easily expressed as a binary feature that is good or bad: individual datapoints lie on a memorisation-generalisation continuum. What determines a datapoint's position on that spectrum, and how does that spectrum influence neural models' performance? We address these two questions for neural machine translation (NMT) models. We use the counterfactual memorisation metric to (1) build a resource that places 5M NMT datapoints on a memorisation-generalisation map, (2) illustrate how the datapoints' surface-level characteristics and a models' per-datum training signals are predictive of memorisation in NMT, (3) and describe the influence that subsets of that map have on NMT systems' performance. ",
    "url": "https://arxiv.org/abs/2311.05379",
    "authors": [
      "Verna Dankers",
      "Ivan Titov",
      "Dieuwke Hupkes"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.05400",
    "title": "SIRE: scale-invariant, rotation-equivariant estimation of artery  orientations using graph neural networks",
    "abstract": "Blood vessel orientation as visualized in 3D medical images is an important descriptor of its geometry that can be used for centerline extraction and subsequent segmentation and visualization. Arteries appear at many scales and levels of tortuosity, and determining their exact orientation is challenging. Recent works have used 3D convolutional neural networks (CNNs) for this purpose, but CNNs are sensitive to varying vessel sizes and orientations. We present SIRE: a scale-invariant, rotation-equivariant estimator for local vessel orientation. SIRE is modular and can generalise due to symmetry preservation. SIRE consists of a gauge equivariant mesh CNN (GEM-CNN) operating on multiple nested spherical meshes with different sizes in parallel. The features on each mesh are a projection of image intensities within the corresponding sphere. These features are intrinsic to the sphere and, in combination with the GEM-CNN, lead to SO(3)-equivariance. Approximate scale invariance is achieved by weight sharing and use of a symmetric maximum function to combine multi-scale predictions. Hence, SIRE can be trained with arbitrarily oriented vessels with varying radii to generalise to vessels with a wide range of calibres and tortuosity. We demonstrate the efficacy of SIRE using three datasets containing vessels of varying scales: the vascular model repository (VMR), the ASOCA coronary artery set, and a set of abdominal aortic aneurysms (AAAs). We embed SIRE in a centerline tracker which accurately tracks AAAs, regardless of the data SIRE is trained with. Moreover, SIRE can be used to track coronary arteries, even when trained only with AAAs. In conclusion, by incorporating SO(3) and scale symmetries, SIRE can determine the orientations of vessels outside of the training domain, forming a robust and data-efficient solution to geometric analysis of blood vessels in 3D medical images. ",
    "url": "https://arxiv.org/abs/2311.05400",
    "authors": [
      "Dieuwertje Alblas",
      "Julian Suk",
      "Christoph Brune",
      "Kak Khee Yeung",
      "Jelmer M. Wolterink"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.05401",
    "title": "SCRITA 2023: Trust, Acceptance and Social Cues in Human-Robot  Interaction",
    "abstract": "This workshop focused on identifying the challenges and dynamics between people and robots to foster short interactions and long-lasting relationships in different fields, from educational, service, collaborative, companion, care-home and medical robotics. For that, this workshop facilitated a discussion about people's trust towards robots \"in the field\", inviting workshop participants to contribute their past experiences and lessons learnt. ",
    "url": "https://arxiv.org/abs/2311.05401",
    "authors": [
      "Alessandra Rossi",
      "Patrick Holthaus",
      "Gabriella Lakatos",
      "Sílvia Moros",
      "Lewis Riches"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.05404",
    "title": "A Survey on Privacy of Health Data Lifecycle: A Taxonomy, Review, and  Future Directions",
    "abstract": "With the increasing breaches and security threats that endanger health data, ensuring patients' privacy is essential. To that end, the research community has proposed various privacy-preserving approaches based on cryptography, hashing, or ledger technologies for alleviating health data vulnerability. To establish a comprehensive understanding of health data privacy risks, and the benefits and limitations of existing privacy-preserving approaches, we perform a detailed review of existing work and distill 10 distinct privacy concerns occurring in a health data lifecycle. Furthermore, we classify existing approaches based on their applicability to particular privacy concerns occurring at a particular lifecycle stage. Finally, we propose a taxonomy of techniques used for privacy preservation in healthcare and triangulate those techniques with the lifecycle stages and concerns. Our review indicates heavy usage of cryptographical techniques in this domain. However, we have also found that healthcare systems have special requirements that require novel cryptographic techniques and security schemes to address special needs. Therefore, we identify several future research directions to mitigate the security challenges for privacy preservation in health data management. ",
    "url": "https://arxiv.org/abs/2311.05404",
    "authors": [
      "Sunanda Bose",
      "Dusica Marijan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.05410",
    "title": "Linear Gaussian Bounding Box Representation and Ring-Shaped Rotated  Convolution for Oriented Object Detection",
    "abstract": "Due to the frequent variability of object orientation, accurate prediction of orientation information remains a challenge in oriented object detection. To better extract orientation-related information, current methods primarily focus on the design of reasonable representations of oriented bounding box (OBB) and rotation-sensitive feature extraction. However, existing OBB representations often suffer from boundary discontinuity and representation ambiguity problems. Methods of designing continuous and unambiguous regression losses do not essentially solve such problems. Gaussian bounding box (GBB) avoids these OBB representation problems, but directly regressing GBB is susceptible to numerical instability. In this paper, we propose linear GBB (LGBB), a novel OBB representation. By linearly transforming the elements of GBB, LGBB does not have the boundary discontinuity and representation ambiguity problems, and have high numerical stability. On the other hand, current rotation-sensitive feature extraction methods based on convolutions can only extract features under a local receptive field, which is slow in aggregating rotation-sensitive features. To address this issue, we propose ring-shaped rotated convolution (RRC). By adaptively rotating feature maps to arbitrary orientations, RRC extracts rotation-sensitive features under a ring-shaped receptive field, rapidly aggregating rotation-sensitive features and contextual information. RRC can be applied to various models in a plug-and-play manner. Experimental results demonstrate that the proposed LGBB and RRC are effective and achieve state-of-the-art (SOTA) performance. By integrating LGBB and RRC into various models, the detection accuracy is effectively improved on DOTA and HRSC2016 datasets. ",
    "url": "https://arxiv.org/abs/2311.05410",
    "authors": [
      "Zhen Zhou",
      "Yunkai Ma",
      "Junfeng Fan",
      "Zhaoyang Liu",
      "Fengshui Jing",
      "Min Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.05420",
    "title": "Counterfactually Fair Representation",
    "abstract": "The use of machine learning models in high-stake applications (e.g., healthcare, lending, college admission) has raised growing concerns due to potential biases against protected social groups. Various fairness notions and methods have been proposed to mitigate such biases. In this work, we focus on Counterfactual Fairness (CF), a fairness notion that is dependent on an underlying causal graph and first proposed by Kusner \\textit{et al.}~\\cite{kusner2017counterfactual}; it requires that the outcome an individual perceives is the same in the real world as it would be in a \"counterfactual\" world, in which the individual belongs to another social group. Learning fair models satisfying CF can be challenging. It was shown in \\cite{kusner2017counterfactual} that a sufficient condition for satisfying CF is to \\textbf{not} use features that are descendants of sensitive attributes in the causal graph. This implies a simple method that learns CF models only using non-descendants of sensitive attributes while eliminating all descendants. Although several subsequent works proposed methods that use all features for training CF models, there is no theoretical guarantee that they can satisfy CF. In contrast, this work proposes a new algorithm that trains models using all the available features. We theoretically and empirically show that models trained with this method can satisfy CF\\footnote{The code repository for this work can be found in \\url{https://github.com/osu-srml/CF_Representation_Learning}}. ",
    "url": "https://arxiv.org/abs/2311.05420",
    "authors": [
      "Zhiqun Zuo",
      "Mohammad Mahdi Khalili",
      "Xueru Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2311.05421",
    "title": "Diffusion Based Causal Representation Learning",
    "abstract": "Causal reasoning can be considered a cornerstone of intelligent systems. Having access to an underlying causal graph comes with the promise of cause-effect estimation and the identification of efficient and safe interventions. However, learning causal representations remains a major challenge, due to the complexity of many real-world systems. Previous works on causal representation learning have mostly focused on Variational Auto-Encoders (VAE). These methods only provide representations from a point estimate, and they are unsuitable to handle high dimensions. To overcome these problems, we proposed a new Diffusion-based Causal Representation Learning (DCRL) algorithm. This algorithm uses diffusion-based representations for causal discovery. DCRL offers access to infinite dimensional latent codes, which encode different levels of information in the latent code. In a first proof of principle, we investigate the use of DCRL for causal representation learning. We further demonstrate experimentally that this approach performs comparably well in identifying the causal structure and causal variables. ",
    "url": "https://arxiv.org/abs/2311.05421",
    "authors": [
      "Amir Mohammad Karimi Mamaghan",
      "Andrea Dittadi",
      "Stefan Bauer",
      "Karl Henrik Johansson",
      "Francesco Quinzan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2311.05425",
    "title": "Active Mining Sample Pair Semantics for Image-text Matching",
    "abstract": "Recently, commonsense learning has been a hot topic in image-text matching. Although it can describe more graphic correlations, commonsense learning still has some shortcomings: 1) The existing methods are based on triplet semantic similarity measurement loss, which cannot effectively match the intractable negative in image-text sample pairs. 2) The weak generalization ability of the model leads to the poor effect of image and text matching on large-scale datasets. According to these shortcomings. This paper proposes a novel image-text matching model, called Active Mining Sample Pair Semantics image-text matching model (AMSPS). Compared with the single semantic learning mode of the commonsense learning model with triplet loss function, AMSPS is an active learning idea. Firstly, the proposed Adaptive Hierarchical Reinforcement Loss (AHRL) has diversified learning modes. Its active learning mode enables the model to more focus on the intractable negative samples to enhance the discriminating ability. In addition, AMSPS can also adaptively mine more hidden relevant semantic representations from uncommented items, which greatly improves the performance and generalization ability of the model. Experimental results on Flickr30K and MSCOCO universal datasets show that our proposed method is superior to advanced comparison methods. ",
    "url": "https://arxiv.org/abs/2311.05425",
    "authors": [
      "Yongfeng Chena",
      "Jin Liua",
      "Zhijing Yang",
      "Ruihan Chena",
      "Junpeng Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.05435",
    "title": "Parkinson's Disease Detection through Vocal Biomarkers and Advanced  Machine Learning Algorithms: A Comprehensive Study",
    "abstract": "Parkinson's disease (PD) is a prevalent neurodegenerative disorder known for its impact on motor neurons, causing symptoms like tremors, stiffness, and gait difficulties. This study explores the potential of vocal feature alterations in PD patients as a means of early disease prediction. This research aims to predict the onset of Parkinson's disease. Utilizing a variety of advanced machine-learning algorithms, including XGBoost, LightGBM, Bagging, AdaBoost, and Support Vector Machine, among others, the study evaluates the predictive performance of these models using metrics such as accuracy, area under the curve (AUC), sensitivity, and specificity. The findings of this comprehensive analysis highlight LightGBM as the most effective model, achieving an impressive accuracy rate of 96%, alongside a matching AUC of 96%. LightGBM exhibited a remarkable sensitivity of 100% and specificity of 94.43%, surpassing other machine learning algorithms in accuracy and AUC scores. Given the complexities of Parkinson's disease and its challenges in early diagnosis, this study underscores the significance of leveraging vocal biomarkers coupled with advanced machine-learning techniques for precise and timely PD detection. ",
    "url": "https://arxiv.org/abs/2311.05435",
    "authors": [
      "Md Abu Sayed",
      "Sabbir Ahamed",
      "Duc M Cao",
      "Md Eyasin Ul Islam Pavel",
      "Malay Sarkar",
      "Md Tuhin Mia"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2311.05450",
    "title": "Cognitively Inspired Components for Social Conversational Agents",
    "abstract": "Current conversational agents (CA) have seen improvement in conversational quality in recent years due to the influence of large language models (LLMs) like GPT3. However, two key categories of problem remain. Firstly there are the unique technical problems resulting from the approach taken in creating the CA, such as scope with retrieval agents and the often nonsensical answers of former generative agents. Secondly, humans perceive CAs as social actors, and as a result expect the CA to adhere to social convention. Failure on the part of the CA in this respect can lead to a poor interaction and even the perception of threat by the user. As such, this paper presents a survey highlighting a potential solution to both categories of problem through the introduction of cognitively inspired additions to the CA. Through computational facsimiles of semantic and episodic memory, emotion, working memory, and the ability to learn, it is possible to address both the technical and social problems encountered by CAs. ",
    "url": "https://arxiv.org/abs/2311.05450",
    "authors": [
      "Alex Clay",
      "Eduardo Alonso",
      "Esther Mondragón"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.05470",
    "title": "Designing ship hull forms using generative adversarial networks",
    "abstract": "We proposed a GAN-based method to generate a ship hull form. Unlike mathematical hull forms that require geometrical parameters to generate ship hull forms, the proposed method requires desirable ship performance parameters, i.e., the drag coefficient and tonnage. The requirements of ship owners are generally focused on the ship performance and not the geometry itself. Hence, the proposed model is useful for obtaining the ship hull form based on an owner's requirements. The GAN model was trained using a ship hull form dataset generated using the generalized Wigley hull form. The proposed method was evaluated through numerical experiments and successfully generated ship data with small errors. ",
    "url": "https://arxiv.org/abs/2311.05470",
    "authors": [
      "Kazuo Yonekura",
      "Kotaro Omori",
      "Xinran Qi",
      "Katsuyuki Suzuki"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2311.05472",
    "title": "Text Representation Distillation via Information Bottleneck Principle",
    "abstract": "Pre-trained language models (PLMs) have recently shown great success in text representation field. However, the high computational cost and high-dimensional representation of PLMs pose significant challenges for practical applications. To make models more accessible, an effective method is to distill large models into smaller representation models. In order to relieve the issue of performance degradation after distillation, we propose a novel Knowledge Distillation method called IBKD. This approach is motivated by the Information Bottleneck principle and aims to maximize the mutual information between the final representation of the teacher and student model, while simultaneously reducing the mutual information between the student model's representation and the input data. This enables the student model to preserve important learned information while avoiding unnecessary information, thus reducing the risk of over-fitting. Empirical studies on two main downstream applications of text representation (Semantic Textual Similarity and Dense Retrieval tasks) demonstrate the effectiveness of our proposed approach. ",
    "url": "https://arxiv.org/abs/2311.05472",
    "authors": [
      "Yanzhao Zhang",
      "Dingkun Long",
      "Zehan Li",
      "Pengjun Xie"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.05473",
    "title": "Do Ensembling and Meta-Learning Improve Outlier Detection in Randomized  Controlled Trials?",
    "abstract": "Modern multi-centre randomized controlled trials (MCRCTs) collect massive amounts of tabular data, and are monitored intensively for irregularities by humans. We began by empirically evaluating 6 modern machine learning-based outlier detection algorithms on the task of identifying irregular data in 838 datasets from 7 real-world MCRCTs with a total of 77,001 patients from over 44 countries. Our results reinforce key findings from prior work in the outlier detection literature on data from other domains. Existing algorithms often succeed at identifying irregularities without any supervision, with at least one algorithm exhibiting positive performance 70.6% of the time. However, performance across datasets varies substantially with no single algorithm performing consistently well, motivating new techniques for unsupervised model selection or other means of aggregating potentially discordant predictions from multiple candidate models. We propose the Meta-learned Probabilistic Ensemble (MePE), a simple algorithm for aggregating the predictions of multiple unsupervised models, and show that it performs favourably compared to recent meta-learning approaches for outlier detection model selection. While meta-learning shows promise, small ensembles outperform all forms of meta-learning on average, a negative result that may guide the application of current outlier detection approaches in healthcare and other real-world domains. ",
    "url": "https://arxiv.org/abs/2311.05473",
    "authors": [
      "Walter Nelson",
      "Jonathan Ranisau",
      "Jeremy Petch"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.05474",
    "title": "On the Complexity of the Virtual Network Embedding in Specific Tree  Topologies",
    "abstract": "Virtual networks are an innovative abstraction that extends cloud computing concepts to the network: by supporting bandwidth reservations between compute nodes (e.g., virtual machines), virtual networks can provide a predictable performance to distributed and communication-intensive cloud applications. However, in order to make the most efficient use of the shared resources, the Virtual Network Embedding (VNE) problem has to be solved: a virtual network should be mapped onto the given physical network so that resource reservations are minimized. The problem has been studied intensively already and is known to be NP-hard in general. In this paper, we revisit this problem and consider it on specific topologies, as they often arise in practice. To be more precise, we study the weighted version of the VNE problem: we consider a virtual weighted network of a specific topology which we want to embed onto a weighted network with capacities and specific topology. As for topologies, we consider most fundamental and commonly used ones: line, star, $2$-tiered star, oversubscribed $2$-tiered star, and tree, in addition to also considering arbitrary topologies. We show that typically the VNE problem is NP-hard even in more specialized cases, however, sometimes there exists a polynomial algorithm: for example, an embedding of the oversubscribed $2$-tiered star onto the tree is polynomial while an embedding of an arbitrary $2$-tiered star is not. ",
    "url": "https://arxiv.org/abs/2311.05474",
    "authors": [
      "Sergey Pankratov",
      "Vitaly Aksenov",
      "Stefan Schmid"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2311.05478",
    "title": "Robust Retraining-free GAN Fingerprinting via Personalized Normalization",
    "abstract": "In recent years, there has been significant growth in the commercial applications of generative models, licensed and distributed by model developers to users, who in turn use them to offer services. In this scenario, there is a need to track and identify the responsible user in the presence of a violation of the license agreement or any kind of malicious usage. Although there are methods enabling Generative Adversarial Networks (GANs) to include invisible watermarks in the images they produce, generating a model with a different watermark, referred to as a fingerprint, for each user is time- and resource-consuming due to the need to retrain the model to include the desired fingerprint. In this paper, we propose a retraining-free GAN fingerprinting method that allows model developers to easily generate model copies with the same functionality but different fingerprints. The generator is modified by inserting additional Personalized Normalization (PN) layers whose parameters (scaling and bias) are generated by two dedicated shallow networks (ParamGen Nets) taking the fingerprint as input. A watermark decoder is trained simultaneously to extract the fingerprint from the generated images. The proposed method can embed different fingerprints inside the GAN by just changing the input of the ParamGen Nets and performing a feedforward pass, without finetuning or retraining. The performance of the proposed method in terms of robustness against both model-level and image-level attacks is also superior to the state-of-the-art. ",
    "url": "https://arxiv.org/abs/2311.05478",
    "authors": [
      "Jianwei Fei",
      "Zhihua Xia",
      "Benedetta Tondi",
      "Mauro Barni"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2311.05481",
    "title": "meta4: semantically-aligned generation of metaphoric gestures using  self-supervised text and speech representation",
    "abstract": "Image Schemas are repetitive cognitive patterns that influence the way we conceptualize and reason about various concepts present in speech. These patterns are deeply embedded within our cognitive processes and are reflected in our bodily expressions including gestures. Particularly, metaphoric gestures possess essential characteristics and semantic meanings that align with Image Schemas, to visually represent abstract concepts. The shape and form of gestures can convey abstract concepts, such as extending the forearm and hand or tracing a line with hand movements to visually represent the image schema of PATH. Previous behavior generation models have primarily focused on utilizing speech (acoustic features and text) to drive the generation model of virtual agents. They have not considered key semantic information as those carried by Image Schemas to effectively generate metaphoric gestures. To address this limitation, we introduce META4, a deep learning approach that generates metaphoric gestures from both speech and Image Schemas. Our approach has two primary goals: computing Image Schemas from input text to capture the underlying semantic and metaphorical meaning, and generating metaphoric gestures driven by speech and the computed image schemas. Our approach is the first method for generating speech driven metaphoric gestures while leveraging the potential of Image Schemas. We demonstrate the effectiveness of our approach and highlight the importance of both speech and image schemas in modeling metaphoric gestures. ",
    "url": "https://arxiv.org/abs/2311.05481",
    "authors": [
      "Mireille Fares",
      "Catherine Pelachaud",
      "Nicolas Obin"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.05494",
    "title": "Object-centric Cross-modal Feature Distillation for Event-based Object  Detection",
    "abstract": "Event cameras are gaining popularity due to their unique properties, such as their low latency and high dynamic range. One task where these benefits can be crucial is real-time object detection. However, RGB detectors still outperform event-based detectors due to the sparsity of the event data and missing visual details. In this paper, we develop a novel knowledge distillation approach to shrink the performance gap between these two modalities. To this end, we propose a cross-modality object detection distillation method that by design can focus on regions where the knowledge distillation works best. We achieve this by using an object-centric slot attention mechanism that can iteratively decouple features maps into object-centric features and corresponding pixel-features used for distillation. We evaluate our novel distillation approach on a synthetic and a real event dataset with aligned grayscale images as a teacher modality. We show that object-centric distillation allows to significantly improve the performance of the event-based student object detector, nearly halving the performance gap with respect to the teacher. ",
    "url": "https://arxiv.org/abs/2311.05494",
    "authors": [
      "Lei Li",
      "Alexander Liniger",
      "Mario Millhaeusler",
      "Vagia Tsiminaki",
      "Yuanyou Li",
      "Dengxin Dai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.05498",
    "title": "Trust your BMS: Designing a Lightweight Authentication Architecture for  Industrial Networks",
    "abstract": "With the advent of clean energy awareness and systems that rely on extensive battery usage, the community has seen an increased interest in the development of more complex and secure Battery Management Systems (BMS). In particular, the inclusion of BMS in modern complex systems like electric vehicles and power grids has presented a new set of security-related challenges. A concern is shown when BMS are intended to extend their communication with external system networks, as their interaction can leave many backdoors open that potential attackers could exploit. Hence, it is highly desirable to find a general design that can be used for BMS and its system inclusion. In this work, a security architecture solution is proposed intended for the communication between BMS and other system devices. The aim of the proposed architecture is to be easily applicable in different industrial settings and systems, while at the same time keeping the design lightweight in nature. ",
    "url": "https://arxiv.org/abs/2311.05498",
    "authors": [
      "Fikret Basic",
      "Christian Steger",
      "Christian Seifert",
      "Robert Kofler"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)",
      "Software Engineering (cs.SE)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.05499",
    "title": "Measuring the Prevalence of WiFi Bottlenecks in Home Access Networks",
    "abstract": "As broadband Internet speeds continue to increase, the home wireless (\"WiFi\") network may more frequently become a performance bottleneck. Past research, now nearly a decade old, initially documented this phenomenon through indirect inference techniques, noting the prevalence of WiFi bottlenecks but never directly measuring them. In the intervening years, access network (and WiFi) speeds have increased, warranting a re-appraisal of this important question, particularly with renewed private and federal investment in access network infrastructure. This paper studies this question, developing a new system and measurement technique to perform direct measurements of WiFi and access network performance, ultimately collecting and analyzing a first-of-its-kind dataset of more than 13,000 joint measurements of WiFi and access network throughputs, in a real-world deployment spanning more than 50 homes, for nearly two years. Using this dataset, we re-examine the question of whether, when, and to what extent a user's home wireless network may be a performance bottleneck, particularly relative to their access connection. We do so by directly and continuously measuring the user's Internet performance along two separate components of the Internet path -- from a wireless client inside the home network to the wired point of access (e.g., the cable modem), and from the wired point of access to the user's ISP. Confirming and revising results from more than a decade ago, we find that a user's home wireless network is often the throughput bottleneck. In particular, for users with access links that exceed 800~Mbps, the user's home wireless network was the performance bottleneck 100% of the time. ",
    "url": "https://arxiv.org/abs/2311.05499",
    "authors": [
      "Ranya Sharma",
      "Marc Richardson",
      "Guilherme Martins",
      "Nick Feamster"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2311.05521",
    "title": "BakedAvatar: Baking Neural Fields for Real-Time Head Avatar Synthesis",
    "abstract": "Synthesizing photorealistic 4D human head avatars from videos is essential for VR/AR, telepresence, and video game applications. Although existing Neural Radiance Fields (NeRF)-based methods achieve high-fidelity results, the computational expense limits their use in real-time applications. To overcome this limitation, we introduce BakedAvatar, a novel representation for real-time neural head avatar synthesis, deployable in a standard polygon rasterization pipeline. Our approach extracts deformable multi-layer meshes from learned isosurfaces of the head and computes expression-, pose-, and view-dependent appearances that can be baked into static textures for efficient rasterization. We thus propose a three-stage pipeline for neural head avatar synthesis, which includes learning continuous deformation, manifold, and radiance fields, extracting layered meshes and textures, and fine-tuning texture details with differential rasterization. Experimental results demonstrate that our representation generates synthesis results of comparable quality to other state-of-the-art methods while significantly reducing the inference time required. We further showcase various head avatar synthesis results from monocular videos, including view synthesis, face reenactment, expression editing, and pose editing, all at interactive frame rates. ",
    "url": "https://arxiv.org/abs/2311.05521",
    "authors": [
      "Hao-Bin Duan",
      "Miao Wang",
      "Jin-Chuan Shi",
      "Xu-Chuan Chen",
      "Yan-Pei Cao"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.05538",
    "title": "Embedding Space Interpolation Beyond Mini-Batch, Beyond Pairs and Beyond  Examples",
    "abstract": "Mixup refers to interpolation-based data augmentation, originally motivated as a way to go beyond empirical risk minimization (ERM). Its extensions mostly focus on the definition of interpolation and the space (input or feature) where it takes place, while the augmentation process itself is less studied. In most methods, the number of generated examples is limited to the mini-batch size and the number of examples being interpolated is limited to two (pairs), in the input space. We make progress in this direction by introducing MultiMix, which generates an arbitrarily large number of interpolated examples beyond the mini-batch size and interpolates the entire mini-batch in the embedding space. Effectively, we sample on the entire convex hull of the mini-batch rather than along linear segments between pairs of examples. On sequence data, we further extend to Dense MultiMix. We densely interpolate features and target labels at each spatial location and also apply the loss densely. To mitigate the lack of dense labels, we inherit labels from examples and weight interpolation factors by attention as a measure of confidence. Overall, we increase the number of loss terms per mini-batch by orders of magnitude at little additional cost. This is only possible because of interpolating in the embedding space. We empirically show that our solutions yield significant improvement over state-of-the-art mixup methods on four different benchmarks, despite interpolation being only linear. By analyzing the embedding space, we show that the classes are more tightly clustered and uniformly spread over the embedding space, thereby explaining the improved behavior. ",
    "url": "https://arxiv.org/abs/2311.05538",
    "authors": [
      "Shashanka Venkataramanan",
      "Ewa Kijak",
      "Laurent Amsaleg",
      "Yannis Avrithis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.05548",
    "title": "L-WaveBlock: A Novel Feature Extractor Leveraging Wavelets for  Generative Adversarial Networks",
    "abstract": "Generative Adversarial Networks (GANs) have risen to prominence in the field of deep learning, facilitating the generation of realistic data from random noise. The effectiveness of GANs often depends on the quality of feature extraction, a critical aspect of their architecture. This paper introduces L-WaveBlock, a novel and robust feature extractor that leverages the capabilities of the Discrete Wavelet Transform (DWT) with deep learning methodologies. L-WaveBlock is catered to quicken the convergence of GAN generators while simultaneously enhancing their performance. The paper demonstrates the remarkable utility of L-WaveBlock across three datasets, a road satellite imagery dataset, the CelebA dataset and the GoPro dataset, showcasing its ability to ease feature extraction and make it more efficient. By utilizing DWT, L-WaveBlock efficiently captures the intricate details of both structural and textural details, and further partitions feature maps into orthogonal subbands across multiple scales while preserving essential information at the same time. Not only does it lead to faster convergence, but also gives competent results on every dataset by employing the L-WaveBlock. The proposed method achieves an Inception Score of 3.6959 and a Structural Similarity Index of 0.4261 on the maps dataset, a Peak Signal-to-Noise Ratio of 29.05 and a Structural Similarity Index of 0.874 on the CelebA dataset. The proposed method performs competently to the state-of-the-art for the image denoising dataset, albeit not better, but still leads to faster convergence than conventional methods. With this, L-WaveBlock emerges as a robust and efficient tool for enhancing GAN-based image generation, demonstrating superior convergence speed and competitive performance across multiple datasets for image resolution, image generation and image denoising. ",
    "url": "https://arxiv.org/abs/2311.05548",
    "authors": [
      "Mirat Shah",
      "Vansh Jain",
      "Anmol Chokshi",
      "Guruprasad Parasnis",
      "Pramod Bide"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2311.05579",
    "title": "SigScatNet: A Siamese + Scattering based Deep Learning Approach for  Signature Forgery Detection and Similarity Assessment",
    "abstract": "The surge in counterfeit signatures has inflicted widespread inconveniences and formidable challenges for both individuals and organizations. This groundbreaking research paper introduces SigScatNet, an innovative solution to combat this issue by harnessing the potential of a Siamese deep learning network, bolstered by Scattering wavelets, to detect signature forgery and assess signature similarity. The Siamese Network empowers us to ascertain the authenticity of signatures through a comprehensive similarity index, enabling precise validation and comparison. Remarkably, the integration of Scattering wavelets endows our model with exceptional efficiency, rendering it light enough to operate seamlessly on cost-effective hardware systems. To validate the efficacy of our approach, extensive experimentation was conducted on two open-sourced datasets: the ICDAR SigComp Dutch dataset and the CEDAR dataset. The experimental results demonstrate the practicality and resounding success of our proposed SigScatNet, yielding an unparalleled Equal Error Rate of 3.689% with the ICDAR SigComp Dutch dataset and an astonishing 0.0578% with the CEDAR dataset. Through the implementation of SigScatNet, our research spearheads a new state-of-the-art in signature analysis in terms of EER scores and computational efficiency, offering an advanced and accessible solution for detecting forgery and quantifying signature similarities. By employing cutting-edge Siamese deep learning and Scattering wavelets, we provide a robust framework that paves the way for secure and efficient signature verification systems. ",
    "url": "https://arxiv.org/abs/2311.05579",
    "authors": [
      "Anmol Chokshi",
      "Vansh Jain",
      "Rajas Bhope",
      "Sudhir Dhage"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2311.05580",
    "title": "Inference for Probabilistic Dependency Graphs",
    "abstract": "Probabilistic dependency graphs (PDGs) are a flexible class of probabilistic graphical models, subsuming Bayesian Networks and Factor Graphs. They can also capture inconsistent beliefs, and provide a way of measuring the degree of this inconsistency. We present the first tractable inference algorithm for PDGs with discrete variables, making the asymptotic complexity of PDG inference similar that of the graphical models they generalize. The key components are: (1) the observation that, in many cases, the distribution a PDG specifies can be formulated as a convex optimization problem (with exponential cone constraints), (2) a construction that allows us to express these problems compactly for PDGs of boundeed treewidth, (3) contributions to the theory of PDGs that justify the construction, and (4) an appeal to interior point methods that can solve such problems in polynomial time. We verify the correctness and complexity of our approach, and provide an implementation of it. We then evaluate our implementation, and demonstrate that it outperforms baseline approaches. Our code is available at this http URL ",
    "url": "https://arxiv.org/abs/2311.05580",
    "authors": [
      "Oliver E. Richardson",
      "Joseph Y. Halpern",
      "Christopher De Sa"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Artificial Intelligence (cs.AI)",
      "Computational Complexity (cs.CC)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2311.05582",
    "title": "Joint SDN Synchronization and Controller Placement in Wireless Networks  using Deep Reinforcement Learning",
    "abstract": "Software Defined Networking has afforded numerous benefits to the network users but there are certain persisting issues with this technology, two of which are scalability and privacy. The natural solution to overcoming these limitations is a distributed SDN controller architecture where multiple controllers are deployed over the network, with each controller orchestrating a certain segment of the network. However, since the centralized control is the key attribute of SDN that allows it to be so beneficial, a centralized logical view of the network will have to be maintained by each of these controllers; this can be done through synchronization of the distributed controllers, where each controller communicates with the others to ensure that they remain informed about the entire network. There is however a network cost associated with constantly having to update each others about different aspects of the network, which will become a greater issue in dynamic wireless networks. To minimize this network cost, there is a need to consider not only when to get the update information from the neighboring controllers, but also where to dynamically place the controllers such that the network costs may be minimized. The placement should take into consideration both communication for synchronization among the distributed controllers and communication of the controllers with the network devices that they manage. In this work, we show that our multi-objective deep reinforcement learning-based method performs the best at achieving different application goals by developing policy for controller synchronization as well as placement, outperforming different other possible approaches, under a wide variety of network conditions. ",
    "url": "https://arxiv.org/abs/2311.05582",
    "authors": [
      "Akrit Mudvari",
      "Leandros Tassiulas"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2311.05607",
    "title": "Real-Time Neural Rasterization for Large Scenes",
    "abstract": "We propose a new method for realistic real-time novel-view synthesis (NVS) of large scenes. Existing neural rendering methods generate realistic results, but primarily work for small scale scenes (<50 square meters) and have difficulty at large scale (>10000 square meters). Traditional graphics-based rasterization rendering is fast for large scenes but lacks realism and requires expensive manually created assets. Our approach combines the best of both worlds by taking a moderate-quality scaffold mesh as input and learning a neural texture field and shader to model view-dependant effects to enhance realism, while still using the standard graphics pipeline for real-time rendering. Our method outperforms existing neural rendering methods, providing at least 30x faster rendering with comparable or better realism for large self-driving and drone scenes. Our work is the first to enable real-time rendering of large real-world scenes. ",
    "url": "https://arxiv.org/abs/2311.05607",
    "authors": [
      "Jeffrey Yunfan Liu",
      "Yun Chen",
      "Ze Yang",
      "Jingkang Wang",
      "Sivabalan Manivasagam",
      "Raquel Urtasun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2311.04946",
    "title": "Causal Inference on Investment Constraints and Non-stationarity in  Dynamic Portfolio Optimization through Reinforcement Learning",
    "abstract": "In this study, we have developed a dynamic asset allocation investment strategy using reinforcement learning techniques. To begin with, we have addressed the crucial issue of incorporating non-stationarity of financial time series data into reinforcement learning algorithms, which is a significant implementation in the application of reinforcement learning in investment strategies. Our findings highlight the significance of introducing certain variables such as regime change in the environment setting to enhance the prediction accuracy. Furthermore, the application of reinforcement learning in investment strategies provides a remarkable advantage of setting the optimization problem flexibly. This enables the integration of practical constraints faced by investors into the algorithm, resulting in efficient optimization. Our study has categorized the investment strategy formulation conditions into three main categories, including performance measurement indicators, portfolio management rules, and other constraints. We have evaluated the impact of incorporating these conditions into the environment and rewards in a reinforcement learning framework and examined how they influence investment behavior. ",
    "url": "https://arxiv.org/abs/2311.04946",
    "authors": [
      "Yasuhiro Nakayama",
      "Tomochika Sawaki"
    ],
    "subjectives": [
      "Portfolio Management (q-fin.PM)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.04965",
    "title": "Expressibility-induced Concentration of Quantum Neural Tangent Kernels",
    "abstract": "Quantum tangent kernel methods provide an efficient approach to analyzing the performance of quantum machine learning models in the infinite-width limit, which is of crucial importance in designing appropriate circuit architectures for certain learning tasks. Recently, they have been adapted to describe the convergence rate of training errors in quantum neural networks in an analytical manner. Here, we study the connections between the trainability and expressibility of quantum tangent kernel models. In particular, for global loss functions, we rigorously prove that high expressibility of both the global and local quantum encodings can lead to exponential concentration of quantum tangent kernel values to zero. Whereas for local loss functions, such issue of exponential concentration persists owing to the high expressibility, but can be partially mitigated. We further carry out extensive numerical simulations to support our analytical theories. Our discoveries unveil a pivotal characteristic of quantum neural tangent kernels, offering valuable insights for the design of wide quantum variational circuit models in practical applications. ",
    "url": "https://arxiv.org/abs/2311.04965",
    "authors": [
      "Li-Wei Yu",
      "Weikang Li",
      "Qi Ye",
      "Zhide Lu",
      "Zizhao Han",
      "Dong-Ling Deng"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.05135",
    "title": "Improving Computational Efficiency for Powered Descent Guidance via  Transformer-based Tight Constraint Prediction",
    "abstract": "In this work, we present Transformer-based Powered Descent Guidance (T-PDG), a scalable algorithm for reducing the computational complexity of the direct optimization formulation of the spacecraft powered descent guidance problem. T-PDG uses data from prior runs of trajectory optimization algorithms to train a transformer neural network, which accurately predicts the relationship between problem parameters and the globally optimal solution for the powered descent guidance problem. The solution is encoded as the set of tight constraints corresponding to the constrained minimum-cost trajectory and the optimal final time of landing. By leveraging the attention mechanism of transformer neural networks, large sequences of time series data can be accurately predicted when given only the spacecraft state and landing site parameters. When applied to the real problem of Mars powered descent guidance, T-PDG reduces the time for computing the 3 degree of freedom fuel-optimal trajectory, when compared to lossless convexification, from an order of 1-8 seconds to less than 500 milliseconds. A safe and optimal solution is guaranteed by including a feasibility check in T-PDG before returning the final trajectory. ",
    "url": "https://arxiv.org/abs/2311.05135",
    "authors": [
      "Julia Briden",
      "Trey Gurga",
      "Breanna Johnson",
      "Abhishek Cauligi",
      "Richard Linares"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.05179",
    "title": "Improving Whispered Speech Recognition Performance using  Pseudo-whispered based Data Augmentation",
    "abstract": "Whispering is a distinct form of speech known for its soft, breathy, and hushed characteristics, often used for private communication. The acoustic characteristics of whispered speech differ substantially from normally phonated speech and the scarcity of adequate training data leads to low automatic speech recognition (ASR) performance. To address the data scarcity issue, we use a signal processing-based technique that transforms the spectral characteristics of normal speech to those of pseudo-whispered speech. We augment an End-to-End ASR with pseudo-whispered speech and achieve an 18.2% relative reduction in word error rate for whispered speech compared to the baseline. Results for the individual speaker groups in the wTIMIT database show the best results for US English. Further investigation showed that the lack of glottal information in whispered speech has the largest impact on whispered speech ASR performance. ",
    "url": "https://arxiv.org/abs/2311.05179",
    "authors": [
      "Zhaofeng Lin",
      "Tanvina Patel",
      "Odette Scharenborg"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2311.05407",
    "title": "Data Distillation for Neural Network Potentials toward Foundational  Dataset",
    "abstract": "Machine learning (ML) techniques and atomistic modeling have rapidly transformed materials design and discovery. Specifically, generative models can swiftly propose promising materials for targeted applications. However, the predicted properties of materials through the generative models often do not match with calculated properties through ab initio calculations. This discrepancy can arise because the generated coordinates are not fully relaxed, whereas the many properties are derived from relaxed structures. Neural network-based potentials (NNPs) can expedite the process by providing relaxed structures from the initially generated ones. Nevertheless, acquiring data to train NNPs for this purpose can be extremely challenging as it needs to encompass previously unknown structures. This study utilized extended ensemble molecular dynamics (MD) to secure a broad range of liquid- and solid-phase configurations in one of the metallic systems, nickel. Then, we could significantly reduce them through active learning without losing much accuracy. We found that the NNP trained from the distilled data could predict different energy-minimized closed-pack crystal structures even though those structures were not explicitly part of the initial data. Furthermore, the data can be translated to other metallic systems (aluminum and niobium), without repeating the sampling and distillation processes. Our approach to data acquisition and distillation has demonstrated the potential to expedite NNP development and enhance materials design and discovery by integrating generative models. ",
    "url": "https://arxiv.org/abs/2311.05407",
    "authors": [
      "Gang Seob Jung",
      "Sangkeun Lee",
      "Jong Youl Choi"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2311.05533",
    "title": "Building Hamiltonian Cycles in the Semi-Random Graph Process in Less  Than $2n$ Rounds",
    "abstract": "The semi-random graph process is an adaptive random graph process in which an online algorithm is initially presented an empty graph on $n$ vertices. In each round, a vertex $u$ is presented to the algorithm independently and uniformly at random. The algorithm then adaptively selects a vertex $v$, and adds the edge $uv$ to the graph. For a given graph property, the objective of the algorithm is to force the graph to satisfy this property asymptotically almost surely in as few rounds as possible. We focus on the property of Hamiltonicity. We present an adaptive strategy which creates a Hamiltonian cycle in $\\alpha n$ rounds, where $\\alpha < 1.81696$ is derived from the solution to a system of differential equations. We also show that achieving Hamiltonicity requires at least $\\beta n$ rounds, where $\\beta > 1.26575$. ",
    "url": "https://arxiv.org/abs/2311.05533",
    "authors": [
      "Alan Frieze",
      "Pu Gao",
      "Calum MacRury",
      "Paweł Prałat",
      "Gregory Sorkin"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2311.05546",
    "title": "Multi-Agent Quantum Reinforcement Learning using Evolutionary  Optimization",
    "abstract": "Multi-Agent Reinforcement Learning is becoming increasingly more important in times of autonomous driving and other smart industrial applications. Simultaneously a promising new approach to Reinforcement Learning arises using the inherent properties of quantum mechanics, reducing the trainable parameters of a model significantly. However, gradient-based Multi-Agent Quantum Reinforcement Learning methods often have to struggle with barren plateaus, holding them back from matching the performance of classical approaches. We build upon a existing approach for gradient free Quantum Reinforcement Learning and propose tree approaches with Variational Quantum Circuits for Multi-Agent Reinforcement Learning using evolutionary optimization. We evaluate our approach in the Coin Game environment and compare them to classical approaches. We showed that our Variational Quantum Circuit approaches perform significantly better compared to a neural network with a similar amount of trainable parameters. Compared to the larger neural network, our approaches archive similar results using $97.88\\%$ less parameters. ",
    "url": "https://arxiv.org/abs/2311.05546",
    "authors": [
      "Michael Kölle",
      "Felix Topp",
      "Thomy Phan",
      "Philipp Altmann",
      "Jonas Nüßlein",
      "Claudia Linnhoff-Popien"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:1611.07658",
    "title": "A Network Formation Model Based on Subgraphs",
    "abstract": " Title: A Network Formation Model Based on Subgraphs ",
    "url": "https://arxiv.org/abs/1611.07658",
    "authors": [
      "Arun G. Chandrasekhar",
      "Matthew O. Jackson"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:1902.07497",
    "title": "Analysing Factorizations of Action-Value Networks for Cooperative  Multi-Agent Reinforcement Learning",
    "abstract": " Comments: This work as been accepted as an Extended Abstract in Proc. of the 18th International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2019), N. Agmon, M. E. Taylor, E. Elkind, M. Veloso (eds.), May 2019, Montreal, Canada ",
    "url": "https://arxiv.org/abs/1902.07497",
    "authors": [
      "Jacopo Castellini",
      "Frans A. Oliehoek",
      "Rahul Savani",
      "Shimon Whiteson"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2010.13380",
    "title": "The training accuracy of two-layer neural networks: its estimation and  understanding using random datasets",
    "abstract": " Comments: 11 pages, 6 figures. Accepted by IEEE AIPR 2023 (Oral) ",
    "url": "https://arxiv.org/abs/2010.13380",
    "authors": [
      "Shuyue Guan",
      "Murray Loew"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2204.07501",
    "title": "Evaluating few shot and Contrastive learning Methods for Code Clone  Detection",
    "abstract": " Title: Evaluating few shot and Contrastive learning Methods for Code Clone  Detection ",
    "url": "https://arxiv.org/abs/2204.07501",
    "authors": [
      "Mohamad Khajezade",
      "Fatemeh Hendijani Fard",
      "Mohamed S. Shehata"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2205.08913",
    "title": "Price Interpretability of Prediction Markets: A Convergence Analysis",
    "abstract": " Title: Price Interpretability of Prediction Markets: A Convergence Analysis ",
    "url": "https://arxiv.org/abs/2205.08913",
    "authors": [
      "Dian Yu",
      "Jianjun Gao",
      "Weiping Wu",
      "Zizhuo Wang"
    ],
    "subjectives": [
      "Trading and Market Microstructure (q-fin.TR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.09048",
    "title": "Global Contrast Masked Autoencoders Are Powerful Pathological  Representation Learners",
    "abstract": " Title: Global Contrast Masked Autoencoders Are Powerful Pathological  Representation Learners ",
    "url": "https://arxiv.org/abs/2205.09048",
    "authors": [
      "Hao Quan",
      "Xingyu Li",
      "Weixing Chen",
      "Qun Bai",
      "Mingchen Zou",
      "Ruijie Yang",
      "Tingting Zheng",
      "Ruiqun Qi",
      "Xinghua Gao",
      "Xiaoyu Cui"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.04798",
    "title": "A*Net: A Scalable Path-based Reasoning Approach for Knowledge Graphs",
    "abstract": " Comments: NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2206.04798",
    "authors": [
      "Zhaocheng Zhu",
      "Xinyu Yuan",
      "Mikhail Galkin",
      "Sophie Xhonneux",
      "Ming Zhang",
      "Maxime Gazeau",
      "Jian Tang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.00445",
    "title": "Interpreting Embedding Spaces by Conceptualization",
    "abstract": " Title: Interpreting Embedding Spaces by Conceptualization ",
    "url": "https://arxiv.org/abs/2209.00445",
    "authors": [
      "Adi Simhi",
      "Shaul Markovitch"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.09134",
    "title": "Principled Pruning of Bayesian Neural Networks through Variational Free  Energy Minimization",
    "abstract": " Title: Principled Pruning of Bayesian Neural Networks through Variational Free  Energy Minimization ",
    "url": "https://arxiv.org/abs/2210.09134",
    "authors": [
      "Jim Beckers",
      "Bart van Erp",
      "Ziyue Zhao",
      "Kirill Kondrashov",
      "Bert de Vries"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2210.10962",
    "title": "Optimization on Manifolds via Graph Gaussian Processes",
    "abstract": " Title: Optimization on Manifolds via Graph Gaussian Processes ",
    "url": "https://arxiv.org/abs/2210.10962",
    "authors": [
      "Hwanwoo Kim",
      "Daniel Sanz-Alonso",
      "Ruiyi Yang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2301.08067",
    "title": "Interpreting CNN Predictions using Conditional Generative Adversarial  Networks",
    "abstract": " Title: Interpreting CNN Predictions using Conditional Generative Adversarial  Networks ",
    "url": "https://arxiv.org/abs/2301.08067",
    "authors": [
      "R T Akash Guna",
      "Raul Benitez",
      "O K Sikha"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.10171",
    "title": "Spectral Cross-Domain Neural Network with Soft-adaptive Threshold  Spectral Enhancement",
    "abstract": " Title: Spectral Cross-Domain Neural Network with Soft-adaptive Threshold  Spectral Enhancement ",
    "url": "https://arxiv.org/abs/2301.10171",
    "authors": [
      "Che Liu",
      "Sibo Cheng",
      "Weiping Ding",
      "Rossella Arcucci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2302.01056",
    "title": "Beyond Pretrained Features: Noisy Image Modeling Provides Adversarial  Defense",
    "abstract": " Comments: NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2302.01056",
    "authors": [
      "Zunzhi You",
      "Daochang Liu",
      "Bohyung Han",
      "Chang Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.00618",
    "title": "Robustness of quantum algorithms against coherent control errors",
    "abstract": " Title: Robustness of quantum algorithms against coherent control errors ",
    "url": "https://arxiv.org/abs/2303.00618",
    "authors": [
      "Julian Berberich",
      "Daniel Fink",
      "Christian Holm"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2303.00986",
    "title": "Pay Less But Get More: A Dual-Attention-based Channel Estimation Network  for Massive MIMO Systems with Low-Density Pilots",
    "abstract": " Comments: 16 pages, 9 figures, 6 tables. Accepted by IEEE Transactions on Wireless Communications ",
    "url": "https://arxiv.org/abs/2303.00986",
    "authors": [
      "Binggui Zhou",
      "Xi Yang",
      "Shaodan Ma",
      "Feifei Gao",
      "Guanghua Yang"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.05828",
    "title": "Adapting Contrastive Language-Image Pretrained (CLIP) Models for  Out-of-Distribution Detection",
    "abstract": " Comments: version_02 ",
    "url": "https://arxiv.org/abs/2303.05828",
    "authors": [
      "Nikolas Adaloglou",
      "Felix Michels",
      "Tim Kaiser",
      "Markus Kollmann"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.04234",
    "title": "Variational operator learning: A unified paradigm marrying training  neural operators and solving partial differential equations",
    "abstract": " Comments: This version mainly improves the quality of the bitmaps in the results compared to the previous version ",
    "url": "https://arxiv.org/abs/2304.04234",
    "authors": [
      "Tengfei Xu",
      "Dachuan Liu",
      "Peng Hao",
      "Bo Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2305.10577",
    "title": "Revisiting the Complexity of and Algorithms for the Graph Traversal Edit  Distance and Its Variants",
    "abstract": " Title: Revisiting the Complexity of and Algorithms for the Graph Traversal Edit  Distance and Its Variants ",
    "url": "https://arxiv.org/abs/2305.10577",
    "authors": [
      "Yutong Qiu",
      "Yihang Shen",
      "Carl Kingsford"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Genomics (q-bio.GN)"
    ]
  },
  {
    "id": "arXiv:2305.12396",
    "title": "Joint Feature and Differentiable $ k $-NN Graph Learning using Dirichlet  Energy",
    "abstract": " Comments: Accepted by NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2305.12396",
    "authors": [
      "Lei Xu",
      "Lei Chen",
      "Rong Wang",
      "Feiping Nie",
      "Xuelong Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.13903",
    "title": "Let's Think Frame by Frame with VIP: A Video Infilling and Prediction  Dataset for Evaluating Video Chain-of-Thought",
    "abstract": " Comments: Accepted to the 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP 2023) ",
    "url": "https://arxiv.org/abs/2305.13903",
    "authors": [
      "Vaishnavi Himakunthala",
      "Andy Ouyang",
      "Daniel Rose",
      "Ryan He",
      "Alex Mei",
      "Yujie Lu",
      "Chinmay Sonar",
      "Michael Saxon",
      "William Yang Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.14734",
    "title": "Advancements in Arabic Grammatical Error Detection and Correction: An  Empirical Investigation",
    "abstract": " Comments: Accepted to EMNLP 2023 ",
    "url": "https://arxiv.org/abs/2305.14734",
    "authors": [
      "Bashar Alhafni",
      "Go Inoue",
      "Christian Khairallah",
      "Nizar Habash"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.01187",
    "title": "Training neural operators to preserve invariant measures of chaotic  attractors",
    "abstract": " Title: Training neural operators to preserve invariant measures of chaotic  attractors ",
    "url": "https://arxiv.org/abs/2306.01187",
    "authors": [
      "Ruoxi Jiang",
      "Peter Y. Lu",
      "Elena Orlova",
      "Rebecca Willett"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2306.01665",
    "title": "SourceP: Detecting Ponzi Schemes on Ethereum with Source Code",
    "abstract": " Comments: 12 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2306.01665",
    "authors": [
      "Pengcheng Lu",
      "Liang Cai",
      "Keting Yin"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.04027",
    "title": "Intervention Generalization: A View from Factor Graph Models",
    "abstract": " Comments: Camera ready version (NeurIPS 2023) ",
    "url": "https://arxiv.org/abs/2306.04027",
    "authors": [
      "Gecia Bravo-Hermsdorff",
      "David S. Watson",
      "Jialin Yu",
      "Jakob Zeitler",
      "Ricardo Silva"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.05693",
    "title": "Robust Active and Passive Beamforming for RIS-Assisted Full-Duplex  Systems under Imperfect CSI",
    "abstract": " Title: Robust Active and Passive Beamforming for RIS-Assisted Full-Duplex  Systems under Imperfect CSI ",
    "url": "https://arxiv.org/abs/2306.05693",
    "authors": [
      "Li-Hsiang Shen",
      "Chia-Jou Ku",
      "Kai-Ten Feng"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2306.07005",
    "title": "AI-Generated Image Detection using a Cross-Attention Enhanced  Dual-Stream Network",
    "abstract": " Comments: 8 pages, 41 figures ",
    "url": "https://arxiv.org/abs/2306.07005",
    "authors": [
      "Ziyi Xi",
      "Wenmin Huang",
      "Kangkang Wei",
      "Weiqi Luo",
      "Peijia Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2306.08013",
    "title": "TopP&R: Robust Support Estimation Approach for Evaluating Fidelity and  Diversity in Generative Models",
    "abstract": " Comments: Accepted to NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2306.08013",
    "authors": [
      "Pum Jun Kim",
      "Yoojin Jang",
      "Jisu Kim",
      "Jaejun Yoo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.09955",
    "title": "Training shallow ReLU networks on noisy data using hinge loss: when do  we overfit and is it benign?",
    "abstract": " Comments: 48 pages, 2 figures, 1 table ",
    "url": "https://arxiv.org/abs/2306.09955",
    "authors": [
      "Erin George",
      "Michael Murray",
      "William Swartworth",
      "Deanna Needell"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.00562",
    "title": "A MIL Approach for Anomaly Detection in Surveillance Videos from  Multiple Camera Views",
    "abstract": " Comments: 8 Pages, 4 Figures ",
    "url": "https://arxiv.org/abs/2307.00562",
    "authors": [
      "Silas Santiago Lopes Pereira",
      "José Everardo Bessa Maia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.04461",
    "title": "Multi-modal Graph Learning over UMLS Knowledge Graphs",
    "abstract": " Comments: Machine Learning for Health (ML4H) 2023 in Proceedings of Machine Learning Research 225 ",
    "url": "https://arxiv.org/abs/2307.04461",
    "authors": [
      "Manuel Burger",
      "Gunnar Rätsch",
      "Rita Kuznetsova"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.06250",
    "title": "Identifiability Guarantees for Causal Disentanglement from Soft  Interventions",
    "abstract": " Title: Identifiability Guarantees for Causal Disentanglement from Soft  Interventions ",
    "url": "https://arxiv.org/abs/2307.06250",
    "authors": [
      "Jiaqi Zhang",
      "Chandler Squires",
      "Kristjan Greenewald",
      "Akash Srivastava",
      "Karthikeyan Shanmugam",
      "Caroline Uhler"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2307.07980",
    "title": "Byzantine-Robust Distributed Online Learning: Taming Adversarial  Participants in An Adversarial Environment",
    "abstract": " Title: Byzantine-Robust Distributed Online Learning: Taming Adversarial  Participants in An Adversarial Environment ",
    "url": "https://arxiv.org/abs/2307.07980",
    "authors": [
      "Xingrong Dong",
      "Zhaoxian Wu",
      "Qing Ling",
      "Zhi Tian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2307.16695",
    "title": "A theory of data variability in Neural Network Bayesian inference",
    "abstract": " Comments: 56 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2307.16695",
    "authors": [
      "Javed Lindner",
      "David Dahmen",
      "Michael Krämer",
      "Moritz Helias"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2309.04069",
    "title": "Inferring physical laws by artificial intelligence based causal models",
    "abstract": " Comments: Latex 12 pages, 16 figures (Minor changes, references added) ",
    "url": "https://arxiv.org/abs/2309.04069",
    "authors": [
      "Jorawar Singh",
      "Kishor Bharti",
      "Arvind"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2309.05528",
    "title": "On the detection of Out-Of-Distribution samples in Multiple Instance  Learning",
    "abstract": " Title: On the detection of Out-Of-Distribution samples in Multiple Instance  Learning ",
    "url": "https://arxiv.org/abs/2309.05528",
    "authors": [
      "Loïc Le Bescond",
      "Maria Vakalopoulou",
      "Stergios Christodoulidis",
      "Fabrice André",
      "Hugues Talbot"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.12214",
    "title": "Can We Reliably Improve the Robustness to Image Acquisition of Remote  Sensing of PV Systems?",
    "abstract": " Comments: 16 pages, 11 figures, 4 tables. Camera ready version accepted for the Tackling Climate Change with Machine Learning workshop at NeurIPS 2023. Note: Appendix B.1. overlaps with arXiv:2305.14979 (Assessment of the Reliablity of a Model's Decision by Generalizing Attribution to the Wavelet Domain) ",
    "url": "https://arxiv.org/abs/2309.12214",
    "authors": [
      "Gabriel Kasmi",
      "Laurent Dubus",
      "Yves-Marie Saint-Drenan",
      "Philippe Blanc"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.16393",
    "title": "HIC-YOLOv5: Improved YOLOv5 For Small Object Detection",
    "abstract": " Comments: 7 pages,10 figures ",
    "url": "https://arxiv.org/abs/2309.16393",
    "authors": [
      "Shiyi Tang",
      "Shu Zhang",
      "Yini Fang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.06328",
    "title": "Antenna Response Consistency Driven Self-supervised Learning for  WIFI-based Human Activity Recognition",
    "abstract": " Title: Antenna Response Consistency Driven Self-supervised Learning for  WIFI-based Human Activity Recognition ",
    "url": "https://arxiv.org/abs/2310.06328",
    "authors": [
      "Ke Xu",
      "Jiangtao Wang",
      "Hongyuan Zhu",
      "Dingchang Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2310.09949",
    "title": "Chameleon: a heterogeneous and disaggregated accelerator system for  retrieval-augmented language models",
    "abstract": " Title: Chameleon: a heterogeneous and disaggregated accelerator system for  retrieval-augmented language models ",
    "url": "https://arxiv.org/abs/2310.09949",
    "authors": [
      "Wenqi Jiang",
      "Marco Zeller",
      "Roger Waleffe",
      "Torsten Hoefler",
      "Gustavo Alonso"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Hardware Architecture (cs.AR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.12421",
    "title": "Detecting and Mitigating Algorithmic Bias in Binary Classification using  Causal Modeling",
    "abstract": " Comments: 11 pages, 2 figures, 6 tables, R-script in appendix ",
    "url": "https://arxiv.org/abs/2310.12421",
    "authors": [
      "Wendy Hui",
      "Wai Kwong Lau"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2310.15767",
    "title": "Unpaired MRI Super Resolution with Self-Supervised Contrastive Learning",
    "abstract": " Title: Unpaired MRI Super Resolution with Self-Supervised Contrastive Learning ",
    "url": "https://arxiv.org/abs/2310.15767",
    "authors": [
      "Hao Li",
      "Quanwei Liu",
      "Jianan Liu",
      "Xiling Liu",
      "Yanni Dong",
      "Tao Huang",
      "Zhihan Lv"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.19630",
    "title": "Convolutional Neural Networks for Automatic Detection of Intact  Adenovirus from TEM Imaging with Debris, Broken and Artefacts Particles",
    "abstract": " Comments: 13 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2310.19630",
    "authors": [
      "Olivier Rukundo",
      "Andrea Behanova",
      "Riccardo De Feo",
      "Seppo Ronkko",
      "Joni Oja",
      "Jussi Tohka"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2311.02510",
    "title": "Anthropomorphic Grasping with Neural Object Shape Completion",
    "abstract": " Comments: Accepted to RA-L 2023 ",
    "url": "https://arxiv.org/abs/2311.02510",
    "authors": [
      "Diego Hidalgo-Carvajal",
      "Hanzhi Chen",
      "Gemma C. Bettelani",
      "Jaesug Jung",
      "Melissa Zavaglia",
      "Laura Busse",
      "Abdeldjallil Naceri",
      "Stefan Leutenegger",
      "Sami Haddadin"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.02831",
    "title": "SemanticTopoLoop: Semantic Loop Closure With 3D Topological Graph Based  on Quadric-Level Object Map",
    "abstract": " Title: SemanticTopoLoop: Semantic Loop Closure With 3D Topological Graph Based  on Quadric-Level Object Map ",
    "url": "https://arxiv.org/abs/2311.02831",
    "authors": [
      "Zhenzhong Cao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.03421",
    "title": "Hopfield-Enhanced Deep Neural Networks for Artifact-Resilient Brain  State Decoding",
    "abstract": " Comments: The resolution is low in one of the figures ",
    "url": "https://arxiv.org/abs/2311.03421",
    "authors": [
      "Arnau Marin-Llobet",
      "Arnau Manasanch",
      "Maria V. Sanchez-Vives"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.04252",
    "title": "CNN-Based Structural Damage Detection using Time-Series Sensor Data",
    "abstract": " Comments: 13 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2311.04252",
    "authors": [
      "Ishan Pathak",
      "Ishan Jha",
      "Aditya Sadana",
      "Basuraj Bhowmik"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2311.04592",
    "title": "On Characterizing the Evolution of Embedding Space of Neural Networks  using Algebraic Topology",
    "abstract": " Title: On Characterizing the Evolution of Embedding Space of Neural Networks  using Algebraic Topology ",
    "url": "https://arxiv.org/abs/2311.04592",
    "authors": [
      "Suryaka Suresh",
      "Bishshoy Das",
      "Vinayak Abrol",
      "Sumantra Dutta Roy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.04797",
    "title": "CloverLeaf on Intel Multi-Core CPUs: A Case Study in Write-Allocate  Evasion",
    "abstract": " Comments: 17 pages including artifact appendix; 10 figures, 1 table; added missing e-mail address ",
    "url": "https://arxiv.org/abs/2311.04797",
    "authors": [
      "Jan Laukemann",
      "Thomas Gruber",
      "Georg Hager",
      "Dossay Oryspayev",
      "Gerhard Wellein"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2311.04828",
    "title": "SODAWideNet -- Salient Object Detection with an Attention augmented Wide  Encoder Decoder network without ImageNet pre-training",
    "abstract": " Comments: Accepted at ISVC'23 ",
    "url": "https://arxiv.org/abs/2311.04828",
    "authors": [
      "Rohit Venkata Sai Dulam",
      "Chandra Kambhamettu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]