[
  {
    "id": "arXiv:2112.13845",
    "title": "Raw Produce Quality Detection with Shifted Window Self-Attention",
    "abstract": "Global food insecurity is expected to worsen in the coming decades with the accelerated rate of climate change and the rapidly increasing population. In this vein, it is important to remove inefficiencies at every level of food production. The recent advances in deep learning can help reduce such inefficiencies, yet their application has not yet become mainstream throughout the industry, inducing economic costs at a massive scale. To this point, modern techniques such as CNNs (Convolutional Neural Networks) have been applied to RPQD (Raw Produce Quality Detection) tasks. On the other hand, Transformer's successful debut in the vision among other modalities led us to expect a better performance with these Transformer-based models in RPQD. In this work, we exclusively investigate the recent state-of-the-art Swin (Shifted Windows) Transformer which computes self-attention in both intra- and inter-window fashion. We compare Swin Transformer against CNN models on four RPQD image datasets, each containing different kinds of raw produce: fruits and vegetables, fish, pork, and beef. We observe that Swin Transformer not only achieves better or competitive performance but also is data- and compute-efficient, making it ideal for actual deployment in real-world setting. To the best of our knowledge, this is the first large-scale empirical study on RPQD task, which we hope will gain more attention in future works. ",
    "url": "https://arxiv.org/abs/2112.13845",
    "authors": [
      "Oh Joon Kwon",
      "Byungsoo Kim",
      "Youngduck Choi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.13867",
    "title": "Depth and Feature Learning are Provably Beneficial for Neural Network  Discriminators",
    "abstract": "We construct pairs of distributions $\\mu_d, \\nu_d$ on $\\mathbb{R}^d$ such that the quantity $|\\mathbb{E}_{x \\sim \\mu_d} [F(x)] - \\mathbb{E}_{x \\sim \\nu_d} [F(x)]|$ decreases as $\\Omega(1/d^2)$ for some three-layer ReLU network $F$ with polynomial width and weights, while declining exponentially in $d$ if $F$ is any two-layer network with polynomial weights. This shows that deep GAN discriminators are able to distinguish distributions that shallow discriminators cannot. Analogously, we build pairs of distributions $\\mu_d, \\nu_d$ on $\\mathbb{R}^d$ such that $|\\mathbb{E}_{x \\sim \\mu_d} [F(x)] - \\mathbb{E}_{x \\sim \\nu_d} [F(x)]|$ decreases as $\\Omega(1/(d\\log d))$ for two-layer ReLU networks with polynomial weights, while declining exponentially for bounded-norm functions in the associated RKHS. This confirms that feature learning is beneficial for discriminators. Our bounds are based on Fourier transforms. ",
    "url": "https://arxiv.org/abs/2112.13867",
    "authors": [
      "Carles Domingo-Enrich"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.13870",
    "title": "Can Social Ontological Knowledge Representations be Measured Using  Machine Learning?",
    "abstract": "Personal Social Ontology (PSO), it is proposed, is how an individual perceives the ontological properties of terms. For example, an absolute fatalist would arguably use terms that remove any form of agency from a person. Such fatalism has the impact of ontologically defining acts such as winning, victory and success, for example, in a manner that is contrary to how a non-fatalist would ontologically define them. While both a fatalist and non-fatalist would agree on the dictionary definition of these terms, they would differ on what and how they can be caused. This difference between the two individuals, it is argued, can be induced from the co-occurrence of terms used by each individual. That such co-occurrence carries an implied social ontology, one that is specific to that person. The use of principal social perceptions -as evidenced by the social psychology and social neuroscience literature, is put forward as a viable method to feature engineer such texts. With the natural language characterisation of these features, they are then usable in machine learning pipelines. ",
    "url": "https://arxiv.org/abs/2112.13870",
    "authors": [
      "Ahmed Izzidien"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.13896",
    "title": "Two Sparsities Are Better Than One: Unlocking the Performance Benefits  of Sparse-Sparse Networks",
    "abstract": "In principle, sparse neural networks should be significantly more efficient than traditional dense networks. Neurons in the brain exhibit two types of sparsity; they are sparsely interconnected and sparsely active. These two types of sparsity, called weight sparsity and activation sparsity, when combined, offer the potential to reduce the computational cost of neural networks by two orders of magnitude. Despite this potential, today's neural networks deliver only modest performance benefits using just weight sparsity, because traditional computing hardware cannot efficiently process sparse networks. In this article we introduce Complementary Sparsity, a novel technique that significantly improves the performance of dual sparse networks on existing hardware. We demonstrate that we can achieve high performance running weight-sparse networks, and we can multiply those speedups by incorporating activation sparsity. Using Complementary Sparsity, we show up to 100X improvement in throughput and energy efficiency performing inference on FPGAs. We analyze scalability and resource tradeoffs for a variety of kernels typical of commercial convolutional networks such as ResNet-50 and MobileNetV2. Our results with Complementary Sparsity suggest that weight plus activation sparsity can be a potent combination for efficiently scaling future AI models. ",
    "url": "https://arxiv.org/abs/2112.13896",
    "authors": [
      "Kevin Lee Hunter",
      "Lawrence Spracklen",
      "Subutai Ahmad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Hardware Architecture (cs.AR)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2112.13910",
    "title": "Visual Persuasion in COVID-19 Social Media Content: A Multi-Modal  Characterization",
    "abstract": "Social media content routinely incorporates multi-modal design to covey information and shape meanings, and sway interpretations toward desirable implications, but the choices and outcomes of using both texts and visual images have not been sufficiently studied. This work proposes a computational approach to analyze the outcome of persuasive information in multi-modal content, focusing on two aspects, popularity and reliability, in COVID-19-related news articles shared on Twitter. The two aspects are intertwined in the spread of misinformation: for example, an unreliable article that aims to misinform has to attain some popularity. This work has several contributions. First, we propose a multi-modal (image and text) approach to effectively identify popularity and reliability of information sources simultaneously. Second, we identify textual and visual elements that are predictive to information popularity and reliability. Third, by modeling cross-modal relations and similarity, we are able to uncover how unreliable articles construct multi-modal meaning in a distorted, biased fashion. Our work demonstrates how to use multi-modal analysis for understanding influential content and has implications to social media literacy and engagement. ",
    "url": "https://arxiv.org/abs/2112.13910",
    "authors": [
      "Mesut Erhan Unal",
      "Adriana Kovashka",
      "Wen-Ting Chung",
      "Yu-Ru Lin"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.13939",
    "title": "SPIDER: Searching Personalized Neural Architecture for Federated  Learning",
    "abstract": "Federated learning (FL) is an efficient learning framework that assists distributed machine learning when data cannot be shared with a centralized server due to privacy and regulatory restrictions. Recent advancements in FL use predefined architecture-based learning for all the clients. However, given that clients' data are invisible to the server and data distributions are non-identical across clients, a predefined architecture discovered in a centralized setting may not be an optimal solution for all the clients in FL. Motivated by this challenge, in this work, we introduce SPIDER, an algorithmic framework that aims to Search Personalized neural architecture for federated learning. SPIDER is designed based on two unique features: (1) alternately optimizing one architecture-homogeneous global model (Supernet) in a generic FL manner and one architecture-heterogeneous local model that is connected to the global model by weight sharing-based regularization (2) achieving architecture-heterogeneous local model by a novel neural architecture search (NAS) method that can select optimal subnet progressively using operation-level perturbation on the accuracy value as the criterion. Experimental results demonstrate that SPIDER outperforms other state-of-the-art personalization methods, and the searched personalized architectures are more inference efficient. ",
    "url": "https://arxiv.org/abs/2112.13939",
    "authors": [
      "Erum Mushtaq",
      "Chaoyang He",
      "Jie Ding",
      "Salman Avestimehr"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.13956",
    "title": "A Blockchain-based Data Governance Framework with Privacy Protection and  Provenance for e-Prescription",
    "abstract": "Real-world applications in healthcare and supply chain domains produce, exchange, and share data in a multi-stakeholder environment. Data owners want to control their data and privacy in such settings. On the other hand, data consumers demand methods to understand when, how, and who produced the data. These requirements necessitate data governance frameworks that guarantee data provenance, privacy protection, and consent management. We introduce a decentralized data governance framework based on blockchain technology and proxy re-encryption to let data owners control and track their data through privacy-enhancing and consent management mechanisms. Besides, our framework allows the data consumers to understand data lineage through a blockchain-based provenance mechanism. We have used Digital e-prescription as the use case since it has multiple stakeholders and sensitive data while enabling the medical fraternity to manage patients' prescription data, involving patients as data owners, doctors and pharmacists as data consumers. Our proof-of-concept implementation and evaluation results based on CosmWasm, Ethereum, and pyUmbral PRE show that the proposed decentralized system guarantees transparency, privacy, and trust with minimal overhead. ",
    "url": "https://arxiv.org/abs/2112.13956",
    "authors": [
      "Rodrigo Dutra Garcia",
      "Gowri Sankar Ramachandran",
      "Raja Jurdak",
      "Jo Ueyama"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2112.13960",
    "title": "A Preordered RNN Layer Boosts Neural Machine Translation in Low Resource  Settings",
    "abstract": "Neural Machine Translation (NMT) models are strong enough to convey semantic and syntactic information from the source language to the target language. However, these models are suffering from the need for a large amount of data to learn the parameters. As a result, for languages with scarce data, these models are at risk of underperforming. We propose to augment attention based neural network with reordering information to alleviate the lack of data. This augmentation improves the translation quality for both English to Persian and Persian to English by up to 6% BLEU absolute over the baseline models. ",
    "url": "https://arxiv.org/abs/2112.13960",
    "authors": [
      "Mohaddeseh Bastan",
      "Shahram Khadivi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.13966",
    "title": "Online Adversarial Distillation for Graph Neural Networks",
    "abstract": "Knowledge distillation has recently become a popular technique to improve the model generalization ability on convolutional neural networks. However, its effect on graph neural networks is less than satisfactory since the graph topology and node attributes are likely to change in a dynamic way and in this case a static teacher model is insufficient in guiding student training. In this paper, we tackle this challenge by simultaneously training a group of graph neural networks in an online distillation fashion, where the group knowledge plays a role as a dynamic virtual teacher and the structure changes in graph neural networks are effectively captured. To improve the distillation performance, two types of knowledge are transferred among the students to enhance each other: local knowledge reflecting information in the graph topology and node attributes, and global knowledge reflecting the prediction over classes. We transfer the global knowledge with KL-divergence as the vanilla knowledge distillation does, while exploiting the complicated structure of the local knowledge with an efficient adversarial cyclic learning framework. Extensive experiments verified the effectiveness of our proposed online adversarial distillation approach. ",
    "url": "https://arxiv.org/abs/2112.13966",
    "authors": [
      "Can Wang",
      "Zhe Wang",
      "Defang Chen",
      "Sheng Zhou",
      "Yan Feng",
      "Chun Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.13974",
    "title": "A Moment in the Sun: Solar Nowcasting from Multispectral Satellite Data  using Self-Supervised Learning",
    "abstract": "Solar energy is now the cheapest form of electricity in history. Unfortunately, significantly increasing the grid's fraction of solar energy remains challenging due to its variability, which makes balancing electricity's supply and demand more difficult. While thermal generators' ramp rate -- the maximum rate that they can change their output -- is finite, solar's ramp rate is essentially infinite. Thus, accurate near-term solar forecasting, or nowcasting, is important to provide advance warning to adjust thermal generator output in response to solar variations to ensure a balanced supply and demand. To address the problem, this paper develops a general model for solar nowcasting from abundant and readily available multispectral satellite data using self-supervised learning. Specifically, we develop deep auto-regressive models using convolutional neural networks (CNN) and long short-term memory networks (LSTM) that are globally trained across multiple locations to predict raw future observations of the spatio-temporal data collected by the recently launched GOES-R series of satellites. Our model estimates a location's future solar irradiance based on satellite observations, which we feed to a regression model trained on smaller site-specific solar data to provide near-term solar photovoltaic (PV) forecasts that account for site-specific characteristics. We evaluate our approach for different coverage areas and forecast horizons across 25 solar sites and show that our approach yields errors close to that of a model using ground-truth observations. ",
    "url": "https://arxiv.org/abs/2112.13974",
    "authors": [
      "Akansha Singh Bansal",
      "Trapit Bansal",
      "David Irwin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.13983",
    "title": "Siamese Network with Interactive Transformer for Video Object  Segmentation",
    "abstract": "Semi-supervised video object segmentation (VOS) refers to segmenting the target object in remaining frames given its annotation in the first frame, which has been actively studied in recent years. The key challenge lies in finding effective ways to exploit the spatio-temporal context of past frames to help learn discriminative target representation of current frame. In this paper, we propose a novel Siamese network with a specifically designed interactive transformer, called SITVOS, to enable effective context propagation from historical to current frames. Technically, we use the transformer encoder and decoder to handle the past frames and current frame separately, i.e., the encoder encodes robust spatio-temporal context of target object from the past frames, while the decoder takes the feature embedding of current frame as the query to retrieve the target from the encoder output. To further enhance the target representation, a feature interaction module (FIM) is devised to promote the information flow between the encoder and decoder. Moreover, we employ the Siamese architecture to extract backbone features of both past and current frames, which enables feature reuse and is more efficient than existing methods. Experimental results on three challenging benchmarks validate the superiority of SITVOS over state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2112.13983",
    "authors": [
      "Meng Lan",
      "Jing Zhang",
      "Fengxiang He",
      "Lefei Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.13989",
    "title": "Associative Adversarial Learning Based on Selective Attack",
    "abstract": "A human's attention can intuitively adapt to corrupted areas of an image by recalling a similar uncorrupted image they have previously seen. This observation motivates us to improve the attention of adversarial images by considering their clean counterparts. To accomplish this, we introduce Associative Adversarial Learning (AAL) into adversarial learning to guide a selective attack. We formulate the intrinsic relationship between attention and attack (perturbation) as a coupling optimization problem to improve their interaction. This leads to an attention backtracking algorithm that can effectively enhance the attention's adversarial robustness. Our method is generic and can be used to address a variety of tasks by simply choosing different kernels for the associative attention that select other regions for a specific attack. Experimental results show that the selective attack improves the model's performance. We show that our method improves the recognition accuracy of adversarial training on ImageNet by 8.32% compared with the baseline. It also increases object detection mAP on PascalVOC by 2.02% and recognition accuracy of few-shot learning on miniImageNet by 1.63%. ",
    "url": "https://arxiv.org/abs/2112.13989",
    "authors": [
      "Runqi Wang",
      "Xiaoyue Duan",
      "Baochang Zhang",
      "Song Xue",
      "Wentao Zhu",
      "David Doermann",
      "Guodong Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.13994",
    "title": "Mining and Classifying Privacy and Data Protection Requirements in Issue  Reports",
    "abstract": "Digital and physical footprints are a trail of user activities collected over the use of software applications and systems. As software becomes ubiquitous, protecting user privacy has become challenging. With the increasing of user privacy awareness and advent of privacy regulations and policies, there is an emerging need to implement software systems that enhance the protection of personal data processing. However, existing privacy regulations and policies only provide high-level principles which are difficult for software engineers to design and implement privacy-aware systems. In this paper, we develop a taxonomy that provides a comprehensive set of privacy requirements based on four well-established personal data protection regulations and privacy frameworks, the General Data Protection Regulation (GDPR), ISO/IEC 29100, Thailand Personal Data Protection (PDPA) and Asia-Pacific Economic Cooperation (APEC) privacy framework. These requirements are extracted, classified and refined into a level that can be used to map with issue reports. We have also performed a study on how two large open-source software projects (Google Chrome and Moodle) address the privacy requirements in our taxonomy through mining their issue reports. The paper discusses how the collected issues were classified, and presents the findings and insights generated from our study. ",
    "url": "https://arxiv.org/abs/2112.13994",
    "authors": [
      "Pattaraporn Sangaroonsilp",
      "Hoa Khanh Dam",
      "Morakot Choetkiertikul",
      "Chaiyong Ragkhitwetsagul",
      "Aditya Ghose"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2112.13997",
    "title": "Common Privacy Weaknesses and Vulnerabilities in Software Applications",
    "abstract": "In this digital era, our privacy is under constant threat as our personal data and traceable online/offline activities are frequently collected, processed and transferred by many software applications. Privacy attacks are often formed by exploiting vulnerabilities found in those software applications. The Common Weakness Enumeration (CWE) and Common Vulnerabilities and Exposures (CVE) systems are currently the main sources that software engineers rely on for understanding and preventing publicly disclosed software vulnerabilities. However, our study on all 922 weaknesses in the CWE and 156,537 vulnerabilities registered in the CVE to date has found a very small coverage of privacy-related vulnerabilities in both systems, only 4.45\\% in CWE and 0.1\\% in CVE. These also cover only a small number of areas of privacy threats that have been raised in existing privacy software engineering research, privacy regulations and frameworks, and industry sources. The actionable insights generated from our study led to the introduction of 11 new common privacy weaknesses to supplement the CWE system, making it become a source for both security and privacy vulnerabilities. ",
    "url": "https://arxiv.org/abs/2112.13997",
    "authors": [
      "Pattaraporn Sangaroonsilp",
      "Hoa Khanh Dam",
      "Aditya Ghose"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2112.14014",
    "title": "An Error Analysis Framework for Neural Network Modeling of Dynamical  Systems",
    "abstract": "We propose a theoretical framework for investigating a modeling error caused by numerical integration in the learning process of dynamics. Recently, learning equations of motion to describe dynamics from data using neural networks has been attracting attention. During such training, numerical integration is used to compare the data with the solution of the neural network model; however, discretization errors due to numerical integration prevent the model from being trained correctly. In this study, we formulate the modeling error using the Dahlquist test equation that is commonly used in the analysis of numerical methods and apply it to some of the Runge--Kutta methods. ",
    "url": "https://arxiv.org/abs/2112.14014",
    "authors": [
      "Shunpei Terakawa",
      "Takashi Matsubara",
      "Takaharu Yaguchi"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2112.14019",
    "title": "Semi-supervised Salient Object Detection with Effective Confidence  Estimation",
    "abstract": "The success of existing salient object detection models relies on a large pixel-wise labeled training dataset. How-ever, collecting such a dataset is not only time-consuming but also very expensive. To reduce the labeling burden, we study semi-supervised salient object detection, and formulate it as an unlabeled dataset pixel-level confidence estimation problem by identifying pixels with less confident predictions. Specifically, we introduce a new latent variable model with an energy-based prior for effective latent space exploration, leading to more reliable confidence maps. With the proposed strategy, the unlabelled images can effectively participate in model training. Experimental results show that the proposed solution, using only 1/16 of the annotations from the original training dataset, achieves competitive performance compared with state-of-the-art fully supervised models. ",
    "url": "https://arxiv.org/abs/2112.14019",
    "authors": [
      "Jiawei Liu",
      "Jing Zhang",
      "Nick Barnes"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.14021",
    "title": "Multilayer Graph Contrastive Clustering Network",
    "abstract": "Multilayer graph has garnered plenty of research attention in many areas due to their high utility in modeling interdependent systems. However, clustering of multilayer graph, which aims at dividing the graph nodes into categories or communities, is still at a nascent stage. Existing methods are often limited to exploiting the multiview attributes or multiple networks and ignoring more complex and richer network frameworks. To this end, we propose a generic and effective autoencoder framework for multilayer graph clustering named Multilayer Graph Contrastive Clustering Network (MGCCN). MGCCN consists of three modules: (1)Attention mechanism is applied to better capture the relevance between nodes and neighbors for better node embeddings. (2)To better explore the consistent information in different networks, a contrastive fusion strategy is introduced. (3)MGCCN employs a self-supervised component that iteratively strengthens the node embedding and clustering. Extensive experiments on different types of real-world graph data indicate that our proposed method outperforms state-of-the-art techniques. ",
    "url": "https://arxiv.org/abs/2112.14021",
    "authors": [
      "Liang Liu",
      "Zhao Kang",
      "Ling Tian",
      "Wenbo Xu",
      "Xixu He"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.14023",
    "title": "The Devil is in the Task: Exploiting Reciprocal Appearance-Localization  Features for Monocular 3D Object Detection",
    "abstract": "Low-cost monocular 3D object detection plays a fundamental role in autonomous driving, whereas its accuracy is still far from satisfactory. In this paper, we dig into the 3D object detection task and reformulate it as the sub-tasks of object localization and appearance perception, which benefits to a deep excavation of reciprocal information underlying the entire task. We introduce a Dynamic Feature Reflecting Network, named DFR-Net, which contains two novel standalone modules: (i) the Appearance-Localization Feature Reflecting module (ALFR) that first separates taskspecific features and then self-mutually reflects the reciprocal features; (ii) the Dynamic Intra-Trading module (DIT) that adaptively realigns the training processes of various sub-tasks via a self-learning manner. Extensive experiments on the challenging KITTI dataset demonstrate the effectiveness and generalization of DFR-Net. We rank 1st among all the monocular 3D object detectors in the KITTI test set (till March 16th, 2021). The proposed method is also easy to be plug-and-play in many cutting-edge 3D detection frameworks at negligible cost to boost performance. The code will be made publicly available. ",
    "url": "https://arxiv.org/abs/2112.14023",
    "authors": [
      "Zhikang Zou",
      "Xiaoqing Ye",
      "Liang Du",
      "Xianhui Cheng",
      "Xiao Tan",
      "Li Zhang",
      "Jianfeng Feng",
      "Xiangyang Xue",
      "Errui Ding"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.14030",
    "title": "Bipartite Graph Matching Algorithms for Entity Resolution: An Empirical  Evaluation",
    "abstract": "Entity Resolution (ER) is the task of finding records that refer to the same real-world entities. A common scenario is when entities across two clean sources need to be resolved, which we refer to as Clean-Clean ER. In this paper, we perform an extensive empirical evaluation of 8 bipartite graph matching algorithms that take in as input a bipartite similarity graph and provide as output a set of matched entities. We consider a wide range of matching algorithms, including algorithms that have not previously been applied to ER, or have been evaluated only in other ER settings. We assess the relative performance of the algorithms with respect to accuracy and time efficiency over 10 established, real datasets, from which we extract >700 different similarity graphs. Our results provide insights into the relative performance of these algorithms and guidelines for choosing the best one, depending on the data at hand. ",
    "url": "https://arxiv.org/abs/2112.14030",
    "authors": [
      "George Papadakis",
      "Vasilis Efthymiou",
      "Emanouil Thanos",
      "Oktie Hassanzadeh"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2112.14031",
    "title": "Analytical voltage estimation in power packet dispatching network",
    "abstract": "This paper proposes an analytical voltage estimation method for the power packet dispatching network. A unit power packet consists of signals and DC pulsed voltage waveform. In the network, power packets are transmitted among power packet routers (routers) by time-division multiplexing. Routers have capacitors as the storage of power during the power transmission. The power flows depending on the voltage gradient among the storage. The power flow in the network has been studied with numerical approaches. However, the existing studies have considered transmission losses but ignored transient responses. Considering transient responses, the power transmission analysis generally requires circuit simulation and takes considerable time. This paper focuses on a one-to-one connection between routers and underdamped conditions. They allow the estimation of storage voltages considering the transient responses without circuit simulation. First, theoretical analysis and experimental verification are performed on the conditions. Then, an analytical voltage estimation method is proposed by expanding the analysis of the one-to-one connection to the network. Comparison with circuit simulation reveals that the estimation method is accurate enough to analyze power transmission in the network. ",
    "url": "https://arxiv.org/abs/2112.14031",
    "authors": [
      "Shinji Katayama",
      "Takashi Hikihara"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2112.14059",
    "title": "DetarNet: Decoupling Translation and Rotation by Siamese Network for  Point Cloud Registration",
    "abstract": "Point cloud registration is a fundamental step for many tasks. In this paper, we propose a neural network named DetarNet to decouple the translation $t$ and rotation $R$, so as to overcome the performance degradation due to their mutual interference in point cloud registration. First, a Siamese Network based Progressive and Coherent Feature Drift (PCFD) module is proposed to align the source and target points in high-dimensional feature space, and accurately recover translation from the alignment process. Then we propose a Consensus Encoding Unit (CEU) to construct more distinguishable features for a set of putative correspondences. After that, a Spatial and Channel Attention (SCA) block is adopted to build a classification network for finding good correspondences. Finally, the rotation is obtained by Singular Value Decomposition (SVD). In this way, the proposed network decouples the estimation of translation and rotation, resulting in better performance for both of them. Experimental results demonstrate that the proposed DetarNet improves registration performance on both indoor and outdoor scenes. Our code will be available in \\url{https://github.com/ZhiChen902/DetarNet}. ",
    "url": "https://arxiv.org/abs/2112.14059",
    "authors": [
      "Zhi Chen",
      "Fan Yang",
      "Wenbing Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.14067",
    "title": "The complete weight enumerator of the Reed-Solomon code with dimension  two or three",
    "abstract": "It is well-known that Reed-Solomon codes and extended Reed-Solomon codes are two special classes of MDS codes with wide applications in practice. The complete weight enumerators of these codes are very important for determining the capability of both error-detection and error-correction. In this paper, for any positive integer $m$ and prime $p$, basing on the character sums, we determine the complete weight enumerators of the Reed-Solomon code and the extended Reed-Solomon code with dimension $k$ $(k=2,3)$ over $\\mathbb{F}_{p^m}$, explictly, which are generalizations of the corresponding results in \\cite{BK91,K04}. ",
    "url": "https://arxiv.org/abs/2112.14067",
    "authors": [
      "Canze Zhu",
      "Qunying Liao"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2112.14075",
    "title": "Financial Vision Based Differential Privacy Applications",
    "abstract": "The importance of deep learning data privacy has gained significant attention in recent years. It is probably to suffer data breaches when applying deep learning to cryptocurrency that lacks supervision of financial regulatory agencies. However, there is little relative research in the financial area to our best knowledge. We apply two representative deep learning privacy-privacy frameworks proposed by Google to financial trading data. We designed the experiments with several different parameters suggested from the original studies. In addition, we refer the degree of privacy to Google and Apple companies to estimate the results more reasonably. The results show that DP-SGD performs better than the PATE framework in financial trading data. The tradeoff between privacy and accuracy is low in DP-SGD. The degree of privacy also is in line with the actual case. Therefore, we can obtain a strong privacy guarantee with precision to avoid potential financial loss. ",
    "url": "https://arxiv.org/abs/2112.14075",
    "authors": [
      "Jun-Hao Chen",
      "Yi-Jen Wang",
      "Yun-Cheng Tsai",
      "Samuel Yen-Chi Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.14087",
    "title": "APRIL: Finding the Achilles' Heel on Privacy for Vision Transformers",
    "abstract": "Federated learning frameworks typically require collaborators to share their local gradient updates of a common model instead of sharing training data to preserve privacy. However, prior works on Gradient Leakage Attacks showed that private training data can be revealed from gradients. So far almost all relevant works base their attacks on fully-connected or convolutional neural networks. Given the recent overwhelmingly rising trend of adapting Transformers to solve multifarious vision tasks, it is highly valuable to investigate the privacy risk of vision transformers. In this paper, we analyse the gradient leakage risk of self-attention based mechanism in both theoretical and practical manners. Particularly, we propose APRIL - Attention PRIvacy Leakage, which poses a strong threat to self-attention inspired models such as ViT. Showing how vision Transformers are at the risk of privacy leakage via gradients, we urge the significance of designing privacy-safer Transformer models and defending schemes. ",
    "url": "https://arxiv.org/abs/2112.14087",
    "authors": [
      "Jiahao Lu",
      "Xi Sheryl Zhang",
      "Tianli Zhao",
      "Xiangyu He",
      "Jian Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.14108",
    "title": "Fostering the Robustness of White-Box Deep Neural Network Watermarks by  Neuron Alignment",
    "abstract": "The wide application of deep learning techniques is boosting the regulation of deep learning models, especially deep neural networks (DNN), as commercial products. A necessary prerequisite for such regulations is identifying the owner of deep neural networks, which is usually done through the watermark. Current DNN watermarking schemes, particularly white-box ones, are uniformly fragile against a family of functionality equivalence attacks, especially the neuron permutation. This operation can effortlessly invalidate the ownership proof and escape copyright regulations. To enhance the robustness of white-box DNN watermarking schemes, this paper presents a procedure that aligns neurons into the same order as when the watermark is embedded, so the watermark can be correctly recognized. This neuron alignment process significantly facilitates the functionality of established deep neural network watermarking schemes. ",
    "url": "https://arxiv.org/abs/2112.14108",
    "authors": [
      "Fang-Qi Li",
      "Shi-Lin Wang",
      "Yun Zhu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2112.14115",
    "title": "A Generalization of Cyclic Code and Applications to Public Key  Cryptosystems",
    "abstract": "In this paper, we define and discuss {\\phi}-cyclic code, which may be regarded as a general form of the ordinary cyclic code. As applications, we explain how to extend two public key encryption schemes, one is McEliece and Niederriter's cryptosystem of which is based on error-correcting code theory. Another one is NTRU public key cryptosystem of which is based on polynomial ring theory. The main purpose of this paper is to give a more general construction of NTRU based on ideal matrices and q-ary lattice theory. ",
    "url": "https://arxiv.org/abs/2112.14115",
    "authors": [
      "Zhiyong Zheng",
      "Wenlin Huang",
      "Jie Xu",
      "Kun Tian"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2112.14146",
    "title": "Towards continual task learning in artificial neural networks: current  approaches and insights from neuroscience",
    "abstract": "The innate capacity of humans and other animals to learn a diverse, and often interfering, range of knowledge and skills throughout their lifespan is a hallmark of natural intelligence, with obvious evolutionary motivations. In parallel, the ability of artificial neural networks (ANNs) to learn across a range of tasks and domains, combining and re-using learned representations where required, is a clear goal of artificial intelligence. This capacity, widely described as continual learning, has become a prolific subfield of research in machine learning. Despite the numerous successes of deep learning in recent years, across domains ranging from image recognition to machine translation, such continual task learning has proved challenging. Neural networks trained on multiple tasks in sequence with stochastic gradient descent often suffer from representational interference, whereby the learned weights for a given task effectively overwrite those of previous tasks in a process termed catastrophic forgetting. This represents a major impediment to the development of more generalised artificial learning systems, capable of accumulating knowledge over time and task space, in a manner analogous to humans. A repository of selected papers and implementations accompanying this review can be found at https://github.com/mccaffary/continual-learning. ",
    "url": "https://arxiv.org/abs/2112.14146",
    "authors": [
      "David McCaffary"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.14148",
    "title": "Robust Sparse Recovery with Sparse Bernoulli matrices via Expanders",
    "abstract": "Sparse binary matrices are of great interest in the field of compressed sensing. This class of matrices make possible to perform signal recovery with lower storage costs and faster decoding algorithms. In particular, random matrices formed by i.i.d Bernoulli $p$ random variables are of practical relevance in the context of nonnegative sparse recovery. In this work, we investigate the robust nullspace property of sparse Bernoulli $p$ matrices. Previous results in the literature establish that such matrices can accurately recover $n$-dimensional $s$-sparse vectors with $m=O\\left (\\frac{s}{c(p)}\\log\\frac{en}{s}\\right )$ measurements, where $c(p) \\le p$ is a constant that only depends on the parameter $p$. These results suggest that, when $p$ vanishes, the sparse Bernoulli matrix requires considerably more measurements than the minimal necessary achieved by the standard isotropic subgaussian designs. We show that this is not true. Our main result characterizes, for a wide range of levels sparsity $s$, the smallest $p$ such that it is possible to perform sparse recovery with the minimal number of measurements. We also provide matching lower bounds to establish the optimality of our results. ",
    "url": "https://arxiv.org/abs/2112.14148",
    "authors": [
      "Pedro Abdalla"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Probability (math.PR)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2112.14192",
    "title": "Robust Security Analysis Based on Random Geometry Theory for  Satellite-Terrestrial-Vehicle Network",
    "abstract": "Driven by B5G and 6G technologies, multi-network fusion is an indispensable tendency for future communications. In this paper, we focus on and analyze the \\emph{security performance} (SP) of the \\emph{satellite-terrestrial downlink transmission} (STDT). Here, the STDT is composed of a satellite network and a vehicular network with a legitimate mobile receiver and an mobile eavesdropper distributing. To theoretically analyze the SP of this system from the perspective of mobile terminals better, the random geometry theory is adopted, which assumes that both terrestrial vehicles are distributed stochastically in one beam of the satellite. Furthermore, based on this theory, the closed-form analytical expressions for two crucial and specific indicators in the STDT are derived, respectively, the secrecy outage probability and the ergodic secrecy capacity. Additionally, several related variables restricting the SP of the STDT are discussed, and specific schemes are presented to enhance the SP. Then, the asymptotic property is investigated in the high signal-to-noise ratio scenario, and accurate and asymptotic closed-form expressions are given. Finally, simulation results show that, under the precondition of guaranteeing the reliability of the STDT, the asymptotic solutions outperform the corresponding accurate results significantly in the effectiveness. ",
    "url": "https://arxiv.org/abs/2112.14192",
    "authors": [
      "Xudong Li",
      "Ye Fan",
      "Rugui Yao",
      "Peng Wang",
      "Nan Qi",
      "Xiaoya Zuo"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.14205",
    "title": "Analysis of Longitudinal Changes in Privacy Behavior of Android  Applications",
    "abstract": "Privacy concerns have long been expressed around smart devices, and the concerns around Android apps have been studied by many past works. Over the past 10 years, we have crawled and scraped data for almost 1.9 million apps, and also stored the APKs for 135,536 of them. In this paper, we examine the trends in how Android apps have changed over time with respect to privacy and look at it from two perspectives: (1) how privacy behavior in apps have changed as they are updated over time, (2) how these changes can be accounted for when comparing third-party libraries and the app's own internals. To study this, we examine the adoption of HTTPS, whether apps scan the device for other installed apps, the use of permissions for privacy-sensitive data, and the use of unique identifiers. We find that privacy-related behavior has improved with time as apps continue to receive updates, and that the third-party libraries used by apps are responsible for more issues with privacy. However, we observe that in the current state of Android apps, there has not been enough of an improvement in terms of privacy and many issues still need to be addressed. ",
    "url": "https://arxiv.org/abs/2112.14205",
    "authors": [
      "Alexander Yu",
      "Yuvraj Agarwal",
      "Jason I. Hong"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2112.14209",
    "title": "Joint Activity and Blind Information Detection for UAV-Assisted Massive  IoT Access",
    "abstract": "Grant-free non-coherent index-modulation (NC-IM) has been recently considered as an efficient massive access scheme for enabling cost- and energy-limited Internet-of-Things (IoT) devices with small data packets. This paper investigates the grant-free NC-IM combined with orthogonal frequency division multiplexing for unmanned aerial vehicle (UAV)-based massive IoT access. Specifically, each device is assigned a unique non-orthogonal signature sequence codebook. Each active device transmits one of its signature sequences in the given time-frequency resources, by modulating the information in the index of the transmitted signature sequence. For small-scale MIMO equipped at the UAV-based aerial base station (BS), by jointly exploiting the space-time-frequency domain device activity, we propose a computationally efficient space-time-frequency joint activity and blind information detection (JABID) algorithm with significantly improved detection performance. Furthermore, for large-scale MIMO equipped at the aerial BS, by leveraging the sparsity of the virtual angular-domain channels, we propose an angular-domain based JABID algorithm for improving the system performance with reduced access latency. In addition, for the case of high mobility IoT devices and/or UAVs, we introduce a time-frequency spread transmission (TFST) strategy for the proposed JABID algorithms to combat doubly-selective fading channels. Finally, extensive simulation results are illustrated to verify the superiority of our proposed algorithms and the TFST strategy over known state-of-the-art algorithms. ",
    "url": "https://arxiv.org/abs/2112.14209",
    "authors": [
      "Li Qiao",
      "Jun Zhang",
      "Zhen Gao",
      "Dezhi Zheng",
      "Md. Jahangir Hossain",
      "Yue Gao",
      "Derrick Wing Kwan Ng",
      "Marco Di Renzo"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2112.14232",
    "title": "Constrained Gradient Descent: A Powerful and Principled Evasion Attack  Against Neural Networks",
    "abstract": "Minimal adversarial perturbations added to inputs have been shown to be effective at fooling deep neural networks. In this paper, we introduce several innovations that make white-box targeted attacks follow the intuition of the attacker's goal: to trick the model to assign a higher probability to the target class than to any other, while staying within a specified distance from the original input. First, we propose a new loss function that explicitly captures the goal of targeted attacks, in particular, by using the logits of all classes instead of just a subset, as is common. We show that Auto-PGD with this loss function finds more adversarial examples than it does with other commonly used loss functions. Second, we propose a new attack method that uses a further developed version of our loss function capturing both the misclassification objective and the $L_{\\infty}$ distance limit $\\epsilon$. This new attack method is relatively 1.5--4.2% more successful on the CIFAR10 dataset and relatively 8.2--14.9% more successful on the ImageNet dataset, than the next best state-of-the-art attack. We confirm using statistical tests that our attack outperforms state-of-the-art attacks on different datasets and values of $\\epsilon$ and against different defenses. ",
    "url": "https://arxiv.org/abs/2112.14232",
    "authors": [
      "Weiran Lin",
      "Keane Lucas",
      "Lujo Bauer",
      "Michael K. Reiter",
      "Mahmood Sharif"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.14238",
    "title": "AdaFocus V2: End-to-End Training of Spatial Dynamic Networks for Video  Recognition",
    "abstract": "Recent works have shown that the computational efficiency of video recognition can be significantly improved by reducing the spatial redundancy. As a representative work, the adaptive focus method (AdaFocus) has achieved a favorable trade-off between accuracy and inference speed by dynamically identifying and attending to the informative regions in each video frame. However, AdaFocus requires a complicated three-stage training pipeline (involving reinforcement learning), leading to slow convergence and is unfriendly to practitioners. This work reformulates the training of AdaFocus as a simple one-stage algorithm by introducing a differentiable interpolation-based patch selection operation, enabling efficient end-to-end optimization. We further present an improved training scheme to address the issues introduced by the one-stage formulation, including the lack of supervision, input diversity and training stability. Moreover, a conditional-exit technique is proposed to perform temporal adaptive computation on top of AdaFocus without additional training. Extensive experiments on six benchmark datasets (i.e., ActivityNet, FCVID, Mini-Kinetics, Something-Something V1&V2, and Jester) demonstrate that our model significantly outperforms the original AdaFocus and other competitive baselines, while being considerably more simple and efficient to train. Code is available at https://github.com/LeapLabTHU/AdaFocusV2. ",
    "url": "https://arxiv.org/abs/2112.14238",
    "authors": [
      "Yulin Wang",
      "Yang Yue",
      "Yuanze Lin",
      "Haojun Jiang",
      "Zihang Lai",
      "Victor Kulikov",
      "Nikita Orlov",
      "Humphrey Shi",
      "Gao Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.14244",
    "title": "Robust Convergence in Federated Learning through Label-wise Clustering",
    "abstract": "Non-IID dataset and heterogeneous environment of the local clients are regarded as a major issue in Federated Learning (FL), causing a downturn in the convergence without achieving satisfactory performance. In this paper, we propose a novel Label-wise clustering algorithm that guarantees the trainability among geographically dispersed heterogeneous local clients, by selecting only the local models trained with a dataset that approximates into uniformly distributed class labels, which is likely to obtain faster minimization of the loss and increment the accuracy among the FL network. Through conducting experiments on the suggested six common non-IID scenarios, we empirically show that the vanilla FL aggregation model is incapable of gaining robust convergence generating biased pre-trained local models and drifting the local weights to mislead the trainability in the worst case. Moreover, we quantitatively estimate the expected performance of the local models before training, which offers a global server to select the optimal clients, saving additional computational costs. Ultimately, in order to gain resolution of the non-convergence in such non-IID situations, we design clustering algorithms based on local input class labels, accommodating the diversity and assorting clients that could lead the overall system to attain the swift convergence as global training continues. Our paper shows that proposed Label-wise clustering demonstrates prompt and robust convergence compared to other FL algorithms when local training datasets are non-IID or coexist with IID through multiple experiments. ",
    "url": "https://arxiv.org/abs/2112.14244",
    "authors": [
      "Hunmin Lee",
      "Yueyang Liu",
      "Donghyun Kim",
      "Yingshu Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2112.14266",
    "title": "Session-based Recommendation with Hypergraph Attention Networks",
    "abstract": "Session-based recommender systems aim to improve recommendations in short-term sessions that can be found across many platforms. A critical challenge is to accurately model user intent with only limited evidence in these short sessions. For example, is a flower bouquet being viewed meant as part of a wedding purchase or for home decoration? Such different perspectives greatly impact what should be recommended next. Hence, this paper proposes a novel session-based recommendation system empowered by hypergraph attention networks. Three unique properties of the proposed approach are: (i) it constructs a hypergraph for each session to model the item correlations defined by various contextual windows in the session simultaneously, to uncover item meanings; (ii) it is equipped with hypergraph attention layers to generate item embeddings by flexibly aggregating the contextual information from correlated items in the session; and (iii) it aggregates the dynamic item representations for each session to infer the general purpose and current need, which is decoded to infer the next interesting item in the session. Through experiments on three benchmark datasets, we find the proposed model is effective in generating informative dynamic item embeddings and providing more accurate recommendations compared to the state-of-the-art. ",
    "url": "https://arxiv.org/abs/2112.14266",
    "authors": [
      "Jianling Wang",
      "Kaize Ding",
      "Ziwei Zhu",
      "James Caverlee"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2112.14299",
    "title": "DeepAdversaries: Examining the Robustness of Deep Learning Models for  Galaxy Morphology Classification",
    "abstract": "Data processing and analysis pipelines in cosmological survey experiments introduce data perturbations that can significantly degrade the performance of deep learning-based models. Given the increased adoption of supervised deep learning methods for processing and analysis of cosmological survey data, the assessment of data perturbation effects and the development of methods that increase model robustness are increasingly important. In the context of morphological classification of galaxies, we study the effects of perturbations in imaging data. In particular, we examine the consequences of using neural networks when training on baseline data and testing on perturbed data. We consider perturbations associated with two primary sources: 1) increased observational noise as represented by higher levels of Poisson noise and 2) data processing noise incurred by steps such as image compression or telescope errors as represented by one-pixel adversarial attacks. We also test the efficacy of domain adaptation techniques in mitigating the perturbation-driven errors. We use classification accuracy, latent space visualizations, and latent space distance to assess model robustness. Without domain adaptation, we find that processing pixel-level errors easily flip the classification into an incorrect class and that higher observational noise makes the model trained on low-noise data unable to classify galaxy morphologies. On the other hand, we show that training with domain adaptation improves model robustness and mitigates the effects of these perturbations, improving the classification accuracy by 23% on data with higher observational noise. Domain adaptation also increases by a factor of ~2.3 the latent space distance between the baseline and the incorrectly classified one-pixel perturbed image, making the model more robust to inadvertent perturbations. ",
    "url": "https://arxiv.org/abs/2112.14299",
    "authors": [
      "Aleksandra Ćiprijanović",
      "Diana Kafkes",
      "Gregory Snyder",
      "F. Javier Sánchez",
      "Gabriel Nathan Perdue",
      "Kevin Pedro",
      "Brian Nord",
      "Sandeep Madireddy",
      "Stefan M. Wild"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Astrophysics of Galaxies (astro-ph.GA)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.14303",
    "title": "A proof system for graph (non)-isomorphism verification",
    "abstract": "In order to be able to apply graph isomorphism checking within interactive theorem provers, either graph isomorphism checking algorithms must be mechanically verified, or their results must be verifiable by independent checkers. We analyze a state-of-the-art graph isomorphism checking algorithm (described by McKay and Piperno) and formulate it in a form of a formal proof system. We provide an implementation that can export a proof that an obtained graph is the canonical form of a given graph. Such proofs are then verified by our independent checker, and are used to certify that two given graphs are non-isomorphic. ",
    "url": "https://arxiv.org/abs/2112.14303",
    "authors": [
      "Milan Banković",
      "Ivan Drecun",
      "Filip Marić"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2112.14309",
    "title": "PowerTCP: Pushing the Performance Limits of Datacenter Networks",
    "abstract": "Increasingly stringent throughput and latency requirements in datacenter networks demand fast and accurate congestion control. We observe that the reaction time and accuracy of existing datacenter congestion control schemes are inherently limited. They either rely only on explicit feedback about the network state (e.g., queue lengths in DCTCP) or only on variations of state (e.g., RTT gradient in TIMELY). To overcome these limitations, we propose a novel congestion control algorithm, PowerTCP, which achieves much more fine-grained congestion control by adapting to the bandwidth-window product (henceforth called power). PowerTCP leverages in-band network telemetry to react to changes in the network instantaneously without loss of throughput and while keeping queues short. Due to its fast reaction time, our algorithm is particularly well-suited for dynamic network environments and bursty traffic patterns. We show analytically and empirically that PowerTCP can significantly outperform the state-of-the-art in both traditional datacenter topologies and emerging reconfigurable datacenters where frequent bandwidth changes make congestion control challenging. In traditional datacenter networks, PowerTCP reduces tail flow completion times of short flows by 80% compared to DCQCN and TIMELY, and by 33% compared to HPCC even at 60% network load. In reconfigurable datacenters, PowerTCP achieves 85% circuit utilization without incurring additional latency and cuts tail latency by at least 2x compared to existing approaches. ",
    "url": "https://arxiv.org/abs/2112.14309",
    "authors": [
      "Vamsi Addanki",
      "Oliver Michel",
      "Stefan Schmid"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2112.14314",
    "title": "Improving Prediction of Cognitive Performance using Deep Neural Networks  in Sparse Data",
    "abstract": "Cognition in midlife is an important predictor of age-related mental decline and statistical models that predict cognitive performance can be useful for predicting decline. However, existing models struggle to capture complex relationships between physical, sociodemographic, psychological and mental health factors that effect cognition. Using data from an observational, cohort study, Midlife in the United States (MIDUS), we modeled a large number of variables to predict executive function and episodic memory measures. We used cross-sectional and longitudinal outcomes with varying sparsity, or amount of missing data. Deep neural network (DNN) models consistently ranked highest in all of the cognitive performance prediction tasks, as assessed with root mean squared error (RMSE) on out-of-sample data. RMSE differences between DNN and other model types were statistically significant (T(8) = -3.70; p < 0.05). The interaction effect between model type and sparsity was significant (F(9)=59.20; p < 0.01), indicating the success of DNNs can partly be attributed to their robustness and ability to model hierarchical relationships between health-related factors. Our findings underscore the potential of neural networks to model clinical datasets and allow better understanding of factors that lead to cognitive decline. ",
    "url": "https://arxiv.org/abs/2112.14314",
    "authors": [
      "Sharath Koorathota",
      "Arunesh Mittal",
      "Richard P. Sloan",
      "Paul Sajda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.14337",
    "title": "Closer Look at the Transferability of Adversarial Examples: How They  Fool Different Models Differently",
    "abstract": "Deep neural networks are vulnerable to adversarial examples (AEs), which have adversarial transferability: AEs generated for the source model can mislead another (target) model's predictions. However, the transferability has not been understood from the perspective of to which class target model's predictions were misled (i.e., class-aware transferability). In this paper, we differentiate the cases in which a target model predicts the same wrong class as the source model (\"same mistake\") or a different wrong class (\"different mistake\") to analyze and provide an explanation of the mechanism. First, our analysis shows (1) that same mistakes correlate with \"non-targeted transferability\" and (2) that different mistakes occur between similar models regardless of the perturbation size. Second, we present evidence that the difference in same and different mistakes can be explained by non-robust features, predictive but human-uninterpretable patterns: different mistakes occur when non-robust features in AEs are used differently by models. Non-robust features can thus provide consistent explanations for the class-aware transferability of AEs. ",
    "url": "https://arxiv.org/abs/2112.14337",
    "authors": [
      "Futa Waseda",
      "Sosuke Nishikawa",
      "Trung-Nghia Le",
      "Huy H. Nguyen",
      "Isao Echizen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.14343",
    "title": "Fake or Genuine? Contextualised Text Representation for Fake Review  Detection",
    "abstract": "Online reviews have a significant influence on customers' purchasing decisions for any products or services. However, fake reviews can mislead both consumers and companies. Several models have been developed to detect fake reviews using machine learning approaches. Many of these models have some limitations resulting in low accuracy in distinguishing between fake and genuine reviews. These models focused only on linguistic features to detect fake reviews and failed to capture the semantic meaning of the reviews. To deal with this, this paper proposes a new ensemble model that employs transformer architecture to discover the hidden patterns in a sequence of fake reviews and detect them precisely. The proposed approach combines three transformer models to improve the robustness of fake and genuine behaviour profiling and modelling to detect fake reviews. The experimental results using semi-real benchmark datasets showed the superiority of the proposed model over state-of-the-art models. ",
    "url": "https://arxiv.org/abs/2112.14343",
    "authors": [
      "Rami Mohawesh",
      "Shuxiang Xu",
      "Matthew Springer",
      "Muna Al-Hawawreh",
      "Sumbal Maqsood"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.14364",
    "title": "Feature-context driven Federated Meta-Learning for Rare Disease  Prediction",
    "abstract": "Millions of patients suffer from rare diseases around the world. However, the samples of rare diseases are much smaller than those of common diseases. In addition, due to the sensitivity of medical data, hospitals are usually reluctant to share patient information for data fusion citing privacy concerns. These challenges make it difficult for traditional AI models to extract rare disease features for the purpose of disease prediction. In this paper, we overcome this limitation by proposing a novel approach for rare disease prediction based on federated meta-learning. To improve the prediction accuracy of rare diseases, we design an attention-based meta-learning (ATML) approach which dynamically adjusts the attention to different tasks according to the measured training effect of base learners. Additionally, a dynamic-weight based fusion strategy is proposed to further improve the accuracy of federated learning, which dynamically selects clients based on the accuracy of each local model. Experiments show that with as few as five shots, our approach out-performs the original federated meta-learning algorithm in accuracy and speed. Compared with each hospital's local model, the proposed model's average prediction accuracy increased by 13.28%. ",
    "url": "https://arxiv.org/abs/2112.14364",
    "authors": [
      "Bingyang Chen",
      "Tao Chen",
      "Xingjie Zeng",
      "Weishan Zhang",
      "Qinghua Lu",
      "Zhaoxiang Hou",
      "Jiehan Zhou",
      "Sumi Helal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2112.14382",
    "title": "Self-Supervised Robustifying Guidance for Monocular 3D Face  Reconstruction",
    "abstract": "Despite the recent developments in 3D Face Reconstruction from occluded and noisy face images, the performance is still unsatisfactory. One of the main challenges is to handle moderate to heavy occlusions in the face images. In addition, the noise in the face images inhibits the correct capture of facial attributes, thus needing to be reliably addressed. Moreover, most existing methods rely on additional dependencies, posing numerous constraints over the training procedure. Therefore, we propose a Self-Supervised RObustifying GUidancE (ROGUE) framework to obtain robustness against occlusions and noise in the face images. The proposed network contains 1) the Guidance Pipeline to obtain the 3D face coefficients for the clean faces, and 2) the Robustification Pipeline to acquire the consistency between the estimated coefficients for occluded or noisy images and the clean counterpart. The proposed image- and feature-level loss functions aid the ROGUE learning process without posing additional dependencies. On the three variations of the test dataset of CelebA: rational occlusions, delusional occlusions, and noisy face images, our method outperforms the current state-of-the-art method by large margins (e.g., for the shape-based 3D vertex errors, a reduction from 0.146 to 0.048 for rational occlusions, from 0.292 to 0.061 for delusional occlusions and from 0.269 to 0.053 for the noise in the face images), demonstrating the effectiveness of the proposed approach. ",
    "url": "https://arxiv.org/abs/2112.14382",
    "authors": [
      "Hitika Tiwari",
      "Min-Hung Chen",
      "Yi-Min Tsai",
      "Hsien-Kai Kuo",
      "Hung-Jen Chen",
      "Kevin Jou",
      "K. S. Venkatesh",
      "Yong-Sheng Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.14385",
    "title": "Social Sensors in Epidemiological Networks via Graph Eigenvectors",
    "abstract": "In this paper, we consider epidemiological networks which are used for modeling the transmission of contagious diseases through a population. Specifically, we study the so-called social sensors problem: given an epidemiological network, can we find a small set of nodes such that by monitoring disease transmission on these nodes, we can get ahead of the overall epidemic in the full population? In spite of its societal relevance, there has not been much statistical work on this problem, and we aim to provide an exposition that will hopefully stimulate interest in the research community. Furthermore, by leveraging classical results in spectral graph theory, we propose a novel method for finding social sensors, which achieves substantial improvement over existing methods in both synthetic and real-world epidemiological networks. ",
    "url": "https://arxiv.org/abs/2112.14385",
    "authors": [
      "Shubhajit Sen",
      "Samhita Pal",
      "Srijan Sengupta"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2112.14391",
    "title": "Perceptive Mobile Network with Distributed Target Monitoring Terminals:  Leaking Communication Energy for Sensing",
    "abstract": "Integrated sensing and communication enables sensing capability for wireless networks. However, the interference management and resource allocation between sensing and communication have not been fully studied. In this paper, we consider the design of perceptive mobile networks (PMNs) by adding sensing capability to current cellular networks. To avoid the full-duplex operation and reduce interference, we propose the PMN with distributed target monitoring terminals (TMTs) where passive TMTs are deployed over wireless networks to locate the sensing target (ST). We then jointly optimize the transmit and receive beamformers towards the communication user terminals (UEs) and the ST by alternating-optimization (AO) and prove its convergence. To reduce computation complexity and obtain physical insights, we further investigate the use of linear transceivers, including zero forcing and beam synthesis (B-syn), and show that B-syn can achieve comparable sensing performance as AO especially when the communication requirement is high. Some interesting physical insights are also revealed. For example, instead of forming a dedicated sensing signal, it is more efficient to jointly design the communication signals for different UEs such that they ``collaboratively leak\" energy to the ST. Furthermore, the amount of energy leakage from one UE to the ST depends on their relative locations. ",
    "url": "https://arxiv.org/abs/2112.14391",
    "authors": [
      "Lei Xie",
      "Peilan Wang",
      "S.H. Song",
      "Khaled B. Letaief"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2112.14406",
    "title": "Overcoming Mode Collapse with Adaptive Multi Adversarial Training",
    "abstract": "Generative Adversarial Networks (GANs) are a class of generative models used for various applications, but they have been known to suffer from the mode collapse problem, in which some modes of the target distribution are ignored by the generator. Investigative study using a new data generation procedure indicates that the mode collapse of the generator is driven by the discriminator's inability to maintain classification accuracy on previously seen samples, a phenomenon called Catastrophic Forgetting in continual learning. Motivated by this observation, we introduce a novel training procedure that adaptively spawns additional discriminators to remember previous modes of generation. On several datasets, we show that our training scheme can be plugged-in to existing GAN frameworks to mitigate mode collapse and improve standard metrics for GAN evaluation. ",
    "url": "https://arxiv.org/abs/2112.14406",
    "authors": [
      "Karttikeya Mangalam",
      "Rohin Garg"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.14436",
    "title": "Monte Carlo EM for Deep Time Series Anomaly Detection",
    "abstract": "Time series data are often corrupted by outliers or other kinds of anomalies. Identifying the anomalous points can be a goal on its own (anomaly detection), or a means to improving performance of other time series tasks (e.g. forecasting). Recent deep-learning-based approaches to anomaly detection and forecasting commonly assume that the proportion of anomalies in the training data is small enough to ignore, and treat the unlabeled data as coming from the nominal data distribution. We present a simple yet effective technique for augmenting existing time series models so that they explicitly account for anomalies in the training data. By augmenting the training data with a latent anomaly indicator variable whose distribution is inferred while training the underlying model using Monte Carlo EM, our method simultaneously infers anomalous points while improving model performance on nominal data. We demonstrate the effectiveness of the approach by combining it with a simple feed-forward forecasting model. We investigate how anomalies in the train set affect the training of forecasting models, which are commonly used for time series anomaly detection, and show that our method improves the training of the model. ",
    "url": "https://arxiv.org/abs/2112.14436",
    "authors": [
      "François-Xavier Aubet",
      "Daniel Zügner",
      "Jan Gasthaus"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.14438",
    "title": "Deformable Graph Convolutional Networks",
    "abstract": "Graph neural networks (GNNs) have significantly improved the representation power for graph-structured data. Despite of the recent success of GNNs, the graph convolution in most GNNs have two limitations. Since the graph convolution is performed in a small local neighborhood on the input graph, it is inherently incapable to capture long-range dependencies between distance nodes. In addition, when a node has neighbors that belong to different classes, i.e., heterophily, the aggregated messages from them often negatively affect representation learning. To address the two common problems of graph convolution, in this paper, we propose Deformable Graph Convolutional Networks (Deformable GCNs) that adaptively perform convolution in multiple latent spaces and capture short/long-range dependencies between nodes. Separated from node representations (features), our framework simultaneously learns the node positional embeddings (coordinates) to determine the relations between nodes in an end-to-end fashion. Depending on node position, the convolution kernels are deformed by deformation vectors and apply different transformations to its neighbor nodes. Our extensive experiments demonstrate that Deformable GCNs flexibly handles the heterophily and achieve the best performance in node classification tasks on six heterophilic graph datasets. ",
    "url": "https://arxiv.org/abs/2112.14438",
    "authors": [
      "Jinyoung Park",
      "Sungdong Yoo",
      "Jihwan Park",
      "Hyunwoo J. Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.14468",
    "title": "Challenges and approaches for mitigating byzantine attacks in federated  learning",
    "abstract": "Recently emerged federated learning (FL) is an attractive distributed learning framework in which numerous wireless end-user devices can train a global model with the data remained autochthonous. Compared with the traditional machine learning framework that collects user data for centralized storage, which brings huge communication burden and concerns about data privacy, this approach can not only save the network bandwidth but also protect the data privacy. Despite the promising prospect, byzantine attack, an intractable threat in conventional distributed network, is discovered to be rather efficacious against FL as well. In this paper, we conduct a comprehensive investigation of the state-of-the-art strategies for defending against byzantine attacks in FL. We first provide a taxonomy for the existing defense solutions according to the techniques they used, followed by an across-the-board comparison and discussion. Then we propose a new byzantine attack method called weight attack to defeat those defense schemes, and conduct experiments to demonstrate its threat. The results show that existing defense solutions, although abundant, are still far from fully protecting FL. Finally, we indicate possible countermeasures for weight attack, and highlight several challenges and future research directions for mitigating byzantine attacks in FL. ",
    "url": "https://arxiv.org/abs/2112.14468",
    "authors": [
      "Shengshan Hu",
      "Jianrong Lu",
      "Wei Wan",
      "Leo Yu Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2112.14469",
    "title": "Physical Layer Security Techniques for Future Wireless Networks",
    "abstract": "The broadcast nature of wireless communication systems makes wireless transmission extremely susceptible to eavesdropping and even malicious interference. Physical layer security technology can effectively protect the private information sent by the transmitter from being listened to by illegal eavesdroppers, thus ensuring the privacy and security of communication between the transmitter and legitimate users. The development of mobile communication presents new challenges to physical layer security research. This paper provides a comprehensive survey of the physical layer security research on various promising mobile technologies, including directional modulation (DM), spatial modulation (SM), covert communication, intelligent reflecting surface (IRS)-aided communication, and so on. Finally, future trends and the unresolved technical challenges are summarized in physical layer security for mobile communications. ",
    "url": "https://arxiv.org/abs/2112.14469",
    "authors": [
      "Weiping Shi",
      "Xinyi Jiang",
      "Jinsong Hu",
      "Yin Teng",
      "Yang Wang",
      "Hangjia He",
      "Rongen Dong",
      "Feng Shu",
      "Jiangzhou Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2112.14474",
    "title": "Bayesian Neural Hawkes Process for Event Uncertainty Prediction",
    "abstract": "Many applications comprise of sequences of event data with the time of occurrence of the events. Models for predicting time of occurrence play a significant role in a diverse set of applications like social networks, financial transactions, healthcare, and human mobility. Recent works have introduced neural network based point process for modeling event-times, and were shown to provide state-of-the-art performance in predicting event-times. However, neural networks are poor at quantifying predictive uncertainty and tend to produce overconfident predictions during extrapolation. A proper uncertainty quantification is crucial for many practical applications. Therefore, we propose a novel point process model, Bayesian Neural Hawkes process which leverages uncertainty modelling capability of Bayesian models and generalization capability of the neural networks. The model is capable of predicting epistemic uncertainty over the event occurrence time and its effectiveness is demonstrated for on simulated and real-world datasets. ",
    "url": "https://arxiv.org/abs/2112.14474",
    "authors": [
      "Manisha Dubey",
      "Ragja Palakkadavath",
      "P.K. Srijith"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2112.14476",
    "title": "ADAPQUEST: A Software for Web-Based Adaptive Questionnaires based on  Bayesian Networks",
    "abstract": "We introduce ADAPQUEST, a software tool written in Java for the development of adaptive questionnaires based on Bayesian networks. Adaptiveness is intended here as the dynamical choice of the question sequence on the basis of an evolving model of the skill level of the test taker. Bayesian networks offer a flexible and highly interpretable framework to describe such testing process, especially when coping with multiple skills. ADAPQUEST embeds dedicated elicitation strategies to simplify the elicitation of the questionnaire parameters. An application of this tool for the diagnosis of mental disorders is also discussed together with some implementation details. ",
    "url": "https://arxiv.org/abs/2112.14476",
    "authors": [
      "Claudio Bonesana",
      "Francesca Mangili",
      "Alessandro Antonucci"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.14482",
    "title": "GPS: A Policy-driven Sampling Approach for Graph Representation Learning",
    "abstract": "Graph representation learning has drawn increasing attention in recent years, especially for learning the low dimensional embedding at both node and graph level for classification and recommendations tasks. To enable learning the representation on the large-scale graph data in the real world, numerous research has focused on developing different sampling strategies to facilitate the training process. Herein, we propose an adaptive Graph Policy-driven Sampling model (GPS), where the influence of each node in the local neighborhood is realized through the adaptive correlation calculation. Specifically, the selections of the neighbors are guided by an adaptive policy algorithm, contributing directly to the message aggregation, node embedding updating, and graph level readout steps. We then conduct comprehensive experiments against baseline methods on graph classification tasks from various perspectives. Our proposed model outperforms the existing ones by 3%-8% on several vital benchmarks, achieving state-of-the-art performance in real-world datasets. ",
    "url": "https://arxiv.org/abs/2112.14482",
    "authors": [
      "Tiehua Zhang",
      "Yuze Liu",
      "Xin Chen",
      "Xiaowei Huang",
      "Feng Zhu",
      "Xi Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.14484",
    "title": "Frequency-Aware Contrastive Learning for Neural Machine Translation",
    "abstract": "Low-frequency word prediction remains a challenge in modern neural machine translation (NMT) systems. Recent adaptive training methods promote the output of infrequent words by emphasizing their weights in the overall training objectives. Despite the improved recall of low-frequency words, their prediction precision is unexpectedly hindered by the adaptive objectives. Inspired by the observation that low-frequency words form a more compact embedding space, we tackle this challenge from a representation learning perspective. Specifically, we propose a frequency-aware token-level contrastive learning method, in which the hidden state of each decoding step is pushed away from the counterparts of other target words, in a soft contrastive way based on the corresponding word frequencies. We conduct experiments on widely used NIST Chinese-English and WMT14 English-German translation tasks. Empirical results show that our proposed methods can not only significantly improve the translation quality but also enhance lexical diversity and optimize word representation space. Further investigation reveals that, comparing with related adaptive training strategies, the superiority of our method on low-frequency word prediction lies in the robustness of token-level recall across different frequencies without sacrificing precision. ",
    "url": "https://arxiv.org/abs/2112.14484",
    "authors": [
      "Tong Zhang",
      "Wei Ye",
      "Baosong Yang",
      "Long Zhang",
      "Xingzhang Ren",
      "Dayiheng Liu",
      "Jinan Sun",
      "Shikun Zhang",
      "Haibo Zhang",
      "Wen Zhao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.14497",
    "title": "A fully discrete plates complex on polygonal meshes with application to  the Kirchhoff-Love problem",
    "abstract": "In this work we develop a novel fully discrete version of the plates complex, an exact Hilbert complex relevant for the mixed formulation of fourth-order problems. The derivation of the discrete complex follows the discrete de Rham paradigm, leading to an arbitrary-order construction that applies to meshes composed of general polygonal elements. The discrete plates complex is then used to derive a novel numerical scheme for Kirchhoff--Love plates, for which a full stability and convergence analysis are performed. Extensive numerical tests complete the exposition. ",
    "url": "https://arxiv.org/abs/2112.14497",
    "authors": [
      "Daniele A. Di Pietro",
      "Jérôme Droniou"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2112.14522",
    "title": "The link between countries' economic and scientific wealth has a complex  dependence on technological activity and research policy",
    "abstract": "We studied the research performance of 69 countries by considering two different types of new knowledge: incremental (normal) and fundamental (radical). In principle, these two types of new knowledge should be assessed at two very different levels of citations, but we demonstrate that a simpler assessment can be performed based on the total number of papers (P) and the ratio of the number of papers in the global top 10% of most cited papers divided to the total number of papers (Ptop 10%/P). P represents the quantity, whereas the Ptop 10%/P ratio represents the efficiency. In ideal countries, P and the Ptop 10%/P ratio are linked to the gross domestic product (GDP) and GDP the per capita, respectively. Only countries with high Ptop 10%/P ratios participate actively in the creation of fundamental new knowledge and have Noble laureates. In real countries, the link between economic and scientific wealth can be modified by the technological activity and the research policy. We discuss how technological activity may decrease the Ptop 10%/P ratio while only slightly affecting the capacity to create fundamental new knowledge; in such countries, many papers may report incremental innovations that do not drive the advancement of knowledge. Japan is the clearest example of this, although there are many less extreme examples. Independently of technological activity, research policy has a strong influence on the Ptop 10%/P ratio, which may be higher or lower than expected from the GDP per capita depending on the success of the research policy. ",
    "url": "https://arxiv.org/abs/2112.14522",
    "authors": [
      "Alonso Rodriguez-Navarro",
      "Ricardo Brito"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)"
    ]
  },
  {
    "id": "arXiv:2112.14523",
    "title": "Deep neural network approximation theory for high-dimensional functions",
    "abstract": "The purpose of this article is to develop machinery to study the capacity of deep neural networks (DNNs) to approximate high-dimensional functions. In particular, we show that DNNs have the expressive power to overcome the curse of dimensionality in the approximation of a large class of functions. More precisely, we prove that these functions can be approximated by DNNs on compact sets such that the number of parameters necessary to represent the approximating DNNs grows at most polynomially in the reciprocal $1/\\varepsilon$ of the approximation accuracy $\\varepsilon>0$ and in the input dimension $d\\in \\mathbb{N} =\\{1,2,3,\\dots\\}$. To this end, we introduce certain approximation spaces, consisting of sequences of functions that can be efficiently approximated by DNNs. We then establish closure properties which we combine with known and new bounds on the number of parameters necessary to approximate locally Lipschitz continuous functions, maximum functions, and product functions by DNNs. The main result of this article demonstrates that DNNs have sufficient expressiveness to approximate certain sequences of functions which can be constructed by means of a finite number of compositions using locally Lipschitz continuous functions, maxima, and products without the curse of dimensionality. ",
    "url": "https://arxiv.org/abs/2112.14523",
    "authors": [
      "Pierfrancesco Beneventano",
      "Patrick Cheridito",
      "Robin Graeber",
      "Arnulf Jentzen",
      "Benno Kuckuck"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2112.14530",
    "title": "Source Detection via Contact Tracing in the Presence of Asymptomatic  Patients",
    "abstract": "Inferring the source of a diffusion in a large network of agents is a difficult but feasible task, if a few agents act as sensors revealing the time at which they got hit by the diffusion. A main limitation of current source detection algorithms is that they assume full knowledge of the contact network, which is rarely the case, especially for epidemics, where the source is called patient zero. Inspired by recent contact tracing algorithms, we propose a new framework, which we call Source Detection via Contact Tracing Framework (SDCTF). In the SDCTF, the source detection task starts at the time of the first hospitalization, and initially we have no knowledge about the contact network other than the identity of the first hospitalized agent. We may then explore the network by contact queries, and obtain symptom onset times by test queries in an adaptive way. We also assume that some of the agents may be asymptomatic, and therefore cannot reveal their symptom onset time. Our goal is to find patient zero with as few contact and test queries as possible. We propose two local search algorithms for the SDCTF: the LS algorithm is more data-efficient, but can fail to find the true source if many asymptomatic agents are present, whereas the LS+ algorithm is more robust to asymptomatic agents. By simulations we show that both LS and LS+ outperform state of the art adaptive and non-adaptive source detection algorithms adapted to the SDCTF, even though these baseline algorithms have full access to the contact network. Extending the theory of random exponential trees, we analytically approximate the probability of success of the LS/ LS+ algorithms, and we show that our analytic results match the simulations. Finally, we benchmark our algorithms on the Data-driven COVID-19 Simulator developed by Lorch et al., which is the first time source detection algorithms are tested on such a complex dataset. ",
    "url": "https://arxiv.org/abs/2112.14530",
    "authors": [
      "Gergely Ódor",
      "Jana Vuckovic",
      "Miguel-Angel Sanchez Ndoye",
      "Patrick Thiran"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2112.14531",
    "title": "Designing the Topology of Graph Neural Networks: A Novel Feature Fusion  Perspective",
    "abstract": "In recent years, Graph Neural Networks (GNNs) have shown superior performance on diverse real-world applications. To improve the model capacity, besides designing aggregation operations, GNN topology design is also very important. In general, there are two mainstream GNN topology design manners. The first one is to stack aggregation operations to obtain the higher-level features but easily got performance drop as the network goes deeper. Secondly, the multiple aggregation operations are utilized in each layer which provides adequate and independent feature extraction stage on local neighbors while are costly to obtain the higher-level information. To enjoy the benefits while alleviating the corresponding deficiencies of these two manners, we learn to design the topology of GNNs in a novel feature fusion perspective which is dubbed F$^2$GNN. To be specific, we provide a feature fusion perspective in designing GNN topology and propose a novel framework to unify the existing topology designs with feature selection and fusion strategies. Then we develop a neural architecture search method on top of the unified framework which contains a set of selection and fusion operations in the search space and an improved differentiable search algorithm. The performance gains on eight real-world datasets demonstrate the effectiveness of F$^2$GNN. We further conduct experiments to show that F$^2$GNN can improve the model capacity while alleviating the deficiencies of existing GNN topology design manners, especially alleviating the over-smoothing problem, by utilizing different levels of features adaptively. ",
    "url": "https://arxiv.org/abs/2112.14531",
    "authors": [
      "Lanning Wei",
      "Huan Zhao",
      "Zhiqiang He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.14551",
    "title": "Altitude Optimization of UAV Base Stations from Satellite Images Using  Deep Neural Network",
    "abstract": "It is expected that unmanned aerial vehicles (UAVs) will play a vital role in future communication systems. Optimum positioning of UAVs, serving as base stations, can be done through extensive field measurements or ray tracing simulations when the 3D model of the region of interest is available. In this paper, we present an alternative approach to optimize UAV base station altitude for a region. The approach is based on deep learning; specifically, a 2D satellite image of the target region is input to a deep neural network to predict path loss distributions for different UAV altitudes. The predicted path distributions are used to calculate the coverage in the region; and the optimum altitude, maximizing the coverage, is determined. The neural network is designed and trained to produce multiple path loss distributions in a single inference; thus, it is not necessary to train a separate network for each altitude. ",
    "url": "https://arxiv.org/abs/2112.14551",
    "authors": [
      "Ibrahim Shoer",
      "Bahadir K. Gunturk",
      "Hasan F. Ates",
      "Tuncer Baykas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2112.14566",
    "title": "Mutation Testing in Evolving Systems: Studying the relevance of mutants  to code evolution",
    "abstract": "When software evolves, opportunities for introducing faults appear. Therefore, it is important to test the evolved program behaviors during each evolution cycle. We conduct an exploratory study to investigate the properties of commit-relevant mutants, i.e., the test elements of commit-aware mutation testing, by offering a general definition and an experimental approach to identify them. We thus, aim at investigating the prevalence, location, comparative advantages of commit-aware mutation testing over time (i.e., the program evolution) and the predictive power of several commit-related features to understand the essential properties for its best-effort application case. Our approach utilizes the impact of mutants and the effects of one mutant on another in capturing and analyzing the implicit interactions between the changed and unchanged code parts. The study analyses millions of mutants (over 10 million), 288 commits, five (5) different open-source software projects involving over 68,213 CPU days of computation and sets a ground truth where we perform our analysis. Our analysis shows that commit-relevant mutants are located mainly outside of program commit change (81%), while an effective selection of commit-relevant mutants can reduce the number of mutants by up to 93%. In addition, we demonstrate that commit relevant mutation testing is significantly more effective and efficient than state-of-the-art baselines. Our analysis of the predictive power of mutants and commit-related features in predicting commit-relevant mutants found that most proxy features do not reliably predict commit-relevant mutants. This empirical study highlights the properties of commit-relevant mutants and demonstrates the importance of identifying and selecting commit-relevant mutants when testing evolving software systems. ",
    "url": "https://arxiv.org/abs/2112.14566",
    "authors": [
      "Milos Ojdanic",
      "Ezekiel Soremekun",
      "Renzo Degiovanni",
      "Mike Papadakis",
      "Yves Le Traon"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2112.14624",
    "title": "Towards a Shapley Value Graph Framework for Medical peer-influence",
    "abstract": "eXplainable Artificial Intelligence (XAI) is a sub-field of Artificial Intelligence (AI) that is at the forefront of AI research. In XAI feature attribution methods produce explanations in the form of feature importance. A limitation of existing feature attribution methods is that there is a lack of explanation towards the consequence of intervention. Although contribution towards a certain prediction is highlighted, the influence between features and the consequence of intervention is not addressed. The aim of this paper is to introduce a new framework to look deeper into explanations using graph representation for feature-to-feature interactions to improve the interpretability of black-box Machine Learning (ML) models and inform intervention. ",
    "url": "https://arxiv.org/abs/2112.14624",
    "authors": [
      "Jamie Duell",
      "Monika Seisenberger",
      "Gert Aarts",
      "Shangming Zhou",
      "Xiuyi Fan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.14630",
    "title": "Time Series Data Mining Algorithms Towards Scalable and Real-Time  Behavior Monitoring",
    "abstract": "In recent years, there have been unprecedented technological advances in sensor technology, and sensors have become more affordable than ever. Thus, sensor-driven data collection is increasingly becoming an attractive and practical option for researchers around the globe. Such data is typically extracted in the form of time series data, which can be investigated with data mining techniques to summarize behaviors of a range of subjects including humans and animals. While enabling cheap and mass collection of data, continuous sensor data recording results in datasets which are big in size and volume, which are challenging to process and analyze with traditional techniques in a timely manner. Such collected sensor data is typically extracted in the form of time series data. There are two main approaches in the literature, namely, shape-based classification and feature-based classification. Shape-based classification determines the best class according to a distance measure. Feature-based classification, on the other hand, measures properties of the time series and finds the best class according to the set of features defined for the time series. In this dissertation, we demonstrate that neither of the two techniques will dominate for some problems, but that some combination of both might be the best. In other words, on a single problem, it might be possible that one of the techniques is better for one subset of the behaviors, and the other technique is better for another subset of behaviors. We introduce a hybrid algorithm to classify behaviors, using both shape and feature measures, in weakly labeled time series data collected from sensors to quantify specific behaviors performed by the subject. We demonstrate that our algorithm can robustly classify real, noisy, and complex datasets, based on a combination of shape and features, and tested our proposed algorithm on real-world datasets. ",
    "url": "https://arxiv.org/abs/2112.14630",
    "authors": [
      "Alireza Abdoli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.14655",
    "title": "Broadcasting on Adversarial Multiple Access Channels",
    "abstract": "We study broadcasting on multiple-access channels under adversarial packet injection. Leaky-bucket adversaries model packet injection. There is a fixed set of stations attached to a channel. Additional constrains on the model include bounds on the number of stations activated at a round, individual injection rates, and randomness in generating and injecting packets. Broadcast algorithms that we concentrate on are deterministic and distributed. We demonstrate that some broadcast algorithms designed for ad-hoc channels have bounded latency for wider ranges of injection rates when executed on channels with a fixed number of stations against adversaries that can activate at most one station per round. Individual injection rates are shown to impact latency, as compared to the model of general leaky bucket adversaries. Outcomes of experiments are given that compare the performance of broadcast algorithms against randomized adversaries. The experiments include randomized backoff algorithms. ",
    "url": "https://arxiv.org/abs/2112.14655",
    "authors": [
      "Bader A. Aldawsari",
      "Bogdan S. Chlebus",
      "Dariusz R. Kowalski"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2112.14675",
    "title": "Risk of Phase Incoherence in Wide Area Control of Synchronous Power  Networks",
    "abstract": "We develop a framework to quantify systemic risk measures in a class of Wide-Area-Control (WAC) laws in power networks in the presence of noisy and time-delayed sensory data. A closed-form calculation of the risk of phase incoherence in interconnected power networks is presented, and the effect of network parameters, information flow in WAC architecture, statistics of noise, and time-delays are characterized. We show that in the presence of time-delay and noise, a fundamental trade-off between the best achievable performance (via tuning feedback gains) and value-at-risk emerges. The significance of our results is that they provide a guideline for developing algorithmic design tools to enhance the coherency and robustness of closed-loop power networks simultaneously. Finally, we validate our theoretical findings through extensive simulation examples. ",
    "url": "https://arxiv.org/abs/2112.14675",
    "authors": [
      "Christoforos Somarakis",
      "Guangyi Liu",
      "Nader Motee"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2112.14676",
    "title": "Learning nonlinear dynamics in synchronization of knowledge-based  leader-following networks",
    "abstract": "Knowledge-based leader-following synchronization problem of heterogeneous nonlinear multi-agent systems is challenging since the leader's dynamic information is unknown to all follower nodes. This paper proposes a learning-based fully distributed observer for a class of nonlinear leader systems, which can simultaneously learn the leader's dynamics and states. The class of leader dynamics considered here does not require a bounded Jacobian matrix. Based on this learning-based distributed observer, we further synthesize an adaptive distributed control law for solving the leader-following synchronization problem of multiple Euler-Lagrange systems subject to an uncertain nonlinear leader system. The results are illustrated by a simulation example. ",
    "url": "https://arxiv.org/abs/2112.14676",
    "authors": [
      "Shimin Wang",
      "Xiangyu Meng",
      "Hongwei Zhang",
      "Frank L. Lewis"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Artificial Intelligence (cs.AI)",
      "Optimization and Control (math.OC)",
      "Adaptation and Self-Organizing Systems (nlin.AO)"
    ]
  },
  {
    "id": "arXiv:2112.14698",
    "title": "Asymptotic Learning Requirements for Stealth Attacks",
    "abstract": "Information-theoretic stealth attacks are data injection attacks that minimize the amount of information acquired by the operator about the state variables, while simultaneously limiting the Kullback-Leibler divergence between the distribution of the measurements under attack and the distribution under normal operation with the aim of controling the probability of detection. For Gaussian distributed state variables, attack construction requires knowledge of the second order statistics of the state variables, which is estimated from a finite number of past realizations using a sample covariance matrix. Within this framework, the attack performance is studied for the attack construction with the sample covariance matrix. This results in an analysis of the amount of data required to learn the covariance matrix of the state variables used on the attack construction. The ergodic attack performance is characterized using asymptotic random matrix theory tools, and the variance of the attack performance is bounded. The ergodic performance and the variance bounds are assessed with simulations on IEEE test systems. ",
    "url": "https://arxiv.org/abs/2112.14698",
    "authors": [
      "Ke Sun",
      "Iñaki Esnaola",
      "Antonia M. Tulino",
      "H. Vincent Poor"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2112.14699",
    "title": "Automated Urban Planning for Reimagining City Configuration via  Adversarial Learning: Quantification, Generation, and Evaluation",
    "abstract": "Urban planning refers to the efforts of designing land-use configurations given a region. However, to obtain effective urban plans, urban experts have to spend much time and effort analyzing sophisticated planning constraints based on domain knowledge and personal experiences. To alleviate the heavy burden of them and produce consistent urban plans, we want to ask that can AI accelerate the urban planning process, so that human planners only adjust generated configurations for specific needs? The recent advance of deep generative models provides a possible answer, which inspires us to automate urban planning from an adversarial learning perspective. However, three major challenges arise: 1) how to define a quantitative land-use configuration? 2) how to automate configuration planning? 3) how to evaluate the quality of a generated configuration? In this paper, we systematically address the three challenges. Specifically, 1) We define a land-use configuration as a longitude-latitude-channel tensor. 2) We formulate the automated urban planning problem into a task of deep generative learning. The objective is to generate a configuration tensor given the surrounding contexts of a target region. 3) We provide quantitative evaluation metrics and conduct extensive experiments to demonstrate the effectiveness of our framework. ",
    "url": "https://arxiv.org/abs/2112.14699",
    "authors": [
      "Dongjie Wang",
      "Yanjie Fu",
      "Kunpeng Liu",
      "Fanglan Chen",
      "Pengyang Wang",
      "Chang-Tien Lu"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.14704",
    "title": "Efficient Data Exchange in Unmanned Aerial Vehicle Networks Utilizing  Unsupervised Learning-Based Clustering",
    "abstract": "An unmanned aerial vehicle (UAV) network can serve as an aerial relay to periodically receive packets from macro base stations (BSs). Severe packet loss may happen especially when UAVs have bad wireless connections to a BS. In this paper, a data exchange scheme is proposed utilizing unsupervised learning to enable efficient lost packet retrieval through reliable wireless transmissions between UAVs instead of through retransmissions of macro BSs with a longer delay and higher overhead. With the proposed scheme, all UAVs are assigned to multiple clusters and a UAV can only request its lost packets to UAVs in the same cluster. By this way, UAVs in different clusters could carry out their lost packets retrieval processes simultaneously to expedite data exchange. The agglomerative hierarchical clustering, a type of unsupervised learning, is used to conduct clustering, guaranteeing that UAVs clustered together could supply and supplement each other's lost packets. To further enhance data exchange efficiency, a data exchange mechanism is designed, where the priority of UAVs performing data exchange is determined by the number of their lost packets or the number of requested packets that they can provide. The introduced data exchange mechanism can make each request-reply process maximally beneficial to other UAVs' lost packet retrieval in the same cluster. A new random backoff procedure based on the carrier sense multiple access with collision avoidance (CSMA/CA) is designed to support the data exchange mechanism. Finally, simulation studies are conducted to demonstrate the effectiveness and superiority of our proposed data exchange scheme. ",
    "url": "https://arxiv.org/abs/2112.14704",
    "authors": [
      "Hao Song",
      "Lingjia Liu",
      "Ananth Balasubramanian"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2112.14709",
    "title": "Dynamic Channel Access and Power Control in Wireless Interference  Networks via Multi-Agent Deep Reinforcement Learning",
    "abstract": "Due to the scarcity in the wireless spectrum and limited energy resources especially in mobile applications, efficient resource allocation strategies are critical in wireless networks. Motivated by the recent advances in deep reinforcement learning (DRL), we address multi-agent DRL-based joint dynamic channel access and power control in a wireless interference network. We first propose a multi-agent DRL algorithm with centralized training (DRL-CT) to tackle the joint resource allocation problem. In this case, the training is performed at the central unit (CU) and after training, the users make autonomous decisions on their transmission strategies with only local information. We demonstrate that with limited information exchange and faster convergence, DRL-CT algorithm can achieve 90% of the performance achieved by the combination of weighted minimum mean square error (WMMSE) algorithm for power control and exhaustive search for dynamic channel access. In the second part of this paper, we consider distributed multi-agent DRL scenario in which each user conducts its own training and makes its decisions individually, acting as a DRL agent. Finally, as a compromise between centralized and fully distributed scenarios, we consider federated DRL (FDRL) to approach the performance of DRL-CT with the use of a central unit in training while limiting the information exchange and preserving privacy of the users in the wireless system. Via simulation results, we show that proposed learning frameworks lead to efficient adaptive channel access and power control policies in dynamic environments. ",
    "url": "https://arxiv.org/abs/2112.14709",
    "authors": [
      "Ziyang Lu",
      "Chen Zhong",
      "M. Cenk Gursoy"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2112.14710",
    "title": "Parallelized and Randomized Adversarial Imitation Learning for  Safety-Critical Self-Driving Vehicles",
    "abstract": "Self-driving cars and autonomous driving research has been receiving considerable attention as major promising prospects in modern artificial intelligence applications. According to the evolution of advanced driver assistance system (ADAS), the design of self-driving vehicle and autonomous driving systems becomes complicated and safety-critical. In general, the intelligent system simultaneously and efficiently activates ADAS functions. Therefore, it is essential to consider reliable ADAS function coordination to control the driving system, safely. In order to deal with this issue, this paper proposes a randomized adversarial imitation learning (RAIL) algorithm. The RAIL is a novel derivative-free imitation learning method for autonomous driving with various ADAS functions coordination; and thus it imitates the operation of decision maker that controls autonomous driving with various ADAS functions. The proposed method is able to train the decision maker that deals with the LIDAR data and controls the autonomous driving in multi-lane complex highway environments. The simulation-based evaluation verifies that the proposed method achieves desired performance. ",
    "url": "https://arxiv.org/abs/2112.14710",
    "authors": [
      "Won Joon Yun",
      "MyungJae Shin",
      "Soyi Jung",
      "Sean Kwon",
      "Joongheon Kim"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.14714",
    "title": "Automated Code Optimization with E-Graphs",
    "abstract": "This thesis proposes an advanced, generic and high-level code rewriting and analysis system in the Julia programming language, providing applied equality saturation in the presence of multiple dispatch and metaprogramming. We show how our system can practically solve some challenging problems: Can programmers implement their own high-level compiler optimizations for their domain-specific scientific programs, without the requirement of them being compiler experts at all? Can these optimizers be implemented by users in the same language and inside the same programs they want to optimize, solving the two-language problem? Can these compiler optimizers be written in a high-level fashion, as equations, without the need to worry about the rewriting ordering? Thus, can symbolic mathematics do high-level compiler optimizations or vice-versa? ",
    "url": "https://arxiv.org/abs/2112.14714",
    "authors": [
      "Alessandro Cheli"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Symbolic Computation (cs.SC)"
    ]
  },
  {
    "id": "arXiv:2112.14731",
    "title": "LeSICiN: A Heterogeneous Graph-based Approach for Automatic Legal  Statute Identification from Indian Legal Documents",
    "abstract": "The task of Legal Statute Identification (LSI) aims to identify the legal statutes that are relevant to a given description of Facts or evidence of a legal case. Existing methods only utilize the textual content of Facts and legal articles to guide such a task. However, the citation network among case documents and legal statutes is a rich source of additional information, which is not considered by existing models. In this work, we take the first step towards utilising both the text and the legal citation network for the LSI task. We curate a large novel dataset for this task, including Facts of cases from several major Indian Courts of Law, and statutes from the Indian Penal Code (IPC). Modeling the statutes and training documents as a heterogeneous graph, our proposed model LeSICiN can learn rich textual and graphical features, and can also tune itself to correlate these features. Thereafter, the model can be used to inductively predict links between test documents (new nodes whose graphical features are not available to the model) and statutes (existing nodes). Extensive experiments on the dataset show that our model comfortably outperforms several state-of-the-art baselines, by exploiting the graphical structure along with textual features. The dataset and our codes are available at https://github.com/Law-AI/LeSICiN. ",
    "url": "https://arxiv.org/abs/2112.14731",
    "authors": [
      "Shounak Paul",
      "Pawan Goyal",
      "Saptarshi Ghosh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2112.13844",
    "title": "Stability analysis of heterogeneous oligopoly games of increasing  players with quadratic costs",
    "abstract": "In this discussion draft, we explore heterogeneous oligopoly games of increasing players with quadratic costs, where the market is supposed to have the isoelastic demand. For each of the models considered in this draft, we analytically investigate the necessary and sufficient condition of the local stability of its positive equilibrium. Furthermore, we rigorously prove that the stability regions are enlarged as the number of involved firms is increasing. ",
    "url": "https://arxiv.org/abs/2112.13844",
    "authors": [
      "Xiaoliang Li"
    ],
    "subjectives": [
      "Theoretical Economics (econ.TH)",
      "Symbolic Computation (cs.SC)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2112.13865",
    "title": "Astronomical Image Colorization and upscaling with Generative  Adversarial Networks",
    "abstract": "Automatic colorization of images without human intervention has been a subject of interest in the machine learning community for a brief period of time. Assigning color to an image is a highly ill-posed problem because of its innate nature of possessing very high degrees of freedom; given an image, there is often no single color-combination that is correct. Besides colorization, another problem in reconstruction of images is Single Image Super Resolution, which aims at transforming low resolution images to a higher resolution. This research aims to provide an automated approach for the problem by focusing on a very specific domain of images, namely astronomical images, and process them using Generative Adversarial Networks (GANs). We explore the usage of various models in two different color spaces, RGB and L*a*b. We use transferred learning owing to a small data set, using pre-trained ResNet-18 as a backbone, i.e. encoder for the U-net and fine-tune it further. The model produces visually appealing images which hallucinate high resolution, colorized data in these results which does not exist in the original image. We present our results by evaluating the GANs quantitatively using distance metrics such as L1 distance and L2 distance in each of the color spaces across all channels to provide a comparative analysis. We use Frechet inception distance (FID) to compare the distribution of the generated images with the distribution of the real image to assess the model's performance. ",
    "url": "https://arxiv.org/abs/2112.13865",
    "authors": [
      "Shreyas Kalvankar",
      "Hrushikesh Pandit",
      "Pranav Parwate",
      "Atharva Patil",
      "Snehal Kamalapur"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.13893",
    "title": "Non-Reference Quality Monitoring of Digital Images using Gradient  Statistics and Feedforward Neural Networks",
    "abstract": "Digital images contain a lot of redundancies, therefore, compressions are applied to reduce the image size without the loss of reasonable image quality. The same become more prominent in the case of videos that contains image sequences and higher compression ratios are achieved in low throughput networks. Assessment of the quality of images in such scenarios becomes of particular interest. Subjective evaluation in most of the scenarios becomes infeasible so objective evaluation is preferred. Among the three objective quality measures, full-reference and reduced-reference methods require an original image in some form to calculate the quality score which is not feasible in scenarios such as broadcasting or IP video. Therefore, a non-reference quality metric is proposed to assess the quality of digital images which calculates luminance and multiscale gradient statistics along with mean subtracted contrast normalized products as features to train a Feedforward Neural Network with Scaled Conjugate Gradient. The trained network has provided good regression and R2 measures and further testing on LIVE Image Quality Assessment database release-2 has shown promising results. Pearson, Kendall, and Spearman's correlation are calculated between predicted and actual quality scores and their results are comparable to the state-of-the-art systems. Moreover, the proposed metric is computationally faster than its counterparts and can be used for the quality assessment of image sequences. ",
    "url": "https://arxiv.org/abs/2112.13893",
    "authors": [
      "Nisar Ahmed",
      "Hafiz Muhammad Shahzad Asif",
      "Hassan Khalid"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.13951",
    "title": "Improving Nonparametric Classification via Local Radial Regression with  an Application to Stock Prediction",
    "abstract": "For supervised classification problems, this paper considers estimating the query's label probability through local regression using observed covariates. Well-known nonparametric kernel smoother and $k$-nearest neighbor ($k$-NN) estimator, which take label average over a ball around the query, are consistent but asymptotically biased particularly for a large radius of the ball. To eradicate such bias, local polynomial regression (LPoR) and multiscale $k$-NN (MS-$k$-NN) learn the bias term by local regression around the query and extrapolate it to the query itself. However, their theoretical optimality has been shown for the limit of the infinite number of training samples. For correcting the asymptotic bias with fewer observations, this paper proposes a local radial regression (LRR) and its logistic regression variant called local radial logistic regression (LRLR), by combining the advantages of LPoR and MS-$k$-NN. The idea is simple: we fit the local regression to observed labels by taking the radial distance as the explanatory variable and then extrapolate the estimated label probability to zero distance. Our numerical experiments, including real-world datasets of daily stock indices, demonstrate that LRLR outperforms LPoR and MS-$k$-NN. ",
    "url": "https://arxiv.org/abs/2112.13951",
    "authors": [
      "Ruixing Cao",
      "Akifumi Okuno",
      "Kei Nakagawa",
      "Hidetoshi Shimodaira"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2112.14026",
    "title": "SECP-Net: SE-Connection Pyramid Network of Organ At Risk Segmentation  for Nasopharyngeal Carcinoma",
    "abstract": "Nasopharyngeal carcinoma (NPC) is a kind of malignant tumor. Accurate and automatic segmentation of organs at risk (OAR) of computed tomography (CT) images is clinically significant. In recent years, deep learning models represented by U-Net have been widely applied in medical image segmentation tasks, which can help doctors with reduction of workload and get accurate results more quickly. In OAR segmentation of NPC, the sizes of OAR are variable, especially, some of them are small. Traditional deep neural networks underperform during segmentation due to the lack use of global and multi-size information. This paper proposes a new SE-Connection Pyramid Network (SECP-Net). SECP-Net extracts global and multi-size information flow with se connection (SEC) modules and a pyramid structure of network for improving the segmentation performance, especially that of small organs. SECP-Net also designs an auto-context cascaded network to further improve the segmentation performance. Comparative experiments are conducted between SECP-Net and other recently methods on a dataset with CT images of head and neck. Five-fold cross validation is used to evaluate the performance based on two metrics, i.e., Dice and Jaccard similarity. Experimental results show that SECP-Net can achieve SOTA performance in this challenging task. ",
    "url": "https://arxiv.org/abs/2112.14026",
    "authors": [
      "Zexi Huang",
      "Lihua Guo",
      "Xin Yang",
      "Sijuan Huang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.14040",
    "title": "Deep neural networks for solving forward and inverse problems of  (2+1)-dimensional nonlinear wave equations with rational solitons",
    "abstract": "In this paper, we investigate the forward problems on the data-driven rational solitons for the (2+1)-dimensional KP-I equation and spin-nonlinear Schr\\\"odinger (spin-NLS) equation via the deep neural networks leaning. Moreover, the inverse problems of the (2+1)-dimensional KP-I equation and spin-NLS equation are studied via deep learning. The main idea of the data-driven forward and inverse problems is to use the deep neural networks with the activation function to approximate the solutions of the considered (2+1)-dimensional nonlinear wave equations by optimizing the chosen loss functions related to the considered nonlinear wave equations. ",
    "url": "https://arxiv.org/abs/2112.14040",
    "authors": [
      "Zijian Zhou",
      "Li Wang",
      "Zhenya Yan"
    ],
    "subjectives": [
      "Pattern Formation and Solitons (nlin.PS)",
      "Machine Learning (cs.LG)",
      "Mathematical Physics (math-ph)",
      "Exactly Solvable and Integrable Systems (nlin.SI)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2112.14150",
    "title": "Continuous limits of residual neural networks in case of large input  data",
    "abstract": "Residual deep neural networks (ResNets) are mathematically described as interacting particle systems. In the case of infinitely many layers the ResNet leads to a system of coupled system of ordinary differential equations known as neural differential equations. For large scale input data we derive a mean--field limit and show well--posedness of the resulting description. Further, we analyze the existence of solutions to the training process by using both a controllability and an optimal control point of view. Numerical investigations based on the solution of a formal optimality system illustrate the theoretical findings. ",
    "url": "https://arxiv.org/abs/2112.14150",
    "authors": [
      "M. Herty",
      "A. Thuenen",
      "T. Trimborn",
      "G. Visconti"
    ],
    "subjectives": [
      "Analysis of PDEs (math.AP)",
      "Numerical Analysis (math.NA)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2112.14204",
    "title": "Non-Convex Joint Community Detection and Group Synchronization via  Generalized Power Method",
    "abstract": "This paper proposes a Generalized Power Method (GPM) to tackle the problem of community detection and group synchronization simultaneously in a direct non-convex manner. Under the stochastic group block model (SGBM), theoretical analysis indicates that the algorithm is able to exactly recover the ground truth in $O(n\\log^2n)$ time, sharply outperforming the benchmark method of semidefinite programming (SDP) in $O(n^{3.5})$ time. Moreover, a lower bound of parameters is given as a necessary condition for exact recovery of GPM. The new bound breaches the information-theoretic threshold for pure community detection under the stochastic block model (SBM), thus demonstrating the superiority of our simultaneous optimization algorithm over the trivial two-stage method which performs the two tasks in succession. We also conduct numerical experiments on GPM and SDP to evidence and complement our theoretical analysis. ",
    "url": "https://arxiv.org/abs/2112.14204",
    "authors": [
      "Sijin Chen",
      "Xiwei Cheng",
      "Anthony Man-Cho So"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.14233",
    "title": "Learning Across Bandits in High Dimension via Robust Statistics",
    "abstract": "Decision-makers often face the \"many bandits\" problem, where one must simultaneously learn across related but heterogeneous contextual bandit instances. For instance, a large retailer may wish to dynamically learn product demand across many stores to solve pricing or inventory problems, making it desirable to learn jointly for stores serving similar customers; alternatively, a hospital network may wish to dynamically learn patient risk across many providers to allocate personalized interventions, making it desirable to learn jointly for hospitals serving similar patient populations. We study the setting where the unknown parameter in each bandit instance can be decomposed into a global parameter plus a sparse instance-specific term. Then, we propose a novel two-stage estimator that exploits this structure in a sample-efficient way by using a combination of robust statistics (to learn across similar instances) and LASSO regression (to debias the results). We embed this estimator within a bandit algorithm, and prove that it improves asymptotic regret bounds in the context dimension $d$; this improvement is exponential for data-poor instances. We further demonstrate how our results depend on the underlying network structure of bandit instances. ",
    "url": "https://arxiv.org/abs/2112.14233",
    "authors": [
      "Kan Xu",
      "Hamsa Bastani"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2112.14249",
    "title": "A Finite Sample Theorem for Longitudinal Causal Inference with Machine  Learning: Long Term, Dynamic, and Mediated Effects",
    "abstract": "I construct and justify confidence intervals for longitudinal causal parameters estimated with machine learning. Longitudinal parameters include long term, dynamic, and mediated effects. I provide a nonasymptotic theorem for any longitudinal causal parameter estimated with any machine learning algorithm that satisfies a few simple, interpretable conditions. The main result encompasses local parameters defined for specific demographics as well as proximal parameters defined in the presence of unobserved confounding. Formally, I prove consistency, Gaussian approximation, and semiparametric efficiency. The rate of convergence is $n^{-1/2}$ for global parameters, and it degrades gracefully for local parameters. I articulate a simple set of conditions to translate mean square rates into statistical inference. A key feature of the main result is a new multiple robustness to ill posedness for proximal causal inference in longitudinal settings. ",
    "url": "https://arxiv.org/abs/2112.14249",
    "authors": [
      "Rahul Singh"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Econometrics (econ.EM)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2112.14265",
    "title": "Learning in Repeated Interactions on Networks",
    "abstract": "We study how long-lived, rational, exponentially discounting agents learn in a social network. In every period, each agent observes the past actions of his neighbors, receives a private signal, and chooses an action with the objective of matching the state. Since agents behave strategically, and since their actions depend on higher order beliefs, it is difficult to characterize equilibrium behavior. Nevertheless, we show that regardless of the size and shape of the network, and the patience of the agents, the equilibrium speed of learning is bounded by a constant that only depends on the private signal distribution. ",
    "url": "https://arxiv.org/abs/2112.14265",
    "authors": [
      "Wanying Huang",
      "Philipp Strack",
      "Omer Tamuz"
    ],
    "subjectives": [
      "Theoretical Economics (econ.TH)",
      "Computer Science and Game Theory (cs.GT)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2112.14340",
    "title": "Super-Efficient Super Resolution for Fast Adversarial Defense at the  Edge",
    "abstract": "Autonomous systems are highly vulnerable to a variety of adversarial attacks on Deep Neural Networks (DNNs). Training-free model-agnostic defenses have recently gained popularity due to their speed, ease of deployment, and ability to work across many DNNs. To this end, a new technique has emerged for mitigating attacks on image classification DNNs, namely, preprocessing adversarial images using super resolution -- upscaling low-quality inputs into high-resolution images. This defense requires running both image classifiers and super resolution models on constrained autonomous systems. However, super resolution incurs a heavy computational cost. Therefore, in this paper, we investigate the following question: Does the robustness of image classifiers suffer if we use tiny super resolution models? To answer this, we first review a recent work called Super-Efficient Super Resolution (SESR) that achieves similar or better image quality than prior art while requiring 2x to 330x fewer Multiply-Accumulate (MAC) operations. We demonstrate that despite being orders of magnitude smaller than existing models, SESR achieves the same level of robustness as significantly larger networks. Finally, we estimate end-to-end performance of super resolution-based defenses on a commercial Arm Ethos-U55 micro-NPU. Our findings show that SESR achieves nearly 3x higher FPS than a baseline while achieving similar robustness. ",
    "url": "https://arxiv.org/abs/2112.14340",
    "authors": [
      "Kartikeya Bhardwaj",
      "Dibakar Gope",
      "James Ward",
      "Paul Whatmough",
      "Danny Loh"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.14377",
    "title": "DeepHAM: A Global Solution Method for Heterogeneous Agent Models with  Aggregate Shocks",
    "abstract": "We propose an efficient, reliable, and interpretable global solution method, $\\textit{Deep learning-based algorithm for Heterogeneous Agent Models, DeepHAM}$, for solving high dimensional heterogeneous agent models with aggregate shocks. The state distribution is approximately represented by a set of optimal generalized moments. Deep neural networks are used to approximate the value and policy functions, and the objective is optimized over directly simulated paths. Besides being an accurate global solver, this method has three additional features. First, it is computationally efficient for solving complex heterogeneous agent models, and it does not suffer from the curse of dimensionality. Second, it provides a general and interpretable representation of the distribution over individual states; and this is important for addressing the classical question of whether and how heterogeneity matters in macroeconomics. Third, it solves the constrained efficiency problem as easily as the competitive equilibrium, and this opens up new possibilities for studying optimal monetary and fiscal policies in heterogeneous agent models with aggregate shocks. ",
    "url": "https://arxiv.org/abs/2112.14377",
    "authors": [
      "Jiequn Han",
      "Yucheng Yang",
      "Weinan E"
    ],
    "subjectives": [
      "General Economics (econ.GN)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.14423",
    "title": "Machine Learning Methods for Spectral Efficiency Prediction in Massive  MIMO Systems",
    "abstract": "Channel decoding, channel detection, channel assessment, and resource management for wireless multiple-input multiple-output (MIMO) systems are all examples of problems where machine learning (ML) can be successfully applied. In this paper, we study several ML approaches to solve the problem of estimating the spectral efficiency (SE) value for a certain precoding scheme, preferably in the shortest possible time. The best results in terms of mean average percentage error (MAPE) are obtained with gradient boosting over sorted features, while linear models demonstrate worse prediction quality. Neural networks perform similarly to gradient boosting, but they are more resource- and time-consuming because of hyperparameter tuning and frequent retraining. We investigate the practical applicability of the proposed algorithms in a wide range of scenarios generated by the Quadriga simulator. In almost all scenarios, the MAPE achieved using gradient boosting and neural networks is less than 10\\%. ",
    "url": "https://arxiv.org/abs/2112.14423",
    "authors": [
      "Evgeny Bobrov",
      "Sergey Troshin",
      "Nadezhda Chirkova",
      "Ekaterina Lobacheva",
      "Sviatoslav Panchenko",
      "Dmitry Vetrov",
      "Dmitry Kropotov"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2112.14448",
    "title": "A transfer learning enhanced the physics-informed neural network model  for vortex-induced vibration",
    "abstract": "Vortex-induced vibration (VIV) is a typical nonlinear fluid-structure interaction phenomenon, which widely exists in practical engineering (the flexible riser, the bridge and the aircraft wing, etc). The conventional finite element model (FEM)-based and data-driven approaches for VIV analysis often suffer from the challenges of the computational cost and acquisition of datasets. This paper proposed a transfer learning enhanced the physics-informed neural network (PINN) model to study the VIV (2D). The physics-informed neural network, when used in conjunction with the transfer learning method, enhances learning efficiency and keeps predictability in the target task by common characteristics knowledge from the source model without requiring a huge quantity of datasets. The datasets obtained from VIV experiment are divided evenly two parts (source domain and target domain), to evaluate the performance of the model. The results show that the proposed method match closely with the results available in the literature using conventional PINN algorithms even though the quantity of datasets acquired in training model gradually becomes smaller. The application of the model can break the limitation of monitoring equipment and methods in the practical projects, and promote the in-depth study of VIV. ",
    "url": "https://arxiv.org/abs/2112.14448",
    "authors": [
      "Hesheng Tang",
      "Hu Yang",
      "Yangyang Liao",
      "Liyu Xie"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.14608",
    "title": "HPRN: Holistic Prior-embedded Relation Network for Spectral  Super-Resolution",
    "abstract": "Spectral super-resolution (SSR) refers to the hyperspectral image (HSI) recovery from an RGB counterpart. Due to the one-to-many nature of the SSR problem, a single RGB image can be reprojected to many HSIs. The key to tackle this illposed problem is to plug into multi-source prior information such as the natural RGB spatial context-prior, deep feature-prior or inherent HSI statistical-prior, etc., so as to improve the confidence and fidelity of reconstructed spectra. However, most current approaches only consider the general and limited priors in their designing the customized convolutional neural networks (CNNs), which leads to the inability to effectively alleviate the degree of ill-posedness. To address the problematic issues, we propose a novel holistic prior-embedded relation network (HPRN) for SSR. Basically, the core framework is delicately assembled by several multi-residual relation blocks (MRBs) that fully facilitate the transmission and utilization of the low-frequency content prior of RGB signals. Innovatively, the semantic prior of RGB input is introduced to identify category attributes and a semantic-driven spatial relation module (SSRM) is put forward to perform the feature aggregation among the clustered similar characteristics using a semantic-embedded relation matrix. Additionally, we develop a transformer-based channel relation module (TCRM), which breaks the habit of employing scalars as the descriptors of channel-wise relations in the previous deep feature-prior and replaces them with certain vectors, together with Transformerstyle feature interactions, supporting the representations to be more discriminative. In order to maintain the mathematical correlation and spectral consistency between hyperspectral bands, the second-order prior constraints (SOPC) are incorporated into the loss function to guide the HSI reconstruction process. ",
    "url": "https://arxiv.org/abs/2112.14608",
    "authors": [
      "Chaoxiong Wu",
      "Jiaojiao Li",
      "Rui Song",
      "Yunsong Li",
      "Qian Du"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.14644",
    "title": "Implementation of Convolutional Neural Network Architecture on 3D  Multiparametric Magnetic Resonance Imaging for Prostate Cancer Diagnosis",
    "abstract": "Prostate cancer is one of the most common causes of cancer deaths in men. There is a growing demand for noninvasively and accurately diagnostic methods that facilitate the current standard prostate cancer risk assessment in clinical practice. Still, developing computer-aided classification tools in prostate cancer diagnostics from multiparametric magnetic resonance images continues to be a challenge. In this work, we propose a novel deep learning approach for automatic classification of prostate lesions in the corresponding magnetic resonance images by constructing a two-stage multimodal multi-stream convolutional neural network (CNN)-based architecture framework. Without implementing sophisticated image preprocessing steps or third-party software, our framework achieved the classification performance with the area under a Receiver Operating Characteristic (ROC) curve value of 0.87. The result outperformed most of the submitted methods and shared the highest value reported by the PROSTATEx Challenge organizer. Our proposed CNN-based framework reflects the potential of assisting medical image interpretation in prostate cancer and reducing unnecessary biopsies. ",
    "url": "https://arxiv.org/abs/2112.14644",
    "authors": [
      "Ping-Chang Lin",
      "Teodora Szasz",
      "Hakizumwami B. Runesha"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1812.07183",
    "title": "Optimizing Data Intensive Flows for Networks on Chips",
    "abstract": " Title: Optimizing Data Intensive Flows for Networks on Chips ",
    "url": "https://arxiv.org/abs/1812.07183",
    "authors": [
      "Junwei Zhang",
      "Yang Liu",
      "Li Shi",
      "Thomas G. Robertazzi"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:1910.09089",
    "title": "Decentralized Heterogeneous Multi-Player Multi-Armed Bandits with  Non-Zero Rewards on Collisions",
    "abstract": " Title: Decentralized Heterogeneous Multi-Player Multi-Armed Bandits with  Non-Zero Rewards on Collisions ",
    "url": "https://arxiv.org/abs/1910.09089",
    "authors": [
      "Akshayaa Magesh",
      "Venugopal V. Veeravalli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Science and Game Theory (cs.GT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2003.13511",
    "title": "Improved Gradient based Adversarial Attacks for Quantized Networks",
    "abstract": " Comments: AAAI 2022 ",
    "url": "https://arxiv.org/abs/2003.13511",
    "authors": [
      "Kartik Gupta",
      "Thalaiyasingam Ajanthan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2005.12155",
    "title": "DeepSSM: Deep State-Space Model for 3D Human Motion Prediction",
    "abstract": " Comments: submitted to IEEE Transactions on Systems Man Cybernetics-Systems ",
    "url": "https://arxiv.org/abs/2005.12155",
    "authors": [
      "Xiaoli Liu",
      "Jianqin Yin",
      "Huaping Liu",
      "Jun Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2006.03833",
    "title": "Domain Knowledge Alleviates Adversarial Attacks in Multi-Label  Classifiers",
    "abstract": " Comments: Accepted for publications in IEEE TPAMI journal ",
    "url": "https://arxiv.org/abs/2006.03833",
    "authors": [
      "Stefano Melacci",
      "Gabriele Ciravegna",
      "Angelo Sotgiu",
      "Ambra Demontis",
      "Battista Biggio",
      "Marco Gori",
      "Fabio Roli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2006.04981",
    "title": "A Framework for Neural Network Pruning Using Gibbs Distributions",
    "abstract": " Comments: v1 was presented at IEEE GLOBECOM 2020. v2 is a substantially expanded revision, also written in 2020 ",
    "url": "https://arxiv.org/abs/2006.04981",
    "authors": [
      "Alex Labach",
      "Shahrokh Valaee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2006.12800",
    "title": "Calibration of Neural Networks using Splines",
    "abstract": " Comments: ICLR 2021 ",
    "url": "https://arxiv.org/abs/2006.12800",
    "authors": [
      "Kartik Gupta",
      "Amir Rahimi",
      "Thalaiyasingam Ajanthan",
      "Thomas Mensink",
      "Cristian Sminchisescu",
      "Richard Hartley"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2009.00554",
    "title": "On sensitivity in bipartite Cayley graphs",
    "abstract": " Comments: 21 pages, 5 figures, 2 tables, improved section 7 ",
    "url": "https://arxiv.org/abs/2009.00554",
    "authors": [
      "Ignacio García-Marco",
      "Kolja Knauer"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2009.05679",
    "title": "Strengthening Order Preserving Encryption with Differential Privacy",
    "abstract": " Title: Strengthening Order Preserving Encryption with Differential Privacy ",
    "url": "https://arxiv.org/abs/2009.05679",
    "authors": [
      "Amrita Roy Chowdhury",
      "Bolin Ding",
      "Somesh Jha",
      "Weiran Liu",
      "Jingren Zhou"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2009.06903",
    "title": "A Robust and Reliable Point Cloud Recognition Network Under Rigid  Transformation",
    "abstract": " Comments: 13 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2009.06903",
    "authors": [
      "Dongrui Liu",
      "Chuanchuan Chen",
      "Changqing Xu",
      "Qi Cai",
      "Lei Chu",
      "Fei Wen",
      "Robert Caiming Qiu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2012.15465",
    "title": "Accelerating Neural ODE Based CNN Models on Low-Cost FPGAs",
    "abstract": " Title: Accelerating Neural ODE Based CNN Models on Low-Cost FPGAs ",
    "url": "https://arxiv.org/abs/2012.15465",
    "authors": [
      "Hirohisa Watanabe",
      "Hiroki Matsutani"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2101.03783",
    "title": "Deep Adversarial Inconsistent Cognitive Sampling for Multi-view  Progressive Subspace Clustering",
    "abstract": " Title: Deep Adversarial Inconsistent Cognitive Sampling for Multi-view  Progressive Subspace Clustering ",
    "url": "https://arxiv.org/abs/2101.03783",
    "authors": [
      "Renhao Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2101.11565",
    "title": "Shortest Paths in Graphs of Convex Sets",
    "abstract": " Title: Shortest Paths in Graphs of Convex Sets ",
    "url": "https://arxiv.org/abs/2101.11565",
    "authors": [
      "Tobia Marcucci",
      "Jack Umenberger",
      "Pablo A. Parrilo",
      "Russ Tedrake"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2103.15330",
    "title": "Extending Multi-Sense Word Embedding to Phrases and Sentences for  Unsupervised Semantic Applications",
    "abstract": " Comments: AAAI 2021 ",
    "url": "https://arxiv.org/abs/2103.15330",
    "authors": [
      "Haw-Shiuan Chang",
      "Amol Agrawal",
      "Andrew McCallum"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.15552",
    "title": "Energy Decay Network (EDeN)",
    "abstract": " Title: Energy Decay Network (EDeN) ",
    "url": "https://arxiv.org/abs/2103.15552",
    "authors": [
      "Jamie Nicholas Shelley",
      "Optishell Consultancy"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2104.14468",
    "title": "Star DGT: a Robust Gabor Transform for Speech Denoising",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2103.11233 ",
    "url": "https://arxiv.org/abs/2104.14468",
    "authors": [
      "Vasiliki Kouni",
      "Holger Rauhut",
      "Theoharis Theoharis"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Information Theory (cs.IT)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2105.05838",
    "title": "Breaking Shortcut: Exploring Fully Convolutional Cycle-Consistency for  Video Correspondence Learning",
    "abstract": " Comments: ICCV 2021 SRVU workshop ",
    "url": "https://arxiv.org/abs/2105.05838",
    "authors": [
      "Yansong Tang",
      "Zhenyu Jiang",
      "Zhenda Xie",
      "Yue Cao",
      "Zheng Zhang",
      "Philip H. S. Torr",
      "Han Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.07637",
    "title": "Class-Incremental Few-Shot Object Detection",
    "abstract": " Title: Class-Incremental Few-Shot Object Detection ",
    "url": "https://arxiv.org/abs/2105.07637",
    "authors": [
      "Pengyang Li",
      "Yanan Li",
      "Han Cui",
      "Donghui Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.02285",
    "title": "Subdivision-Based Mesh Convolution Networks",
    "abstract": " Comments: Codes are available in this https URL ",
    "url": "https://arxiv.org/abs/2106.02285",
    "authors": [
      "Shi-Min Hu",
      "Zheng-Ning Liu",
      "Meng-Hao Guo",
      "Jun-Xiong Cai",
      "Jiahui Huang",
      "Tai-Jiang Mu",
      "Ralph R. Martin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.02602",
    "title": "InDiD: Instant Disorder Detection via Representation Learning",
    "abstract": " Title: InDiD: Instant Disorder Detection via Representation Learning ",
    "url": "https://arxiv.org/abs/2106.02602",
    "authors": [
      "Evgenia Romanenkova",
      "Alexey Zaytsev",
      "Ramil Zainulin",
      "Matvey Morozov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.04108",
    "title": "Fully Transformer Networks for Semantic Image Segmentation",
    "abstract": " Title: Fully Transformer Networks for Semantic Image Segmentation ",
    "url": "https://arxiv.org/abs/2106.04108",
    "authors": [
      "Sitong Wu",
      "Tianyi Wu",
      "Fangjian Lin",
      "Shengwei Tian",
      "Guodong Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.07214",
    "title": "Backdoor Learning Curves: Explaining Backdoor Poisoning Beyond Influence  Functions",
    "abstract": " Comments: 33 pages ",
    "url": "https://arxiv.org/abs/2106.07214",
    "authors": [
      "Antonio Emanuele Cinà",
      "Kathrin Grosse",
      "Sebastiano Vascon",
      "Ambra Demontis",
      "Battista Biggio",
      "Fabio Roli",
      "Marcello Pelillo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2107.01832",
    "title": "Provable Convergence of Nesterov's Accelerated Gradient Method for  Over-Parameterized Neural Networks",
    "abstract": " Title: Provable Convergence of Nesterov's Accelerated Gradient Method for  Over-Parameterized Neural Networks ",
    "url": "https://arxiv.org/abs/2107.01832",
    "authors": [
      "Xin Liu",
      "Zhisong Pan",
      "Wei Tao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.02412",
    "title": "GBLinks: GNN-Based Beam Selection and Link Activation for Ultra-dense  D2D mmWave Networks",
    "abstract": " Comments: 31 pages, 9 figures, submitted to IEEE Trans. on Commun., July 2021, major revised in Dec. 2021 ",
    "url": "https://arxiv.org/abs/2107.02412",
    "authors": [
      "S. He",
      "S. Xiong",
      "W. Zhang",
      "Y. Yang",
      "J. Ren",
      "Y. Huang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2107.03673",
    "title": "MOD-Net: A Machine Learning Approach via Model-Operator-Data Network for  Solving PDEs",
    "abstract": " Title: MOD-Net: A Machine Learning Approach via Model-Operator-Data Network for  Solving PDEs ",
    "url": "https://arxiv.org/abs/2107.03673",
    "authors": [
      "Lulu Zhang",
      "Tao Luo",
      "Yaoyu Zhang",
      "Weinan E",
      "Zhi-Qin John Xu",
      "Zheng Ma"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.06353",
    "title": "Distributionally Robust Policy Learning via Adversarial Environment  Generation",
    "abstract": " Comments: IEEE Robotics and Automation Letters, 2022 ",
    "url": "https://arxiv.org/abs/2107.06353",
    "authors": [
      "Allen Z. Ren",
      "Anirudha Majumdar"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.06608",
    "title": "Continuous vs. Discrete Optimization of Deep Neural Networks",
    "abstract": " Comments: Published as spotlight paper at the conference on Neural Information Processing Systems (NeurIPS) 2021 ",
    "url": "https://arxiv.org/abs/2107.06608",
    "authors": [
      "Omer Elkabetz",
      "Nadav Cohen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2107.07394",
    "title": "Explore and Control with Adversarial Surprise",
    "abstract": " Title: Explore and Control with Adversarial Surprise ",
    "url": "https://arxiv.org/abs/2107.07394",
    "authors": [
      "Arnaud Fickinger",
      "Natasha Jaques",
      "Samyak Parajuli",
      "Michael Chang",
      "Nicholas Rhinehart",
      "Glen Berseth",
      "Stuart Russell",
      "Sergey Levine"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2107.07933",
    "title": "Panoptic Segmentation of Satellite Image Time Series with Convolutional  Temporal Attention Networks",
    "abstract": " Comments: Accepted at ICCV2021, PASTIS Dataset available at this https URL, PyTorch implementation at this https URL ",
    "url": "https://arxiv.org/abs/2107.07933",
    "authors": [
      "Vivien Sainte Fare Garnot",
      "Loic Landrieu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.11400",
    "title": "Robust Explainability: A Tutorial on Gradient-Based Attribution Methods  for Deep Neural Networks",
    "abstract": " Comments: 23 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2107.11400",
    "authors": [
      "Ian E. Nielsen",
      "Dimah Dera",
      "Ghulam Rasool",
      "Nidhal Bouaynaya",
      "Ravi P. Ramachandran"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2108.01633",
    "title": "Reducing Linear Hadwiger's Conjecture to Coloring Small Graphs",
    "abstract": " Comments: 29 pages. This version adds the necessary results from arXiv:2006.11798 in order to create a self-contained standalone paper. arXiv admin note: text overlap with arXiv:2006.11798, arXiv:2010.05999 ",
    "url": "https://arxiv.org/abs/2108.01633",
    "authors": [
      "Michelle Delcourt",
      "Luke Postle"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2108.08930",
    "title": "Cross-Silo Federated Learning for Multi-Tier Networks with Vertical and  Horizontal Data Partitioning",
    "abstract": " Comments: Under Review. Prelim Conf. Version in ICASSP 2021: arXiv:2102.03620. Reworked theorem and proof for correctness. Updated paper organization, algorithm description, numerical experiments. Updated authors list ",
    "url": "https://arxiv.org/abs/2108.08930",
    "authors": [
      "Anirban Das",
      "Timothy Castiglia",
      "Shiqiang Wang",
      "Stacy Patterson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2108.12604",
    "title": "New Pruning Method Based on DenseNet Network for Image Classification",
    "abstract": " Comments: 5 pages, 3 figures, TAAI 2021 ",
    "url": "https://arxiv.org/abs/2108.12604",
    "authors": [
      "Rui-Yang Ju",
      "Ting-Yu Lin",
      "Jen-Shiun Chiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.02325",
    "title": "Hocalarim: Mining Turkish Student Reviews",
    "abstract": " Title: Hocalarim: Mining Turkish Student Reviews ",
    "url": "https://arxiv.org/abs/2109.02325",
    "authors": [
      "Ibrahim Faruk Ceylan",
      "Necmettin Bera Calik",
      "Mert Yapucuoglu",
      "Ahmet Yavuz Uluslu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2109.08776",
    "title": "Exploring the Training Robustness of Distributional Reinforcement  Learning against Noisy State Observations",
    "abstract": " Title: Exploring the Training Robustness of Distributional Reinforcement  Learning against Noisy State Observations ",
    "url": "https://arxiv.org/abs/2109.08776",
    "authors": [
      "Ke Sun",
      "Yi Liu",
      "Yingnan Zhao",
      "Hengshuai Yao",
      "Shangling Jui",
      "Linglong Kong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.11313",
    "title": "Physics-informed neural networks for one-dimensional sound field  predictions with parameterized sources and impedance boundaries",
    "abstract": " Comments: 19 pages (double line spacing), 3 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2109.11313",
    "authors": [
      "Nikolas Borrel-Jensen",
      "Allan P. Engsig-Karup",
      "Cheol-Ho Jeong"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2110.01604",
    "title": "CertainNet: Sampling-free Uncertainty Estimation for Object Detection",
    "abstract": " Comments: Published at IEEE Robotics and Automation Letters (RA-L) ",
    "url": "https://arxiv.org/abs/2110.01604",
    "authors": [
      "Stefano Gasperini",
      "Jan Haug",
      "Mohammad-Ali Nikouei Mahani",
      "Alvaro Marcos-Ramiro",
      "Nassir Navab",
      "Benjamin Busam",
      "Federico Tombari"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2110.05940",
    "title": "Cycle-tree guided attack of random K-core: Spin glass model and  efficient message-passing algorithm",
    "abstract": " Comments: Changed into double-column format, 7 pages, 3 figures. Slightly updated model and updated numerical results ",
    "url": "https://arxiv.org/abs/2110.05940",
    "authors": [
      "Hai-Jun Zhou"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Computers and Society (cs.CY)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2110.07557",
    "title": "AIR-Net: Adaptive and Implicit Regularization Neural Network for Matrix  Completion",
    "abstract": " Title: AIR-Net: Adaptive and Implicit Regularization Neural Network for Matrix  Completion ",
    "url": "https://arxiv.org/abs/2110.07557",
    "authors": [
      "Zhemin Li",
      "Tao Sun",
      "Hongxia Wang",
      "Bao Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.08708",
    "title": "Robust Pedestrian Attribute Recognition Using Group Sparsity for  Occlusion Videos",
    "abstract": " Comments: 35 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2110.08708",
    "authors": [
      "Geonu Lee",
      "Kimin Yun",
      "Jungchan Cho"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.09075",
    "title": "Boosting the Transferability of Video Adversarial Examples via Temporal  Translation",
    "abstract": " Title: Boosting the Transferability of Video Adversarial Examples via Temporal  Translation ",
    "url": "https://arxiv.org/abs/2110.09075",
    "authors": [
      "Zhipeng Wei",
      "Jingjing Chen",
      "Zuxuan Wu",
      "Yu-Gang Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.09881",
    "title": "HM-Net: A Regression Network for Object Center Detection and Tracking on  Wide Area Motion Imagery",
    "abstract": " Comments: 14 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2110.09881",
    "authors": [
      "Hakki Motorcu",
      "Hasan F. Ates",
      "H. Fatih Ugurdag",
      "Bahadir Gunturk"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.14181",
    "title": "QU-net++: Image Quality Detection Framework for Segmentation of 3D  Medical Image Stacks",
    "abstract": " Comments: 4 pages, 7 figures, 1 Table ",
    "url": "https://arxiv.org/abs/2110.14181",
    "authors": [
      "Sohini Roychowdhury"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.09547",
    "title": "QGTC: Accelerating Quantized Graph Neural Networks via GPU Tensor Core",
    "abstract": " Title: QGTC: Accelerating Quantized Graph Neural Networks via GPU Tensor Core ",
    "url": "https://arxiv.org/abs/2111.09547",
    "authors": [
      "Yuke Wang",
      "Boyuan Feng",
      "Yufei Ding"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2111.10269",
    "title": "Pointer over Attention: An Improved Bangla Text Summarization Approach  Using Hybrid Pointer Generator Network",
    "abstract": " Comments: {copyright} 2021 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any current or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other works ",
    "url": "https://arxiv.org/abs/2111.10269",
    "authors": [
      "Nobel Dhar",
      "Gaurob Saha",
      "Prithwiraj Bhattacharjee",
      "Avi Mallick",
      "Md Saiful Islam"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.15426",
    "title": "Efficient and robust high-dimensional sparse logistic regression via  nonlinear primal-dual hybrid gradient algorithms",
    "abstract": " Comments: 15 pages ",
    "url": "https://arxiv.org/abs/2111.15426",
    "authors": [
      "Jérôme Darbon",
      "Gabriel P. Langlois"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.04395",
    "title": "On anti-stochastic properties of unlabeled graphs",
    "abstract": " Title: On anti-stochastic properties of unlabeled graphs ",
    "url": "https://arxiv.org/abs/2112.04395",
    "authors": [
      "Sergei Kiselev",
      "Andrey Kupavskii",
      "Oleg Verbitsky",
      "Maksim Zhukovskii"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Cryptography and Security (cs.CR)",
      "Combinatorics (math.CO)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2112.05567",
    "title": "Test-Case Generation for Finding Neural Network Bugs",
    "abstract": " Comments: Reference to Hypothesis changed ",
    "url": "https://arxiv.org/abs/2112.05567",
    "authors": [
      "Mohammad Rezaalipour",
      "Carlo A. Furia"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2112.07895",
    "title": "Robust Depth Completion with Uncertainty-Driven Loss Functions",
    "abstract": " Comments: accepted by AAAI2022 ",
    "url": "https://arxiv.org/abs/2112.07895",
    "authors": [
      "Yufan Zhu",
      "Weisheng Dong",
      "Leida Li",
      "Jinjian Wu",
      "Xin Li",
      "Guangming Shi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.09827",
    "title": "Time-efficient Joint Chance-constrained Optimal Power Flow with a  Learning-based Robust Approximation",
    "abstract": " Comments: 9 pages ",
    "url": "https://arxiv.org/abs/2112.09827",
    "authors": [
      "Ge Chen",
      "Hongcai Zhang",
      "Hongxun Hui",
      "Yonghua Song"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2112.10374",
    "title": "Multi-agent Communication with Graph Information Bottleneck under  Limited Bandwidth",
    "abstract": " Title: Multi-agent Communication with Graph Information Bottleneck under  Limited Bandwidth ",
    "url": "https://arxiv.org/abs/2112.10374",
    "authors": [
      "Qi Tian",
      "Kun Kuang",
      "Baoxiang Wang",
      "Furui Liu",
      "Fei Wu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2112.10913",
    "title": "Accelerating Clique Counting in Sparse Real-World Graphs via  Communication-Reducing Optimizations",
    "abstract": " Title: Accelerating Clique Counting in Sparse Real-World Graphs via  Communication-Reducing Optimizations ",
    "url": "https://arxiv.org/abs/2112.10913",
    "authors": [
      "Amogh Lonkar",
      "Scott Beamer"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2112.11610",
    "title": "EyePAD++: A Distillation-based approach for joint Eye Authentication and  Presentation Attack Detection using Periocular Images",
    "abstract": " Title: EyePAD++: A Distillation-based approach for joint Eye Authentication and  Presentation Attack Detection using Periocular Images ",
    "url": "https://arxiv.org/abs/2112.11610",
    "authors": [
      "Prithviraj Dhar",
      "Amit Kumar",
      "Kirsten Kaplan",
      "Khushi Gupta",
      "Rakesh Ranjan",
      "Rama Chellappa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.11833",
    "title": "Deep learning for brain metastasis detection and segmentation in  longitudinal MRI data",
    "abstract": " Title: Deep learning for brain metastasis detection and segmentation in  longitudinal MRI data ",
    "url": "https://arxiv.org/abs/2112.11833",
    "authors": [
      "Yixing Huang",
      "Christoph Bert",
      "Philipp Sommer",
      "Benjamin Frey",
      "Udo Gaipl",
      "Luitpold V. Distel",
      "Thomas Weissmann",
      "Michael Uder",
      "Manuel A. Schmidt",
      "Arnd Dörfler",
      "Andreas Maier",
      "Rainer Fietkau",
      "Florian Putz"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.12792",
    "title": "Understanding and Measuring Robustness of Multimodal Learning",
    "abstract": " Title: Understanding and Measuring Robustness of Multimodal Learning ",
    "url": "https://arxiv.org/abs/2112.12792",
    "authors": [
      "Nishant Vishwamitra",
      "Hongxin Hu",
      "Ziming Zhao",
      "Long Cheng",
      "Feng Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2112.12845",
    "title": "Reinforced Meta-path Selection for Recommendation on Heterogeneous  Information Networks",
    "abstract": " Title: Reinforced Meta-path Selection for Recommendation on Heterogeneous  Information Networks ",
    "url": "https://arxiv.org/abs/2112.12845",
    "authors": [
      "Wentao Ning",
      "Reynold Cheng",
      "Jiajun Shen",
      "Nur Al Hasan Haldar",
      "Ben Kao",
      "Nan Huo",
      "Wai Kit Lam",
      "Tian Li",
      "Bo Tang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.13143",
    "title": "A Neural Framework for Learning Subgraph and Graph Similarity Measures",
    "abstract": " Title: A Neural Framework for Learning Subgraph and Graph Similarity Measures ",
    "url": "https://arxiv.org/abs/2112.13143",
    "authors": [
      "Rishabh Ranjan",
      "Siddharth Grover",
      "Sourav Medya",
      "Venkatesan Chakaravarthy",
      "Yogish Sabharwal",
      "Sayan Ranu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.13398",
    "title": "Omitted Variable Bias in Machine Learned Causal Models",
    "abstract": " Comments: This version of the paper was prepared for the NeurIPS-2021 Workshop \"Causal Inference & Machine Learning: Why now?''; 32 pages; 4 figures; typos corrected ",
    "url": "https://arxiv.org/abs/2112.13398",
    "authors": [
      "Victor Chernozhukov",
      "Carlos Cinelli",
      "Whitney Newey",
      "Amit Sharma",
      "Vasilis Syrgkanis"
    ],
    "subjectives": [
      "Econometrics (econ.EM)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.13399",
    "title": "The Sketching and Communication Complexity of Subsequence Detection",
    "abstract": " Comments: Corrected Bibliography ",
    "url": "https://arxiv.org/abs/2112.13399",
    "authors": [
      "Mason DiCicco",
      "Daniel Reichman"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2112.13507",
    "title": "Block Modeling-Guided Graph Convolutional Neural Networks",
    "abstract": " Comments: Accepted by Thirty-Sixth AAAI Conference on Artificial Intelligence (AAAI-22) ",
    "url": "https://arxiv.org/abs/2112.13507",
    "authors": [
      "Dongxiao He",
      "Chundong Liang",
      "Huixin Liu",
      "Mingxiang Wen",
      "Pengfei Jiao",
      "Zhiyong Feng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2112.13514",
    "title": "Anomaly Detection using Capsule Networks for High-dimensional Datasets",
    "abstract": " Comments: Submitted to ACML2019 ",
    "url": "https://arxiv.org/abs/2112.13514",
    "authors": [
      "Inderjeet Singh",
      "Nandyala Hemachandra"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.13551",
    "title": "Learning Robust and Lightweight Model through Separable Structured  Transformations",
    "abstract": " Comments: 18 pages, 5figures ",
    "url": "https://arxiv.org/abs/2112.13551",
    "authors": [
      "Xian Wei",
      "Yanhui Huang",
      "Yangyu Xu",
      "Mingsong Chen",
      "Hai Lan",
      "Yuanxiang Li",
      "Zhongfeng Wang",
      "Xuan Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.13705",
    "title": "Graph Collaborative Reasoning",
    "abstract": " Comments: 10 pages. Accepted to ACM WSDM 2022 ",
    "url": "https://arxiv.org/abs/2112.13705",
    "authors": [
      "Hanxiong Chen",
      "Yunqi Li",
      "Shaoyun Shi",
      "Shuchang Liu",
      "He Zhu",
      "Yongfeng Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2112.13734",
    "title": "Multi-Domain Balanced Sampling Improves Out-of-Distribution  Generalization of Chest X-ray Pathology Prediction Models",
    "abstract": " Comments: MED-NEURIPS 2021 ",
    "url": "https://arxiv.org/abs/2112.13734",
    "authors": [
      "Enoch Tetteh",
      "Joseph Viviano",
      "Yoshua Bengio",
      "David Krueger",
      "Joseph Paul Cohen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]