[
  {
    "id": "arXiv:2301.05250",
    "title": "Jamming Attacks on Decentralized Federated Learning in General Multi-Hop  Wireless Networks",
    "abstract": "Decentralized federated learning (DFL) is an effective approach to train a deep learning model at multiple nodes over a multi-hop network, without the need of a server having direct connections to all nodes. In general, as long as nodes are connected potentially via multiple hops, the DFL process will eventually allow each node to experience the effects of models from all other nodes via either direct connections or multi-hop paths, and thus is able to train a high-fidelity model at each node. We consider an effective attack that uses jammers to prevent the model exchanges between nodes. There are two attack scenarios. First, the adversary can attack any link under a certain budget. Once attacked, two end nodes of a link cannot exchange their models. Secondly, some jammers with limited jamming ranges are deployed in the network and a jammer can only jam nodes within its jamming range. Once a directional link is attacked, the receiver node cannot receive the model from the transmitter node. We design algorithms to select links to be attacked for both scenarios. For the second scenario, we also design algorithms to deploy jammers at optimal locations so that they can attack critical nodes and achieve the highest impact on the DFL process. We evaluate these algorithms by using wireless signal classification over a large network area as the use case and identify how these attack mechanisms exploits various learning, connectivity, and sensing aspects. We show that the DFL performance can be significantly reduced by jamming attacks launched in a wireless network and characterize the attack surface as a vulnerability study before the safe deployment of DFL over wireless networks. ",
    "url": "https://arxiv.org/abs/2301.05250",
    "authors": [
      "Yi Shi",
      "Yalin E. Sagduyu",
      "Tugba Erpek"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.05262",
    "title": "Neural Shadow Mapping",
    "abstract": "We present a neural extension of basic shadow mapping for fast, high quality hard and soft shadows. We compare favorably to fast pre-filtering shadow mapping, all while producing visual results on par with ray traced hard and soft shadows. We show that combining memory bandwidth-aware architecture specialization and careful temporal-window training leads to a fast, compact and easy-to-train neural shadowing method. Our technique is memory bandwidth conscious, eliminates the need for post-process temporal anti-aliasing or denoising, and supports scenes with dynamic view, emitters and geometry while remaining robust to unseen objects. ",
    "url": "https://arxiv.org/abs/2301.05262",
    "authors": [
      "Sayantan Datta",
      "Derek Nowrouzezahrai",
      "Christoph Schied",
      "Zhao Dong"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2301.05264",
    "title": "Security-Aware Approximate Spiking Neural Networks",
    "abstract": "Deep Neural Networks (DNNs) and Spiking Neural Networks (SNNs) are both known for their susceptibility to adversarial attacks. Therefore, researchers in the recent past have extensively studied the robustness and defense of DNNs and SNNs under adversarial attacks. Compared to accurate SNNs (AccSNN), approximate SNNs (AxSNNs) are known to be up to 4X more energy-efficient for ultra-low power applications. Unfortunately, the robustness of AxSNNs under adversarial attacks is yet unexplored. In this paper, we first extensively analyze the robustness of AxSNNs with different structural parameters and approximation levels under two gradient-based and two neuromorphic attacks. Then, we propose two novel defense methods, i.e., precision scaling and approximate quantization-aware filtering (AQF), for securing AxSNNs. We evaluated the effectiveness of these two defense methods using both static and neuromorphic datasets. Our results demonstrate that AxSNNs are more prone to adversarial attacks than AccSNNs, but precision scaling and AQF significantly improve the robustness of AxSNNs. For instance, a PGD attack on AxSNN results in a 72\\% accuracy loss compared to AccSNN without any attack, whereas the same attack on the precision-scaled AxSNN leads to only a 17\\% accuracy loss in the static MNIST dataset (4X robustness improvement). Similarly, a Sparse Attack on AxSNN leads to a 77\\% accuracy loss when compared to AccSNN without any attack, whereas the same attack on an AxSNN with AQF leads to only a 2\\% accuracy loss in the neuromorphic DVS128 Gesture dataset (38X robustness improvement). ",
    "url": "https://arxiv.org/abs/2301.05264",
    "authors": [
      "Syed Tihaam Ahmad",
      "Ayesha Siddique",
      "Khaza Anuarul Hoque"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2301.05266",
    "title": "Improving Reliability of Spiking Neural Networks through Fault Aware  Threshold Voltage Optimization",
    "abstract": "Spiking neural networks have made breakthroughs in computer vision by lending themselves to neuromorphic hardware. However, the neuromorphic hardware lacks parallelism and hence, limits the throughput and hardware acceleration of SNNs on edge devices. To address this problem, many systolic-array SNN accelerators (systolicSNNs) have been proposed recently, but their reliability is still a major concern. In this paper, we first extensively analyze the impact of permanent faults on the SystolicSNNs. Then, we present a novel fault mitigation method, i.e., fault-aware threshold voltage optimization in retraining (FalVolt). FalVolt optimizes the threshold voltage for each layer in retraining to achieve the classification accuracy close to the baseline in the presence of faults. To demonstrate the effectiveness of our proposed mitigation, we classify both static (i.e., MNIST) and neuromorphic datasets (i.e., N-MNIST and DVS Gesture) on a 256x256 systolicSNN with stuck-at faults. We empirically show that the classification accuracy of a systolicSNN drops significantly even at extremely low fault rates (as low as 0.012\\%). Our proposed FalVolt mitigation method improves the performance of systolicSNNs by enabling them to operate at fault rates of up to 60\\%, with a negligible drop in classification accuracy (as low as 0.1\\%). Our results show that FalVolt is 2x faster compared to other state-of-the-art techniques common in artificial neural networks (ANNs), such as fault-aware pruning and retraining without threshold voltage optimization. ",
    "url": "https://arxiv.org/abs/2301.05266",
    "authors": [
      "Ayesha Siddique",
      "Khaza Anuarul Hoque"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2301.05272",
    "title": "Inaccessible Neural Language Models Could Reinvigorate Linguistic  Nativism",
    "abstract": "Large Language Models (LLMs) have been making big waves in the machine learning community within the past few years. The impressive scalability of LLMs due to the advent of deep learning can be seen as a continuation of empiricist lingusitic methods, as opposed to rule-based linguistic methods that are grounded in a nativist perspective. Current LLMs are generally inaccessible to resource-constrained researchers, due to a variety of factors including closed source code. This work argues that this lack of accessibility could instill a nativist bias in researchers new to computational linguistics, given that new researchers may only have rule-based, nativist approaches to study to produce new work. Also, given that there are numerous critics of deep learning claiming that LLMs and related methods may soon lose their relevancy, we speculate that such an event could trigger a new wave of nativism in the language processing community. To prevent such a dramatic shift and placing favor in hybrid methods of rules and deep learning, we call upon researchers to open source their LLM code wherever possible to allow both empircist and hybrid approaches to remain accessible. ",
    "url": "https://arxiv.org/abs/2301.05272",
    "authors": [
      "Patrick Perrine"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.05285",
    "title": "Laser Inter-Satellite Link Setup Delay: Quantification, Impact, and  Tolerable Value",
    "abstract": "Dynamic laser inter-satellite links (LISLs) provide the flexibility of connecting a pair of satellites as required (dynamically) while static LISLs need to be active continuously between the energy-constrained satellites. However, due to the LISL establishment time (termed herein as LISL setup delay) being in the order of seconds, realizing dynamic LISLs is currently unfeasible. Towards the realization of dynamic LISLs, we first study the quantification of LISL setup delay; then we calculate the end-to-end latency of a free-space optical satellite network (FSOSN) with the LISL setup delay; subsequently, we analyze the impact of LISL setup delay on the end-to-end latency of the FSOSN. We also provide design guidelines for the laser communication terminal manufacturers in the form of maximum tolerable value of LISL setup delay for which the FSOSN based on Starlink's Phase I satellite constellation will be meaningful to use for low-latency long-distance inter-continental data communications. ",
    "url": "https://arxiv.org/abs/2301.05285",
    "authors": [
      "Dhiraj Bhattacharjee",
      "Aizaz U. Chaudhry",
      "Halim Yanikomeroglu",
      "Peng Hu",
      "Guillaume Lamontagne"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2301.05294",
    "title": "Learning to Control and Coordinate Hybrid Traffic Through Robot Vehicles  at Complex and Unsignalized Intersections",
    "abstract": "Intersections are essential road infrastructures for traffic in modern metropolises; however, they can also be the bottleneck of traffic flows due to traffic incidents or the absence of traffic coordination mechanisms such as traffic lights. Thus, various control and coordination mechanisms that are beyond traditional control methods have been proposed to improve the efficiency of intersection traffic. Amongst these methods, the control of foreseeable hybrid traffic that consists of human-driven vehicles (HVs) and robot vehicles (RVs) has recently emerged. We propose a decentralized reinforcement learning approach for the control and coordination of hybrid traffic at real-world, complex intersections--a topic that has not been previously explored. Comprehensive experiments are conducted to show the effectiveness of our approach. In particular, we show that using 5% RVs, we can prevent congestion formation inside the intersection under the actual traffic demand of 700 vehicles per hour. In contrast, without RVs, congestion starts to develop when the traffic demand reaches as low as 200 vehicles per hour. Further performance gains (reduced waiting time of vehicles at the intersection) are obtained as the RV penetration rate increases. When there exist more than 50% RVs in traffic, our method starts to outperform traffic signals on the average waiting time of all vehicles at the intersection. Our method is also robust against both blackout events and sudden RV percentage drops, and enjoys excellent generalizablility, which is illustrated by its successful deployment in two unseen intersections. ",
    "url": "https://arxiv.org/abs/2301.05294",
    "authors": [
      "Dawei Wang",
      "Weizi Li",
      "Lei Zhu",
      "Jia Pan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.05305",
    "title": "Reinforcement Learning-based Joint Handover and Beam Tracking in  Millimeter-wave Networks",
    "abstract": "In this paper, we develop an algorithm for joint handover and beam tracking in millimeter-wave (mmWave) networks. The aim is to provide a reliable connection in terms of the achieved throughput along the trajectory of the mobile user while preventing frequent handovers. We model the association problem as an optimization problem and propose a reinforcement learning-based solution. Our approach learns whether and when beam tracking and handover should be performed and chooses the target base stations. In the case of beam tracking, we propose a tracking algorithm based on measuring a small spatial neighbourhood of the optimal beams in the previous time slot. Simulation results in an outdoor environment show the superior performance of our proposed solution in achievable throughput and the number of handovers needed in comparison to a multi-connectivity baseline and a learning-based handover baseline. ",
    "url": "https://arxiv.org/abs/2301.05305",
    "authors": [
      "Sara Khosravi",
      "Hossein S. Ghadikolaei",
      "Jens Zander",
      "Marina Petrova"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.05308",
    "title": "Incremental Dead State Detection in Logarithmic Time",
    "abstract": "Identifying live and dead states in an abstract transition system is a recurring problem in formal verification. However, state-of-the-art graph algorithms for maintaining reachability information incrementally (that is, as states are visited and before the entire state space is explored) assume that new edges can be added from any state at any time, whereas in many applications, outgoing edges are added from each state as it is explored. To formalize the latter situation, we propose guided incremental digraphs (GIDs), incremental graphs which support labeling closed states (states which will not receive further outgoing edges). Our main result is that dead state detection in GIDs is solvable in $O(\\log m)$ time per edge update for $m$ edges, improving upon $O(\\sqrt{m})$ per edge due to Bender, Fineman, Gilbert, and Tarjan (BFGT) for general incremental directed graphs. We introduce two algorithms for GIDs: one establishing the logarithmic time bound, and a second algorithm to explore a lazy heuristics-based approach. To demonstrate applicability, we show how GIDs can be used to lazily decide regular expression constraints in SMT applications. To enable an apples-to-apples experimental comparison, we implemented both algorithms, two naive baselines, and the state-of-the-art BFGT baseline using a common directed graph interface in Rust. Our evaluation shows $110$-$530$x speedups over BFGT for the largest input graphs over a range of graph classes, random graphs, and graphs arising from regular expression benchmarks. ",
    "url": "https://arxiv.org/abs/2301.05308",
    "authors": [
      "Caleb Stanford",
      "Margus Veanes"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2301.05323",
    "title": "Salient Object Detection for Images Taken by People With Vision  Impairments",
    "abstract": "Salient object detection is the task of producing a binary mask for an image that deciphers which pixels belong to the foreground object versus background. We introduce a new salient object detection dataset using images taken by people who are visually impaired who were seeking to better understand their surroundings, which we call VizWiz-SalientObject. Compared to seven existing datasets, VizWiz-SalientObject is the largest (i.e., 32,000 human-annotated images) and contains unique characteristics including a higher prevalence of text in the salient objects (i.e., in 68\\% of images) and salient objects that occupy a larger ratio of the images (i.e., on average, $\\sim$50\\% coverage). We benchmarked seven modern salient object detection methods on our dataset and found they struggle most with images featuring salient objects that are large, have less complex boundaries, and lack text as well as for lower quality images. We invite the broader community to work on our new dataset challenge by publicly sharing the dataset at https://vizwiz.org/tasks-and-datasets/salient-object . ",
    "url": "https://arxiv.org/abs/2301.05323",
    "authors": [
      "Jarek Reynolds",
      "Chandra Kanth Nagesh",
      "Danna Gurari"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.05334",
    "title": "TransfQMix: Transformers for Leveraging the Graph Structure of  Multi-Agent Reinforcement Learning Problems",
    "abstract": "Coordination is one of the most difficult aspects of multi-agent reinforcement learning (MARL). One reason is that agents normally choose their actions independently of one another. In order to see coordination strategies emerging from the combination of independent policies, the recent research has focused on the use of a centralized function (CF) that learns each agent's contribution to the team reward. However, the structure in which the environment is presented to the agents and to the CF is typically overlooked. We have observed that the features used to describe the coordination problem can be represented as vertex features of a latent graph structure. Here, we present TransfQMix, a new approach that uses transformers to leverage this latent structure and learn better coordination policies. Our transformer agents perform a graph reasoning over the state of the observable entities. Our transformer Q-mixer learns a monotonic mixing-function from a larger graph that includes the internal and external states of the agents. TransfQMix is designed to be entirely transferable, meaning that same parameters can be used to control and train larger or smaller teams of agents. This enables to deploy promising approaches to save training time and derive general policies in MARL, such as transfer learning, zero-shot transfer, and curriculum learning. We report TransfQMix's performances in the Spread and StarCraft II environments. In both settings, it outperforms state-of-the-art Q-Learning models, and it demonstrates effectiveness in solving problems that other methods can not solve. ",
    "url": "https://arxiv.org/abs/2301.05334",
    "authors": [
      "Matteo Gallici",
      "Mario Martin",
      "Ivan Masmitja"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2301.05345",
    "title": "GOHSP: A Unified Framework of Graph and Optimization-based Heterogeneous  Structured Pruning for Vision Transformer",
    "abstract": "The recently proposed Vision transformers (ViTs) have shown very impressive empirical performance in various computer vision tasks, and they are viewed as an important type of foundation model. However, ViTs are typically constructed with large-scale sizes, which then severely hinder their potential deployment in many practical resources-constrained applications. To mitigate this challenging problem, structured pruning is a promising solution to compress model size and enable practical efficiency. However, unlike its current popularity for CNNs and RNNs, structured pruning for ViT models is little explored. In this paper, we propose GOHSP, a unified framework of Graph and Optimization-based Structured Pruning for ViT models. We first develop a graph-based ranking for measuring the importance of attention heads, and the extracted importance information is further integrated to an optimization-based procedure to impose the heterogeneous structured sparsity patterns on the ViT models. Experimental results show that our proposed GOHSP demonstrates excellent compression performance. On CIFAR-10 dataset, our approach can bring 40% parameters reduction with no accuracy loss for ViT-Small model. On ImageNet dataset, with 30% and 35% sparsity ratio for DeiT-Tiny and DeiT-Small models, our approach achieves 1.65% and 0.76% accuracy increase over the existing structured pruning methods, respectively. ",
    "url": "https://arxiv.org/abs/2301.05345",
    "authors": [
      "Miao Yin",
      "Burak Uzkent",
      "Yilin Shen",
      "Hongxia Jin",
      "Bo Yuan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.05352",
    "title": "Concentration in Gossip Opinion Dynamics over Random Graphs",
    "abstract": "We study concentration phenomena in gossip opinion dynamics over random graphs. In the model, a network is generated from a random graph with independent edges, and agents interact pairwise randomly over the network. During the process, regular agents average the opinions of themselves and their neighbors as updates, whereas stubborn agents do not change opinions. To approximate the original process, we introduce gossip dynamics over an averaged graph, obtained by averaging all possible networks generated from the random graph. Using concentration inequalities, we derive high-probability bounds for the difference between the expected final opinions of the regular agents in the original gossip process and those in the dynamics over the averaged graph. The result shows that the expected final opinions for most networks generated from the random graph are close to the final opinions of the averaged graph, which are convex combinations of stubborn-agent states with weights depending on link probability between regular and stubborn agents. We further show how such concentration can help study the effect of network topology on the expected final opinions in two cases, using matrix perturbation theory: (i) When the influence of stubborn agents is large, the original expected final opinions polarize. (ii) When the influence of stubborn agents is small, the expected final opinions are close to each other. With the help of concentration inequalities of Markov chains, we obtain high-probability bounds for the difference between the time average of agent states in the original process and the expected final opinions of the averaged graph. As an application, we apply the results to gossip dynamics over stochastic block models, which generate networks with community structure, and derive quantitative characterization of the opinion profile. ",
    "url": "https://arxiv.org/abs/2301.05352",
    "authors": [
      "Yu Xing",
      "Karl Henrik Johansson"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2301.05376",
    "title": "Contrast with Major Classifier Vectors for Federated Medical Relation  Extraction with Heterogeneous Label Distribution",
    "abstract": "Federated medical relation extraction enables multiple clients to train a deep network collaboratively without sharing their raw medical data. In order to handle the heterogeneous label distribution across clients, most of the existing works only involve enforcing regularization between local and global models during optimization. In this paper, we fully utilize the models of all clients and propose a novel concept of \\textit{major classifier vectors}, where a group of class vectors is obtained in an ensemble rather than the weighted average method on the server. The major classifier vectors are then distributed to all clients and the local training of each client is Contrasted with Major Classifier vectors (FedCMC), so the local model is not prone to overfitting to the local label distribution. FedCMC requires only a small amount of additional transfer of classifier parameters without any leakage of raw data, extracted representations, and label distributions. Our extensive experiments show that FedCMC outperforms the other state-of-the-art FL algorithms on three medical relation extraction datasets. ",
    "url": "https://arxiv.org/abs/2301.05376",
    "authors": [
      "Chunhui Du",
      "Hao He",
      "Yaohui Jin"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.05380",
    "title": "Prompting Neural Machine Translation with Translation Memories",
    "abstract": "Improving machine translation (MT) systems with translation memories (TMs) is of great interest to practitioners in the MT community. However, previous approaches require either a significant update of the model architecture and/or additional training efforts to make the models well-behaved when TMs are taken as additional input. In this paper, we present a simple but effective method to introduce TMs into neural machine translation (NMT) systems. Specifically, we treat TMs as prompts to the NMT model at test time, but leave the training process unchanged. The result is a slight update of an existing NMT system, which can be implemented in a few hours by anyone who is familiar with NMT. Experimental results on several datasets demonstrate that our system significantly outperforms strong baselines. ",
    "url": "https://arxiv.org/abs/2301.05380",
    "authors": [
      "Abudurexiti Reheman",
      "Tao Zhou",
      "Yingfeng Luo",
      "Di Yang",
      "Tong Xiao",
      "Jingbo Zhu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.05391",
    "title": "Hierarchical Deep Q-Learning Based Handover in Wireless Networks with  Dual Connectivity",
    "abstract": "5G New Radio proposes the usage of frequencies above 10 GHz to speed up LTE's existent maximum data rates. However, the effective size of 5G antennas and consequently its repercussions in the signal degradation in urban scenarios makes it a challenge to maintain stable coverage and connectivity. In order to obtain the best from both technologies, recent dual connectivity solutions have proved their capabilities to improve performance when compared with coexistent standalone 5G and 4G technologies. Reinforcement learning (RL) has shown its huge potential in wireless scenarios where parameter learning is required given the dynamic nature of such context. In this paper, we propose two reinforcement learning algorithms: a single agent RL algorithm named Clipped Double Q-Learning (CDQL) and a hierarchical Deep Q-Learning (HiDQL) to improve Multiple Radio Access Technology (multi-RAT) dual-connectivity handover. We compare our proposal with two baselines: a fixed parameter and a dynamic parameter solution. Simulation results reveal significant improvements in terms of latency with a gain of 47.6% and 26.1% for Digital-Analog beamforming (BF), 17.1% and 21.6% for Hybrid-Analog BF, and 24.7% and 39% for Analog-Analog BF when comparing the RL-schemes HiDQL and CDQL with the with the existent solutions, HiDQL presented a slower convergence time, however obtained a more optimal solution than CDQL. Additionally, we foresee the advantages of utilizing context-information as geo-location of the UEs to reduce the beam exploration sector, and thus improving further multi-RAT handover latency results. ",
    "url": "https://arxiv.org/abs/2301.05391",
    "authors": [
      "Pedro Enrique Iturria Rivera",
      "Medhat Elsayed",
      "Majid Bavand",
      "Raimundas Gaigalas",
      "Steve Furr",
      "Melike Erol-Kantarci"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.05392",
    "title": "Multi-Target Landmark Detection with Incomplete Images via Reinforcement  Learning and Shape Prior",
    "abstract": "Medical images are generally acquired with limited field-of-view (FOV), which could lead to incomplete regions of interest (ROI), and thus impose a great challenge on medical image analysis. This is particularly evident for the learning-based multi-target landmark detection, where algorithms could be misleading to learn primarily the variation of background due to the varying FOV, failing the detection of targets. Based on learning a navigation policy, instead of predicting targets directly, reinforcement learning (RL)-based methods have the potential totackle this challenge in an efficient manner. Inspired by this, in this work we propose a multi-agent RL framework for simultaneous multi-target landmark detection. This framework is aimed to learn from incomplete or (and) complete images to form an implicit knowledge of global structure, which is consolidated during the training stage for the detection of targets from either complete or incomplete test images. To further explicitly exploit the global structural information from incomplete images, we propose to embed a shape model into the RL process. With this prior knowledge, the proposed RL model can not only localize dozens of targetssimultaneously, but also work effectively and robustly in the presence of incomplete images. We validated the applicability and efficacy of the proposed method on various multi-target detection tasks with incomplete images from practical clinics, using body dual-energy X-ray absorptiometry (DXA), cardiac MRI and head CT datasets. Results showed that our method could predict whole set of landmarks with incomplete training images up to 80% missing proportion (average distance error 2.29 cm on body DXA), and could detect unseen landmarks in regions with missing image information outside FOV of target images (average distance error 6.84 mm on 3D half-head CT). ",
    "url": "https://arxiv.org/abs/2301.05392",
    "authors": [
      "Kaiwen Wan",
      "Lei Li",
      "Dengqiang Jia",
      "Shangqi Gao",
      "Wei Qian",
      "Yingzhi Wu",
      "Huandong Lin",
      "Xiongzheng Mu",
      "Xin Gao",
      "Sijia Wang",
      "Fuping Wu",
      "Xiahai Zhuang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.05393",
    "title": "Interaction-Aware Trajectory Planning for Autonomous Vehicles with  Analytic Integration of Neural Networks into Model Predictive Control",
    "abstract": "Autonomous vehicles (AVs) must share the driving space with other drivers and often employ conservative motion planning strategies to ensure safety. These conservative strategies can negatively impact AV's performance and significantly slow traffic throughput. Therefore, to avoid conservatism, we design an interaction-aware motion planner for the ego vehicle (AV) that interacts with surrounding vehicles to perform complex maneuvers in a locally optimal manner. Our planner uses a neural network-based interactive trajectory predictor and analytically integrates it with model predictive control (MPC). We solve the MPC optimization using the alternating direction method of multipliers (ADMM) and prove the algorithm's convergence. We provide an empirical study and compare our method with a baseline heuristic method. ",
    "url": "https://arxiv.org/abs/2301.05393",
    "authors": [
      "Piyush Gupta",
      "David Isele",
      "Donggun Lee",
      "Sangjae Bae"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2301.05411",
    "title": "Do the Defect Prediction Models Really Work?",
    "abstract": "You may develop a potential prediction model, but how can I trust your model that it will benefit my software?. Using a software defect prediction (SDP) model as a tool, we address this fundamental problem in machine learning research. This is a preliminary work targeted at providing an analysis of the developed binary SDP model in real-time working environments. ",
    "url": "https://arxiv.org/abs/2301.05411",
    "authors": [
      "Umamaheswara Sharma B",
      "Ravichandra Sadam"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2301.05412",
    "title": "Evolve Path Tracer: Early Detection of Malicious Addresses in  Cryptocurrency",
    "abstract": "With the ever-increasing boom of Cryptocurrency, detecting fraudulent behaviors and associated malicious addresses draws significant research effort. However, most existing studies still rely on the full history features or full-fledged address transaction networks, thus cannot meet the requirements of early malicious address detection, which is urgent but seldom discussed by existing studies. To detect fraud behaviors of malicious addresses in the early stage, we present Evolve Path Tracer, which consists of Evolve Path Encoder LSTM, Evolve Path Graph GCN, and Hierarchical Survival Predictor. Specifically, in addition to the general address features, we propose asset transfer paths and corresponding path graphs to characterize early transaction patterns. Further, since the transaction patterns are changing rapidly during the early stage, we propose Evolve Path Encoder LSTM and Evolve Path Graph GCN to encode asset transfer path and path graph under an evolving structure setting. Hierarchical Survival Predictor then predicts addresses' labels with nice scalability and faster prediction speed. We investigate the effectiveness and versatility of Evolve Path Tracer on three real-world illicit bitcoin datasets. Our experimental results demonstrate that Evolve Path Tracer outperforms the state-of-the-art methods. Extensive scalability experiments demonstrate the model's adaptivity under a dynamic prediction setting. ",
    "url": "https://arxiv.org/abs/2301.05412",
    "authors": [
      "Ling Cheng",
      "Feida Zhu",
      "Yong Wang",
      "Ruicheng Liang",
      "Huiwen Liu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.05421",
    "title": "Analyzing and Improving the Pyramidal Predictive Network for Future  Video Frame Prediction",
    "abstract": "The pyramidal predictive network (PPNV1) proposes an interesting temporal pyramid architecture and yields promising results on the task of future video-frame prediction. We expose and analyze its signal dissemination and characteristic artifacts, and propose corresponding improvements in model architecture and training strategies to address them. Although the PPNV1 theoretically mimics the workings of human brain, its careless signal processing leads to aliasing in the network. We redesign the network architecture to solve the problems. In addition to improving the unreasonable information dissemination, the new architecture also aims to solve the aliasing in neural networks. Different inputs are no longer simply concatenated, and the downsampling and upsampling components have also been redesigned to ensure that the network can more easily construct images from Fourier features of low-frequency inputs. Finally, we further improve the training strategies, to alleviate the problem of input inconsistency during training and testing. Overall, the improved model is more interpretable, stronger, and the quality of its predictions is better. Code is available at https://github.com/Ling-CF/PPNV2. ",
    "url": "https://arxiv.org/abs/2301.05421",
    "authors": [
      "Chaofan Ling",
      "Weihua Li",
      "Junpei Zhong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.05427",
    "title": "Building a Fuel Moisture Model for the Coupled Fire-Atmosphere Model  WRF-SFIRE from Data: From Kalman Filters to Recurrent Neural Networks",
    "abstract": "The current fuel moisture content (FMC) subsystems in WRF-SFIRE and its workflow system WRFx use a time-lag differential equation model with assimilation of data from FMC sensors on Remote Automated Weather Stations (RAWS) by the extended augmented Kalman filter. But the quality of the result is constrained by the limitations of the model and of the Kalman filter. We observe that the data flow in a system consisting of a model and the Kalman filter can be interpreted to be the same as the data flow in a recurrent neural network (RNN). Thus, instead of building more sophisticated models and data assimilation methods, we want to train a RNN to approximate the dynamics of the response of the FMC sensor to a time series of environmental data. Because standard AI approaches did not converge to reasonable solutions, we pre-train the RNN with special initial weights devised to turn it into a numerical solver of the differential equation. We then allow the AI training machinery to optimize the RNN weights to fit the data better. We illustrate the method on an example of a time series of 10h-FMC from RAWS and weather data from the Real-Time Mesoscale Analysis (RTMA). ",
    "url": "https://arxiv.org/abs/2301.05427",
    "authors": [
      "J. Mandel",
      "J. Hirschi",
      "A. K. Kochanski",
      "A. Farguell",
      "J. Haley",
      "D. V. Mallia",
      "B. Shaddy",
      "A. A. Oberai",
      "K. A. Hilburn"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)"
    ]
  },
  {
    "id": "arXiv:2301.05430",
    "title": "HS-GCN: Hamming Spatial Graph Convolutional Networks for Recommendation",
    "abstract": "An efficient solution to the large-scale recommender system is to represent users and items as binary hash codes in the Hamming space. Towards this end, existing methods tend to code users by modeling their Hamming similarities with the items they historically interact with, which are termed as the first-order similarities in this work. Despite their efficiency, these methods suffer from the suboptimal representative capacity, since they forgo the correlation established by connecting multiple first-order similarities, i.e., the relation among the indirect instances, which could be defined as the high-order similarity. To tackle this drawback, we propose to model both the first- and the high-order similarities in the Hamming space through the user-item bipartite graph. Therefore, we develop a novel learning to hash framework, namely Hamming Spatial Graph Convolutional Networks (HS-GCN), which explicitly models the Hamming similarity and embeds it into the codes of users and items. Extensive experiments on three public benchmark datasets demonstrate that our proposed model significantly outperforms several state-of-the-art hashing models, and obtains performance comparable with the real-valued recommendation models. ",
    "url": "https://arxiv.org/abs/2301.05430",
    "authors": [
      "Han Liu",
      "Yinwei Wei",
      "Jianhua Yin",
      "Liqiang Nie"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2301.05440",
    "title": "Learnable Heterogeneous Convolution: Learning both topology and strength",
    "abstract": "Existing convolution techniques in artificial neural networks suffer from huge computation complexity, while the biological neural network works in a much more powerful yet efficient way. Inspired by the biological plasticity of dendritic topology and synaptic strength, our method, Learnable Heterogeneous Convolution, realizes joint learning of kernel shape and weights, which unifies existing handcrafted convolution techniques in a data-driven way. A model based on our method can converge with structural sparse weights and then be accelerated by devices of high parallelism. In the experiments, our method either reduces VGG16/19 and ResNet34/50 computation by nearly 5x on CIFAR10 and 2x on ImageNet without harming the performance, where the weights are compressed by 10x and 4x respectively; or improves the accuracy by up to 1.0% on CIFAR10 and 0.5% on ImageNet with slightly higher efficiency. The code will be available on www.github.com/Genera1Z/LearnableHeterogeneousConvolution. ",
    "url": "https://arxiv.org/abs/2301.05440",
    "authors": [
      "Rongzhen Zhao",
      "Zhenzhi Wu",
      "Qikun Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.05456",
    "title": "Data Quality for Software Vulnerability Datasets",
    "abstract": "The use of learning-based techniques to achieve automated software vulnerability detection has been of longstanding interest within the software security domain. These data-driven solutions are enabled by large software vulnerability datasets used for training and benchmarking. However, we observe that the quality of the data powering these solutions is currently ill-considered, hindering the reliability and value of produced outcomes. Whilst awareness of software vulnerability data preparation challenges is growing, there has been little investigation into the potential negative impacts of software vulnerability data quality. For instance, we lack confirmation that vulnerability labels are correct or consistent. Our study seeks to address such shortcomings by inspecting five inherent data quality attributes for four state-of-the-art software vulnerability datasets and the subsequent impacts that issues can have on software vulnerability prediction models. Surprisingly, we found that all the analyzed datasets exhibit some data quality problems. In particular, we found 20-71% of vulnerability labels to be inaccurate in real-world datasets, and 17-99% of data points were duplicated. We observed that these issues could cause significant impacts on downstream models, either preventing effective model training or inflating benchmark performance. We advocate for the need to overcome such challenges. Our findings will enable better consideration and assessment of software vulnerability data quality in the future. ",
    "url": "https://arxiv.org/abs/2301.05456",
    "authors": [
      "Roland Croft",
      "M. Ali Babar",
      "Mehdi Kholoosi"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2301.05465",
    "title": "Explicit Temporal Embedding in Deep Generative Latent Models for  Longitudinal Medical Image Synthesis",
    "abstract": "Medical imaging plays a vital role in modern diagnostics and treatment. The temporal nature of disease or treatment progression often results in longitudinal data. Due to the cost and potential harm, acquiring large medical datasets necessary for deep learning can be difficult. Medical image synthesis could help mitigate this problem. However, until now, the availability of GANs capable of synthesizing longitudinal volumetric data has been limited. To address this, we use the recent advances in latent space-based image editing to propose a novel joint learning scheme to explicitly embed temporal dependencies in the latent space of GANs. This, in contrast to previous methods, allows us to synthesize continuous, smooth, and high-quality longitudinal volumetric data with limited supervision. We show the effectiveness of our approach on three datasets containing different longitudinal dependencies. Namely, modeling a simple image transformation, breathing motion, and tumor regression, all while showing minimal disentanglement. The implementation is made available online at https://github.com/julschoen/Temp-GAN. ",
    "url": "https://arxiv.org/abs/2301.05465",
    "authors": [
      "Julian Schön",
      "Raghavendra Selvan",
      "Lotte Nygård",
      "Ivan Richter Vogelius",
      "Jens Petersen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.05466",
    "title": "A Nearly-Linear Time Algorithm for Minimizing Risk of Conflict in Social  Networks",
    "abstract": "Concomitant with the tremendous prevalence of online social media platforms, the interactions among individuals are unprecedentedly enhanced. People are free to interact with acquaintances, express and exchange their own opinions through commenting, liking, retweeting on online social media, leading to resistance, controversy and other important phenomena over controversial social issues, which have been the subject of many recent works. In this paper, we study the problem of minimizing risk of conflict in social networks by modifying the initial opinions of a small number of nodes. We show that the objective function of the combinatorial optimization problem is monotone and supermodular. We then propose a na\\\"{\\i}ve greedy algorithm with a $(1-1/e)$ approximation ratio that solves the problem in cubic time. To overcome the computation challenge for large networks, we further integrate several effective approximation strategies to provide a nearly linear time algorithm with a $(1-1/e-\\epsilon)$ approximation ratio for any error parameter $\\epsilon>0$. Extensive experiments on various real-world datasets demonstrate both the efficiency and effectiveness of our algorithms. In particular, the fast one scales to large networks with more than two million nodes, and achieves up to $20\\times$ speed-up over the state-of-the-art algorithm. ",
    "url": "https://arxiv.org/abs/2301.05466",
    "authors": [
      "Liwang Zhu",
      "Zhongzhi Zhang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2301.05489",
    "title": "Neural Image Compression with a Diffusion-Based Decoder",
    "abstract": "Diffusion probabilistic models have recently achieved remarkable success in generating high quality image and video data. In this work, we build on this class of generative models and introduce a method for lossy compression of high resolution images. The resulting codec, which we call DIffuson-based Residual Augmentation Codec (DIRAC),is the first neural codec to allow smooth traversal of the rate-distortion-perception tradeoff at test time, while obtaining competitive performance with GAN-based methods in perceptual quality. Furthermore, while sampling from diffusion probabilistic models is notoriously expensive, we show that in the compression setting the number of steps can be drastically reduced. ",
    "url": "https://arxiv.org/abs/2301.05489",
    "authors": [
      "Noor Fathima Goose",
      "Jens Petersen",
      "Auke Wiggers",
      "Tianlin Xu",
      "Guillaume Sautière"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2301.05492",
    "title": "Disentangled Representation for Diversified Recommendations",
    "abstract": "Accuracy and diversity have long been considered to be two conflicting goals for recommendations. We point out, however, that as the diversity is typically measured by certain pre-selected item attributes, e.g., category as the most popularly employed one, improved diversity can be achieved without sacrificing recommendation accuracy, as long as the diversification respects the user's preference about the pre-selected attributes. This calls for a fine-grained understanding of a user's preferences over items, where one needs to recognize the user's choice is driven by the quality of the item itself, or the pre-selected attributes of the item. In this work, we focus on diversity defined on item categories. We propose a general diversification framework agnostic to the choice of recommendation algorithms. Our solution disentangles the learnt user representation in the recommendation module into category-independent and category-dependent components to differentiate a user's preference over items from two orthogonal perspectives. Experimental results on three benchmark datasets and online A/B test demonstrate the effectiveness of our solution in improving both recommendation accuracy and diversity. In-depth analysis suggests that the improvement is due to our improved modeling of users' categorical preferences and refined ranking within item categories. ",
    "url": "https://arxiv.org/abs/2301.05492",
    "authors": [
      "Xiaoying Zhang",
      "Hongning Wang",
      "Hang Li"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.05494",
    "title": "Multilingual Detection of Check-Worthy Claims using World Languages and  Adapter Fusion",
    "abstract": "Check-worthiness detection is the task of identifying claims, worthy to be investigated by fact-checkers. Resource scarcity for non-world languages and model learning costs remain major challenges for the creation of models supporting multilingual check-worthiness detection. This paper proposes cross-training adapters on a subset of world languages, combined by adapter fusion, to detect claims emerging globally in multiple languages. (1) With a vast number of annotators available for world languages and the storage-efficient adapter models, this approach is more cost efficient. Models can be updated more frequently and thus stay up-to-date. (2) Adapter fusion provides insights and allows for interpretation regarding the influence of each adapter model on a particular language. The proposed solution often outperformed the top multilingual approaches in our benchmark tasks. ",
    "url": "https://arxiv.org/abs/2301.05494",
    "authors": [
      "Ipek Baris Schlicht",
      "Lucie Flek",
      "Paolo Rosso"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2301.05496",
    "title": "Learning Transformations To Reduce the Geometric Shift in Object  Detection",
    "abstract": "The performance of modern object detectors drops when the test distribution differs from the training one. Most of the methods that address this focus on object appearance changes caused by, e.g., different illumination conditions, or gaps between synthetic and real images. Here, by contrast, we tackle geometric shifts emerging from variations in the image capture process, or due to the constraints of the environment causing differences in the apparent geometry of the content itself. We introduce a self-training approach that learns a set of geometric transformations to minimize these shifts without leveraging any labeled data in the new domain, nor any information about the cameras. We evaluate our method on two different shifts, i.e., a camera's field of view (FoV) change and a viewpoint change. Our results evidence that learning geometric transformations helps detectors to perform better in the target domains. ",
    "url": "https://arxiv.org/abs/2301.05496",
    "authors": [
      "Vidit Vidit",
      "Martin Engilberge",
      "Mathieu Salzmann"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.05499",
    "title": "CLIP the Gap: A Single Domain Generalization Approach for Object  Detection",
    "abstract": "Single Domain Generalization (SDG) tackles the problem of training a model on a single source domain so that it generalizes to any unseen target domain. While this has been well studied for image classification, the literature on SDG object detection remains almost non-existent. To address the challenges of simultaneously learning robust object localization and representation, we propose to leverage a pre-trained vision-language model to introduce semantic domain concepts via textual prompts. We achieve this via a semantic augmentation strategy acting on the features extracted by the detector backbone, as well as a text-based classification loss. Our experiments evidence the benefits of our approach, outperforming by 10% the only existing SDG object detection method, Single-DGOD [49], on their own diverse weather-driving benchmark. ",
    "url": "https://arxiv.org/abs/2301.05499",
    "authors": [
      "Vidit Vidit",
      "Martin Engilberge",
      "Mathieu Salzmann"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.05506",
    "title": "On the feasibility of attacking Thai LPR systems with adversarial  examples",
    "abstract": "Recent advances in deep neural networks (DNNs) have significantly enhanced the capabilities of optical character recognition (OCR) technology, enabling its adoption to a wide range of real-world applications. Despite this success, DNN-based OCR is shown to be vulnerable to adversarial attacks, in which the adversary can influence the DNN model's prediction by carefully manipulating input to the model. Prior work has demonstrated the security impacts of adversarial attacks on various OCR languages. However, to date, no studies have been conducted and evaluated on an OCR system tailored specifically for the Thai language. To bridge this gap, this work presents a feasibility study of performing adversarial attacks on a specific Thai OCR application -- Thai License Plate Recognition (LPR). Moreover, we propose a new type of adversarial attack based on the \\emph{semi-targeted} scenario and show that this scenario is highly realistic in LPR applications. Our experimental results show the feasibility of our attacks as they can be performed on a commodity computer desktop with over 90% attack success rate. ",
    "url": "https://arxiv.org/abs/2301.05506",
    "authors": [
      "Chissanupong Jiamsuchon",
      "Jakapan Suaboot",
      "Norrathep Rattanavipanon"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.05528",
    "title": "Development of a Prototype Application for Rice Disease Detection Using  Convolutional Neural Networks",
    "abstract": "Rice is the number one staple food in the country, as this serves as the primary livelihood for thousands of Filipino households. However, as the tradition continues, farmers are not familiar with the different types of rice leaf diseases that might compromise the entire rice crop. The need to address the common bacterial leaf blight in rice is a serious disease that can lead to reduced yields and even crop loss of up to 75%. This paper is a design and development of a rice leaf disease detection mobile application prototype using an algorithm used for image analysis. The researchers also used the Rice Disease Image Dataset by Huy Minh Do available at https://www.kaggle.com/ to train state-of-the-art convolutional neural networks using transfer learning. Moreover, we used image augmentation to increase the number of image samples and the accuracy of the neural networks as well ",
    "url": "https://arxiv.org/abs/2301.05528",
    "authors": [
      "Harold Costales",
      "Arpee Callejo-Arruejo",
      "Noel Rafanan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.05545",
    "title": "STAR-RIS Assisted Over-the-Air Vertical Federated Learning in Multi-Cell  Wireless Networks",
    "abstract": "Vertical federated learning (FL) is a critical enabler for distributed artificial intelligence services in the emerging 6G era, as it allows for secure and efficient collaboration of machine learning among a wide range of Internet of Things devices. However, current studies of wireless FL typically consider a single task in a single-cell wireless network, ignoring the impact of inter-cell interference on learning performance. In this paper, we investigate a simultaneous transmitting and reflecting reconfigurable intelligent surface (STAR-RIS) assisted over-the-air computation based vertical FL system in multi-cell networks, in which a STAR-RIS is deployed at the cell edge to facilitate the completion of different FL tasks in different cells. We establish the convergence of the proposed system through theoretical analysis and introduce the Pareto boundary of the optimality gaps to characterize the trade-off among cells. Based on the analysis, we then jointly design the transmit and receive beamforming as well as the STAR-RIS transmission and reflection coefficient matrices to minimize the sum of the gaps of all cells. To solve the non-convex resource allocation problem, we introduce a successive convex approximation based algorithm. Numerical experiments demonstrate that compared with conventional approaches, the proposed STAR-RIS assisted vertical FL model and the cooperative resource allocation algorithm achieve much lower mean-squared error for both uplink and downlink transmission in multi-cell wireless networks, resulting in improved learning performance for vertical FL. ",
    "url": "https://arxiv.org/abs/2301.05545",
    "authors": [
      "Xiangyu Zeng",
      "Yijie Mao",
      "Yuanming Shi"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2301.05547",
    "title": "Resilient Model Predictive Control of Distributed Systems Under Attack  Using Local Attack Identification",
    "abstract": "With the growing share of renewable energy sources, the uncertainty in power supply is increasing. In addition to the inherent fluctuations in the renewables, this is due to the threat of deliberate malicious attacks, which may become more revalent with a growing number of distributed generation units. Also in other safety-critical technology sectors, control systems are becoming more and more decentralized, causing the targets for attackers and thus the risk of attacks to increase. It is thus essential that distributed controllers are robust toward these uncertainties and able to react quickly to disturbances of any kind. To this end, we present novel methods for model-based identification of attacks and combine them with distributed model predictive control to obtain a resilient framework for adaptively robust control. The methodology is specially designed for distributed setups with limited local information due to privacy and security reasons. To demonstrate the efficiency of the method, we introduce a mathematical model for physically coupled microgrids under the uncertain influence of renewable generation and adversarial attacks, and perform numerical experiments, applying the proposed method for microgrid control. ",
    "url": "https://arxiv.org/abs/2301.05547",
    "authors": [
      "Sarah Braun",
      "Sebastian Albrecht",
      "Sergio Lucia"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.05550",
    "title": "Recognizing Unit Disk Graphs in Hyperbolic Geometry is  $\\exists\\mathbb{R}$-Complete",
    "abstract": "A graph G is a (Euclidean) unit disk graph if it is the intersection graph of unit disks in the Euclidean plane $\\mathbb{R}^2$. Recognizing them is known to be $\\exists\\mathbb{R}$-complete, i.e., as hard as solving a system of polynomial inequalities. In this note we describe a simple framework to translate $\\exists\\mathbb{R}$-hardness reductions from the Euclidean plane $\\mathbb{R}^2$ to the hyperbolic plane $\\mathbb{H}^2$. We apply our framework to prove that the recognition of unit disk graphs in the hyperbolic plane is also $\\exists\\mathbb{R}$-complete. ",
    "url": "https://arxiv.org/abs/2301.05550",
    "authors": [
      "Nicholas Bieker",
      "Thomas Bläsius",
      "Emil Dohse",
      "Paul Jungeblut"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2301.05565",
    "title": "DINF: Dynamic Instance Noise Filter for Occluded Pedestrian Detection",
    "abstract": "Occlusion issue is the biggest challenge in pedestrian detection. RCNN-based detectors extract instance features by cropping rectangle regions of interest in the feature maps. However, the visible pixels of the occluded objects are limited, making the rectangle instance feature mixed with a lot of instance-irrelevant noise information. Besides, by counting the number of instances with different degrees of overlap of CrowdHuman dataset, we find that the number of severely overlapping objects and the number of slightly overlapping objects are unbalanced, which may exacerbate the challenges posed by occlusion issues. Regarding to the noise issue, from the perspective of denoising, an iterable dynamic instance noise filter (DINF) is proposed for the RCNN-based pedestrian detectors to improve the signal-noise ratio of the instance feature. Simulating the wavelet denoising process, we use the instance feature vector to generate dynamic convolutional kernels to transform the RoIs features to a domain in which the near-zero values represent the noise information. Then, soft thresholding with channel-wise adaptive thresholds is applied to convert the near-zero values to zero to filter out noise information. For the imbalance issue, we propose an IoU-Focal factor (IFF) to modulate the contributions of the well-regressed boxes and the bad-regressed boxes to the loss in the training process, paying more attention to the minority severely overlapping objects. Extensive experiments conducted on CrowdHuman and CityPersons demonstrate that our methods can help RCNN-based pedestrian detectors achieve state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2301.05565",
    "authors": [
      "Li Xiang",
      "He Miao",
      "Luo Haibo",
      "Xiao Jiajie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.05571",
    "title": "The 2022 n2c2/UW Shared Task on Extracting Social Determinants of Health",
    "abstract": "Objective: The n2c2/UW SDOH Challenge explores the extraction of social determinant of health (SDOH) information from clinical notes. The objectives include the advancement of natural language processing (NLP) information extraction techniques for SDOH and clinical information more broadly. This paper presents the shared task, data, participating teams, performance results, and considerations for future work. Materials and Methods: The task used the Social History Annotated Corpus (SHAC), which consists of clinical text with detailed event-based annotations for SDOH events such as alcohol, drug, tobacco, employment, and living situation. Each SDOH event is characterized through attributes related to status, extent, and temporality. The task includes three subtasks related to information extraction (Subtask A), generalizability (Subtask B), and learning transfer (Subtask C). In addressing this task, participants utilized a range of techniques, including rules, knowledge bases, n-grams, word embeddings, and pretrained language models (LM). Results: A total of 15 teams participated, and the top teams utilized pretrained deep learning LM. The top team across all subtasks used a sequence-to-sequence approach achieving 0.901 F1 for Subtask A, 0.774 F1 Subtask B, and 0.889 F1 for Subtask C. Conclusions: Similar to many NLP tasks and domains, pretrained LM yielded the best performance, including generalizability and learning transfer. An error analysis indicates extraction performance varies by SDOH, with lower performance achieved for conditions, like substance use and homelessness, that increase health risks (risk factors) and higher performance achieved for conditions, like substance abstinence and living with family, that reduce health risks (protective factors). ",
    "url": "https://arxiv.org/abs/2301.05571",
    "authors": [
      "Kevin Lybarger",
      "Meliha Yetisgen",
      "Özlem Uzuner"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2301.05589",
    "title": "A Framework for the Evaluation of Network Reliability Under Periodic  Demand",
    "abstract": "In this paper, we study network reliability in relation to a periodic time-dependent utility function that reflects the system's functional performance. When an anomaly occurs, the system incurs a loss of utility that depends on the anomaly's timing and duration. We analyze the long-term average utility loss by considering exponential anomalies' inter-arrival times and general distributions of maintenance duration. We show that the expected utility loss converges in probability to a simple form. We then extend our convergence results to more general distributions of anomalies' inter-arrival times and to particular families of non-periodic utility functions. To validate our results, we use data gathered from a cellular network consisting of 660 base stations and serving over 20k users. We demonstrate the quasi-periodic nature of users' traffic and the exponential distribution of the anomalies' inter-arrival times, allowing us to apply our results and provide reliability scores for the network. We also discuss the convergence speed of the long-term average utility loss, the interplay between the different network's parameters, and the impact of non-stationarity on our convergence results. ",
    "url": "https://arxiv.org/abs/2301.05589",
    "authors": [
      "Ali Maatouk",
      "Fadhel Ayed",
      "Shi Biao",
      "Wenjie Li",
      "Harvey Bao",
      "Enrico Zio"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2301.05601",
    "title": "Sem@$K$: Is my knowledge graph embedding model semantic-aware?",
    "abstract": "Using knowledge graph embedding models (KGEMs) is a popular approach for predicting links in knowledge graphs (KGs). Traditionally, the performance of KGEMs for link prediction is assessed using rank-based metrics, which evaluate their ability to give high scores to ground-truth entities. However, the literature claims that the KGEM evaluation procedure would benefit from adding supplementary dimensions to assess. That is why, in this paper, we extend our previously introduced metric Sem@$K$ that measures the capability of models to predict valid entities w.r.t. domain and range constrains. In particular, we consider a broad range of KGs and take their respective characteristics into account to propose different versions of Sem@$K$. We also perform an extensive study of KGEM semantic awareness. Our experiments show that Sem@$K$ provides a new perspective on KGEM quality. Its joint analysis with rank-based metrics offer different conclusions on the predictive power of models. Regarding Sem@$K$, some KGEMs are inherently better than others, but this semantic superiority is not indicative of their performance w.r.t. rank-based metrics. In this work, we generalize conclusions about the relative performance of KGEMs w.r.t. rank-based and semantic-oriented metrics at the level of families of models. The joint analysis of the aforementioned metrics gives more insight into the peculiarities of each model. This work paves the way for a more comprehensive evaluation of KGEM adequacy for specific downstream tasks. ",
    "url": "https://arxiv.org/abs/2301.05601",
    "authors": [
      "Nicolas Hubert",
      "Pierre Monnin",
      "Armelle Brun",
      "Davy Monticolo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2301.05604",
    "title": "A LiDAR-Inertial-Visual SLAM System with Loop Detection",
    "abstract": "We have proposed, to the best of our knowledge, the first-of-its-kind LiDAR-Inertial-Visual-Fused simultaneous localization and mapping (SLAM) system with a strong place recognition capacity. Our proposed SLAM system is consist of visual-inertial odometry (VIO) and LiDAR inertial odometry (LIO) subsystems. We propose the LIO subsystem utilizing the measurement from the LiDAR and the inertial sensors to build the local odometry map, and propose the VIO subsystem which takes in the visual information to construct the 2D-3D associated map. Then, we propose an iterative Kalman Filter-based optimization function to optimize the local project-based 2D-to-3D photo-metric error between the projected image pixels and the local 3D points to make the robust 2D-3D alignment. Finally, we have also proposed the back-end pose graph global optimization and the elaborately designed loop closure detection network to improve the accuracy of the whole SLAM system. Extensive experiments deployed on the UGV in complicated real-world circumstances demonstrate that our proposed LiDAR-Visual-Inertial localization system outperforms the current state-of-the-art in terms of accuracy, efficiency, and robustness. ",
    "url": "https://arxiv.org/abs/2301.05604",
    "authors": [
      "Kangcheng Liu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2301.05610",
    "title": "Accelerating greedy algorithm for model reduction of complex systems by  multi-fidelity error estimation",
    "abstract": "Model order reduction usually consists of two stages: the offline stage and the online stage. The offline stage is the expensive part that sometimes takes hours till the final reduced-order model is derived, especially when the original model is very large or complex. Once the reduced-order model is obtained, the online stage of querying the reduced-order model for simulation is very fast and often real-time capable. This work concerns a strategy to significantly speed up the offline stage of model order reduction for large and complex systems. In particular, it is successful in accelerating the greedy algorithm that is often used in the offline stage for reduced-order model construction. We propose multi-fidelity error estimators and replace the high-fidelity error estimator in the greedy algorithm. Consequently, the computational complexity at each iteration of the greedy algorithm is reduced and the algorithm converges more than 3 times faster without incurring noticeable accuracy loss. ",
    "url": "https://arxiv.org/abs/2301.05610",
    "authors": [
      "Lihong Feng",
      "Luigi Lombardi",
      "Giulio Antonini",
      "Peter Benner"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2301.05619",
    "title": "Understanding and improving social factors in education: a computational  social science approach",
    "abstract": "Over the past decade, an explosion in the availability of education-related datasets has enabled new computational research in education. Much of this work has investigated digital traces of online learners in order to better understand and optimize their cognitive learning processes. Yet cognitive learning on digital platforms does not equal education. Instead, education is an inherently social, cultural, economic, and political process manifesting in physical spaces, and educational outcomes are influenced by many factors that precede and shape the cognitive learning process. Many of these are social factors like children's connections to schools (including teachers, counselors, and role models), parents and families, and the broader neighborhoods in which they live. In this article, we briefly discuss recent studies of learning through large-scale digital platforms, but largely focus on those exploring sociological aspects of education. We believe computational social scientists can creatively advance this emerging research frontier-and in doing so, help facilitate more equitable educational and life outcomes. ",
    "url": "https://arxiv.org/abs/2301.05619",
    "authors": [
      "Nabeel Gillani",
      "Rebecca Eynon"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2301.05635",
    "title": "Time-Myopic Go-Explore: Learning A State Representation for the  Go-Explore Paradigm",
    "abstract": "Very large state spaces with a sparse reward signal are difficult to explore. The lack of a sophisticated guidance results in a poor performance for numerous reinforcement learning algorithms. In these cases, the commonly used random exploration is often not helpful. The literature shows that this kind of environments require enormous efforts to systematically explore large chunks of the state space. Learned state representations can help here to improve the search by providing semantic context and build a structure on top of the raw observations. In this work we introduce a novel time-myopic state representation that clusters temporal close states together while providing a time prediction capability between them. By adapting this model to the Go-Explore paradigm (Ecoffet et al., 2021b), we demonstrate the first learned state representation that reliably estimates novelty instead of using the hand-crafted representation heuristic. Our method shows an improved solution for the detachment problem which still remains an issue at the Go-Explore Exploration Phase. We provide evidence that our proposed method covers the entire state space with respect to all possible time trajectories without causing disadvantageous conflict-overlaps in the cell archive. Analogous to native Go-Explore, our approach is evaluated on the hard exploration environments MontezumaRevenge, Gravitar and Frostbite (Atari) in order to validate its capabilities on difficult tasks. Our experiments show that time-myopic Go-Explore is an effective alternative for the domain-engineered heuristic while also being more general. The source code of the method is available on GitHub. ",
    "url": "https://arxiv.org/abs/2301.05635",
    "authors": [
      "Marc Höftmann",
      "Jan Robine",
      "Stefan Harmeling"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.05331",
    "title": "Detection problems in the spiked matrix models",
    "abstract": "We study the statistical decision process of detecting the low-rank signal from various signal-plus-noise type data matrices, known as the spiked random matrix models. We first show that the principal component analysis can be improved by entrywise pre-transforming the data matrix if the noise is non-Gaussian, generalizing the known results for the spiked random matrix models with rank-1 signals. As an intermediate step, we find out sharp phase transition thresholds for the extreme eigenvalues of spiked random matrices, which generalize the Baik-Ben Arous-P\\'{e}ch\\'{e} (BBP) transition. We also prove the central limit theorem for the linear spectral statistics for the spiked random matrices and propose a hypothesis test based on it, which does not depend on the distribution of the signal or the noise. When the noise is non-Gaussian noise, the test can be improved with an entrywise transformation to the data matrix with additive noise. We also introduce an algorithm that estimates the rank of the signal when it is not known a priori. ",
    "url": "https://arxiv.org/abs/2301.05331",
    "authors": [
      "Ji Hyung Jung",
      "Hye Won Chung",
      "Ji Oon Lee"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.05549",
    "title": "On the explainability of quantum neural networks based on variational  quantum circuits",
    "abstract": "Ridge functions are used to describe and study the lower bound of the approximation done by the neural networks which can be written as a linear combination of activation functions. If the activation functions are also ridge functions, these networks are called explainable neural networks. In this paper, we first show that quantum neural networks which are based on variational quantum circuits can be written as a linear combination of ridge functions. Consequently, we show that the interpretability and explainability of such quantum neural networks can be directly considered and studied as an approximation with the linear combination of ridge functions. ",
    "url": "https://arxiv.org/abs/2301.05549",
    "authors": [
      "Ammar Daskin"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.05567",
    "title": "Neural network with optimal neuron activation functions based on  additive Gaussian process regression",
    "abstract": "Feed-forward neural networks (NN) are a staple machine learning method widely used in many areas of science and technology. While even a single-hidden layer NN is a universal approximator, its expressive power is limited by the use of simple neuron activation functions (such as sigmoid functions) that are typically the same for all neurons. More flexible neuron activation functions would allow using fewer neurons and layers and thereby save computational cost and improve expressive power. We show that additive Gaussian process regression (GPR) can be used to construct optimal neuron activation functions that are individual to each neuron. An approach is also introduced that avoids non-linear fitting of neural network parameters. The resulting method combines the advantage of robustness of a linear regression with the higher expressive power of a NN. We demonstrate the approach by fitting the potential energy surface of the water molecule. Without requiring any non-linear optimization, the additive GPR based approach outperforms a conventional NN in the high accuracy regime, where a conventional NN suffers more from overfitting. ",
    "url": "https://arxiv.org/abs/2301.05567",
    "authors": [
      "Sergei Manzhos",
      "Manabu Ihara"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2301.05599",
    "title": "Short-time SSVEP data extension by a novel generative adversarial  networks based framework",
    "abstract": "Steady-state visual evoked potentials (SSVEPs) based brain-computer interface (BCI) has received considerable attention due to its high transfer rate and available quantity of targets. However, the performance of frequency identification methods heavily hinges on the amount of user calibration data and data length, which hinders the deployment in real-world applications. Recently, generative adversarial networks (GANs)-based data generation methods have been widely adopted to create supplementary synthetic electroencephalography (EEG) data, holds promise to address these issues. In this paper, we proposed a GAN-based end-to-end signal transformation network for data length window extension, termed as TEGAN. TEGAN transforms short-time SSVEP signals into long-time artificial SSVEP signals. By incorporating a novel U-Net generator architecture and auxiliary classifier into the network design, the TEGAN could produce conditioned features in the synthetic data. Additionally, to regularize the training process of GAN, we introduced a two-stage training strategy and the LeCam-divergence regularization term during the network implementation. The proposed TEGAN was evaluated on two public SSVEP datasets. With the assistance of TEGAN, the performance of traditional frequency recognition methods and deep learning-based methods have been significantly improved under limited calibration data. This study substantiates the feasibility of the proposed method to extend the data length for short-time SSVEP signals to develop a high-performance BCI system. The proposed GAN-based methods have the great potential of shortening the calibration time for various real-world BCI-based applications, while the novelty of our augmentation strategies shed some value light on understanding the subject-invariant properties of SSVEPs. ",
    "url": "https://arxiv.org/abs/2301.05599",
    "authors": [
      "Yudong Pan",
      "Ning Li",
      "Yangsong Zhang"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.05642",
    "title": "Split Boot -- True Network-Based Booting on Heterogeneous MPSoCs",
    "abstract": "In the context of the High-Luminosity (HL) upgrade of the LHC, many custom ATCA electronics boards are being designed containing heterogeneous System-on-Chip (SoC) devices, more specifically the Xilinx Zynq UltraScale+ (ZUS+) family. While the application varies greatly, these devices are regularly used for performing board management tasks, making them a fundamental element in the correct operation of the board. The large number of hundreds of SoC devices creates significant challenges in their firmware deployment, maintenance, and accessibility. Even though U-Boot on ZUS+ devices supports network boot through the Preboot Execution Environment (PXE), the standard ZUS+ boot process contains application-specific information at earlier boot steps, particularly within the First Stage Bootloader (FSBL). This prevents the initialization of several devices from a universal image. Inspired by the PXE boot process on desktop PCs, this paper describes split boot, a novel boot method tailored to the specific needs of the ZUS+. All application-specific configuration is moved to a network storage device and automatically fetched during the boot process. We considered the entire process, from firmware and software development to binary distribution in a large-scale system. The developed method nicely integrates with the standard Xilinx development toolset workflow. ",
    "url": "https://arxiv.org/abs/2301.05642",
    "authors": [
      "Marvin Fuchs",
      "Luis E. Ardila-Perez",
      "Torben Mehner",
      "Oliver Sander"
    ],
    "subjectives": [
      "Instrumentation and Detectors (physics.ins-det)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.05668",
    "title": "Network analysis on political election; populist vs social emergent  behaviour",
    "abstract": "Social networks play an important role in people's daily socialization, particularly through social media platforms, which have become key channels for communication and information dissemination. The digital ecosystem does not only evolve communication on multi-network (like TV, social media, and online newspapers) but also provides the social researcher with useful data to explain social-complex dynamics. Our work focus on cultural dynamics-reactions that occurred during the 2020 Emilia-Romagna elections'' in Italy, where a stronghold culture felt in danger of losing against the strong populism and Euro-scepticism present in digital ecosystems. We would like to show how the interaction between parts of the society, during cultural and/or political shifting, can lead to or induce emerging behaviour from society, creating groups that react against or improve the status quo. We developed a word-entry network based on three different levels of participation: pro, con, and neutral. We have analyzed the tweets collected (as text) with the word embedding tools, to see, the most used words (which may suggest the main topics) and the most related words among the various groups. We show how a careful analysis of groups through networks, can give important information about the current event. ",
    "url": "https://arxiv.org/abs/2301.05668",
    "authors": [
      "Andrea Russo",
      "Vincenzo Miracula",
      "Antonio Picone"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2301.05701",
    "title": "Composite model of seismic monitoring data analysis during mining  operations on the example of the Kukisvumchorrskoye deposit of JSC Apatit",
    "abstract": "Geomechanical monitoring of a rock massif is an actively developing branch of geomechanics. It is almost impossible to single out a methodology and approaches for data collection and analysis in developing seismic monitoring systems. In the process of mining in rock massif, changes in the state of structural inhomogeneities are most clearly manifested. Existing natural structural inhomogeneities are revealed, there are movements in discontinuous disturbances, and new technogenic disturbances are formed, which are accompanied by a change in the natural stress state of various blocks of the massif. An important task is to develop a mining forecasting model that can take into account the structural heterogeneity of the rock massif and select the necessary forecast horizon depending on monitoring data The developed method of evaluating the results of monitoring geomechanical processes in the rock massif allowed us to forecast of zones of possible rock bursts. ",
    "url": "https://arxiv.org/abs/2301.05701",
    "authors": [
      "Ilia Revin"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.05702",
    "title": "confidence-planner: Easy-to-Use Prediction Confidence Estimation and  Sample Size Planning",
    "abstract": "Machine learning applications, especially in the fields of me\\-di\\-cine and social sciences, are slowly being subjected to increasing scrutiny. Similarly to sample size planning performed in clinical and social studies, lawmakers and funding agencies may expect statistical uncertainty estimations in machine learning applications that impact society. In this paper, we present an easy-to-use python package and web application for estimating prediction confidence intervals. The package offers eight different procedures to determine and justify the sample size and confidence of predictions from holdout, bootstrap, cross-validation, and progressive validation experiments. Since the package builds directly on established data analysis libraries, it seamlessly integrates into preprocessing and exploratory data analysis steps. Code related to this paper is available at: https://github.com/dabrze/confidence-planner. ",
    "url": "https://arxiv.org/abs/2301.05702",
    "authors": [
      "Antoni Klorek",
      "Karol Roszak",
      "Izabela Szczech",
      "Dariusz Brzezinski"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1806.00749",
    "title": "TI-CNN: Convolutional Neural Networks for Fake News Detection",
    "abstract": " Title: TI-CNN: Convolutional Neural Networks for Fake News Detection ",
    "url": "https://arxiv.org/abs/1806.00749",
    "authors": [
      "Yang Yang",
      "Lei Zheng",
      "Jiawei Zhang",
      "Qingcai Cui",
      "Zhoujun Li",
      "Philip S. Yu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2103.11676",
    "title": "Continuous mean distance of a weighted graph",
    "abstract": " Comments: Revised version ",
    "url": "https://arxiv.org/abs/2103.11676",
    "authors": [
      "Delia Garijo",
      "Alberto Márquez",
      "Rodrigo I. Silveira"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2106.14815",
    "title": "Feature Importance Guided Attack: A Model Agnostic Adversarial Attack",
    "abstract": " Title: Feature Importance Guided Attack: A Model Agnostic Adversarial Attack ",
    "url": "https://arxiv.org/abs/2106.14815",
    "authors": [
      "Gilad Gressel",
      "Niranjan Hegde",
      "Archana Sreekumar",
      "Rishikumar Radhakrishnan",
      "Kalyani Harikumar",
      "Anjali S.",
      "Krishnashree Achuthan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2108.05623",
    "title": "Existence, Stability and Scalability of Orthogonal Convolutional Neural  Networks",
    "abstract": " Title: Existence, Stability and Scalability of Orthogonal Convolutional Neural  Networks ",
    "url": "https://arxiv.org/abs/2108.05623",
    "authors": [
      "El Mehdi Achour",
      "François Malgouyres",
      "Franck Mamalet"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2110.01276",
    "title": "Characterizing Omega-Regularity through Finite-Memory Determinacy of  Games on Infinite Graphs",
    "abstract": " Comments: A previous conference version appeared in STACS 2022. 48 pages, 14 figures ",
    "url": "https://arxiv.org/abs/2110.01276",
    "authors": [
      "Patricia Bouyer",
      "Mickael Randour",
      "Pierre Vandenhove"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Formal Languages and Automata Theory (cs.FL)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2112.01565",
    "title": "A Generic Graph Sparsification Framework using Deep Reinforcement  Learning",
    "abstract": " Comments: This paper introduces the first general and effective graph sparsification framework enabled by deep reinforcement learning. It's accepted to IEEE International Conference on Data Mining (ICDM), 2022 ",
    "url": "https://arxiv.org/abs/2112.01565",
    "authors": [
      "Ryan Wickman",
      "Xiaofei Zhang",
      "Weizi Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.09284",
    "title": "Amenable Sparse Network Investigator",
    "abstract": " Title: Amenable Sparse Network Investigator ",
    "url": "https://arxiv.org/abs/2202.09284",
    "authors": [
      "Saeed Damadi",
      "Erfan Nouri",
      "Hamed Pirsiavash"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.01893",
    "title": "A Transdisciplinary Approach for Generating Synthetic but Realistic  Domestic Sex Trafficking Networks",
    "abstract": " Title: A Transdisciplinary Approach for Generating Synthetic but Realistic  Domestic Sex Trafficking Networks ",
    "url": "https://arxiv.org/abs/2203.01893",
    "authors": [
      "Daniel Kosmas",
      "Christina Melander",
      "Emily Singerhouse",
      "Thomas C. Sharkey",
      "Kayse Lee Maass",
      "Kelle Barrick",
      "Lauren Martin"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.05481",
    "title": "Fully Adaptive Composition in Differential Privacy",
    "abstract": " Comments: 27 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2203.05481",
    "authors": [
      "Justin Whitehouse",
      "Aaditya Ramdas",
      "Ryan Rogers",
      "Zhiwei Steven Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.08133",
    "title": "Animatable Implicit Neural Representations for Creating Realistic  Avatars from Videos",
    "abstract": " Comments: Project page: this https URL and this https URL arXiv admin note: substantial text overlap with arXiv:2105.02872 ",
    "url": "https://arxiv.org/abs/2203.08133",
    "authors": [
      "Sida Peng",
      "Zhen Xu",
      "Junting Dong",
      "Qianqian Wang",
      "Shangzhan Zhang",
      "Qing Shuai",
      "Hujun Bao",
      "Xiaowei Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16290",
    "title": "An Offset-Free Nonlinear MPC scheme for systems learned by Neural NARX  models",
    "abstract": " Comments: {\\copyright} 2022 IEEE. This manuscript is the extended version of an article appearing in the Proceedings of the 2022 IEEE 61st Conference on Decision and Control (CDC), July 12-15, 2022, Cancun, Mexico, pp. 2123-2128. DOI: 10.1109/CDC51059.2022.9992362 ",
    "url": "https://arxiv.org/abs/2203.16290",
    "authors": [
      "Fabio Bonassi",
      "Jing Xie",
      "Marcello Farina",
      "Riccardo Scattolini"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2205.04650",
    "title": "Robust Learning of Parsimonious Deep Neural Networks",
    "abstract": " Comments: 39 pages, 5 figures, 6 tables. Updated version of arXiv:2205.04650; added experiments with CIFAR10 dataset/VGG16 architecture and modified introduction ",
    "url": "https://arxiv.org/abs/2205.04650",
    "authors": [
      "Valentin Frank Ingmar Guenter",
      "Athanasios Sideris"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.15614",
    "title": "Communication-Efficient Distributionally Robust Decentralized Learning",
    "abstract": " Comments: Published in Transactions on Machine Learning Research (TMLR) ",
    "url": "https://arxiv.org/abs/2205.15614",
    "authors": [
      "Matteo Zecchin",
      "Marios Kountouris",
      "David Gesbert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.07234",
    "title": "Brownian Noise Reduction: Maximizing Privacy Subject to Accuracy  Constraints",
    "abstract": " Comments: 19 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2206.07234",
    "authors": [
      "Justin Whitehouse",
      "Zhiwei Steven Wu",
      "Aaditya Ramdas",
      "Ryan Rogers"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2207.08794",
    "title": "DeFlowSLAM: Self-Supervised Scene Motion Decomposition for Dynamic Dense  SLAM",
    "abstract": " Comments: Homepage: this https URL ",
    "url": "https://arxiv.org/abs/2207.08794",
    "authors": [
      "Weicai Ye",
      "Xingyuan Yu",
      "Xinyue Lan",
      "Yuhang Ming",
      "Jinyu Li",
      "Hujun Bao",
      "Zhaopeng Cui",
      "Guofeng Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.05832",
    "title": "Sparse deep neural networks for modeling aluminum electrolysis dynamics",
    "abstract": " Comments: 32 pages, 18 figures ",
    "url": "https://arxiv.org/abs/2209.05832",
    "authors": [
      "Erlend Torje Berg Lundby",
      "Adil Rasheed",
      "Ivar Johan Halvorsen",
      "Jan Tommy Gravdahl"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2209.07263",
    "title": "Robustness in deep learning: The good (width), the bad (depth), and the  ugly (initialization)",
    "abstract": " Comments: Accepted in NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2209.07263",
    "authors": [
      "Zhenyu Zhu",
      "Fanghui Liu",
      "Grigorios G Chrysos",
      "Volkan Cevher"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.10966",
    "title": "Adaptation of domain-specific transformer models with text oversampling  for sentiment analysis of social media posts on Covid-19 vaccines",
    "abstract": " Comments: The paper has been accepted for publication in Computer Science journal: this http URL ",
    "url": "https://arxiv.org/abs/2209.10966",
    "authors": [
      "Anmol Bansal",
      "Arjun Choudhry",
      "Anubhav Sharma",
      "Seba Susan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.00688",
    "title": "On the infinite-depth limit of finite-width neural networks",
    "abstract": " Comments: 71 pages, 21 figures ",
    "url": "https://arxiv.org/abs/2210.00688",
    "authors": [
      "Soufiane Hayou"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2210.09082",
    "title": "A Solver-Free Framework for Scalable Learning in Neural ILP  Architectures",
    "abstract": " Comments: Accepted at NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2210.09082",
    "authors": [
      "Yatin Nandwani",
      "Rishabh Ranjan",
      "Mausam",
      "Parag Singla"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.10341",
    "title": "BioGPT: Generative Pre-trained Transformer for Biomedical Text  Generation and Mining",
    "abstract": " Comments: Published at Briefings in Bioinformatics. Code is available at this https URL ",
    "url": "https://arxiv.org/abs/2210.10341",
    "authors": [
      "Renqian Luo",
      "Liai Sun",
      "Yingce Xia",
      "Tao Qin",
      "Sheng Zhang",
      "Hoifung Poon",
      "Tie-Yan Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.10716",
    "title": "CroCo: Self-Supervised Pre-training for 3D Vision Tasks by Cross-View  Completion",
    "abstract": " Comments: NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2210.10716",
    "authors": [
      "Philippe Weinzaepfel",
      "Vincent Leroy",
      "Thomas Lucas",
      "Romain Brégier",
      "Yohann Cabon",
      "Vaibhav Arora",
      "Leonid Antsfeld",
      "Boris Chidlovskii",
      "Gabriela Csurka",
      "Jérôme Revaud"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.12809",
    "title": "Data Augmentation for Automated Essay Scoring using Transformer Models",
    "abstract": " Comments: Accepted at ICCMST 2022 ",
    "url": "https://arxiv.org/abs/2210.12809",
    "authors": [
      "Kshitij Gupta"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2210.16118",
    "title": "Imitation Learning-based Implicit Semantic-aware Communication Networks:  Multi-layer Representation and Collaborative Reasoning",
    "abstract": " Comments: Accepted at IEEE Journal on Selected Areas in Communications ",
    "url": "https://arxiv.org/abs/2210.16118",
    "authors": [
      "Yong Xiao",
      "Zijian Sun",
      "Guangming Shi",
      "Dusit Niyato"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2211.01873",
    "title": "Port-metriplectic neural networks: thermodynamics-informed machine  learning of complex physical systems",
    "abstract": " Comments: 9 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2211.01873",
    "authors": [
      "Quercus Hernández",
      "Alberto Badías",
      "Francisco Chinesta",
      "Elías Cueto"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Dynamical Systems (math.DS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2211.10060",
    "title": "Normal Reference Attention and Defective Feature Perception Network for  Surface Defect Detection",
    "abstract": " Comments: 15pages ",
    "url": "https://arxiv.org/abs/2211.10060",
    "authors": [
      "Wei Luo",
      "Haiming Yao",
      "Wenyong Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.13577",
    "title": "Learning Invariant Rules from Data for Interpretable Anomaly Detection",
    "abstract": " Title: Learning Invariant Rules from Data for Interpretable Anomaly Detection ",
    "url": "https://arxiv.org/abs/2211.13577",
    "authors": [
      "Cheng Feng",
      "Pingge Hu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.16158",
    "title": "Out-Of-Distribution Detection Is Not All You Need",
    "abstract": " Title: Out-Of-Distribution Detection Is Not All You Need ",
    "url": "https://arxiv.org/abs/2211.16158",
    "authors": [
      "Joris Guérin",
      "Kevin Delmas",
      "Raul Sena Ferreira",
      "Jérémie Guiochet"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2212.08275",
    "title": "A Survey on Anonymous Communication Systems with a Focus on Dining  Cryptographers Networks",
    "abstract": " Title: A Survey on Anonymous Communication Systems with a Focus on Dining  Cryptographers Networks ",
    "url": "https://arxiv.org/abs/2212.08275",
    "authors": [
      "Mohsen Shirali",
      "Tobias Tefke",
      "Ralf C. Staudemeyer",
      "Henrich C. Poehls"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2212.12018",
    "title": "Langevin algorithms for Markovian Neural Networks and Deep Stochastic  control",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2212.12018",
    "authors": [
      "Pierre Bras",
      "Gilles Pagès"
    ],
    "subjectives": [
      "Computational Finance (q-fin.CP)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2212.12117",
    "title": "Storage codes on coset graphs with asymptotically unit rate",
    "abstract": " Comments: 14 pages. In v2 we expanded the introduction to account for some new references of which we were previously not aware ",
    "url": "https://arxiv.org/abs/2212.12117",
    "authors": [
      "Alexander Barg",
      "Moshe Schwartz",
      "Lev Yohananov"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2212.14012",
    "title": "Characteristics-Informed Neural Networks for Forward and Inverse  Hyperbolic Problems",
    "abstract": " Title: Characteristics-Informed Neural Networks for Forward and Inverse  Hyperbolic Problems ",
    "url": "https://arxiv.org/abs/2212.14012",
    "authors": [
      "Ulisses Braga-Neto"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2301.00127",
    "title": "Spatiotemporal implicit neural representation for unsupervised dynamic  MRI reconstruction",
    "abstract": " Comments: 9 pages, 5 figures; corrected the code availability description for arXiv ",
    "url": "https://arxiv.org/abs/2301.00127",
    "authors": [
      "Jie Feng",
      "Ruimin Feng",
      "Qing Wu",
      "Zhiyong Zhang",
      "Yuyao Zhang",
      "Hongjiang Wei"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2301.01701",
    "title": "Extending Source Code Pre-Trained Language Models to Summarise  Decompiled Binaries",
    "abstract": " Comments: SANER 2023 Technical Track Camera Ready ",
    "url": "https://arxiv.org/abs/2301.01701",
    "authors": [
      "Ali Al-Kaswan",
      "Toufique Ahmed",
      "Maliheh Izadi",
      "Anand Ashok Sawant",
      "Premkumar Devanbu",
      "Arie van Deursen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2301.02819",
    "title": "ExcelFormer: A Neural Network Surpassing GBDTs on Tabular Data",
    "abstract": " Title: ExcelFormer: A Neural Network Surpassing GBDTs on Tabular Data ",
    "url": "https://arxiv.org/abs/2301.02819",
    "authors": [
      "Jintai Chen",
      "Jiahuan Yan",
      "Danny Ziyi Chen",
      "Jian Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.03863",
    "title": "Robust web element identification for evolving applications by  considering visual overlaps",
    "abstract": " Title: Robust web element identification for evolving applications by  considering visual overlaps ",
    "url": "https://arxiv.org/abs/2301.03863",
    "authors": [
      "Michel Nass",
      "Riccardo Coppola",
      "Emil Alégroth",
      "Robert Feldt"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2301.03888",
    "title": "Joint Hybrid Beamforming and User Scheduling for Multi-Satellite  Cooperative Networks",
    "abstract": " Comments: 7 pages, 7 figures, accepted by IEEE Wireless Communications and Networking Conference (WCNC) 2023 ",
    "url": "https://arxiv.org/abs/2301.03888",
    "authors": [
      "Xuan Zhang",
      "Shu Sun",
      "Meixia Tao",
      "Qin Huang",
      "Xiaohu Tang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2301.04460",
    "title": "Fast spline detection in high density microscopy data",
    "abstract": " Title: Fast spline detection in high density microscopy data ",
    "url": "https://arxiv.org/abs/2301.04460",
    "authors": [
      "Albert Alonso",
      "Julius B. Kirkegaard"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  }
]