[
  {
    "id": "arXiv:2403.04770",
    "title": "Social Orientation: A New Feature for Dialogue Analysis",
    "abstract": "There are many settings where it is useful to predict and explain the success or failure of a dialogue. Circumplex theory from psychology models the social orientations (e.g., Warm-Agreeable, Arrogant-Calculating) of conversation participants and can be used to predict and explain the outcome of social interactions. Our work is novel in its systematic application of social orientation tags to modeling conversation outcomes. In this paper, we introduce a new data set of dialogue utterances machine-labeled with social orientation tags. We show that social orientation tags improve task performance, especially in low-resource settings, on both English and Chinese language benchmarks. We also demonstrate how social orientation tags help explain the outcomes of social interactions when used in neural models. Based on these results showing the utility of social orientation tags for dialogue outcome prediction tasks, we release our data sets, code, and models that are fine-tuned to predict social orientation tags on dialogue utterances. ",
    "url": "https://arxiv.org/abs/2403.04770",
    "authors": [
      "Todd Morrill",
      "Zhaoyuan Deng",
      "Yanda Chen",
      "Amith Ananthram",
      "Colin Wayne Leach",
      "Kathleen McKeown"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04778",
    "title": "An Efficient Difference-of-Convex Solver for Privacy Funnel",
    "abstract": "We propose an efficient solver for the privacy funnel (PF) method, leveraging its difference-of-convex (DC) structure. The proposed DC separation results in a closed-form update equation, which allows straightforward application to both known and unknown distribution settings. For known distribution case, we prove the convergence (local stationary points) of the proposed non-greedy solver, and empirically show that it outperforms the state-of-the-art approaches in characterizing the privacy-utility trade-off. The insights of our DC approach apply to unknown distribution settings where labeled empirical samples are available instead. Leveraging the insights, our alternating minimization solver satisfies the fundamental Markov relation of PF in contrast to previous variational inference-based solvers. Empirically, we evaluate the proposed solver with MNIST and Fashion-MNIST datasets. Our results show that under a comparable reconstruction quality, an adversary suffers from higher prediction error from clustering our compressed codes than that with the compared methods. Most importantly, our solver is independent to private information in inference phase contrary to the baselines. ",
    "url": "https://arxiv.org/abs/2403.04778",
    "authors": [
      "Teng-Hui Huang",
      "Hesham El Gamal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2403.04780",
    "title": "MuseGraph: Graph-oriented Instruction Tuning of Large Language Models  for Generic Graph Mining",
    "abstract": "Graphs with abundant attributes are essential in modeling interconnected entities and improving predictions in various real-world applications. Traditional Graph Neural Networks (GNNs), which are commonly used for modeling attributed graphs, need to be re-trained every time when applied to different graph tasks and datasets. Although the emergence of Large Language Models (LLMs) has introduced a new paradigm in natural language processing, the generative potential of LLMs in graph mining remains largely under-explored. To this end, we propose a novel framework MuseGraph, which seamlessly integrates the strengths of GNNs and LLMs and facilitates a more effective and generic approach for graph mining across different tasks and datasets. Specifically, we first introduce a compact graph description via the proposed adaptive input generation to encapsulate key information from the graph under the constraints of language token limitations. Then, we propose a diverse instruction generation mechanism, which distills the reasoning capabilities from LLMs (e.g., GPT-4) to create task-specific Chain-of-Thought-based instruction packages for different graph tasks. Finally, we propose a graph-aware instruction tuning with a dynamic instruction package allocation strategy across tasks and datasets, ensuring the effectiveness and generalization of the training process. Our experimental results demonstrate significant improvements in different graph tasks, showcasing the potential of our MuseGraph in enhancing the accuracy of graph-oriented downstream tasks while keeping the generation powers of LLMs. ",
    "url": "https://arxiv.org/abs/2403.04780",
    "authors": [
      "Yanchao Tan",
      "Hang Lv",
      "Xinyi Huang",
      "Jiawei Zhang",
      "Shiping Wang",
      "Carl Yang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04782",
    "title": "A Survey on Temporal Knowledge Graph: Representation Learning and  Applications",
    "abstract": "Knowledge graphs have garnered significant research attention and are widely used to enhance downstream applications. However, most current studies mainly focus on static knowledge graphs, whose facts do not change with time, and disregard their dynamic evolution over time. As a result, temporal knowledge graphs have attracted more attention because a large amount of structured knowledge exists only within a specific period. Knowledge graph representation learning aims to learn low-dimensional vector embeddings for entities and relations in a knowledge graph. The representation learning of temporal knowledge graphs incorporates time information into the standard knowledge graph framework and can model the dynamics of entities and relations over time. In this paper, we conduct a comprehensive survey of temporal knowledge graph representation learning and its applications. We begin with an introduction to the definitions, datasets, and evaluation metrics for temporal knowledge graph representation learning. Next, we propose a taxonomy based on the core technologies of temporal knowledge graph representation learning methods, and provide an in-depth analysis of different methods in each category. Finally, we present various downstream applications related to the temporal knowledge graphs. In the end, we conclude the paper and have an outlook on the future research directions in this area. ",
    "url": "https://arxiv.org/abs/2403.04782",
    "authors": [
      "Li Cai",
      "Xin Mao",
      "Yuhao Zhou",
      "Zhaoguang Long",
      "Changxu Wu",
      "Man Lan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04783",
    "title": "AutoDefense: Multi-Agent LLM Defense against Jailbreak Attacks",
    "abstract": "Despite extensive pre-training and fine-tuning in moral alignment to prevent generating harmful information at user request, large language models (LLMs) remain vulnerable to jailbreak attacks. In this paper, we propose AutoDefense, a response-filtering based multi-agent defense framework that filters harmful responses from LLMs. This framework assigns different roles to LLM agents and employs them to complete the defense task collaboratively. The division in tasks enhances the overall instruction-following of LLMs and enables the integration of other defense components as tools. AutoDefense can adapt to various sizes and kinds of open-source LLMs that serve as agents. Through conducting extensive experiments on a large scale of harmful and safe prompts, we validate the effectiveness of the proposed AutoDefense in improving the robustness against jailbreak attacks, while maintaining the performance at normal user request. Our code and data are publicly available at https://github.com/XHMY/AutoDefense. ",
    "url": "https://arxiv.org/abs/2403.04783",
    "authors": [
      "Yifan Zeng",
      "Yiran Wu",
      "Xiao Zhang",
      "Huazheng Wang",
      "Qingyun Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.04784",
    "title": "Analysis of Privacy Leakage in Federated Large Language Models",
    "abstract": "With the rapid adoption of Federated Learning (FL) as the training and tuning protocol for applications utilizing Large Language Models (LLMs), recent research highlights the need for significant modifications to FL to accommodate the large-scale of LLMs. While substantial adjustments to the protocol have been introduced as a response, comprehensive privacy analysis for the adapted FL protocol is currently lacking. To address this gap, our work delves into an extensive examination of the privacy analysis of FL when used for training LLMs, both from theoretical and practical perspectives. In particular, we design two active membership inference attacks with guaranteed theoretical success rates to assess the privacy leakages of various adapted FL configurations. Our theoretical findings are translated into practical attacks, revealing substantial privacy vulnerabilities in popular LLMs, including BERT, RoBERTa, DistilBERT, and OpenAI's GPTs, across multiple real-world language datasets. Additionally, we conduct thorough experiments to evaluate the privacy leakage of these models when data is protected by state-of-the-art differential privacy (DP) mechanisms. ",
    "url": "https://arxiv.org/abs/2403.04784",
    "authors": [
      "Minh N. Vu",
      "Truc Nguyen",
      "Tre' R. Jeter",
      "My T. Thai"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04785",
    "title": "Large Language Multimodal Models for 5-Year Chronic Disease Cohort  Prediction Using EHR Data",
    "abstract": "Chronic diseases such as diabetes are the leading causes of morbidity and mortality worldwide. Numerous research studies have been attempted with various deep learning models in diagnosis. However, most previous studies had certain limitations, including using publicly available datasets (e.g. MIMIC), and imbalanced data. In this study, we collected five-year electronic health records (EHRs) from the Taiwan hospital database, including 1,420,596 clinical notes, 387,392 laboratory test results, and more than 1,505 laboratory test items, focusing on research pre-training large language models. We proposed a novel Large Language Multimodal Models (LLMMs) framework incorporating multimodal data from clinical notes and laboratory test results for the prediction of chronic disease risk. Our method combined a text embedding encoder and multi-head attention layer to learn laboratory test values, utilizing a deep neural network (DNN) module to merge blood features with chronic disease semantics into a latent space. In our experiments, we observe that clinicalBERT and PubMed-BERT, when combined with attention fusion, can achieve an accuracy of 73% in multiclass chronic diseases and diabetes prediction. By transforming laboratory test values into textual descriptions and employing the Flan T-5 model, we achieved a 76% Area Under the ROC Curve (AUROC), demonstrating the effectiveness of leveraging numerical text data for training and inference in language models. This approach significantly improves the accuracy of early-stage diabetes prediction. ",
    "url": "https://arxiv.org/abs/2403.04785",
    "authors": [
      "Jun-En Ding",
      "Phan Nguyen Minh Thao",
      "Wen-Chih Peng",
      "Jian-Zhe Wang",
      "Chun-Cheng Chug",
      "Min-Chen Hsieh",
      "Yun-Chien Tseng",
      "Ling Chen",
      "Dongsheng Luo",
      "Chi-Te Wang",
      "Pei-fu Chen",
      "Feng Liu",
      "Fang-Ming Hung"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04786",
    "title": "Breaking Down the Defenses: A Comparative Survey of Attacks on Large  Language Models",
    "abstract": "Large Language Models (LLMs) have become a cornerstone in the field of Natural Language Processing (NLP), offering transformative capabilities in understanding and generating human-like text. However, with their rising prominence, the security and vulnerability aspects of these models have garnered significant attention. This paper presents a comprehensive survey of the various forms of attacks targeting LLMs, discussing the nature and mechanisms of these attacks, their potential impacts, and current defense strategies. We delve into topics such as adversarial attacks that aim to manipulate model outputs, data poisoning that affects model training, and privacy concerns related to training data exploitation. The paper also explores the effectiveness of different attack methodologies, the resilience of LLMs against these attacks, and the implications for model integrity and user trust. By examining the latest research, we provide insights into the current landscape of LLM vulnerabilities and defense mechanisms. Our objective is to offer a nuanced understanding of LLM attacks, foster awareness within the AI community, and inspire robust solutions to mitigate these risks in future developments. ",
    "url": "https://arxiv.org/abs/2403.04786",
    "authors": [
      "Arijit Ghosh Chowdhury",
      "Md Mofijul Islam",
      "Vaibhav Kumar",
      "Faysal Hossain Shezan",
      "Vaibhav Kumar",
      "Vinija Jain",
      "Aman Chadha"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.04789",
    "title": "TopicDiff: A Topic-enriched Diffusion Approach for Multimodal  Conversational Emotion Detection",
    "abstract": "Multimodal Conversational Emotion (MCE) detection, generally spanning across the acoustic, vision and language modalities, has attracted increasing interest in the multimedia community. Previous studies predominantly focus on learning contextual information in conversations with only a few considering the topic information in single language modality, while always neglecting the acoustic and vision topic information. On this basis, we propose a model-agnostic Topic-enriched Diffusion (TopicDiff) approach for capturing multimodal topic information in MCE tasks. Particularly, we integrate the diffusion model into neural topic model to alleviate the diversity deficiency problem of neural topic model in capturing topic information. Detailed evaluations demonstrate the significant improvements of TopicDiff over the state-of-the-art MCE baselines, justifying the importance of multimodal topic information to MCE and the effectiveness of TopicDiff in capturing such information. Furthermore, we observe an interesting finding that the topic information in acoustic and vision is more discriminative and robust compared to the language. ",
    "url": "https://arxiv.org/abs/2403.04789",
    "authors": [
      "Jiamin Luo",
      "Jingjing Wang",
      "Guodong Zhou"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04793",
    "title": "A Data-Driven Two-Phase Multi-Split Causal Ensemble Model for Time  Series",
    "abstract": "Causal inference is a fundamental research topic for discovering the cause-effect relationships in many disciplines. However, not all algorithms are equally well-suited for a given dataset. For instance, some approaches may only be able to identify linear relationships, while others are applicable for non-linearities. Algorithms further vary in their sensitivity to noise and their ability to infer causal information from coupled vs. non-coupled time series. Therefore, different algorithms often generate different causal relationships for the same input. To achieve a more robust causal inference result, this publication proposes a novel data-driven two-phase multi-split causal ensemble model to combine the strengths of different causality base algorithms. In comparison to existing approaches, the proposed ensemble method reduces the influence of noise through a data partitioning scheme in the first phase. To achieve this, the data are initially divided into several partitions and the base algorithms are applied to each partition. Subsequently, Gaussian mixture models are used to identify the causal relationships derived from the different partitions that are likely to be valid. In the second phase, the identified relationships from each base algorithm are then merged based on three combination rules. The proposed ensemble approach is evaluated using multiple metrics, among them a newly developed evaluation index for causal ensemble approaches. We perform experiments using three synthetic datasets with different volumes and complexity, which are specifically designed to test causality detection methods under different circumstances while knowing the ground truth causal relationships. In these experiments, our causality ensemble outperforms each of its base algorithms. In practical applications, the use of the proposed method could hence lead to more robust and reliable causality results. ",
    "url": "https://arxiv.org/abs/2403.04793",
    "authors": [
      "Zhipeng Ma",
      "Marco Kemmerling",
      "Daniel Buschmann",
      "Chrismarie Enslin",
      "Daniel Lütticke",
      "Robert H. Schmitt"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2403.04796",
    "title": "Blockchain-Enhanced UAV Networks for Post-Disaster Communication: A  Decentralized Flocking Approach",
    "abstract": "Unmanned Aerial Vehicles (UAVs) have significant potential for agile communication and relief coordination in post-disaster scenarios, particularly when ground infrastructure is compromised. However, efficiently coordinating and securing flocks of heterogeneous UAVs from different service providers poses significant challenges related to privacy, scalability, lightweight consensus protocols, and comprehensive cybersecurity mechanisms. This study introduces a robust blockchain-enabled framework designed to tackle these technical challenges through a combination of consensus protocols, smart contracts, and cryptographic techniques. First, we propose a consortium blockchain architecture that ensures secure and private multi-agency coordination by controlling access and safeguarding the privacy of sensitive data. Second, we develop an optimized hybrid consensus protocol that merges Delegated Proof of Stake and Practical Byzantine Fault Tolerance (DPOS-PBFT), aiming to achieve an effective balance between efficiency, security, and resilience against node failures. Finally, we introduce decentralized flocking algorithms that facilitate adaptable and autonomous operations among specialized UAV clusters, ensuring critical disaster relief functions under conditions of uncertain connectivity. Comprehensive simulations demonstrate the system achieved linear scaling of throughput up to 500 UAV nodes, with only a 50ms increase in latency from 10 to 500 nodes. The framework maintained high throughput and low latency despite spoofing, denial-of-service (DoS), and tampering attacks, showing strong cyber resilience. Communication latencies were kept under 10ms for diverse UAV operations through self-optimizing network intelligence, with median values around 2-3ms. ",
    "url": "https://arxiv.org/abs/2403.04796",
    "authors": [
      "Sana Hafeez",
      "Runze Cheng",
      "Lina Mohjazi",
      "Yao Sun",
      "Muhammad Ali Imran"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.04807",
    "title": "Mathematics of Neural Networks (Lecture Notes Graduate Course)",
    "abstract": "These are the lecture notes that accompanied the course of the same name that I taught at the Eindhoven University of Technology from 2021 to 2023. The course is intended as an introduction to neural networks for mathematics students at the graduate level and aims to make mathematics students interested in further researching neural networks. It consists of two parts: first a general introduction to deep learning that focuses on introducing the field in a formal mathematical way. The second part provides an introduction to the theory of Lie groups and homogeneous spaces and how it can be applied to design neural networks with desirable geometric equivariances. The lecture notes were made to be as self-contained as possible so as to accessible for any student with a moderate mathematics background. The course also included coding tutorials and assignments in the form of a set of Jupyter notebooks that are publicly available at https://gitlab.com/bsmetsjr/mathematics_of_neural_networks. ",
    "url": "https://arxiv.org/abs/2403.04807",
    "authors": [
      "Bart M.N. Smets"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04809",
    "title": "Investigation of the Impact of Synthetic Training Data in the Industrial  Application of Terminal Strip Object Detection",
    "abstract": "In industrial manufacturing, numerous tasks of visually inspecting or detecting specific objects exist that are currently performed manually or by classical image processing methods. Therefore, introducing recent deep learning models to industrial environments holds the potential to increase productivity and enable new applications. However, gathering and labeling sufficient data is often intractable, complicating the implementation of such projects. Hence, image synthesis methods are commonly used to generate synthetic training data from 3D models and annotate them automatically, although it results in a sim-to-real domain gap. In this paper, we investigate the sim-to-real generalization performance of standard object detectors on the complex industrial application of terminal strip object detection. Combining domain randomization and domain knowledge, we created an image synthesis pipeline for automatically generating the training data. Moreover, we manually annotated 300 real images of terminal strips for the evaluation. The results show the cruciality of the objects of interest to have the same scale in either domain. Nevertheless, under optimized scaling conditions, the sim-to-real performance difference in mean average precision amounts to 2.69 % for RetinaNet and 0.98 % for Faster R-CNN, qualifying this approach for industrial requirements. ",
    "url": "https://arxiv.org/abs/2403.04809",
    "authors": [
      "Nico Baumgart",
      "Markus Lange-Hegermann",
      "Mike Mücke"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04810",
    "title": "Restricted Bayesian Neural Network",
    "abstract": "Modern deep learning tools are remarkably effective in addressing intricate problems. However, their operation as black-box models introduces increased uncertainty in predictions. Additionally, they contend with various challenges, including the need for substantial storage space in large networks, issues of overfitting, underfitting, vanishing gradients, and more. This study explores the concept of Bayesian Neural Networks, presenting a novel architecture designed to significantly alleviate the storage space complexity of a network. Furthermore, we introduce an algorithm adept at efficiently handling uncertainties, ensuring robust convergence values without becoming trapped in local optima, particularly when the objective function lacks perfect convexity. ",
    "url": "https://arxiv.org/abs/2403.04810",
    "authors": [
      "Sourav Ganguly"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2403.04811",
    "title": "Quantifying Contamination in Evaluating Code Generation Capabilities of  Language Models",
    "abstract": "While large language models have achieved remarkable performance on various code generation benchmarks, there have been growing concerns regarding potential contamination of these benchmarks as they may be leaked into pretraining and finetuning data. While recent work has investigated contamination in natural language generation and understanding tasks, there has been less extensive research into how data contamination impacts the evaluation of code generation, which is critical for understanding the robustness and reliability of LLMs in programming contexts. In this work, we perform a comprehensive study of data contamination of popular code generation benchmarks, and precisely quantify their overlap with pretraining corpus through both surface-level and semantic-level matching. In our experiments, we show that there are substantial overlap between popular code generation benchmarks and open training corpus, and models perform significantly better on the subset of the benchmarks where similar solutions are seen during training. We also conduct extensive analysis on the factors that affects model memorization and generalization, such as model size, problem difficulty, and question length. We release all resulting files from our matching pipeline for future research. ",
    "url": "https://arxiv.org/abs/2403.04811",
    "authors": [
      "Martin Riddell",
      "Ansong Ni",
      "Arman Cohan"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04814",
    "title": "Evaluation of LLMs on Syntax-Aware Code Fill-in-the-Middle Tasks",
    "abstract": "We introduce Syntax-Aware Fill-In-the-Middle (SAFIM), a new benchmark for evaluating Large Language Models (LLMs) on the code Fill-in-the-Middle (FIM) task. This benchmark focuses on syntax-aware completions of program structures such as code blocks and conditional expressions, and includes 17,720 examples from multiple programming languages, sourced from recent code submissions after April 2022 to minimize data contamination. SAFIM provides a robust framework with various prompt designs and novel syntax-aware post-processing techniques, facilitating accurate and fair comparisons across LLMs. Our comprehensive evaluation of 15 LLMs shows that FIM pretraining not only enhances FIM proficiency but also improves Left-to-Right (L2R) inference using LLMs. Our findings challenge conventional beliefs and suggest that pretraining methods and data quality have more impact than model size. SAFIM thus serves as a foundational platform for future research in effective pretraining strategies for code LLMs. The evaluation toolkit and dataset are available at https://github.com/gonglinyuan/safim, and the leaderboard is available at https://safimbenchmark.com. ",
    "url": "https://arxiv.org/abs/2403.04814",
    "authors": [
      "Linyuan Gong",
      "Sida Wang",
      "Mostafa Elhoushi",
      "Alvin Cheung"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.04822",
    "title": "UniTable: Towards a Unified Framework for Table Structure Recognition  via Self-Supervised Pretraining",
    "abstract": "Tables convey factual and quantitative data with implicit conventions created by humans that are often challenging for machines to parse. Prior work on table structure recognition (TSR) has mainly centered around complex task-specific combinations of available inputs and tools. We present UniTable, a training framework that unifies both the training paradigm and training objective of TSR. Its training paradigm combines the simplicity of purely pixel-level inputs with the effectiveness and scalability empowered by self-supervised pretraining (SSP) from diverse unannotated tabular images. Our framework unifies the training objectives of all three TSR tasks - extracting table structure, cell content, and cell bounding box (bbox) - into a unified task-agnostic training objective: language modeling. Extensive quantitative and qualitative analyses highlight UniTable's state-of-the-art (SOTA) performance on four of the largest TSR datasets. To promote reproducible research, enhance transparency, and SOTA innovations, we open-source our code at https://github.com/poloclub/unitable and release the first-of-its-kind Jupyter Notebook of the whole inference pipeline, fine-tuned across multiple TSR datasets, supporting all three TSR tasks. ",
    "url": "https://arxiv.org/abs/2403.04822",
    "authors": [
      "ShengYun Peng",
      "Seongmin Lee",
      "Xiaojing Wang",
      "Rajarajeswari Balasubramaniyan",
      "Duen Horng Chau"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04847",
    "title": "Solving Inverse Problems with Model Mismatch using Untrained Neural  Networks within Model-based Architectures",
    "abstract": "Model-based deep learning methods such as \\emph{loop unrolling} (LU) and \\emph{deep equilibrium model} (DEQ) extensions offer outstanding performance in solving inverse problems (IP). These methods unroll the optimization iterations into a sequence of neural networks that in effect learn a regularization function from data. While these architectures are currently state-of-the-art in numerous applications, their success heavily relies on the accuracy of the forward model. This assumption can be limiting in many physical applications due to model simplifications or uncertainties in the apparatus. To address forward model mismatch, we introduce an untrained forward model residual block within the model-based architecture to match the data consistency in the measurement domain for each instance. We propose two variants in well-known model-based architectures (LU and DEQ) and prove convergence under mild conditions. The experiments show significant quality improvement in removing artifacts and preserving details across three distinct applications, encompassing both linear and nonlinear inverse problems. Moreover, we highlight reconstruction effectiveness in intermediate steps and showcase robustness to random initialization of the residual block and a higher number of iterations during evaluation. ",
    "url": "https://arxiv.org/abs/2403.04847",
    "authors": [
      "Peimeng Guan",
      "Naveed Iqbal",
      "Mark A. Davenport",
      "Mudassir Masood"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.04852",
    "title": "Corrective or Backfire: Characterizing and Predicting User Response to  Social Correction",
    "abstract": "Online misinformation poses a global risk with harmful implications for society. Ordinary social media users are known to actively reply to misinformation posts with counter-misinformation messages, which is shown to be effective in containing the spread of misinformation. Such a practice is defined as \"social correction\". Nevertheless, it remains unknown how users respond to social correction in real-world scenarios, especially, will it have a corrective or backfire effect on users. Investigating this research question is pivotal for developing and refining strategies that maximize the efficacy of social correction initiatives. To fill this gap, we conduct an in-depth study to characterize and predict the user response to social correction in a data-driven manner through the lens of X (Formerly Twitter), where the user response is instantiated as the reply that is written toward a counter-misinformation message. Particularly, we first create a novel dataset with 55, 549 triples of misinformation tweets, counter-misinformation replies, and responses to counter-misinformation replies, and then curate a taxonomy to illustrate different kinds of user responses. Next, fine-grained statistical analysis of reply linguistic and engagement features as well as repliers' user attributes is conducted to illustrate the characteristics that are significant in determining whether a reply will have a corrective or backfire effect. Finally, we build a user response prediction model to identify whether a social correction will be corrective, neutral, or have a backfire effect, which achieves a promising F1 score of 0.816. Our work enables stakeholders to monitor and predict user responses effectively, thus guiding the use of social correction to maximize their corrective impact and minimize backfire effects. The code and data is accessible on https://github.com/claws-lab/response-to-social-correction. ",
    "url": "https://arxiv.org/abs/2403.04852",
    "authors": [
      "Bing He",
      "Yingchen Ma",
      "Mustaque Ahamad",
      "Srijan Kumar"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.04867",
    "title": "Group Privacy Amplification and Unified Amplification by Subsampling for  Rényi Differential Privacy",
    "abstract": "Differential privacy (DP) has various desirable properties, such as robustness to post-processing, group privacy, and amplification by subsampling, which can be derived independently of each other. Our goal is to determine whether stronger privacy guarantees can be obtained by considering multiple of these properties jointly. To this end, we focus on the combination of group privacy and amplification by subsampling. To provide guarantees that are amenable to machine learning algorithms, we conduct our analysis in the framework of R\\'enyi-DP, which has more favorable composition properties than $(\\epsilon,\\delta)$-DP. As part of this analysis, we develop a unified framework for deriving amplification by subsampling guarantees for R\\'enyi-DP, which represents the first such framework for a privacy accounting method and is of independent interest. We find that it not only lets us improve upon and generalize existing amplification results for R\\'enyi-DP, but also derive provably tight group privacy amplification guarantees stronger than existing principles. These results establish the joint study of different DP properties as a promising research direction. ",
    "url": "https://arxiv.org/abs/2403.04867",
    "authors": [
      "Jan Schuchardt",
      "Mihail Stoian",
      "Arthur Kosmala",
      "Stephan Günnemann"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.04884",
    "title": "Optimizing Retinal Prosthetic Stimuli with Conditional Invertible Neural  Networks",
    "abstract": "Implantable retinal prostheses offer a promising solution to restore partial vision by circumventing damaged photoreceptor cells in the retina and directly stimulating the remaining functional retinal cells. However, the information transmission between the camera and retinal cells is often limited by the low resolution of the electrode array and the lack of specificity for different ganglion cell types, resulting in suboptimal stimulations. In this work, we propose to utilize normalizing flow-based conditional invertible neural networks to optimize retinal implant stimulation in an unsupervised manner. The invertibility of these networks allows us to use them as a surrogate for the computational model of the visual system, while also encoding input camera signals into optimized electrical stimuli on the electrode array. Compared to other methods, such as trivial downsampling, linear models, and feed-forward convolutional neural networks, the flow-based invertible neural network and its conditional extension yield better visual reconstruction qualities w.r.t. various metrics using a physiologically validated simulation tool. ",
    "url": "https://arxiv.org/abs/2403.04884",
    "authors": [
      "Yuli Wu",
      "Julian Wittmann",
      "Peter Walter",
      "Johannes Stegmaier"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04889",
    "title": "Towards Robust Data-Driven Automated Recovery of Symbolic Conservation  Laws from Limited Data",
    "abstract": "Conservation laws are an inherent feature in many systems modeling real world phenomena, in particular, those modeling biological and chemical systems. If the form of the underlying dynamical system is known, linear algebra and algebraic geometry methods can be used to identify the conservation laws. Our work focuses on using data-driven methods to identify the conservation law(s) in the absence of the knowledge of system dynamics. Building in part upon the ideas proposed in [arXiv:1811.00961], we develop a robust data-driven computational framework that automates the process of identifying the number and type of the conservation law(s) while keeping the amount of required data to a minimum. We demonstrate that due to relative stability of singular vectors to noise we are able to reconstruct correct conservation laws without the need for excessive parameter tuning. While we focus primarily on biological examples, the framework proposed herein is suitable for a variety of data science applications and can be coupled with other machine learning approaches. ",
    "url": "https://arxiv.org/abs/2403.04889",
    "authors": [
      "Tracey Oellerich",
      "Maria Emelianenko"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2403.04899",
    "title": "Towards Scene Graph Anticipation",
    "abstract": "Spatio-temporal scene graphs represent interactions in a video by decomposing scenes into individual objects and their pair-wise temporal relationships. Long-term anticipation of the fine-grained pair-wise relationships between objects is a challenging problem. To this end, we introduce the task of Scene Graph Anticipation (SGA). We adapt state-of-the-art scene graph generation methods as baselines to anticipate future pair-wise relationships between objects and propose a novel approach SceneSayer. In SceneSayer, we leverage object-centric representations of relationships to reason about the observed video frames and model the evolution of relationships between objects. We take a continuous time perspective and model the latent dynamics of the evolution of object interactions using concepts of NeuralODE and NeuralSDE, respectively. We infer representations of future relationships by solving an Ordinary Differential Equation and a Stochastic Differential Equation, respectively. Extensive experimentation on the Action Genome dataset validates the efficacy of the proposed methods. ",
    "url": "https://arxiv.org/abs/2403.04899",
    "authors": [
      "Rohith Peddi",
      "Saksham Singh",
      "Saurabh",
      "Parag Singla",
      "Vibhav Gogate"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04905",
    "title": "A Clique-Based Separator for Intersection Graphs of Geodesic Disks in  $\\mathbb{R}^2$",
    "abstract": "Let $d$ be a (well-behaved) shortest-path metric defined on a path-connected subset of $\\mathbb{R}^2$ and let $\\mathcal{D}=\\{D_1,\\ldots,D_n\\}$ be a set of geodesic disks with respect to the metric $d$. We prove that $\\mathcal{G}^{\\times}(\\mathcal{D})$, the intersection graph of the disks in $\\mathcal{D}$, has a clique-based separator consisting of $O(n^{3/4+\\varepsilon})$ cliques. This significantly extends the class of objects whose intersection graphs have small clique-based separators. Our clique-based separator yields an algorithm for $q$-COLORING that runs in time $2^{O(n^{3/4+\\varepsilon})}$, assuming the boundaries of the disks $D_i$ can be computed in polynomial time. We also use our clique-based separator to obtain a simple, efficient, and almost exact distance oracle for intersection graphs of geodesic disks. Our distance oracle uses $O(n^{7/4+\\varepsilon})$ storage and can report the hop distance between any two nodes in $\\mathcal{G}^{\\times}(\\mathcal{D})$ in $O(n^{3/4+\\varepsilon})$ time, up to an additive error of one. So far, distance oracles with an additive error of one that use subquadratic storage and sublinear query time were not known for such general graph classes. ",
    "url": "https://arxiv.org/abs/2403.04905",
    "authors": [
      "Boris Aronov",
      "Mark de Berg",
      "Leonidas Theocharous"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2403.04916",
    "title": "Numerical solution of FDE-IVPs by using Fractional HBVMs: the fhbvm code",
    "abstract": "In this paper we describe the efficient numerical implementation of Fractional HBVMs, a class of methods recently introduced for solving systems of fractional differential equations. The reported arguments are implemented in the Matlab code fhbvm, which is made available on the web. An extensive experimentation of the code is reported, to give evidence of its effectiveness. ",
    "url": "https://arxiv.org/abs/2403.04916",
    "authors": [
      "Luigi Brugnano",
      "Gianmarco Gurioli",
      "Felice Iavernaro"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2403.04917",
    "title": "A Mixed-Integer Conic Program for the Moving-Target Traveling Salesman  Problem based on a Graph of Convex Sets",
    "abstract": "This paper introduces a new formulation that finds the optimum for the Moving-Target Traveling Salesman Problem (MT-TSP), which seeks to find a shortest path for an agent, that starts at a depot, visits a set of moving targets exactly once within their assigned time-windows, and returns to the depot. The formulation relies on the key idea that when the targets move along lines, their trajectories become convex sets within the space-time coordinate system. The problem then reduces to finding the shortest path within a graph of convex sets, subject to some speed constraints. We compare our formulation with the current state-of-the-art Mixed Integer Conic Program (MICP) solver for the MT-TSP. The experimental results show that our formulation outperforms the MICP for instances with up to 20 targets, with up to two orders of magnitude reduction in runtime, and up to a 60\\% tighter optimality gap. We also show that the solution cost from the convex relaxation of our formulation provides significantly tighter lower bounds for the MT-TSP than the ones from the MICP. ",
    "url": "https://arxiv.org/abs/2403.04917",
    "authors": [
      "Allen George Philip",
      "Zhongqiang Ren",
      "Sivakumar Rathinam",
      "Howie Choset"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2403.04918",
    "title": "Secure Information Embedding and Extraction in Forensic 3D  Fingerprinting",
    "abstract": "The prevalence of 3D printing poses a significant risk to public safety, as any individual with internet access and a commodity printer is able to produce untraceable firearms, keys, counterfeit products, etc. To aid government authorities in combating these new security threats, several approaches have been taken to tag 3D-prints with identifying information. Known as fingerprints, this information is written into the object using various bit embedding techniques; examples include varying the height of the molten thermoplastic layers, and depositing metallic powder with different magnetic properties. Yet, the practicality of theses techniques in real-world forensic settings is hindered by the adversarial nature of this problem. That is, the 3D-printing process is out of reach of any law enforcement agencies; it is the adversary who controls all aspects of printing and possesses the printed object. To combat these threats, law enforcement agencies can regulate the manufacturing of 3D printers, on which they may enforce a fingerprinting scheme, and collect adversarially tampered remains (e.g., fragments of a broken 3D-printed firearm) during forensic investigation. Therefore, it is important to devise fingerprinting techniques so that the fingerprint could be extracted even if printing is carried out by the adversary. To this end, we present SIDE (Secure Information Embedding and Extraction), a fingerprinting framework that tackles the adversarial nature of forensic fingerprinting in 3D prints by offering both secure information embedding and secure information extraction. ",
    "url": "https://arxiv.org/abs/2403.04918",
    "authors": [
      "Canran Wang",
      "Jinwen Wang",
      "Mi Zhou",
      "Vinh Pham",
      "Senyue Hao",
      "Chao Zhou",
      "Ning Zhang",
      "Netanel Raviv"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.04919",
    "title": "Identifying Causal Effects Under Functional Dependencies",
    "abstract": "We study the identification of causal effects, motivated by two improvements to identifiability which can be attained if one knows that some variables in a causal graph are functionally determined by their parents (without needing to know the specific functions). First, an unidentifiable causal effect may become identifiable when certain variables are functional. Second, certain functional variables can be excluded from being observed without affecting the identifiability of a causal effect, which may significantly reduce the number of needed variables in observational data. Our results are largely based on an elimination procedure which removes functional variables from a causal graph while preserving key properties in the resulting causal graph, including the identifiability of causal effects. ",
    "url": "https://arxiv.org/abs/2403.04919",
    "authors": [
      "Yizuo Chen",
      "Adnan Darwiche"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Symbolic Computation (cs.SC)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2403.04923",
    "title": "Control-based Graph Embeddings with Data Augmentation for Contrastive  Learning",
    "abstract": "In this paper, we study the problem of unsupervised graph representation learning by harnessing the control properties of dynamical networks defined on graphs. Our approach introduces a novel framework for contrastive learning, a widely prevalent technique for unsupervised representation learning. A crucial step in contrastive learning is the creation of 'augmented' graphs from the input graphs. Though different from the original graphs, these augmented graphs retain the original graph's structural characteristics. Here, we propose a unique method for generating these augmented graphs by leveraging the control properties of networks. The core concept revolves around perturbing the original graph to create a new one while preserving the controllability properties specific to networks and graphs. Compared to the existing methods, we demonstrate that this innovative approach enhances the effectiveness of contrastive learning frameworks, leading to superior results regarding the accuracy of the classification tasks. The key innovation lies in our ability to decode the network structure using these control properties, opening new avenues for unsupervised graph representation learning. ",
    "url": "https://arxiv.org/abs/2403.04923",
    "authors": [
      "Obaid Ullah Ahmad",
      "Anwar Said",
      "Mudassir Shabbir",
      "Waseem Abbas",
      "Xenofon Koutsoukos"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.04924",
    "title": "$\\text{R}^2$-Bench: Benchmarking the Robustness of Referring Perception  Models under Perturbations",
    "abstract": "Referring perception, which aims at grounding visual objects with multimodal referring guidance, is essential for bridging the gap between humans, who provide instructions, and the environment where intelligent systems perceive. Despite progress in this field, the robustness of referring perception models (RPMs) against disruptive perturbations is not well explored. This work thoroughly assesses the resilience of RPMs against various perturbations in both general and specific contexts. Recognizing the complex nature of referring perception tasks, we present a comprehensive taxonomy of perturbations, and then develop a versatile toolbox for synthesizing and evaluating the effects of composite disturbances. Employing this toolbox, we construct $\\text{R}^2$-Bench, a benchmark for assessing the Robustness of Referring perception models under noisy conditions across five key tasks. Moreover, we propose the $\\text{R}^2$-Agent, an LLM-based agent that simplifies and automates model evaluation via natural language instructions. Our investigation uncovers the vulnerabilities of current RPMs to various perturbations and provides tools for assessing model robustness, potentially promoting the safe and resilient integration of intelligent systems into complex real-world scenarios. ",
    "url": "https://arxiv.org/abs/2403.04924",
    "authors": [
      "Xiang Li",
      "Kai Qiu",
      "Jinglu Wang",
      "Xiaohao Xu",
      "Rita Singh",
      "Kashu Yamazak",
      "Hao Chen",
      "Xiaonan Huang",
      "Bhiksha Raj"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04925",
    "title": "Near Field Communications for DMA-NOMA Networks",
    "abstract": "A novel near-field transmission framework is proposed for dynamic metasurface antenna (DMA)-enabled non-orthogonal multiple access (NOMA) networks. The base station (BS) exploits the hybrid beamforming to communicate with multiple near users (NUs) and far users (FUs) using the NOMA principle. Based on this framework, two novel beamforming schemes are proposed. 1) For the case of the grouped users distributed in the same direction, a beam-steering scheme is developed. The metric of beam pattern error (BPE) is introduced for the characterization of the gap between the hybrid beamformers and the desired ideal beamformers, where a two-layer algorithm is proposed to minimize BPE by optimizing hybrid beamformers. Then, the optimal power allocation strategy is obtained to maximize the sum achievable rate of the network. 2) For the case of users randomly distributed, a beam-splitting scheme is proposed, where two sub-beamformers are extracted from the single beamformer to serve different users in the same group. An alternating optimization (AO) algorithm is proposed for hybrid beamformer optimization, and the optimal power allocation is also derived. Numerical results validate that: 1) the proposed beamforming schemes exhibit superior performance compared with the existing imperfect-resolution-based beamforming scheme; 2) the communication rate of the proposed transmission framework is sensitive to the imperfect distance knowledge of NUs but not to that of FUs. ",
    "url": "https://arxiv.org/abs/2403.04925",
    "authors": [
      "Zheng Zhang",
      "Yuanwei Liu",
      "Zhaolin Wang",
      "Jian Chen",
      "Dong In Kim"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.04929",
    "title": "On the Markov Property of Neural Algorithmic Reasoning: Analyses and  Methods",
    "abstract": "Neural algorithmic reasoning is an emerging research direction that endows neural networks with the ability to mimic algorithmic executions step-by-step. A common paradigm in existing designs involves the use of historical embeddings in predicting the results of future execution steps. Our observation in this work is that such historical dependence intrinsically contradicts the Markov nature of algorithmic reasoning tasks. Based on this motivation, we present our ForgetNet, which does not use historical embeddings and thus is consistent with the Markov nature of the tasks. To address challenges in training ForgetNet at early stages, we further introduce G-ForgetNet, which uses a gating mechanism to allow for the selective integration of historical embeddings. Such an enhanced capability provides valuable computational pathways during the model's early training phase. Our extensive experiments, based on the CLRS-30 algorithmic reasoning benchmark, demonstrate that both ForgetNet and G-ForgetNet achieve better generalization capability than existing methods. Furthermore, we investigate the behavior of the gating mechanism, highlighting its degree of alignment with our intuitions and its effectiveness for robust performance. ",
    "url": "https://arxiv.org/abs/2403.04929",
    "authors": [
      "Montgomery Bohde",
      "Meng Liu",
      "Alexandra Saxton",
      "Shuiwang Ji"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2403.04932",
    "title": "Divide and Conquer: High-Resolution Industrial Anomaly Detection via  Memory Efficient Tiled Ensemble",
    "abstract": "Industrial anomaly detection is an important task within computer vision with a wide range of practical use cases. The small size of anomalous regions in many real-world datasets necessitates processing the images at a high resolution. This frequently poses significant challenges concerning memory consumption during the model training and inference stages, leaving some existing methods impractical for widespread adoption. To overcome this challenge, we present the tiled ensemble approach, which reduces memory consumption by dividing the input images into a grid of tiles and training a dedicated model for each tile location. The tiled ensemble is compatible with any existing anomaly detection model without the need for any modification of the underlying architecture. By introducing overlapping tiles, we utilize the benefits of traditional stacking ensembles, leading to further improvements in anomaly detection capabilities beyond high resolution alone. We perform a comprehensive analysis using diverse underlying architectures, including Padim, PatchCore, FastFlow, and Reverse Distillation, on two standard anomaly detection datasets: MVTec and VisA. Our method demonstrates a notable improvement across setups while remaining within GPU memory constraints, consuming only as much GPU memory as a single model needs to process a single tile. ",
    "url": "https://arxiv.org/abs/2403.04932",
    "authors": [
      "Blaž Rolih",
      "Samet Akçay",
      "Dick Ameln",
      "Ashwin Vaidya"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04937",
    "title": "Gradient-free neural topology optimization",
    "abstract": "Gradient-free optimizers allow for tackling problems regardless of the smoothness or differentiability of their objective function, but they require many more iterations to converge when compared to gradient-based algorithms. This has made them unviable for topology optimization due to the high computational cost per iteration and high dimensionality of these problems. We propose a pre-trained neural reparameterization strategy that leads to at least one order of magnitude decrease in iteration count when optimizing the designs in latent space, as opposed to the conventional approach without latent reparameterization. We demonstrate this via extensive computational experiments in- and out-of-distribution with the training data. Although gradient-based topology optimization is still more efficient for differentiable problems, such as compliance optimization of structures, we believe this work will open up a new path for problems where gradient information is not readily available (e.g. fracture). ",
    "url": "https://arxiv.org/abs/2403.04937",
    "authors": [
      "Gawel Kus",
      "Miguel A. Bessa"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2403.04954",
    "title": "Fooling Neural Networks for Motion Forecasting via Adversarial Attacks",
    "abstract": "Human motion prediction is still an open problem, which is extremely important for autonomous driving and safety applications. Although there are great advances in this area, the widely studied topic of adversarial attacks has not been applied to multi-regression models such as GCNs and MLP-based architectures in human motion prediction. This work intends to reduce this gap using extensive quantitative and qualitative experiments in state-of-the-art architectures similar to the initial stages of adversarial attacks in image classification. The results suggest that models are susceptible to attacks even on low levels of perturbation. We also show experiments with 3D transformations that affect the model performance, in particular, we show that most models are sensitive to simple rotations and translations which do not alter joint distances. We conclude that similar to earlier CNN models, motion forecasting tasks are susceptible to small perturbations and simple 3D transformations. ",
    "url": "https://arxiv.org/abs/2403.04954",
    "authors": [
      "Edgar Medina",
      "Leyong Loh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04957",
    "title": "Automatic and Universal Prompt Injection Attacks against Large Language  Models",
    "abstract": "Large Language Models (LLMs) excel in processing and generating human language, powered by their ability to interpret and follow instructions. However, their capabilities can be exploited through prompt injection attacks. These attacks manipulate LLM-integrated applications into producing responses aligned with the attacker's injected content, deviating from the user's actual requests. The substantial risks posed by these attacks underscore the need for a thorough understanding of the threats. Yet, research in this area faces challenges due to the lack of a unified goal for such attacks and their reliance on manually crafted prompts, complicating comprehensive assessments of prompt injection robustness. We introduce a unified framework for understanding the objectives of prompt injection attacks and present an automated gradient-based method for generating highly effective and universal prompt injection data, even in the face of defensive measures. With only five training samples (0.3% relative to the test data), our attack can achieve superior performance compared with baselines. Our findings emphasize the importance of gradient-based testing, which can avoid overestimation of robustness, especially for defense mechanisms. ",
    "url": "https://arxiv.org/abs/2403.04957",
    "authors": [
      "Xiaogeng Liu",
      "Zhiyuan Yu",
      "Yizhe Zhang",
      "Ning Zhang",
      "Chaowei Xiao"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04969",
    "title": "PIPsUS: Self-Supervised Dense Point Tracking in Ultrasound",
    "abstract": "Finding point-level correspondences is a fundamental problem in ultrasound (US), since it can enable US landmark tracking for intraoperative image guidance in different surgeries, including head and neck. Most existing US tracking methods, e.g., those based on optical flow or feature matching, were initially designed for RGB images before being applied to US. Therefore domain shift can impact their performance. Training could be supervised by ground-truth correspondences, but these are expensive to acquire in US. To solve these problems, we propose a self-supervised pixel-level tracking model called PIPsUS. Our model can track an arbitrary number of points in one forward pass and exploits temporal information by considering multiple, instead of just consecutive, frames. We developed a new self-supervised training strategy that utilizes a long-term point-tracking model trained for RGB images as a teacher to guide the model to learn realistic motions and use data augmentation to enforce tracking from US appearance. We evaluate our method on neck and oral US and echocardiography, showing higher point tracking accuracy when compared with fast normalized cross-correlation and tuned optical flow. Code will be available once the paper is accepted. ",
    "url": "https://arxiv.org/abs/2403.04969",
    "authors": [
      "Wanwen Chen",
      "Adam Schmidt",
      "Eitan Prisman",
      "Septimiu E Salcudean"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04971",
    "title": "Robust Surgical Tool Tracking with Pixel-based Probabilities for  Projected Geometric Primitives",
    "abstract": "Controlling robotic manipulators via visual feedback requires a known coordinate frame transformation between the robot and the camera. Uncertainties in mechanical systems as well as camera calibration create errors in this coordinate frame transformation. These errors result in poor localization of robotic manipulators and create a significant challenge for applications that rely on precise interactions between manipulators and the environment. In this work, we estimate the camera-to-base transform and joint angle measurement errors for surgical robotic tools using an image based insertion-shaft detection algorithm and probabilistic models. We apply our proposed approach in both a structured environment as well as an unstructured environment and measure to demonstrate the efficacy of our methods. ",
    "url": "https://arxiv.org/abs/2403.04971",
    "authors": [
      "Christopher D'Ambrosia",
      "Florian Richter",
      "Zih-Yun Chiu",
      "Nikhil Shinde",
      "Fei Liu",
      "Henrik I. Christensen",
      "Michael C. Yip"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04977",
    "title": "Node Centrality Approximation For Large Networks Based On Inductive  Graph Neural Networks",
    "abstract": "Closeness Centrality (CC) and Betweenness Centrality (BC) are crucial metrics in network analysis, providing essential reference for discerning the significance of nodes within complex networks. These measures find wide applications in critical tasks, such as community detection and network dismantling. However, their practical implementation on extensive networks remains computationally demanding due to their high time complexity. To mitigate these computational challenges, numerous approximation algorithms have been developed to expedite the computation of CC and BC. Nevertheless, even these approximations still necessitate substantial processing time when applied to large-scale networks. Furthermore, their output proves sensitive to even minor perturbations within the network structure. In this work, We redefine the CC and BC node ranking problem as a machine learning problem and propose the CNCA-IGE model, which is an encoder-decoder model based on inductive graph neural networks designed to rank nodes based on specified CC or BC metrics. We incorporate the MLP-Mixer model as the decoder in the BC ranking prediction task to enhance the model's robustness and capacity. Our approach is evaluated on diverse synthetic and real-world networks of varying scales, and the experimental results demonstrate that the CNCA-IGE model outperforms state-of-the-art baseline models, significantly reducing execution time while improving performance. ",
    "url": "https://arxiv.org/abs/2403.04977",
    "authors": [
      "Yiwei Zou",
      "Ting Li",
      "Zong-fu Luo"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.04982",
    "title": "A 28.6 mJ/iter Stable Diffusion Processor for Text-to-Image Generation  with Patch Similarity-based Sparsity Augmentation and Text-based  Mixed-Precision",
    "abstract": "This paper presents an energy-efficient stable diffusion processor for text-to-image generation. While stable diffusion attained attention for high-quality image synthesis results, its inherent characteristics hinder its deployment on mobile platforms. The proposed processor achieves high throughput and energy efficiency with three key features as solutions: 1) Patch similarity-based sparsity augmentation (PSSA) to reduce external memory access (EMA) energy of self-attention score by 60.3 %, leading to 37.8 % total EMA energy reduction. 2) Text-based important pixel spotting (TIPS) to allow 44.8 % of the FFN layer workload to be processed with low-precision activation. 3) Dual-mode bit-slice core (DBSC) architecture to enhance energy efficiency in FFN layers by 43.0 %. The proposed processor is implemented in 28 nm CMOS technology and achieves 3.84 TOPS peak throughput with 225.6 mW average power consumption. In sum, 28.6 mJ/iteration highly energy-efficient text-to-image generation processor can be achieved at MS-COCO dataset. ",
    "url": "https://arxiv.org/abs/2403.04982",
    "authors": [
      "Jiwon Choi",
      "Wooyoung Jo",
      "Seongyon Hong",
      "Beomseok Kwon",
      "Wonhoon Park",
      "Hoi-Jun Yoo"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2403.04989",
    "title": "Profile of Vulnerability Remediations in Dependencies Using Graph  Analysis",
    "abstract": "This research introduces graph analysis methods and a modified Graph Attention Convolutional Neural Network (GAT) to the critical challenge of open source package vulnerability remediation by analyzing control flow graphs to profile breaking changes in applications occurring from dependency upgrades intended to remediate vulnerabilities. Our approach uniquely applies node centrality metrics -- degree, norm, and closeness centrality -- to the GAT model, enabling a detailed examination of package code interactions with a focus on identifying and understanding vulnerable nodes, and when dependency package upgrades will interfere with application workflow. The study's application on a varied dataset reveals an unexpected limited inter-connectivity of vulnerabilities in core code, thus challenging established notions in software security. The results demonstrate the effectiveness of the enhanced GAT model in offering nuanced insights into the relational dynamics of code vulnerabilities, proving its potential in advancing cybersecurity measures. This approach not only aids in the strategic mitigation of vulnerabilities but also lays the groundwork for the development of sophisticated, sustainable monitoring systems for the evaluation of work effort for vulnerability remediation resulting from open source software. The insights gained from this study mark a significant advancement in the field of package vulnerability analysis and cybersecurity. ",
    "url": "https://arxiv.org/abs/2403.04989",
    "authors": [
      "Fernando Vera",
      "Palina Pauliuchenka",
      "Ethan Oh",
      "Bai Chien Kao",
      "Louis DiValentin",
      "David A. Bader"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.04998",
    "title": "Robust automated calcification meshing for biomechanical cardiac digital  twins",
    "abstract": "Calcification has significant influence over cardiovascular diseases and interventions. Detailed characterization of calcification is thus desired for predictive modeling, but calcified heart meshes for physics-driven simulations are still often reconstructed using manual operations. This poses a major bottleneck for large-scale adoption of computational simulations for research or clinical use. To address this, we propose an end-to-end automated meshing algorithm that enables robust incorporation of patient-specific calcification onto a given heart mesh. The algorithm provides a substantial speed-up from several hours of manual meshing to $\\sim$1 minute of automated computation, and it solves an important problem that cannot be addressed with recent template registration-based heart meshing techniques. We validated our final calcified heart meshes with extensive simulations, demonstrating our ability to accurately model patient-specific aortic stenosis and Transcatheter Aortic Valve Replacement. Our method may serve as an important tool for accelerating the development and usage of physics-driven simulations for cardiac digital twins. ",
    "url": "https://arxiv.org/abs/2403.04998",
    "authors": [
      "Daniel H. Pak",
      "Minliang Liu",
      "Theodore Kim",
      "Caglar Ozturk",
      "Raymond McKay",
      "Ellen T. Roche",
      "Rudolph Gleason",
      "James S. Duncan"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05000",
    "title": "Medical Speech Symptoms Classification via Disentangled Representation",
    "abstract": "Intent is defined for understanding spoken language in existing works. Both textual features and acoustic features involved in medical speech contain intent, which is important for symptomatic diagnosis. In this paper, we propose a medical speech classification model named DRSC that automatically learns to disentangle intent and content representations from textual-acoustic data for classification. The intent representations of the text domain and the Mel-spectrogram domain are extracted via intent encoders, and then the reconstructed text feature and the Mel-spectrogram feature are obtained through two exchanges. After combining the intent from two domains into a joint representation, the integrated intent representation is fed into a decision layer for classification. Experimental results show that our model obtains an average accuracy rate of 95% in detecting 25 different medical symptoms. ",
    "url": "https://arxiv.org/abs/2403.05000",
    "authors": [
      "Jianzong Wang",
      "Pengcheng Li",
      "Xulong Zhang",
      "Ning Cheng",
      "Jing Xiao"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05007",
    "title": "Age of Computing: A Metric of Computation Freshness in Communication and  Computation Cooperative Networks",
    "abstract": "In communication and computation cooperative networks (3CNs), timely computation is crucial but not always guaranteed. There is a strong demand for computational tasks to be processed at computational nodes as timely as possible. However, a measure of timeliness in computation is lacking. In this letter, we introduce the novel concept, Age of Computing, to capture computation freshness in 3CNs. We develop two methods for calculating this metric, applicable to a wide range of 3CNs. These calculations are applied to a queue-theoretic system comprising a source and a computational node, resulting in the derivation of two expressions for the AoC. Utilizing these expressions, we establish an upper bound and a tight lower bound. Subsequently, we illustrate two fundamental tradeoffs in M/M/1 systems: the communication-computation tradeoff, which arises from the utilization of the computation power under the joint influence of communication and computation efficiency, and the AoC-delay tradeoff, rooted in the fact that AoC assesses comprehensive and system-wide computation freshness while delay measures instantaneous and individual task computation freshness. While our models are simpler than their real-world counterparts, we believe the insights gained provide a valuable starting point for understanding computation freshness in 3CNs. ",
    "url": "https://arxiv.org/abs/2403.05007",
    "authors": [
      "Xingran Chen",
      "Yusha Liu",
      "Yali Zheng",
      "Kun Yang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.05014",
    "title": "Simple Multigraph Convolution Networks",
    "abstract": "Existing multigraph convolution methods either ignore the cross-view interaction among multiple graphs, or induce extremely high computational cost due to standard cross-view polynomial operators. To alleviate this problem, this paper proposes a Simple MultiGraph Convolution Networks (SMGCN) which first extracts consistent cross-view topology from multigraphs including edge-level and subgraph-level topology, then performs polynomial expansion based on raw multigraphs and consistent topologies. In theory, SMGCN utilizes the consistent topologies in polynomial expansion rather than standard cross-view polynomial expansion, which performs credible cross-view spatial message-passing, follows the spectral convolution paradigm, and effectively reduces the complexity of standard polynomial expansion. In the simulations, experimental results demonstrate that SMGCN achieves state-of-the-art performance on ACM and DBLP multigraph benchmark datasets. Our codes are available at https://github.com/frinkleko/SMGCN. ",
    "url": "https://arxiv.org/abs/2403.05014",
    "authors": [
      "Danyang Wu",
      "Xinjie Shen",
      "Jitao Lu",
      "Jin Xu",
      "Feiping Nie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05020",
    "title": "Is this the real life? Is this just fantasy? The Misleading Success of  Simulating Social Interactions With LLMs",
    "abstract": "Recent advances in large language models (LLM) have enabled richer social simulations, allowing for the study of various social phenomena with LLM-based agents. However, most work has used an omniscient perspective on these simulations (e.g., single LLM to generate all interlocutors), which is fundamentally at odds with the non-omniscient, information asymmetric interactions that humans have. To examine these differences, we develop an evaluation framework to simulate social interactions with LLMs in various settings (omniscient, non-omniscient). Our experiments show that interlocutors simulated omnisciently are much more successful at accomplishing social goals compared to non-omniscient agents, despite the latter being the more realistic setting. Furthermore, we demonstrate that learning from omniscient simulations improves the apparent naturalness of interactions but scarcely enhances goal achievement in cooperative scenarios. Our findings indicate that addressing information asymmetry remains a fundamental challenge for LLM-based agents. ",
    "url": "https://arxiv.org/abs/2403.05020",
    "authors": [
      "Xuhui Zhou",
      "Zhe Su",
      "Tiwalayo Eisape",
      "Hyunwoo Kim",
      "Maarten Sap"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05026",
    "title": "Spectral Invariant Learning for Dynamic Graphs under Distribution Shifts",
    "abstract": "Dynamic graph neural networks (DyGNNs) currently struggle with handling distribution shifts that are inherent in dynamic graphs. Existing work on DyGNNs with out-of-distribution settings only focuses on the time domain, failing to handle cases involving distribution shifts in the spectral domain. In this paper, we discover that there exist cases with distribution shifts unobservable in the time domain while observable in the spectral domain, and propose to study distribution shifts on dynamic graphs in the spectral domain for the first time. However, this investigation poses two key challenges: i) it is non-trivial to capture different graph patterns that are driven by various frequency components entangled in the spectral domain; and ii) it remains unclear how to handle distribution shifts with the discovered spectral patterns. To address these challenges, we propose Spectral Invariant Learning for Dynamic Graphs under Distribution Shifts (SILD), which can handle distribution shifts on dynamic graphs by capturing and utilizing invariant and variant spectral patterns. Specifically, we first design a DyGNN with Fourier transform to obtain the ego-graph trajectory spectrums, allowing the mixed dynamic graph patterns to be transformed into separate frequency components. We then develop a disentangled spectrum mask to filter graph dynamics from various frequency components and discover the invariant and variant spectral patterns. Finally, we propose invariant spectral filtering, which encourages the model to rely on invariant patterns for generalization under distribution shifts. Experimental results on synthetic and real-world dynamic graph datasets demonstrate the superiority of our method for both node classification and link prediction tasks under distribution shifts. ",
    "url": "https://arxiv.org/abs/2403.05026",
    "authors": [
      "Zeyang Zhang",
      "Xin Wang",
      "Ziwei Zhang",
      "Zhou Qin",
      "Weigao Wen",
      "Hui Xue",
      "Haoyang Li",
      "Wenwu Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05029",
    "title": "BjTT: A Large-scale Multimodal Dataset for Traffic Prediction",
    "abstract": "Traffic prediction is one of the most significant foundations in Intelligent Transportation Systems (ITS). Traditional traffic prediction methods rely only on historical traffic data to predict traffic trends and face two main challenges. 1) insensitivity to unusual events. 2) limited performance in long-term prediction. In this work, we explore how generative models combined with text describing the traffic system can be applied for traffic generation, and name the task Text-to-Traffic Generation (TTG). The key challenge of the TTG task is how to associate text with the spatial structure of the road network and traffic data for generating traffic situations. To this end, we propose ChatTraffic, the first diffusion model for text-to-traffic generation. To guarantee the consistency between synthetic and real data, we augment a diffusion model with the Graph Convolutional Network (GCN) to extract spatial correlations of traffic data. In addition, we construct a large dataset containing text-traffic pairs for the TTG task. We benchmarked our model qualitatively and quantitatively on the released dataset. The experimental results indicate that ChatTraffic can generate realistic traffic situations from the text. Our code and dataset are available at https://github.com/ChyaZhang/ChatTraffic. ",
    "url": "https://arxiv.org/abs/2403.05029",
    "authors": [
      "Chengyang Zhang",
      "Yong Zhang",
      "Qitan Shao",
      "Bo Li",
      "Yisheng Lv",
      "Xinglin Piao",
      "Baocai Yin"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05030",
    "title": "Defending Against Unforeseen Failure Modes with Latent Adversarial  Training",
    "abstract": "AI systems sometimes exhibit harmful unintended behaviors post-deployment. This is often despite extensive diagnostics and debugging by developers. Minimizing risks from models is challenging because the attack surface is so large. It is not tractable to exhaustively search for inputs that may cause a model to fail. Red-teaming and adversarial training (AT) are commonly used to make AI systems more robust. However, they have not been sufficient to avoid many real-world failure modes that differ from the ones adversarially trained on. In this work, we utilize latent adversarial training (LAT) to defend against vulnerabilities without generating inputs that elicit them. LAT leverages the compressed, abstract, and structured latent representations of concepts that the network actually uses for prediction. We use LAT to remove trojans and defend against held-out classes of adversarial attacks. We show in image classification, text classification, and text generation tasks that LAT usually improves both robustness and performance on clean data relative to AT. This suggests that LAT can be a promising tool for defending against failure modes that are not explicitly identified by developers. ",
    "url": "https://arxiv.org/abs/2403.05030",
    "authors": [
      "Stephen Casper",
      "Lennart Schulze",
      "Oam Patel",
      "Dylan Hadfield-Menell"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.05033",
    "title": "Quantifying Manifolds: Do the manifolds learned by Generative  Adversarial Networks converge to the real data manifold",
    "abstract": "This paper presents our experiments to quantify the manifolds learned by ML models (in our experiment, we use a GAN model) as they train. We compare the manifolds learned at each epoch to the real manifolds representing the real data. To quantify a manifold, we study the intrinsic dimensions and topological features of the manifold learned by the ML model, how these metrics change as we continue to train the model, and whether these metrics convergence over the course of training to the metrics of the real data manifold. ",
    "url": "https://arxiv.org/abs/2403.05033",
    "authors": [
      "Anupam Chaudhuri",
      "Anj Simmons",
      "Mohamed Abdelrazek"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05034",
    "title": "CRM: Single Image to 3D Textured Mesh with Convolutional Reconstruction  Model",
    "abstract": "Feed-forward 3D generative models like the Large Reconstruction Model (LRM) have demonstrated exceptional generation speed. However, the transformer-based methods do not leverage the geometric priors of the triplane component in their architecture, often leading to sub-optimal quality given the limited size of 3D data and slow training. In this work, we present the Convolutional Reconstruction Model (CRM), a high-fidelity feed-forward single image-to-3D generative model. Recognizing the limitations posed by sparse 3D data, we highlight the necessity of integrating geometric priors into network design. CRM builds on the key observation that the visualization of triplane exhibits spatial correspondence of six orthographic images. First, it generates six orthographic view images from a single input image, then feeds these images into a convolutional U-Net, leveraging its strong pixel-level alignment capabilities and significant bandwidth to create a high-resolution triplane. CRM further employs Flexicubes as geometric representation, facilitating direct end-to-end optimization on textured meshes. Overall, our model delivers a high-fidelity textured mesh from an image in just 10 seconds, without any test-time optimization. ",
    "url": "https://arxiv.org/abs/2403.05034",
    "authors": [
      "Zhengyi Wang",
      "Yikai Wang",
      "Yifei Chen",
      "Chendong Xiang",
      "Shuo Chen",
      "Dajiang Yu",
      "Chongxuan Li",
      "Hang Su",
      "Jun Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.05050",
    "title": "DyRoNet: A Low-Rank Adapter Enhanced Dynamic Routing Network for  Streaming Perception",
    "abstract": "Autonomous driving systems demand real-time, accurate perception to navigate complex environments. Addressing this, we introduce the Dynamic Router Network (DyRoNet), a framework that innovates with low-rank dynamic routing for enhanced streaming perception. By integrating specialized pre-trained branch networks, fine-tuned for various environmental conditions, DyRoNet achieves a balance between latency and precision. Its core feature, the speed router module, intelligently directs input data to the best-suited branch network, optimizing performance. The extensive evaluations reveal that DyRoNet adapts effectively to multiple branch selection strategies, setting a new benchmark in performance across a range of scenarios. DyRoNet not only establishes a new benchmark for streaming perception but also provides valuable engineering insights for future work. More project information is available at https://tastevision.github.io/DyRoNet/ ",
    "url": "https://arxiv.org/abs/2403.05050",
    "authors": [
      "Xiang Huang",
      "Zhi-Qi Cheng",
      "Jun-Yan He",
      "Chenyang Li",
      "Wangmeng Xiang",
      "Baigui Sun",
      "Xiao Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2403.05055",
    "title": "MUC: Mixture of Uncalibrated Cameras for Robust 3D Human Body  Reconstruction",
    "abstract": "Multiple cameras can provide multi-view video coverage of a person. It is necessary to fuse multi-view data, e.g., for subsequent behavioral analysis, while such fusion often relies on calibration of cameras in traditional solutions. However, it is non-trivial to calibrate multiple cameras. In this work, we propose a method to reconstruct 3D human body from multiple uncalibrated camera views. First, we adopt a pre-trained human body encoder to process each individual camera view, such that human body models and parameters can be reconstructed for each view. Next, instead of simply averaging models across views, we train a network to determine the weights of individual views for their fusion, based on the parameters estimated for joints and hands of human body as well as camera positions. Further, we turn to the mesh surface of human body for dynamic fusion, such that facial expression can be seamlessly integrated into the model of human body. Our method has demonstrated superior performance in reconstructing human body upon two public datasets. More importantly, our method can flexibly support ad-hoc deployment of an arbitrary number of cameras, which has significant potential in related applications. We will release source code upon acceptance of the paper. ",
    "url": "https://arxiv.org/abs/2403.05055",
    "authors": [
      "Yitao Zhu",
      "Sheng Wang",
      "Mengjie Xu",
      "Zixu Zhuang",
      "Zhixin Wang",
      "Kaidong Wang",
      "Han Zhang",
      "Qian Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05056",
    "title": "Stealing Stable Diffusion Prior for Robust Monocular Depth Estimation",
    "abstract": "Monocular depth estimation is a crucial task in computer vision. While existing methods have shown impressive results under standard conditions, they often face challenges in reliably performing in scenarios such as low-light or rainy conditions due to the absence of diverse training data. This paper introduces a novel approach named Stealing Stable Diffusion (SSD) prior for robust monocular depth estimation. The approach addresses this limitation by utilizing stable diffusion to generate synthetic images that mimic challenging conditions. Additionally, a self-training mechanism is introduced to enhance the model's depth estimation capability in such challenging environments. To enhance the utilization of the stable diffusion prior further, the DINOv2 encoder is integrated into the depth model architecture, enabling the model to leverage rich semantic priors and improve its scene understanding. Furthermore, a teacher loss is introduced to guide the student models in acquiring meaningful knowledge independently, thus reducing their dependency on the teacher models. The effectiveness of the approach is evaluated on nuScenes and Oxford RobotCar, two challenging public datasets, with the results showing the efficacy of the method. Source code and weights are available at: https://github.com/hitcslj/SSD. ",
    "url": "https://arxiv.org/abs/2403.05056",
    "authors": [
      "Yifan Mao",
      "Jian Liu",
      "Xianming Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05061",
    "title": "RadarDistill: Boosting Radar-based Object Detection Performance via  Knowledge Distillation from LiDAR Features",
    "abstract": "The inherent noisy and sparse characteristics of radar data pose challenges in finding effective representations for 3D object detection. In this paper, we propose RadarDistill, a novel knowledge distillation (KD) method, which can improve the representation of radar data by leveraging LiDAR data. RadarDistill successfully transfers desirable characteristics of LiDAR features into radar features using three key components: Cross-Modality Alignment (CMA), Activation-based Feature Distillation (AFD), and Proposal-based Feature Distillation (PFD). CMA enhances the density of radar features through multiple layers of dilation operations, effectively addressing the challenges of inefficient knowledge transfer from LiDAR to radar. AFD is designed to transfer knowledge from significant areas of the LiDAR features, specifically those regions where activation intensity exceeds a predetermined threshold. PFD guides the radar network to mimic LiDAR network features in the object proposals for accurately detected results while moderating features for misdetected proposals like false positives. Our comparative analyses conducted on the nuScenes datasets demonstrate that RadarDistill achieves state-of-the-art (SOTA) performance for radar-only object detection task, recording 20.5% in mAP and 43.7% in NDS. Also, RadarDistill significantly improves the performance of the camera-radar fusion model. ",
    "url": "https://arxiv.org/abs/2403.05061",
    "authors": [
      "Geonho Bang",
      "Kwangjin Choi",
      "Jisong Kim",
      "Dongsuk Kum",
      "Jun Won Choi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05064",
    "title": "Unsupervised Graph Neural Architecture Search with Disentangled  Self-supervision",
    "abstract": "The existing graph neural architecture search (GNAS) methods heavily rely on supervised labels during the search process, failing to handle ubiquitous scenarios where supervisions are not available. In this paper, we study the problem of unsupervised graph neural architecture search, which remains unexplored in the literature. The key problem is to discover the latent graph factors that drive the formation of graph data as well as the underlying relations between the factors and the optimal neural architectures. Handling this problem is challenging given that the latent graph factors together with architectures are highly entangled due to the nature of the graph and the complexity of the neural architecture search process. To address the challenge, we propose a novel Disentangled Self-supervised Graph Neural Architecture Search (DSGAS) model, which is able to discover the optimal architectures capturing various latent graph factors in a self-supervised fashion based on unlabeled graph data. Specifically, we first design a disentangled graph super-network capable of incorporating multiple architectures with factor-wise disentanglement, which are optimized simultaneously. Then, we estimate the performance of architectures under different factors by our proposed self-supervised training with joint architecture-graph disentanglement. Finally, we propose a contrastive search with architecture augmentations to discover architectures with factor-specific expertise. Extensive experiments on 11 real-world datasets demonstrate that the proposed model is able to achieve state-of-the-art performance against several baseline methods in an unsupervised manner. ",
    "url": "https://arxiv.org/abs/2403.05064",
    "authors": [
      "Zeyang Zhang",
      "Xin Wang",
      "Ziwei Zhang",
      "Guangyao Shen",
      "Shiqi Shen",
      "Wenwu Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05075",
    "title": "Benchmarking Large Language Models for Molecule Prediction Tasks",
    "abstract": "Large Language Models (LLMs) stand at the forefront of a number of Natural Language Processing (NLP) tasks. Despite the widespread adoption of LLMs in NLP, much of their potential in broader fields remains largely unexplored, and significant limitations persist in their design and implementation. Notably, LLMs struggle with structured data, such as graphs, and often falter when tasked with answering domain-specific questions requiring deep expertise, such as those in biology and chemistry. In this paper, we explore a fundamental question: Can LLMs effectively handle molecule prediction tasks? Rather than pursuing top-tier performance, our goal is to assess how LLMs can contribute to diverse molecule tasks. We identify several classification and regression prediction tasks across six standard molecule datasets. Subsequently, we carefully design a set of prompts to query LLMs on these tasks and compare their performance with existing Machine Learning (ML) models, which include text-based models and those specifically designed for analysing the geometric structure of molecules. Our investigation reveals several key insights: Firstly, LLMs generally lag behind ML models in achieving competitive performance on molecule tasks, particularly when compared to models adept at capturing the geometric structure of molecules, highlighting the constrained ability of LLMs to comprehend graph data. Secondly, LLMs show promise in enhancing the performance of ML models when used collaboratively. Lastly, we engage in a discourse regarding the challenges and promising avenues to harness LLMs for molecule prediction tasks. The code and models are available at https://github.com/zhiqiangzhongddu/LLMaMol. ",
    "url": "https://arxiv.org/abs/2403.05075",
    "authors": [
      "Zhiqiang Zhong",
      "Kuangyu Zhou",
      "Davide Mottin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2403.05076",
    "title": "Correlation analysis technique of key parameters for transformer  material inspection based on FP-tree and knowledge graph",
    "abstract": "As one of the key equipment in the distribution system, the distribution transformer directly affects the reliability of the user power supply. The probability of accidents occurring in the operation of transformer equipment is high, so it has become a focus of material inspection in recent years. However, the large amount of raw data from sample testing is not being used effectively. Given the above problems, this paper aims to mine the relationship between the unqualified distribution transformer inspection items by using the association rule algorithm based on the distribution transformer inspection data collected from 2017 to 2021 and sorting out the key inspection items. At the same time, the unqualified judgment basis of the relevant items is given, and the internal relationship between the inspection items is clarified to a certain extent. Furthermore, based on material and equipment inspection reports, correlations between failed inspection items, and expert knowledge, the knowledge graph of material equipment inspection management is constructed in the graph database Neo4j. The experimental results show that the FP-Growth method performs significantly better than the Apriori method and can accurately assess the relationship between failed distribution transformer inspection items. Finally, the knowledge graph network is visualized to provide a systematic knowledge base for material inspection, which is convenient for knowledge query and management. This method can provide a scientific guidance program for operation and maintenance personnel to do equipment maintenance and also offers a reference for the state evaluation of other high-voltage equipment. ",
    "url": "https://arxiv.org/abs/2403.05076",
    "authors": [
      "Jing Xu",
      "Yongbo Zhang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.05081",
    "title": "Integrating Predictive Motion Uncertainties with Distributionally Robust  Risk-Aware Control for Safe Robot Navigation in Crowds",
    "abstract": "Ensuring safe navigation in human-populated environments is crucial for autonomous mobile robots. Although recent advances in machine learning offer promising methods to predict human trajectories in crowded areas, it remains unclear how one can safely incorporate these learned models into a control loop due to the uncertain nature of human motion, which can make predictions of these models imprecise. In this work, we address this challenge and introduce a distributionally robust chance-constrained model predictive control (DRCC-MPC) which: (i) adopts a probability of collision as a pre-specified, interpretable risk metric, and (ii) offers robustness against discrepancies between actual human trajectories and their predictions. We consider the risk of collision in the form of a chance constraint, providing an interpretable measure of robot safety. To enable real-time evaluation of chance constraints, we consider conservative approximations of chance constraints in the form of distributionally robust Conditional Value at Risk constraints. The resulting formulation offers computational efficiency as well as robustness with respect to out-of-distribution human motion. With the parallelization of a sampling-based optimization technique, our method operates in real-time, demonstrating successful and safe navigation in a number of case studies with real-world pedestrian data. ",
    "url": "https://arxiv.org/abs/2403.05081",
    "authors": [
      "Kanghyun Ryu",
      "Negar Mehr"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.05100",
    "title": "Exploring the Adversarial Frontier: Quantifying Robustness via  Adversarial Hypervolume",
    "abstract": "The escalating threat of adversarial attacks on deep learning models, particularly in security-critical fields, has underscored the need for robust deep learning systems. Conventional robustness evaluations have relied on adversarial accuracy, which measures a model's performance under a specific perturbation intensity. However, this singular metric does not fully encapsulate the overall resilience of a model against varying degrees of perturbation. To address this gap, we propose a new metric termed adversarial hypervolume, assessing the robustness of deep learning models comprehensively over a range of perturbation intensities from a multi-objective optimization standpoint. This metric allows for an in-depth comparison of defense mechanisms and recognizes the trivial improvements in robustness afforded by less potent defensive strategies. Additionally, we adopt a novel training algorithm that enhances adversarial robustness uniformly across various perturbation intensities, in contrast to methods narrowly focused on optimizing adversarial accuracy. Our extensive empirical studies validate the effectiveness of the adversarial hypervolume metric, demonstrating its ability to reveal subtle differences in robustness that adversarial accuracy overlooks. This research contributes a new measure of robustness and establishes a standard for assessing and benchmarking the resilience of current and future defensive models against adversarial threats. ",
    "url": "https://arxiv.org/abs/2403.05100",
    "authors": [
      "Ping Guo",
      "Cheng Gong",
      "Xi Lin",
      "Zhiyuan Yang",
      "Qingfu Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.05105",
    "title": "Learning to Rematch Mismatched Pairs for Robust Cross-Modal Retrieval",
    "abstract": "Collecting well-matched multimedia datasets is crucial for training cross-modal retrieval models. However, in real-world scenarios, massive multimodal data are harvested from the Internet, which inevitably contains Partially Mismatched Pairs (PMPs). Undoubtedly, such semantical irrelevant data will remarkably harm the cross-modal retrieval performance. Previous efforts tend to mitigate this problem by estimating a soft correspondence to down-weight the contribution of PMPs. In this paper, we aim to address this challenge from a new perspective: the potential semantic similarity among unpaired samples makes it possible to excavate useful knowledge from mismatched pairs. To achieve this, we propose L2RM, a general framework based on Optimal Transport (OT) that learns to rematch mismatched pairs. In detail, L2RM aims to generate refined alignments by seeking a minimal-cost transport plan across different modalities. To formalize the rematching idea in OT, first, we propose a self-supervised cost function that automatically learns from explicit similarity-cost mapping relation. Second, we present to model a partial OT problem while restricting the transport among false positives to further boost refined alignments. Extensive experiments on three benchmarks demonstrate our L2RM significantly improves the robustness against PMPs for existing models. The code is available at https://github.com/hhc1997/L2RM. ",
    "url": "https://arxiv.org/abs/2403.05105",
    "authors": [
      "Haochen Han",
      "Qinghua Zheng",
      "Guang Dai",
      "Minnan Luo",
      "Jingdong Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2403.05106",
    "title": "Simulating Battery-Powered TinyML Systems Optimised using Reinforcement  Learning in Image-Based Anomaly Detection",
    "abstract": "Advances in Tiny Machine Learning (TinyML) have bolstered the creation of smart industry solutions, including smart agriculture, healthcare and smart cities. Whilst related research contributes to enabling TinyML solutions on constrained hardware, there is a need to amplify real-world applications by optimising energy consumption in battery-powered systems. The work presented extends and contributes to TinyML research by optimising battery-powered image-based anomaly detection Internet of Things (IoT) systems. Whilst previous work in this area has yielded the capabilities of on-device inferencing and training, there has yet to be an investigation into optimising the management of such capabilities using machine learning approaches, such as Reinforcement Learning (RL), to improve the deployment battery life of such systems. Using modelled simulations, the battery life effects of an RL algorithm are benchmarked against static and dynamic optimisation approaches, with the foundation laid for a hardware benchmark to follow. It is shown that using RL within a TinyML-enabled IoT system to optimise the system operations, including cloud anomaly processing and on-device training, yields an improved battery life of 22.86% and 10.86% compared to static and dynamic optimisation approaches respectively. The proposed solution can be deployed to resource-constrained hardware, given its low memory footprint of 800 B, which could be further reduced. This further facilitates the real-world deployment of such systems, including key sectors such as smart agriculture. ",
    "url": "https://arxiv.org/abs/2403.05106",
    "authors": [
      "Jared M. Ping",
      "Ken J. Nixon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.05112",
    "title": "RLPeri: Accelerating Visual Perimetry Test with Reinforcement Learning  and Convolutional Feature Extraction",
    "abstract": "Visual perimetry is an important eye examination that helps detect vision problems caused by ocular or neurological conditions. During the test, a patient's gaze is fixed at a specific location while light stimuli of varying intensities are presented in central and peripheral vision. Based on the patient's responses to the stimuli, the visual field mapping and sensitivity are determined. However, maintaining high levels of concentration throughout the test can be challenging for patients, leading to increased examination times and decreased accuracy. In this work, we present RLPeri, a reinforcement learning-based approach to optimize visual perimetry testing. By determining the optimal sequence of locations and initial stimulus values, we aim to reduce the examination time without compromising accuracy. Additionally, we incorporate reward shaping techniques to further improve the testing performance. To monitor the patient's responses over time during testing, we represent the test's state as a pair of 3D matrices. We apply two different convolutional kernels to extract spatial features across locations as well as features across different stimulus values for each location. Through experiments, we demonstrate that our approach results in a 10-20% reduction in examination time while maintaining the accuracy as compared to state-of-the-art methods. With the presented approach, we aim to make visual perimetry testing more efficient and patient-friendly, while still providing accurate results. ",
    "url": "https://arxiv.org/abs/2403.05112",
    "authors": [
      "Tanvi Verma",
      "Linh Le Dinh",
      "Nicholas Tan",
      "Xinxing Xu",
      "Chingyu Cheng",
      "Yong Liu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05114",
    "title": "APPLE: Adversarial Privacy-aware Perturbations on Latent Embedding for  Unfairness Mitigation",
    "abstract": "Ensuring fairness in deep-learning-based segmentors is crucial for health equity. Much effort has been dedicated to mitigating unfairness in the training datasets or procedures. However, with the increasing prevalence of foundation models in medical image analysis, it is hard to train fair models from scratch while preserving utility. In this paper, we propose a novel method, Adversarial Privacy-aware Perturbations on Latent Embedding (APPLE), that can improve the fairness of deployed segmentors by introducing a small latent feature perturber without updating the weights of the original model. By adding perturbation to the latent vector, APPLE decorates the latent vector of segmentors such that no fairness-related features can be passed to the decoder of the segmentors while preserving the architecture and parameters of the segmentor. Experiments on two segmentation datasets and five segmentors (three U-Net-like and two SAM-like) illustrate the effectiveness of our proposed method compared to several unfairness mitigation methods. ",
    "url": "https://arxiv.org/abs/2403.05114",
    "authors": [
      "Zikang Xu",
      "Fenghe Tang",
      "Quan Quan",
      "Qingsong Yao",
      "S. Kevin Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05117",
    "title": "Arbitrary-Scale Point Cloud Upsampling by Voxel-Based Network with  Latent Geometric-Consistent Learning",
    "abstract": "Recently, arbitrary-scale point cloud upsampling mechanism became increasingly popular due to its efficiency and convenience for practical applications. To achieve this, most previous approaches formulate it as a problem of surface approximation and employ point-based networks to learn surface representations. However, learning surfaces from sparse point clouds is more challenging, and thus they often suffer from the low-fidelity geometry approximation. To address it, we propose an arbitrary-scale Point cloud Upsampling framework using Voxel-based Network (\\textbf{PU-VoxelNet}). Thanks to the completeness and regularity inherited from the voxel representation, voxel-based networks are capable of providing predefined grid space to approximate 3D surface, and an arbitrary number of points can be reconstructed according to the predicted density distribution within each grid cell. However, we investigate the inaccurate grid sampling caused by imprecise density predictions. To address this issue, a density-guided grid resampling method is developed to generate high-fidelity points while effectively avoiding sampling outliers. Further, to improve the fine-grained details, we present an auxiliary training supervision to enforce the latent geometric consistency among local surface patches. Extensive experiments indicate the proposed approach outperforms the state-of-the-art approaches not only in terms of fixed upsampling rates but also for arbitrary-scale upsampling. ",
    "url": "https://arxiv.org/abs/2403.05117",
    "authors": [
      "Hang Du",
      "Xuejun Yan",
      "Jingjing Wang",
      "Di Xie",
      "Shiliang Pu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05122",
    "title": "Multi-Tower Multi-Interest Recommendation with User Representation Repel",
    "abstract": "In the era of information overload, the value of recommender systems has been profoundly recognized in academia and industry alike. Multi-interest sequential recommendation, in particular, is a subfield that has been receiving increasing attention in recent years. By generating multiple-user representations, multi-interest learning models demonstrate superior expressiveness than single-user representation models, both theoretically and empirically. Despite major advancements in the field, three major issues continue to plague the performance and adoptability of multi-interest learning methods, the difference between training and deployment objectives, the inability to access item information, and the difficulty of industrial adoption due to its single-tower architecture. We address these challenges by proposing a novel multi-tower multi-interest framework with user representation repel. Experimental results across multiple large-scale industrial datasets proved the effectiveness and generalizability of our proposed framework. ",
    "url": "https://arxiv.org/abs/2403.05122",
    "authors": [
      "Tianyu Xiong",
      "Xiaohan Yu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.05123",
    "title": "ECToNAS: Evolutionary Cross-Topology Neural Architecture Search",
    "abstract": "We present ECToNAS, a cost-efficient evolutionary cross-topology neural architecture search algorithm that does not require any pre-trained meta controllers. Our framework is able to select suitable network architectures for different tasks and hyperparameter settings, independently performing cross-topology optimisation where required. It is a hybrid approach that fuses training and topology optimisation together into one lightweight, resource-friendly process. We demonstrate the validity and power of this approach with six standard data sets (CIFAR-10, CIFAR-100, EuroSAT, Fashion MNIST, MNIST, SVHN), showcasing the algorithm's ability to not only optimise the topology within an architectural type, but also to dynamically add and remove convolutional cells when and where required, thus crossing boundaries between different network types. This enables researchers without a background in machine learning to make use of appropriate model types and topologies and to apply machine learning methods in their domains, with a computationally cheap, easy-to-use cross-topology neural architecture search framework that fully encapsulates the topology optimisation within the training process. ",
    "url": "https://arxiv.org/abs/2403.05123",
    "authors": [
      "Elisabeth J. Schiessler",
      "Roland C. Aydin",
      "Christian J. Cyron"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2403.05130",
    "title": "From Chain to Tree: Refining Chain-like Rules into Tree-like Rules on  Knowledge Graphs",
    "abstract": "With good explanatory power and controllability, rule-based methods play an important role in many tasks such as knowledge reasoning and decision support. However, existing studies primarily focused on learning chain-like rules, which limit their semantic expressions and accurate prediction abilities. As a result, chain-like rules usually fire on the incorrect grounding values, producing inaccurate or even erroneous reasoning results. In this paper, we propose the concept of tree-like rules on knowledge graphs to expand the application scope and improve the reasoning ability of rule-based methods. Meanwhile, we propose an effective framework for refining chain-like rules into tree-like rules. Experimental comparisons on four public datasets show that the proposed framework can easily adapt to other chain-like rule induction methods and the refined tree-like rules consistently achieve better performances than chain-like rules on link prediction. The data and code of this paper can be available at https://anonymous.4open.science/r/tree-rule-E3CD/. ",
    "url": "https://arxiv.org/abs/2403.05130",
    "authors": [
      "Wangtao Sun",
      "Shizhu He",
      "Jun Zhao",
      "Kang Liu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05155",
    "title": "LanePtrNet: Revisiting Lane Detection as Point Voting and Grouping on  Curves",
    "abstract": "Lane detection plays a critical role in the field of autonomous driving. Prevailing methods generally adopt basic concepts (anchors, key points, etc.) from object detection and segmentation tasks, while these approaches require manual adjustments for curved objects, involve exhaustive searches on predefined anchors, require complex post-processing steps, and may lack flexibility when applied to real-world scenarios.In this paper, we propose a novel approach, LanePtrNet, which treats lane detection as a process of point voting and grouping on ordered sets: Our method takes backbone features as input and predicts a curve-aware centerness, which represents each lane as a point and assigns the most probable center point to it. A novel point sampling method is proposed to generate a set of candidate points based on the votes received. By leveraging features from local neighborhoods, and cross-instance attention score, we design a grouping module that further performs lane-wise clustering between neighboring and seeding points. Furthermore, our method can accommodate a point-based framework, (PointNet++ series, etc.) as an alternative to the backbone. This flexibility enables effortless extension to 3D lane detection tasks. We conduct comprehensive experiments to validate the effectiveness of our proposed approach, demonstrating its superior performance. ",
    "url": "https://arxiv.org/abs/2403.05155",
    "authors": [
      "Jiayan Cao",
      "Xueyu Zhu",
      "Cheng Qian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05156",
    "title": "On Protecting the Data Privacy of Large Language Models (LLMs): A Survey",
    "abstract": "Large language models (LLMs) are complex artificial intelligence systems capable of understanding, generating and translating human language. They learn language patterns by analyzing large amounts of text data, allowing them to perform writing, conversation, summarizing and other language tasks. When LLMs process and generate large amounts of data, there is a risk of leaking sensitive information, which may threaten data privacy. This paper concentrates on elucidating the data privacy concerns associated with LLMs to foster a comprehensive understanding. Specifically, a thorough investigation is undertaken to delineate the spectrum of data privacy threats, encompassing both passive privacy leakage and active privacy attacks within LLMs. Subsequently, we conduct an assessment of the privacy protection mechanisms employed by LLMs at various stages, followed by a detailed examination of their efficacy and constraints. Finally, the discourse extends to delineate the challenges encountered and outline prospective directions for advancement in the realm of LLM privacy protection. ",
    "url": "https://arxiv.org/abs/2403.05156",
    "authors": [
      "Biwei Yan",
      "Kun Li",
      "Minghui Xu",
      "Yueyan Dong",
      "Yue Zhang",
      "Zhaochun Ren",
      "Xiuzheng Cheng"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.05158",
    "title": "Adaptive Split Learning over Energy-Constrained Wireless Edge Networks",
    "abstract": "Split learning (SL) is a promising approach for training artificial intelligence (AI) models, in which devices collaborate with a server to train an AI model in a distributed manner, based on a same fixed split point. However, due to the device heterogeneity and variation of channel conditions, this way is not optimal in training delay and energy consumption. In this paper, we design an adaptive split learning (ASL) scheme which can dynamically select split points for devices and allocate computing resource for the server in wireless edge networks. We formulate an optimization problem to minimize the average training latency subject to long-term energy consumption constraint. The difficulties in solving this problem are the lack of future information and mixed integer programming (MIP). To solve it, we propose an online algorithm leveraging the Lyapunov theory, named OPEN, which decomposes it into a new MIP problem only with the current information. Then, a two-layer optimization method is proposed to solve the MIP problem. Extensive simulation results demonstrate that the ASL scheme can reduce the average training delay and energy consumption by 53.7% and 22.1%, respectively, as compared to the existing SL schemes. ",
    "url": "https://arxiv.org/abs/2403.05158",
    "authors": [
      "Zuguang Li",
      "Wen Wu",
      "Shaohua Wu",
      "Wei Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2403.05168",
    "title": "Unlocking the Potential of Multimodal Unified Discrete Representation  through Training-Free Codebook Optimization and Hierarchical Alignment",
    "abstract": "Recent advances in representation learning have demonstrated the significance of multimodal alignment. The Dual Cross-modal Information Disentanglement (DCID) model, utilizing a unified codebook, shows promising results in achieving fine-grained representation and cross-modal generalization. However, it is still hindered by equal treatment of all channels and neglect of minor event information, resulting in interference from irrelevant channels and limited performance in fine-grained tasks. Thus, in this work, We propose a Training-free Optimization of Codebook (TOC) method to enhance model performance by selecting important channels in the unified space without retraining. Additionally, we introduce the Hierarchical Dual Cross-modal Information Disentanglement (H-DCID) approach to extend information separation and alignment to two levels, capturing more cross-modal details. The experiment results demonstrate significant improvements across various downstream tasks, with TOC contributing to an average improvement of 1.70% for DCID on four tasks, and H-DCID surpassing DCID by an average of 3.64%. The combination of TOC and H-DCID further enhances performance, exceeding DCID by 4.43%. These findings highlight the effectiveness of our methods in facilitating robust and nuanced cross-modal learning, opening avenues for future enhancements. The source code and pre-trained models can be accessed at https://github.com/haihuangcode/TOC_H-DCID. ",
    "url": "https://arxiv.org/abs/2403.05168",
    "authors": [
      "Hai Huang",
      "Yan Xia",
      "Shengpeng Ji",
      "Shulei Wang",
      "Hanting Wang",
      "Jieming Zhu",
      "Zhenhua Dong",
      "Zhou Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05171",
    "title": "Overcoming Reward Overoptimization via Adversarial Policy Optimization  with Lightweight Uncertainty Estimation",
    "abstract": "We introduce Adversarial Policy Optimization (AdvPO), a novel solution to the pervasive issue of reward over-optimization in Reinforcement Learning from Human Feedback (RLHF) for Large Language Models (LLMs). Over-optimization occurs when a reward model serves as an imperfect proxy for human preference, and RL-driven policy optimization erroneously exploits reward inaccuracies. In this paper, we begin by introducing a lightweight way to quantify uncertainties in rewards, relying solely on the last layer embeddings of the reward model, without the need for computationally expensive reward ensembles. AdvPO then addresses a distributionally robust optimization problem centred around the confidence interval of the reward model's predictions for policy improvement. Through comprehensive experiments on the Anthropic HH and TL;DR summarization datasets, we illustrate the efficacy of AdvPO in mitigating the overoptimization issue, consequently resulting in enhanced performance as evaluated through human-assisted evaluation. ",
    "url": "https://arxiv.org/abs/2403.05171",
    "authors": [
      "Xiaoying Zhang",
      "Jean-Francois Ton",
      "Wei Shen",
      "Hongning Wang",
      "Yang Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05172",
    "title": "Learning Expressive And Generalizable Motion Features For Face Forgery  Detection",
    "abstract": "Previous face forgery detection methods mainly focus on appearance features, which may be easily attacked by sophisticated manipulation. Considering the majority of current face manipulation methods generate fake faces based on a single frame, which do not take frame consistency and coordination into consideration, artifacts on frame sequences are more effective for face forgery detection. However, current sequence-based face forgery detection methods use general video classification networks directly, which discard the special and discriminative motion information for face manipulation detection. To this end, we propose an effective sequence-based forgery detection framework based on an existing video classification method. To make the motion features more expressive for manipulation detection, we propose an alternative motion consistency block instead of the original motion features module. To make the learned features more generalizable, we propose an auxiliary anomaly detection block. With these two specially designed improvements, we make a general video classification network achieve promising results on three popular face forgery datasets. ",
    "url": "https://arxiv.org/abs/2403.05172",
    "authors": [
      "Jingyi Zhang",
      "Peng Zhang",
      "Jingjing Wang",
      "Di Xie",
      "Shiliang Pu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05179",
    "title": "Device Fault Prediction Model based on LSTM and Random Forest",
    "abstract": "The quality of power grid equipment forms the material foundation for the safety of the large power grid. Ensuring the quality of equipment entering the grid is a core task in material management. Currently, the inspection of incoming materials involves the generation of sampling plans, sampling, sealing, sample delivery, and testing. Due to the lack of a comprehensive control system and effective control measures, it is not possible to trace the execution process of business operations afterward. This inability to trace hampers the investigation of testing issues and risk control, as it lacks effective data support. Additionally, a significant amount of original record information for key parameters in the testing process, which is based on sampling operation standards, has not been effectively utilized. To address these issues, we conduct researches on key monitoring technologies in the typical material inspection process based on the Internet of Things (IoT) and analyze the key parameters in inspection results. For purpose of complete the above tasks, this paper investigates the use of Long Short-Term Memory (LSTM) algorithms for quality prediction in material equipment based on key inspection parameters. In summary, this paper aims to provide professional and reliable quality data support for various business processes within the company, including material procurement, engineering construction, and equipment operation. ",
    "url": "https://arxiv.org/abs/2403.05179",
    "authors": [
      "Jing Xu",
      "Yongbo Zhang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.05181",
    "title": "Adversarial Sparse Teacher: Defense Against Distillation-Based Model  Stealing Attacks Using Adversarial Examples",
    "abstract": "Knowledge Distillation (KD) facilitates the transfer of discriminative capabilities from an advanced teacher model to a simpler student model, ensuring performance enhancement without compromising accuracy. It is also exploited for model stealing attacks, where adversaries use KD to mimic the functionality of a teacher model. Recent developments in this domain have been influenced by the Stingy Teacher model, which provided empirical analysis showing that sparse outputs can significantly degrade the performance of student models. Addressing the risk of intellectual property leakage, our work introduces an approach to train a teacher model that inherently protects its logits, influenced by the Nasty Teacher concept. Differing from existing methods, we incorporate sparse outputs of adversarial examples with standard training data to strengthen the teacher's defense against student distillation. Our approach carefully reduces the relative entropy between the original and adversarially perturbed outputs, allowing the model to produce adversarial logits with minimal impact on overall performance. The source codes will be made publicly available soon. ",
    "url": "https://arxiv.org/abs/2403.05181",
    "authors": [
      "Eda Yilmaz",
      "Hacer Yalim Keles"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05185",
    "title": "Personalized Audiobook Recommendations at Spotify Through Graph Neural  Networks",
    "abstract": "In the ever-evolving digital audio landscape, Spotify, well-known for its music and talk content, has recently introduced audiobooks to its vast user base. While promising, this move presents significant challenges for personalized recommendations. Unlike music and podcasts, audiobooks, initially available for a fee, cannot be easily skimmed before purchase, posing higher stakes for the relevance of recommendations. Furthermore, introducing a new content type into an existing platform confronts extreme data sparsity, as most users are unfamiliar with this new content type. Lastly, recommending content to millions of users requires the model to react fast and be scalable. To address these challenges, we leverage podcast and music user preferences and introduce 2T-HGNN, a scalable recommendation system comprising Heterogeneous Graph Neural Networks (HGNNs) and a Two Tower (2T) model. This novel approach uncovers nuanced item relationships while ensuring low latency and complexity. We decouple users from the HGNN graph and propose an innovative multi-link neighbor sampler. These choices, together with the 2T component, significantly reduce the complexity of the HGNN model. Empirical evaluations involving millions of users show significant improvement in the quality of personalized recommendations, resulting in a +46% increase in new audiobooks start rate and a +23% boost in streaming rates. Intriguingly, our model's impact extends beyond audiobooks, benefiting established products like podcasts. ",
    "url": "https://arxiv.org/abs/2403.05185",
    "authors": [
      "Marco De Nadai",
      "Francesco Fabbri",
      "Paul Gigioli",
      "Alice Wang",
      "Ang Li",
      "Fabrizio Silvestri",
      "Laura Kim",
      "Shawn Lin",
      "Vladan Radosavljevic",
      "Sandeep Ghael",
      "David Nyhan",
      "Hugues Bouchard",
      "Mounia Lalmas-Roelleke",
      "Andreas Damianou"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.05196",
    "title": "Denoising Autoregressive Representation Learning",
    "abstract": "In this paper, we explore a new generative approach for learning visual representations. Our method, DARL, employs a decoder-only Transformer to predict image patches autoregressively. We find that training with Mean Squared Error (MSE) alone leads to strong representations. To enhance the image generation ability, we replace the MSE loss with the diffusion objective by using a denoising patch decoder. We show that the learned representation can be improved by using tailored noise schedules and longer training in larger models. Notably, the optimal schedule differs significantly from the typical ones used in standard image diffusion models. Overall, despite its simple architecture, DARL delivers performance remarkably close to state-of-the-art masked prediction models under the fine-tuning protocol. This marks an important step towards a unified model capable of both visual perception and generation, effectively combining the strengths of autoregressive and denoising diffusion models. ",
    "url": "https://arxiv.org/abs/2403.05196",
    "authors": [
      "Yazhe Li",
      "Jorg Bornschein",
      "Ting Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05211",
    "title": "Improving the Successful Robotic Grasp Detection Using Convolutional  Neural Networks",
    "abstract": "Robotic grasp should be carried out in a real-time manner by proper accuracy. Perception is the first and significant step in this procedure. This paper proposes an improved pipeline model trying to detect grasp as a rectangle representation for different seen or unseen objects. It helps the robot to start control procedures from nearer to the proper part of the object. The main idea consists in pre-processing, output normalization, and data augmentation to improve accuracy by 4.3 percent without making the system slow. Also, a comparison has been conducted over different pre-trained models like AlexNet, ResNet, Vgg19, which are the most famous feature extractors for image processing in object detection. Although AlexNet has less complexity than other ones, it outperformed them, which helps the real-time property. ",
    "url": "https://arxiv.org/abs/2403.05211",
    "authors": [
      "Hamed Hosseini",
      "Mehdi Tale Masouleh",
      "Ahmad Kalhor"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05216",
    "title": "SocialPET: Socially Informed Pattern Exploiting Training for Few-Shot  Stance Detection in Social Media",
    "abstract": "Stance detection, as the task of determining the viewpoint of a social media post towards a target as 'favor' or 'against', has been understudied in the challenging yet realistic scenario where there is limited labeled data for a certain target. Our work advances research in few-shot stance detection by introducing SocialPET, a socially informed approach to leveraging language models for the task. Our proposed approach builds on the Pattern Exploiting Training (PET) technique, which addresses classification tasks as cloze questions through the use of language models. To enhance the approach with social awareness, we exploit the social network structure surrounding social media posts. We prove the effectiveness of SocialPET on two stance datasets, Multi-target and P-Stance, outperforming competitive stance detection models as well as the base model, PET, where the labeled instances for the target under study is as few as 100. When we delve into the results, we observe that SocialPET is comparatively strong in identifying instances of the `against' class, where baseline models underperform. ",
    "url": "https://arxiv.org/abs/2403.05216",
    "authors": [
      "Parisa Jamadi Khiabani",
      "Arkaitz Zubiaga"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.05218",
    "title": "3D Face Reconstruction Using A Spectral-Based Graph Convolution Encoder",
    "abstract": "Monocular 3D face reconstruction plays a crucial role in avatar generation, with significant demand in web-related applications such as generating virtual financial advisors in FinTech. Current reconstruction methods predominantly rely on deep learning techniques and employ 2D self-supervision as a means to guide model learning. However, these methods encounter challenges in capturing the comprehensive 3D structural information of the face due to the utilization of 2D images for model training purposes. To overcome this limitation and enhance the reconstruction of 3D structural features, we propose an innovative approach that integrates existing 2D features with 3D features to guide the model learning process. Specifically, we introduce the 3D-ID Loss, which leverages the high-dimensional structure features extracted from a Spectral-Based Graph Convolution Encoder applied to the facial mesh. This approach surpasses the sole reliance on the 3D information provided by the facial mesh vertices coordinates. Our model is trained using 2D-3D data pairs from a combination of datasets and achieves state-of-the-art performance on the NoW benchmark. ",
    "url": "https://arxiv.org/abs/2403.05218",
    "authors": [
      "Haoxin Xu",
      "Zezheng Zhao",
      "Yuxin Cao",
      "Chunyu Chen",
      "Hao Ge",
      "Ziyao Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05220",
    "title": "Synthetic Privileged Information Enhances Medical Image Representation  Learning",
    "abstract": "Multimodal self-supervised representation learning has consistently proven to be a highly effective method in medical image analysis, offering strong task performance and producing biologically informed insights. However, these methods heavily rely on large, paired datasets, which is prohibitive for their use in scenarios where paired data does not exist, or there is only a small amount available. In contrast, image generation methods can work well on very small datasets, and can find mappings between unpaired datasets, meaning an effectively unlimited amount of paired synthetic data can be generated. In this work, we demonstrate that representation learning can be significantly improved by synthetically generating paired information, both compared to training on either single-modality (up to 4.4x error reduction) or authentic multi-modal paired datasets (up to 5.6x error reduction). ",
    "url": "https://arxiv.org/abs/2403.05220",
    "authors": [
      "Lucas Farndale",
      "Chris Walsh",
      "Robert Insall",
      "Ke Yuan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Tissues and Organs (q-bio.TO)"
    ]
  },
  {
    "id": "arXiv:2403.05229",
    "title": "Developing Federated Time-to-Event Scores Using Heterogeneous Real-World  Survival Data",
    "abstract": "Survival analysis serves as a fundamental component in numerous healthcare applications, where the determination of the time to specific events (such as the onset of a certain disease or death) for patients is crucial for clinical decision-making. Scoring systems are widely used for swift and efficient risk prediction. However, existing methods for constructing survival scores presume that data originates from a single source, posing privacy challenges in collaborations with multiple data owners. We propose a novel framework for building federated scoring systems for multi-site survival outcomes, ensuring both privacy and communication efficiency. We applied our approach to sites with heterogeneous survival data originating from emergency departments in Singapore and the United States. Additionally, we independently developed local scores at each site. In testing datasets from each participant site, our proposed federated scoring system consistently outperformed all local models, evidenced by higher integrated area under the receiver operating characteristic curve (iAUC) values, with a maximum improvement of 11.6%. Additionally, the federated score's time-dependent AUC(t) values showed advantages over local scores, exhibiting narrower confidence intervals (CIs) across most time points. The model developed through our proposed method exhibits effective performance on each local site, signifying noteworthy implications for healthcare research. Sites participating in our proposed federated scoring model training gained benefits by acquiring survival models with enhanced prediction accuracy and efficiency. This study demonstrates the effectiveness of our privacy-preserving federated survival score generation framework and its applicability to real-world heterogeneous survival data. ",
    "url": "https://arxiv.org/abs/2403.05229",
    "authors": [
      "Siqi Li",
      "Yuqing Shang",
      "Ziwen Wang",
      "Qiming Wu",
      "Chuan Hong",
      "Yilin Ning",
      "Di Miao",
      "Marcus Eng Hock Ong",
      "Bibhas Chakraborty",
      "Nan Liu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05247",
    "title": "Hide in Thicket: Generating Imperceptible and Rational Adversarial  Perturbations on 3D Point Clouds",
    "abstract": "Adversarial attack methods based on point manipulation for 3D point cloud classification have revealed the fragility of 3D models, yet the adversarial examples they produce are easily perceived or defended against. The trade-off between the imperceptibility and adversarial strength leads most point attack methods to inevitably introduce easily detectable outlier points upon a successful attack. Another promising strategy, shape-based attack, can effectively eliminate outliers, but existing methods often suffer significant reductions in imperceptibility due to irrational deformations. We find that concealing deformation perturbations in areas insensitive to human eyes can achieve a better trade-off between imperceptibility and adversarial strength, specifically in parts of the object surface that are complex and exhibit drastic curvature changes. Therefore, we propose a novel shape-based adversarial attack method, HiT-ADV, which initially conducts a two-stage search for attack regions based on saliency and imperceptibility scores, and then adds deformation perturbations in each attack region using Gaussian kernel functions. Additionally, HiT-ADV is extendable to physical attack. We propose that by employing benign resampling and benign rigid transformations, we can further enhance physical adversarial strength with little sacrifice to imperceptibility. Extensive experiments have validated the superiority of our method in terms of adversarial and imperceptible properties in both digital and physical spaces. Our code is avaliable at: https://github.com/TRLou/HiT-ADV. ",
    "url": "https://arxiv.org/abs/2403.05247",
    "authors": [
      "Tianrui Lou",
      "Xiaojun Jia",
      "Jindong Gu",
      "Li Liu",
      "Siyuan Liang",
      "Bangyan He",
      "Xiaochun Cao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2403.05257",
    "title": "Cross-lingual Transfer or Machine Translation? On Data Augmentation for  Monolingual Semantic Textual Similarity",
    "abstract": "Learning better sentence embeddings leads to improved performance for natural language understanding tasks including semantic textual similarity (STS) and natural language inference (NLI). As prior studies leverage large-scale labeled NLI datasets for fine-tuning masked language models to yield sentence embeddings, task performance for languages other than English is often left behind. In this study, we directly compared two data augmentation techniques as potential solutions for monolingual STS: (a) cross-lingual transfer that exploits English resources alone as training data to yield non-English sentence embeddings as zero-shot inference, and (b) machine translation that coverts English data into pseudo non-English training data in advance. In our experiments on monolingual STS in Japanese and Korean, we find that the two data techniques yield performance on par. Rather, we find a superiority of the Wikipedia domain over the NLI domain for these languages, in contrast to prior studies that focused on NLI as training data. Combining our findings, we demonstrate that the cross-lingual transfer of Wikipedia data exhibits improved performance, and that native Wikipedia data can further improve performance for monolingual STS. ",
    "url": "https://arxiv.org/abs/2403.05257",
    "authors": [
      "Sho Hoshino",
      "Akihiko Kato",
      "Soichiro Murakami",
      "Peinan Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.05260",
    "title": "Predicting Single-cell Drug Sensitivity by Adaptive Weighted Feature for  Adversarial Multi-source Domain Adaptation",
    "abstract": "The development of single-cell sequencing technology had promoted the generation of a large amount of single-cell transcriptional profiles, providing valuable opportunities to explore drug-resistant cell subpopulations in a tumor. However, the drug sensitivity data in single-cell level is still scarce to date, pressing an urgent and highly challenging task for computational prediction of the drug sensitivity to individual cells. This paper proposed scAdaDrug, a multi-source adaptive weighting model to predict single-cell drug sensitivity. We used an autoencoder to extract domain-invariant features related to drug sensitivity from multiple source domains by exploiting adversarial domain adaptation. Especially, we introduced an adaptive weight generator to produce importance-aware and mutual independent weights, which could adaptively modulate the embedding of each sample in dimension-level for both source and target domains. Extensive experimental results showed that our model achieved state-of-the-art performance in predicting drug sensitivity on sinle-cell datasets, as well as on cell line and patient datasets. ",
    "url": "https://arxiv.org/abs/2403.05260",
    "authors": [
      "Wei Duan",
      "Hui Liu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05265",
    "title": "MMoE: Robust Spoiler Detection with Multi-modal Information and  Domain-aware Mixture-of-Experts",
    "abstract": "Online movie review websites are valuable for information and discussion about movies. However, the massive spoiler reviews detract from the movie-watching experience, making spoiler detection an important task. Previous methods simply focus on reviews' text content, ignoring the heterogeneity of information in the platform. For instance, the metadata and the corresponding user's information of a review could be helpful. Besides, the spoiler language of movie reviews tends to be genre-specific, thus posing a domain generalization challenge for existing methods. To this end, we propose MMoE, a multi-modal network that utilizes information from multiple modalities to facilitate robust spoiler detection and adopts Mixture-of-Experts to enhance domain generalization. MMoE first extracts graph, text, and meta feature from the user-movie network, the review's textual content, and the review's metadata respectively. To handle genre-specific spoilers, we then adopt Mixture-of-Experts architecture to process information in three modalities to promote robustness. Finally, we use an expert fusion layer to integrate the features from different perspectives and make predictions based on the fused embedding. Experiments demonstrate that MMoE achieves state-of-the-art performance on two widely-used spoiler detection datasets, surpassing previous SOTA methods by 2.56\\% and 8.41\\% in terms of accuracy and F1-score. Further experiments also demonstrate MMoE's superiority in robustness and generalization. ",
    "url": "https://arxiv.org/abs/2403.05265",
    "authors": [
      "Zinan Zeng",
      "Sen Ye",
      "Zijian Cai",
      "Heng Wang",
      "Yuhan Liu",
      "Qinghua Zheng",
      "Minnan Luo"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05268",
    "title": "Deep Prompt Multi-task Network for Abuse Language Detection",
    "abstract": "The detection of abusive language remains a long-standing challenge with the extensive use of social networks. The detection task of abusive language suffers from limited accuracy. We argue that the existing detection methods utilize the fine-tuning technique of the pre-trained language models (PLMs) to handle downstream tasks. Hence, these methods fail to stimulate the general knowledge of the PLMs. To address the problem, we propose a novel Deep Prompt Multi-task Network (DPMN) for abuse language detection. Specifically, DPMN first attempts to design two forms of deep prompt tuning and light prompt tuning for the PLMs. The effects of different prompt lengths, tuning strategies, and prompt initialization methods on detecting abusive language are studied. In addition, we propose a Task Head based on Bi-LSTM and FFN, which can be used as a short text classifier. Eventually, DPMN utilizes multi-task learning to improve detection metrics further. The multi-task network has the function of transferring effective knowledge. The proposed DPMN is evaluated against eight typical methods on three public datasets: OLID, SOLID, and AbuseAnalyzer. The experimental results show that our DPMN outperforms the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2403.05268",
    "authors": [
      "Jian Zhu",
      "Yuping Ruan",
      "Jingfei Chang",
      "Cheng Luo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.05272",
    "title": "Engineering consensus in static networks with unknown disruptors",
    "abstract": "Distributed control increases system scalability, flexibility, and redundancy. Foundational to such decentralisation is consensus formation, by which decision-making and coordination are achieved. However, decentralised multi-agent systems are inherently vulnerable to disruption. To develop a resilient consensus approach, inspiration is taken from the study of social systems and their dynamics; specifically, the Deffuant Model. A dynamic algorithm is presented enabling efficient consensus to be reached with an unknown number of disruptors present within a multi-agent system. By inverting typical social tolerance, agents filter out extremist non-standard opinions that would drive them away from consensus. This approach allows distributed systems to deal with unknown disruptions, without knowledge of the network topology or the numbers and behaviours of the disruptors. A disruptor-agnostic algorithm is particularly suitable to real-world applications where this information is typically unknown. Faster and tighter convergence can be achieved across a range of scenarios with the social dynamics inspired algorithm, compared with standard Mean-Subsequence-Reduced-type methods. ",
    "url": "https://arxiv.org/abs/2403.05272",
    "authors": [
      "Agathe Bouis",
      "Christopher Lowe",
      "Ruaridh A. Clark",
      "Malcolm Macdonald"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2403.05277",
    "title": "ADROIT6G DAI-driven Open and Programmable Architecture for 6G Networks",
    "abstract": "In the upcoming 6G era, mobile networks must deal with more challenging applications (e.g., holographic telepresence and immersive communication) and meet far more stringent application requirements stemming along the edge-cloud continuum. These new applications will create an elevated level of expectations on performance, reliability, ubiquity, trustworthiness, security, openness, and sustainability, pushing the boundaries of innovation and driving transformational change across the architecture of future mobile networks. Towards this end, ADROIT6G proposes a set of disruptive innovations with a clear vision on setting a 6G network architecture that can be tailored to the requirements of innovative applications and match the ambitious KPIs set for 6G networks. More specifically, the key transformations that ADROIT6G considers essential to 6G network evolution are: i) AI/ML-powered optimisations across the network, exploring solutions in the \"Distributed Artificial Intelligence (DAI)\" domain for high performance and automation; ii) Transforming to fully cloud-native network software, which can be implemented across various edge-cloud platforms, with security built integrally into the network user plan; and iii) Software driven, zero-touch operations and ultimately automation of every aspect of the network and the services it delivers. ",
    "url": "https://arxiv.org/abs/2403.05277",
    "authors": [
      "Christophoros Christophorou",
      "Iacovos Ioannou",
      "Vasos Vassiliou",
      "Loizos Christofi",
      "John S Vardakas",
      "Erin E Seder",
      "Carla Fabiana Chiasserini",
      "Marius Iordache",
      "Chaouki Ben Issaid",
      "Ioannis Markopoulos",
      "Giulio Franzese",
      "Tanel Järvet",
      "Christos Verikoukis"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2403.05286",
    "title": "LLM4Decompile: Decompiling Binary Code with Large Language Models",
    "abstract": "Decompilation aims to restore compiled code to human-readable source code, but struggles with details like names and structure. Large language models (LLMs) show promise for programming tasks, motivating their application to decompilation. However, there does not exist any open-source LLM for decompilation. Moreover, existing decompilation evaluation systems mainly consider token-level accuracy and largely ignore code executability, which is the most important feature of any program. Therefore, we release the first open-access decompilation LLMs ranging from 1B to 33B pre-trained on 4 billion tokens of C source code and the corresponding assembly code. The open-source LLMs can serve as baselines for further development in the field. To ensure practical program evaluation, we introduce Decompile-Eval, the first dataset that considers re-compilability and re-executability for decompilation. The benchmark emphasizes the importance of evaluating the decompilation model from the perspective of program semantics. Experiments indicate that our LLM4Decompile has demonstrated the capability to accurately decompile 21% of the assembly code, which achieves a 50% improvement over GPT-4. Our code, dataset, and models are released at https://github.com/albertan017/LLM4Decompile ",
    "url": "https://arxiv.org/abs/2403.05286",
    "authors": [
      "Hanzhuo Tan",
      "Qi Luo",
      "Jing Li",
      "Yuqun Zhang"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.05293",
    "title": "Leveraging Continuous Time to Understand Momentum When Training Diagonal  Linear Networks",
    "abstract": "In this work, we investigate the effect of momentum on the optimisation trajectory of gradient descent. We leverage a continuous-time approach in the analysis of momentum gradient descent with step size $\\gamma$ and momentum parameter $\\beta$ that allows us to identify an intrinsic quantity $\\lambda = \\frac{ \\gamma }{ (1 - \\beta)^2 }$ which uniquely defines the optimisation path and provides a simple acceleration rule. When training a $2$-layer diagonal linear network in an overparametrised regression setting, we characterise the recovered solution through an implicit regularisation problem. We then prove that small values of $\\lambda$ help to recover sparse solutions. Finally, we give similar but weaker results for stochastic momentum gradient descent. We provide numerical experiments which support our claims. ",
    "url": "https://arxiv.org/abs/2403.05293",
    "authors": [
      "Hristo Papazov",
      "Scott Pesme",
      "Nicolas Flammarion"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.05300",
    "title": "Unity by Diversity: Improved Representation Learning in Multimodal VAEs",
    "abstract": "Variational Autoencoders for multimodal data hold promise for many tasks in data analysis, such as representation learning, conditional generation, and imputation. Current architectures either share the encoder output, decoder input, or both across modalities to learn a shared representation. Such architectures impose hard constraints on the model. In this work, we show that a better latent representation can be obtained by replacing these hard constraints with a soft constraint. We propose a new mixture-of-experts prior, softly guiding each modality's latent representation towards a shared aggregate posterior. This approach results in a superior latent representation and allows each encoding to preserve information from its uncompressed original features better. In extensive experiments on multiple benchmark datasets and a challenging real-world neuroscience data set, we show improved learned latent representations and imputation of missing data modalities compared to existing methods. ",
    "url": "https://arxiv.org/abs/2403.05300",
    "authors": [
      "Thomas M. Sutter",
      "Yang Meng",
      "Norbert Fortin",
      "Julia E. Vogt",
      "Stephan Mandt"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05329",
    "title": "OccFusion: Depth Estimation Free Multi-sensor Fusion for 3D Occupancy  Prediction",
    "abstract": "3D occupancy prediction based on multi-sensor fusion, crucial for a reliable autonomous driving system, enables fine-grained understanding of 3D scenes. Previous fusion-based 3D occupancy predictions relied on depth estimation for processing 2D image features. However, depth estimation is an ill-posed problem, hindering the accuracy and robustness of these methods. Furthermore, fine-grained occupancy prediction demands extensive computational resources. We introduce OccFusion, a multi-modal fusion method free from depth estimation, and a corresponding point cloud sampling algorithm for dense integration of image features. Building on this, we propose an active training method and an active coarse to fine pipeline, enabling the model to adaptively learn more from complex samples and optimize predictions specifically for challenging areas such as small or overlapping objects. The active methods we propose can be naturally extended to any occupancy prediction model. Experiments on the OpenOccupancy benchmark show our method surpasses existing state-of-the-art (SOTA) multi-modal methods in IoU across all categories. Additionally, our model is more efficient during both the training and inference phases, requiring far fewer computational resources. Comprehensive ablation studies demonstrate the effectiveness of our proposed techniques. ",
    "url": "https://arxiv.org/abs/2403.05329",
    "authors": [
      "Ji Zhang",
      "Yiran Ding"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05344",
    "title": "Federated Learning Method for Preserving Privacy in Face Recognition  System",
    "abstract": "The state-of-the-art face recognition systems are typically trained on a single computer, utilizing extensive image datasets collected from various number of users. However, these datasets often contain sensitive personal information that users may hesitate to disclose. To address potential privacy concerns, we explore the application of federated learning, both with and without secure aggregators, in the context of both supervised and unsupervised face recognition systems. Federated learning facilitates the training of a shared model without necessitating the sharing of individual private data, achieving this by training models on decentralized edge devices housing the data. In our proposed system, each edge device independently trains its own model, which is subsequently transmitted either to a secure aggregator or directly to the central server. To introduce diverse data without the need for data transmission, we employ generative adversarial networks to generate imposter data at the edge. Following this, the secure aggregator or central server combines these individual models to construct a global model, which is then relayed back to the edge devices. Experimental findings based on the CelebA datasets reveal that employing federated learning in both supervised and unsupervised face recognition systems offers dual benefits. Firstly, it safeguards privacy since the original data remains on the edge devices. Secondly, the experimental results demonstrate that the aggregated model yields nearly identical performance compared to the individual models, particularly when the federated model does not utilize a secure aggregator. Hence, our results shed light on the practical challenges associated with privacy-preserving face image training, particularly in terms of the balance between privacy and accuracy. ",
    "url": "https://arxiv.org/abs/2403.05344",
    "authors": [
      "Enoch Solomon",
      "Abraham Woubie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05346",
    "title": "VLM-PL: Advanced Pseudo Labeling approach Class Incremental Object  Detection with Vision-Language Model",
    "abstract": "In the field of Class Incremental Object Detection (CIOD), creating models that can continuously learn like humans is a major challenge. Pseudo-labeling methods, although initially powerful, struggle with multi-scenario incremental learning due to their tendency to forget past knowledge. To overcome this, we introduce a new approach called Vision-Language Model assisted Pseudo-Labeling (VLM-PL). This technique uses Vision-Language Model (VLM) to verify the correctness of pseudo ground-truths (GTs) without requiring additional model training. VLM-PL starts by deriving pseudo GTs from a pre-trained detector. Then, we generate custom queries for each pseudo GT using carefully designed prompt templates that combine image and text features. This allows the VLM to classify the correctness through its responses. Furthermore, VLM-PL integrates refined pseudo and real GTs from upcoming training, effectively combining new and old knowledge. Extensive experiments conducted on the Pascal VOC and MS COCO datasets not only highlight VLM-PL's exceptional performance in multi-scenario but also illuminate its effectiveness in dual-scenario by achieving state-of-the-art results in both. ",
    "url": "https://arxiv.org/abs/2403.05346",
    "authors": [
      "Junsu Kim",
      "Yunhoe Ku",
      "Jihyeon Kim",
      "Junuk Cha",
      "Seungryul Baek"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05365",
    "title": "The Impact of Quantization on the Robustness of Transformer-based Text  Classifiers",
    "abstract": "Transformer-based models have made remarkable advancements in various NLP areas. Nevertheless, these models often exhibit vulnerabilities when confronted with adversarial attacks. In this paper, we explore the effect of quantization on the robustness of Transformer-based models. Quantization usually involves mapping a high-precision real number to a lower-precision value, aiming at reducing the size of the model at hand. To the best of our knowledge, this work is the first application of quantization on the robustness of NLP models. In our experiments, we evaluate the impact of quantization on BERT and DistilBERT models in text classification using SST-2, Emotion, and MR datasets. We also evaluate the performance of these models against TextFooler, PWWS, and PSO adversarial attacks. Our findings show that quantization significantly improves (by an average of 18.68%) the adversarial accuracy of the models. Furthermore, we compare the effect of quantization versus that of the adversarial training approach on robustness. Our experiments indicate that quantization increases the robustness of the model by 18.80% on average compared to adversarial training without imposing any extra computational overhead during training. Therefore, our results highlight the effectiveness of quantization in improving the robustness of NLP models. ",
    "url": "https://arxiv.org/abs/2403.05365",
    "authors": [
      "Seyed Parsa Neshaei",
      "Yasaman Boreshban",
      "Gholamreza Ghassem-Sani",
      "Seyed Abolghasem Mirroshandel"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.05378",
    "title": "Online Contention Resolution Schemes for Network Revenue Management and  Combinatorial Auctions",
    "abstract": "In the Network Revenue Management (NRM) problem, products composed of up to L resources are sold to stochastically arriving customers. We take a randomized rounding approach to NRM, motivated by developments in Online Contention Resolution Schemes (OCRS). The goal is to take a fractional solution to NRM that satisfies the resource constraints in expectation, and implement it in an online policy that satisfies the resource constraints in any state, while (approximately) preserving all of the sales that were prescribed by the fractional solution. OCRS cannot be naively applied to NRM or revenue management problems in general, because customer substitution induces a negative correlation in products being demanded. We start by deriving an OCRS that achieves a guarantee of 1/(1+L) for NRM with customer substitution, matching a common benchmark in the literature. We then show how to beat this benchmark for all integers L>1 assuming no substitution, i.e., in the standard OCRS setting. By contrast, we show that this benchmark is unbeatable using OCRS or any fractional relaxation if there is customer substitution, for all integers L that are the power of a prime number. Finally, we show how to beat 1/(1+L) even with customer substitution, if the products comprise one item from each of up to L groups. Our results have corresponding implications for Online Combinatorial Auctions, in which buyers bid for bundles of up to L items, and buyers being single-minded is akin to no substitution. Our final result also beats 1/(1+L) for Prophet Inequality on the intersection of L partition matroids. All in all, our paper provides a unifying framework for applying OCRS to these problems, delineating the impact of substitution, and establishing a separation between the guarantees achievable with vs. without substitution under general resource constraints parametrized by L. ",
    "url": "https://arxiv.org/abs/2403.05378",
    "authors": [
      "Will Ma",
      "Calum MacRury",
      "Jingwei Zhang"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2403.05379",
    "title": "Self-Supervised Multiple Instance Learning for Acute Myeloid Leukemia  Classification",
    "abstract": "Automated disease diagnosis using medical image analysis relies on deep learning, often requiring large labeled datasets for supervised model training. Diseases like Acute Myeloid Leukemia (AML) pose challenges due to scarce and costly annotations on a single-cell level. Multiple Instance Learning (MIL) addresses weakly labeled scenarios but necessitates powerful encoders typically trained with labeled data. In this study, we explore Self-Supervised Learning (SSL) as a pre-training approach for MIL-based AML subtype classification from blood smears, removing the need for labeled data during encoder training. We investigate the three state-of-the-art SSL methods SimCLR, SwAV, and DINO, and compare their performance against supervised pre-training. Our findings show that SSL-pretrained encoders achieve comparable performance, showcasing the potential of SSL in MIL. This breakthrough offers a cost-effective and data-efficient solution, propelling the field of AI-based disease diagnosis. ",
    "url": "https://arxiv.org/abs/2403.05379",
    "authors": [
      "Salome Kazeminia",
      "Max Joosten",
      "Dragan Bosnacki",
      "Carsten Marr"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05380",
    "title": "Spectrogram-Based Detection of Auto-Tuned Vocals in Music Recordings",
    "abstract": "In the domain of music production and audio processing, the implementation of automatic pitch correction of the singing voice, also known as Auto-Tune, has significantly transformed the landscape of vocal performance. While auto-tuning technology has offered musicians the ability to tune their vocal pitches and achieve a desired level of precision, its use has also sparked debates regarding its impact on authenticity and artistic integrity. As a result, detecting and analyzing Auto-Tuned vocals in music recordings has become essential for music scholars, producers, and listeners. However, to the best of our knowledge, no prior effort has been made in this direction. This study introduces a data-driven approach leveraging triplet networks for the detection of Auto-Tuned songs, backed by the creation of a dataset composed of original and Auto-Tuned audio clips. The experimental results demonstrate the superiority of the proposed method in both accuracy and robustness compared to Rawnet2, an end-to-end model proposed for anti-spoofing and widely used for other audio forensic tasks. ",
    "url": "https://arxiv.org/abs/2403.05380",
    "authors": [
      "Mahyar Gohari",
      "Paolo Bestagini",
      "Sergio Benini",
      "Nicola Adami"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2403.05381",
    "title": "Exploring Robust Features for Few-Shot Object Detection in Satellite  Imagery",
    "abstract": "The goal of this paper is to perform object detection in satellite imagery with only a few examples, thus enabling users to specify any object class with minimal annotation. To this end, we explore recent methods and ideas from open-vocabulary detection for the remote sensing domain. We develop a few-shot object detector based on a traditional two-stage architecture, where the classification block is replaced by a prototype-based classifier. A large-scale pre-trained model is used to build class-reference embeddings or prototypes, which are compared to region proposal contents for label prediction. In addition, we propose to fine-tune prototypes on available training images to boost performance and learn differences between similar classes, such as aircraft types. We perform extensive evaluations on two remote sensing datasets containing challenging and rare objects. Moreover, we study the performance of both visual and image-text features, namely DINOv2 and CLIP, including two CLIP models specifically tailored for remote sensing applications. Results indicate that visual features are largely superior to vision-language models, as the latter lack the necessary domain-specific vocabulary. Lastly, the developed detector outperforms fully supervised and few-shot methods evaluated on the SIMD and DIOR datasets, despite minimal training parameters. ",
    "url": "https://arxiv.org/abs/2403.05381",
    "authors": [
      "Xavier Bou",
      "Gabriele Facciolo",
      "Rafael Grompone von Gioi",
      "Jean-Michel Morel",
      "Thibaud Ehret"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05395",
    "title": "Recovery Guarantees of Unsupervised Neural Networks for Inverse Problems  trained with Gradient Descent",
    "abstract": "Advanced machine learning methods, and more prominently neural networks, have become standard to solve inverse problems over the last years. However, the theoretical recovery guarantees of such methods are still scarce and difficult to achieve. Only recently did unsupervised methods such as Deep Image Prior (DIP) get equipped with convergence and recovery guarantees for generic loss functions when trained through gradient flow with an appropriate initialization. In this paper, we extend these results by proving that these guarantees hold true when using gradient descent with an appropriately chosen step-size/learning rate. We also show that the discretization only affects the overparametrization bound for a two-layer DIP network by a constant and thus that the different guarantees found for the gradient flow will hold for gradient descent. ",
    "url": "https://arxiv.org/abs/2403.05395",
    "authors": [
      "Nathan Buskulic",
      "Jalal Fadili",
      "Yvain Quéau"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.05407",
    "title": "Algorithmic Identification of Essential Exogenous Nodes for Causal  Sufficiency in Brain Networks",
    "abstract": "In the investigation of any causal mechanisms, such as the brain's causal networks, the assumption of causal sufficiency plays a critical role. Notably, neglecting this assumption can result in significant errors, a fact that is often disregarded in the causal analysis of brain networks. In this study, we propose an algorithmic identification approach for determining essential exogenous nodes that satisfy the critical need for causal sufficiency to adhere to it in such inquiries. Our approach consists of three main steps: First, by capturing the essence of the Peter-Clark (PC) algorithm, we conduct independence tests for pairs of regions within a network, as well as for the same pairs conditioned on nodes from other networks. Next, we distinguish candidate confounders by analyzing the differences between the conditional and unconditional results, using the Kolmogorov-Smirnov test. Subsequently, we utilize Non-Factorized identifiable Variational Autoencoders (NF-iVAE) along with the Correlation Coefficient index (CCI) metric to identify the confounding variables within these candidate nodes. Applying our method to the Human Connectome Projects (HCP) movie-watching task data, we demonstrate that while interactions exist between dorsal and ventral regions, only dorsal regions serve as confounders for the visual networks, and vice versa. These findings align consistently with those resulting from the neuroscientific perspective. Finally, we show the reliability of our results by testing 30 independent runs for NF-iVAE initialization. ",
    "url": "https://arxiv.org/abs/2403.05407",
    "authors": [
      "Abdolmahdi Bagheri",
      "Mahdi Dehshiri",
      "Babak Nadjar Araabi",
      "Alireza Akhondi Asl"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05416",
    "title": "SIRST-5K: Exploring Massive Negatives Synthesis with Self-supervised  Learning for Robust Infrared Small Target Detection",
    "abstract": "Single-frame infrared small target (SIRST) detection aims to recognize small targets from clutter backgrounds. Recently, convolutional neural networks have achieved significant advantages in general object detection. With the development of Transformer, the scale of SIRST models is constantly increasing. Due to the limited training samples, performance has not been improved accordingly. The quality, quantity, and diversity of the infrared dataset are critical to the detection of small targets. To highlight this issue, we propose a negative sample augmentation method in this paper. Specifically, a negative augmentation approach is proposed to generate massive negatives for self-supervised learning. Firstly, we perform a sequential noise modeling technology to generate realistic infrared data. Secondly, we fuse the extracted noise with the original data to facilitate diversity and fidelity in the generated data. Lastly, we proposed a negative augmentation strategy to enrich diversity as well as maintain semantic invariance. The proposed algorithm produces a synthetic SIRST-5K dataset, which contains massive pseudo-data and corresponding labels. With a rich diversity of infrared small target data, our algorithm significantly improves the model performance and convergence speed. Compared with other state-of-the-art (SOTA) methods, our method achieves outstanding performance in terms of probability of detection (Pd), false-alarm rate (Fa), and intersection over union (IoU). ",
    "url": "https://arxiv.org/abs/2403.05416",
    "authors": [
      "Yahao Lu",
      "Yupei Lin",
      "Han Wu",
      "Xiaoyu Xian",
      "Yukai Shi",
      "Liang Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05422",
    "title": "EVD4UAV: An Altitude-Sensitive Benchmark to Evade Vehicle Detection in  UAV",
    "abstract": "Vehicle detection in Unmanned Aerial Vehicle (UAV) captured images has wide applications in aerial photography and remote sensing. There are many public benchmark datasets proposed for the vehicle detection and tracking in UAV images. Recent studies show that adding an adversarial patch on objects can fool the well-trained deep neural networks based object detectors, posing security concerns to the downstream tasks. However, the current public UAV datasets might ignore the diverse altitudes, vehicle attributes, fine-grained instance-level annotation in mostly side view with blurred vehicle roof, so none of them is good to study the adversarial patch based vehicle detection attack problem. In this paper, we propose a new dataset named EVD4UAV as an altitude-sensitive benchmark to evade vehicle detection in UAV with 6,284 images and 90,886 fine-grained annotated vehicles. The EVD4UAV dataset has diverse altitudes (50m, 70m, 90m), vehicle attributes (color, type), fine-grained annotation (horizontal and rotated bounding boxes, instance-level mask) in top view with clear vehicle roof. One white-box and two black-box patch based attack methods are implemented to attack three classic deep neural networks based object detectors on EVD4UAV. The experimental results show that these representative attack methods could not achieve the robust altitude-insensitive attack performance. ",
    "url": "https://arxiv.org/abs/2403.05422",
    "authors": [
      "Huiming Sun",
      "Jiacheng Guo",
      "Zibo Meng",
      "Tianyun Zhang",
      "Jianwu Fang",
      "Yuewei Lin",
      "Hongkai Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05457",
    "title": "Sparse dynamic network reconstruction through L1-regularization of a  Lyapunov equation",
    "abstract": "An important problem in many areas of science is that of recovering interaction networks from simultaneous time-series of many interacting dynamical processes. A common approach is to use the elements of the correlation matrix or its inverse as proxies of the interaction strengths, but the reconstructed networks are necessarily undirected. Transfer entropy methods have been proposed to reconstruct directed networks but the reconstructed network lacks information about interaction strengths. We propose a network reconstruction method that inherits the best of the two approaches by reconstructing a directed weighted network from noisy data under the assumption that the network is sparse and the dynamics are governed by a linear (or weakly-nonlinear) stochastic dynamical system. The two steps of our method are i) constructing an (infinite) family of candidate networks by solving the covariance matrix Lyapunov equation for the state matrix and ii) using L1-regularization to select a sparse solution. We further show how to use prior information on the (non)existence of a few directed edges to drastically improve the quality of the reconstruction. ",
    "url": "https://arxiv.org/abs/2403.05457",
    "authors": [
      "Ian Xul Belaustegui",
      "Marcela Ordorica Arango",
      "Román Rossi Pool",
      "Naomi Ehrich Leonard",
      "Alessio Franci"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.05472",
    "title": "Federated Joint Learning of Robot Networks in Stroke Rehabilitation",
    "abstract": "Advanced by rich perception and precise execution, robots possess immense potential to provide professional and customized rehabilitation exercises for patients with mobility impairments caused by strokes. Autonomous robotic rehabilitation significantly reduces human workloads in the long and tedious rehabilitation process. However, training a rehabilitation robot is challenging due to the data scarcity issue. This challenge arises from privacy concerns (e.g., the risk of leaking private disease and identity information of patients) during clinical data access and usage. Data from various patients and hospitals cannot be shared for adequate robot training, further compromising rehabilitation safety and limiting implementation scopes. To address this challenge, this work developed a novel federated joint learning (FJL) method to jointly train robots across hospitals. FJL also adopted a long short-term memory network (LSTM)-Transformer learning mechanism to effectively explore the complex tempo-spatial relations among patient mobility conditions and robotic rehabilitation motions. To validate FJL's effectiveness in training a robot network, a clinic-simulation combined experiment was designed. Real rehabilitation exercise data from 200 patients with stroke diseases (upper limb hemiplegia, Parkinson's syndrome, and back pain syndrome) were adopted. Inversely driven by clinical data, 300,000 robotic rehabilitation guidances were simulated. FJL proved to be effective in joint rehabilitation learning, performing 20% - 30% better than baseline methods. ",
    "url": "https://arxiv.org/abs/2403.05472",
    "authors": [
      "Xinyu Jiang",
      "Yibei Guo",
      "Mengsha Hu",
      "Ruoming Jin",
      "Hai Phan",
      "Jay Alberts",
      "Rui Liu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.05489",
    "title": "JointMotion: Joint Self-supervision for Joint Motion Prediction",
    "abstract": "We present JointMotion, a self-supervised learning method for joint motion prediction in autonomous driving. Our method includes a scene-level objective connecting motion and environments, and an instance-level objective to refine learned representations. Our evaluations show that these objectives are complementary and outperform recent contrastive and autoencoding methods as pre-training for joint motion prediction. Furthermore, JointMotion adapts to all common types of environment representations used for motion prediction (i.e., agent-centric, scene-centric, and pairwise relative), and enables effective transfer learning between the Waymo Open Motion and the Argoverse 2 Forecasting datasets. Notably, our method improves the joint final displacement error of Wayformer, Scene Transformer, and HPTR by 3%, 7%, and 11%, respectively. ",
    "url": "https://arxiv.org/abs/2403.05489",
    "authors": [
      "Royden Wagner",
      "Ömer Şahin Taş",
      "Marvin Klemp",
      "Carlos Fernandez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.05513",
    "title": "A Detection and Filtering Framework for Collaborative Localization",
    "abstract": "Increasingly, autonomous vehicles (AVs) are becoming a reality, such as the Advanced Driver Assistance Systems (ADAS) in vehicles that assist drivers in driving and parking functions with vehicles today. The localization problem for AVs relies primarily on multiple sensors, including cameras, LiDARs, and radars. Manufacturing, installing, calibrating, and maintaining these sensors can be very expensive, thereby increasing the overall cost of AVs. This research explores the means to improve localization on vehicles belonging to the ADAS category in a platooning context, where an ADAS vehicle follows a lead \"Smart\" AV equipped with a highly accurate sensor suite. We propose and produce results by using a filtering framework to combine pose information derived from vision and odometry to improve the localization of the ADAS vehicle that follows the smart vehicle. ",
    "url": "https://arxiv.org/abs/2403.05513",
    "authors": [
      "Thirumalaesh Ashokkumar",
      "Katherine A Skinner",
      "Siddarth Agarwal",
      "Ankit Vora",
      "Ashutosh Bhown"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.04883",
    "title": "Learning Traveling Solitary Waves Using Separable Gaussian Neural  Networks",
    "abstract": "In this paper, we apply a machine-learning approach to learn traveling solitary waves across various families of partial differential equations (PDEs). Our approach integrates a novel interpretable neural network (NN) architecture, called Separable Gaussian Neural Networks (SGNN) into the framework of Physics-Informed Neural Networks (PINNs). Unlike the traditional PINNs that treat spatial and temporal data as independent inputs, the present method leverages wave characteristics to transform data into the so-called co-traveling wave frame. This adaptation effectively addresses the issue of propagation failure in PINNs when applied to large computational domains. Here, the SGNN architecture demonstrates robust approximation capabilities for single-peakon, multi-peakon, and stationary solutions within the (1+1)-dimensional, $b$-family of PDEs. In addition, we expand our investigations, and explore not only peakon solutions in the $ab$-family but also compacton solutions in (2+1)-dimensional, Rosenau-Hyman family of PDEs. A comparative analysis with MLP reveals that SGNN achieves comparable accuracy with fewer than a tenth of the neurons, underscoring its efficiency and potential for broader application in solving complex nonlinear PDEs. ",
    "url": "https://arxiv.org/abs/2403.04883",
    "authors": [
      "Siyuan Xing",
      "Efstathios G. Charalampidis"
    ],
    "subjectives": [
      "Pattern Formation and Solitons (nlin.PS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04962",
    "title": "C2P-GCN: Cell-to-Patch Graph Convolutional Network for Colorectal Cancer  Grading",
    "abstract": "Graph-based learning approaches, due to their ability to encode tissue/organ structure information, are increasingly favored for grading colorectal cancer histology images. Recent graph-based techniques involve dividing whole slide images (WSIs) into smaller or medium-sized patches, and then building graphs on each patch for direct use in training. This method, however, fails to capture the tissue structure information present in an entire WSI and relies on training from a significantly large dataset of image patches. In this paper, we propose a novel cell-to-patch graph convolutional network (C2P-GCN), which is a two-stage graph formation-based approach. In the first stage, it forms a patch-level graph based on the cell organization on each patch of a WSI. In the second stage, it forms an image-level graph based on a similarity measure between patches of a WSI considering each patch as a node of a graph. This graph representation is then fed into a multi-layer GCN-based classification network. Our approach, through its dual-phase graph construction, effectively gathers local structural details from individual patches and establishes a meaningful connection among all patches across a WSI. As C2P-GCN integrates the structural data of an entire WSI into a single graph, it allows our model to work with significantly fewer training data compared to the latest models for colorectal cancer. Experimental validation of C2P-GCN on two distinct colorectal cancer datasets demonstrates the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2403.04962",
    "authors": [
      "Sudipta Paul",
      "Bulent Yener",
      "Amanda W. Lund"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04990",
    "title": "Jet Discrimination with Quantum Complete Graph Neural Network",
    "abstract": "Machine learning, particularly deep neural networks, has been widely utilized in high energy physics and has shown remarkable results in various applications. Moreover, the concept of machine learning has been extended to quantum computers, giving rise to a new research area known as quantum machine learning. In this paper, we propose a novel variational quantum circuit model, Quantum Complete Graph Neural Network (QCGNN), designed for learning complete graphs. We argue that QCGNN has a polynomial speedup against its classical counterpart, due to the property of quantum parallelism. In this paper, we study the application of QCGNN through the challenging jet discrimination, where the jets are represented with complete graphs. Subsequently, we conduct a comparative analysis with classical graph neural networks to establish a benchmark. ",
    "url": "https://arxiv.org/abs/2403.04990",
    "authors": [
      "Yi-An Chen",
      "Kai-Feng Chen"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (cs.LG)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2403.05134",
    "title": "Follow-the-Perturbed-Leader with Fréchet-type Tail Distributions:  Optimality in Adversarial Bandits and Best-of-Both-Worlds",
    "abstract": "This paper studies the optimality of the Follow-the-Perturbed-Leader (FTPL) policy in both adversarial and stochastic $K$-armed bandits. Despite the widespread use of the Follow-the-Regularized-Leader (FTRL) framework with various choices of regularization, the FTPL framework, which relies on random perturbations, has not received much attention, despite its inherent simplicity. In adversarial bandits, there has been conjecture that FTPL could potentially achieve $\\mathcal{O}(\\sqrt{KT})$ regrets if perturbations follow a distribution with a Fr\\'{e}chet-type tail. Recent work by Honda et al. (2023) showed that FTPL with Fr\\'{e}chet distribution with shape $\\alpha=2$ indeed attains this bound and, notably logarithmic regret in stochastic bandits, meaning the Best-of-Both-Worlds (BOBW) capability of FTPL. However, this result only partly resolves the above conjecture because their analysis heavily relies on the specific form of the Fr\\'{e}chet distribution with this shape. In this paper, we establish a sufficient condition for perturbations to achieve $\\mathcal{O}(\\sqrt{KT})$ regrets in the adversarial setting, which covers, e.g., Fr\\'{e}chet, Pareto, and Student-$t$ distributions. We also demonstrate the BOBW achievability of FTPL with certain Fr\\'{e}chet-type tail distributions. Our results contribute not only to resolving existing conjectures through the lens of extreme value theory but also potentially offer insights into the effect of the regularization functions in FTRL through the mapping from FTPL to FTRL. ",
    "url": "https://arxiv.org/abs/2403.05134",
    "authors": [
      "Jongyeong Lee",
      "Junya Honda",
      "Shinji Ito",
      "Min-hwan Oh"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.05226",
    "title": "Extremal Chemical Graphs for the Arithmetic-Geometric Index",
    "abstract": "The arithmetic-geometric index is a newly proposed degree-based graph invariant in mathematical chemistry. We give a sharp upper bound on the value of this invariant for connected chemical graphs of given order and size and characterize the connected chemical graphs that reach the bound. We also prove that the removal of the constraint that extremal chemical graphs must be connected does not allow to increase the upper bound. ",
    "url": "https://arxiv.org/abs/2403.05226",
    "authors": [
      "Alain Hertz",
      "Sébastien Bonte",
      "Gauvain Devillez",
      "Valentin Dusollier",
      "Hadrien Mélot",
      "David Schindl"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2403.05245",
    "title": "Noise Level Adaptive Diffusion Model for Robust Reconstruction of  Accelerated MRI",
    "abstract": "In general, diffusion model-based MRI reconstruction methods incrementally remove artificially added noise while imposing data consistency to reconstruct the underlying images. However, real-world MRI acquisitions already contain inherent noise due to thermal fluctuations. This phenomenon is particularly notable when using ultra-fast, high-resolution imaging sequences for advanced research, or using low-field systems favored by low- and middle-income countries. These common scenarios can lead to sub-optimal performance or complete failure of existing diffusion model-based reconstruction techniques. Specifically, as the artificially added noise is gradually removed, the inherent MRI noise becomes increasingly pronounced, making the actual noise level inconsistent with the predefined denoising schedule and consequently inaccurate image reconstruction. To tackle this problem, we propose a posterior sampling strategy with a novel NoIse Level Adaptive Data Consistency (Nila-DC) operation. Extensive experiments are conducted on two public datasets and an in-house clinical dataset with field strength ranging from 0.3T to 3T, showing that our method surpasses the state-of-the-art MRI reconstruction methods, and is highly robust against various noise levels. The code will be released after review. ",
    "url": "https://arxiv.org/abs/2403.05245",
    "authors": [
      "Shoujin Huang",
      "Guanxiong Luo",
      "Xi Wang",
      "Ziran Chen",
      "Yuwan Wang",
      "Huaishui Yang",
      "Pheng-Ann Heng",
      "Lingyan Zhang",
      "Mengye Lyu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05249",
    "title": "On Representing Electronic Wave Functions with Sign Equivariant Neural  Networks",
    "abstract": "Recent neural networks demonstrated impressively accurate approximations of electronic ground-state wave functions. Such neural networks typically consist of a permutation-equivariant neural network followed by a permutation-antisymmetric operation to enforce the electronic exchange symmetry. While accurate, such neural networks are computationally expensive. In this work, we explore the flipped approach, where we first compute antisymmetric quantities based on the electronic coordinates and then apply sign equivariant neural networks to preserve the antisymmetry. While this approach promises acceleration thanks to the lower-dimensional representation, we demonstrate that it reduces to a Jastrow factor, a commonly used permutation-invariant multiplicative factor in the wave function. Our empirical results support this further, finding little to no improvements over baselines. We conclude with neither theoretical nor empirical advantages of sign equivariant functions for representing electronic wave functions within the evaluation of this work. ",
    "url": "https://arxiv.org/abs/2403.05249",
    "authors": [
      "Nicholas Gao",
      "Stephan Günnemann"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2403.05343",
    "title": "Disentangling the Timescales of a Complex System: A Bayesian Approach to  Temporal Network Analysis",
    "abstract": "Changes in the timescales at which complex systems evolve are essential to predicting critical transitions and catastrophic failures. Disentangling the timescales of the dynamics governing complex systems remains a key challenge. With this study, we introduce an integrated Bayesian framework based on temporal network models to address this challenge. We focus on two methodologies: change point detection for identifying shifts in system dynamics, and a spectrum analysis for inferring the distribution of timescales. Applied to synthetic and empirical datasets, these methologies robustly identify critical transitions and comprehensively map the dominant and subsidiaries timescales in complex systems. This dual approach offers a powerful tool for analyzing temporal networks, significantly enhancing our understanding of dynamic behaviors in complex systems. ",
    "url": "https://arxiv.org/abs/2403.05343",
    "authors": [
      "Giona Casiraghi",
      "Georges Andres"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Social and Information Networks (cs.SI)",
      "Probability (math.PR)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2403.05353",
    "title": "Hybridized Convolutional Neural Networks and Long Short-Term Memory for  Improved Alzheimer's Disease Diagnosis from MRI Scans",
    "abstract": "Brain-related diseases are more sensitive than other diseases due to several factors, including the complexity of surgical procedures, high costs, and other challenges. Alzheimer's disease is a common brain disorder that causes memory loss and the shrinking of brain cells. Early detection is critical for providing proper treatment to patients. However, identifying Alzheimer's at an early stage using manual scanning of CT or MRI scans is challenging. Therefore, researchers have delved into the exploration of computer-aided systems, employing Machine Learning and Deep Learning methodologies, which entail the training of datasets to detect Alzheimer's disease. This study aims to present a hybrid model that combines a CNN model's feature extraction capabilities with an LSTM model's detection capabilities. This study has applied the transfer learning called VGG16 in the hybrid model to extract features from MRI images. The LSTM detects features between the convolution layer and the fully connected layer. The output layer of the fully connected layer uses the softmax function. The training of the hybrid model involved utilizing the ADNI dataset. The trial findings revealed that the model achieved a level of accuracy of 98.8%, a sensitivity rate of 100%, and a specificity rate of 76%. The proposed hybrid model outperforms its contemporary CNN counterparts, showcasing a superior performance. ",
    "url": "https://arxiv.org/abs/2403.05353",
    "authors": [
      "Maleka Khatun",
      "Md Manowarul Islam",
      "Habibur Rahman Rifat",
      "Md. Shamim Bin Shahid",
      "Md. Alamin Talukder",
      "Md Ashraf Uddin"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.05360",
    "title": "Path eccentricity of $k$-AT-free graphs and application on graphs with  the consecutive ones property",
    "abstract": "The central path problem is a variation on the single facility location problem. The aim is to find, in a given connected graph $G$, a path $P$ minimizing its eccentricity, which is the maximal distance from $P$ to any vertex of the graph $G$. The path eccentricity of $G$ is the minimal eccentricity achievable over all paths in $G$. In this article we consider the path eccentricity of the class of the $k$-AT-free graphs. They are graphs in which any set of three vertices contains a pair for which every path between them uses at least one vertex of the closed neighborhood at distance $k$ of the third. We prove that they have path eccentricity bounded by $k$. Moreover, we answer a question of G\\'omez and Guti\\'errez asking if there is a relation between path eccentricity and the consecutive ones property. The latter is the property for a binary matrix to admit a permutation of the rows placing the 1's consecutively on the columns. It was already known that graphs whose adjacency matrices have the consecutive ones property have path eccentricity at most 1, and that the same remains true when the augmented adjacency matrices (with ones on the diagonal) has the consecutive ones property. We generalize these results as follow. We study graphs whose adjacency matrices can be made to satisfy the consecutive ones property after changing some values on the diagonal, and show that those graphs have path eccentricity at most 2, by showing that they are 2-AT-free. ",
    "url": "https://arxiv.org/abs/2403.05360",
    "authors": [
      "Paul Bastide",
      "Claire Hilaire",
      "Eileen Robinson"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2403.05372",
    "title": "Limit Laws for Critical Dispersion on Complete Graphs",
    "abstract": "We consider a synchronous process of particles moving on the vertices of a graph $G$, introduced by Cooper, McDowell, Radzik, Rivera and Shiraga (2018). Initially, $M$ particles are placed on a vertex of $G$. In subsequent time steps, all particles that are located on a vertex inhabited by at least two particles jump independently to a neighbour chosen uniformly at random. The process ends at the first step when no vertex is inhabited by more than one particle; we call this (random) time step the dispersion time. In this work we study the case where $G$ is the complete graph on $n$ vertices and the number of particles is $M=n/2+\\alpha n^{1/2} + o(n^{1/2})$, $\\alpha\\in \\mathbb{R}$. This choice of $M$ corresponds to the critical window of the process, with respect to the dispersion time. We show that the dispersion time, if rescaled by $n^{-1/2}$, converges in $p$-th mean, as $n\\rightarrow \\infty$ and for any $p \\in \\mathbb{R}$, to a continuous and almost surely positive random variable $T_\\alpha$. We find that $T_\\alpha$ is the absorption time of a standard logistic branching process, thoroughly investigated by Lambert (2005), and we determine its expectation. In particular, in the middle of the critical window we show that $\\mathbb{E}[T_0] = \\pi^{3/2}/\\sqrt{7}$, and furthermore we formulate explicit asymptotics when $|\\alpha|$ gets large that quantify the transition into and out of the critical window. We also study the random variable counting the total number of jumps that are performed by the particles until the dispersion time is reached and prove that, if rescaled by $n\\ln n$, it converges to $2/7$ in probability. ",
    "url": "https://arxiv.org/abs/2403.05372",
    "authors": [
      "Umberto De Ambroggio",
      "Tamás Makai",
      "Konstantinos Panagiotou",
      "Annika Steibel"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2403.05384",
    "title": "A Data Augmentation Pipeline to Generate Synthetic Labeled Datasets of  3D Echocardiography Images using a GAN",
    "abstract": "Due to privacy issues and limited amount of publicly available labeled datasets in the domain of medical imaging, we propose an image generation pipeline to synthesize 3D echocardiographic images with corresponding ground truth labels, to alleviate the need for data collection and for laborious and error-prone human labeling of images for subsequent Deep Learning (DL) tasks. The proposed method utilizes detailed anatomical segmentations of the heart as ground truth label sources. This initial dataset is combined with a second dataset made up of real 3D echocardiographic images to train a Generative Adversarial Network (GAN) to synthesize realistic 3D cardiovascular Ultrasound images paired with ground truth labels. To generate the synthetic 3D dataset, the trained GAN uses high resolution anatomical models from Computed Tomography (CT) as input. A qualitative analysis of the synthesized images showed that the main structures of the heart are well delineated and closely follow the labels obtained from the anatomical models. To assess the usability of these synthetic images for DL tasks, segmentation algorithms were trained to delineate the left ventricle, left atrium, and myocardium. A quantitative analysis of the 3D segmentations given by the models trained with the synthetic images indicated the potential use of this GAN approach to generate 3D synthetic data, use the data to train DL models for different clinical tasks, and therefore tackle the problem of scarcity of 3D labeled echocardiography datasets. ",
    "url": "https://arxiv.org/abs/2403.05384",
    "authors": [
      "Cristiana Tiago",
      "Andrew Gilbert",
      "Ahmed S. Beela",
      "Svein Arne Aase",
      "Sten Roar Snare",
      "Jurica Sprem"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.05418",
    "title": "On balanceable and simply balanceable regular graphs",
    "abstract": "We continue the study of balanceable graphs, defined by Caro, Hansberg, and Montejano in 2021 as graphs $G$ such that any $2$-coloring of the edges of a sufficiently large complete graph containing sufficiently many edges of each color contains a balanced copy of $G$. While the problem of recognizing balanceable graphs was conjectured to be NP-complete by Dailly, Hansberg, and Ventura in 2021, balanceable graphs admit an elegant combinatorial characterization: a graph is balanceable if and only there exist two vertex subsets, one containing half of all the graph's edges and another one such that the corresponding cut contains half of all the graph's edges. We consider a special case of this property, namely when one of the two sets is a vertex cover, and call the corresponding graphs simply balanceable. We prove a number of results on balanceable and simply balanceable regular graphs. First, we characterize simply balanceable regular graphs via a condition involving the independence number of the graph. Second, we address a question of Dailly, Hansberg, and Ventura from 2021 and show that every cubic graph is balanceable. Third, using Brooks' theorem, we show that every $4$-regular graph with order divisible by $4$ is balanceable. Finally, we show that it is NP-complete to determine if a $9$-regular graph is simply balanceable. ",
    "url": "https://arxiv.org/abs/2403.05418",
    "authors": [
      "Milad Ahanjideh",
      "Martin Milanič",
      "Mary Servatius"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Complexity (cs.CC)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2403.05445",
    "title": "The minimum distance of a parameterized code over an even cycle",
    "abstract": "We compute the minimum distance of the parameterized code of order $1$ over an even cycle. ",
    "url": "https://arxiv.org/abs/2403.05445",
    "authors": [
      "Eduardo Camps-Moreno",
      "Jorge Neves",
      "Eliseo Sarmiento"
    ],
    "subjectives": [
      "Commutative Algebra (math.AC)",
      "Information Theory (cs.IT)",
      "Algebraic Geometry (math.AG)"
    ]
  },
  {
    "id": "arXiv:2403.05452",
    "title": "The R2D2 deep neural network series paradigm for fast precision imaging  in radio astronomy",
    "abstract": "Radio-interferometric (RI) imaging entails solving high-resolution high-dynamic range inverse problems from large data volumes. Recent image reconstruction techniques grounded in optimization theory have demonstrated remarkable capability for imaging precision, well beyond CLEAN's capability. These range from advanced proximal algorithms propelled by handcrafted regularization operators, such as the SARA family, to hybrid plug-and-play (PnP) algorithms propelled by learned regularization denoisers, such as AIRI. Optimization and PnP structures are however highly iterative, which hinders their ability to handle the extreme data sizes expected from future instruments. To address this scalability challenge, we introduce a novel deep learning approach, dubbed ``Residual-to-Residual DNN series for high-Dynamic range imaging'. R2D2's reconstruction is formed as a series of residual images, iteratively estimated as outputs of Deep Neural Networks (DNNs) taking the previous iteration's image estimate and associated data residual as inputs. It thus takes a hybrid structure between a PnP algorithm and a learned version of the matching pursuit algorithm that underpins CLEAN. We present a comprehensive study of our approach, featuring its multiple incarnations distinguished by their DNN architectures. We provide a detailed description of its training process, targeting a telescope-specific approach. R2D2's capability to deliver high precision is demonstrated in simulation, across a variety of image and observation settings using the Very Large Array (VLA). Its reconstruction speed is also demonstrated: with only few iterations required to clean data residuals at dynamic ranges up to 105, R2D2 opens the door to fast precision imaging. R2D2 codes are available in the BASPLib library on GitHub. ",
    "url": "https://arxiv.org/abs/2403.05452",
    "authors": [
      "Amir Aghabiglou",
      "Chung San Chu",
      "Arwa Dabbech",
      "Yves Wiaux"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.02739",
    "title": "Shapes as Product Differentiation: Neural Network Embedding in the  Analysis of Markets for Fonts",
    "abstract": " Title: Shapes as Product Differentiation: Neural Network Embedding in the  Analysis of Markets for Fonts ",
    "url": "https://arxiv.org/abs/2107.02739",
    "authors": [
      "Sukjin Han",
      "Eric H. Schulman",
      "Kristen Grauman",
      "Santhosh Ramakrishnan"
    ],
    "subjectives": [
      "Econometrics (econ.EM)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.00087",
    "title": "Persistent Homological State-Space Estimation of Functional Human Brain  Networks at Rest",
    "abstract": " Comments: To be published in PLOS Computational Biology ",
    "url": "https://arxiv.org/abs/2201.00087",
    "authors": [
      "Moo K. Chung",
      "Shih-Gu Huang",
      "Ian C. Carroll",
      "Vince D. Calhoun",
      "H. Hill Goldsmith"
    ],
    "subjectives": [
      "Algebraic Topology (math.AT)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2203.01707",
    "title": "Testing Stationarity and Change Point Detection in Reinforcement  Learning",
    "abstract": " Title: Testing Stationarity and Change Point Detection in Reinforcement  Learning ",
    "url": "https://arxiv.org/abs/2203.01707",
    "authors": [
      "Mengbing Li",
      "Chengchun Shi",
      "Zhenke Wu",
      "Piotr Fryzlewicz"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.10236",
    "title": "The average size of maximal matchings in graphs",
    "abstract": " Comments: 28 pages ",
    "url": "https://arxiv.org/abs/2204.10236",
    "authors": [
      "Alain Hertz",
      "Sébastien Bonte",
      "Gauvain Devillez",
      "Hadrien Mélot"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2208.10769",
    "title": "PIFu for the Real World: A Self-supervised Framework to Reconstruct  Dressed Human from Single-view Images",
    "abstract": " Comments: CVM 2024 ",
    "url": "https://arxiv.org/abs/2208.10769",
    "authors": [
      "Zhangyang Xiong",
      "Dong Du",
      "Yushuang Wu",
      "Jingqi Dong",
      "Di Kang",
      "Linchao Bao",
      "Xiaoguang Han"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.14456",
    "title": "TetraSphere: A Neural Descriptor for O(3)-Invariant Point Cloud Analysis",
    "abstract": " Comments: CVPR 2024 ",
    "url": "https://arxiv.org/abs/2211.14456",
    "authors": [
      "Pavlo Melnyk",
      "Andreas Robinson",
      "Michael Felsberg",
      "Mårten Wadenbäck"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.03357",
    "title": "Towards Enhancing Time Series Contrastive Learning: A Dynamic Bad Pair  Mining Approach",
    "abstract": " Comments: ICLR 2024 Camera Ready ",
    "url": "https://arxiv.org/abs/2302.03357",
    "authors": [
      "Xiang Lan",
      "Hanshu Yan",
      "Shenda Hong",
      "Mengling Feng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.07715",
    "title": "Risk Management Core -- Towards an Explicit Representation of Risk in  Automated Driving",
    "abstract": " Comments: 20 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2302.07715",
    "authors": [
      "Nayel Fabian Salem",
      "Thomas Kirschbaum",
      "Marcus Nolte",
      "Christian Lalitsch-Schneider",
      "Robert Graubohm",
      "Jan Reich",
      "Markus Maurer"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2303.10139",
    "title": "Distill n' Explain: explaining graph neural networks using simple  surrogates",
    "abstract": " Comments: To appear in AISTATS 2023 ",
    "url": "https://arxiv.org/abs/2303.10139",
    "authors": [
      "Tamara Pereira",
      "Erik Nascimento",
      "Lucas E. Resck",
      "Diego Mesquita",
      "Amauri Souza"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.03716",
    "title": "3D Small Object Detection with Dynamic Spatial Pruning",
    "abstract": " Comments: Code is available at: this https URL ",
    "url": "https://arxiv.org/abs/2305.03716",
    "authors": [
      "Xiuwei Xu",
      "Zhihao Sun",
      "Ziwei Wang",
      "Hongmin Liu",
      "Jie Zhou",
      "Jiwen Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.04527",
    "title": "ContriMix: Scalable stain color augmentation for domain generalization  without domain labels in digital pathology",
    "abstract": " Title: ContriMix: Scalable stain color augmentation for domain generalization  without domain labels in digital pathology ",
    "url": "https://arxiv.org/abs/2306.04527",
    "authors": [
      "Tan H. Nguyen",
      "Dinkar Juyal",
      "Jin Li",
      "Aaditya Prakash",
      "Shima Nofallah",
      "Chintan Shah",
      "Sai Chowdary Gullapally",
      "Limin Yu",
      "Michael Griffin",
      "Anand Sampat",
      "John Abel",
      "Justin Lee",
      "Amaro Taylor-Weiner"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.00529",
    "title": "New intelligent defense systems to reduce the risks of Selfish Mining  and Double-Spending attacks using Learning Automata",
    "abstract": " Title: New intelligent defense systems to reduce the risks of Selfish Mining  and Double-Spending attacks using Learning Automata ",
    "url": "https://arxiv.org/abs/2307.00529",
    "authors": [
      "Seyed Ardalan Ghoreishi",
      "Mohammad Reza Meybodi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.09944",
    "title": "ProtoCaps: A Fast and Non-Iterative Capsule Network Routing Method",
    "abstract": " Comments: 13 pages, 5 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2307.09944",
    "authors": [
      "Miles Everett",
      "Mingjun Zhong",
      "Georgios Leontidis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.13637",
    "title": "Cognitive Engagement for STEM+C Education: Investigating Serious Game  Impact on Graph Structure Learning with fNIRS",
    "abstract": " Comments: 19 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2307.13637",
    "authors": [
      "Shayla Sharmin",
      "Reza Koiler",
      "Rifat Sadik",
      "Arpan Bhattacharjee",
      "Priyanka Raju Patre",
      "Pinar Kullu",
      "Charles Hohensee",
      "Nancy Getchell",
      "Roghayeh Leila Barmaki"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2308.03135",
    "title": "EventBind: Learning a Unified Representation to Bind Them All for  Event-based Open-world Understanding",
    "abstract": " Comments: Conferemve version ",
    "url": "https://arxiv.org/abs/2308.03135",
    "authors": [
      "Jiazhou Zhou",
      "Xu Zheng",
      "Yuanhuiyi Lyu",
      "Lin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.04836",
    "title": "Neural Semantic Surface Maps",
    "abstract": " Comments: Accepted at Eurographics 2024 ",
    "url": "https://arxiv.org/abs/2309.04836",
    "authors": [
      "Luca Morreale",
      "Noam Aigerman",
      "Vladimir G. Kim",
      "Niloy J. Mitra"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2309.05436",
    "title": "Quantized Fourier and Polynomial Features for more Expressive Tensor  Network Models",
    "abstract": " Comments: 9 pages, 4 figures. Reviewed version after peer-review. To be published in the proceedings of the 27th International Conference on Artificial Intelligence and Statistics (AISTATS) ",
    "url": "https://arxiv.org/abs/2309.05436",
    "authors": [
      "Frederiek Wesel",
      "Kim Batselier"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.06782",
    "title": "Improved particle-flow event reconstruction with scalable neural  networks for current and future particle detectors",
    "abstract": " Comments: 21 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2309.06782",
    "authors": [
      "Joosep Pata",
      "Eric Wulff",
      "Farouk Mokhtar",
      "David Southwick",
      "Mengke Zhang",
      "Maria Girone",
      "Javier Duarte"
    ],
    "subjectives": [
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)",
      "Instrumentation and Detectors (physics.ins-det)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2309.09295",
    "title": "NeRF-VINS: A Real-time Neural Radiance Field Map-based Visual-Inertial  Navigation System",
    "abstract": " Comments: 6 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2309.09295",
    "authors": [
      "Saimouli Katragadda",
      "Woosik Lee",
      "Yuxiang Peng",
      "Patrick Geneva",
      "Chuchu Chen",
      "Chao Guo",
      "Mingyang Li",
      "Guoquan Huang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.00920",
    "title": "Every Dataset Counts: Scaling up Monocular 3D Object Detection with  Joint Datasets Training",
    "abstract": " Title: Every Dataset Counts: Scaling up Monocular 3D Object Detection with  Joint Datasets Training ",
    "url": "https://arxiv.org/abs/2310.00920",
    "authors": [
      "Fulong Ma",
      "Xiaoyang Yan",
      "Guoyang Zhao",
      "Xiaojie Xu",
      "Yuxuan Liu",
      "Ming Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.05446",
    "title": "RetSeg: Retention-based Colorectal Polyps Segmentation Network",
    "abstract": " Comments: Updated PDF ",
    "url": "https://arxiv.org/abs/2310.05446",
    "authors": [
      "Khaled ELKarazle",
      "Valliappan Raman",
      "Caslon Chua",
      "Patrick Then"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.06045",
    "title": "Generative ensemble deep learning severe weather prediction from a  deterministic convection-allowing model",
    "abstract": " Title: Generative ensemble deep learning severe weather prediction from a  deterministic convection-allowing model ",
    "url": "https://arxiv.org/abs/2310.06045",
    "authors": [
      "Yingkai Sha",
      "Ryan A. Sobash",
      "David John Gagne II"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)"
    ]
  },
  {
    "id": "arXiv:2310.06549",
    "title": "Be Careful What You Smooth For: Label Smoothing Can Be a Privacy Shield  but Also a Catalyst for Model Inversion Attacks",
    "abstract": " Comments: Published as a conference paper at ICLR 2024 ",
    "url": "https://arxiv.org/abs/2310.06549",
    "authors": [
      "Lukas Struppek",
      "Dominik Hintersdorf",
      "Kristian Kersting"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.12557",
    "title": "DepWiGNN: A Depth-wise Graph Neural Network for Multi-hop Spatial  Reasoning in Text",
    "abstract": " Comments: EMNLP 2023 Findings ",
    "url": "https://arxiv.org/abs/2310.12557",
    "authors": [
      "Shuaiyi Li",
      "Yang Deng",
      "Wai Lam"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.18882",
    "title": "Differentiable Learning of Generalized Structured Matrices for Efficient  Deep Neural Networks",
    "abstract": " Title: Differentiable Learning of Generalized Structured Matrices for Efficient  Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2310.18882",
    "authors": [
      "Changwoo Lee",
      "Hun-Seok Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2310.20091",
    "title": "Density-based User Representation using Gaussian Process Regression for  Multi-interest Personalized Retrieval",
    "abstract": " Comments: 15 pages ",
    "url": "https://arxiv.org/abs/2310.20091",
    "authors": [
      "Haolun Wu",
      "Ofer Meshi",
      "Masrour Zoghi",
      "Fernando Diaz",
      "Xue Liu",
      "Craig Boutilier",
      "Maryam Karimzadehgan"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2311.00529",
    "title": "A Unified Framework for the Error Analysis of Physics-Informed Neural  Networks",
    "abstract": " Title: A Unified Framework for the Error Analysis of Physics-Informed Neural  Networks ",
    "url": "https://arxiv.org/abs/2311.00529",
    "authors": [
      "Marius Zeinhofer",
      "Rami Masri",
      "Kent-André Mardal"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2311.02026",
    "title": "APRICOT-Mamba: Acuity Prediction in Intensive Care Unit (ICU):  Development and Validation of a Stability, Transitions, and Life-Sustaining  Therapies Prediction Model",
    "abstract": " Title: APRICOT-Mamba: Acuity Prediction in Intensive Care Unit (ICU):  Development and Validation of a Stability, Transitions, and Life-Sustaining  Therapies Prediction Model ",
    "url": "https://arxiv.org/abs/2311.02026",
    "authors": [
      "Miguel Contreras",
      "Brandon Silva",
      "Benjamin Shickel",
      "Tezcan Ozrazgat-Baslanti",
      "Yuanfang Ren",
      "Ziyuan Guan",
      "Jeremy Balch",
      "Jiaqing Zhang",
      "Sabyasachi Bandyopadhyay",
      "Kia Khezeli",
      "Azra Bihorac",
      "Parisa Rashidi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.04056",
    "title": "Multi-View Causal Representation Learning with Partial Observability",
    "abstract": " Comments: 28 pages, 10 figures, 11 tables ",
    "url": "https://arxiv.org/abs/2311.04056",
    "authors": [
      "Dingling Yao",
      "Danru Xu",
      "Sébastien Lachapelle",
      "Sara Magliacane",
      "Perouz Taslakian",
      "Georg Martius",
      "Julius von Kügelgen",
      "Francesco Locatello"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.07222",
    "title": "Neural General Circulation Models for Weather and Climate",
    "abstract": " Comments: 92 pages, 54 figures ",
    "url": "https://arxiv.org/abs/2311.07222",
    "authors": [
      "Dmitrii Kochkov",
      "Janni Yuval",
      "Ian Langmore",
      "Peter Norgaard",
      "Jamie Smith",
      "Griffin Mooers",
      "Milan Klöwer",
      "James Lottes",
      "Stephan Rasp",
      "Peter Düben",
      "Sam Hatfield",
      "Peter Battaglia",
      "Alvaro Sanchez-Gonzalez",
      "Matthew Willson",
      "Michael P. Brenner",
      "Stephan Hoyer"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2311.14255",
    "title": "Out-of-Distribution Generalized Dynamic Graph Neural Network with  Disentangled Intervention and Invariance Promotion",
    "abstract": " Title: Out-of-Distribution Generalized Dynamic Graph Neural Network with  Disentangled Intervention and Invariance Promotion ",
    "url": "https://arxiv.org/abs/2311.14255",
    "authors": [
      "Zeyang Zhang",
      "Xin Wang",
      "Ziwei Zhang",
      "Haoyang Li",
      "Wenwu Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.15545",
    "title": "Out-of-Distribution Generalized Dynamic Graph Neural Network for Human  Albumin Prediction",
    "abstract": " Comments: MedAI'23 ",
    "url": "https://arxiv.org/abs/2311.15545",
    "authors": [
      "Zeyang Zhang",
      "Xingwang Li",
      "Fei Teng",
      "Ning Lin",
      "Xueling Zhu",
      "Xin Wang",
      "Wenwu Zhu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2311.16496",
    "title": "DPOD: Domain-Specific Prompt Tuning for Multimodal Fake News Detection",
    "abstract": " Title: DPOD: Domain-Specific Prompt Tuning for Multimodal Fake News Detection ",
    "url": "https://arxiv.org/abs/2311.16496",
    "authors": [
      "Debarshi Brahma",
      "Amartya Bhattacharya",
      "Suraj Nagaje Mahadev",
      "Anmol Asati",
      "Vikas Verma",
      "Soma Biswas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.08338",
    "title": "Global Latent Neural Rendering",
    "abstract": " Comments: Accepted at CVPR 2024 ",
    "url": "https://arxiv.org/abs/2312.08338",
    "authors": [
      "Thomas Tanay",
      "Matteo Maggioni"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.08852",
    "title": "ERASE: Error-Resilient Representation Learning on Graphs for Label Noise  Tolerance",
    "abstract": " Comments: 24 pages, 14 figures, 15 tables and a project page at this https URL ",
    "url": "https://arxiv.org/abs/2312.08852",
    "authors": [
      "Ling-Hao Chen",
      "Yuanshuo Zhang",
      "Taohua Huang",
      "Liangcai Su",
      "Zeyi Lin",
      "Xi Xiao",
      "Xiaobo Xia",
      "Tongliang Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.14197",
    "title": "Benchmarking and Defending Against Indirect Prompt Injection Attacks on  Large Language Models",
    "abstract": " Title: Benchmarking and Defending Against Indirect Prompt Injection Attacks on  Large Language Models ",
    "url": "https://arxiv.org/abs/2312.14197",
    "authors": [
      "Jingwei Yi",
      "Yueqi Xie",
      "Bin Zhu",
      "Emre Kiciman",
      "Guangzhong Sun",
      "Xing Xie",
      "Fangzhao Wu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.16083",
    "title": "A Variational Autoencoder for Neural Temporal Point Processes with  Dynamic Latent Graphs",
    "abstract": " Comments: Accepted by AAAI-2024 ",
    "url": "https://arxiv.org/abs/2312.16083",
    "authors": [
      "Sikun Yang",
      "Hongyuan Zha"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2401.05871",
    "title": "Enhancing Personality Recognition in Dialogue by Data Augmentation and  Heterogeneous Conversational Graph Networks",
    "abstract": " Comments: This paper has been accepted for presentation at International Workshop on Spoken Dialogue Systems Technology 2024 (IWSDS 2024) ",
    "url": "https://arxiv.org/abs/2401.05871",
    "authors": [
      "Yahui Fu",
      "Haiyue Song",
      "Tianyu Zhao",
      "Tatsuya Kawahara"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.10632",
    "title": "Interventional Fairness on Partially Known Causal Graphs: A Constrained  Optimization Approach",
    "abstract": " Comments: Accepted to ICLR24 ",
    "url": "https://arxiv.org/abs/2401.10632",
    "authors": [
      "Aoqi Zuo",
      "Yiqing Li",
      "Susan Wei",
      "Mingming Gong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2401.12924",
    "title": "Performance Analysis of Support Vector Machine (SVM) on Challenging  Datasets for Forest Fire Detection",
    "abstract": " Comments: 19 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2401.12924",
    "authors": [
      "Ankan Kar",
      "Nirjhar Nath",
      "Utpalraj Kemprai",
      "Aman"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2401.14040",
    "title": "(Chat)GPT v BERT: Dawn of Justice for Semantic Change Detection",
    "abstract": " Comments: Accepted to the Findings of EACL 2024 ",
    "url": "https://arxiv.org/abs/2401.14040",
    "authors": [
      "Francesco Periti",
      "Haim Dubossarsky",
      "Nina Tahmasebi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.01943",
    "title": "Precedence-Constrained Winter Value for Effective Graph Data Valuation",
    "abstract": " Comments: 17 pages in total ",
    "url": "https://arxiv.org/abs/2402.01943",
    "authors": [
      "Hongliang Chi",
      "Wei Jin",
      "Charu Aggarwal",
      "Yao Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.02245",
    "title": "Revisiting Generative Adversarial Networks for Binary Semantic  Segmentation on Imbalanced Datasets",
    "abstract": " Title: Revisiting Generative Adversarial Networks for Binary Semantic  Segmentation on Imbalanced Datasets ",
    "url": "https://arxiv.org/abs/2402.02245",
    "authors": [
      "Lei Xu",
      "Moncef Gabbouj"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2402.04318",
    "title": "Human Observation-Inspired Trajectory Prediction for Autonomous Driving  in Mixed-Autonomy Traffic Environments",
    "abstract": " Title: Human Observation-Inspired Trajectory Prediction for Autonomous Driving  in Mixed-Autonomy Traffic Environments ",
    "url": "https://arxiv.org/abs/2402.04318",
    "authors": [
      "Haicheng Liao",
      "Shangqian Liu",
      "Yongkang Li",
      "Zhenning Li",
      "Chengyue Wang",
      "Yunjian Li",
      "Shengbo Eben Li",
      "Chengzhong Xu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2402.06295",
    "title": "Multimodal Interpretable Data-Driven Models for Early Prediction of  Antimicrobial Multidrug Resistance Using Multivariate Time-Series",
    "abstract": " Title: Multimodal Interpretable Data-Driven Models for Early Prediction of  Antimicrobial Multidrug Resistance Using Multivariate Time-Series ",
    "url": "https://arxiv.org/abs/2402.06295",
    "authors": [
      "Sergio Martínez-Agüero",
      "Antonio G. Marques",
      "Inmaculada Mora-Jiménez",
      "Joaquín Alvárez-Rodríguez",
      "Cristina Soguero-Ruiz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2402.11566",
    "title": "Boosting Semi-Supervised 2D Human Pose Estimation by Revisiting Data  Augmentation and Consistency Training",
    "abstract": " Comments: 14 pages. Semi-Supervised 2D Human Pose Estimation ",
    "url": "https://arxiv.org/abs/2402.11566",
    "authors": [
      "Huayi Zhou",
      "Mukun Luo",
      "Fei Jiang",
      "Yue Ding",
      "Hongtao Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.13005",
    "title": "SzCORE: A Seizure Community Open-source Research Evaluation framework  for the validation of EEG-based automated seizure detection algorithms",
    "abstract": " Title: SzCORE: A Seizure Community Open-source Research Evaluation framework  for the validation of EEG-based automated seizure detection algorithms ",
    "url": "https://arxiv.org/abs/2402.13005",
    "authors": [
      "Jonathan Dan",
      "Una Pale",
      "Alireza Amirshahi",
      "William Cappelletti",
      "Thorir Mar Ingolfsson",
      "Xiaying Wang",
      "Andrea Cossettini",
      "Adriano Bernini",
      "Luca Benini",
      "Sándor Beniczky",
      "David Atienza",
      "Philippe Ryvlin"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.13787",
    "title": "Fairness Rising from the Ranks: HITS and PageRank on Homophilic Networks",
    "abstract": " Comments: Accepted for publication in Proceedings of The Web Conference, 2024 ",
    "url": "https://arxiv.org/abs/2402.13787",
    "authors": [
      "Ana-Andreea Stoica",
      "Nelly Litvak",
      "Augustin Chaintreau"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2402.17269",
    "title": "Curriculum Learning Meets Directed Acyclic Graph for Multimodal Emotion  Recognition",
    "abstract": " Comments: Accepted by LREC-COLING 2024 ",
    "url": "https://arxiv.org/abs/2402.17269",
    "authors": [
      "Cam-Van Thi Nguyen",
      "Cao-Bach Nguyen",
      "Quang-Thuy Ha",
      "Duc-Trong Le"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.18152",
    "title": "Boosting Neural Representations for Videos with a Conditional Decoder",
    "abstract": " Comments: Accept by CVPR 2024 ",
    "url": "https://arxiv.org/abs/2402.18152",
    "authors": [
      "Xinjie Zhang",
      "Ren Yang",
      "Dailan He",
      "Xingtong Ge",
      "Tongda Xu",
      "Yan Wang",
      "Hongwei Qin",
      "Jun Zhang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.19095",
    "title": "A Protein Structure Prediction Approach Leveraging Transformer and CNN  Integration",
    "abstract": " Title: A Protein Structure Prediction Approach Leveraging Transformer and CNN  Integration ",
    "url": "https://arxiv.org/abs/2402.19095",
    "authors": [
      "Yanlin Zhou",
      "Kai Tan",
      "Xinyu Shen",
      "Zheng He",
      "Haotian Zheng"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.01663",
    "title": "PillarGen: Enhancing Radar Point Cloud Density and Quality via  Pillar-based Point Generation Network",
    "abstract": " Comments: Accepted by IEEE International Conference on Robotics and Automation (ICRA 2024), 8 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2403.01663",
    "authors": [
      "Jisong Kim",
      "Geonho Bang",
      "Kwangjin Choi",
      "Minjae Seong",
      "Jaechang Yoo",
      "Eunjong Pyo",
      "Jun Won Choi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.01872",
    "title": "The Canadian Traveller Problem on outerplanar graphs",
    "abstract": " Title: The Canadian Traveller Problem on outerplanar graphs ",
    "url": "https://arxiv.org/abs/2403.01872",
    "authors": [
      "Laurent Beaudou",
      "Pierre Bergé",
      "Vsevolod Chernyshev",
      "Antoine Dailly",
      "Yan Gerard",
      "Aurélie Lagoutte",
      "Vincent Limouzy",
      "Lucas Pastor"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2403.02148",
    "title": "MiM-ISTD: Mamba-in-Mamba for Efficient Infrared Small Target Detection",
    "abstract": " Comments: The first Mamba-based model for infrared small target detection ",
    "url": "https://arxiv.org/abs/2403.02148",
    "authors": [
      "Tianxiang Chen",
      "Zhentao Tan",
      "Tao Gong",
      "Qi Chu",
      "Yue Wu",
      "Bin Liu",
      "Jieping Ye",
      "Nenghai Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.03709",
    "title": "Portable, heterogeneous ensemble workflows at scale using libEnsemble",
    "abstract": " Title: Portable, heterogeneous ensemble workflows at scale using libEnsemble ",
    "url": "https://arxiv.org/abs/2403.03709",
    "authors": [
      "Stephen Hudson",
      "Jeffrey Larson",
      "John-Luke Navarro",
      "Stefan M. Wild"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2403.04202",
    "title": "Dynamics of Moral Behavior in Heterogeneous Populations of Learning  Agents",
    "abstract": " Title: Dynamics of Moral Behavior in Heterogeneous Populations of Learning  Agents ",
    "url": "https://arxiv.org/abs/2403.04202",
    "authors": [
      "Elizaveta Tennant",
      "Stephen Hailes",
      "Mirco Musolesi"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.04605",
    "title": "In-n-Out: Calibrating Graph Neural Networks for Link Prediction",
    "abstract": " Comments: 18 pages, 4 figures, 8 tables ",
    "url": "https://arxiv.org/abs/2403.04605",
    "authors": [
      "Erik Nascimento",
      "Diego Mesquita",
      "Samuel Kaski",
      "Amauri H Souza"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  }
]