[
  {
    "id": "arXiv:2404.12394",
    "title": "A Big Data Analytics System for Predicting Suicidal Ideation in  Real-Time Based on Social Media Streaming Data",
    "abstract": "Online social media platforms have recently become integral to our society and daily routines. Every day, users worldwide spend a couple of hours on such platforms, expressing their sentiments and emotional state and contacting each other. Analyzing such huge amounts of data from these platforms can provide a clear insight into public sentiments and help detect their mental status. The early identification of these health condition risks may assist in preventing or reducing the number of suicide ideation and potentially saving people's lives. The traditional techniques have become ineffective in processing such streams and large-scale datasets. Therefore, the paper proposed a new methodology based on a big data architecture to predict suicidal ideation from social media content. The proposed approach provides a practical analysis of social media data in two phases: batch processing and real-time streaming prediction. The batch dataset was collected from the Reddit forum and used for model building and training, while streaming big data was extracted using Twitter streaming API and used for real-time prediction. After the raw data was preprocessed, the extracted features were fed to multiple Apache Spark ML classifiers: NB, LR, LinearSVC, DT, RF, and MLP. We conducted various experiments using various feature-extraction techniques with different testing scenarios. The experimental results of the batch processing phase showed that the features extracted of (Unigram + Bigram) + CV-IDF with MLP classifier provided high performance for classifying suicidal ideation, with an accuracy of 93.47%, and then applied for real-time streaming prediction phase. ",
    "url": "https://arxiv.org/abs/2404.12394",
    "authors": [
      "Mohamed A. Allayla",
      "Serkan Ayvaz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2404.12399",
    "title": "Model Failure or Data Corruption? Exploring Inconsistencies in Building  Energy Ratings with Self-Supervised Contrastive Learning",
    "abstract": "Building Energy Rating (BER) stands as a pivotal metric, enabling building owners, policymakers, and urban planners to understand the energy-saving potential through improving building energy efficiency. As such, enhancing buildings' BER levels is expected to directly contribute to the reduction of carbon emissions and promote climate improvement. Nonetheless, the BER assessment process is vulnerable to missing and inaccurate measurements. In this study, we introduce \\texttt{CLEAR}, a data-driven approach designed to scrutinize the inconsistencies in BER assessments through self-supervised contrastive learning. We validated the effectiveness of \\texttt{CLEAR} using a dataset representing Irish building stocks. Our experiments uncovered evidence of inconsistent BER assessments, highlighting measurement data corruption within this real-world dataset. ",
    "url": "https://arxiv.org/abs/2404.12399",
    "authors": [
      "Qian Xiao",
      "Dan Liu",
      "Kevin Credit"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12400",
    "title": "Efflex: Efficient and Flexible Pipeline for Spatio-Temporal Trajectory  Graph Modeling and Representation Learning",
    "abstract": "In the landscape of spatio-temporal data analytics, effective trajectory representation learning is paramount. To bridge the gap of learning accurate representations with efficient and flexible mechanisms, we introduce Efflex, a comprehensive pipeline for transformative graph modeling and representation learning of the large-volume spatio-temporal trajectories. Efflex pioneers the incorporation of a multi-scale k-nearest neighbors (KNN) algorithm with feature fusion for graph construction, marking a leap in dimensionality reduction techniques by preserving essential data features. Moreover, the groundbreaking graph construction mechanism and the high-performance lightweight GCN increase embedding extraction speed by up to 36 times faster. We further offer Efflex in two versions, Efflex-L for scenarios demanding high accuracy, and Efflex-B for environments requiring swift data processing. Comprehensive experimentation with the Porto and Geolife datasets validates our approach, positioning Efflex as the state-of-the-art in the domain. Such enhancements in speed and accuracy highlight the versatility of Efflex, underscoring its wide-ranging potential for deployment in time-sensitive and computationally constrained applications. ",
    "url": "https://arxiv.org/abs/2404.12400",
    "authors": [
      "Ming Cheng",
      "Ziyi Zhou",
      "Bowen Zhang",
      "Ziyu Wang",
      "Jiaqi Gan",
      "Ziang Ren",
      "Weiqi Feng",
      "Yi Lyu",
      "Hefan Zhang",
      "Xingjian Diao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12401",
    "title": "Items or Relations -- what do Artificial Neural Networks learn?",
    "abstract": "What has an Artificial Neural Network (ANN) learned after being successfully trained to solve a task - the set of training items or the relations between them? This question is difficult to answer for modern applied ANNs because of their enormous size and complexity. Therefore, here we consider a low-dimensional network and a simple task, i.e., the network has to reproduce a set of training items identically. We construct the family of solutions analytically and use standard learning algorithms to obtain numerical solutions. These numerical solutions differ depending on the optimization algorithm and the weight initialization and are shown to be particular members of the family of analytical solutions. In this simple setting, we observe that the general structure of the network weights represents the training set's symmetry group, i.e., the relations between training items. As a consequence, linear networks generalize, i.e., reproduce items that were not part of the training set but are consistent with the symmetry of the training set. In contrast, non-linear networks tend to learn individual training items and show associative memory. At the same time, their ability to generalize is limited. A higher degree of generalization is obtained for networks whose activation function contains a linear regime, such as tanh. Our results suggest ANN's ability to generalize - instead of learning items - could be improved by generating a sufficiently big set of elementary operations to represent relations and strongly depends on the applied non-linearity. ",
    "url": "https://arxiv.org/abs/2404.12401",
    "authors": [
      "Renate Krause",
      "Stefan Reimann"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Discrete Mathematics (cs.DM)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2404.12403",
    "title": "Multi-Objective Hardware Aware Neural Architecture Search using Hardware  Cost Diversity",
    "abstract": "Hardware-aware Neural Architecture Search approaches (HW-NAS) automate the design of deep learning architectures, tailored specifically to a given target hardware platform. Yet, these techniques demand substantial computational resources, primarily due to the expensive process of assessing the performance of identified architectures. To alleviate this problem, a recent direction in the literature has employed representation similarity metric for efficiently evaluating architecture performance. Nonetheless, since it is inherently a single objective method, it requires multiple runs to identify the optimal architecture set satisfying the diverse hardware cost constraints, thereby increasing the search cost. Furthermore, simply converting the single objective into a multi-objective approach results in an under-explored architectural search space. In this study, we propose a Multi-Objective method to address the HW-NAS problem, called MO-HDNAS, to identify the trade-off set of architectures in a single run with low computational cost. This is achieved by optimizing three objectives: maximizing the representation similarity metric, minimizing hardware cost, and maximizing the hardware cost diversity. The third objective, i.e. hardware cost diversity, is used to facilitate a better exploration of the architecture search space. Experimental results demonstrate the effectiveness of our proposed method in efficiently addressing the HW-NAS problem across six edge devices for the image classification task. ",
    "url": "https://arxiv.org/abs/2404.12403",
    "authors": [
      "Nilotpal Sinha",
      "Peyman Rostami",
      "Abd El Rahman Shabayek",
      "Anis Kacem",
      "Djamila Aouada"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12408",
    "title": "Benchmarking changepoint detection algorithms on cardiac time series",
    "abstract": "The pattern of state changes in a biomedical time series can be related to health or disease. This work presents a principled approach for selecting a changepoint detection algorithm for a specific task, such as disease classification. Eight key algorithms were compared, and the performance of each algorithm was evaluated as a function of temporal tolerance, noise, and abnormal conduction (ectopy) on realistic artificial cardiovascular time series data. All algorithms were applied to real data (cardiac time series of 22 patients with REM-behavior disorder (RBD) and 15 healthy controls) using the parameters selected on artificial data. Finally, features were derived from the detected changepoints to classify RBD patients from healthy controls using a K-Nearest Neighbors approach. On artificial data, Modified Bayesian Changepoint Detection algorithm provided superior positive predictive value for state change identification while Recursive Mean Difference Maximization (RMDM) achieved the highest true positive rate. For the classification task, features derived from the RMDM algorithm provided the highest leave one out cross validated accuracy of 0.89 and true positive rate of 0.87. Automatically detected changepoints provide useful information about subject's physiological state which cannot be directly observed. However, the choice of change point detection algorithm depends on the nature of the underlying data and the downstream application, such as a classification task. This work represents the first time change point detection algorithms have been compared in a meaningful way and utilized in a classification task, which demonstrates the effect of changepoint algorithm choice on application performance. ",
    "url": "https://arxiv.org/abs/2404.12408",
    "authors": [
      "Ayse Cakmak",
      "Erik Reinertsen",
      "Shamim Nemati",
      "Gari D. Clifford"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2404.12418",
    "title": "The graph alignment problem: fundamental limits and efficient algorithms",
    "abstract": "This thesis studies the graph alignment problem, the noisy version of the graph isomorphism problem, which aims to find a matching between the nodes of two graphs which preserves most of the edges. Focusing on the planted version where the graphs are random, we are interested in understanding the fundamental information-theoretical limits for this problem, as well as designing and analyzing algorithms that are able to recover the underlying alignment in the data. For these algorithms, we give some high probability guarantees on the regime in which they succeed or fail. ",
    "url": "https://arxiv.org/abs/2404.12418",
    "authors": [
      "Luca Ganassali"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2404.12441",
    "title": "Distributed Model Predictive Control for Heterogeneous Platoons with  Affine Spacing Policies and Arbitrary Communication Topologies",
    "abstract": "This paper presents a distributed model predictive control (DMPC) algorithm for a heterogeneous platoon using arbitrary communication topologies, as long as each vehicle is able to communicate with a preceding vehicle in the platoon. The proposed DMPC algorithm is able to accommodate any spacing policy that is affine in a vehicle's velocity, which includes constant distance or constant time headway spacing policies. By analyzing the total cost for the entire platoon, a sufficient condition is derived to guarantee platoon asymptotic stability. Simulation experiments with a platoon of 50 vehicles and hardware experiments with a platoon of four 1/10th scale vehicles validate the algorithm and compare performance under different spacing policies and communication topologies. ",
    "url": "https://arxiv.org/abs/2404.12441",
    "authors": [
      "Michael H. Shaham",
      "Taskin Padir"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2404.12444",
    "title": "mOthello: When Do Cross-Lingual Representation Alignment and  Cross-Lingual Transfer Emerge in Multilingual Models?",
    "abstract": "Many pretrained multilingual models exhibit cross-lingual transfer ability, which is often attributed to a learned language-neutral representation during pretraining. However, it remains unclear what factors contribute to the learning of a language-neutral representation, and whether the learned language-neutral representation suffices to facilitate cross-lingual transfer. We propose a synthetic task, Multilingual Othello (mOthello), as a testbed to delve into these two questions. We find that: (1) models trained with naive multilingual pretraining fail to learn a language-neutral representation across all input languages; (2) the introduction of \"anchor tokens\" (i.e., lexical items that are identical across languages) helps cross-lingual representation alignment; and (3) the learning of a language-neutral representation alone is not sufficient to facilitate cross-lingual transfer. Based on our findings, we propose a novel approach - multilingual pretraining with unified output space - that both induces the learning of language-neutral representation and facilitates cross-lingual transfer. ",
    "url": "https://arxiv.org/abs/2404.12444",
    "authors": [
      "Tianze Hua",
      "Tian Yun",
      "Ellie Pavlick"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12445",
    "title": "Adaptive Catalyst Discovery Using Multicriteria Bayesian Optimization  with Representation Learning",
    "abstract": "High-performance catalysts are crucial for sustainable energy conversion and human health. However, the discovery of catalysts faces challenges due to the absence of efficient approaches to navigating vast and high-dimensional structure and composition spaces. In this study, we propose a high-throughput computational catalyst screening approach integrating density functional theory (DFT) and Bayesian Optimization (BO). Within the BO framework, we propose an uncertainty-aware atomistic machine learning model, UPNet, which enables automated representation learning directly from high-dimensional catalyst structures and achieves principled uncertainty quantification. Utilizing a constrained expected improvement acquisition function, our BO framework simultaneously considers multiple evaluation criteria. Using the proposed methods, we explore catalyst discovery for the CO2 reduction reaction. The results demonstrate that our approach achieves high prediction accuracy, facilitates interpretable feature extraction, and enables multicriteria design optimization, leading to significant reduction of computing power and time (10x reduction of required DFT calculations) in high-performance catalyst discovery. ",
    "url": "https://arxiv.org/abs/2404.12445",
    "authors": [
      "Jie Chen",
      "Pengfei Ou",
      "Yuxin Chang",
      "Hengrui Zhang",
      "Xiao-Yan Li",
      "Edward H. Sargent",
      "Wei Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2404.12460",
    "title": "NLP-enabled trajectory map-matching in urban road networks using  transformer sequence-to-sequence model",
    "abstract": "Large-scale geolocation telematics data acquired from connected vehicles has the potential to significantly enhance mobility infrastructures and operational systems within smart cities. To effectively utilize this data, it is essential to accurately match the geolocation data to the road segments. However, this matching is often not trivial due to the low sampling rate and errors exacerbated by multipath effects in urban environments. Traditionally, statistical modeling techniques such as Hidden-Markov models incorporating domain knowledge into the matching process have been extensively used for map-matching tasks. However, rule-based map-matching tasks are noise-sensitive and inefficient in processing large-scale trajectory data. Deep learning techniques directly learn the relationship between observed data and road networks from the data, often without the need for hand-crafted rules or domain knowledge. This renders them an efficient approach for map-matching large-scale datasets and makes them more robust to the noise. This paper introduces a sequence-to-sequence deep-learning model, specifically the transformer-based encoder-decoder model, to perform as a surrogate for map-matching algorithms. The encoder-decoder architecture initially encodes the series of noisy GPS points into a representation that automatically captures autoregressive behavior and spatial correlations between GPS points. Subsequently, the decoder associates data points with the road network features and thus transforms these representations into a sequence of road segments. The model is trained and evaluated using GPS traces collected in Manhattan, New York. Achieving an accuracy of 76%, transformer-based encoder-decoder models extensively employed in natural language processing presented a promising performance for translating noisy GPS data to the navigated routes in urban road networks. ",
    "url": "https://arxiv.org/abs/2404.12460",
    "authors": [
      "Sevin Mohammadi",
      "Andrew W. Smyth"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2404.12474",
    "title": "Learning a Stable, Safe, Distributed Feedback Controller for a  Heterogeneous Platoon of Vehicles",
    "abstract": "Platooning of autonomous vehicles has the potential to increase safety and fuel efficiency on highways. The goal of platooning is to have each vehicle drive at some speed (set by the leader) while maintaining a safe distance from its neighbors. Many prior works have analyzed various controllers for platooning, most commonly linear feedback and distributed model predictive controllers. In this work, we introduce an algorithm for learning a stable, safe, distributed controller for a heterogeneous platoon. Our algorithm relies on recent developments in learning neural network stability and safety certificates. We train a controller for autonomous platooning in simulation and evaluate its performance on hardware with a platoon of four F1Tenth vehicles. We then perform further analysis in simulation with a platoon of 100 vehicles. Experimental results demonstrate the practicality of the algorithm and the learned controller by comparing the performance of the neural network controller to linear feedback and distributed model predictive controllers. ",
    "url": "https://arxiv.org/abs/2404.12474",
    "authors": [
      "Michael H. Shaham",
      "Taskin Padir"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)",
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2404.12493",
    "title": "EnriCo: Enriched Representation and Globally Constrained Inference for  Entity and Relation Extraction",
    "abstract": "Joint entity and relation extraction plays a pivotal role in various applications, notably in the construction of knowledge graphs. Despite recent progress, existing approaches often fall short in two key aspects: richness of representation and coherence in output structure. These models often rely on handcrafted heuristics for computing entity and relation representations, potentially leading to loss of crucial information. Furthermore, they disregard task and/or dataset-specific constraints, resulting in output structures that lack coherence. In our work, we introduce EnriCo, which mitigates these shortcomings. Firstly, to foster rich and expressive representation, our model leverage attention mechanisms that allow both entities and relations to dynamically determine the pertinent information required for accurate extraction. Secondly, we introduce a series of decoding algorithms designed to infer the highest scoring solutions while adhering to task and dataset-specific constraints, thus promoting structured and coherent outputs. Our model demonstrates competitive performance compared to baselines when evaluated on Joint IE datasets. ",
    "url": "https://arxiv.org/abs/2404.12493",
    "authors": [
      "Urchade Zaratiana",
      "Nadi Tomeh",
      "Yann Dauxais",
      "Pierre Holat",
      "Thierry Charnois"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12501",
    "title": "SPIdepth: Strengthened Pose Information for Self-supervised Monocular  Depth Estimation",
    "abstract": "Self-supervised monocular depth estimation has garnered considerable attention for its applications in autonomous driving and robotics. While recent methods have made strides in leveraging techniques like the Self Query Layer (SQL) to infer depth from motion, they often overlook the potential of strengthening pose information. In this paper, we introduce SPIdepth, a novel approach that prioritizes enhancing the pose network for improved depth estimation. Building upon the foundation laid by SQL, SPIdepth emphasizes the importance of pose information in capturing fine-grained scene structures. By enhancing the pose network's capabilities, SPIdepth achieves remarkable advancements in scene understanding and depth estimation. Experimental results on benchmark datasets such as KITTI and Cityscapes showcase SPIdepth's state-of-the-art performance, surpassing previous methods by significant margins. Notably, SPIdepth's performance exceeds that of unsupervised models and, after finetuning on metric data, outperforms all existing methods. Remarkably, SPIdepth achieves these results using only a single image for inference, surpassing even methods that utilize video sequences for inference, thus demonstrating its efficacy and efficiency in real-world applications. Our approach represents a significant leap forward in self-supervised monocular depth estimation, underscoring the importance of strengthening pose information for advancing scene understanding in real-world applications. ",
    "url": "https://arxiv.org/abs/2404.12501",
    "authors": [
      "Mykola Lavreniuk"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2404.12509",
    "title": "Compositional Neural Textures",
    "abstract": "Texture plays a vital role in enhancing visual richness in both real photographs and computer-generated imagery. However, the process of editing textures often involves laborious and repetitive manual adjustments of textons, which are the small, recurring local patterns that define textures. In this work, we introduce a fully unsupervised approach for representing textures using a compositional neural model that captures individual textons. We represent each texton as a 2D Gaussian function whose spatial support approximates its shape, and an associated feature that encodes its detailed appearance. By modeling a texture as a discrete composition of Gaussian textons, the representation offers both expressiveness and ease of editing. Textures can be edited by modifying the compositional Gaussians within the latent space, and new textures can be efficiently synthesized by feeding the modified Gaussians through a generator network in a feed-forward manner. This approach enables a wide range of applications, including transferring appearance from an image texture to another image, diversifying textures, texture interpolation, revealing/modifying texture variations, edit propagation, texture animation, and direct texton manipulation. The proposed approach contributes to advancing texture analysis, modeling, and editing techniques, and opens up new possibilities for creating visually appealing images with controllable textures. ",
    "url": "https://arxiv.org/abs/2404.12509",
    "authors": [
      "Peihan Tu",
      "Li-Yi Wei",
      "Matthias Zwicker"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12512",
    "title": "Proteus: Preserving Model Confidentiality during Graph Optimizations",
    "abstract": "Deep learning (DL) models have revolutionized numerous domains, yet optimizing them for computational efficiency remains a challenging endeavor. Development of new DL models typically involves two parties: the model developers and performance optimizers. The collaboration between the parties often necessitates the model developers exposing the model architecture and computational graph to the optimizers. However, this exposure is undesirable since the model architecture is an important intellectual property, and its innovations require significant investments and expertise. During the exchange, the model is also vulnerable to adversarial attacks via model stealing. This paper presents Proteus, a novel mechanism that enables model optimization by an independent party while preserving the confidentiality of the model architecture. Proteus obfuscates the protected model by partitioning its computational graph into subgraphs and concealing each subgraph within a large pool of generated realistic subgraphs that cannot be easily distinguished from the original. We evaluate Proteus on a range of DNNs, demonstrating its efficacy in preserving confidentiality without compromising performance optimization opportunities. Proteus effectively hides the model as one alternative among up to $10^{32}$ possible model architectures, and is resilient against attacks with a learning-based adversary. We also demonstrate that heuristic based and manual approaches are ineffective in identifying the protected model. To our knowledge, Proteus is the first work that tackles the challenge of model confidentiality during performance optimization. Proteus will be open-sourced for direct use and experimentation, with easy integration with compilers such as ONNXRuntime. ",
    "url": "https://arxiv.org/abs/2404.12512",
    "authors": [
      "Yubo Gao",
      "Maryam Haghifam",
      "Christina Giannoula",
      "Renbo Tu",
      "Gennady Pekhimenko",
      "Nandita Vijaykumar"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12520",
    "title": "Centralized vs. Decentralized Multi-Agent Reinforcement Learning for  Enhanced Control of Electric Vehicle Charging Networks",
    "abstract": "The widespread adoption of electric vehicles (EVs) poses several challenges to power distribution networks and smart grid infrastructure due to the possibility of significantly increasing electricity demands, especially during peak hours. Furthermore, when EVs participate in demand-side management programs, charging expenses can be reduced by using optimal charging control policies that fully utilize real-time pricing schemes. However, devising optimal charging methods and control strategies for EVs is challenging due to various stochastic and uncertain environmental factors. Currently, most EV charging controllers operate based on a centralized model. In this paper, we introduce a novel approach for distributed and cooperative charging strategy using a Multi-Agent Reinforcement Learning (MARL) framework. Our method is built upon the Deep Deterministic Policy Gradient (DDPG) algorithm for a group of EVs in a residential community, where all EVs are connected to a shared transformer. This method, referred to as CTDE-DDPG, adopts a Centralized Training Decentralized Execution (CTDE) approach to establish cooperation between agents during the training phase, while ensuring a distributed and privacy-preserving operation during execution. We theoretically examine the performance of centralized and decentralized critics for the DDPG-based MARL implementation and demonstrate their trade-offs. Furthermore, we numerically explore the efficiency, scalability, and performance of centralized and decentralized critics. Our theoretical and numerical results indicate that, despite higher policy gradient variances and training complexity, the CTDE-DDPG framework significantly improves charging efficiency by reducing total variation by approximately %36 and charging cost by around %9.1 on average... ",
    "url": "https://arxiv.org/abs/2404.12520",
    "authors": [
      "Amin Shojaeighadikolaei",
      "Zsolt Talata",
      "Morteza Hashemi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12522",
    "title": "Neural Active Learning Beyond Bandits",
    "abstract": "We study both stream-based and pool-based active learning with neural network approximations. A recent line of works proposed bandit-based approaches that transformed active learning into a bandit problem, achieving both theoretical and empirical success. However, the performance and computational costs of these methods may be susceptible to the number of classes, denoted as $K$, due to this transformation. Therefore, this paper seeks to answer the question: \"How can we mitigate the adverse impacts of $K$ while retaining the advantages of principled exploration and provable performance guarantees in active learning?\" To tackle this challenge, we propose two algorithms based on the newly designed exploitation and exploration neural networks for stream-based and pool-based active learning. Subsequently, we provide theoretical performance guarantees for both algorithms in a non-parametric setting, demonstrating a slower error-growth rate concerning $K$ for the proposed approaches. We use extensive experiments to evaluate the proposed algorithms, which consistently outperform state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2404.12522",
    "authors": [
      "Yikun Ban",
      "Ishika Agarwal",
      "Ziwei Wu",
      "Yada Zhu",
      "Kommy Weldemariam",
      "Hanghang Tong",
      "Jingrui He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12538",
    "title": "TrACT: A Training Dynamics Aware Contrastive Learning Framework for  Long-tail Trajectory Prediction",
    "abstract": "As a safety critical task, autonomous driving requires accurate predictions of road users' future trajectories for safe motion planning, particularly under challenging conditions. Yet, many recent deep learning methods suffer from a degraded performance on the challenging scenarios, mainly because these scenarios appear less frequently in the training data. To address such a long-tail issue, existing methods force challenging scenarios closer together in the feature space during training to trigger information sharing among them for more robust learning. These methods, however, primarily rely on the motion patterns to characterize scenarios, omitting more informative contextual information, such as interactions and scene layout. We argue that exploiting such information not only improves prediction accuracy but also scene compliance of the generated trajectories. In this paper, we propose to incorporate richer training dynamics information into a prototypical contrastive learning framework. More specifically, we propose a two-stage process. First, we generate rich contextual features using a baseline encoder-decoder framework. These features are split into clusters based on the model's output errors, using the training dynamics information, and a prototype is computed within each cluster. Second, we retrain the model using the prototypes in a contrastive learning framework. We conduct empirical evaluations of our approach using two large-scale naturalistic datasets and show that our method achieves state-of-the-art performance by improving accuracy and scene compliance on the long-tail samples. Furthermore, we perform experiments on a subset of the clusters to highlight the additional benefit of our approach in reducing training bias. ",
    "url": "https://arxiv.org/abs/2404.12538",
    "authors": [
      "Junrui Zhang",
      "Mozhgan Pourkeshavarz",
      "Amir Rasouli"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12554",
    "title": "Learning Stable and Passive Neural Differential Equations",
    "abstract": "In this paper, we introduce a novel class of neural differential equation, which are intrinsically Lyapunov stable, exponentially stable or passive. We take a recently proposed Polyak Lojasiewicz network (PLNet) as an Lyapunov function and then parameterize the vector field as the descent directions of the Lyapunov function. The resulting models have a same structure as the general Hamiltonian dynamics, where the Hamiltonian is lower- and upper-bounded by quadratic functions. Moreover, it is also positive definite w.r.t. either a known or learnable equilibrium. We illustrate the effectiveness of the proposed model on a damped double pendulum system. ",
    "url": "https://arxiv.org/abs/2404.12554",
    "authors": [
      "Jing Cheng",
      "Ruigang Wang",
      "Ian R. Manchester"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12569",
    "title": "Multi-View Subgraph Neural Networks: Self-Supervised Learning with  Scarce Labeled Data",
    "abstract": "While graph neural networks (GNNs) have become the de-facto standard for graph-based node classification, they impose a strong assumption on the availability of sufficient labeled samples. This assumption restricts the classification performance of prevailing GNNs on many real-world applications suffering from low-data regimes. Specifically, features extracted from scarce labeled nodes could not provide sufficient supervision for the unlabeled samples, leading to severe over-fitting. In this work, we point out that leveraging subgraphs to capture long-range dependencies can augment the representation of a node with homophily properties, thus alleviating the low-data regime. However, prior works leveraging subgraphs fail to capture the long-range dependencies among nodes. To this end, we present a novel self-supervised learning framework, called multi-view subgraph neural networks (Muse), for handling long-range dependencies. In particular, we propose an information theory-based identification mechanism to identify two types of subgraphs from the views of input space and latent space, respectively. The former is to capture the local structure of the graph, while the latter captures the long-range dependencies among nodes. By fusing these two views of subgraphs, the learned representations can preserve the topological properties of the graph at large, including the local structure and long-range dependencies, thus maximizing their expressiveness for downstream node classification tasks. Experimental results show that Muse outperforms the alternative methods on node classification tasks with limited labeled data. ",
    "url": "https://arxiv.org/abs/2404.12569",
    "authors": [
      "Zhenzhong Wang",
      "Qingyuan Zeng",
      "Wanyu Lin",
      "Min Jiang",
      "Kay Chen Tan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12575",
    "title": "On the use of adversarial validation for quantifying dissimilarity in  geospatial machine learning prediction",
    "abstract": "Recent geospatial machine learning studies have shown that the results of model evaluation via cross-validation (CV) are strongly affected by the dissimilarity between the sample data and the prediction locations. In this paper, we propose a method to quantify such a dissimilarity in the interval 0 to 100%, and from the perspective of the data feature space. The proposed method is based on adversarial validation, which is an approach that can check whether sample data and prediction locations can be separated with a binary classifier. To study the effectiveness and generality of our method, we tested it on a series of experiments based on both synthetic and real datasets and with gradually increasing dissimilarities. Results show that the proposed method can successfully quantify dissimilarity across the entire range of values. Next to this, we studied how dissimilarity affects CV evaluations by comparing the results of random CV and of two spatial CV methods, namely block and spatial+ CV. Our results showed that CV evaluations follow similar patterns in all datasets and predictions: when dissimilarity is low (usually lower than 30%), random CV provides the most accurate evaluation results. As dissimilarity increases, spatial CV methods, especially spatial+ CV, become more and more accurate and even outperforming random CV. When dissimilarity is high (>=90%), no CV method provides accurate evaluations. These results show the importance of considering feature space dissimilarity when working with geospatial machine learning predictions, and can help researchers and practitioners to select more suitable CV methods for evaluating their predictions. ",
    "url": "https://arxiv.org/abs/2404.12575",
    "authors": [
      "Yanwen Wang",
      "Mahdi Khodadadzadeh",
      "Raul Zurita-Milla"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12587",
    "title": "Reinforcement Learning Approach for Integrating Compressed Contexts into  Knowledge Graphs",
    "abstract": "The widespread use of knowledge graphs in various fields has brought about a challenge in effectively integrating and updating information within them. When it comes to incorporating contexts, conventional methods often rely on rules or basic machine learning models, which may not fully grasp the complexity and fluidity of context information. This research suggests an approach based on reinforcement learning (RL), specifically utilizing Deep Q Networks (DQN) to enhance the process of integrating contexts into knowledge graphs. By considering the state of the knowledge graph as environment states defining actions as operations for integrating contexts and using a reward function to gauge the improvement in knowledge graph quality post-integration, this method aims to automatically develop strategies for optimal context integration. Our DQN model utilizes networks as function approximators, continually updating Q values to estimate the action value function, thus enabling effective integration of intricate and dynamic context information. Initial experimental findings show that our RL method outperforms techniques in achieving precise context integration across various standard knowledge graph datasets, highlighting the potential and effectiveness of reinforcement learning in enhancing and managing knowledge graphs. ",
    "url": "https://arxiv.org/abs/2404.12587",
    "authors": [
      "Ngoc Quach",
      "Qi Wang",
      "Zijun Gao",
      "Qifeng Sun",
      "Bo Guan",
      "Lillian Floyd"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12594",
    "title": "Random Network Distillation Based Deep Reinforcement Learning for AGV  Path Planning",
    "abstract": "With the flourishing development of intelligent warehousing systems, the technology of Automated Guided Vehicle (AGV) has experienced rapid growth. Within intelligent warehousing environments, AGV is required to safely and rapidly plan an optimal path in complex and dynamic environments. Most research has studied deep reinforcement learning to address this challenge. However, in the environments with sparse extrinsic rewards, these algorithms often converge slowly, learn inefficiently or fail to reach the target. Random Network Distillation (RND), as an exploration enhancement, can effectively improve the performance of proximal policy optimization, especially enhancing the additional intrinsic rewards of the AGV agent which is in sparse reward environments. Moreover, most of the current research continues to use 2D grid mazes as experimental environments. These environments have insufficient complexity and limited action sets. To solve this limitation, we present simulation environments of AGV path planning with continuous actions and positions for AGVs, so that it can be close to realistic physical scenarios. Based on our experiments and comprehensive analysis of the proposed method, the results demonstrate that our proposed method enables AGV to more rapidly complete path planning tasks with continuous actions in our environments. A video of part of our experiments can be found at https://youtu.be/lwrY9YesGmw. ",
    "url": "https://arxiv.org/abs/2404.12594",
    "authors": [
      "Huilin Yin",
      "Shengkai Su",
      "Yinjia Lin",
      "Pengju Zhen",
      "Karin Festl",
      "Daniel Watzenig"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12602",
    "title": "A visualization method for data domain changes in CNN networks and the  optimization method for selecting thresholds in classification tasks",
    "abstract": "In recent years, Face Anti-Spoofing (FAS) has played a crucial role in preserving the security of face recognition technology. With the rise of counterfeit face generation techniques, the challenge posed by digitally edited faces to face anti-spoofing is escalating. Existing FAS technologies primarily focus on intercepting physically forged faces and lack a robust solution for cross-domain FAS challenges. Moreover, determining an appropriate threshold to achieve optimal deployment results remains an issue for intra-domain FAS. To address these issues, we propose a visualization method that intuitively reflects the training outcomes of models by visualizing the prediction results on datasets. Additionally, we demonstrate that employing data augmentation techniques, such as downsampling and Gaussian blur, can effectively enhance performance on cross-domain tasks. Building upon our data visualization approach, we also introduce a methodology for setting threshold values based on the distribution of the training dataset. Ultimately, our methods secured us second place in both the Unified Physical-Digital Face Attack Detection competition and the Snapshot Spectral Imaging Face Anti-spoofing contest. The training code is available at https://github.com/SeaRecluse/CVPRW2024. ",
    "url": "https://arxiv.org/abs/2404.12602",
    "authors": [
      "Minzhe Huang",
      "Changwei Nie",
      "Weihong Zhong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12612",
    "title": "SA-Attack: Speed-adaptive stealthy adversarial attack on trajectory  prediction",
    "abstract": "Trajectory prediction is critical for the safe planning and navigation of automated vehicles. The trajectory prediction models based on the neural networks are vulnerable to adversarial attacks. Previous attack methods have achieved high attack success rates but overlook the adaptability to realistic scenarios and the concealment of the deceits. To address this problem, we propose a speed-adaptive stealthy adversarial attack method named SA-Attack. This method searches the sensitive region of trajectory prediction models and generates the adversarial trajectories by using the vehicle-following method and incorporating information about forthcoming trajectories. Our method has the ability to adapt to different speed scenarios by reconstructing the trajectory from scratch. Fusing future trajectory trends and curvature constraints can guarantee the smoothness of adversarial trajectories, further ensuring the stealthiness of attacks. The empirical study on the datasets of nuScenes and Apolloscape demonstrates the attack performance of our proposed method. Finally, we also demonstrate the adaptability and stealthiness of SA-Attack for different speed scenarios. Our code is available at the repository: https://github.com/eclipse-bot/SA-Attack. ",
    "url": "https://arxiv.org/abs/2404.12612",
    "authors": [
      "Huilin Yin",
      "Jiaxiang Li",
      "Pengju Zhen",
      "Jun Yan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.12617",
    "title": "Greedy Detection and Exclusion of Multiple Faults using Euclidean  Distance Matrices",
    "abstract": "Numerous methods have been proposed for global navigation satellite system (GNSS) receivers to detect faulty GNSS signals. One such fault detection and exclusion (FDE) method is based on the mathematical concept of Euclidean distance matrices (EDMs). This paper outlines a greedy approach that uses an improved Euclidean distance matrix-based fault detection and exclusion algorithm. The novel greedy EDM FDE method implements a new fault detection test statistic and fault exclusion strategy that drastically simplifies the complexity of the algorithm over previous work. To validate the novel greedy EDM FDE algorithm, we created a simulated dataset using receiver locations from around the globe. The simulated dataset allows us to verify our results on 2,601 different satellite geometries. Additionally, we tested the greedy EDM FDE algorithm using a real-world dataset from seven different android phones. Across both the simulated and real-world datasets, the Python implementation of the greedy EDM FDE algorithm is shown to be computed an order of magnitude more rapidly than a comparable greedy residual FDE method while obtaining similar fault exclusion accuracy. We provide discussion on the comparative time complexities of greedy EDM FDE, greedy residual FDE, and solution separation. We also explain potential modifications to greedy residual FDE that can be added to alter performance characteristics. ",
    "url": "https://arxiv.org/abs/2404.12617",
    "authors": [
      "Derek Knowles",
      "Grace Gao"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2404.12628",
    "title": "Efficient infusion of self-supervised representations in Automatic  Speech Recognition",
    "abstract": "Self-supervised learned (SSL) models such as Wav2vec and HuBERT yield state-of-the-art results on speech-related tasks. Given the effectiveness of such models, it is advantageous to use them in conventional ASR systems. While some approaches suggest incorporating these models as a trainable encoder or a learnable frontend, training such systems is extremely slow and requires a lot of computation cycles. In this work, we propose two simple approaches that use (1) framewise addition and (2) cross-attention mechanisms to efficiently incorporate the representations from the SSL model(s) into the ASR architecture, resulting in models that are comparable in size with standard encoder-decoder conformer systems while also avoiding the usage of SSL models during training. Our approach results in faster training and yields significant performance gains on the Librispeech and Tedlium datasets compared to baselines. We further provide detailed analysis and ablation studies that demonstrate the effectiveness of our approach. ",
    "url": "https://arxiv.org/abs/2404.12628",
    "authors": [
      "Darshan Prabhu",
      "Sai Ganesh Mirishkar",
      "Pankaj Wasnik"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.12631",
    "title": "Breaching the Bottleneck: Evolutionary Transition from Reward-Driven  Learning to Reward-Agnostic Domain-Adapted Learning in Neuromodulated Neural  Nets",
    "abstract": "Advanced biological intelligence learns efficiently from an information-rich stream of stimulus information, even when feedback on behaviour quality is sparse or absent. Such learning exploits implicit assumptions about task domains. We refer to such learning as Domain-Adapted Learning (DAL). In contrast, AI learning algorithms rely on explicit externally provided measures of behaviour quality to acquire fit behaviour. This imposes an information bottleneck that precludes learning from diverse non-reward stimulus information, limiting learning efficiency. We consider the question of how biological evolution circumvents this bottleneck to produce DAL. We propose that species first evolve the ability to learn from reward signals, providing inefficient (bottlenecked) but broad adaptivity. From there, integration of non-reward information into the learning process can proceed via gradual accumulation of biases induced by such information on specific task domains. This scenario provides a biologically plausible pathway towards bottleneck-free, domain-adapted learning. Focusing on the second phase of this scenario, we set up a population of NNs with reward-driven learning modelled as Reinforcement Learning (A2C), and allow evolution to improve learning efficiency by integrating non-reward information into the learning process using a neuromodulatory update mechanism. On a navigation task in continuous 2D space, evolved DAL agents show a 300-fold increase in learning speed compared to pure RL agents. Evolution is found to eliminate reliance on reward information altogether, allowing DAL agents to learn from non-reward information exclusively, using local neuromodulation-based connection weight updates only. ",
    "url": "https://arxiv.org/abs/2404.12631",
    "authors": [
      "Solvi Arnold",
      "Reiji Suzuki",
      "Takaya Arita",
      "Kimitoshi Yamazaki"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12633",
    "title": "FlagVNE: A Flexible and Generalizable Reinforcement Learning Framework  for Network Resource Allocation",
    "abstract": "Virtual network embedding (VNE) is an essential resource allocation task in network virtualization, aiming to map virtual network requests (VNRs) onto physical infrastructure. Reinforcement learning (RL) has recently emerged as a promising solution to this problem. However, existing RL-based VNE methods are limited by the unidirectional action design and one-size-fits-all training strategy, resulting in restricted searchability and generalizability. In this paper, we propose a FLexible And Generalizable RL framework for VNE, named FlagVNE. Specifically, we design a bidirectional action-based Markov decision process model that enables the joint selection of virtual and physical nodes, thus improving the exploration flexibility of solution space. To tackle the expansive and dynamic action space, we design a hierarchical decoder to generate adaptive action probability distributions and ensure high training efficiency. Furthermore, to overcome the generalization issue for varying VNR sizes, we propose a meta-RL-based training method with a curriculum scheduling strategy, facilitating specialized policy training for each VNR size. Finally, extensive experimental results show the effectiveness of FlagVNE across multiple key metrics. Our code is available at GitHub (https://github.com/GeminiLight/flag-vne). ",
    "url": "https://arxiv.org/abs/2404.12633",
    "authors": [
      "Tianfu Wang",
      "Qilin Fan",
      "Chao Wang",
      "Long Yang",
      "Leilei Ding",
      "Nicholas Jing Yuan",
      "Hui Xiong"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2404.12634",
    "title": "Transformer-Based Classification Outcome Prediction for Multimodal  Stroke Treatment",
    "abstract": "This study proposes a multi-modal fusion framework Multitrans based on the Transformer architecture and self-attention mechanism. This architecture combines the study of non-contrast computed tomography (NCCT) images and discharge diagnosis reports of patients undergoing stroke treatment, using a variety of methods based on Transformer architecture approach to predicting functional outcomes of stroke treatment. The results show that the performance of single-modal text classification is significantly better than single-modal image classification, but the effect of multi-modal combination is better than any single modality. Although the Transformer model only performs worse on imaging data, when combined with clinical meta-diagnostic information, both can learn better complementary information and make good contributions to accurately predicting stroke treatment effects.. ",
    "url": "https://arxiv.org/abs/2404.12634",
    "authors": [
      "Danqing Ma",
      "Meng Wang",
      "Ao Xiang",
      "Zongqing Qi",
      "Qin Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12635",
    "title": "AED-PADA:Improving Generalizability of Adversarial Example Detection via  Principal Adversarial Domain Adaptation",
    "abstract": "Adversarial example detection, which can be conveniently applied in many scenarios, is important in the area of adversarial defense. Unfortunately, existing detection methods suffer from poor generalization performance, because their training process usually relies on the examples generated from a single known adversarial attack and there exists a large discrepancy between the training and unseen testing adversarial examples. To address this issue, we propose a novel method, named Adversarial Example Detection via Principal Adversarial Domain Adaptation (AED-PADA). Specifically, our approach identifies the Principal Adversarial Domains (PADs), i.e., a combination of features of the adversarial examples from different attacks, which possesses large coverage of the entire adversarial feature space. Then, we pioneer to exploit multi-source domain adaptation in adversarial example detection with PADs as source domains. Experiments demonstrate the superior generalization ability of our proposed AED-PADA. Note that this superiority is particularly achieved in challenging scenarios characterized by employing the minimal magnitude constraint for the perturbations. ",
    "url": "https://arxiv.org/abs/2404.12635",
    "authors": [
      "Heqi Peng",
      "Yunhong Wang",
      "Ruijie Yang",
      "Beichen Li",
      "Rui Wang",
      "Yuanfang Guo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12653",
    "title": "How Real Is Real? A Human Evaluation Framework for Unrestricted  Adversarial Examples",
    "abstract": "With an ever-increasing reliance on machine learning (ML) models in the real world, adversarial examples threaten the safety of AI-based systems such as autonomous vehicles. In the image domain, they represent maliciously perturbed data points that look benign to humans (i.e., the image modification is not noticeable) but greatly mislead state-of-the-art ML models. Previously, researchers ensured the imperceptibility of their altered data points by restricting perturbations via $\\ell_p$ norms. However, recent publications claim that creating natural-looking adversarial examples without such restrictions is also possible. With much more freedom to instill malicious information into data, these unrestricted adversarial examples can potentially overcome traditional defense strategies as they are not constrained by the limitations or patterns these defenses typically recognize and mitigate. This allows attackers to operate outside of expected threat models. However, surveying existing image-based methods, we noticed a need for more human evaluations of the proposed image modifications. Based on existing human-assessment frameworks for image generation quality, we propose SCOOTER - an evaluation framework for unrestricted image-based attacks. It provides researchers with guidelines for conducting statistically significant human experiments, standardized questions, and a ready-to-use implementation. We propose a framework that allows researchers to analyze how imperceptible their unrestricted attacks truly are. ",
    "url": "https://arxiv.org/abs/2404.12653",
    "authors": [
      "Dren Fazlija",
      "Arkadij Orlov",
      "Johanna Schrader",
      "Monty-Maximilian Zühlke",
      "Michael Rohs",
      "Daniel Kudenko"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12659",
    "title": "SOS-1K: A Fine-grained Suicide Risk Classification Dataset for Chinese  Social Media Analysis",
    "abstract": "In the social media, users frequently express personal emotions, a subset of which may indicate potential suicidal tendencies. The implicit and varied forms of expression in internet language complicate accurate and rapid identification of suicidal intent on social media, thus creating challenges for timely intervention efforts. The development of deep learning models for suicide risk detection is a promising solution, but there is a notable lack of relevant datasets, especially in the Chinese context. To address this gap, this study presents a Chinese social media dataset designed for fine-grained suicide risk classification, focusing on indicators such as expressions of suicide intent, methods of suicide, and urgency of timing. Seven pre-trained models were evaluated in two tasks: high and low suicide risk, and fine-grained suicide risk classification on a level of 0 to 10. In our experiments, deep learning models show good performance in distinguishing between high and low suicide risk, with the best model achieving an F1 score of 88.39%. However, the results for fine-grained suicide risk classification were still unsatisfactory, with an weighted F1 score of 50.89%. To address the issues of data imbalance and limited dataset size, we investigated both traditional and advanced, large language model based data augmentation techniques, demonstrating that data augmentation can enhance model performance by up to 4.65% points in F1-score. Notably, the Chinese MentalBERT model, which was pre-trained on psychological domain data, shows superior performance in both tasks. This study provides valuable insights for automatic identification of suicidal individuals, facilitating timely psychological intervention on social media platforms. The source code and data are publicly available. ",
    "url": "https://arxiv.org/abs/2404.12659",
    "authors": [
      "Hongzhi Qi",
      "Hanfei Liu",
      "Jianqiang Li",
      "Qing Zhao",
      "Wei Zhai",
      "Dan Luo",
      "Tian Yu He",
      "Shuo Liu",
      "Bing Xiang Yang",
      "Guanghui Fu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.12678",
    "title": "Exploring Interactive Semantic Alignment for Efficient HOI Detection  with Vision-language Model",
    "abstract": "Human-Object Interaction (HOI) detection aims to localize human-object pairs and comprehend their interactions. Recently, two-stage transformer-based methods have demonstrated competitive performance. However, these methods frequently focus on object appearance features and ignore global contextual information. Besides, vision-language model CLIP which effectively aligns visual and text embeddings has shown great potential in zero-shot HOI detection. Based on the former facts, We introduce a novel HOI detector named ISA-HOI, which extensively leverages knowledge from CLIP, aligning interactive semantics between visual and textual features. We first extract global context of image and local features of object to Improve interaction Features in images (IF). On the other hand, we propose a Verb Semantic Improvement (VSI) module to enhance textual features of verb labels via cross-modal fusion. Ultimately, our method achieves competitive results on the HICO-DET and V-COCO benchmarks with much fewer training epochs, and outperforms the state-of-the-art under zero-shot settings. ",
    "url": "https://arxiv.org/abs/2404.12678",
    "authors": [
      "Jihao Dong",
      "Renjie Pan",
      "Hua Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.12679",
    "title": "MLSD-GAN -- Generating Strong High Quality Face Morphing Attacks using  Latent Semantic Disentanglement",
    "abstract": "Face-morphing attacks are a growing concern for biometric researchers, as they can be used to fool face recognition systems (FRS). These attacks can be generated at the image level (supervised) or representation level (unsupervised). Previous unsupervised morphing attacks have relied on generative adversarial networks (GANs). More recently, researchers have used linear interpolation of StyleGAN-encoded images to generate morphing attacks. In this paper, we propose a new method for generating high-quality morphing attacks using StyleGAN disentanglement. Our approach, called MLSD-GAN, spherically interpolates the disentangled latents to produce realistic and diverse morphing attacks. We evaluate the vulnerability of MLSD-GAN on two deep-learning-based FRS techniques. The results show that MLSD-GAN poses a significant threat to FRS, as it can generate morphing attacks that are highly effective at fooling these systems. ",
    "url": "https://arxiv.org/abs/2404.12679",
    "authors": [
      "Aravinda Reddy PN",
      "Raghavendra Ramachandra",
      "Krothapalli Sreenivasa Rao",
      "Pabitra Mitra"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.12680",
    "title": "VoxAtnNet: A 3D Point Clouds Convolutional Neural Network for  Generalizable Face Presentation Attack Detection",
    "abstract": "Facial biometrics are an essential components of smartphones to ensure reliable and trustworthy authentication. However, face biometric systems are vulnerable to Presentation Attacks (PAs), and the availability of more sophisticated presentation attack instruments such as 3D silicone face masks will allow attackers to deceive face recognition systems easily. In this work, we propose a novel Presentation Attack Detection (PAD) algorithm based on 3D point clouds captured using the frontal camera of a smartphone to detect presentation attacks. The proposed PAD algorithm, VoxAtnNet, processes 3D point clouds to obtain voxelization to preserve the spatial structure. Then, the voxelized 3D samples were trained using the novel convolutional attention network to detect PAs on the smartphone. Extensive experiments were carried out on the newly constructed 3D face point cloud dataset comprising bona fide and two different 3D PAIs (3D silicone face mask and wrap photo mask), resulting in 3480 samples. The performance of the proposed method was compared with existing methods to benchmark the detection performance using three different evaluation protocols. The experimental results demonstrate the improved performance of the proposed method in detecting both known and unknown face presentation attacks. ",
    "url": "https://arxiv.org/abs/2404.12680",
    "authors": [
      "Raghavendra Ramachandra",
      "Narayan Vetrekar",
      "Sushma Venkatesh",
      "Savita Nageshker",
      "Jag Mohan Singh",
      "R. S. Gad"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.12693",
    "title": "Improving Chinese Character Representation with Formation Tree",
    "abstract": "Learning effective representations for Chinese characters presents unique challenges, primarily due to the vast number of characters and their continuous growth, which requires models to handle an expanding category space. Additionally, the inherent sparsity of character usage complicates the generalization of learned representations. Prior research has explored radical-based sequences to overcome these issues, achieving progress in recognizing unseen characters. However, these approaches fail to fully exploit the inherent tree structure of such sequences. To address these limitations and leverage established data properties, we propose Formation Tree-CLIP (FT-CLIP). This model utilizes formation trees to represent characters and incorporates a dedicated tree encoder, significantly improving performance in both seen and unseen character recognition tasks. We further introduce masking for to both character images and tree nodes, enabling efficient and effective training. This approach accelerates training significantly (by a factor of 2 or more) while enhancing accuracy. Extensive experiments show that processing characters through formation trees aligns better with their inherent properties than direct sequential methods, significantly enhancing the generality and usability of the representations. ",
    "url": "https://arxiv.org/abs/2404.12693",
    "authors": [
      "Yang Hong",
      "Yinfei Li",
      "Xiaojun Qiao",
      "Rui Li",
      "Junsong Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12694",
    "title": "ESC: Evolutionary Stitched Camera Calibration in the Wild",
    "abstract": "This work introduces a novel end-to-end approach for estimating extrinsic parameters of cameras in multi-camera setups on real-life sports fields. We identify the source of significant calibration errors in multi-camera environments and address the limitations of existing calibration methods, particularly the disparity between theoretical models and actual sports field characteristics. We propose the Evolutionary Stitched Camera calibration (ESC) algorithm to bridge this gap. It consists of image segmentation followed by evolutionary optimization of a novel loss function, providing a unified and accurate multi-camera calibration solution with high visual fidelity. The outcome allows the creation of virtual stitched views from multiple video sources, being as important for practical applications as numerical accuracy. We demonstrate the superior performance of our approach compared to state-of-the-art methods across diverse real-life football fields with varying physical characteristics. ",
    "url": "https://arxiv.org/abs/2404.12694",
    "authors": [
      "Grzegorz Rypeść",
      "Grzegorz Kurzejamski"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2404.12698",
    "title": "Neural Semantic Parsing with Extremely Rich Symbolic Meaning  Representations",
    "abstract": "Current open-domain neural semantics parsers show impressive performance. However, closer inspection of the symbolic meaning representations they produce reveals significant weaknesses: sometimes they tend to merely copy character sequences from the source text to form symbolic concepts, defaulting to the most frequent word sense based in the training distribution. By leveraging the hierarchical structure of a lexical ontology, we introduce a novel compositional symbolic representation for concepts based on their position in the taxonomical hierarchy. This representation provides richer semantic information and enhances interpretability. We introduce a neural \"taxonomical\" semantic parser to utilize this new representation system of predicates, and compare it with a standard neural semantic parser trained on the traditional meaning representation format, employing a novel challenge set and evaluation metric for evaluation. Our experimental findings demonstrate that the taxonomical model, trained on much richer and complex meaning representations, is slightly subordinate in performance to the traditional model using the standard metrics for evaluation, but outperforms it when dealing with out-of-vocabulary concepts. This finding is encouraging for research in computational semantics that aims to combine data-driven distributional meanings with knowledge-based symbolic representations. ",
    "url": "https://arxiv.org/abs/2404.12698",
    "authors": [
      "Xiao Zhang",
      "Gosse Bouma",
      "Johan Bos"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.12702",
    "title": "Modeling Multi-Granularity Context Information Flow for Pavement Crack  Detection",
    "abstract": "Crack detection has become an indispensable, interesting yet challenging task in the computer vision community. Specially, pavement cracks have a highly complex spatial structure, a low contrasting background and a weak spatial continuity, posing a significant challenge to an effective crack detection method. In this paper, we address these problems from a view that utilizes contexts of the cracks and propose an end-to-end deep learning method to model the context information flow. To precisely localize crack from an image, it is critical to effectively extract and aggregate multi-granularity context, including the fine-grained local context around the cracks (in spatial-level) and the coarse-grained semantics (in segment-level). Concretely, in Convolutional Neural Network (CNN), low-level features extracted by the shallow layers represent the local information, while the deep layers extract the semantic features. Additionally, a second main insight in this work is that the semantic context should be an guidance to local context feature. By the above insights, the proposed method we first apply the dilated convolution as the backbone feature extractor to model local context, then we build a context guidance module to leverage semantic context to guide local feature extraction at multiple stages. To handle label alignment between stages, we apply the Multiple Instance Learning (MIL) strategy to align the high-level feature to the low-level ones in the stage-wise context flow. In addition, compared with these public crack datasets, to our best knowledge, we release the largest, most complex and most challenging Bitumen Pavement Crack (BPC) dataset. The experimental results on the three crack datasets demonstrate that the proposed method performs well and outperforms the current state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2404.12702",
    "authors": [
      "Junbiao Pang",
      "Baocheng Xiong",
      "Jiaqi Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.12703",
    "title": "GALÆXI: Solving complex compressible flows with high-order  discontinuous Galerkin methods on accelerator-based systems",
    "abstract": "This work presents GAL{\\AE}XI as a novel, energy-efficient flow solver for the simulation of compressible flows on unstructured meshes leveraging the parallel computing power of modern Graphics Processing Units (GPUs). GAL{\\AE}XI implements the high-order Discontinuous Galerkin Spectral Element Method (DGSEM) using shock capturing with a finite-volume subcell approach to ensure the stability of the high-order scheme near shocks. This work provides details on the general code design, the parallelization strategy, and the implementation approach for the compute kernels with a focus on the element local mappings between volume and surface data due to the unstructured mesh. GAL{\\AE}XI exhibits excellent strong scaling properties up to 1024 GPUs if each GPU is assigned a minimum of one million degrees of freedom degrees of freedom. To verify its implementation, a convergence study is performed that recovers the theoretical order of convergence of the implemented numerical schemes. Moreover, the solver is validated using both the incompressible and compressible formulation of the Taylor-Green-Vortex at a Mach number of 0.1 and 1.25, respectively. A mesh convergence study shows that the results converge to the high-fidelity reference solution and that the results match the original CPU implementation. Finally, GAL{\\AE}XI is applied to a large-scale wall-resolved large eddy simulation of a linear cascade of the NASA Rotor 37. Here, the supersonic region and shocks at the leading edge are captured accurately and robustly by the implemented shock-capturing approach. It is demonstrated that GAL{\\AE}XI requires less than half of the energy to carry out this simulation in comparison to the reference CPU implementation. This renders GAL{\\AE}XI as a potent tool for accurate and efficient simulations of compressible flows in the realm of exascale computing and the associated new HPC architectures. ",
    "url": "https://arxiv.org/abs/2404.12703",
    "authors": [
      "Daniel Kempf",
      "Marius Kurz",
      "Marcel Blind",
      "Patrick Kopper",
      "Philipp Offenhäuser",
      "Anna Schwarz",
      "Spencer Starr",
      "Jens Keim",
      "Andrea Beck"
    ],
    "subjectives": [
      "Mathematical Software (cs.MS)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2404.12704",
    "title": "A Clean-graph Backdoor Attack against Graph Convolutional Networks with  Poisoned Label Only",
    "abstract": "Graph Convolutional Networks (GCNs) have shown excellent performance in dealing with various graph structures such as node classification, graph classification and other tasks. However,recent studies have shown that GCNs are vulnerable to a novel threat known as backdoor attacks. However, all existing backdoor attacks in the graph domain require modifying the training samples to accomplish the backdoor injection, which may not be practical in many realistic scenarios where adversaries have no access to modify the training samples and may leads to the backdoor attack being detected easily. In order to explore the backdoor vulnerability of GCNs and create a more practical and stealthy backdoor attack method, this paper proposes a clean-graph backdoor attack against GCNs (CBAG) in the node classification task,which only poisons the training labels without any modification to the training samples, revealing that GCNs have this security vulnerability. Specifically, CBAG designs a new trigger exploration method to find important feature dimensions as the trigger patterns to improve the attack performance. By poisoning the training labels, a hidden backdoor is injected into the GCNs model. Experimental results show that our clean graph backdoor can achieve 99% attack success rate while maintaining the functionality of the GCNs model on benign samples. ",
    "url": "https://arxiv.org/abs/2404.12704",
    "authors": [
      "Jiazhu Dai",
      "Haoyu Sun"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12712",
    "title": "uTRAND: Unsupervised Anomaly Detection in Traffic Trajectories",
    "abstract": "Deep learning-based approaches have achieved significant improvements on public video anomaly datasets, but often do not perform well in real-world applications. This paper addresses two issues: the lack of labeled data and the difficulty of explaining the predictions of a neural network. To this end, we present a framework called uTRAND, that shifts the problem of anomalous trajectory prediction from the pixel space to a semantic-topological domain. The framework detects and tracks all types of traffic agents in bird's-eye-view videos of traffic cameras mounted at an intersection. By conceptualizing the intersection as a patch-based graph, it is shown that the framework learns and models the normal behaviour of traffic agents without costly manual labeling. Furthermore, uTRAND allows to formulate simple rules to classify anomalous trajectories in a way suited for human interpretation. We show that uTRAND outperforms other state-of-the-art approaches on a dataset of anomalous trajectories collected in a real-world setting, while producing explainable detection results. ",
    "url": "https://arxiv.org/abs/2404.12712",
    "authors": [
      "Giacomo D'Amicantonio",
      "Egor Bondarau",
      "Peter H.N. de With"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12713",
    "title": "Energy Conserved Failure Detection for NS-IoT Systems",
    "abstract": "Nowadays, network slicing (NS) technology has gained widespread adoption within Internet of Things (IoT) systems to meet diverse customized requirements. In the NS based IoT systems, the detection of equipment failures necessitates comprehensive equipment monitoring, which leads to significant resource utilization, particularly within large-scale IoT ecosystems. Thus, the imperative task of reducing failure rates while optimizing monitoring costs has emerged. In this paper, we propose a monitor application function (MAF) based dynamic dormancy monitoring mechanism for the novel NS-IoT system, which is based on a network data analysis function (NWDAF) framework defined in Rel-17. Within the NS-IoT system, all nodes are organized into groups, and multiple MAFs are deployed to monitor each group of nodes. We also propose a dormancy monitor mechanism to mitigate the monitoring energy consumption by placing the MAFs, which is monitoring non-failure devices, in a dormant state. We propose a reinforcement learning based PPO algorithm to guide the dynamic dormancy of MAFs. Simulation results demonstrate that our dynamic dormancy strategy maximizes energy conservation, while proposed algorithm outperforms alternatives in terms of efficiency and stability. ",
    "url": "https://arxiv.org/abs/2404.12713",
    "authors": [
      "Guojin Liu",
      "Jianhong Zhou",
      "Hang Su",
      "Biaohong Xiong",
      "Xianhua Niu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2404.12715",
    "title": "Enabling Ensemble Learning for Heterogeneous Large Language Models with  Deep Parallel Collaboration",
    "abstract": "Large language models (LLMs) have shown complementary strengths in various tasks and instances, motivating the research of ensembling LLMs to push the frontier leveraging the wisdom of the crowd. Existing work achieves this objective via training the extra reward model or fusion model to select or fuse all candidate answers. However, these methods pose a great challenge to the generalizability of the trained models. Besides, existing methods use the textual responses as communication media, ignoring the rich information in the inner representations of neural networks. Therefore, we propose a training-free ensemble framework DEEPEN, averaging the probability distributions outputted by different LLMs. A key challenge in this paradigm is the vocabulary discrepancy between heterogeneous LLMs, which hinders the operation of probability distribution averaging. To address this challenge, DEEPEN maps the probability distribution of each model from the probability space to a universe relative space based on the relative representation theory, and performs aggregation. Then, the result of aggregation is mapped back to the probability space of one LLM via a search-based inverse transformation to determine the generated token. We conduct experiments on the ensemble of various LLMs of 6B to 70B. Experimental results show that DEEPEN achieves consistent improvements across six popular benchmarks involving subject examination, reasoning and knowledge-QA, proving the effectiveness of our approach. ",
    "url": "https://arxiv.org/abs/2404.12715",
    "authors": [
      "Yichong Huang",
      "Xiaocheng Feng",
      "Baohang Li",
      "Yang Xiang",
      "Hui Wang",
      "Bing Qin",
      "Ting Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.12718",
    "title": "Improving Prediction Accuracy of Semantic Segmentation Methods Using  Convolutional Autoencoder Based Pre-processing Layers",
    "abstract": "In this paper, we propose a method to improve prediction accuracy of semantic segmentation methods as follows: (1) construct a neural network that has pre-processing layers based on a convolutional autoencoder ahead of a semantic segmentation network, and (2) train the entire network initialized by the weights of the pre-trained autoencoder. We applied this method to the fully convolutional network (FCN) and experimentally compared its prediction accuracy on the cityscapes dataset. The Mean IoU of the proposed target model with the He normal initialization is 18.7% higher than that of FCN with the He normal initialization. In addition, those of the modified models of the target model are significantly higher than that of FCN with the He normal initialization. The accuracy and loss curves during the training showed that these are resulting from the improvement of the generalization ability. All of these results provide strong evidence that the proposed method is significantly effective in improving the prediction accuracy of FCN. The proposed method has the following features: it is comparatively simple, whereas the effect on improving the generalization ability and prediction accuracy of FCN is significant; the increase in the number of parameters by using it is very small, and that in the computation time is substantially large. In principle, the proposed method can be applied to other semantic segmentation methods. For semantic segmentation, at present, there is no effective way to improve the prediction accuracy of existing methods. None have published a method which is the same as or similar to our method and none have used such a method in practice. Therefore, we believe that our method is useful in practice and worthy of being widely known and used. ",
    "url": "https://arxiv.org/abs/2404.12718",
    "authors": [
      "Hisashi Shimodaira"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12724",
    "title": "Graph Learning Dual Graph Convolutional Network For Semi-Supervised Node  Classification With Subgraph Sketch",
    "abstract": "In this paper, we propose the G raph Learning D ual G raph Convolutional Neural Network called GLDGCN based on the classical Graph Convolutional Neural Network by introducing dual convolutional layer and graph learning layer. We apply GLDGCN to the semi-supervised node classification task. Compared with the baseline methods, we achieve higher classification accuracy on three citation networks Citeseer, Cora and Pubmed, and we also analyze and discussabout selection of the hyperparameters and network depth. GLDGCN also perform well on the classic social network KarateClub and the new Wiki-CS dataset. For the insufficient ability of our algorithm to process large graph data during the experiment, we also introduce subgraph clustering and stochastic gradient descent technology into GCN and design a semi-supervised node classification algorithm based on the CLustering G raph Convolutional neural Network, which enables GCN to process large graph and improves its application value. We complete semi-supervised node classification experiments on two classical large graph which are PPI data sets (more than 50,000 nodes) and Reddit data sets (more than 200,000 nodes), and also perform well. ",
    "url": "https://arxiv.org/abs/2404.12724",
    "authors": [
      "Zibin Huang",
      "Jun Xian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12730",
    "title": "PATE-TripleGAN: Privacy-Preserving Image Synthesis with Gaussian  Differential Privacy",
    "abstract": "Conditional Generative Adversarial Networks (CGANs) exhibit significant potential in supervised learning model training by virtue of their ability to generate realistic labeled images. However, numerous studies have indicated the privacy leakage risk in CGANs models. The solution DPCGAN, incorporating the differential privacy framework, faces challenges such as heavy reliance on labeled data for model training and potential disruptions to original gradient information due to excessive gradient clipping, making it difficult to ensure model accuracy. To address these challenges, we present a privacy-preserving training framework called PATE-TripleGAN. This framework incorporates a classifier to pre-classify unlabeled data, establishing a three-party min-max game to reduce dependence on labeled data. Furthermore, we present a hybrid gradient desensitization algorithm based on the Private Aggregation of Teacher Ensembles (PATE) framework and Differential Private Stochastic Gradient Descent (DPSGD) method. This algorithm allows the model to retain gradient information more effectively while ensuring privacy protection, thereby enhancing the model's utility. Privacy analysis and extensive experiments affirm that the PATE-TripleGAN model can generate a higher quality labeled image dataset while ensuring the privacy of the training data. ",
    "url": "https://arxiv.org/abs/2404.12730",
    "authors": [
      "Zepeng Jiang",
      "Weiwei Ni",
      "Yifan Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12745",
    "title": "Recurrent Neural Networks for Modelling Gross Primary Production",
    "abstract": "Accurate quantification of Gross Primary Production (GPP) is crucial for understanding terrestrial carbon dynamics. It represents the largest atmosphere-to-land CO$_2$ flux, especially significant for forests. Eddy Covariance (EC) measurements are widely used for ecosystem-scale GPP quantification but are globally sparse. In areas lacking local EC measurements, remote sensing (RS) data are typically utilised to estimate GPP after statistically relating them to in-situ data. Deep learning offers novel perspectives, and the potential of recurrent neural network architectures for estimating daily GPP remains underexplored. This study presents a comparative analysis of three architectures: Recurrent Neural Networks (RNNs), Gated Recurrent Units (GRUs), and Long-Short Term Memory (LSTMs). Our findings reveal comparable performance across all models for full-year and growing season predictions. Notably, LSTMs outperform in predicting climate-induced GPP extremes. Furthermore, our analysis highlights the importance of incorporating radiation and RS inputs (optical, temperature, and radar) for accurate GPP predictions, particularly during climate extremes. ",
    "url": "https://arxiv.org/abs/2404.12745",
    "authors": [
      "David Montero",
      "Miguel D. Mahecha",
      "Francesco Martinuzzi",
      "César Aybar",
      "Anne Klosterhalfen",
      "Alexander Knohl",
      "Franziska Koebsch",
      "Jesús Anaya",
      "Sebastian Wieneke"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12746",
    "title": "Near-Tight Runtime Guarantees for Many-Objective Evolutionary Algorithms",
    "abstract": "Despite significant progress in the field of mathematical runtime analysis of multi-objective evolutionary algorithms (MOEAs), the performance of MOEAs on discrete many-objective problems is little understood. In particular, the few existing bounds for the SEMO, global SEMO, and SMS-EMOA algorithms on classic benchmarks are all roughly quadratic in the size of the Pareto front. In this work, we prove near-tight runtime guarantees for these three algorithms on the four most common benchmark problems OneMinMax, CountingOnesCountingZeros, LeadingOnesTrailingZeros, and OneJumpZeroJump, and this for arbitrary numbers of objectives. Our bounds depend only linearly on the Pareto front size, showing that these MOEAs on these benchmarks cope much better with many objectives than what previous works suggested. Our bounds are tight apart from small polynomial factors in the number of objectives and length of bitstrings. This is the first time that such tight bounds are proven for many-objective uses of these MOEAs. While it is known that such results cannot hold for the NSGA-II, we do show that our bounds, via a recent structural result, transfer to the NSGA-III algorithm. ",
    "url": "https://arxiv.org/abs/2404.12746",
    "authors": [
      "Simon Wietheger",
      "Benjamin Doerr"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2404.12754",
    "title": "Adaptive Regularization of Representation Rank as an Implicit Constraint  of Bellman Equation",
    "abstract": "Representation rank is an important concept for understanding the role of Neural Networks (NNs) in Deep Reinforcement learning (DRL), which measures the expressive capacity of value networks. Existing studies focus on unboundedly maximizing this rank; nevertheless, that approach would introduce overly complex models in the learning, thus undermining performance. Hence, fine-tuning representation rank presents a challenging and crucial optimization problem. To address this issue, we find a guiding principle for adaptive control of the representation rank. We employ the Bellman equation as a theoretical foundation and derive an upper bound on the cosine similarity of consecutive state-action pairs representations of value networks. We then leverage this upper bound to propose a novel regularizer, namely BEllman Equation-based automatic rank Regularizer (BEER). This regularizer adaptively regularizes the representation rank, thus improving the DRL agent's performance. We first validate the effectiveness of automatic control of rank on illustrative experiments. Then, we scale up BEER to complex continuous control tasks by combining it with the deterministic policy gradient method. Among 12 challenging DeepMind control tasks, BEER outperforms the baselines by a large margin. Besides, BEER demonstrates significant advantages in Q-value approximation. Our code is available at https://github.com/sweetice/BEER-ICLR2024. ",
    "url": "https://arxiv.org/abs/2404.12754",
    "authors": [
      "Qiang He",
      "Tianyi Zhou",
      "Meng Fang",
      "Setareh Maghsudi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12757",
    "title": "Meta Distribution of Passive Electromagnetic Field Exposure in Cellular  Networks",
    "abstract": "This paper focuses on the meta distribution of electromagnetic field exposure (EMFE) experienced by a passive user in a cellular network implementing dynamic beamforming. The meta distribution serves as a valuable tool for extracting fine-grained insights into statistics of individual passive user EMFE across the network. A comprehensive stochastic geometry framework is established for this analysis. Given the pivotal role of accurately modeling the main and side lobes of antennas in this context, a multi-cosine gain model is introduced. The meta distribution is closely approximated by a beta distribution derived from its first- and second-order moments, which is demonstrated to be mathematically tractable. The impact of the number of antennas in the ULA on the meta distribution is explored, shedding light on its sensitivity to this parameter. ",
    "url": "https://arxiv.org/abs/2404.12757",
    "authors": [
      "Quentin Gontier",
      "Charles Wiame",
      "François Horlin",
      "Christo Tsigros",
      "Claude Oestges",
      "Philippe De Doncker"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2404.12765",
    "title": "Analysis of effects to scientific impact indicators based on the  coevolution of coauthorship and citation networks",
    "abstract": "While computer modeling and simulation are crucial for understanding scientometrics, their practical use in literature remains somewhat limited. In this study, we establish a joint coauthorship and citation network using preferential attachment. As papers get published, we update the coauthorship network based on each paper's author list, representing the collaborative team behind it. This team is formed considering the number of collaborations each author has, and we introduce new authors at a fixed probability, expanding the coauthorship network. Simultaneously, as each paper cites a specific number of references, we add an equivalent number of citations to the citation network upon publication. The likelihood of a paper being cited depends on its existing citations, fitness value, and age. Then we calculate the journal impact factor and h-index, using them as examples of scientific impact indicators. After thorough validation, we conduct case studies to analyze the impact of different parameters on the journal impact factor and h-index. The findings reveal that increasing the reference number N or reducing the paper's lifetime {\\theta} significantly boosts the journal impact factor and average h-index. On the other hand, enlarging the team size m without introducing new authors or decreasing the probability of newcomers p notably increases the average h-index. In conclusion, it is evident that various parameters influence scientific impact indicators, and their interpretation can be manipulated by authors. Thus, exploring the impact of these parameters and continually refining scientific impact indicators are essential. The modeling and simulation method serves as a powerful tool in this ongoing process, and the model can be easily extended to include other scientific impact indicators and scenarios. ",
    "url": "https://arxiv.org/abs/2404.12765",
    "authors": [
      "Haobai Xue"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)"
    ]
  },
  {
    "id": "arXiv:2404.12770",
    "title": "Camera Agnostic Two-Head Network for Ego-Lane Inference",
    "abstract": "Vision-based ego-lane inference using High-Definition (HD) maps is essential in autonomous driving and advanced driver assistance systems. The traditional approach necessitates well-calibrated cameras, which confines variation of camera configuration, as the algorithm relies on intrinsic and extrinsic calibration. In this paper, we propose a learning-based ego-lane inference by directly estimating the ego-lane index from a single image. To enhance robust performance, our model incorporates the two-head structure inferring ego-lane in two perspectives simultaneously. Furthermore, we utilize an attention mechanism guided by vanishing point-and-line to adapt to changes in viewpoint without requiring accurate calibration. The high adaptability of our model was validated in diverse environments, devices, and camera mounting points and orientations. ",
    "url": "https://arxiv.org/abs/2404.12770",
    "authors": [
      "Chaehyeon Song",
      "Sungho Yoon",
      "Minhyeok Heo",
      "Ayoung Kim",
      "Sujung Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2404.12777",
    "title": "EfficientGS: Streamlining Gaussian Splatting for Large-Scale  High-Resolution Scene Representation",
    "abstract": "In the domain of 3D scene representation, 3D Gaussian Splatting (3DGS) has emerged as a pivotal technology. However, its application to large-scale, high-resolution scenes (exceeding 4k$\\times$4k pixels) is hindered by the excessive computational requirements for managing a large number of Gaussians. Addressing this, we introduce 'EfficientGS', an advanced approach that optimizes 3DGS for high-resolution, large-scale scenes. We analyze the densification process in 3DGS and identify areas of Gaussian over-proliferation. We propose a selective strategy, limiting Gaussian increase to key primitives, thereby enhancing the representational efficiency. Additionally, we develop a pruning mechanism to remove redundant Gaussians, those that are merely auxiliary to adjacent ones. For further enhancement, we integrate a sparse order increment for Spherical Harmonics (SH), designed to alleviate storage constraints and reduce training overhead. Our empirical evaluations, conducted on a range of datasets including extensive 4K+ aerial images, demonstrate that 'EfficientGS' not only expedites training and rendering times but also achieves this with a model size approximately tenfold smaller than conventional 3DGS while maintaining high rendering fidelity. ",
    "url": "https://arxiv.org/abs/2404.12777",
    "authors": [
      "Wenkai Liu",
      "Tao Guan",
      "Bin Zhu",
      "Lili Ju",
      "Zikai Song",
      "Dan Li",
      "Yuesong Wang",
      "Wei Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.12778",
    "title": "Defending against Data Poisoning Attacks in Federated Learning via User  Elimination",
    "abstract": "In the evolving landscape of Federated Learning (FL), a new type of attacks concerns the research community, namely Data Poisoning Attacks, which threaten the model integrity by maliciously altering training data. This paper introduces a novel defensive framework focused on the strategic elimination of adversarial users within a federated model. We detect those anomalies in the aggregation phase of the Federated Algorithm, by integrating metadata gathered by the local training instances with Differential Privacy techniques, to ensure that no data leakage is possible. To our knowledge, this is the first proposal in the field of FL that leverages metadata other than the model's gradients in order to ensure honesty in the reported local models. Our extensive experiments demonstrate the efficacy of our methods, significantly mitigating the risk of data poisoning while maintaining user privacy and model performance. Our findings suggest that this new user elimination approach serves us with a great balance between privacy and utility, thus contributing to the arsenal of arguments in favor of the safe adoption of FL in safe domains, both in academic setting and in the industry. ",
    "url": "https://arxiv.org/abs/2404.12778",
    "authors": [
      "Nick Galanis"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.12782",
    "title": "Sentiment-oriented Transformer-based Variational Autoencoder Network for  Live Video Commenting",
    "abstract": "Automatic live video commenting is with increasing attention due to its significance in narration generation, topic explanation, etc. However, the diverse sentiment consideration of the generated comments is missing from the current methods. Sentimental factors are critical in interactive commenting, and lack of research so far. Thus, in this paper, we propose a Sentiment-oriented Transformer-based Variational Autoencoder (So-TVAE) network which consists of a sentiment-oriented diversity encoder module and a batch attention module, to achieve diverse video commenting with multiple sentiments and multiple semantics. Specifically, our sentiment-oriented diversity encoder elegantly combines VAE and random mask mechanism to achieve semantic diversity under sentiment guidance, which is then fused with cross-modal features to generate live video comments. Furthermore, a batch attention module is also proposed in this paper to alleviate the problem of missing sentimental samples, caused by the data imbalance, which is common in live videos as the popularity of videos varies. Extensive experiments on Livebot and VideoIC datasets demonstrate that the proposed So-TVAE outperforms the state-of-the-art methods in terms of the quality and diversity of generated comments. Related code is available at https://github.com/fufy1024/So-TVAE. ",
    "url": "https://arxiv.org/abs/2404.12782",
    "authors": [
      "Fengyi Fu",
      "Shancheng Fang",
      "Weidong Chen",
      "Zhendong Mao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12786",
    "title": "Unlocking the Potential of Local CSI in Cell-Free Networks with Channel  Aging and Fronthaul Delays",
    "abstract": "It is generally believed that downlink cell-free networks perform best under centralized implementations where the local channel state information (CSI) acquired by the access-points (AP) is forwarded to one or more central processing units (CPU) for the computation of the joint precoders based on global CSI. However, mostly due to limited fronthaul capabilities, this procedure incurs some delay that may lead to partially outdated precoding decisions and hence performance degradation. In some scenarios, this may even lead to worse performance than distributed implementations where the precoders are locally computed by the APs based on partial yet timely local CSI. To address this issue, this study considers the problem of robust precoding design merging the benefits of timely local CSI and delayed global CSI. As main result, we provide a novel distributed precoding design based on the recently proposed team minimum mean-square error method. As a byproduct, we also obtain novel insights related to the AP-CPU functional split problem. Our main conclusion, corroborated by simulations, is that the opportunity of performing some local precoding computations at the APs should not be neglected, even in centralized implementations. ",
    "url": "https://arxiv.org/abs/2404.12786",
    "authors": [
      "Lorenzo Miretti",
      "Sławomir Stańczak"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2404.12800",
    "title": "Zadeh's Type-2 Fuzzy Logic Systems: Precision and High-Quality  Prediction Intervals",
    "abstract": "General Type-2 (GT2) Fuzzy Logic Systems (FLSs) are perfect candidates to quantify uncertainty, which is crucial for informed decisions in high-risk tasks, as they are powerful tools in representing uncertainty. In this paper, we travel back in time to provide a new look at GT2-FLSs by adopting Zadeh's (Z) GT2 Fuzzy Set (FS) definition, intending to learn GT2-FLSs that are capable of achieving reliable High-Quality Prediction Intervals (HQ-PI) alongside precision. By integrating Z-GT2-FS with the \\(\\alpha\\)-plane representation, we show that the design flexibility of GT2-FLS is increased as it takes away the dependency of the secondary membership function from the primary membership function. After detailing the construction of Z-GT2-FLSs, we provide solutions to challenges while learning from high-dimensional data: the curse of dimensionality, and integrating Deep Learning (DL) optimizers. We develop a DL framework for learning dual-focused Z-GT2-FLSs with high performances. Our study includes statistical analyses, highlighting that the Z-GT2-FLS not only exhibits high-precision performance but also produces HQ-PIs in comparison to its GT2 and IT2 fuzzy counterparts which have more learnable parameters. The results show that the Z-GT2-FLS has a huge potential in uncertainty quantification. ",
    "url": "https://arxiv.org/abs/2404.12800",
    "authors": [
      "Yusuf Guven",
      "Ata Koklu",
      "Tufan Kumbasar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12802",
    "title": "Enhancing Interval Type-2 Fuzzy Logic Systems: Learning for Precision  and Prediction Intervals",
    "abstract": "In this paper, we tackle the task of generating Prediction Intervals (PIs) in high-risk scenarios by proposing enhancements for learning Interval Type-2 (IT2) Fuzzy Logic Systems (FLSs) to address their learning challenges. In this context, we first provide extra design flexibility to the Karnik-Mendel (KM) and Nie-Tan (NT) center of sets calculation methods to increase their flexibility for generating PIs. These enhancements increase the flexibility of KM in the defuzzification stage while the NT in the fuzzification stage. To address the large-scale learning challenge, we transform the IT2-FLS's constraint learning problem into an unconstrained form via parameterization tricks, enabling the direct application of deep learning optimizers. To address the curse of dimensionality issue, we expand the High-Dimensional Takagi-Sugeno-Kang (HTSK) method proposed for type-1 FLS to IT2-FLSs, resulting in the HTSK2 approach. Additionally, we introduce a framework to learn the enhanced IT2-FLS with a dual focus, aiming for high precision and PI generation. Through exhaustive statistical results, we reveal that HTSK2 effectively addresses the dimensionality challenge, while the enhanced KM and NT methods improved learning and enhanced uncertainty quantification performances of IT2-FLSs. ",
    "url": "https://arxiv.org/abs/2404.12802",
    "authors": [
      "Ata Koklu",
      "Yusuf Guven",
      "Tufan Kumbasar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12813",
    "title": "Open Datasets for AI-Enabled Radio Resource Control in Non-Terrestrial  Networks",
    "abstract": "By effectively implementing the strategies for resource allocation, the capabilities, and reliability of non-terrestrial networks (NTN) can be enhanced. This leads to enhance spectrum utilization performance while minimizing the unmet system capacity, meeting quality of service (QoS) requirements and overall system optimization. In turn, a wide range of applications and services in various domains can be supported. However, allocating resources in a multi-constellation system with heterogeneous satellite links and highly dynamic user traffic demand pose challenges in ensuring sufficient and fair resource distribution. To mitigate these complexities and minimize the overhead, there is a growing shift towards utilizing artificial intelligence (AI) for its ability to handle such problems effectively. This calls for the development of an intelligent decision-making controller using AI to efficiently manage resources in this complex environment. In this context, real-world open datasets play a pivotal role in the development of AI models addressing radio control optimization problems. As a matter of fact, acquiring suitable datasets can be arduous. Therefore, this paper identifies pertinent real-world open datasets representing realistic traffic pattern, network performances and demand for fixed and dynamic user terminals, enabling a variety of uses cases. The aim of gathering and publishing the information of these datasets are to inspire and assist the research community in crafting the advance resource management solutions. In a nutshell, this paper establishes a solid foundation of commercially accessible data, with the potential to set benchmarks and accelerate the resolution of resource allocation optimization challenges. ",
    "url": "https://arxiv.org/abs/2404.12813",
    "authors": [
      "Husnain Shahid",
      "Miguel Angel Vazquez",
      "Laurent Reynaud",
      "Fanny Parzysz",
      "Musbah Shaat"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2404.12819",
    "title": "Unveiling the Ambiguity in Neural Inverse Rendering: A Parameter  Compensation Analysis",
    "abstract": "Inverse rendering aims to reconstruct the scene properties of objects solely from multiview images. However, it is an ill-posed problem prone to producing ambiguous estimations deviating from physically accurate representations. In this paper, we utilize Neural Microfacet Fields (NMF), a state-of-the-art neural inverse rendering method to illustrate the inherent ambiguity. We propose an evaluation framework to assess the degree of compensation or interaction between the estimated scene properties, aiming to explore the mechanisms behind this ill-posed problem and potential mitigation strategies. Specifically, we introduce artificial perturbations to one scene property and examine how adjusting another property can compensate for these perturbations. To facilitate such experiments, we introduce a disentangled NMF where material properties are independent. The experimental findings underscore the intrinsic ambiguity present in neural inverse rendering and highlight the importance of providing additional guidance through geometry, material, and illumination priors. ",
    "url": "https://arxiv.org/abs/2404.12819",
    "authors": [
      "Georgios Kouros",
      "Minye Wu",
      "Sushruth Nagesh",
      "Xianling Zhang",
      "Tinne Tuytelaars"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.12827",
    "title": "CT-ADE: An Evaluation Benchmark for Adverse Drug Event Prediction from  Clinical Trial Results",
    "abstract": "Adverse drug events (ADEs) significantly impact clinical research and public health, contributing to failures in clinical trials and leading to increased healthcare costs. The accurate prediction and management of ADEs are crucial for improving the development of safer, more effective medications, and enhancing patient outcomes. To support this effort, we introduce CT-ADE, a novel dataset compiled to enhance the predictive modeling of ADEs. Encompassing over 12,000 instances extracted from clinical trial results, the CT-ADE dataset integrates drug, patient population, and contextual information for multilabel ADE classification tasks in monopharmacy treatments, providing a comprehensive resource for developing advanced predictive models. To mirror the complex nature of ADEs, annotations are standardized at the system organ class level of the Medical Dictionary for Regulatory Activities (MedDRA) ontology. Preliminary analyses using baseline models have demonstrated promising results, achieving 73.33% F1 score and 81.54% balanced accuracy, highlighting CT-ADE's potential to advance ADE prediction. CT-ADE provides an essential tool for researchers aiming to leverage the power of artificial intelligence and machine learning to enhance patient safety and minimize the impact of ADEs on pharmaceutical research and development. Researchers interested in using the CT-ADE dataset can find all necessary resources at https://github.com/xxxx/xxxx. ",
    "url": "https://arxiv.org/abs/2404.12827",
    "authors": [
      "Anthony Yazdani",
      "Alban Bornet",
      "Boya Zhang",
      "Philipp Khlebnikov",
      "Poorya Amini",
      "Douglas Teodoro"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2404.12837",
    "title": "Towards a decentralized data privacy protocol for self-sovereignty in  the digital world",
    "abstract": "A typical user interacts with many digital services nowadays, providing these services with their data. As of now, the management of privacy preferences is service-centric: Users must manage their privacy preferences according to the rules of each service provider, meaning that every provider offers its unique mechanisms for users to control their privacy settings. However, managing privacy preferences holistically (i.e., across multiple digital services) is just impractical. In this vision paper, we propose a paradigm shift towards an enriched user-centric approach for cross-service privacy preferences management: the realization of a decentralized data privacy protocol. ",
    "url": "https://arxiv.org/abs/2404.12837",
    "authors": [
      "Rodrigo Falcão",
      "Arghavan Hosseinzadeh"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.12841",
    "title": "Explainable Deepfake Video Detection using Convolutional Neural Network  and CapsuleNet",
    "abstract": "Deepfake technology, derived from deep learning, seamlessly inserts individuals into digital media, irrespective of their actual participation. Its foundation lies in machine learning and Artificial Intelligence (AI). Initially, deepfakes served research, industry, and entertainment. While the concept has existed for decades, recent advancements render deepfakes nearly indistinguishable from reality. Accessibility has soared, empowering even novices to create convincing deepfakes. However, this accessibility raises security concerns.The primary deepfake creation algorithm, GAN (Generative Adversarial Network), employs machine learning to craft realistic images or videos. Our objective is to utilize CNN (Convolutional Neural Network) and CapsuleNet with LSTM to differentiate between deepfake-generated frames and originals. Furthermore, we aim to elucidate our model's decision-making process through Explainable AI, fostering transparent human-AI relationships and offering practical examples for real-life scenarios. ",
    "url": "https://arxiv.org/abs/2404.12841",
    "authors": [
      "Gazi Hasin Ishrak",
      "Zalish Mahmud",
      "MD. Zami Al Zunaed Farabe",
      "Tahera Khanom Tinni",
      "Tanzim Reza",
      "Mohammad Zavid Parvez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2404.12852",
    "title": "LSP Framework: A Compensatory Model for Defeating Trigger Reverse  Engineering via Label Smoothing Poisoning",
    "abstract": "Deep neural networks are vulnerable to backdoor attacks. Among the existing backdoor defense methods, trigger reverse engineering based approaches, which reconstruct the backdoor triggers via optimizations, are the most versatile and effective ones compared to other types of methods. In this paper, we summarize and construct a generic paradigm for the typical trigger reverse engineering process. Based on this paradigm, we propose a new perspective to defeat trigger reverse engineering by manipulating the classification confidence of backdoor samples. To determine the specific modifications of classification confidence, we propose a compensatory model to compute the lower bound of the modification. With proper modifications, the backdoor attack can easily bypass the trigger reverse engineering based methods. To achieve this objective, we propose a Label Smoothing Poisoning (LSP) framework, which leverages label smoothing to specifically manipulate the classification confidences of backdoor samples. Extensive experiments demonstrate that the proposed work can defeat the state-of-the-art trigger reverse engineering based methods, and possess good compatibility with a variety of existing backdoor attacks. ",
    "url": "https://arxiv.org/abs/2404.12852",
    "authors": [
      "Beichen Li",
      "Yuanfang Guo",
      "Heqi Peng",
      "Yangxi Li",
      "Yunhong Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12855",
    "title": "Ransomware Detection and Classification Using Random Forest: A Case  Study with the UGRansome2024 Dataset",
    "abstract": "Cybersecurity faces challenges in identifying and mitigating ransomware, which is important for protecting critical infrastructures. The absence of datasets for distinguishing normal versus abnormal network behaviour hinders the development of proactive detection strategies against ransomware. An obstacle in proactive prevention methods is the absence of comprehensive datasets for contrasting normal versus abnormal network behaviours. The dataset enabling such contrasts would significantly expedite threat anomaly mitigation. In this study, we introduce UGRansome2024, an optimised dataset for ransomware detection in network traffic. This dataset is derived from the UGRansome data using an intuitionistic feature engineering approach that considers only relevant patterns in network behaviour analysis. The study presents an analysis of ransomware detection using the UGRansome2024 dataset and the Random Forest algorithm. Through encoding and feature relevance determination, the Random Forest achieved a classification accuracy of 96% and effectively identified unusual ransomware transactions. Findings indicate that certain ransomware variants, such as those utilising Encrypt Decrypt Algorithms (EDA) and Globe ransomware, have the highest financial impact. These insights have significant implications for real-world cybersecurity practices, highlighting the importance of machine learning in ransomware detection and mitigation. Further research is recommended to expand datasets, explore alternative detection methods, and address limitations in current approaches. ",
    "url": "https://arxiv.org/abs/2404.12855",
    "authors": [
      "Peace Azugo",
      "Hein Venter",
      "Mike Wa Nkongolo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.12856",
    "title": "Language-Driven Active Learning for Diverse Open-Set 3D Object Detection",
    "abstract": "Object detection is crucial for ensuring safe autonomous driving. However, data-driven approaches face challenges when encountering minority or novel objects in the 3D driving scene. In this paper, we propose VisLED, a language-driven active learning framework for diverse open-set 3D Object Detection. Our method leverages active learning techniques to query diverse and informative data samples from an unlabeled pool, enhancing the model's ability to detect underrepresented or novel objects. Specifically, we introduce the Vision-Language Embedding Diversity Querying (VisLED-Querying) algorithm, which operates in both open-world exploring and closed-world mining settings. In open-world exploring, VisLED-Querying selects data points most novel relative to existing data, while in closed-world mining, it mines new instances of known classes. We evaluate our approach on the nuScenes dataset and demonstrate its effectiveness compared to random sampling and entropy-querying methods. Our results show that VisLED-Querying consistently outperforms random sampling and offers competitive performance compared to entropy-querying despite the latter's model-optimality, highlighting the potential of VisLED for improving object detection in autonomous driving scenarios. ",
    "url": "https://arxiv.org/abs/2404.12856",
    "authors": [
      "Ross Greer",
      "Bjørk Antoniussen",
      "Andreas Møgelmose",
      "Mohan Trivedi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12867",
    "title": "FipTR: A Simple yet Effective Transformer Framework for Future Instance  Prediction in Autonomous Driving",
    "abstract": "The future instance prediction from a Bird's Eye View(BEV) perspective is a vital component in autonomous driving, which involves future instance segmentation and instance motion prediction. Existing methods usually rely on a redundant and complex pipeline which requires multiple auxiliary outputs and post-processing procedures. Moreover, estimated errors on each of the auxiliary predictions will lead to degradation of the prediction performance. In this paper, we propose a simple yet effective fully end-to-end framework named Future Instance Prediction Transformer(FipTR), which views the task as BEV instance segmentation and prediction for future frames. We propose to adopt instance queries representing specific traffic participants to directly estimate the corresponding future occupied masks, and thus get rid of complex post-processing procedures. Besides, we devise a flow-aware BEV predictor for future BEV feature prediction composed of a flow-aware deformable attention that takes backward flow guiding the offset sampling. A novel future instance matching strategy is also proposed to further improve the temporal coherence. Extensive experiments demonstrate the superiority of FipTR and its effectiveness under different temporal BEV encoders. ",
    "url": "https://arxiv.org/abs/2404.12867",
    "authors": [
      "Xingtai Gui",
      "Tengteng Huang",
      "Haonan Shao",
      "Haotian Yao",
      "Chi Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2404.12871",
    "title": "Expanding the Katz Index for Link Prediction: A Case Study on a Live  Fish Movement Network",
    "abstract": "In aquaculture, disease spread models often neglect the dynamic interactions between farms, hindering accuracy. This study enhances the Katz index (KI) to incorporate spatial and temporal patterns of fish movement, improving the prediction of farms susceptible to disease via live fish transfers. We modified the Katz index to create models like the Weighted Katz Index (WKI), Edge Weighted Katz Index (EWKI), and combined models (e.g., KIEWKI). These incorporate spatial distances and temporal movement patterns for a comprehensive aquaculture network connection prediction framework. Model performance was evaluated using precision, recall, F1-scores, AUPR, and AUROC. The EWKI model significantly outperformed the traditional KI and other variations. It achieved high precision (0.988), recall (0.712), F1-score (0.827), and AUPR (0.970). Combined models (KIEWKI, WKIEWKI) approached, but couldn't surpass, EWKI performance. This study highlights the value of extending Katz index models to improve disease spread predictions in aquaculture networks. The EWKI model's performance demonstrates an innovative and flexible approach to tackling spatial challenges within network analysis. ",
    "url": "https://arxiv.org/abs/2404.12871",
    "authors": [
      "Michael-Sam Vidza",
      "Marcin Budka",
      "Wei Koong Chai",
      "Mark Thrush",
      "Mickael Teixeira Alves"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Combinatorics (math.CO)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2404.12893",
    "title": "The Power of Words: Generating PowerShell Attacks from Natural Language",
    "abstract": "As the Windows OS stands out as one of the most targeted systems, the PowerShell language has become a key tool for malicious actors and cybersecurity professionals (e.g., for penetration testing). This work explores an uncharted domain in AI code generation by automatically generating offensive PowerShell code from natural language descriptions using Neural Machine Translation (NMT). For training and evaluation purposes, we propose two novel datasets with PowerShell code samples, one with manually curated descriptions in natural language and another code-only dataset for reinforcing the training. We present an extensive evaluation of state-of-the-art NMT models and analyze the generated code both statically and dynamically. Results indicate that tuning NMT using our dataset is effective at generating offensive PowerShell code. Comparative analysis against the most widely used LLM service ChatGPT reveals the specialized strengths of our fine-tuned models. ",
    "url": "https://arxiv.org/abs/2404.12893",
    "authors": [
      "Pietro Liguori",
      "Christian Marescalco",
      "Roberto Natella",
      "Vittorio Orbinato",
      "Luciano Pianese"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.12908",
    "title": "Robust CLIP-Based Detector for Exposing Diffusion Model-Generated Images",
    "abstract": "Diffusion models (DMs) have revolutionized image generation, producing high-quality images with applications spanning various fields. However, their ability to create hyper-realistic images poses significant challenges in distinguishing between real and synthetic content, raising concerns about digital authenticity and potential misuse in creating deepfakes. This work introduces a robust detection framework that integrates image and text features extracted by CLIP model with a Multilayer Perceptron (MLP) classifier. We propose a novel loss that can improve the detector's robustness and handle imbalanced datasets. Additionally, we flatten the loss landscape during the model training to improve the detector's generalization capabilities. The effectiveness of our method, which outperforms traditional detection techniques, is demonstrated through extensive experiments, underscoring its potential to set a new state-of-the-art approach in DM-generated image detection. The code is available at https://github.com/Purdue-M2/Robust_DM_Generated_Image_Detection. ",
    "url": "https://arxiv.org/abs/2404.12908",
    "authors": [
      "Santosh",
      "Li Lin",
      "Irene Amerini",
      "Xin Wang",
      "Shu Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2404.12916",
    "title": "Physical Backdoor Attack can Jeopardize Driving with  Vision-Large-Language Models",
    "abstract": "Vision-Large-Language-models(VLMs) have great application prospects in autonomous driving. Despite the ability of VLMs to comprehend and make decisions in complex scenarios, their integration into safety-critical autonomous driving systems poses serious security risks. In this paper, we propose BadVLMDriver, the first backdoor attack against VLMs for autonomous driving that can be launched in practice using physical objects. Unlike existing backdoor attacks against VLMs that rely on digital modifications, BadVLMDriver uses common physical items, such as a red balloon, to induce unsafe actions like sudden acceleration, highlighting a significant real-world threat to autonomous vehicle safety. To execute BadVLMDriver, we develop an automated pipeline utilizing natural language instructions to generate backdoor training samples with embedded malicious behaviors. This approach allows for flexible trigger and behavior selection, enhancing the stealth and practicality of the attack in diverse scenarios. We conduct extensive experiments to evaluate BadVLMDriver for two representative VLMs, five different trigger objects, and two types of malicious backdoor behaviors. BadVLMDriver achieves a 92% attack success rate in inducing a sudden acceleration when coming across a pedestrian holding a red balloon. Thus, BadVLMDriver not only demonstrates a critical security risk but also emphasizes the urgent need for developing robust defense mechanisms to protect against such vulnerabilities in autonomous driving technologies. ",
    "url": "https://arxiv.org/abs/2404.12916",
    "authors": [
      "Zhenyang Ni",
      "Rui Ye",
      "Yuxi Wei",
      "Zhen Xiang",
      "Yanfeng Wang",
      "Siheng Chen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.12928",
    "title": "The Positivity of the Neural Tangent Kernel",
    "abstract": "The Neural Tangent Kernel (NTK) has emerged as a fundamental concept in the study of wide Neural Networks. In particular, it is known that the positivity of the NTK is directly related to the memorization capacity of sufficiently wide networks, i.e., to the possibility of reaching zero loss in training, via gradient descent. Here we will improve on previous works and obtain a sharp result concerning the positivity of the NTK of feedforward networks of any depth. More precisely, we will show that, for any non-polynomial activation function, the NTK is strictly positive definite. Our results are based on a novel characterization of polynomial functions which is of independent interest. ",
    "url": "https://arxiv.org/abs/2404.12928",
    "authors": [
      "Luís Carvalho",
      "João L. Costa",
      "José Mourão",
      "Gonçalo Oliveira"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Probability (math.PR)",
      "Spectral Theory (math.SP)"
    ]
  },
  {
    "id": "arXiv:2404.12930",
    "title": "Fast Broadcast in Highly Connected Networks",
    "abstract": "We revisit the classic broadcast problem, wherein we have $k$ messages, each composed of $O(\\log{n})$ bits, distributed arbitrarily across a network. The objective is to broadcast these messages to all nodes in the network. In the distributed CONGEST model, a textbook algorithm solves this problem in $O(D+k)$ rounds, where $D$ is the diameter of the graph. While the $O(D)$ term in the round complexity is unavoidable$\\unicode{x2014}$given that $\\Omega(D)$ rounds are necessary to solve broadcast in any graph$\\unicode{x2014}$it remains unclear whether the $O(k)$ term is needed in all graphs. In cases where the minimum cut size is one, simply transmitting messages from one side of the cut to the other would require $\\Omega(k)$ rounds. However, if the size of the minimum cut is larger, it may be possible to develop faster algorithms. This motivates the exploration of the broadcast problem in networks with high edge connectivity. In this work, we present a simple randomized distributed algorithm for performing $k$-message broadcast in $O(((n+k)/\\lambda)\\log n)$ rounds in any $n$-node simple graph with edge connectivity $\\lambda$. When $k = \\Omega(n)$, our algorithm is universally optimal, up to an $O(\\log n)$ factor, as its complexity nearly matches an information-theoretic $\\Omega(k/\\lambda)$ lower bound that applies to all graphs, even when the network topology is known to the algorithm. The setting $k = \\Omega(n)$ is particularly interesting because several fundamental problems can be reduced to broadcasting $\\Omega(n)$ messages. Our broadcast algorithm finds several applications in distributed computing, enabling $O(1)$-approximation for all distances and $(1+\\epsilon)$-approximation for all cut sizes in $\\tilde{O}(n/\\lambda)$ rounds. ",
    "url": "https://arxiv.org/abs/2404.12930",
    "authors": [
      "Shashwat Chandra",
      "Yi-Jun Chang",
      "Michal Dory",
      "Mohsen Ghaffari",
      "Dean Leitersdorf"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2404.12933",
    "title": "Cross-cultural Inspiration Detection and Analysis in Real and  LLM-generated Social Media Data",
    "abstract": "Inspiration is linked to various positive outcomes, such as increased creativity, productivity, and happiness. Although inspiration has great potential, there has been limited effort toward identifying content that is inspiring, as opposed to just engaging or positive. Additionally, most research has concentrated on Western data, with little attention paid to other cultures. This work is the first to study cross-cultural inspiration through machine learning methods. We aim to identify and analyze real and AI-generated cross-cultural inspiring posts. To this end, we compile and make publicly available the InspAIred dataset, which consists of 2,000 real inspiring posts, 2,000 real non-inspiring posts, and 2,000 generated inspiring posts evenly distributed across India and the UK. The real posts are sourced from Reddit, while the generated posts are created using the GPT-4 model. Using this dataset, we conduct extensive computational linguistic analyses to (1) compare inspiring content across cultures, (2) compare AI-generated inspiring posts to real inspiring posts, and (3) determine if detection models can accurately distinguish between inspiring content across cultures and data sources. ",
    "url": "https://arxiv.org/abs/2404.12933",
    "authors": [
      "Oana Ignat",
      "Gayathri Ganesh Lakshmy",
      "Rada Mihalcea"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12935",
    "title": "FAIR Jupyter: a knowledge graph approach to semantic sharing and  granular exploration of a computational notebook reproducibility dataset",
    "abstract": "The way in which data are shared can affect their utility and reusability. Here, we demonstrate how data that we had previously shared in bulk can be mobilized further through a knowledge graph that allows for much more granular exploration and interrogation. The original dataset is about the computational reproducibility of GitHub-hosted Jupyter notebooks associated with biomedical publications. It contains rich metadata about the publications, associated GitHub repositories and Jupyter notebooks, and the notebooks' reproducibility. We took this dataset, converted it into semantic triples and loaded these into a triple store to create a knowledge graph, FAIR Jupyter, that we made accessible via a web service. This enables granular data exploration and analysis through queries that can be tailored to specific use cases. Such queries may provide details about any of the variables from the original dataset, highlight relationships between them or combine some of the graph's content with materials from corresponding external resources. We provide a collection of example queries addressing a range of use cases in research and education. We also outline how sets of such queries can be used to profile specific content types, either individually or by class. We conclude by discussing how such a semantically enhanced sharing of complex datasets can both enhance their FAIRness, i.e., their findability, accessibility, interoperability, and reusability, and help identify and communicate best practices, particularly with regards to data quality, standardization, automation and reproducibility. ",
    "url": "https://arxiv.org/abs/2404.12935",
    "authors": [
      "Sheeba Samuel",
      "Daniel Mietchen"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2404.12938",
    "title": "MAiDE-up: Multilingual Deception Detection of GPT-generated Hotel  Reviews",
    "abstract": "Deceptive reviews are becoming increasingly common, especially given the increase in performance and the prevalence of LLMs. While work to date has addressed the development of models to differentiate between truthful and deceptive human reviews, much less is known about the distinction between real reviews and AI-authored fake reviews. Moreover, most of the research so far has focused primarily on English, with very little work dedicated to other languages. In this paper, we compile and make publicly available the MAiDE-up dataset, consisting of 10,000 real and 10,000 AI-generated fake hotel reviews, balanced across ten languages. Using this dataset, we conduct extensive linguistic analyses to (1) compare the AI fake hotel reviews to real hotel reviews, and (2) identify the factors that influence the deception detection model performance. We explore the effectiveness of several models for deception detection in hotel reviews across three main dimensions: sentiment, location, and language. We find that these dimensions influence how well we can detect AI-generated fake reviews. ",
    "url": "https://arxiv.org/abs/2404.12938",
    "authors": [
      "Oana Ignat",
      "Xiaomeng Xu",
      "Rada Mihalcea"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12941",
    "title": "Towards behavioral consistency in heterogeneous modeling scenarios",
    "abstract": "Behavioral models play an essential role in Model-driven engineering (MDE). Keeping inter-related behavioral models consistent is critical to use them successfully in MDE. However, consistency checking for behavioral models, especially in a heterogeneous scenario, is limited. We propose a methodology to integrate heterogeneous behavioral models to achieve consistency checking in broader scenarios. It is based on aligning the respective behavioral metamodels by defining possible inter-model relations which carry behavioral meaning. Converting the models and their relations to a behavioral formalism enables analysis of global behavioral consistency using model-checking. ",
    "url": "https://arxiv.org/abs/2404.12941",
    "authors": [
      "Tim Kräuter"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.12956",
    "title": "Robust hybrid finite element methods for reaction-dominated diffusion  problems",
    "abstract": "For a reaction-dominated diffusion problem we study a primal and a dual hybrid finite element method where weak continuity conditions are enforced by Lagrange multipliers. Uniform robustness of the discrete methods is achieved by enriching the local discretization spaces with modified face bubble functions which decay exponentially in the interior of an element depending on the ratio of the singular perturbation parameter and the local mesh-size. A posteriori error estimators are derived using Fortin operators. They are robust with respect to the singular perturbation parameter. Numerical experiments are presented that show that oscillations, if present, are significantly smaller then those observed in common finite element methods. ",
    "url": "https://arxiv.org/abs/2404.12956",
    "authors": [
      "Thomas Führer",
      "Diego Paredes"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2404.12978",
    "title": "Strengthening Community Resilience by Modeling Transportation and  Electric Power Network Interdependencies",
    "abstract": "This study presents an agent-based model (ABM) developed to simulate the resilience of a community to hurricane-induced infrastructure disruptions, focusing on the interdependencies between electric power and transportation networks. In this ABM approach, agents represent the components of a system, where interactions within a system shape intra-dependency of a system and interactions among systems shape interdependencies. To study household resilience subject to a hurricane, a library of agents has been created including electric power network, transportation network, wind/flooding hazards, and household agents. The ABM is applied over the household and infrastructure data from a community (Zip code 33147) in Miami-Dade County, Florida. Interdependencies between the two networks are modeled in two ways, (i) representing the role of transportation in fuel delivery to power plants and restoration teams' access, (ii) impact of power outage on transportation network components. Restoring traffic signals quickly is crucial as their outage can slow down traffic and increase the chance of crashes. We simulate three restoration strategies: component based, distance based, and traffic lights based restoration. The model is validated against Hurricane Irma data, showing consistent behavior with varying hazard intensities. Scenario analyses explore the impact of restoration strategies, road accessibility, and wind speed intensities on power restoration. Results demonstrate that a traffic lights based restoration strategy efficiently prioritizes signal recovery without delaying household power restoration time. Restoration of power services will be faster if restoration teams do not need to wait due to inaccessible roads and fuel transportation to power plants is not delayed. ",
    "url": "https://arxiv.org/abs/2404.12978",
    "authors": [
      "Tasnuba Binte Jamal",
      "Samiul Hasan",
      "Omar I. Abdul-Aziz",
      "Pallab Mozumder",
      "Rounak Meyur"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2404.12979",
    "title": "TRNet: Two-level Refinement Network leveraging Speech Enhancement for  Noise Robust Speech Emotion Recognition",
    "abstract": "One persistent challenge in Speech Emotion Recognition (SER) is the ubiquitous environmental noise, which frequently results in diminished SER performance in practical use. In this paper, we introduce a Two-level Refinement Network, dubbed TRNet, to address this challenge. Specifically, a pre-trained speech enhancement module is employed for front-end noise reduction and noise level estimation. Later, we utilize clean speech spectrograms and their corresponding deep representations as reference signals to refine the spectrogram distortion and representation shift of enhanced speech during model training. Experimental results validate that the proposed TRNet substantially increases the system's robustness in both matched and unmatched noisy environments, without compromising its performance in clean environments. ",
    "url": "https://arxiv.org/abs/2404.12979",
    "authors": [
      "Chengxin Chen",
      "Pengyuan Zhang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2404.13002",
    "title": "Towards Robust Ferrous Scrap Material Classification with Deep Learning  and Conformal Prediction",
    "abstract": "In the steel production domain, recycling ferrous scrap is essential for environmental and economic sustainability, as it reduces both energy consumption and greenhouse gas emissions. However, the classification of scrap materials poses a significant challenge, requiring advancements in automation technology. Additionally, building trust among human operators is a major obstacle. Traditional approaches often fail to quantify uncertainty and lack clarity in model decision-making, which complicates acceptance. In this article, we describe how conformal prediction can be employed to quantify uncertainty and add robustness in scrap classification. We have adapted the Split Conformal Prediction technique to seamlessly integrate with state-of-the-art computer vision models, such as the Vision Transformer (ViT), Swin Transformer, and ResNet-50, while also incorporating Explainable Artificial Intelligence (XAI) methods. We evaluate the approach using a comprehensive dataset of 8147 images spanning nine ferrous scrap classes. The application of the Split Conformal Prediction method allowed for the quantification of each model's uncertainties, which enhanced the understanding of predictions and increased the reliability of the results. Specifically, the Swin Transformer model demonstrated more reliable outcomes than the others, as evidenced by its smaller average size of prediction sets and achieving an average classification accuracy exceeding 95%. Furthermore, the Score-CAM method proved highly effective in clarifying visual features, significantly enhancing the explainability of the classification decisions. ",
    "url": "https://arxiv.org/abs/2404.13002",
    "authors": [
      "Paulo Henrique dos Santos",
      "Valéria de Carvalho Santos",
      "Eduardo José da Silva Luz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.13004",
    "title": "FinLangNet: A Novel Deep Learning Framework for Credit Risk Prediction  Using Linguistic Analogy in Financial Data",
    "abstract": "Recent industrial applications in risk prediction still heavily rely on extensively manually-tuned, statistical learning methods. Real-world financial data, characterized by its high-dimensionality, sparsity, high noise levels, and significant imbalance, poses unique challenges for the effective application of deep neural network models. In this work, we introduce a novel deep learning risk prediction framework, FinLangNet, which conceptualizes credit loan trajectories in a structure that mirrors linguistic constructs. This framework is tailored for credit risk prediction using real-world financial data, drawing on structural similarities to language by adapting natural language processing techniques. It focuses on analyzing the evolution and predictability of credit histories through detailed financial event sequences. Our research demonstrates that FinLangNet surpasses traditional statistical methods in predicting credit risk and that its integration with these methods enhances credit card fraud prediction models, achieving a significant improvement of over 1.5 points in the Kolmogorov-Smirnov metric. ",
    "url": "https://arxiv.org/abs/2404.13004",
    "authors": [
      "Yu Lei",
      "Zixuan Wang",
      "Chu Liu",
      "Tongyao Wang",
      "Dongyang Lee"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.13008",
    "title": "Enhancing Generalization in Audio Deepfake Detection: A Neural Collapse  based Sampling and Training Approach",
    "abstract": "Generalization in audio deepfake detection presents a significant challenge, with models trained on specific datasets often struggling to detect deepfakes generated under varying conditions and unknown algorithms. While collectively training a model using diverse datasets can enhance its generalization ability, it comes with high computational costs. To address this, we propose a neural collapse-based sampling approach applied to pre-trained models trained on distinct datasets to create a new training database. Using ASVspoof 2019 dataset as a proof-of-concept, we implement pre-trained models with Resnet and ConvNext architectures. Our approach demonstrates comparable generalization on unseen data while being computationally efficient, requiring less training data. Evaluation is conducted using the In-the-wild dataset. ",
    "url": "https://arxiv.org/abs/2404.13008",
    "authors": [
      "Mohammed Yousif",
      "Jonat John Mathew",
      "Huzaifa Pallan",
      "Agamjeet Singh Padda",
      "Syed Daniyal Shah",
      "Sara Adamski",
      "Madhu Reddiboina",
      "Arjun Pankajakshan"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2404.13016",
    "title": "Optimizing Calibration by Gaining Aware of Prediction Correctness",
    "abstract": "Model calibration aims to align confidence with prediction correctness. The Cross-Entropy CE) loss is widely used for calibrator training, which enforces the model to increase confidence on the ground truth class. However, we find the CE loss has intrinsic limitations. For example, for a narrow misclassification, a calibrator trained by the CE loss often produces high confidence on the wrongly predicted class (e.g., a test sample is wrongly classified and its softmax score on the ground truth class is around 0.4), which is undesirable. In this paper, we propose a new post-hoc calibration objective derived from the aim of calibration. Intuitively, the proposed objective function asks that the calibrator decrease model confidence on wrongly predicted samples and increase confidence on correctly predicted samples. Because a sample itself has insufficient ability to indicate correctness, we use its transformed versions (e.g., rotated, greyscaled and color-jittered) during calibrator training. Trained on an in-distribution validation set and tested with isolated, individual test samples, our method achieves competitive calibration performance on both in-distribution and out-of-distribution test sets compared with the state of the art. Further, our analysis points out the difference between our method and commonly used objectives such as CE loss and mean square error loss, where the latters sometimes deviates from the calibration aim. ",
    "url": "https://arxiv.org/abs/2404.13016",
    "authors": [
      "Yuchi Liu",
      "Lei Wang",
      "Yuli Zou",
      "James Zou",
      "Liang Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2404.13024",
    "title": "BANF: Band-limited Neural Fields for Levels of Detail Reconstruction",
    "abstract": "Largely due to their implicit nature, neural fields lack a direct mechanism for filtering, as Fourier analysis from discrete signal processing is not directly applicable to these representations. Effective filtering of neural fields is critical to enable level-of-detail processing in downstream applications, and support operations that involve sampling the field on regular grids (e.g. marching cubes). Existing methods that attempt to decompose neural fields in the frequency domain either resort to heuristics or require extensive modifications to the neural field architecture. We show that via a simple modification, one can obtain neural fields that are low-pass filtered, and in turn show how this can be exploited to obtain a frequency decomposition of the entire signal. We demonstrate the validity of our technique by investigating level-of-detail reconstruction, and showing how coarser representations can be computed effectively. ",
    "url": "https://arxiv.org/abs/2404.13024",
    "authors": [
      "Ahan Shabanov",
      "Shrisudhan Govindarajan",
      "Cody Reading",
      "Lily Goli",
      "Daniel Rebain",
      "Kwang Moo Yi",
      "Andrea Tagliasacchi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2404.13038",
    "title": "Mapping Social Choice Theory to RLHF",
    "abstract": "Recent work on the limitations of using reinforcement learning from human feedback (RLHF) to incorporate human preferences into model behavior often raises social choice theory as a reference point. Social choice theory's analysis of settings such as voting mechanisms provides technical infrastructure that can inform how to aggregate human preferences amid disagreement. We analyze the problem settings of social choice and RLHF, identify key differences between them, and discuss how these differences may affect the RLHF interpretation of well-known technical results in social choice. ",
    "url": "https://arxiv.org/abs/2404.13038",
    "authors": [
      "Jessica Dai",
      "Eve Fleisig"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2404.13044",
    "title": "Unified Scene Representation and Reconstruction for 3D Large Language  Models",
    "abstract": "Enabling Large Language Models (LLMs) to interact with 3D environments is challenging. Existing approaches extract point clouds either from ground truth (GT) geometry or 3D scenes reconstructed by auxiliary models. Text-image aligned 2D features from CLIP are then lifted to point clouds, which serve as inputs for LLMs. However, this solution lacks the establishment of 3D point-to-point connections, leading to a deficiency of spatial structure information. Concurrently, the absence of integration and unification between the geometric and semantic representations of the scene culminates in a diminished level of 3D scene understanding. In this paper, we demonstrate the importance of having a unified scene representation and reconstruction framework, which is essential for LLMs in 3D scenes. Specifically, we introduce Uni3DR^2 extracts 3D geometric and semantic aware representation features via the frozen pre-trained 2D foundation models (e.g., CLIP and SAM) and a multi-scale aggregate 3D decoder. Our learned 3D representations not only contribute to the reconstruction process but also provide valuable knowledge for LLMs. Experimental results validate that our Uni3DR^2 yields convincing gains over the baseline on the 3D reconstruction dataset ScanNet (increasing F-Score by +1.8\\%). When applied to LLMs, our Uni3DR^2-LLM exhibits superior performance over the baseline on the 3D vision-language understanding dataset ScanQA (increasing BLEU-1 by +4.0\\% and +4.2\\% on the val set and test set, respectively). Furthermore, it outperforms the state-of-the-art method that uses additional GT point clouds on both ScanQA and 3DMV-VQA. ",
    "url": "https://arxiv.org/abs/2404.13044",
    "authors": [
      "Tao Chu",
      "Pan Zhang",
      "Xiaoyi Dong",
      "Yuhang Zang",
      "Qiong Liu",
      "Jiaqi Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.12415",
    "title": "Soil Fertility Prediction Using Combined USB-microscope Based Soil  Image, Auxiliary Variables, and Portable X-Ray Fluorescence Spectrometry",
    "abstract": "This study explored the application of portable X-ray fluorescence (PXRF) spectrometry and soil image analysis to rapidly assess soil fertility, focusing on critical parameters such as available B, organic carbon (OC), available Mn, available S, and the sulfur availability index (SAI). Analyzing 1,133 soil samples from various agro-climatic zones in Eastern India, the research combined color and texture features from microscopic soil images, PXRF data, and auxiliary soil variables (AVs) using a Random Forest model. Results indicated that integrating image features (IFs) with auxiliary variables (AVs) significantly enhanced prediction accuracy for available B (R^2 = 0.80) and OC (R^2 = 0.88). A data fusion approach, incorporating IFs, AVs, and PXRF data, further improved predictions for available Mn and SAI with R^2 values of 0.72 and 0.70, respectively. The study demonstrated how these integrated technologies have the potential to provide quick and affordable options for soil testing, opening up access to more sophisticated prediction models and a better comprehension of the fertility and health of the soil. Future research should focus on the application of deep learning models on a larger dataset of soil images, developed using soils from a broader range of agro-climatic zones under field condition. ",
    "url": "https://arxiv.org/abs/2404.12415",
    "authors": [
      "Shubhadip Dasgupta",
      "Satwik Pate",
      "Divya Rathore",
      "L.G. Divyanth",
      "Ayan Das",
      "Anshuman Nayak",
      "Subhadip Dey",
      "Asim Biswas",
      "David C. Weindorf",
      "Bin Li",
      "Sergio Henrique Godinho Silva",
      "Bruno Teixeira Ribeiro",
      "Sanjay Srivastava",
      "Somsubhra Chakraborty"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12416",
    "title": "Full Shot Predictions for the DIII-D Tokamak via Deep Recurrent Networks",
    "abstract": "Although tokamaks are one of the most promising devices for realizing nuclear fusion as an energy source, there are still key obstacles when it comes to understanding the dynamics of the plasma and controlling it. As such, it is crucial that high quality models are developed to assist in overcoming these obstacles. In this work, we take an entirely data driven approach to learn such a model. In particular, we use historical data from the DIII-D tokamak to train a deep recurrent network that is able to predict the full time evolution of plasma discharges (or \"shots\"). Following this, we investigate how different training and inference procedures affect the quality and calibration of the shot predictions. ",
    "url": "https://arxiv.org/abs/2404.12416",
    "authors": [
      "Ian Char",
      "Youngseog Chung",
      "Joseph Abbate",
      "Egemen Kolemen",
      "Jeff Schneider"
    ],
    "subjectives": [
      "Plasma Physics (physics.plasm-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12484",
    "title": "Neural Methods for Amortised Parameter Inference",
    "abstract": "Simulation-based methods for making statistical inference have evolved dramatically over the past 50 years, keeping pace with technological advancements. The field is undergoing a new revolution as it embraces the representational capacity of neural networks, optimisation libraries, and graphics processing units for learning complex mappings between data and inferential targets. The resulting tools are amortised, in the sense that they allow inference to be made quickly through fast feedforward operations. In this article we review recent progress made in the context of point estimation, approximate Bayesian inference, the automatic construction of summary statistics, and likelihood approximation. The review also covers available software, and includes a simple illustration to showcase the wide array of tools available for amortised inference and the benefits they offer over state-of-the-art Markov chain Monte Carlo methods. The article concludes with an overview of relevant topics and an outlook on future research directions. ",
    "url": "https://arxiv.org/abs/2404.12484",
    "authors": [
      "Andrew Zammit-Mangion",
      "Matthew Sainsbury-Dale",
      "Raphaël Huser"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Computation (stat.CO)"
    ]
  },
  {
    "id": "arXiv:2404.12507",
    "title": "Increasing Interference Detection in Quantum Cryptography using the  Quantum Fourier Transform",
    "abstract": "Quantum key distribution (QKD) and quantum message encryption protocols promise a secure way to distribute information while detecting eavesdropping. However, current protocols may suffer from significantly reduced eavesdropping protection when only a subset of qubits are observed by an attacker. In this paper, we present two quantum cryptographic protocols leveraging the quantum Fourier transform (QFT) and show their higher effectiveness even when an attacker measures only a subset of the transmitted qubits. The foremost of these protocols is a novel QKD method that leverages this effectiveness of the QFT while being more practical than previously proposed QFT-based protocols, most notably by not relying on quantum memory. We additionally show how existing quantum encryption methods can be augmented with a QFT-based approach to improve eavesdropping detection. Finally, we provide equations to analyze different QFT-based detection schemes within these protocols so that protocol designers can make custom schemes for their purpose. ",
    "url": "https://arxiv.org/abs/2404.12507",
    "authors": [
      "Nicholas J.C. Papadopoulos",
      "Kirby Linvill"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2404.12741",
    "title": "Multi-Class Quantum Convolutional Neural Networks",
    "abstract": "Classification is particularly relevant to Information Retrieval, as it is used in various subtasks of the search pipeline. In this work, we propose a quantum convolutional neural network (QCNN) for multi-class classification of classical data. The model is implemented using PennyLane. The optimization process is conducted by minimizing the cross-entropy loss through parameterized quantum circuit optimization. The QCNN is tested on the MNIST dataset with 4, 6, 8 and 10 classes. The results show that with 4 classes, the performance is slightly lower compared to the classical CNN, while with a higher number of classes, the QCNN outperforms the classical neural network. ",
    "url": "https://arxiv.org/abs/2404.12741",
    "authors": [
      "Marco Mordacci",
      "Davide Ferrari",
      "Michele Amoretti"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12940",
    "title": "Neural Flow Diffusion Models: Learnable Forward Process for Improved  Diffusion Modelling",
    "abstract": "Conventional diffusion models typically relies on a fixed forward process, which implicitly defines complex marginal distributions over latent variables. This can often complicate the reverse process' task in learning generative trajectories, and results in costly inference for diffusion models. To address these limitations, we introduce Neural Flow Diffusion Models (NFDM), a novel framework that enhances diffusion models by supporting a broader range of forward processes beyond the fixed linear Gaussian. We also propose a novel parameterization technique for learning the forward process. Our framework provides an end-to-end, simulation-free optimization objective, effectively minimizing a variational upper bound on the negative log-likelihood. Experimental results demonstrate NFDM's strong performance, evidenced by state-of-the-art likelihood estimation. Furthermore, we investigate NFDM's capacity for learning generative dynamics with specific characteristics, such as deterministic straight lines trajectories. This exploration underscores NFDM's versatility and its potential for a wide range of applications. ",
    "url": "https://arxiv.org/abs/2404.12940",
    "authors": [
      "Grigory Bartosh",
      "Dmitry Vetrov",
      "Christian A. Naesseth"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2404.12958",
    "title": "Improving Pediatric Pneumonia Diagnosis with Adult Chest X-ray Images  Utilizing Contrastive Learning and Embedding Similarity",
    "abstract": "Despite the advancement of deep learning-based computer-aided diagnosis (CAD) methods for pneumonia from adult chest x-ray (CXR) images, the performance of CAD methods applied to pediatric images remains suboptimal, mainly due to the lack of large-scale annotated pediatric imaging datasets. Establishing a proper framework to leverage existing adult large-scale CXR datasets can thus enhance pediatric pneumonia detection performance. In this paper, we propose a three-branch parallel path learning-based framework that utilizes both adult and pediatric datasets to improve the performance of deep learning models on pediatric test datasets. The paths are trained with pediatric only, adult only, and both types of CXRs, respectively. Our proposed framework utilizes the multi-positive contrastive loss to cluster the classwise embeddings and the embedding similarity loss among these three parallel paths to make the classwise embeddings as close as possible to reduce the effect of domain shift. Experimental evaluations on open-access adult and pediatric CXR datasets show that the proposed method achieves a superior AUROC score of 0.8464 compared to 0.8348 obtained using the conventional approach of join training on both datasets. The proposed approach thus paves the way for generalized CAD models that are effective for both adult and pediatric age groups. ",
    "url": "https://arxiv.org/abs/2404.12958",
    "authors": [
      "Mohammad Zunaed",
      "Anwarul Hasan",
      "Taufiq Hasan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.09325",
    "title": "EATFormer: Improving Vision Transformer Inspired by Evolutionary  Algorithm",
    "abstract": " Title: EATFormer: Improving Vision Transformer Inspired by Evolutionary  Algorithm ",
    "url": "https://arxiv.org/abs/2206.09325",
    "authors": [
      "Jiangning Zhang",
      "Xiangtai Li",
      "Yabiao Wang",
      "Chengjie Wang",
      "Yibo Yang",
      "Yong Liu",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2206.15101",
    "title": "The maximum capability of a topological feature in link prediction",
    "abstract": " Title: The maximum capability of a topological feature in link prediction ",
    "url": "https://arxiv.org/abs/2206.15101",
    "authors": [
      "Yijun Ran",
      "Xiao-Ke Xu",
      "Tao Jia"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.05166",
    "title": "Learning Distributions over Trajectories for Human Behavior Prediction",
    "abstract": " Title: Learning Distributions over Trajectories for Human Behavior Prediction ",
    "url": "https://arxiv.org/abs/2304.05166",
    "authors": [
      "Anna Mészáros",
      "Julian F. Schumann",
      "Javier Alonso-Mora",
      "Arkady Zgonnikov",
      "Jens Kober"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.03803",
    "title": "A Survey of Trojans in Neural Models of Source Code: Taxonomy and  Techniques",
    "abstract": " Title: A Survey of Trojans in Neural Models of Source Code: Taxonomy and  Techniques ",
    "url": "https://arxiv.org/abs/2305.03803",
    "authors": [
      "Aftab Hussain",
      "Md Rafiqul Islam Rabin",
      "Toufique Ahmed",
      "Navid Ayoobi",
      "Bowen Xu",
      "Prem Devanbu",
      "Mohammad Amin Alipour"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2306.03027",
    "title": "Explicit feedback synthesis for nonlinear robust model predictive  control driven by quasi-interpolation",
    "abstract": " Comments: 29 Pages; submitted ",
    "url": "https://arxiv.org/abs/2306.03027",
    "authors": [
      "Siddhartha Ganguly",
      "Debasish Chatterjee"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2306.06449",
    "title": "List homomorphisms to separable signed graphs",
    "abstract": " Comments: A revised version, to appear in Theoretical Computer Science ",
    "url": "https://arxiv.org/abs/2306.06449",
    "authors": [
      "Jan Bok",
      "Richard Brewster",
      "Tomás Feder",
      "Pavol Hell",
      "Nikola Jedličková"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2306.08386",
    "title": "Efficient Backdoor Attacks for Deep Neural Networks in Real-world  Scenarios",
    "abstract": " Comments: ICLR 2024 ",
    "url": "https://arxiv.org/abs/2306.08386",
    "authors": [
      "Ziqiang Li",
      "Hong Sun",
      "Pengfei Xia",
      "Heng Li",
      "Beihao Xia",
      "Yi Wu",
      "Bin Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.01004",
    "title": "Joint Coordinate Regression and Association For Multi-Person Pose  Estimation, A Pure Neural Network Approach",
    "abstract": " Comments: This paper has been accepted by MMasia 2023 and is an oral presentation ",
    "url": "https://arxiv.org/abs/2307.01004",
    "authors": [
      "Dongyang Yu",
      "Yunshi Xie",
      "Wangpeng An",
      "Li Zhang",
      "Yufeng Yao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04725",
    "title": "Self-supervised Learning of Rotation-invariant 3D Point Set Features  using Transformer and its Self-distillation",
    "abstract": " Comments: Accepted to the CVIU journal ",
    "url": "https://arxiv.org/abs/2308.04725",
    "authors": [
      "Takahiko Furuya",
      "Zhoujie Chen",
      "Ryutarou Ohbuchi",
      "Zhenzhong Kuang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2308.08945",
    "title": "Interpretable Graph Neural Networks for Tabular Data",
    "abstract": " Comments: 18 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2308.08945",
    "authors": [
      "Amr Alkhatib",
      "Sofiane Ennadir",
      "Henrik Boström",
      "Michalis Vazirgiannis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.10838",
    "title": "An impossibility result for Markov Chain Monte Carlo sampling from  micro-canonical bipartite graph ensembles",
    "abstract": " Comments: Accepted for publication in Physical Review E ",
    "url": "https://arxiv.org/abs/2308.10838",
    "authors": [
      "Giulia Preti",
      "Gianmarco De Francisci Morales",
      "Matteo Riondato"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2308.11098",
    "title": "On the Interpretability of Quantum Neural Networks",
    "abstract": " Title: On the Interpretability of Quantum Neural Networks ",
    "url": "https://arxiv.org/abs/2308.11098",
    "authors": [
      "Lirandë Pira",
      "Chris Ferrie"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.02354",
    "title": "A Lightweight and Transferable Design for Robust LEGO Manipulation",
    "abstract": " Title: A Lightweight and Transferable Design for Robust LEGO Manipulation ",
    "url": "https://arxiv.org/abs/2309.02354",
    "authors": [
      "Ruixuan Liu",
      "Yifan Sun",
      "Changliu Liu"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2309.05442",
    "title": "Testing Spreading Behavior in Networks with Arbitrary Topologies",
    "abstract": " Comments: 36 pages, 4 figures, revised a few inaccuracies. To appear in ICALP 2024 ",
    "url": "https://arxiv.org/abs/2309.05442",
    "authors": [
      "Augusto Modanese",
      "Yuichi Yoshida"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computational Complexity (cs.CC)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2310.00132",
    "title": "QDFormer: Towards Robust Audiovisual Segmentation in Complex  Environments with Quantization-based Semantic Decomposition",
    "abstract": " Title: QDFormer: Towards Robust Audiovisual Segmentation in Complex  Environments with Quantization-based Semantic Decomposition ",
    "url": "https://arxiv.org/abs/2310.00132",
    "authors": [
      "Xiang Li",
      "Jinglu Wang",
      "Xiaohao Xu",
      "Xiulian Peng",
      "Rita Singh",
      "Yan Lu",
      "Bhiksha Raj"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.01880",
    "title": "AutoCast++: Enhancing World Event Prediction with Zero-shot  Ranking-based Context Retrieval",
    "abstract": " Comments: ICLR 2024 ",
    "url": "https://arxiv.org/abs/2310.01880",
    "authors": [
      "Qi Yan",
      "Raihan Seraj",
      "Jiawei He",
      "Lili Meng",
      "Tristan Sylvain"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03624",
    "title": "High-Degrees-of-Freedom Dynamic Neural Fields for Robot Self-Modeling  and Motion Planning",
    "abstract": " Comments: International Conference on Robotics and Automation (ICRA) 2024; ICCV 2023 Workshop on Neural Fields for Autonomous Driving and Robotics (oral) ",
    "url": "https://arxiv.org/abs/2310.03624",
    "authors": [
      "Lennart Schulze",
      "Hod Lipson"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.12079",
    "title": "Differential Equation Scaling Limits of Shaped and Unshaped Neural  Networks",
    "abstract": " Title: Differential Equation Scaling Limits of Shaped and Unshaped Neural  Networks ",
    "url": "https://arxiv.org/abs/2310.12079",
    "authors": [
      "Mufan Bill Li",
      "Mihai Nica"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17304",
    "title": "Static Semantics Reconstruction for Enhancing JavaScript-WebAssembly  Multilingual Malware Detection",
    "abstract": " Comments: Accepted to ESORICS 2023 ",
    "url": "https://arxiv.org/abs/2310.17304",
    "authors": [
      "Yifan Xia",
      "Ping He",
      "Xuhong Zhang",
      "Peiyu Liu",
      "Shouling Ji",
      "Wenhai Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2311.02909",
    "title": "Distributed Matrix-Based Sampling for Graph Neural Network Training",
    "abstract": " Comments: Proceedings of Machine Learning and Systems ",
    "url": "https://arxiv.org/abs/2311.02909",
    "authors": [
      "Alok Tripathy",
      "Katherine Yelick",
      "Aydin Buluc"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2311.10219",
    "title": "Measuring Moral Dimensions in Social Media with Mformer",
    "abstract": " Comments: To be published in ICWSM 2024 ",
    "url": "https://arxiv.org/abs/2311.10219",
    "authors": [
      "Tuan Dung Nguyen",
      "Ziyu Chen",
      "Nicholas George Carroll",
      "Alasdair Tran",
      "Colin Klein",
      "Lexing Xie"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2311.16666",
    "title": "MultiModal-Learning for Predicting Molecular Properties: A Framework  Based on Image and Graph Structures",
    "abstract": " Comments: 8 pages ",
    "url": "https://arxiv.org/abs/2311.16666",
    "authors": [
      "Zhuoyuan Wang",
      "Jiacong Mi",
      "Shan Lu",
      "Jieyue He"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Chemical Physics (physics.chem-ph)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2312.03781",
    "title": "Lite-Mind: Towards Efficient and Robust Brain Representation Network",
    "abstract": " Comments: 16 pages ",
    "url": "https://arxiv.org/abs/2312.03781",
    "authors": [
      "Zixuan Gong",
      "Qi Zhang",
      "Guangyin Bao",
      "Lei Zhu",
      "Yu Zhang",
      "Ke Liu",
      "Liang Hu",
      "Duoqian Miao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.08207",
    "title": "Black-box Membership Inference Attacks against Fine-tuned Diffusion  Models",
    "abstract": " Title: Black-box Membership Inference Attacks against Fine-tuned Diffusion  Models ",
    "url": "https://arxiv.org/abs/2312.08207",
    "authors": [
      "Yan Pang",
      "Tianhao Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.09780",
    "title": "RANRAC: Robust Neural Scene Representations via Random Ray Consensus",
    "abstract": " Title: RANRAC: Robust Neural Scene Representations via Random Ray Consensus ",
    "url": "https://arxiv.org/abs/2312.09780",
    "authors": [
      "Benno Buschmann",
      "Andreea Dogaru",
      "Elmar Eisemann",
      "Michael Weinmann",
      "Bernhard Egger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.14461",
    "title": "Attacking Byzantine Robust Aggregation in High Dimensions",
    "abstract": " Title: Attacking Byzantine Robust Aggregation in High Dimensions ",
    "url": "https://arxiv.org/abs/2312.14461",
    "authors": [
      "Sarthak Choudhary",
      "Aashish Kolluri",
      "Prateek Saxena"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.15883",
    "title": "HyKGE: A Hypothesis Knowledge Graph Enhanced Framework for Accurate and  Reliable Medical LLMs Responses",
    "abstract": " Comments: version 2 ",
    "url": "https://arxiv.org/abs/2312.15883",
    "authors": [
      "Xinke Jiang",
      "Ruizhe Zhang",
      "Yongxin Xu",
      "Rihong Qiu",
      "Yue Fang",
      "Zhiyuan Wang",
      "Jinyi Tang",
      "Hongxin Ding",
      "Xu Chu",
      "Junfeng Zhao",
      "Yasha Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.09943",
    "title": "Infinite-Horizon Graph Filters: Leveraging Power Series to Enhance  Sparse Information Aggregation",
    "abstract": " Comments: version 2 ",
    "url": "https://arxiv.org/abs/2401.09943",
    "authors": [
      "Ruizhe Zhang",
      "Xinke Jiang",
      "Yuchen Fang",
      "Jiayuan Luo",
      "Yongxin Xu",
      "Yichen Zhu",
      "Xu Chu",
      "Junfeng Zhao",
      "Yasha Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2401.11403",
    "title": "MolTailor: Tailoring Chemical Molecular Representation to Specific Tasks  via Text Prompts",
    "abstract": " Comments: Accepted by AAAI 2024 ",
    "url": "https://arxiv.org/abs/2401.11403",
    "authors": [
      "Haoqiang Guo",
      "Sendong Zhao",
      "Haochun Wang",
      "Yanrui Du",
      "Bing Qin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2401.14961",
    "title": "Set-Based Training for Neural Network Verification",
    "abstract": " Title: Set-Based Training for Neural Network Verification ",
    "url": "https://arxiv.org/abs/2401.14961",
    "authors": [
      "Lukas Koller",
      "Tobias Ladner",
      "Matthias Althoff"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2401.15661",
    "title": "Brain-Inspired Physics-Informed Neural Networks: Bare-Minimum Neural  Architectures for PDE Solvers",
    "abstract": " Comments: Accepted at the 24th International Conference on Computational Science (ICCS) ",
    "url": "https://arxiv.org/abs/2401.15661",
    "authors": [
      "Stefano Markidis"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2402.02866",
    "title": "Quantum Normalizing Flows for Anomaly Detection",
    "abstract": " Comments: v2: 13 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2402.02866",
    "authors": [
      "Bodo Rosenhahn",
      "Christoph Hirche"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.08174",
    "title": "Hierarchical Position Embedding of Graphs with Landmarks and Clustering  for Link Prediction",
    "abstract": " Comments: The International World Wide Web Conference (WWW) 2024, Accepted paper ",
    "url": "https://arxiv.org/abs/2402.08174",
    "authors": [
      "Minsang Kim",
      "Seungjun Baek"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.15984",
    "title": "A unified Fourier slice method to derive ridgelet transform for a  variety of depth-2 neural networks",
    "abstract": " Title: A unified Fourier slice method to derive ridgelet transform for a  variety of depth-2 neural networks ",
    "url": "https://arxiv.org/abs/2402.15984",
    "authors": [
      "Sho Sonoda",
      "Isao Ishikawa",
      "Masahiro Ikeda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Functional Analysis (math.FA)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.16240",
    "title": "High-Frequency-aware Hierarchical Contrastive Selective Coding for  Representation Learning on Text-attributed Graphs",
    "abstract": " Comments: Accepted by WWW 2024 ",
    "url": "https://arxiv.org/abs/2402.16240",
    "authors": [
      "Peiyan Zhang",
      "Chaozhuo Li",
      "Liying Kang",
      "Feiran Huang",
      "Senzhang Wang",
      "Xing Xie",
      "Sunghun Kim"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2402.17205",
    "title": "Measuring Vision-Language STEM Skills of Neural Models",
    "abstract": " Comments: Accepted in ICLR 2024 ",
    "url": "https://arxiv.org/abs/2402.17205",
    "authors": [
      "Jianhao Shen",
      "Ye Yuan",
      "Srbuhi Mirzoyan",
      "Ming Zhang",
      "Chenguang Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.17905",
    "title": "Using Graph Neural Networks to Predict Local Culture",
    "abstract": " Comments: 14 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2402.17905",
    "authors": [
      "Thiago H Silva",
      "Daniel Silver"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.00199",
    "title": "Improving Socratic Question Generation using Data Augmentation and  Preference Optimization",
    "abstract": " Comments: Published at the 19th BEA Workshop co-located with NAACL-2024 ",
    "url": "https://arxiv.org/abs/2403.00199",
    "authors": [
      "Nischal Ashok Kumar",
      "Andrew Lan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.05020",
    "title": "Is this the real life? Is this just fantasy? The Misleading Success of  Simulating Social Interactions With LLMs",
    "abstract": " Title: Is this the real life? Is this just fantasy? The Misleading Success of  Simulating Social Interactions With LLMs ",
    "url": "https://arxiv.org/abs/2403.05020",
    "authors": [
      "Xuhui Zhou",
      "Zhe Su",
      "Tiwalayo Eisape",
      "Hyunwoo Kim",
      "Maarten Sap"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.08511",
    "title": "A Multimodal Fusion Network For Student Emotion Recognition Based on  Transformer and Tensor Product",
    "abstract": " Title: A Multimodal Fusion Network For Student Emotion Recognition Based on  Transformer and Tensor Product ",
    "url": "https://arxiv.org/abs/2403.08511",
    "authors": [
      "Ao Xiang",
      "Zongqing Qi",
      "Han Wang",
      "Qin Yang",
      "Danqing Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.16050",
    "title": "Heterogeneous Federated Learning with Splited Language Model",
    "abstract": " Title: Heterogeneous Federated Learning with Splited Language Model ",
    "url": "https://arxiv.org/abs/2403.16050",
    "authors": [
      "Yifan Shi",
      "Yuhui Zhang",
      "Ziyue Huang",
      "Xiaofeng Yang",
      "Li Shen",
      "Wei Chen",
      "Xueqian Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.00044",
    "title": "UAlign: Pushing the Limit of Template-free Retrosynthesis Prediction  with Unsupervised SMILES Alignment",
    "abstract": " Title: UAlign: Pushing the Limit of Template-free Retrosynthesis Prediction  with Unsupervised SMILES Alignment ",
    "url": "https://arxiv.org/abs/2404.00044",
    "authors": [
      "Kaipeng Zeng",
      "Bo yang",
      "Xin Zhao",
      "Yu Zhang",
      "Fan Nie",
      "Xiaokang Yang",
      "Yaohui Jin",
      "Yanyan Xu"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2404.01523",
    "title": "Proactive Service Assurance in 5G and B5G Networks: A Closed-Loop  Algorithm for End-to-End Network Slicing",
    "abstract": " Title: Proactive Service Assurance in 5G and B5G Networks: A Closed-Loop  Algorithm for End-to-End Network Slicing ",
    "url": "https://arxiv.org/abs/2404.01523",
    "authors": [
      "Nguyen Phuc Tran",
      "Oscar Delgado",
      "Brigitte Jaumard"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2404.04876",
    "title": "HiLo: Detailed and Robust 3D Clothed Human Reconstruction with High-and  Low-Frequency Information of Parametric Models",
    "abstract": " Comments: CVPR 2024 Accepted Paper ",
    "url": "https://arxiv.org/abs/2404.04876",
    "authors": [
      "Yifan Yang",
      "Dong Liu",
      "Shuhai Zhang",
      "Zeshuai Deng",
      "Zixiong Huang",
      "Mingkui Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.06860",
    "title": "Monocular 3D lane detection for Autonomous Driving: Recent Achievements,  Challenges, and Outlooks",
    "abstract": " Title: Monocular 3D lane detection for Autonomous Driving: Recent Achievements,  Challenges, and Outlooks ",
    "url": "https://arxiv.org/abs/2404.06860",
    "authors": [
      "Fulong Ma",
      "Weiqing Qi",
      "Guoyang Zhao",
      "Linwei Zheng",
      "Sheng Wang",
      "Yuxuan Liu",
      "Ming Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.06883",
    "title": "Research on Detection of Floating Objects in River and Lake Based on AI  Intelligent Image Recognition",
    "abstract": " Title: Research on Detection of Floating Objects in River and Lake Based on AI  Intelligent Image Recognition ",
    "url": "https://arxiv.org/abs/2404.06883",
    "authors": [
      "Jingyu Zhang",
      "Ao Xiang",
      "Yu Cheng",
      "Qin Yang",
      "Liyang Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.09401",
    "title": "Watermark-embedded Adversarial Examples for Copyright Protection against  Diffusion Models",
    "abstract": " Comments: updated references ",
    "url": "https://arxiv.org/abs/2404.09401",
    "authors": [
      "Peifei Zhu",
      "Tsubasa Takahashi",
      "Hirokatsu Kataoka"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.09530",
    "title": "RanLayNet: A Dataset for Document Layout Detection used for Domain  Adaptation and Generalization",
    "abstract": " Comments: 8 pages, 6 figures, MMAsia 2023 Proceedings of the 5th ACM International Conference on Multimedia in Asia ",
    "url": "https://arxiv.org/abs/2404.09530",
    "authors": [
      "Avinash Anand",
      "Raj Jaiswal",
      "Mohit Gupta",
      "Siddhesh S Bangar",
      "Pijush Bhuyan",
      "Naman Lal",
      "Rajeev Singh",
      "Ritika Jha",
      "Rajiv Ratn Shah",
      "Shin'ichi Satoh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.09894",
    "title": "Glitch Tokens in Large Language Models: Categorization Taxonomy and  Effective Detection",
    "abstract": " Title: Glitch Tokens in Large Language Models: Categorization Taxonomy and  Effective Detection ",
    "url": "https://arxiv.org/abs/2404.09894",
    "authors": [
      "Yuxi Li",
      "Yi Liu",
      "Gelei Deng",
      "Ying Zhang",
      "Wenjia Song",
      "Ling Shi",
      "Kailong Wang",
      "Yuekang Li",
      "Yang Liu",
      "Haoyu Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.10305",
    "title": "TC-OCR: TableCraft OCR for Efficient Detection & Recognition of Table  Structure & Content",
    "abstract": " Comments: 8 pages, 2 figures, Workshop of 1st MMIR Deep Multimodal Learning for Information Retrieval ",
    "url": "https://arxiv.org/abs/2404.10305",
    "authors": [
      "Avinash Anand",
      "Raj Jaiswal",
      "Pijush Bhuyan",
      "Mohit Gupta",
      "Siddhesh Bangar",
      "Md. Modassir Imam",
      "Rajiv Ratn Shah",
      "Shin'ichi Satoh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.10591",
    "title": "Learning Symbolic Task Representation from a Human-Led Demonstration: A  Memory to Store, Retrieve, Consolidate, and Forget Experiences",
    "abstract": " Title: Learning Symbolic Task Representation from a Human-Led Demonstration: A  Memory to Store, Retrieve, Consolidate, and Forget Experiences ",
    "url": "https://arxiv.org/abs/2404.10591",
    "authors": [
      "Luca Buoncompagni",
      "Fulvio Mastrogiovanni"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2404.10718",
    "title": "GazeHTA: End-to-end Gaze Target Detection with Head-Target Association",
    "abstract": " Title: GazeHTA: End-to-end Gaze Target Detection with Head-Target Association ",
    "url": "https://arxiv.org/abs/2404.10718",
    "authors": [
      "Zhi-Yi Lin",
      "Jouh Yeong Chew",
      "Jan van Gemert",
      "Xucong Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11181",
    "title": "KI-GAN: Knowledge-Informed Generative Adversarial Networks for Enhanced  Multi-Vehicle Trajectory Forecasting at Signalized Intersections",
    "abstract": " Comments: 2024 CVPR AICity Workshop ",
    "url": "https://arxiv.org/abs/2404.11181",
    "authors": [
      "Chuheng Wei",
      "Guoyuan Wu",
      "Matthew J. Barth",
      "Amr Abdelraouf",
      "Rohit Gupta",
      "Kyungtae Han"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2404.11214",
    "title": "Feature Corrective Transfer Learning: End-to-End Solutions to Object  Detection in Non-Ideal Visual Conditions",
    "abstract": " Comments: 2024 CVPR UG2+ Workshop ",
    "url": "https://arxiv.org/abs/2404.11214",
    "authors": [
      "Chuheng Wei",
      "Guoyuan Wu",
      "Matthew J. Barth"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11294",
    "title": "LogSD: Detecting Anomalies from System Logs through Self-supervised  Learning and Frequency-based Masking",
    "abstract": " Comments: 23 pages with 11 figures ",
    "url": "https://arxiv.org/abs/2404.11294",
    "authors": [
      "Yongzheng Xie",
      "Hongyu Zhang",
      "Muhammad Ali Babar"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2404.11326",
    "title": "Single-temporal Supervised Remote Change Detection for Domain  Generalization",
    "abstract": " Title: Single-temporal Supervised Remote Change Detection for Domain  Generalization ",
    "url": "https://arxiv.org/abs/2404.11326",
    "authors": [
      "Qiangang Du",
      "Jinlong Peng",
      "Xu Chen",
      "Qingdong He",
      "Liren He",
      "Qiang Nie",
      "Wenbing Zhu",
      "Mingmin Chi",
      "Yabiao Wang",
      "Chengjie Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2404.11496",
    "title": "Runtime Analysis of Evolutionary Diversity Optimization on the  Multi-objective (LeadingOnes, TrailingZeros) Problem",
    "abstract": " Title: Runtime Analysis of Evolutionary Diversity Optimization on the  Multi-objective (LeadingOnes, TrailingZeros) Problem ",
    "url": "https://arxiv.org/abs/2404.11496",
    "authors": [
      "Denis Antipov",
      "Aneta Neumann",
      "Frank Neumann",
      "Andrew M. Sutton"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.11862",
    "title": "A Fast Maximum Clique Algorithm Based on Network Decomposition for Large  Sparse Networks",
    "abstract": " Comments: 12 pages, 2 figures, 1 table ",
    "url": "https://arxiv.org/abs/2404.11862",
    "authors": [
      "Tianlong Fan",
      "Wenjun Jiang",
      "Yi-Cheng Zhang",
      "Linyuan Lü"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Structures and Algorithms (cs.DS)",
      "Information Retrieval (cs.IR)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2404.12149",
    "title": "AccidentBlip2: Accident Detection With Multi-View MotionBlip2",
    "abstract": " Title: AccidentBlip2: Accident Detection With Multi-View MotionBlip2 ",
    "url": "https://arxiv.org/abs/2404.12149",
    "authors": [
      "Yihua Shao",
      "Hongyi Cai",
      "Xinwei Long",
      "Weiyi Lang",
      "Zhe Wang",
      "Haoran Wu",
      "Yan Wang",
      "Yinjia Yi",
      "Yang Yang",
      "Zhen Lei"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2404.12235",
    "title": "Beyond Average: Individualized Visual Scanpath Prediction",
    "abstract": " Comments: To appear in CVPR2024 ",
    "url": "https://arxiv.org/abs/2404.12235",
    "authors": [
      "Xianyu Chen",
      "Ming Jiang",
      "Qi Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]