[
  {
    "id": "arXiv:2106.13277",
    "title": "Geometric learning of the conformational dynamics of molecules using  dynamic graph neural networks",
    "abstract": "We apply a temporal edge prediction model for weighted dynamic graphs to predict time-dependent changes in molecular structure. Each molecule is represented as a complete graph in which each atom is a vertex and all vertex pairs are connected by an edge weighted by the Euclidean distance between atom pairs. We ingest a sequence of complete molecular graphs into a dynamic graph neural network (GNN) to predict the graph at the next time step. Our dynamic GNN predicts atom-to-atom distances with a mean absolute error of 0.017 \\r{A}, which is considered ``chemically accurate'' for molecular simulations. We also explored the transferability of a trained network to new molecular systems and found that finetuning with less than 10% of the total trajectory provides a mean absolute error of the same order of magnitude as that when training from scratch on the full molecular trajectory. ",
    "url": "https://arxiv.org/abs/2106.13277",
    "authors": [
      "Michael Hunter Ashby",
      "Jenna A. Bilbrey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2106.13422",
    "title": "Vulnerability and Transaction behavior based detection of Malicious  Smart Contracts",
    "abstract": "Smart Contracts (SCs) in Ethereum can automate tasks and provide different functionalities to a user. Such automation is enabled by the `Turing-complete' nature of the programming language (Solidity) in which SCs are written. This also opens up different vulnerabilities and bugs in SCs that malicious actors exploit to carry out malicious or illegal activities on the cryptocurrency platform. In this work, we study the correlation between malicious activities and the vulnerabilities present in SCs and find that some malicious activities are correlated with certain types of vulnerabilities. We then develop and study the feasibility of a scoring mechanism that corresponds to the severity of the vulnerabilities present in SCs to determine if it is a relevant feature to identify suspicious SCs. We analyze the utility of severity score towards detection of suspicious SCs using unsupervised machine learning (ML) algorithms across different temporal granularities and identify behavioral changes. In our experiments with on-chain SCs, we were able to find a total of 1094 benign SCs across different granularities which behave similar to malicious SCs, with the inclusion of the smart contract vulnerability scores in the feature set. ",
    "url": "https://arxiv.org/abs/2106.13422",
    "authors": [
      "Rachit Agarwal",
      "Tanmay Thapliyal",
      "Sandeep Kumar Shukla"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.13542",
    "title": "Tensor-based framework for training flexible neural networks",
    "abstract": "Activation functions (AFs) are an important part of the design of neural networks (NNs), and their choice plays a predominant role in the performance of a NN. In this work, we are particularly interested in the estimation of flexible activation functions using tensor-based solutions, where the AFs are expressed as a weighted sum of predefined basis functions. To do so, we propose a new learning algorithm which solves a constrained coupled matrix-tensor factorization (CMTF) problem. This technique fuses the first and zeroth order information of the NN, where the first-order information is contained in a Jacobian tensor, following a constrained canonical polyadic decomposition (CPD). The proposed algorithm can handle different decomposition bases. The goal of this method is to compress large pretrained NN models, by replacing subnetworks, {\\em i.e.,} one or multiple layers of the original network, by a new flexible layer. The approach is applied to a pretrained convolutional neural network (CNN) used for character classification. ",
    "url": "https://arxiv.org/abs/2106.13542",
    "authors": [
      "Yassine Zniyed",
      "Konstantin Usevich",
      "Sebastian Miron",
      "David Brie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.13556",
    "title": "SRPN: similarity-based region proposal networks for nuclei and cells  detection in histology images",
    "abstract": "The detection of nuclei and cells in histology images is of great value in both clinical practice and pathological studies. However, multiple reasons such as morphological variations of nuclei or cells make it a challenging task where conventional object detection methods cannot obtain satisfactory performance in many cases. A detection task consists of two sub-tasks, classification and localization. Under the condition of dense object detection, classification is a key to boost the detection performance. Considering this, we propose similarity based region proposal networks (SRPN) for nuclei and cells detection in histology images. In particular, a customized convolution layer termed as embedding layer is designed for network building. The embedding layer is added into the region proposal networks, enabling the networks to learn discriminative features based on similarity learning. Features obtained by similarity learning can significantly boost the classification performance compared to conventional methods. SRPN can be easily integrated into standard convolutional neural networks architectures such as the Faster R-CNN and RetinaNet. We test the proposed approach on tasks of multi-organ nuclei detection and signet ring cells detection in histological images. Experimental results show that networks applying similarity learning achieved superior performance on both tasks when compared to their counterparts. In particular, the proposed SRPN achieve state-of-the-art performance on the MoNuSeg benchmark for nuclei segmentation and detection while compared to previous methods, and on the signet ring cell detection benchmark when compared with baselines. The sourcecode is publicly available at: https://github.com/sigma10010/nuclei_cells_det. ",
    "url": "https://arxiv.org/abs/2106.13556",
    "authors": [
      "Yibao Sun",
      "Xingru Huang",
      "Huiyu Zhou",
      "Qianni Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.13560",
    "title": "Checking chordality on homomorphically encrypted graphs",
    "abstract": "The breakthrough of achieving fully homomorphic encryption sparked enormous studies on where and how to apply homomorphic encryption schemes so that operations can be performed on encrypted data without the secret key while still obtaining the correct outputs. Due to the computational cost, inflated ciphertext size and limited arithmetic operations that are allowed in most encryption schemes, feasible applications of homomorphic encryption are few. While theorists are working on the mathematical and cryptographical foundations of homomorphic encryption in order to overcome the current limitations, practitioners are also re-designing queries and algorithms to adapt the functionalities of the current encryption schemes. As an initial study on working with homomorphically encrypted graphs, this paper provides an easy-to-implement interactive algorithm to check whether or not a homomorphically encrypted graph is chordal. This algorithm is simply a refactoring of a current method to run on the encrypted adjacency matrices. ",
    "url": "https://arxiv.org/abs/2106.13560",
    "authors": [
      "Yang Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2106.13587",
    "title": "Graph space: using both geometric and probabilistic structure to  evaluate statistical graph models",
    "abstract": "Statistical graph models aim at modeling graphs as random realization among a set of possible graphs. One issue is to evaluate whether or not a graph is likely to have been generated by one particular model. In this paper we introduce the edit distance expected value (EDEV) and compare it with other methods such as entropy and distance to the barycenter. We show that contrary to them, EDEV is able to distinguish between graphs that have a typical structure with respect to a model, and those that do not. Finally we introduce a statistical hypothesis testing methodology based on this distance to evaluate the relevance of a candidate model with respect to an observed graph. ",
    "url": "https://arxiv.org/abs/2106.13587",
    "authors": [
      "Louis Duvivier",
      "Rémy Cazabet",
      "Céline Robardet"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2106.13603",
    "title": "Partially fake it till you make it: mixing real and fake thermal images  for improved object detection",
    "abstract": "In this paper we propose a novel data augmentation approach for visual content domains that have scarce training datasets, compositing synthetic 3D objects within real scenes. We show the performance of the proposed system in the context of object detection in thermal videos, a domain where 1) training datasets are very limited compared to visible spectrum datasets and 2) creating full realistic synthetic scenes is extremely cumbersome and expensive due to the difficulty in modeling the thermal properties of the materials of the scene. We compare different augmentation strategies, including state of the art approaches obtained through RL techniques, the injection of simulated data and the employment of a generative model, and study how to best combine our proposed augmentation with these other techniques.Experimental results demonstrate the effectiveness of our approach, and our single-modality detector achieves state-of-the-art results on the FLIR ADAS dataset. ",
    "url": "https://arxiv.org/abs/2106.13603",
    "authors": [
      "Francesco Bongini",
      "Lorenzo Berlincioni",
      "Marco Bertini",
      "Alberto Del Bimbo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.13652",
    "title": "A mechanistic-based data-driven approach to accelerate structural  topology optimization through finite element convolutional neural network  (FE-CNN)",
    "abstract": "In this paper, a mechanistic data-driven approach is proposed to accelerate structural topology optimization, employing an in-house developed finite element convolutional neural network (FE-CNN). Our approach can be divided into two stages: offline training, and online optimization. During offline training, a mapping function is built between high and low resolution representations of a given design domain. The mapping is expressed by a FE-CNN, which targets a common objective function value (e.g., structural compliance) across design domains of differing resolutions. During online optimization, an arbitrary design domain of high resolution is reduced to low resolution through the trained mapping function. The original high-resolution domain is thus designed by computations performed on only the low-resolution version, followed by an inverse mapping back to the high-resolution domain. Numerical examples demonstrate that this approach can accelerate optimization by up to an order of magnitude in computational time. Our proposed approach therefore shows great potential to overcome the curse-of-dimensionality incurred by density-based structural topology optimization. The limitation of our present approach is also discussed. ",
    "url": "https://arxiv.org/abs/2106.13652",
    "authors": [
      "Tianle Yue",
      "Hang Yang",
      "Zongliang Du",
      "Chang Liu",
      "Khalil I. Elkhodary",
      "Shan Tang",
      "Xu Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.13672",
    "title": "Exposing individual differences through network topology",
    "abstract": "Social animals, including humans, have a broad range of personality traits, which can be used to predict individual behavioral responses and decisions. Current methods to quantify individual personality traits in humans rely on self-report questionnaires, which require time and effort to collect and rely on active cooperation. However, personality differences naturally manifest in social interactions such as online social networks. Here, we demonstrate that the topology of an online social network can be used to characterize the personality traits of its members. We analyzed the directed social graph formed by the users of the LiveJournal (LJ) blogging platform. Individual users personality traits, inferred from their self-reported domains of interest (DOIs), were associated with their network measures. Empirical clustering of DOIs by topological similarity exposed two main self-emergent DOI groups that were in alignment with the personality meta-traits plasticity and stability. Closeness, a global topological measure of network centrality, was significantly higher for bloggers associated with plasticity (vs. stability). A local network motif (a triad of 3 connected bloggers) that correlated with closeness also separated the personality meta-traits. Finally, topology-based classification of DOIs (without analyzing the content of the blogs) attained > 70% accuracy (average AUC of the test-set). These results indicate that personality traits are evident and detectable in network topology. This has serious implications for user privacy. But, if used responsibly, network identification of personality traits could aid in early identification of health-related risks, at the population level. ",
    "url": "https://arxiv.org/abs/2106.13672",
    "authors": [
      "Yuval Samoilov-Katz",
      "Yoram Louzoun",
      "Lev Muchnik",
      "Adam Zaidel"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2106.13727",
    "title": "Interval and fuzzy physics-informed neural networks for uncertain fields",
    "abstract": "Temporally and spatially dependent uncertain parameters are regularly encountered in engineering applications. Commonly these uncertainties are accounted for using random fields and processes which require knowledge about the appearing probability distributions functions which is not readily available. In these cases non-probabilistic approaches such as interval analysis and fuzzy set theory are helpful uncertainty measures. Partial differential equations involving fuzzy and interval fields are traditionally solved using the finite element method where the input fields are sampled using some basis function expansion methods. This approach however is problematic, as it is reliant on knowledge about the spatial correlation fields. In this work we utilize physics-informed neural networks (PINNs) to solve interval and fuzzy partial differential equations. The resulting network structures termed interval physics-informed neural networks (iPINNs) and fuzzy physics-informed neural networks (fPINNs) show promising results for obtaining bounded solutions of equations involving spatially uncertain parameter fields. In contrast to finite element approaches, no correlation length specification of the input fields as well as no averaging via Monte-Carlo simulations are necessary. In fact, information about the input interval fields is obtained directly as a byproduct of the presented solution scheme. Furthermore, all major advantages of PINNs are retained, i.e. meshfree nature of the scheme, and ease of inverse problem set-up. ",
    "url": "https://arxiv.org/abs/2106.13727",
    "authors": [
      "Jan Niklas Fuhg",
      "Amélie Fau",
      "Nikolaos Bouklas"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.13786",
    "title": "Data efficiency in graph networks through equivariance",
    "abstract": "We introduce a novel architecture for graph networks which is equivariant to any transformation in the coordinate embeddings that preserves the distance between neighbouring nodes. In particular, it is equivariant to the Euclidean and conformal orthogonal groups in $n$-dimensions. Thanks to its equivariance properties, the proposed model is extremely more data efficient with respect to classical graph architectures and also intrinsically equipped with a better inductive bias. We show that, learning on a minimal amount of data, the architecture we propose can perfectly generalise to unseen data in a synthetic problem, while much more training data are required from a standard model to reach comparable performance. ",
    "url": "https://arxiv.org/abs/2106.13786",
    "authors": [
      "Francesco Farina",
      "Emma Slade"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.13318",
    "title": "Realistic molecule optimization on a learned graph manifold",
    "abstract": "Deep learning based molecular graph generation and optimization has recently been attracting attention due to its great potential for de novo drug design. On the one hand, recent models are able to efficiently learn a given graph distribution, and many approaches have proven very effective to produce a molecule that maximizes a given score. On the other hand, it was shown by previous studies that generated optimized molecules are often unrealistic, even with the inclusion of mechanics to enforce similarity to a dataset of real drug molecules. In this work we use a hybrid approach, where the dataset distribution is learned using an autoregressive model while the score optimization is done using the Metropolis algorithm, biased toward the learned distribution. We show that the resulting method, that we call learned realism sampling (LRS), produces empirically more realistic molecules and outperforms all recent baselines in the task of molecule optimization with similarity constraints. ",
    "url": "https://arxiv.org/abs/2106.13318",
    "authors": [
      "Rémy Brossard",
      "Oriel Frigo",
      "David Dehaene"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.13683",
    "title": "A proximal-proximal majorization-minimization algorithm for nonconvex  tuning-free robust regression problems",
    "abstract": "In this paper, we introduce a proximal-proximal majorization-minimization (PPMM) algorithm for nonconvex tuning-free robust regression problems. The basic idea is to apply the proximal majorization-minimization algorithm to solve the nonconvex problem with the inner subproblems solved by a sparse semismooth Newton (SSN) method based proximal point algorithm (PPA). We must emphasize that the main difficulty in the design of the algorithm lies in how to overcome the singular difficulty of the inner subproblem. Furthermore, we also prove that the PPMM algorithm converges to a d-stationary point. Due to the Kurdyka-Lojasiewicz (KL) property of the problem, we present the convergence rate of the PPMM algorithm. Numerical experiments demonstrate that our proposed algorithm outperforms the existing state-of-the-art algorithms. ",
    "url": "https://arxiv.org/abs/2106.13683",
    "authors": [
      "Peipei Tang",
      "Chengjing Wang",
      "Bo Jiang"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Computation (stat.CO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2003.12319",
    "title": "Boolean learning under noise-perturbations in hardware neural networks",
    "abstract": " Comments: 8 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2003.12319",
    "authors": [
      "Louis Andreoli",
      "Xavier Porte",
      "Stéphane Chrétien",
      "Maxime Jacquot",
      "Laurent Larger",
      "Daniel Brunner"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2012.02785",
    "title": "Unsupervised embedding of trajectories captures the latent structure of  mobility",
    "abstract": " Comments: 36 pages (main text), 79 pages total. 6 figures (main text), 25 figures in supporting information ",
    "url": "https://arxiv.org/abs/2012.02785",
    "authors": [
      "Dakota Murray",
      "Jisung Yoon",
      "Sadamori Kojaku",
      "Rodrigo Costas",
      "Woo-Sung Jung",
      "Staša Milojević",
      "Yong-Yeol Ahn"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2102.13092",
    "title": "Quantitative approximation results for complex-valued neural networks",
    "abstract": " Title: Quantitative approximation results for complex-valued neural networks ",
    "url": "https://arxiv.org/abs/2102.13092",
    "authors": [
      "A. Caragea",
      "D.G. Lee",
      "J. Maly",
      "G. Pfander",
      "F. Voigtlaender"
    ],
    "subjectives": [
      "Functional Analysis (math.FA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.02222",
    "title": "Minimizing network bandwidth under latency constraints: The single node  case",
    "abstract": " Title: Minimizing network bandwidth under latency constraints: The single node  case ",
    "url": "https://arxiv.org/abs/2104.02222",
    "authors": [
      "Jiayi Song",
      "Roch Guérin",
      "Henry Sariowan"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2106.09474",
    "title": "Optimising simulations for diphoton production at hadron colliders using  amplitude neural networks",
    "abstract": " Comments: 31 pages, 12 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2106.09474",
    "authors": [
      "Joseph Aylett-Bullock",
      "Simon Badger",
      "Ryan Moodie"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.11160",
    "title": "Effects of boundary conditions in fully convolutional networks for  learning spatio-temporal dynamics",
    "abstract": " Comments: 17 pages, 8 figures, submitted to ECML PKDD 2021 Conference ",
    "url": "https://arxiv.org/abs/2106.11160",
    "authors": [
      "Antonio Alguacil",
      "Gonçalves Pinto",
      "Michael Bauerheim",
      "Marc C. Jacob",
      "Stéphane Moreau"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  }
]