[
  {
    "id": "arXiv:2308.12981",
    "title": "An approach based on Open Research Knowledge Graph for Knowledge  Acquisition from scientific papers",
    "abstract": "A scientific paper can be divided into two major constructs which are Metadata and Full-body text. Metadata provides a brief overview of the paper while the Full-body text contains key-insights that can be valuable to fellow researchers. To retrieve metadata and key-insights from scientific papers, knowledge acquisition is a central activity. It consists of gathering, analyzing and organizing knowledge embedded in scientific papers in such a way that it can be used and reused whenever needed. Given the wealth of scientific literature, manual knowledge acquisition is a cumbersome task. Thus, computer-assisted and (semi-)automatic strategies are generally adopted. Our purpose in this research was two fold: curate Open Research Knowledge Graph (ORKG) with papers related to ontology learning and define an approach using ORKG as a computer-assisted tool to organize key-insights extracted from research papers. This approach was used to document the \"epidemiological surveillance systems design and implementation\" research problem and to prepare the related work of this paper. It is currently used to document \"food information engineering\", \"Tabular data to Knowledge Graph Matching\" and \"Question Answering\" research problems and \"Neuro-symbolic AI\" domain. ",
    "url": "https://arxiv.org/abs/2308.12981",
    "authors": [
      "Azanzi Jiomekong",
      "Sanju Tiwari"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.12985",
    "title": "Perimeter Control with Heterogeneous Cordon Signal Behaviors: A  Semi-Model Dependent Reinforcement Learning Approach",
    "abstract": "Perimeter Control (PC) strategies have been proposed to address urban road network control in oversaturated situations by monitoring transfer flows of the Protected Network (PN). The uniform metering rate for cordon signals in existing studies ignores the variety of local traffic states at the intersection level, which may cause severe local traffic congestion and ruin the network stability. This paper introduces a semi-model dependent Multi-Agent Reinforcement Learning (MARL) framework to conduct PC with heterogeneous cordon signal behaviors. The proposed strategy integrates the MARL-based signal control method with centralized feedback PC policy and is applied to cordon signals of the PN. It operates as a two-stage system, with the feedback PC strategy detecting the overall traffic state within the PN and then distributing local instructions to cordon signals controlled by agents in the MARL framework. Each cordon signal acts independently and differently, creating a slack and distributed PC for the PN. The combination of the model-free and model-based methods is achieved by reconstructing the action-value function of the local agents with PC feedback reward without violating the integrity of the local signal control policy learned from the RL training process. Through numerical tests with different demand patterns in a microscopic traffic environment, the proposed PC strategy (a) is shown robustness, scalability, and transferability, (b) outperforms state-of-the-art model-based PC strategies in increasing network throughput, reducing cordon queue and carbon emission. ",
    "url": "https://arxiv.org/abs/2308.12985",
    "authors": [
      "Jiajie Yu",
      "Pierre-Antoine Laharotte",
      "Yu Han",
      "Ludovic Leclercq"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.13004",
    "title": "Spherical Vision Transformer for 360-degree Video Saliency Prediction",
    "abstract": "The growing interest in omnidirectional videos (ODVs) that capture the full field-of-view (FOV) has gained 360-degree saliency prediction importance in computer vision. However, predicting where humans look in 360-degree scenes presents unique challenges, including spherical distortion, high resolution, and limited labelled data. We propose a novel vision-transformer-based model for omnidirectional videos named SalViT360 that leverages tangent image representations. We introduce a spherical geometry-aware spatiotemporal self-attention mechanism that is capable of effective omnidirectional video understanding. Furthermore, we present a consistency-based unsupervised regularization term for projection-based 360-degree dense-prediction models to reduce artefacts in the predictions that occur after inverse projection. Our approach is the first to employ tangent images for omnidirectional saliency prediction, and our experimental results on three ODV saliency datasets demonstrate its effectiveness compared to the state-of-the-art. ",
    "url": "https://arxiv.org/abs/2308.13004",
    "authors": [
      "Mert Cokelek",
      "Nevrez Imamoglu",
      "Cagri Ozcinar",
      "Erkut Erdem",
      "Aykut Erdem"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2308.13047",
    "title": "Federated Learning of Causal Effects from Incomplete Observational Data",
    "abstract": "Decentralized and incomplete data sources are prevalent in real-world applications, posing a formidable challenge for causal inference. These sources cannot be consolidated into a single entity owing to privacy constraints, and the presence of missing values within them can potentially introduce bias to the causal estimands. We introduce a new approach for federated causal inference from incomplete data, enabling the estimation of causal effects from multiple decentralized and incomplete data sources. Our approach disentangles the loss function into multiple components, each corresponding to a specific data source with missing values. Our approach accounts for the missing data under the missing at random assumption, while also estimating higher-order statistics of the causal estimands. Our method recovers the conditional distribution of missing confounders given the observed confounders from the decentralized data sources to identify causal effects. Our framework estimates heterogeneous causal effects without the sharing of raw training data among sources, which helps to mitigate privacy risks. The efficacy of our approach is demonstrated through a collection of simulated and real-world instances, illustrating its potential and practicality. ",
    "url": "https://arxiv.org/abs/2308.13047",
    "authors": [
      "Thanh Vinh Vo",
      "Young lee",
      "Tze-Yun Leong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2308.13049",
    "title": "Bayesian Exploration Networks",
    "abstract": "Bayesian reinforcement learning (RL) offers a principled and elegant approach for sequential decision making under uncertainty. Most notably, Bayesian agents do not face an exploration/exploitation dilemma, a major pathology of frequentist methods. A key challenge for Bayesian RL is the computational complexity of learning Bayes-optimal policies, which is only tractable in toy domains. In this paper we propose a novel model-free approach to address this challenge. Rather than modelling uncertainty in high-dimensional state transition distributions as model-based approaches do, we model uncertainty in a one-dimensional Bellman operator. Our theoretical analysis reveals that existing model-free approaches either do not propagate epistemic uncertainty through the MDP or optimise over a set of contextual policies instead of all history-conditioned policies. Both approximations yield policies that can be arbitrarily Bayes-suboptimal. To overcome these issues, we introduce the Bayesian exploration network (BEN) which uses normalising flows to model both the aleatoric uncertainty (via density estimation) and epistemic uncertainty (via variational inference) in the Bellman operator. In the limit of complete optimisation, BEN learns true Bayes-optimal policies, but like in variational expectation-maximisation, partial optimisation renders our approach tractable. Empirical results demonstrate that BEN can learn true Bayes-optimal policies in tasks where existing model-free approaches fail. ",
    "url": "https://arxiv.org/abs/2308.13049",
    "authors": [
      "Mattie Fellows",
      "Brandon Kaplowitz",
      "Christian Schroeder de Witt",
      "Shimon Whiteson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.13053",
    "title": "Interaction-Aware Trajectory Prediction and Planning in Dense Highway  Traffic using Distributed Model Predictive Control",
    "abstract": "In this paper we treat optimal trajectory planning for an autonomous vehicle (AV) operating in dense traffic, where vehicles closely interact with each other. To tackle this problem, we present a novel framework that couples trajectory prediction and planning in multi-agent environments, using distributed model predictive control. A demonstration of our framework is presented in simulation, employing a trajectory planner using non-linear model predictive control. We analyze performance and convergence of our framework, subject to different prediction errors. The results indicate that the obtained locally optimal solutions are improved, compared with decoupled prediction and planning. ",
    "url": "https://arxiv.org/abs/2308.13053",
    "authors": [
      "Erik Börve",
      "Nikolce Murgovski",
      "Leo Laine"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.13054",
    "title": "Are there graphs whose shortest path structure requires large edge  weights?",
    "abstract": "The aspect ratio of a weighted graph $G$ is the ratio of its maximum edge weight to its minimum edge weight. Aspect ratio commonly arises as a complexity measure in graph algorithms, especially related to the computation of shortest paths. Popular paradigms are to interpolate between the settings of weighted and unweighted input graphs by incurring a dependence on aspect ratio, or by simply restricting attention to input graphs of low aspect ratio. This paper studies the effects of these paradigms, investigating whether graphs of low aspect ratio have more structured shortest paths than graphs in general. In particular, we raise the question of whether one can generally take a graph of large aspect ratio and \\emph{reweight} its edges, to obtain a graph with bounded aspect ratio while preserving the structure of its shortest paths. Our findings are: - Every weighted DAG on $n$ nodes has a shortest-paths preserving graph of aspect ratio $O(n)$. A simple lower bound shows that this is tight. - The previous result does not extend to general directed or undirected graphs; in fact, the answer turns out to be exponential in these settings. In particular, we construct directed and undirected $n$-node graphs for which any shortest-paths preserving graph has aspect ratio $2^{\\Omega(n)}$. We also consider the approximate version of this problem, where the goal is for shortest paths in $H$ to correspond to approximate shortest paths in $G$. We show that our exponential lower bounds extend even to this setting. We also show that in a closely related model, where approximate shortest paths in $H$ must also correspond to approximate shortest paths in $G$, even DAGs require exponential aspect ratio. ",
    "url": "https://arxiv.org/abs/2308.13054",
    "authors": [
      "Aaron Bernstein",
      "Greg Bodwin",
      "Nicole Wein"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2308.13057",
    "title": "Data-Side Efficiencies for Lightweight Convolutional Neural Networks",
    "abstract": "We examine how the choice of data-side attributes for two important visual tasks of image classification and object detection can aid in the choice or design of lightweight convolutional neural networks. We show by experimentation how four data attributes - number of classes, object color, image resolution, and object scale affect neural network model size and efficiency. Intra- and inter-class similarity metrics, based on metric learning, are defined to guide the evaluation of these attributes toward achieving lightweight models. Evaluations made using these metrics are shown to require 30x less computation than running full inference tests. We provide, as an example, applying the metrics and methods to choose a lightweight model for a robot path planning application and achieve computation reduction of 66% and accuracy gain of 3.5% over the pre-method model. ",
    "url": "https://arxiv.org/abs/2308.13057",
    "authors": [
      "Bryan Bo Cao",
      "Lawrence O'Gorman",
      "Michael Coss",
      "Shubham Jain"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13067",
    "title": "Causal Parrots: Large Language Models May Talk Causality But Are Not  Causal",
    "abstract": "Some argue scale is all what is needed to achieve AI, covering even causal models. We make it clear that large language models (LLMs) cannot be causal and give reason onto why sometimes we might feel otherwise. To this end, we define and exemplify a new subgroup of Structural Causal Model (SCM) that we call meta SCM which encode causal facts about other SCM within their variables. We conjecture that in the cases where LLM succeed in doing causal inference, underlying was a respective meta SCM that exposed correlations between causal facts in natural language on whose data the LLM was ultimately trained. If our hypothesis holds true, then this would imply that LLMs are like parrots in that they simply recite the causal knowledge embedded in the data. Our empirical analysis provides favoring evidence that current LLMs are even weak `causal parrots.' ",
    "url": "https://arxiv.org/abs/2308.13067",
    "authors": [
      "Matej Zečević",
      "Moritz Willig",
      "Devendra Singh Dhami",
      "Kristian Kersting"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.13073",
    "title": "SurGNN: Explainable visual scene understanding and assessment of  surgical skill using graph neural networks",
    "abstract": "This paper explores how graph neural networks (GNNs) can be used to enhance visual scene understanding and surgical skill assessment. By using GNNs to analyze the complex visual data of surgical procedures represented as graph structures, relevant features can be extracted and surgical skill can be predicted. Additionally, GNNs provide interpretable results, revealing the specific actions, instruments, or anatomical structures that contribute to the predicted skill metrics. This can be highly beneficial for surgical educators and trainees, as it provides valuable insights into the factors that contribute to successful surgical performance and outcomes. SurGNN proposes two concurrent approaches -- one supervised and the other self-supervised. The paper also briefly discusses other automated surgical skill evaluation techniques and highlights the limitations of hand-crafted features in capturing the intricacies of surgical expertise. We use the proposed methods to achieve state-of-the-art results on EndoVis19, and custom datasets. The working implementation of the code can be found at https://github.com/<redacted>. ",
    "url": "https://arxiv.org/abs/2308.13073",
    "authors": [
      "Shuja Khalid",
      "Frank Rudzicz"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.13086",
    "title": "SHIELD: Sustainable Hybrid Evolutionary Learning Framework for Carbon,  Wastewater, and Energy-Aware Data Center Management",
    "abstract": "Today's cloud data centers are often distributed geographically to provide robust data services. But these geo-distributed data centers (GDDCs) have a significant associated environmental impact due to their increasing carbon emissions and water usage, which needs to be curtailed. Moreover, the energy costs of operating these data centers continue to rise. This paper proposes a novel framework to co-optimize carbon emissions, water footprint, and energy costs of GDDCs, using a hybrid workload management framework called SHIELD that integrates machine learning guided local search with a decomposition-based evolutionary algorithm. Our framework considers geographical factors and time-based differences in power generation/use, costs, and environmental impacts to intelligently manage workload distribution across GDDCs and data center operation. Experimental results show that SHIELD can realize 34.4x speedup and 2.1x improvement in Pareto Hypervolume while reducing the carbon footprint by up to 3.7x, water footprint by up to 1.8x, energy costs by up to 1.3x, and a cumulative improvement across all objectives (carbon, water, cost) of up to 4.8x compared to the state-of-the-art. ",
    "url": "https://arxiv.org/abs/2308.13086",
    "authors": [
      "Sirui Qi",
      "Dejan Milojicic",
      "Cullen Bash",
      "Sudeep Pasricha"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2308.13099",
    "title": "Hybrid Genetic Algorithm and Hill Climbing Optimization for the Neural  Network",
    "abstract": "In this paper, we propose a hybrid model combining genetic algorithm and hill climbing algorithm for optimizing Convolutional Neural Networks (CNNs) on the CIFAR-100 dataset. The proposed model utilizes a population of chromosomes that represent the hyperparameters of the CNN model. The genetic algorithm is used for selecting and breeding the fittest chromosomes to generate new offspring. The hill climbing algorithm is then applied to the offspring to further optimize their hyperparameters. The mutation operation is introduced to diversify the population and to prevent the algorithm from getting stuck in local optima. The Genetic Algorithm is used for global search and exploration of the search space, while Hill Climbing is used for local optimization of promising solutions. The objective function is the accuracy of the trained neural network on the CIFAR-100 test set. The performance of the hybrid model is evaluated by comparing it with the standard genetic algorithm and hill-climbing algorithm. The experimental results demonstrate that the proposed hybrid model achieves better accuracy with fewer generations compared to the standard algorithms. Therefore, the proposed hybrid model can be a promising approach for optimizing CNN models on large datasets. ",
    "url": "https://arxiv.org/abs/2308.13099",
    "authors": [
      "Krutika Sarode",
      "Shashidhar Reddy Javaji"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2308.13116",
    "title": "Sentence Embedding Models for Ancient Greek Using Multilingual Knowledge  Distillation",
    "abstract": "Contextual language models have been trained on Classical languages, including Ancient Greek and Latin, for tasks such as lemmatization, morphological tagging, part of speech tagging, authorship attribution, and detection of scribal errors. However, high-quality sentence embedding models for these historical languages are significantly more difficult to achieve due to the lack of training data. In this work, we use a multilingual knowledge distillation approach to train BERT models to produce sentence embeddings for Ancient Greek text. The state-of-the-art sentence embedding approaches for high-resource languages use massive datasets, but our distillation approach allows our Ancient Greek models to inherit the properties of these models while using a relatively small amount of translated sentence data. We build a parallel sentence dataset using a sentence-embedding alignment method to align Ancient Greek documents with English translations, and use this dataset to train our models. We evaluate our models on translation search, semantic similarity, and semantic retrieval tasks and investigate translation bias. We make our training and evaluation datasets freely available at https://github.com/kevinkrahn/ancient-greek-datasets . ",
    "url": "https://arxiv.org/abs/2308.13116",
    "authors": [
      "Kevin Krahn",
      "Derrick Tate",
      "Andrew C. Lamicela"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.13155",
    "title": "Hybrid coupling rules for leaderless heterogeneous oscillators: uniform  global asymptotic and finite-time synchronization",
    "abstract": "We investigate the engineering scenario where the objective is to synchronize heterogeneous oscillators in a distributed fashion. The internal dynamics of each oscillator are general enough to capture their time-varying natural frequency as well as physical couplings and unknown bounded terms. A communication layer is set in place to allow the oscillators to exchange synchronizing coupling actions through a tree-like leaderless network. In particular, we present a class of hybrid coupling rules depending only on local information to ensure uniform global practical or asymptotic synchronization, which is impossible to obtain by using the Kuramoto model customarily used in the literature. We further show that the synchronization set can be made uniformly globally prescribed finite-time stable by selecting the coupling function to be discontinuous at the origin. Novel mathematical tools on non-pathological functions and set-valued Lie derivatives are developed to carry out the stability analysis. The effectiveness of the approach is illustrated in simulations where we apply our synchronizing hybrid coupling rules to models of power grids previously used in the literature. ",
    "url": "https://arxiv.org/abs/2308.13155",
    "authors": [
      "Simone Mariano",
      "Riccardo Bertollo",
      "Romain Postoyan",
      "Luca Zaccarian"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2308.13165",
    "title": "Dual Compensation Residual Networks for Class Imbalanced Learning",
    "abstract": "Learning generalizable representation and classifier for class-imbalanced data is challenging for data-driven deep models. Most studies attempt to re-balance the data distribution, which is prone to overfitting on tail classes and underfitting on head classes. In this work, we propose Dual Compensation Residual Networks to better fit both tail and head classes. Firstly, we propose dual Feature Compensation Module (FCM) and Logit Compensation Module (LCM) to alleviate the overfitting issue. The design of these two modules is based on the observation: an important factor causing overfitting is that there is severe feature drift between training and test data on tail classes. In details, the test features of a tail category tend to drift towards feature cloud of multiple similar head categories. So FCM estimates a multi-mode feature drift direction for each tail category and compensate for it. Furthermore, LCM translates the deterministic feature drift vector estimated by FCM along intra-class variations, so as to cover a larger effective compensation space, thereby better fitting the test features. Secondly, we propose a Residual Balanced Multi-Proxies Classifier (RBMC) to alleviate the under-fitting issue. Motivated by the observation that re-balancing strategy hinders the classifier from learning sufficient head knowledge and eventually causes underfitting, RBMC utilizes uniform learning with a residual path to facilitate classifier learning. Comprehensive experiments on Long-tailed and Class-Incremental benchmarks validate the efficacy of our method. ",
    "url": "https://arxiv.org/abs/2308.13165",
    "authors": [
      "Ruibing Hou",
      "Hong Chang",
      "Bingpeng Ma",
      "Shiguang Shan",
      "Xilin Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13177",
    "title": "How to Evaluate the Generalization of Detection? A Benchmark for  Comprehensive Open-Vocabulary Detection",
    "abstract": "Object detection (OD) in computer vision has made significant progress in recent years, transitioning from closed-set labels to open-vocabulary detection (OVD) based on large-scale vision-language pre-training (VLP). However, current evaluation methods and datasets are limited to testing generalization over object types and referral expressions, which do not provide a systematic, fine-grained, and accurate benchmark of OVD models' abilities. In this paper, we propose a new benchmark named OVDEval, which includes 9 sub-tasks and introduces evaluations on commonsense knowledge, attribute understanding, position understanding, object relation comprehension, and more. The dataset is meticulously created to provide hard negatives that challenge models' true understanding of visual and linguistic input. Additionally, we identify a problem with the popular Average Precision (AP) metric when benchmarking models on these fine-grained label datasets and propose a new metric called Non-Maximum Suppression Average Precision (NMS-AP) to address this issue. Extensive experimental results show that existing top OVD models all fail on the new tasks except for simple object types, demonstrating the value of the proposed dataset in pinpointing the weakness of current OVD models and guiding future research. Furthermore, the proposed NMS-AP metric is verified by experiments to provide a much more truthful evaluation of OVD models, whereas traditional AP metrics yield deceptive results. Data is available at \\url{https://github.com/om-ai-lab/OVDEval} ",
    "url": "https://arxiv.org/abs/2308.13177",
    "authors": [
      "Yiyang Yao",
      "Peng Liu",
      "Tiancheng Zhao",
      "Qianqian Zhang",
      "Jiajia Liao",
      "Chunxin Fang",
      "Kyusong Lee",
      "Qing Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.13178",
    "title": "Self-supervised Scene Text Segmentation with Object-centric Layered  Representations Augmented by Text Regions",
    "abstract": "Text segmentation tasks have a very wide range of application values, such as image editing, style transfer, watermark removal, etc.However, existing public datasets are of poor quality of pixel-level labels that have been shown to be notoriously costly to acquire, both in terms of money and time. At the same time, when pretraining is performed on synthetic datasets, the data distribution of the synthetic datasets is far from the data distribution in the real scene. These all pose a huge challenge to the current pixel-level text segmentation algorithms.To alleviate the above problems, we propose a self-supervised scene text segmentation algorithm with layered decoupling of representations derived from the object-centric manner to segment images into texts and background. In our method, we propose two novel designs which include Region Query Module and Representation Consistency Constraints adapting to the unique properties of text as complements to Auto Encoder, which improves the network's sensitivity to texts.For this unique design, we treat the polygon-level masks predicted by the text localization model as extra input information, and neither utilize any pixel-level mask annotations for training stage nor pretrain on synthetic datasets.Extensive experiments show the effectiveness of the method proposed. On several public scene text datasets, our method outperforms the state-of-the-art unsupervised segmentation algorithms. ",
    "url": "https://arxiv.org/abs/2308.13178",
    "authors": [
      "Yibo Wang",
      "Yunhu Ye",
      "Yuanpeng Mao",
      "Yanwei Yu",
      "Yuanping Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13183",
    "title": "STRIDE: Street View-based Environmental Feature Detection and Pedestrian  Collision Prediction",
    "abstract": "This paper introduces a novel benchmark to study the impact and relationship of built environment elements on pedestrian collision prediction, intending to enhance environmental awareness in autonomous driving systems to prevent pedestrian injuries actively. We introduce a built environment detection task in large-scale panoramic images and a detection-based pedestrian collision frequency prediction task. We propose a baseline method that incorporates a collision prediction module into a state-of-the-art detection model to tackle both tasks simultaneously. Our experiments demonstrate a significant correlation between object detection of built environment elements and pedestrian collision frequency prediction. Our results are a stepping stone towards understanding the interdependencies between built environment conditions and pedestrian safety. ",
    "url": "https://arxiv.org/abs/2308.13183",
    "authors": [
      "Cristina González",
      "Nicolás Ayobi",
      "Felipe Escallón",
      "Laura Baldovino-Chiquillo",
      "Maria Wilches-Mogollón",
      "Donny Pasos",
      "Nicole Ramírez",
      "Jose Pinzón",
      "Olga Sarmiento",
      "D Alex Quistberg",
      "Pablo Arbeláez"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13187",
    "title": "MMBAttn: Max-Mean and Bit-wise Attention for CTR Prediction",
    "abstract": "With the increasing complexity and scale of click-through rate (CTR) prediction tasks in online advertising and recommendation systems, accurately estimating the importance of features has become a critical aspect of developing effective models. In this paper, we propose an attention-based approach that leverages max and mean pooling operations, along with a bit-wise attention mechanism, to enhance feature importance estimation in CTR prediction. Traditionally, pooling operations such as max and mean pooling have been widely used to extract relevant information from features. However, these operations can lead to information loss and hinder the accurate determination of feature importance. To address this challenge, we propose a novel attention architecture that utilizes a bit-based attention structure that emphasizes the relationships between all bits in features, together with maximum and mean pooling. By considering the fine-grained interactions at the bit level, our method aims to capture intricate patterns and dependencies that might be overlooked by traditional pooling operations. To examine the effectiveness of the proposed method, experiments have been conducted on three public datasets. The experiments demonstrated that the proposed method significantly improves the performance of the base models to achieve state-of-the-art results. ",
    "url": "https://arxiv.org/abs/2308.13187",
    "authors": [
      "Hasan Saribas",
      "Cagri Yesil",
      "Serdarcan Dilbaz",
      "Halit Orenbas"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2308.13189",
    "title": "Falcon: Accelerating Homomorphically Encrypted Convolutions for  Efficient Private Mobile Network Inference",
    "abstract": "Efficient networks, e.g., MobileNetV2, EfficientNet, etc, achieves state-of-the-art (SOTA) accuracy with lightweight computation. However, existing homomorphic encryption (HE)-based two-party computation (2PC) frameworks are not optimized for these networks and suffer from a high inference overhead. We observe the inefficiency mainly comes from the packing algorithm, which ignores the computation characteristics and the communication bottleneck of homomorphically encrypted depthwise convolutions. Therefore, in this paper, we propose Falcon, an effective dense packing algorithm for HE-based 2PC frameworks. Falcon features a zero-aware greedy packing algorithm and a communication-aware operator tiling strategy to improve the packing density for depthwise convolutions. Compared to SOTA HE-based 2PC frameworks, e.g., CrypTFlow2, Iron and Cheetah, Falcon achieves more than 15.6x, 5.1x and 1.8x latency reduction, respectively, at operator level. Meanwhile, at network level, Falcon allows for 1.4% and 4.2% accuracy improvement over Cheetah on CIFAR-100 and TinyImagenet datasets with iso-communication, respecitvely. ",
    "url": "https://arxiv.org/abs/2308.13189",
    "authors": [
      "Tianshi Xu",
      "Meng Li",
      "Runsheng Wang",
      "Ru Huang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.13204",
    "title": "Self-supervised learning for hotspot detection and isolation from  thermal images",
    "abstract": "Hotspot detection using thermal imaging has recently become essential in several industrial applications, such as security applications, health applications, and equipment monitoring applications. Hotspot detection is of utmost importance in industrial safety where equipment can develop anomalies. Hotspots are early indicators of such anomalies. We address the problem of hotspot detection in thermal images by proposing a self-supervised learning approach. Self-supervised learning has shown potential as a competitive alternative to their supervised learning counterparts but their application to thermography has been limited. This has been due to lack of diverse data availability, domain specific pre-trained models, standardized benchmarks, etc. We propose a self-supervised representation learning approach followed by fine-tuning that improves detection of hotspots by classification. The SimSiam network based ensemble classifier decides whether an image contains hotspots or not. Detection of hotspots is followed by precise hotspot isolation. By doing so, we are able to provide a highly accurate and precise hotspot identification, applicable to a wide range of applications. We created a novel large thermal image dataset to address the issue of paucity of easily accessible thermal images. Our experiments with the dataset created by us and a publicly available segmentation dataset show the potential of our approach for hotspot detection and its ability to isolate hotspots with high accuracy. We achieve a Dice Coefficient of 0.736, the highest when compared with existing hotspot identification techniques. Our experiments also show self-supervised learning as a strong contender of supervised learning, providing competitive metrics for hotspot detection, with the highest accuracy of our approach being 97%. ",
    "url": "https://arxiv.org/abs/2308.13204",
    "authors": [
      "Shreyas Goyal",
      "Jagath C. Rajapakse"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13212",
    "title": "Physics-Inspired Neural Graph ODE for Long-term Dynamical Simulation",
    "abstract": "Simulating and modeling the long-term dynamics of multi-object physical systems is an essential and challenging task. Current studies model the physical systems utilizing Graph Neural Networks (GNNs) with equivariant properties. Specifically, they model the dynamics as a sequence of discrete states with a fixed time interval and learn a direct mapping for all the two adjacent states. However, this direct mapping overlooks the continuous nature between the two states. Namely, we have verified that there are countless possible trajectories between two discrete dynamic states in current GNN-based direct mapping models. This issue greatly hinders the model generalization ability, leading to poor performance of the long-term simulation. In this paper, to better model the latent trajectory through discrete supervision signals, we propose a Physics-Inspired Neural Graph ODE (PINGO) algorithm. In PINGO, to ensure the uniqueness of the trajectory, we construct a Physics-Inspired Neural ODE framework to update the latent trajectory. Meanwhile, to effectively capture intricate interactions among objects, we use a GNN-based model to parameterize Neural ODE in a plug-and-play manner. Furthermore, we prove that the discrepancy between the learned trajectory of PIGNO and the true trajectory can be theoretically bounded. Extensive experiments verify our theoretical findings and demonstrate that our model yields an order-of-magnitude improvement over the state-of-the-art baselines, especially on long-term predictions and roll-out errors. ",
    "url": "https://arxiv.org/abs/2308.13212",
    "authors": [
      "Yang Liu",
      "Jiashun Cheng",
      "Haihong Zhao",
      "Tingyang Xu",
      "Peilin Zhao",
      "Fugee Tsung",
      "Jia Li",
      "Yu Rong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.13215",
    "title": "Predictive Network Configuration with Hierarchical Spectral Clustering  for Software Defined Vehicles",
    "abstract": "The increasing connectivity and autonomy of vehicles has led to a growing need for dynamic and real-time adjustments to software and network configurations. Software Defined Vehicles (SDV) have emerged as a potential solution to adapt to changing user needs with continuous updates and onboard reconfigurations to offer infotainment, connected, and background services such as cooperative driving. However, network configuration management in SDVs remains a significant challenge, particularly in the context of shared Ethernet-based in-vehicle networks. Traditional worst-case static configuration methods cannot efficiently allocate network resources while ensuring Quality of Service (QoS) guarantees for each network flow within the physical topology capabilities. In this work, we propose a configuration generation methodology that addresses these limitations by dynamically switching between pre-computed offboard configurations downloaded to the vehicle. Simulation results are presented and future work is discussed. ",
    "url": "https://arxiv.org/abs/2308.13215",
    "authors": [
      "Pierre Laclau",
      "Stéphane Bonnet",
      "Bertrand Ducourthial",
      "Xiaoting Li",
      "Trista Lin"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2308.13223",
    "title": "EfficientDreamer: High-Fidelity and Robust 3D Creation via  Orthogonal-view Diffusion Prior",
    "abstract": "While the image diffusion model has made significant strides in text-driven 3D content creation, it often falls short in accurately capturing the intended meaning of the text prompt, particularly with respect to direction information. This shortcoming gives rise to the Janus problem, where multi-faced 3D models are produced with the guidance of such diffusion models. In this paper, we present a robust pipeline for generating high-fidelity 3D content with orthogonal-view image guidance. Specifically, we introduce a novel 2D diffusion model that generates an image consisting of four orthogonal-view sub-images for the given text prompt. The 3D content is then created with this diffusion model, which enhances 3D consistency and provides strong structured semantic priors. This addresses the infamous Janus problem and significantly promotes generation efficiency. Additionally, we employ a progressive 3D synthesis strategy that results in substantial improvement in the quality of the created 3D contents. Both quantitative and qualitative evaluations show that our method demonstrates a significant improvement over previous text-to-3D techniques. ",
    "url": "https://arxiv.org/abs/2308.13223",
    "authors": [
      "Minda Zhao",
      "Chaoyi Zhao",
      "Xinyue Liang",
      "Lincheng Li",
      "Zeng Zhao",
      "Zhipeng Hu",
      "Changjie Fan",
      "Xin Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13229",
    "title": "ReST: A Reconfigurable Spatial-Temporal Graph Model for Multi-Camera  Multi-Object Tracking",
    "abstract": "Multi-Camera Multi-Object Tracking (MC-MOT) utilizes information from multiple views to better handle problems with occlusion and crowded scenes. Recently, the use of graph-based approaches to solve tracking problems has become very popular. However, many current graph-based methods do not effectively utilize information regarding spatial and temporal consistency. Instead, they rely on single-camera trackers as input, which are prone to fragmentation and ID switch errors. In this paper, we propose a novel reconfigurable graph model that first associates all detected objects across cameras spatially before reconfiguring it into a temporal graph for Temporal Association. This two-stage association approach enables us to extract robust spatial and temporal-aware features and address the problem with fragmented tracklets. Furthermore, our model is designed for online tracking, making it suitable for real-world applications. Experimental results show that the proposed graph model is able to extract more discriminating features for object tracking, and our model achieves state-of-the-art performance on several public datasets. ",
    "url": "https://arxiv.org/abs/2308.13229",
    "authors": [
      "Cheng-Che Cheng",
      "Min-Xuan Qiu",
      "Chen-Kuo Chiang",
      "Shang-Hong Lai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13244",
    "title": "Significant-attributed Community Search in Heterogeneous Information  Networks",
    "abstract": "Community search is a personalized community discovery problem aimed at finding densely-connected subgraphs containing the query vertex. In particular, the search for communities with high-importance vertices has recently received a great deal of attention. However, existing works mainly focus on conventional homogeneous networks where vertices are of the same type, but are not applicable to heterogeneous information networks (HINs) composed of multi-typed vertices and different semantic relations, such as bibliographic networks. In this paper, we study the problem of high-importance community search in HINs. A novel community model is introduced, named heterogeneous significant community (HSC), to unravel the closely connected vertices of the same type with high attribute values through multiple semantic relationships. An HSC not only maximizes the exploration of indirect relationships across entities of the anchor-type but incorporates their significance. To search the HSCs, we first develop online algorithms by exploiting both segmented-based meta-path expansion and significance increment. Specially, a solution space reuse strategy based on structural nesting is designed to boost the efficiency. In addition, we further devise a two-level index to support searching HSCs in optimal time, based on which a space-efficient compact index is proposed. Extensive experiments on real-world large-scale HINs demonstrate that our solutions are effective and efficient for searching HSCs, and the index-based algorithms are 2-4 orders of magnitude faster than online algorithms. ",
    "url": "https://arxiv.org/abs/2308.13244",
    "authors": [
      "Yanghao Liu",
      "Fangda Guo",
      "Bingbing Xu",
      "Peng Bao",
      "Huawei Shen",
      "Xueqi Cheng"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2308.13252",
    "title": "Kissing to Find a Match: Efficient Low-Rank Permutation Representation",
    "abstract": "Permutation matrices play a key role in matching and assignment problems across the fields, especially in computer vision and robotics. However, memory for explicitly representing permutation matrices grows quadratically with the size of the problem, prohibiting large problem instances. In this work, we propose to tackle the curse of dimensionality of large permutation matrices by approximating them using low-rank matrix factorization, followed by a nonlinearity. To this end, we rely on the Kissing number theory to infer the minimal rank required for representing a permutation matrix of a given size, which is significantly smaller than the problem size. This leads to a drastic reduction in computation and memory costs, e.g., up to $3$ orders of magnitude less memory for a problem of size $n=20000$, represented using $8.4\\times10^5$ elements in two small matrices instead of using a single huge matrix with $4\\times 10^8$ elements. The proposed representation allows for accurate representations of large permutation matrices, which in turn enables handling large problems that would have been infeasible otherwise. We demonstrate the applicability and merits of the proposed approach through a series of experiments on a range of problems that involve predicting permutation matrices, from linear and quadratic assignment to shape matching problems. ",
    "url": "https://arxiv.org/abs/2308.13252",
    "authors": [
      "Hannah Dröge",
      "Zorah Lähner",
      "Yuval Bahat",
      "Onofre Martorell",
      "Felix Heide",
      "Michael Möller"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13260",
    "title": "Approximation Algorithms to Enhance Social Sharing of Fresh  Point-of-Interest Information",
    "abstract": "In location-based social networks (LBSNs), such as Gowalla and Waze, users sense urban point-of-interest (PoI) information (e.g., restaurants' queue length and real-time traffic conditions) in the vicinity and share such information with friends in online social networks. Given each user's social connections and the severe lags in disseminating fresh PoI to all users, major LBSNs aim to enhance users' social PoI sharing by selecting a subset $k$ out of all $m$ users as hotspots and broadcasting their PoI information to the entire user community. This motivates us to study a new combinatorial optimization problem by integrating two urban sensing and online social networks. We prove that this problem is NP-hard and also renders existing approximation solutions not viable. Through analyzing the interplay effects between the sensing and social networks, we successfully transform the involved PoI-sharing process across two networks to matrix computations for deriving a closed-form objective and present a polynomial-time algorithm to ensure ($1-\\frac{m-2}{m}(\\frac{k-1}{k})^k$) approximation of the optimum. Furthermore, we allow each selected user to move around and sense more PoI information to share. To this end, we propose an augmentation-adaptive algorithm, which benefits from a resource-augmented technique and achieves bounded approximation, ranging from $\\frac{1}{k}(1-\\frac{1}{e})$ to $1-\\frac{1}{e}> 0.632$ by adjusting our augmentation factors. %Particularly when all sensing nodes are associated with users, we devise, by leveraging our augmentation-adaptive algorithm as a subroutine, an algorithm that eliminates the need for augmentation while still ensuring a satisfactory approximation $1-\\frac{m-2}{m}(\\frac{k-1}{k})^k$. Finally, our theoretical results are corroborated by our simulation findings using both synthetic and real-world datasets. ",
    "url": "https://arxiv.org/abs/2308.13260",
    "authors": [
      "Songhua Li",
      "Lingjie Duan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2308.13265",
    "title": "Heterogeneous Federated Learning via Personalized Generative Networks",
    "abstract": "Federated Learning (FL) allows several clients to construct a common global machine-learning model without having to share their data. FL, however, faces the challenge of statistical heterogeneity between the client's data, which degrades performance and slows down the convergence toward the global model. In this paper, we provide theoretical proof that minimizing heterogeneity between clients facilitates the convergence of a global model for every single client. This becomes particularly important under empirical concept shifts among clients, rather than merely considering imbalanced classes, which have been studied until now. Therefore, we propose a method for knowledge transfer between clients where the server trains client-specific generators. Each generator generates samples for the corresponding client to remove the conflict with other clients' models. Experiments conducted on synthetic and real data, along with a theoretical study, support the effectiveness of our method in constructing a well-generalizable global model by reducing the conflict between local models. ",
    "url": "https://arxiv.org/abs/2308.13265",
    "authors": [
      "Zahra Taghiyarrenani",
      "Abdallah Abdallah",
      "Slawomir Nowaczyk",
      "Sepideh Pashami"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.13269",
    "title": "Heterogeneous Decentralized Machine Unlearning with Seed Model  Distillation",
    "abstract": "As some recent information security legislation endowed users with unconditional rights to be forgotten by any trained machine learning model, personalized IoT service providers have to put unlearning functionality into their consideration. The most straightforward method to unlearn users' contribution is to retrain the model from the initial state, which is not realistic in high throughput applications with frequent unlearning requests. Though some machine unlearning frameworks have been proposed to speed up the retraining process, they fail to match decentralized learning scenarios. In this paper, we design a decentralized unlearning framework called HDUS, which uses distilled seed models to construct erasable ensembles for all clients. Moreover, the framework is compatible with heterogeneous on-device models, representing stronger scalability in real-world applications. Extensive experiments on three real-world datasets show that our HDUS achieves state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2308.13269",
    "authors": [
      "Guanhua Ye",
      "Guanhua Ye",
      "Quoc Viet Hung Nguyen",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.13273",
    "title": "Bridging the Gap: Fine-to-Coarse Sketch Interpolation Network for  High-Quality Animation Sketch Inbetweening",
    "abstract": "The 2D animation workflow is typically initiated with the creation of keyframes using sketch-based drawing. Subsequent inbetweens (i.e., intermediate sketch frames) are crafted through manual interpolation for smooth animations, which is a labor-intensive process. Thus, the prospect of automatic animation sketch interpolation has become highly appealing. However, existing video interpolation methods are generally hindered by two key issues for sketch inbetweening: 1) limited texture and colour details in sketches, and 2) exaggerated alterations between two sketch keyframes. To overcome these issues, we propose a novel deep learning method, namely Fine-to-Coarse Sketch Interpolation Network (FC-SIN). This approach incorporates multi-level guidance that formulates region-level correspondence, sketch-level correspondence and pixel-level dynamics. A multi-stream U-Transformer is then devised to characterize sketch inbewteening patterns using these multi-level guides through the integration of both self-attention and cross-attention mechanisms. Additionally, to facilitate future research on animation sketch inbetweening, we constructed a large-scale dataset - STD-12K, comprising 30 sketch animation series in diverse artistic styles. Comprehensive experiments on this dataset convincingly show that our proposed FC-SIN surpasses the state-of-the-art interpolation methods. Our code and dataset will be publicly available. ",
    "url": "https://arxiv.org/abs/2308.13273",
    "authors": [
      "Jiaming Shen",
      "Kun Hu",
      "Wei Bao",
      "Chang Wen Chen",
      "Zhiyong Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2308.13276",
    "title": "Knowledge-Based Version Incompatibility Detection for Deep Learning",
    "abstract": "Version incompatibility issues are rampant when reusing or reproducing deep learning models and applications. Existing techniques are limited to library dependency specifications declared in PyPI. Therefore, these techniques cannot detect version issues due to undocumented version constraints or issues involving hardware drivers or OS. To address this challenge, we propose to leverage the abundant discussions of DL version issues from Stack Overflow to facilitate version incompatibility detection. We reformulate the problem of knowledge extraction as a Question-Answering (QA) problem and use a pre-trained QA model to extract version compatibility knowledge from online discussions. The extracted knowledge is further consolidated into a weighted knowledge graph to detect potential version incompatibilities when reusing a DL project. Our evaluation results show that (1) our approach can accurately extract version knowledge with 84% accuracy, and (2) our approach can accurately identify 65% of known version issues in 10 popular DL projects with a high precision (92%), while two state-of-the-art approaches can only detect 29% and 6% of these issues with 33% and 17% precision respectively. ",
    "url": "https://arxiv.org/abs/2308.13276",
    "authors": [
      "Zhongkai Zhao",
      "Bonan Kou",
      "Mohamed Yilmaz Ibrahim",
      "Muhao Chen",
      "Tianyi Zhang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.13286",
    "title": "Unsupervised Domain Adaptation for Anatomical Landmark Detection",
    "abstract": "Recently, anatomical landmark detection has achieved great progresses on single-domain data, which usually assumes training and test sets are from the same domain. However, such an assumption is not always true in practice, which can cause significant performance drop due to domain shift. To tackle this problem, we propose a novel framework for anatomical landmark detection under the setting of unsupervised domain adaptation (UDA), which aims to transfer the knowledge from labeled source domain to unlabeled target domain. The framework leverages self-training and domain adversarial learning to address the domain gap during adaptation. Specifically, a self-training strategy is proposed to select reliable landmark-level pseudo-labels of target domain data with dynamic thresholds, which makes the adaptation more effective. Furthermore, a domain adversarial learning module is designed to handle the unaligned data distributions of two domains by learning domain-invariant features via adversarial training. Our experiments on cephalometric and lung landmark detection show the effectiveness of the method, which reduces the domain gap by a large margin and outperforms other UDA methods consistently. The code is available at https://github.com/jhb86253817/UDA_Med_Landmark. ",
    "url": "https://arxiv.org/abs/2308.13286",
    "authors": [
      "Haibo Jin",
      "Haoxuan Che",
      "Hao Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13296",
    "title": "Gender Gaps in Online Social Connectivity, Promotion and Relocation  Reports on LinkedIn",
    "abstract": "Online professional social networking platforms provide opportunities to expand networks strategically for job opportunities and career advancement. A large body of research shows that women's offline networks are less advantageous than men's. How online platforms such as LinkedIn may reflect or reproduce gendered networking behaviours, or how online social connectivity may affect outcomes differentially by gender is not well understood. This paper analyses aggregate, anonymised data from almost 10 million LinkedIn users in the UK and US information technology (IT) sector collected from the site's advertising platform to explore how being connected to Big Tech companies ('social connectivity') varies by gender, and how gender, age, seniority and social connectivity shape the propensity to report job promotions or relocations. Consistent with previous studies, we find there are fewer women compared to men on LinkedIn in IT. Furthermore, female users are less likely to be connected to Big Tech companies than men. However, when we further analyse recent promotion or relocation reports, we find women are more likely than men to have reported a recent promotion at work, suggesting high-achieving women may be self-selecting onto LinkedIn. Even among this positively selected group, though, we find men are more likely to report a recent relocation. Social connectivity emerges as a significant predictor of promotion and relocation reports, with an interaction effect between gender and social connectivity indicating the payoffs to social connectivity for promotion and relocation reports are larger for women. This suggests that online networking has the potential for larger impacts for women, who experience greater disadvantage in traditional networking contexts, and calls for further research to understand differential impacts of online networking for socially disadvantaged groups. ",
    "url": "https://arxiv.org/abs/2308.13296",
    "authors": [
      "Ghazal Kalhor",
      "Hannah Gardner",
      "Ingmar Weber",
      "Ridhi Kashyap"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2308.13300",
    "title": "Learning Compact Neural Networks with Deep Overparameterised Multitask  Learning",
    "abstract": "Compact neural network offers many benefits for real-world applications. However, it is usually challenging to train the compact neural networks with small parameter sizes and low computational costs to achieve the same or better model performance compared to more complex and powerful architecture. This is particularly true for multitask learning, with different tasks competing for resources. We present a simple, efficient and effective multitask learning overparameterisation neural network design by overparameterising the model architecture in training and sharing the overparameterised model parameters more effectively across tasks, for better optimisation and generalisation. Experiments on two challenging multitask datasets (NYUv2 and COCO) demonstrate the effectiveness of the proposed method across various convolutional networks and parameter sizes. ",
    "url": "https://arxiv.org/abs/2308.13300",
    "authors": [
      "Shen Ren",
      "Haosen Shi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13301",
    "title": "On Incentivizing Social Information Sharing in Routing Games",
    "abstract": "We study a new incentive problem of social information sharing for location-based services (e.g., Waze and Yelp). The problem aims to crowdsource a mass of mobile users to learn massive point-of-interest (PoI) information while traveling and share it with each other as a public good. Given that crowdsourced users mind their own travel costs and possess various preferences over the PoI information along different paths, we formulate the problem as a non-atomic routing game with positive network externalities. We first show by price of anarchy (PoA) analysis that, in the absence of any incentive design, users' selfish routing on the path with the lowest cost will limit information diversity and lead to an arbitrarily large efficiency loss from the social optimum. This motivates us to explore effective incentive mechanisms to remedy while upholding individual rationality, incentive compatibility, and budget balance to ensure practical feasibility. We start by presenting an adaptive information restriction (AIR) mechanism that dynamically customizes restriction fractions, depending on the real user flows along different paths, to govern users' access to the shared PoI aggregation. We show that AIR achieves a PoA of 0.25 for homogeneous users (of identical PoI preferences over paths) and 0.125 for heterogeneous users in a typical network of two parallel paths. Further, we propose a side-payment mechanism (ASP) that adaptively charges or rewards users along certain paths. With those charges and rewards well-tailored, ASP significantly improves the PoA to 1 (optimal) and 0.5 for homogeneous and heterogeneous users in the two-path network, respectively. For a generalized network of multiple parallel paths, we further advance ASP to be able to guarantee a PoA of 0.5. Additionally, our theoretical results are well corroborated by our numerical findings. ",
    "url": "https://arxiv.org/abs/2308.13301",
    "authors": [
      "Songhua Li",
      "Lingjie Duan"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2308.13303",
    "title": "Age of Information Diffusion on Social Networks: Optimizing Multi-Stage  Seeding Strategies",
    "abstract": "To promote viral marketing, major social platforms (e.g., Facebook Marketplace and Pinduoduo) repeatedly select and invite different users (as seeds) in online social networks to share fresh information about a product or service with their friends. Thereby, we are motivated to optimize a multi-stage seeding process of viral marketing in social networks and adopt the recent notions of the peak and the average age of information (AoI) to measure the timeliness of promotion information received by network users. Our problem is different from the literature on information diffusion in social networks, which limits to one-time seeding and overlooks AoI dynamics or information replacement over time. As a critical step, we manage to develop closed-form expressions that characterize and trace AoI dynamics over any social network. For the peak AoI problem, we first prove the NP-hardness of our multi-stage seeding problem by a highly non-straightforward reduction from the dominating set problem, and then present a new polynomial-time algorithm that achieves good approximation guarantees (e.g., less than 2 for linear network topology). To minimize the average AoI, we also prove that our problem is NP-hard by properly reducing it from the set cover problem. Benefiting from our two-side bound analysis on the average AoI objective, we build up a new framework for approximation analysis and link our problem to a much simplified sum-distance minimization problem. This intriguing connection inspires us to develop another polynomial-time algorithm that achieves a good approximation guarantee. Additionally, our theoretical results are well corroborated by experiments on a real social network. ",
    "url": "https://arxiv.org/abs/2308.13303",
    "authors": [
      "Songhua Li",
      "Lingjie Duan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Discrete Mathematics (cs.DM)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2308.13319",
    "title": "COCO: Testing Code Generation Systems via Concretized Instructions",
    "abstract": "Code generation systems have been extensively developed in recent years to generate source code based on natural language instructions. However, despite their advancements, these systems still face robustness issues where even slightly different instructions can result in significantly different code semantics. Robustness is critical for code generation systems, as it can have significant impacts on software development, software quality, and trust in the generated code. Although existing testing techniques for general text-to-text software can detect some robustness issues, they are limited in effectiveness due to ignoring the characteristics of code generation systems. In this work, we propose a novel technique COCO to test the robustness of code generation systems. It exploits the usage scenario of code generation systems to make the original programming instruction more concrete by incorporating features known to be contained in the original code. A robust system should maintain code semantics for the concretized instruction, and COCO detects robustness inconsistencies when it does not. We evaluated COCO on eight advanced code generation systems, including commercial tools such as Copilot and ChatGPT, using two widely-used datasets. Our results demonstrate the effectiveness of COCO in testing the robustness of code generation systems, outperforming two techniques adopted from general text-to-text software testing by 466.66% and 104.02%, respectively. Furthermore, concretized instructions generated by COCO can help reduce robustness inconsistencies by 18.35% to 53.91% through fine-tuning. ",
    "url": "https://arxiv.org/abs/2308.13319",
    "authors": [
      "Ming Yan",
      "Junjie Chen",
      "Jie M. Zhang",
      "Xuejie Cao",
      "Chen Yang",
      "Mark Harman"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.13323",
    "title": "SVQNet: Sparse Voxel-Adjacent Query Network for 4D Spatio-Temporal LiDAR  Semantic Segmentation",
    "abstract": "LiDAR-based semantic perception tasks are critical yet challenging for autonomous driving. Due to the motion of objects and static/dynamic occlusion, temporal information plays an essential role in reinforcing perception by enhancing and completing single-frame knowledge. Previous approaches either directly stack historical frames to the current frame or build a 4D spatio-temporal neighborhood using KNN, which duplicates computation and hinders realtime performance. Based on our observation that stacking all the historical points would damage performance due to a large amount of redundant and misleading information, we propose the Sparse Voxel-Adjacent Query Network (SVQNet) for 4D LiDAR semantic segmentation. To take full advantage of the historical frames high-efficiently, we shunt the historical points into two groups with reference to the current points. One is the Voxel-Adjacent Neighborhood carrying local enhancing knowledge. The other is the Historical Context completing the global knowledge. Then we propose new modules to select and extract the instructive features from the two groups. Our SVQNet achieves state-of-the-art performance in LiDAR semantic segmentation of the SemanticKITTI benchmark and the nuScenes dataset. ",
    "url": "https://arxiv.org/abs/2308.13323",
    "authors": [
      "Xuechao Chen",
      "Shuangjie Xu",
      "Xiaoyi Zou",
      "Tongyi Cao",
      "Dit-Yan Yeung",
      "Lu Fang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2308.13340",
    "title": "TriGait: Aligning and Fusing Skeleton and Silhouette Gait Data via a  Tri-Branch Network",
    "abstract": "Gait recognition is a promising biometric technology for identification due to its non-invasiveness and long-distance. However, external variations such as clothing changes and viewpoint differences pose significant challenges to gait recognition. Silhouette-based methods preserve body shape but neglect internal structure information, while skeleton-based methods preserve structure information but omit appearance. To fully exploit the complementary nature of the two modalities, a novel triple branch gait recognition framework, TriGait, is proposed in this paper. It effectively integrates features from the skeleton and silhouette data in a hybrid fusion manner, including a two-stream network to extract static and motion features from appearance, a simple yet effective module named JSA-TC to capture dependencies between all joints, and a third branch for cross-modal learning by aligning and fusing low-level features of two modalities. Experimental results demonstrate the superiority and effectiveness of TriGait for gait recognition. The proposed method achieves a mean rank-1 accuracy of 96.0% over all conditions on CASIA-B dataset and 94.3% accuracy for CL, significantly outperforming all the state-of-the-art methods. The source code will be available at https://github.com/feng-xueling/TriGait/. ",
    "url": "https://arxiv.org/abs/2308.13340",
    "authors": [
      "Yan Sun",
      "Xueling Feng",
      "Liyan Ma",
      "Long Hu",
      "Mark Nixon"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13343",
    "title": "Squeeze aggregated excitation network",
    "abstract": "Convolutional neural networks have spatial representations which read patterns in the vision tasks. Squeeze and excitation links the channel wise representations by explicitly modeling on channel level. Multi layer perceptrons learn global representations and in most of the models it is used often at the end after all convolutional layers to gather all the information learned before classification. We propose a method of inducing the global representations within channels to have better performance of the model. We propose SaEnet, Squeeze aggregated excitation network, for learning global channelwise representation in between layers. The proposed module takes advantage of passing important information after squeeze by having aggregated excitation before regaining its shape. We also introduce a new idea of having a multibranch linear(dense) layer in the network. This learns global representations from the condensed information which enhances the representational power of the network. The proposed module have undergone extensive experiments by using Imagenet and CIFAR100 datasets and compared with closely related architectures. The analyzes results that proposed models outputs are comparable and in some cases better than existing state of the art architectures. ",
    "url": "https://arxiv.org/abs/2308.13343",
    "authors": [
      "Mahendran N"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.13352",
    "title": "A Generic Machine Learning Framework for Fully-Unsupervised Anomaly  Detection with Contaminated Data",
    "abstract": "Anomaly detection (AD) tasks have been solved using machine learning algorithms in various domains and applications. The great majority of these algorithms use normal data to train a residual-based model, and assign anomaly scores to unseen samples based on their dissimilarity with the learned normal regime. The underlying assumption of these approaches is that anomaly-free data is available for training. This is, however, often not the case in real-world operational settings, where the training data may be contaminated with a certain fraction of abnormal samples. Training with contaminated data, in turn, inevitably leads to a deteriorated AD performance of the residual-based algorithms. In this paper we introduce a framework for a fully unsupervised refinement of contaminated training data for AD tasks. The framework is generic and can be applied to any residual-based machine learning model. We demonstrate the application of the framework to two public datasets of multivariate time series machine data from different application fields. We show its clear superiority over the naive approach of training with contaminated data without refinement. Moreover, we compare it to the ideal, unrealistic reference in which anomaly-free data would be available for training. Since the approach exploits information from the anomalies, and not only from the normal regime, it is comparable and often outperforms the ideal baseline as well. ",
    "url": "https://arxiv.org/abs/2308.13352",
    "authors": [
      "Markus Ulmer",
      "Jannik Zgraggen",
      "Lilach Goren Huber"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.13367",
    "title": "Burnt area extraction from high-resolution satellite images based on  anomaly detection",
    "abstract": "Wildfire detection using satellite images is a widely studied task in remote sensing with many applications to fire delineation and mapping. Recently, deep learning methods have become a scalable solution to automate this task, especially in the field of unsupervised learning where no training data is available. This is particularly important in the context of emergency risk monitoring where fast and effective detection is needed, generally based on high-resolution satellite data. Among various approaches, Anomaly Detection (AD) appears to be highly potential thanks to its broad applications in computer vision, medical imaging, as well as remote sensing. In this work, we build upon the framework of Vector Quantized Variational Autoencoder (VQ-VAE), a popular reconstruction-based AD method with discrete latent spaces, to perform unsupervised burnt area extraction. We integrate VQ-VAE into an end-to-end framework with an intensive post-processing step using dedicated vegetation, water and brightness indexes. Our experiments conducted on high-resolution SPOT-6/7 images provide promising results of the proposed technique, showing its high potential in future research on unsupervised burnt area extraction. ",
    "url": "https://arxiv.org/abs/2308.13367",
    "authors": [
      "Oscar David Rafael Narvaez Luces",
      "Minh-Tan Pham",
      "Quentin Poterek",
      "Rémi Braun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2308.13373",
    "title": "Enhanced Mortality Prediction In Patients With Subarachnoid Haemorrhage  Using A Deep Learning Model Based On The Initial CT Scan",
    "abstract": "PURPOSE: Subarachnoid hemorrhage (SAH) entails high morbidity and mortality rates. Convolutional neural networks (CNN), a form of deep learning, are capable of generating highly accurate predictions from imaging data. Our objective was to predict mortality in SAH patients by processing the initial CT scan on a CNN based algorithm. METHODS: Retrospective multicentric study of a consecutive cohort of patients with SAH between 2011-2022. Demographic, clinical and radiological variables were analyzed. Pre-processed baseline CT scan images were used as the input for training a CNN using AUCMEDI Framework. Our model's architecture leverages the DenseNet-121 structure, employing transfer learning principles. The output variable was mortality in the first three months. Performance of the model was evaluated by statistical parameters conventionally used in studies involving artificial intelligence methods. RESULTS: Images from 219 patients were processed, 175 for training and validation of the CNN and 44 for its evaluation. 52%(115/219) of patients were female, and the median age was 58(SD=13.06) years. 18.5%(39/219) were idiopathic SAH. Mortality rate was 28.5%(63/219). The model showed good accuracy at predicting mortality in SAH patients exclusively using the images of the initial CT scan (Accuracy=74%, F1=75% and AUC=82%). CONCLUSION: Modern image processing techniques based on AI and CNN make possible to predict mortality in SAH patients with high accuracy using CT scan images as the only input. These models might be optimized by including more data and patients resulting in better training, development and performance on tasks which are beyond the skills of conventional clinical knowledge. ",
    "url": "https://arxiv.org/abs/2308.13373",
    "authors": [
      "Sergio Garcia-Garcia",
      "Santiago Cepeda",
      "Dominik Muller",
      "Alejandra Mosteiro",
      "Ramon Torne",
      "Silvia Agudo",
      "Natalia de la Torre",
      "Ignacio Arrese",
      "Rosario Sarabia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.13386",
    "title": "TFDNet: Time-Frequency Enhanced Decomposed Network for Long-term Time  Series Forecasting",
    "abstract": "Long-term time series forecasting is a vital task and has a wide range of real applications. Recent methods focus on capturing the underlying patterns from one single domain (e.g. the time domain or the frequency domain), and have not taken a holistic view to process long-term time series from the time-frequency domains. In this paper, we propose a Time-Frequency Enhanced Decomposed Network (TFDNet) to capture both the long-term underlying patterns and temporal periodicity from the time-frequency domain. In TFDNet, we devise a multi-scale time-frequency enhanced encoder backbone and develop two separate trend and seasonal time-frequency blocks to capture the distinct patterns within the decomposed trend and seasonal components in multi-resolutions. Diverse kernel learning strategies of the kernel operations in time-frequency blocks have been explored, by investigating and incorporating the potential different channel-wise correlation patterns of multivariate time series. Experimental evaluation of eight datasets from five benchmark domains demonstrated that TFDNet is superior to state-of-the-art approaches in both effectiveness and efficiency. ",
    "url": "https://arxiv.org/abs/2308.13386",
    "authors": [
      "Yuxiao Luo",
      "Ziyu Lyu",
      "Xingyu Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.13392",
    "title": "Self-Supervised Representation Learning with Cross-Context Learning  between Global and Hypercolumn Features",
    "abstract": "Whilst contrastive learning yields powerful representations by matching different augmented views of the same instance, it lacks the ability to capture the similarities between different instances. One popular way to address this limitation is by learning global features (after the global pooling) to capture inter-instance relationships based on knowledge distillation, where the global features of the teacher are used to guide the learning of the global features of the student. Inspired by cross-modality learning, we extend this existing framework that only learns from global features by encouraging the global features and intermediate layer features to learn from each other. This leads to our novel self-supervised framework: cross-context learning between global and hypercolumn features (CGH), that enforces the consistency of instance relations between low- and high-level semantics. Specifically, we stack the intermediate feature maps to construct a hypercolumn representation so that we can measure instance relations using two contexts (hypercolumn and global feature) separately, and then use the relations of one context to guide the learning of the other. This cross-context learning allows the model to learn from the differences between the two contexts. The experimental results on linear classification and downstream tasks show that our method outperforms the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2308.13392",
    "authors": [
      "Zheng Gao",
      "Chen Feng",
      "Ioannis Patras"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13401",
    "title": "Min-$k$-planar Drawings of Graphs",
    "abstract": "The study of nonplanar drawings of graphs with restricted crossing configurations is a well-established topic in graph drawing, often referred to as beyond-planar graph drawing. One of the most studied types of drawings in this area are the $k$-planar drawings $(k \\geq 1)$, where each edge cannot cross more than $k$ times. We generalize $k$-planar drawings, by introducing the new family of min-$k$-planar drawings. In a min-$k$-planar drawing edges can cross an arbitrary number of times, but for any two crossing edges, one of the two must have no more than $k$ crossings. We prove a general upper bound on the number of edges of min-$k$-planar drawings, a finer upper bound for $k=3$, and tight upper bounds for $k=1,2$. Also, we study the inclusion relations between min-$k$-planar graphs (i.e., graphs admitting min-$k$-planar drawings) and $k$-planar graphs. ",
    "url": "https://arxiv.org/abs/2308.13401",
    "authors": [
      "Carla Binucci",
      "Aaron Büngener",
      "Giuseppe Di Battista",
      "Walter Didimo",
      "Vida Dujmović",
      "Seok-Hee Hong",
      "Michael Kaufmann",
      "Giuseppe Liotta",
      "Pat Morin",
      "Alessandra Tappini"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2308.13404",
    "title": "Relighting Neural Radiance Fields with Shadow and Highlight Hints",
    "abstract": "This paper presents a novel neural implicit radiance representation for free viewpoint relighting from a small set of unstructured photographs of an object lit by a moving point light source different from the view position. We express the shape as a signed distance function modeled by a multi layer perceptron. In contrast to prior relightable implicit neural representations, we do not disentangle the different reflectance components, but model both the local and global reflectance at each point by a second multi layer perceptron that, in addition, to density features, the current position, the normal (from the signed distace function), view direction, and light position, also takes shadow and highlight hints to aid the network in modeling the corresponding high frequency light transport effects. These hints are provided as a suggestion, and we leave it up to the network to decide how to incorporate these in the final relit result. We demonstrate and validate our neural implicit representation on synthetic and real scenes exhibiting a wide variety of shapes, material properties, and global illumination light transport. ",
    "url": "https://arxiv.org/abs/2308.13404",
    "authors": [
      "Chong Zeng",
      "Guojun Chen",
      "Yue Dong",
      "Pieter Peers",
      "Hongzhi Wu",
      "Xin Tong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2308.13411",
    "title": "Harvard Glaucoma Detection and Progression: A Multimodal Multitask  Dataset and Generalization-Reinforced Semi-Supervised Learning",
    "abstract": "Glaucoma is the number one cause of irreversible blindness globally. A major challenge for accurate glaucoma detection and progression forecasting is the bottleneck of limited labeled patients with the state-of-the-art (SOTA) 3D retinal imaging data of optical coherence tomography (OCT). To address the data scarcity issue, this paper proposes two solutions. First, we develop a novel generalization-reinforced semi-supervised learning (SSL) model called pseudo supervisor to optimally utilize unlabeled data. Compared with SOTA models, the proposed pseudo supervisor optimizes the policy of predicting pseudo labels with unlabeled samples to improve empirical generalization. Our pseudo supervisor model is evaluated with two clinical tasks consisting of glaucoma detection and progression forecasting. The progression forecasting task is evaluated both unimodally and multimodally. Our pseudo supervisor model demonstrates superior performance than SOTA SSL comparison models. Moreover, our model also achieves the best results on the publicly available LAG fundus dataset. Second, we introduce the Harvard Glaucoma Detection and Progression (Harvard-GDP) Dataset, a multimodal multitask dataset that includes data from 1,000 patients with OCT imaging data, as well as labels for glaucoma detection and progression. This is the largest glaucoma detection dataset with 3D OCT imaging data and the first glaucoma progression forecasting dataset that is publicly available. Detailed sex and racial analysis are provided, which can be used by interested researchers for fairness learning studies. Our released dataset is benchmarked with several SOTA supervised CNN and transformer deep learning models. The dataset and code are made publicly available via \\url{https://ophai.hms.harvard.edu/datasets/harvard-gdp1000}. ",
    "url": "https://arxiv.org/abs/2308.13411",
    "authors": [
      "Yan Luo",
      "Min Shi",
      "Yu Tian",
      "Tobias Elze",
      "Mengyu Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13418",
    "title": "Nougat: Neural Optical Understanding for Academic Documents",
    "abstract": "Scientific knowledge is predominantly stored in books and scientific journals, often in the form of PDFs. However, the PDF format leads to a loss of semantic information, particularly for mathematical expressions. We propose Nougat (Neural Optical Understanding for Academic Documents), a Visual Transformer model that performs an Optical Character Recognition (OCR) task for processing scientific documents into a markup language, and demonstrate the effectiveness of our model on a new dataset of scientific documents. The proposed approach offers a promising solution to enhance the accessibility of scientific knowledge in the digital age, by bridging the gap between human-readable documents and machine-readable text. We release the models and code to accelerate future work on scientific text recognition. ",
    "url": "https://arxiv.org/abs/2308.13418",
    "authors": [
      "Lukas Blecher",
      "Guillem Cucurull",
      "Thomas Scialom",
      "Robert Stojnic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13420",
    "title": "Reinforcement Learning-assisted Evolutionary Algorithm: A Survey and  Research Opportunities",
    "abstract": "Evolutionary algorithms (EA), a class of stochastic search algorithms based on the principles of natural evolution, have received widespread acclaim for their exceptional performance in various optimization problems. While researchers worldwide have proposed a wide variety of EAs, certain limitations remain, such as slow convergence speed and poor generalization capabilities. Consequently, numerous scholars are actively exploring improvements to algorithmic structures, operators, search patterns, etc., to enhance their optimization performance. Reinforcement learning (RL) integrated as a component in the EA framework has demonstrated superior performance in recent years. This paper presents a comprehensive survey on the integration of reinforcement learning into the evolutionary algorithm, referred to as reinforcement learning-assisted evolutionary algorithm (RL-EA). Firstly, we introduce reinforcement learning and the evolutionary algorithm. We then provide a taxonomy of RL-EA. We then discuss the RL-EA integration method, the RL-assisted strategy adopted by RL-EA, and its applications according to the existing literature. The RL-assisted strategy is divided according to the implemented functions including the solution generation, learnable objective function, algorithm/operator/sub-population selection, parameter adaptation, and other strategies. Subsequently, other attribute settings of RL in RL-EA are discussed. Finally, we analyze potential directions for future research. This paper serves as a comprehensive resource for researchers who are interested in RL-EA as it provides an overview of the current state-of-the-art and highlights the associated challenges. By leveraging this survey, readers can swiftly gain insights into RL-EA to develop efficient algorithms, thereby fostering further advancements in this emerging field. ",
    "url": "https://arxiv.org/abs/2308.13420",
    "authors": [
      "Yanjie Song",
      "Yutong Wu",
      "Yangyang Guo",
      "Ran Yan",
      "P. N. Suganthan",
      "Yue Zhang",
      "Witold Pedrycz",
      "Yingwu Chen",
      "Swagatam Das",
      "Rammohan Mallipeddi",
      "Oladayo Solomon Ajani"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2308.13429",
    "title": "Investigating the Impact of Vocabulary Difficulty and Code Naturalness  on Program Comprehension",
    "abstract": "Context: Developers spend most of their time comprehending source code during software development. Automatically assessing how readable and understandable source code is can provide various benefits in different tasks, such as task triaging and code reviews. While several studies have proposed approaches to predict software readability and understandability, most of them only focus on local characteristics of source code. Besides, the performance of understandability prediction is far from satisfactory. Objective: In this study, we aim to assess readability and understandability from the perspective of language acquisition. More specifically, we would like to investigate whether code readability and understandability are correlated with the naturalness and vocabulary difficulty of source code. Method: To assess code naturalness, we adopted the cross-entropy metric, while we use a manually crafted list of code elements with their assigned advancement levels to assess the vocabulary difficulty. We will conduct a statistical analysis to understand their correlations and analyze whether code naturalness and vocabulary difficulty can be used to improve the performance of code readability and understandability prediction methods. The study will be conducted on existing datasets. ",
    "url": "https://arxiv.org/abs/2308.13429",
    "authors": [
      "Bin Lin",
      "Gregorio Robles"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.13433",
    "title": "Representing Timed Automata and Timing Anomalies of Cyber-Physical  Production Systems in Knowledge Graphs",
    "abstract": "Model-Based Anomaly Detection has been a successful approach to identify deviations from the expected behavior of Cyber-Physical Production Systems. Since manual creation of these models is a time-consuming process, it is advantageous to learn them from data and represent them in a generic formalism like timed automata. However, these models - and by extension, the detected anomalies - can be challenging to interpret due to a lack of additional information about the system. This paper aims to improve model-based anomaly detection in CPPS by combining the learned timed automaton with a formal knowledge graph about the system. Both the model and the detected anomalies are described in the knowledge graph in order to allow operators an easier interpretation of the model and the detected anomalies. The authors additionally propose an ontology of the necessary concepts. The approach was validated on a five-tank mixing CPPS and was able to formally define both automata model as well as timing anomalies in automata execution. ",
    "url": "https://arxiv.org/abs/2308.13433",
    "authors": [
      "Tom Westermann",
      "Milapji Singh Gill",
      "Alexander Fay"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.13436",
    "title": "An Intermediate Representation for Composable Typed Streaming Dataflow  Designs",
    "abstract": "Tydi is an open specification for streaming dataflow designs in digital circuits, allowing designers to express how composite and variable-length data structures are transferred over streams using clear, data-centric types. These data types are extensively used in a many application domains, such as big data and SQL applications. This way, Tydi provides a higher-level method for defining interfaces between components as opposed to existing bit and byte-based interface specifications. In this paper, we introduce an open-source intermediate representation (IR) which allows for the declaration of Tydi's types. The IR enables creating and connecting components with Tydi Streams as interfaces, called Streamlets. It also lets backends for synthesis and simulation retain high-level information, such as documentation. Types and Streamlets can be easily reused between multiple projects, and Tydi's streams and type hierarchy can be used to define interface contracts, which aid collaboration when designing a larger system. The IR codifies the rules and properties established in the Tydi specification and serves to complement computation-oriented hardware design tools with a data-centric view on interfaces. To support different backends and targets, the IR is focused on expressing interfaces, and complements behavior described by hardware description languages and other IRs. Additionally, a testing syntax for the verification of inputs and outputs against abstract streams of data, and for substituting interdependent components, is presented which allows for the specification of behavior. To demonstrate this IR, we have created a grammar, parser, and query system, and paired these with a backend targeting VHDL. ",
    "url": "https://arxiv.org/abs/2308.13436",
    "authors": [
      "Matthijs A. Reukers",
      "Yongding Tian",
      "Zaid Al-Ars",
      "Peter Hofstee",
      "Matthijs Brobbel",
      "Johan Peltenburg",
      "Jeroen van Straten"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2308.13441",
    "title": "Mesh-Wise Prediction of Demographic Composition from Satellite Images  Using Multi-Head Convolutional Neural Network",
    "abstract": "Population aging is one of the most serious problems in certain countries. In order to implement its countermeasures, understanding its rapid progress is of urgency with a granular resolution. However, a detailed and rigorous survey with high frequency is not feasible due to the constraints of financial and human resources. Nowadays, Deep Learning is prevalent for pattern recognition with significant accuracy, with its application to remote sensing. This paper proposes a multi-head Convolutional Neural Network model with transfer learning from pre-trained ResNet50 for estimating mesh-wise demographics of Japan as one of the most aged countries in the world, with satellite images from Landsat-8/OLI and Suomi NPP/VIIRS-DNS as inputs and census demographics as labels. The trained model was performed on a testing dataset with a test score of at least 0.8914 in $\\text{R}^2$ for all the demographic composition groups, and the estimated demographic composition was generated and visualised for 2022 as a non-census year. ",
    "url": "https://arxiv.org/abs/2308.13441",
    "authors": [
      "Yuta Sato"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13466",
    "title": "Staleness-Alleviated Distributed GNN Training via Online  Dynamic-Embedding Prediction",
    "abstract": "Despite the recent success of Graph Neural Networks (GNNs), it remains challenging to train GNNs on large-scale graphs due to neighbor explosions. As a remedy, distributed computing becomes a promising solution by leveraging abundant computing resources (e.g., GPU). However, the node dependency of graph data increases the difficulty of achieving high concurrency in distributed GNN training, which suffers from the massive communication overhead. To address it, Historical value approximation is deemed a promising class of distributed training techniques. It utilizes an offline memory to cache historical information (e.g., node embedding) as an affordable approximation of the exact value and achieves high concurrency. However, such benefits come at the cost of involving dated training information, leading to staleness, imprecision, and convergence issues. To overcome these challenges, this paper proposes SAT (Staleness-Alleviated Training), a novel and scalable distributed GNN training framework that reduces the embedding staleness adaptively. The key idea of SAT is to model the GNN's embedding evolution as a temporal graph and build a model upon it to predict future embedding, which effectively alleviates the staleness of the cached historical embedding. We propose an online algorithm to train the embedding predictor and the distributed GNN alternatively and further provide a convergence analysis. Empirically, we demonstrate that SAT can effectively reduce embedding staleness and thus achieve better performance and convergence speed on multiple large-scale graph datasets. ",
    "url": "https://arxiv.org/abs/2308.13466",
    "authors": [
      "Guangji Bai",
      "Ziyang Yu",
      "Zheng Chai",
      "Yue Cheng",
      "Liang Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.13469",
    "title": "RestNet: Boosting Cross-Domain Few-Shot Segmentation with Residual  Transformation Network",
    "abstract": "Cross-domain few-shot segmentation (CD-FSS) aims to achieve semantic segmentation in previously unseen domains with a limited number of annotated samples. Although existing CD-FSS models focus on cross-domain feature transformation, relying exclusively on inter-domain knowledge transfer may lead to the loss of critical intra-domain information. To this end, we propose a novel residual transformation network (RestNet) that facilitates knowledge transfer while retaining the intra-domain support-query feature information. Specifically, we propose a Semantic Enhanced Anchor Transform (SEAT) module that maps features to a stable domain-agnostic space using advanced semantics. Additionally, an Intra-domain Residual Enhancement (IRE) module is designed to maintain the intra-domain representation of the original discriminant space in the new space. We also propose a mask prediction strategy based on prototype fusion to help the model gradually learn how to segment. Our RestNet can transfer cross-domain knowledge from both inter-domain and intra-domain without requiring additional fine-tuning. Extensive experiments on ISIC, Chest X-ray, and FSS-1000 show that our RestNet achieves state-of-the-art performance. Our code will be available soon. ",
    "url": "https://arxiv.org/abs/2308.13469",
    "authors": [
      "Xinyang Huang",
      "Chuang Zhu",
      "Wenkai Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13474",
    "title": "OCTAL: Graph Representation Learning for LTL Model Checking",
    "abstract": "Model Checking is widely applied in verifying the correctness of complex and concurrent systems against a specification. Pure symbolic approaches while popular, suffer from the state space explosion problem due to cross product operations required that make them prohibitively expensive for large-scale systems and/or specifications. In this paper, we propose to use graph representation learning (GRL) for solving linear temporal logic (LTL) model checking, where the system and the specification are expressed by a B{\\\"u}chi automaton and an LTL formula, respectively. A novel GRL-based framework \\model, is designed to learn the representation of the graph-structured system and specification, which reduces the model checking problem to binary classification. Empirical experiments on two model checking scenarios show that \\model achieves promising accuracy, with up to $11\\times$ overall speedup against canonical SOTA model checkers and $31\\times$ for satisfiability checking alone. ",
    "url": "https://arxiv.org/abs/2308.13474",
    "authors": [
      "Prasita Mukherjee",
      "Haoteng Yin"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Artificial Intelligence (cs.AI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.13490",
    "title": "TpuGraphs: A Performance Prediction Dataset on Large Tensor  Computational Graphs",
    "abstract": "Precise hardware performance models play a crucial role in code optimizations. They can assist compilers in making heuristic decisions or aid autotuners in identifying the optimal configuration for a given program. For example, the autotuner for XLA, a machine learning compiler, discovered 10-20% speedup on state-of-the-art models serving substantial production traffic at Google. Although there exist a few datasets for program performance prediction, they target small sub-programs such as basic blocks or kernels. This paper introduces TpuGraphs, a performance prediction dataset on full tensor programs, represented as computational graphs, running on Tensor Processing Units (TPUs). Each graph in the dataset represents the main computation of a machine learning workload, e.g., a training epoch or an inference step. Each data sample contains a computational graph, a compilation configuration, and the execution time of the graph when compiled with the configuration. The graphs in the dataset are collected from open-source machine learning programs, featuring popular model architectures, e.g., ResNet, EfficientNet, Mask R-CNN, and Transformer. TpuGraphs provides 25x more graphs than the largest graph property prediction dataset (with comparable graph sizes), and 770x larger graphs on average compared to existing performance prediction datasets on machine learning programs. This graph-level prediction task on large graphs introduces new challenges in learning, ranging from scalability, training efficiency, to model quality. ",
    "url": "https://arxiv.org/abs/2308.13490",
    "authors": [
      "Phitchaya Mangpo Phothilimthana",
      "Sami Abu-El-Haija",
      "Kaidi Cao",
      "Bahare Fatemi",
      "Charith Mendis",
      "Bryan Perozzi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2308.13497",
    "title": "Ngambay-French Neural Machine Translation (sba-Fr)",
    "abstract": "In Africa, and the world at large, there is an increasing focus on developing Neural Machine Translation (NMT) systems to overcome language barriers. NMT for Low-resource language is particularly compelling as it involves learning with limited labelled data. However, obtaining a well-aligned parallel corpus for low-resource languages can be challenging. The disparity between the technological advancement of a few global languages and the lack of research on NMT for local languages in Chad is striking. End-to-end NMT trials on low-resource Chad languages have not been attempted. Additionally, there is a dearth of online and well-structured data gathering for research in Natural Language Processing, unlike some African languages. However, a guided approach for data gathering can produce bitext data for many Chadian language translation pairs with well-known languages that have ample data. In this project, we created the first sba-Fr Dataset, which is a corpus of Ngambay-to-French translations, and fine-tuned three pre-trained models using this dataset. Our experiments show that the M2M100 model outperforms other models with high BLEU scores on both original and original+synthetic data. The publicly available bitext dataset can be used for research purposes. ",
    "url": "https://arxiv.org/abs/2308.13497",
    "authors": [
      "Sakayo Toadoum Sari",
      "Angela Fan",
      "Lema Logamou Seknewna"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.13503",
    "title": "Attending Generalizability in Course of Deep Fake Detection by Exploring  Multi-task Learning",
    "abstract": "This work explores various ways of exploring multi-task learning (MTL) techniques aimed at classifying videos as original or manipulated in cross-manipulation scenario to attend generalizability in deep fake scenario. The dataset used in our evaluation is FaceForensics++, which features 1000 original videos manipulated by four different techniques, with a total of 5000 videos. We conduct extensive experiments on multi-task learning and contrastive techniques, which are well studied in literature for their generalization benefits. It can be concluded that the proposed detection model is quite generalized, i.e., accurately detects manipulation methods not encountered during training as compared to the state-of-the-art. ",
    "url": "https://arxiv.org/abs/2308.13503",
    "authors": [
      "Pranav Balaji",
      "Abhijit Das",
      "Srijan Das",
      "Antitza Dantcheva"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.13517",
    "title": "ChatGPT as Data Augmentation for Compositional Generalization: A Case  Study in Open Intent Detection",
    "abstract": "Open intent detection, a crucial aspect of natural language understanding, involves the identification of previously unseen intents in user-generated text. Despite the progress made in this field, challenges persist in handling new combinations of language components, which is essential for compositional generalization. In this paper, we present a case study exploring the use of ChatGPT as a data augmentation technique to enhance compositional generalization in open intent detection tasks. We begin by discussing the limitations of existing benchmarks in evaluating this problem, highlighting the need for constructing datasets for addressing compositional generalization in open intent detection tasks. By incorporating synthetic data generated by ChatGPT into the training process, we demonstrate that our approach can effectively improve model performance. Rigorous evaluation of multiple benchmarks reveals that our method outperforms existing techniques and significantly enhances open intent detection capabilities. Our findings underscore the potential of large language models like ChatGPT for data augmentation in natural language understanding tasks. ",
    "url": "https://arxiv.org/abs/2308.13517",
    "authors": [
      "Yihao Fang",
      "Xianzhi Li",
      "Stephen W. Thomas",
      "Xiaodan Zhu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.13028",
    "title": "Training Neural Networks with Universal Adiabatic Quantum Computing",
    "abstract": "The training of neural networks (NNs) is a computationally intensive task requiring significant time and resources. This paper presents a novel approach to NN training using Adiabatic Quantum Computing (AQC), a paradigm that leverages the principles of adiabatic evolution to solve optimisation problems. We propose a universal AQC method that can be implemented on gate quantum computers, allowing for a broad range of Hamiltonians and thus enabling the training of expressive neural networks. We apply this approach to various neural networks with continuous, discrete, and binary weights. Our results indicate that AQC can very efficiently find the global minimum of the loss function, offering a promising alternative to classical training methods. ",
    "url": "https://arxiv.org/abs/2308.13028",
    "authors": [
      "Steve Abel",
      "Juan Carlos Criado",
      "Michael Spannowsky"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)",
      "High Energy Physics - Theory (hep-th)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2308.13029",
    "title": "Neural networks in feedback for flow analysis, sensor placement and  control",
    "abstract": "This work presents a novel methodology for analysis and control of nonlinear fluid systems using neural networks. The approach is demonstrated on four different study cases being the Lorenz system, a modified version of the Kuramoto-Sivashinsky equation, a streamwise-periodic 2D channel flow, and a confined cylinder flow. Neural networks are trained as models to capture the complex system dynamics and estimate equilibrium points through a Newton method, enabled by backpropagation. These neural network surrogate models (NNSMs) are leveraged to train a second neural network, which is designed to act as a stabilizing closed-loop controller. The training process employs a recurrent approach, whereby the NNSM and the neural network controller (NNC) are chained in closed loop along a finite time horizon. By cycling through phases of combined random open-loop actuation and closed-loop control, an iterative training process is introduced to overcome the lack of data near equilibrium points. This approach improves the accuracy of the models in the most critical region for achieving stabilization. Through the use of L1 regularization within loss functions, the NNSMs can also guide optimal sensor placement, reducing the number of sensors from an initial candidate set. The datasets produced during the iterative training process are also leveraged for conducting a linear stability analysis through a modified dynamic mode decomposition approach. The results demonstrate the effectiveness of computationally inexpensive neural networks in modeling, controlling, and enabling stability analysis of nonlinear systems, providing insights into the system behaviour and offering potential for stabilization of complex fluid systems. ",
    "url": "https://arxiv.org/abs/2308.13029",
    "authors": [
      "Tarcísio Déda",
      "William Wolf",
      "Scott Dawson"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.13222",
    "title": "Bayesian Reasoning for Physics Informed Neural Networks",
    "abstract": "Physics informed neural network (PINN) approach in Bayesian formulation is presented. We adopt the Bayesian neural network framework formulated by MacKay (Neural Computation 4 (3) (1992) 448). The posterior densities are obtained from Laplace approximation. For each model (fit), the so-called evidence is computed. It is a measure that classifies the hypothesis. The most optimal solution has the maximal value of the evidence. The Bayesian framework allows us to control the impact of the boundary contribution to the total loss. Indeed, the relative weights of loss components are fine-tuned by the Bayesian algorithm. We solve heat, wave, and Burger's equations. The obtained results are in good agreement with the exact solutions. All solutions are provided with the uncertainties computed within the Bayesian framework. ",
    "url": "https://arxiv.org/abs/2308.13222",
    "authors": [
      "Krzysztof M. Graczyk",
      "Kornel Witkowski"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (cs.LG)",
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2308.13280",
    "title": "AtmoRep: A stochastic model of atmosphere dynamics using large scale  representation learning",
    "abstract": "The atmosphere affects humans in a multitude of ways, from loss of life due to adverse weather effects to long-term social and economic impacts on societies. Computer simulations of atmospheric dynamics are, therefore, of great importance for the well-being of our and future generations. Here, we propose AtmoRep, a novel, task-independent stochastic computer model of atmospheric dynamics that can provide skillful results for a wide range of applications. AtmoRep uses large-scale representation learning from artificial intelligence to determine a general description of the highly complex, stochastic dynamics of the atmosphere from the best available estimate of the system's historical trajectory as constrained by observations. This is enabled by a novel self-supervised learning objective and a unique ensemble that samples from the stochastic model with a variability informed by the one in the historical record. The task-independent nature of AtmoRep enables skillful results for a diverse set of applications without specifically training for them and we demonstrate this for nowcasting, temporal interpolation, model correction, and counterfactuals. We also show that AtmoRep can be improved with additional data, for example radar observations, and that it can be extended to tasks such as downscaling. Our work establishes that large-scale neural networks can provide skillful, task-independent models of atmospheric dynamics. With this, they provide a novel means to make the large record of atmospheric observations accessible for applications and for scientific inquiry, complementing existing simulations based on first principles. ",
    "url": "https://arxiv.org/abs/2308.13280",
    "authors": [
      "Christian Lessig",
      "Ilaria Luise",
      "Bing Gong",
      "Michael Langguth",
      "Scarlet Stadler",
      "Martin Schultz"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2308.13328",
    "title": "Compressor-Based Classification for Atrial Fibrillation Detection",
    "abstract": "Atrial fibrillation (AF) is one of the most common arrhythmias with challenging public health implications. Automatic detection of AF episodes is therefore one of the most important tasks in biomedical engineering. In this paper, we apply the recently introduced method of compressor-based text classification to the task of AF detection (binary classification between heart rhythms). We investigate the normalised compression distance applied to $\\Delta$RR and RR-interval sequences, the configuration of the k-Nearest Neighbour classifier, and an optimal window length. We achieve good classification results (avg. sensitivity = 97.1%, avg. specificity = 91.7%, best sensitivity of 99.8%, best specificity of 97.6% with 5-fold cross-validation). Obtained performance is close to the best specialised AF detection algorithms. Our results suggest that gzip classification, originally proposed for texts, is suitable for biomedical data and continuous stochastic sequences in general. ",
    "url": "https://arxiv.org/abs/2308.13328",
    "authors": [
      "Nikita Markov",
      "Konstantin Ushenin",
      "Yakov Bozhko",
      "Olga Solovyova"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.13356",
    "title": "CEIMVEN: An Approach of Cutting Edge Implementation of Modified Versions  of EfficientNet (V1-V2) Architecture for Breast Cancer Detection and  Classification from Ultrasound Images",
    "abstract": "Undoubtedly breast cancer identifies itself as one of the most widespread and terrifying cancers across the globe. Millions of women are getting affected each year from it. Breast cancer remains the major one for being the reason of largest number of demise of women. In the recent time of research, Medical Image Computing and Processing has been playing a significant role for detecting and classifying breast cancers from ultrasound images and mammograms, along with the celestial touch of deep neural networks. In this research, we focused mostly on our rigorous implementations and iterative result analysis of different cutting-edge modified versions of EfficientNet architectures namely EfficientNet-V1 (b0-b7) and EfficientNet-V2 (b0-b3) with ultrasound image, named as CEIMVEN. We utilized transfer learning approach here for using the pre-trained models of EfficientNet versions. We activated the hyper-parameter tuning procedures, added fully connected layers, discarded the unprecedented outliers and recorded the accuracy results from our custom modified EfficientNet architectures. Our deep learning model training approach was related to both identifying the cancer affected areas with region of interest (ROI) techniques and multiple classifications (benign, malignant and normal). The approximate testing accuracies we got from the modified versions of EfficientNet-V1 (b0- 99.15%, b1- 98.58%, b2- 98.43%, b3- 98.01%, b4- 98.86%, b5- 97.72%, b6- 97.72%, b7- 98.72%) and EfficientNet-V2 (b0- 99.29%, b1- 99.01%, b2- 98.72%, b3- 99.43%) are showing very bright future and strong potentials of deep learning approach for the successful detection and classification of breast cancers from the ultrasound images at a very early stage. ",
    "url": "https://arxiv.org/abs/2308.13356",
    "authors": [
      "Sheekar Banerjee",
      "Md. Kamrul Hasan Monir"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.13371",
    "title": "EOG Artifact Removal from Single and Multi-channel EEG Recordings  through the combination of Long Short-Term Memory Networks and Independent  Component Analysis",
    "abstract": "Introduction: Electroencephalogram (EEG) signals have gained significant popularity in various applications due to their rich information content. However, these signals are prone to contamination from various sources of artifacts, notably the electrooculogram (EOG) artifacts caused by eye movements. The most effective approach to mitigate EOG artifacts involves recording EOG signals simultaneously with EEG and employing blind source separation techniques, such as independent component analysis (ICA). Nevertheless, the availability of EOG recordings is not always feasible, particularly in pre-recorded datasets. Objective: In this paper, we present a novel methodology that combines a long short-term memory (LSTM)-based neural network with ICA to address the challenge of EOG artifact removal from contaminated EEG signals. Approach: Our approach aims to accomplish two primary objectives: 1) estimate the horizontal and vertical EOG signals from the contaminated EEG data, and 2) employ ICA to eliminate the estimated EOG signals from the EEG, thereby producing an artifact-free EEG signal. Main results: To evaluate the performance of our proposed method, we conducted experiments on a publicly available dataset comprising recordings from 27 participants. We employed well-established metrics such as mean squared error, mean absolute error, and mean error to assess the quality of our artifact removal technique. Significance: Furthermore, we compared the performance of our approach with two state-of-the-art deep learning-based methods reported in the literature, demonstrating the superior performance of our proposed methodology. ",
    "url": "https://arxiv.org/abs/2308.13371",
    "authors": [
      "Behrad TaghiBeyglou",
      "Fatemeh Bagheri"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.13422",
    "title": "QKSAN: A Quantum Kernel Self-Attention Network",
    "abstract": "Self-Attention Mechanism (SAM) is skilled at extracting important information from the interior of data to improve the computational efficiency of models. Nevertheless, many Quantum Machine Learning (QML) models lack the ability to distinguish the intrinsic connections of information like SAM, which limits their effectiveness on massive high-dimensional quantum data. To address this issue, a Quantum Kernel Self-Attention Mechanism (QKSAM) is introduced, which combines the data representation benefit of Quantum Kernel Methods (QKM) with the efficient information extraction capability of SAM. A Quantum Kernel Self-Attention Network (QKSAN) framework is built based on QKSAM, with Deferred Measurement Principle (DMP) and conditional measurement techniques, which releases half of the quantum resources with probabilistic measurements during computation. The Quantum Kernel Self-Attention Score (QKSAS) determines the measurement conditions and reflects the probabilistic nature of quantum systems. Finally, four QKSAN models are deployed on the Pennylane platform to perform binary classification on MNIST images. The best-performing among the four models is assessed for noise immunity and learning ability. Remarkably, the potential learning benefit of partial QKSAN models over classical deep learning is that they require few parameters for a high return of 98\\% $\\pm$ 1\\% test and train accuracy, even with highly compressed images. QKSAN lays the foundation for future quantum computers to perform machine learning on massive amounts of data, while driving advances in areas such as quantum Natural Language Processing (NLP). ",
    "url": "https://arxiv.org/abs/2308.13422",
    "authors": [
      "Ren-Xin Zhao",
      "Jinjing Shi",
      "Xuelong Li"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.13431",
    "title": "Six Lectures on Linearized Neural Networks",
    "abstract": "In these six lectures, we examine what can be learnt about the behavior of multi-layer neural networks from the analysis of linear models. We first recall the correspondence between neural networks and linear models via the so-called lazy regime. We then review four models for linearized neural networks: linear regression with concentrated features, kernel ridge regression, random feature model and neural tangent model. Finally, we highlight the limitations of the linear theory and discuss how other approaches can overcome them. ",
    "url": "https://arxiv.org/abs/2308.13431",
    "authors": [
      "Theodor Misiakiewicz",
      "Andrea Montanari"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2308.13451",
    "title": "Gotta match 'em all: Solution diversification in graph matching matched  filters",
    "abstract": "We present a novel approach for finding multiple noisily embedded template graphs in a very large background graph. Our method builds upon the graph-matching-matched-filter technique proposed in Sussman et al., with the discovery of multiple diverse matchings being achieved by iteratively penalizing a suitable node-pair similarity matrix in the matched filter algorithm. In addition, we propose algorithmic speed-ups that greatly enhance the scalability of our matched-filter approach. We present theoretical justification of our methodology in the setting of correlated Erdos-Renyi graphs, showing its ability to sequentially discover multiple templates under mild model conditions. We additionally demonstrate our method's utility via extensive experiments both using simulated models and real-world dataset, include human brain connectomes and a large transactional knowledge base. ",
    "url": "https://arxiv.org/abs/2308.13451",
    "authors": [
      "Zhirui Li",
      "Ben Johnson",
      "Daniel L. Sussman",
      "Carey E. Priebe",
      "Vince Lyzinski"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Combinatorics (math.CO)",
      "Applications (stat.AP)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2009.12462",
    "title": "Symbolic Relational Deep Reinforcement Learning based on Graph Neural  Networks and Autoregressive Policy Decomposition",
    "abstract": " Comments: code available at this https URL ",
    "url": "https://arxiv.org/abs/2009.12462",
    "authors": [
      "Jaromír Janisch",
      "Tomáš Pevný",
      "Viliam Lisý"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2010.14449",
    "title": "On Model Identification and Out-of-Sample Prediction of Principal  Component Regression: Applications to Synthetic Controls",
    "abstract": " Title: On Model Identification and Out-of-Sample Prediction of Principal  Component Regression: Applications to Synthetic Controls ",
    "url": "https://arxiv.org/abs/2010.14449",
    "authors": [
      "Anish Agarwal",
      "Devavrat Shah",
      "Dennis Shen"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2109.10072",
    "title": "Scenario generation for market risk models using generative neural  networks",
    "abstract": " Title: Scenario generation for market risk models using generative neural  networks ",
    "url": "https://arxiv.org/abs/2109.10072",
    "authors": [
      "Solveig Flaig",
      "Gero Junike"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Mathematical Finance (q-fin.MF)",
      "Risk Management (q-fin.RM)"
    ]
  },
  {
    "id": "arXiv:2111.01166",
    "title": "Dynamics of Local Elasticity During Training of Neural Nets",
    "abstract": " Comments: 40 pages (single column), the experiments have been significantly improved than the previous version ",
    "url": "https://arxiv.org/abs/2111.01166",
    "authors": [
      "Soham Dan",
      "Anirbit Mukherjee",
      "Avirup Das",
      "Phanideep Gampa"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.07390",
    "title": "What's the Difference? The potential for Convolutional Neural Networks  for transient detection without template subtraction",
    "abstract": " Title: What's the Difference? The potential for Convolutional Neural Networks  for transient detection without template subtraction ",
    "url": "https://arxiv.org/abs/2203.07390",
    "authors": [
      "Tatiana Acero-Cuellar",
      "Federica Bianco",
      "Gregory Dobler",
      "Masao Sako",
      "Helen Qu",
      "LSST Dark Energy Science Collaboration"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)"
    ]
  },
  {
    "id": "arXiv:2208.12263",
    "title": "Augmenting Reinforcement Learning with Transformer-based Scene  Representation Learning for Decision-making of Autonomous Driving",
    "abstract": " Title: Augmenting Reinforcement Learning with Transformer-based Scene  Representation Learning for Decision-making of Autonomous Driving ",
    "url": "https://arxiv.org/abs/2208.12263",
    "authors": [
      "Haochen Liu",
      "Zhiyu Huang",
      "Xiaoyu Mo",
      "Chen Lv"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2208.14412",
    "title": "On the first-order transduction quasiorder of hereditary classes of  graphs",
    "abstract": " Title: On the first-order transduction quasiorder of hereditary classes of  graphs ",
    "url": "https://arxiv.org/abs/2208.14412",
    "authors": [
      "Samuel Braunfeld",
      "Jaroslav Nešetřil",
      "Patrice Ossona de Mendez",
      "Sebastian Siebertz"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Logic in Computer Science (cs.LO)",
      "Logic (math.LO)"
    ]
  },
  {
    "id": "arXiv:2210.05880",
    "title": "Pathology Steered Stratification Network for Subtype Identification in  Alzheimer's Disease",
    "abstract": " Title: Pathology Steered Stratification Network for Subtype Identification in  Alzheimer's Disease ",
    "url": "https://arxiv.org/abs/2210.05880",
    "authors": [
      "Enze Xu",
      "Jingwen Zhang",
      "Jiadi Li",
      "Qianqian Song",
      "Defu Yang",
      "Guorong Wu",
      "Minghan Chen"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.00216",
    "title": "Distributed Graph Neural Network Training: A Survey",
    "abstract": " Title: Distributed Graph Neural Network Training: A Survey ",
    "url": "https://arxiv.org/abs/2211.00216",
    "authors": [
      "Yingxia Shao",
      "Hongzheng Li",
      "Xizhi Gu",
      "Hongbo Yin",
      "Yawen Li",
      "Xupeng Miao",
      "Wentao Zhang",
      "Bin Cui",
      "Lei Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2211.04154",
    "title": "Russian propaganda on social media during the 2022 invasion of Ukraine",
    "abstract": " Title: Russian propaganda on social media during the 2022 invasion of Ukraine ",
    "url": "https://arxiv.org/abs/2211.04154",
    "authors": [
      "Dominique Geissler",
      "Dominik Bär",
      "Nicolas Pröllochs",
      "Stefan Feuerriegel"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2211.10995",
    "title": "Distinctive Self-Similar Object Detection",
    "abstract": " Title: Distinctive Self-Similar Object Detection ",
    "url": "https://arxiv.org/abs/2211.10995",
    "authors": [
      "Zeyu Shangguan",
      "Bocheng Hu",
      "Guohua Dai",
      "Yuyu Liu",
      "Darun Tang",
      "Xingqun Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.13856",
    "title": "WSSL: Weighted Self-supervised Learning Framework For Image-inpainting",
    "abstract": " Comments: 9 Pages, document submitted for publication at CGVCVIP 2022 - ISBN 978-989-8704-42-9 ",
    "url": "https://arxiv.org/abs/2211.13856",
    "authors": [
      "Shubham Gupta",
      "Rahul Kunigal Ravishankar",
      "Madhoolika Gangaraju",
      "Poojasree Dwarkanath",
      "Natarajan Subramanyam"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.14575",
    "title": "Efficient Video Prediction via Sparsely Conditioned Flow Matching",
    "abstract": " Comments: Accepted to ICCV 2023. Project page: this https URL ",
    "url": "https://arxiv.org/abs/2211.14575",
    "authors": [
      "Aram Davtyan",
      "Sepehr Sameni",
      "Paolo Favaro"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.02501",
    "title": "SceneRF: Self-Supervised Monocular 3D Scene Reconstruction with Radiance  Fields",
    "abstract": " Comments: ICCV 2023. Project page: this https URL ",
    "url": "https://arxiv.org/abs/2212.02501",
    "authors": [
      "Anh-Quan Cao",
      "Raoul de Charette"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2212.04880",
    "title": "A Polynomial-Time Algorithm for MCS Partial Search Order on Chordal  Graphs",
    "abstract": " Comments: to appear in MFCS 2023 ",
    "url": "https://arxiv.org/abs/2212.04880",
    "authors": [
      "Guozhen Rong",
      "Yongjie Yang",
      "Wenjun Li"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2212.07585",
    "title": "Rethinking the Role of Pre-Trained Networks in Source-Free Domain  Adaptation",
    "abstract": " Comments: Accepted to ICCV 2023 ",
    "url": "https://arxiv.org/abs/2212.07585",
    "authors": [
      "Wenyu Zhang",
      "Li Shen",
      "Chuan-Sheng Foo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.08898",
    "title": "A Unified Approach for Resilience and Causal Responsibility with Integer  Linear Programming (ILP) and LP Relaxations",
    "abstract": " Comments: 25 pages, 16 figures ",
    "url": "https://arxiv.org/abs/2212.08898",
    "authors": [
      "Neha Makhija",
      "Wolfgang Gatterbauer"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2212.09844",
    "title": "Robust Design and Evaluation of Predictive Algorithms under Unobserved  Confounding",
    "abstract": " Title: Robust Design and Evaluation of Predictive Algorithms under Unobserved  Confounding ",
    "url": "https://arxiv.org/abs/2212.09844",
    "authors": [
      "Ashesh Rambachan",
      "Amanda Coston",
      "Edward Kennedy"
    ],
    "subjectives": [
      "Econometrics (econ.EM)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2302.01161",
    "title": "Vectorized Scenario Description and Motion Prediction for Scenario-Based  Testing",
    "abstract": " Comments: 6 pages, 7 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2302.01161",
    "authors": [
      "Max Winkelmann",
      "Constantin Vasconi",
      "Steffen Müller"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2303.02574",
    "title": "Sim2Real Neural Controllers for Physics-based Robotic Deployment of  Deformable Linear Objects",
    "abstract": " Comments: YouTube video: this https URL ",
    "url": "https://arxiv.org/abs/2303.02574",
    "authors": [
      "Dezhong Tong",
      "Andrew Choi",
      "Longhui Qin",
      "Weicheng Huang",
      "Jungseock Joo",
      "M. Khalid Jawed"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:2303.09608",
    "title": "VEIL: Vetting Extracted Image Labels from In-the-Wild Captions for  Weakly-Supervised Object Detection",
    "abstract": " Title: VEIL: Vetting Extracted Image Labels from In-the-Wild Captions for  Weakly-Supervised Object Detection ",
    "url": "https://arxiv.org/abs/2303.09608",
    "authors": [
      "Arushi Rai",
      "Adriana Kovashka"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.13850",
    "title": "Towards Learning and Explaining Indirect Causal Effects in Neural  Networks",
    "abstract": " Title: Towards Learning and Explaining Indirect Causal Effects in Neural  Networks ",
    "url": "https://arxiv.org/abs/2303.13850",
    "authors": [
      "Abbaavaram Gowtham Reddy",
      "Saketh Bachu",
      "Harsharaj Pathak",
      "Benin L Godfrey",
      "Vineeth N. Balasubramanian",
      "Varshaneya V",
      "Satya Narayanan Kar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2304.01568",
    "title": "Arrhythmia Classifier Based on Ultra-Lightweight Binary Neural Network",
    "abstract": " Comments: 6 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2304.01568",
    "authors": [
      "Ninghao Pu",
      "Zhongxing Wu",
      "Ao Wang",
      "Hanshi Sun",
      "Zijin Liu",
      "Hao Liu"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05253",
    "title": "Approximating Online Human Evaluation of Social Chatbots with Prompting",
    "abstract": " Comments: accepted to SIGDIAL 2023 (long paper) ",
    "url": "https://arxiv.org/abs/2304.05253",
    "authors": [
      "Ekaterina Svikhnushina",
      "Pearl Pu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2304.07707",
    "title": "Non-exemplar Class-incremental Learning by Random Auxiliary Classes  Augmentation and Mixed Features",
    "abstract": " Comments: 12 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2304.07707",
    "authors": [
      "Ke Song",
      "Quan Xia",
      "Guoqiang Liang",
      "Zhaojie Chen",
      "Yanning Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.02691",
    "title": "PGB: A PubMed Graph Benchmark for Heterogeneous Network Representation  Learning",
    "abstract": " Title: PGB: A PubMed Graph Benchmark for Heterogeneous Network Representation  Learning ",
    "url": "https://arxiv.org/abs/2305.02691",
    "authors": [
      "Eric W Lee",
      "Joyce C Ho"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.07011",
    "title": "Region-Aware Pretraining for Open-Vocabulary Object Detection with  Vision Transformers",
    "abstract": " Comments: CVPR 2023 Highlight (this https URL); adds LAION-2B result ",
    "url": "https://arxiv.org/abs/2305.07011",
    "authors": [
      "Dahun Kim",
      "Anelia Angelova",
      "Weicheng Kuo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.13802",
    "title": "Online Open-set Semi-supervised Object Detection by Valuable Instances  Mining",
    "abstract": " Title: Online Open-set Semi-supervised Object Detection by Valuable Instances  Mining ",
    "url": "https://arxiv.org/abs/2305.13802",
    "authors": [
      "Zerun Wang",
      "Ling Xiao",
      "Liuyu Xiang",
      "Zhaotian Weng",
      "Toshihiko Yamasaki"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.05952",
    "title": "Overcoming Adversarial Attacks for Human-in-the-Loop Applications",
    "abstract": " Comments: New Frontiers in Adversarial Machine Learning, ICML 2022 ",
    "url": "https://arxiv.org/abs/2306.05952",
    "authors": [
      "Ryan McCoppin",
      "Marla Kennedy",
      "Platon Lukyanenko",
      "Sean Kennedy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.13201",
    "title": "Decomposition of Geometric Graphs into Star Forests",
    "abstract": " Comments: Appears in the Proceedings of the 31st International Symposium on Graph Drawing and Network Visualization (GD 2023) ",
    "url": "https://arxiv.org/abs/2306.13201",
    "authors": [
      "János Pach",
      "Morteza Saghafian",
      "Patrick Schnider"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2306.14017",
    "title": "A Cyber-HIL for Investigating Control Systems in Ship Cyber Physical  Systems under Communication Issues and Cyber Attacks",
    "abstract": " Comments: 10 pages, 16 figures, journal under review ",
    "url": "https://arxiv.org/abs/2306.14017",
    "authors": [
      "Linh Vu",
      "Lam Nguyen",
      "Mahmoud Abdelaal",
      "Tuyen Vu",
      "Osama Mohammed"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2306.15787",
    "title": "Network inference in a stochastic multi-population neural mass model via  approximate Bayesian computation",
    "abstract": " Comments: 29 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2306.15787",
    "authors": [
      "Susanne Ditlevsen",
      "Massimiliano Tamborrino",
      "Irene Tubikanec"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2306.16556",
    "title": "Inter-Rater Uncertainty Quantification in Medical Image Segmentation via  Rater-Specific Bayesian Neural Networks",
    "abstract": " Comments: submitted to a journal for review ",
    "url": "https://arxiv.org/abs/2306.16556",
    "authors": [
      "Qingqiao Hu",
      "Hao Wang",
      "Jing Luo",
      "Yunhao Luo",
      "Zhiheng Zhangg",
      "Jan S. Kirschke",
      "Benedikt Wiestler",
      "Bjoern Menze",
      "Jianguo Zhang",
      "Hongwei Bran Li"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.17645",
    "title": "Federated Object Detection for Quality Inspection in Shared Production",
    "abstract": " Comments: Will submit it to an IEEE conference ",
    "url": "https://arxiv.org/abs/2306.17645",
    "authors": [
      "Vinit Hegiste",
      "Tatjana Legler",
      "Martin Ruskowski"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.17829",
    "title": "Federated Ensemble YOLOv5 -- A Better Generalized Object Detection  Algorithm",
    "abstract": " Comments: 8 pages and submitted to FLTA2023 symposium under IEEE ",
    "url": "https://arxiv.org/abs/2306.17829",
    "authors": [
      "Vinit Hegiste",
      "Tatjana Legler",
      "Martin Ruskowski"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.06698",
    "title": "IntelliGraphs: Datasets for Benchmarking Knowledge Graph Generation",
    "abstract": " Title: IntelliGraphs: Datasets for Benchmarking Knowledge Graph Generation ",
    "url": "https://arxiv.org/abs/2307.06698",
    "authors": [
      "Thiviyan Thanapalasingam",
      "Emile van Krieken",
      "Peter Bloem",
      "Paul Groth"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.07873",
    "title": "Why Does Little Robustness Help? Understanding and Improving Adversarial  Transferability from Surrogate Training",
    "abstract": " Comments: Accepted by IEEE Symposium on Security and Privacy (Oakland) 2024; 21 pages, 11 figures, 13 tables ",
    "url": "https://arxiv.org/abs/2307.07873",
    "authors": [
      "Yechao Zhang",
      "Shengshan Hu",
      "Leo Yu Zhang",
      "Junyu Shi",
      "Minghui Li",
      "Xiaogeng Liu",
      "Wei Wan",
      "Hai Jin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.12676",
    "title": "Few-shot $\\mathbf{1/a}$ Anomalies Feedback : Damage Vision Mining  Opportunity and Embedding Feature Imbalance",
    "abstract": " Comments: 34 pages, 53 figures, 28 tables ",
    "url": "https://arxiv.org/abs/2307.12676",
    "authors": [
      "Takato Yasuno"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.13755",
    "title": "Training-based Model Refinement and Representation Disagreement for  Semi-Supervised Object Detection",
    "abstract": " Comments: Under review ",
    "url": "https://arxiv.org/abs/2307.13755",
    "authors": [
      "Seyed Mojtaba Marvasti-Zadeh",
      "Nilanjan Ray",
      "Nadir Erbilgin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.03312",
    "title": "Symmetry-Preserving Program Representations for Learning Code Semantics",
    "abstract": " Title: Symmetry-Preserving Program Representations for Learning Code Semantics ",
    "url": "https://arxiv.org/abs/2308.03312",
    "authors": [
      "Kexin Pei",
      "Weichen Li",
      "Qirui Jin",
      "Shuyang Liu",
      "Scott Geng",
      "Lorenzo Cavallaro",
      "Junfeng Yang",
      "Suman Jana"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2308.03676",
    "title": "A Tractable Handoff-aware Rate Outage Approximation with Applications to  THz-enabled Vehicular Network Optimization",
    "abstract": " Comments: This paper has been accepted in the IEEE Global Communications (GLOBECOM) 2023 conference ",
    "url": "https://arxiv.org/abs/2308.03676",
    "authors": [
      "Mohammad Amin Saeidi",
      "Haider Shoaib",
      "Hina Tabassum"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2308.05983",
    "title": "Face Encryption via Frequency-Restricted Identity-Agnostic Attacks",
    "abstract": " Comments: I noticed something missing in the article's description in subsection 3.2, so I'd like to undo it and re-finalize and describe it ",
    "url": "https://arxiv.org/abs/2308.05983",
    "authors": [
      "Xin Dong",
      "Rui Wang",
      "Siyuan Liang",
      "Aishan Liu",
      "Lihua Jing"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2308.06689",
    "title": "Estimator Meets Equilibrium Perspective: A Rectified Straight Through  Estimator for Binary Neural Networks Training",
    "abstract": " Comments: 10 pages, 6 figures. Accepted in ICCV 2023 ",
    "url": "https://arxiv.org/abs/2308.06689",
    "authors": [
      "Xiao-Ming Wu",
      "Dian Zheng",
      "Zuhao Liu",
      "Wei-Shi Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.08128",
    "title": "How to Mask in Error Correction Code Transformer: Systematic and Double  Masking",
    "abstract": " Comments: 8 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2308.08128",
    "authors": [
      "Seong-Joon Park",
      "Hee-Youl Kwak",
      "Sang-Hyo Kim",
      "Sunghwan Kim",
      "Yongjune Kim",
      "Jong-Seon No"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2308.08163",
    "title": "Characteristics of networks generated by kernel growing neural gas",
    "abstract": " Title: Characteristics of networks generated by kernel growing neural gas ",
    "url": "https://arxiv.org/abs/2308.08163",
    "authors": [
      "Kazuhisa Fujita"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2308.08253",
    "title": "Benchmarking Neural Network Generalization for Grammar Induction",
    "abstract": " Comments: 10 pages, 4 figures, 2 tables. Conference: Learning with Small Data 2023 ",
    "url": "https://arxiv.org/abs/2308.08253",
    "authors": [
      "Nur Lan",
      "Emmanuel Chemla",
      "Roni Katzir"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.08915",
    "title": "Beyond Sharing: Conflict-Aware Multivariate Time Series Anomaly  Detection",
    "abstract": " Comments: 11 pages, ESEC/FSE industry track 2023 ",
    "url": "https://arxiv.org/abs/2308.08915",
    "authors": [
      "Haotian Si",
      "Changhua Pei",
      "Zhihan Li",
      "Yadong Zhao",
      "Jingjing Li",
      "Haiming Zhang",
      "Zulong Diao",
      "Jianhui Li",
      "Gaogang Xie",
      "Dan Pei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.10370",
    "title": "cantnlp@LT-EDI-2023: Homophobia/Transphobia Detection in Social Media  Comments using Spatio-Temporally Retrained Language Models",
    "abstract": " Title: cantnlp@LT-EDI-2023: Homophobia/Transphobia Detection in Social Media  Comments using Spatio-Temporally Retrained Language Models ",
    "url": "https://arxiv.org/abs/2308.10370",
    "authors": [
      "Sidney G.-J. Wong",
      "Matthew Durward",
      "Benjamin Adams",
      "Jonathan Dunn"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2308.10892",
    "title": "Bayesian polynomial neural networks and polynomial neural ordinary  differential equations",
    "abstract": " Title: Bayesian polynomial neural networks and polynomial neural ordinary  differential equations ",
    "url": "https://arxiv.org/abs/2308.10892",
    "authors": [
      "Colby Fronk",
      "Jaewoong Yun",
      "Prashant Singh",
      "Linda Petzold"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2308.10966",
    "title": "Decentralized Multi-Robot Social Navigation in Constrained Environments  via Game-Theoretic Control Barrier Functions",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2306.08815 ",
    "url": "https://arxiv.org/abs/2308.10966",
    "authors": [
      "Rohan Chandra",
      "Vrushabh Zinage",
      "Efstathios Bakolas",
      "Joydeep Biswas",
      "Peter Stone"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2308.11490",
    "title": "Can Authorship Representation Learning Capture Stylistic Features?",
    "abstract": " Comments: appearing at TACL 2023 ",
    "url": "https://arxiv.org/abs/2308.11490",
    "authors": [
      "Andrew Wang",
      "Cristina Aggazzotti",
      "Rebecca Kotula",
      "Rafael Rivera Soto",
      "Marcus Bishop",
      "Nicholas Andrews"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.11681",
    "title": "VadCLIP: Adapting Vision-Language Models for Weakly Supervised Video  Anomaly Detection",
    "abstract": " Comments: Submitted ",
    "url": "https://arxiv.org/abs/2308.11681",
    "authors": [
      "Peng Wu",
      "Xuerong Zhou",
      "Guansong Pang",
      "Lingru Zhou",
      "Qingsen Yan",
      "Peng Wang",
      "Yanning Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2308.11898",
    "title": "Exploring the Optimization Objective of One-Class Classification for  Anomaly Detection",
    "abstract": " Comments: 15 paegs, 10 figures ",
    "url": "https://arxiv.org/abs/2308.11898",
    "authors": [
      "Han Gao",
      "Huiyuan Luo",
      "Fei Shen",
      "Zhengtao Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.12533",
    "title": "Pre-trained Model-based Automated Software Vulnerability Repair: How Far  are We?",
    "abstract": " Comments: Accepted to IEEE Transactions on Dependable and Secure Computing 2023 (TDSC'23) ",
    "url": "https://arxiv.org/abs/2308.12533",
    "authors": [
      "Quanjun Zhang",
      "Chunrong Fang",
      "Bowen Yu",
      "Weisong Sun",
      "Tongke Zhang",
      "Zhenyu Chen"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.12673",
    "title": "Masked Feature Modelling: Feature Masking for the Unsupervised  Pre-training of a Graph Attention Network Block for Bottom-up Video Event  Recognition",
    "abstract": " Comments: 8 pages ",
    "url": "https://arxiv.org/abs/2308.12673",
    "authors": [
      "Dimitrios Daskalakis",
      "Nikolaos Gkalelis",
      "Vasileios Mezaris"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2308.12950",
    "title": "Code Llama: Open Foundation Models for Code",
    "abstract": " Title: Code Llama: Open Foundation Models for Code ",
    "url": "https://arxiv.org/abs/2308.12950",
    "authors": [
      "Baptiste Rozière",
      "Jonas Gehring",
      "Fabian Gloeckle",
      "Sten Sootla",
      "Itai Gat",
      "Xiaoqing Ellen Tan",
      "Yossi Adi",
      "Jingyu Liu",
      "Tal Remez",
      "Jérémy Rapin",
      "Artyom Kozhevnikov",
      "Ivan Evtimov",
      "Joanna Bitton",
      "Manish Bhatt",
      "Cristian Canton Ferrer",
      "Aaron Grattafiori",
      "Wenhan Xiong",
      "Alexandre Défossez",
      "Jade Copet",
      "Faisal Azhar",
      "Hugo Touvron",
      "Louis Martin",
      "Nicolas Usunier",
      "Thomas Scialom",
      "Gabriel Synnaeve"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  }
]