[
  {
    "id": "arXiv:2208.03326",
    "title": "Variational Autoencoders for Anomaly Detection in Respiratory Sounds",
    "abstract": "This paper proposes a weakly-supervised machine learning-based approach aiming at a tool to alert patients about possible respiratory diseases. Various types of pathologies may affect the respiratory system, potentially leading to severe diseases and, in certain cases, death. In general, effective prevention practices are considered as major actors towards the improvement of the patient's health condition. The proposed method strives to realize an easily accessible tool for the automatic diagnosis of respiratory diseases. Specifically, the method leverages Variational Autoencoder architectures permitting the usage of training pipelines of limited complexity and relatively small-sized datasets. Importantly, it offers an accuracy of 57 %, which is in line with the existing strongly-supervised approaches. ",
    "url": "https://arxiv.org/abs/2208.03326",
    "authors": [
      "Michele Cozzatti",
      "Federico Simonetta",
      "Stavros Ntalampiras"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2208.03355",
    "title": "Blockchain in Dynamic Networks",
    "abstract": "We consider blockchain in dynamic networks. We define the Blockchain Decision Problem. It requires miners that maintain the blockchain to confirm whether a particular block is accepted. We establish the necessary conditions for the existence of a solution. We, however, prove that the solution, even under these necessary conditions is, in general, impossible. We then present two algorithms that solve the Blockchain Decision Problem under either the knowledge of the maximum source pool propagation time or the knowledge of the source pool membership. We evaluate the performance of the two algorithms. ",
    "url": "https://arxiv.org/abs/2208.03355",
    "authors": [
      "Rachel Bricker",
      "Mikhail Nesterenko",
      "Gokarna Sharma"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2208.03399",
    "title": "LCCDE: A Decision-Based Ensemble Framework for Intrusion Detection in  The Internet of Vehicles",
    "abstract": "Modern vehicles, including autonomous vehicles and connected vehicles, have adopted an increasing variety of functionalities through connections and communications with other vehicles, smart devices, and infrastructures. However, the growing connectivity of the Internet of Vehicles (IoV) also increases the vulnerabilities to network attacks. To protect IoV systems against cyber threats, Intrusion Detection Systems (IDSs) that can identify malicious cyber-attacks have been developed using Machine Learning (ML) approaches. To accurately detect various types of attacks in IoV networks, we propose a novel ensemble IDS framework named Leader Class and Confidence Decision Ensemble (LCCDE). It is constructed by determining the best-performing ML model among three advanced ML algorithms (XGBoost, LightGBM, and CatBoost) for every class or type of attack. The class leader models with their prediction confidence values are then utilized to make accurate decisions regarding the detection of various types of cyber-attacks. Experiments on two public IoV security datasets (Car-Hacking and CICIDS2017 datasets) demonstrate the effectiveness of the proposed LCCDE for intrusion detection on both intra-vehicle and external networks. ",
    "url": "https://arxiv.org/abs/2208.03399",
    "authors": [
      "Li Yang",
      "Abdallah Shami",
      "Gary Stevens",
      "Stephen De Rusett"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2208.03403",
    "title": "Slice-level Detection of Intracranial Hemorrhage on CT Using Deep  Descriptors of Adjacent Slices",
    "abstract": "The rapid development in representation learning techniques and the availability of large-scale medical imaging data have to a rapid increase in the use of machine learning in the 3D medical image analysis. In particular, deep convolutional neural networks (D-CNNs) have been key players and were adopted by the medical imaging community to assist clinicians and medical experts in disease diagnosis. However, training deep neural networks such as D-CNN on high-resolution 3D volumes of Computed Tomography (CT) scans for diagnostic tasks poses formidable computational challenges. This raises the need of developing deep learning-based approaches that are robust in learning representations in 2D images, instead 3D scans. In this paper, we propose a new strategy to train \\emph{slice-level} classifiers on CT scans based on the descriptors of the adjacent slices along the axis. In particular, each of which is extracted through a convolutional neural network (CNN). This method is applicable to CT datasets with per-slice labels such as the RSNA Intracranial Hemorrhage (ICH) dataset, which aims to predict the presence of ICH and classify it into 5 different sub-types. We obtain a single model in the top 4\\% best-performing solutions of the RSNA ICH challenge, where model ensembles are allowed. Experiments also show that the proposed method significantly outperforms the baseline model on CQ500. The proposed method is general and can be applied for other 3D medical diagnosis tasks such as MRI imaging. To encourage new advances in the field, we will make our codes and pre-trained model available upon acceptance of the paper. ",
    "url": "https://arxiv.org/abs/2208.03403",
    "authors": [
      "Dat T. Ngo",
      "Hieu H. Pham",
      "Thao T.B. Nguyen",
      "Hieu T. Nguyen",
      "Dung B. Nguyen",
      "Ha Q. Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03407",
    "title": "An Overview of Structural Coverage Metrics for Testing Neural Networks",
    "abstract": "Deep neural network (DNN) models, including those used in safety-critical domains, need to be thoroughly tested to ensure that they can reliably perform well in different scenarios. In this article, we provide an overview of structural coverage metrics for testing DNN models, including neuron coverage (NC), k-multisection neuron coverage (kMNC), top-k neuron coverage (TKNC), neuron boundary coverage (NBC), strong neuron activation coverage (SNAC) and modified condition/decision coverage (MC/DC). We evaluate the metrics on realistic DNN models used for perception tasks (including LeNet-1, LeNet-4, LeNet-5, and ResNet20) as well as on networks used in autonomy (TaxiNet). We also provide a tool, DNNCov, which can measure the testing coverage for all these metrics. DNNCov outputs an informative coverage report to enable researchers and practitioners to assess the adequacy of DNN testing, compare different coverage measures, and to more conveniently inspect the model's internals during testing. ",
    "url": "https://arxiv.org/abs/2208.03407",
    "authors": [
      "Muhammad Usman",
      "Youcheng Sun",
      "Divya Gopinath",
      "Rishi Dange",
      "Luca Manolache",
      "Corina S. Pasareanu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03408",
    "title": "A novel deep learning-based approach for sleep apnea detection using  single-lead ECG signals",
    "abstract": "Sleep apnea (SA) is a type of sleep disorder characterized by snoring and chronic sleeplessness, which can lead to serious conditions such as high blood pressure, heart failure, and cardiomyopathy (enlargement of the muscle tissue of the heart). The electrocardiogram (ECG) plays a critical role in identifying SA since it might reveal abnormal cardiac activity. Recent research on ECG-based SA detection has focused on feature engineering techniques that extract specific characteristics from multiple-lead ECG signals and use them as classification model inputs. In this study, a novel method of feature extraction based on the detection of S peaks is proposed to enhance the detection of adjacent SA segments using a single-lead ECG. In particular, ECG features collected from a single lead (V2) are used to identify SA episodes. On the extracted features, a CNN model is trained to detect SA. Experimental results demonstrate that the proposed method detects SA from single-lead ECG data is more accurate than existing state-of-the-art methods, with 91.13% classification accuracy, 92.58% sensitivity, and 88.75% specificity. Moreover, the further usage of features associated with the S peaks enhances the classification accuracy by 0.85%. Our findings indicate that the proposed machine learning system has the potential to be an effective method for detecting SA episodes. ",
    "url": "https://arxiv.org/abs/2208.03408",
    "authors": [
      "Anh-Tu Nguyen",
      "Thao Nguyen",
      "Huy-Khiem Le",
      "Huy-Hieu Pham",
      "Cuong Do"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03411",
    "title": "Expanded-clique graphs and the domination problem",
    "abstract": "Given a graph $G$ and a function $f : V(G) \\rightarrow \\mathbb{N}$ such that $f(v_i) \\ge d(v_i)$ for every $v_i \\in V(G)$, where $d(v_i)$ is the degree of $v_i$, the expanded-clique graph $H$ of $(G,f)$ exists and is defined as follows: for every $v_i \\in V(G)$, there is a set $V_i \\subseteq V(H)$ with $f(v_i)$ vertices forming a clique, and $d_G(v_i)$ vertices of $V_i$ have a neighbor outside $V_i$, one in each $V_j$ such that $v_j \\in N(v_i)$. In this work, we present two characterizations of the expanded-clique graphs. One of them leads to a linear-time algorithm of recognition. We show that given an expanded-graph $H$, the domination number of $H$ plus the 2-independence number of the root $G$ of $H$ is equal to $|V(G)|$. We also show that the domination problem is \\NP-complete for some subclasses of the expanded-clique graphs. ",
    "url": "https://arxiv.org/abs/2208.03411",
    "authors": [
      "Mitre C. Dourado",
      "Rodolfo A. Oliveira",
      "Vitor Ponciano",
      "Alessandra B. Queiróz",
      "Rômulo L. O. Silva"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2208.03415",
    "title": "Short Duration Traffic Flow Prediction Using Kalman Filtering",
    "abstract": "The research examined predicting short-duration traffic flow counts with the Kalman filtering technique (KFT), a computational filtering method. Short-term traffic prediction is an important tool for operation in traffic management and transportation system. The short-term traffic flow value results can be used for travel time estimation by route guidance and advanced traveler information systems. Though the KFT has been tested for homogeneous traffic, its efficiency in heterogeneous traffic has yet to be investigated. The research was conducted on Mirpur Road in Dhaka, near the Sobhanbagh Mosque. The stream contains a heterogeneous mix of traffic, which implies uncertainty in prediction. The propositioned method is executed in Python using the pykalman library. The library is mostly used in advanced database modeling in the KFT framework, which addresses uncertainty. The data was derived from a three-hour traffic count of the vehicle. According to the Geometric Design Standards Manual published by Roads and Highways Division (RHD), Bangladesh in 2005, the heterogeneous traffic flow value was translated into an equivalent passenger car unit (PCU). The PCU obtained from five-minute aggregation was then utilized as the suggested model's dataset. The propositioned model has a mean absolute percent error (MAPE) of 14.62, indicating that the KFT model can forecast reasonably well. The root mean square percent error (RMSPE) shows an 18.73% accuracy which is less than 25%; hence the model is acceptable. The developed model has an R2 value of 0.879, indicating that it can explain 87.9 percent of the variability in the dataset. If the data were collected over a more extended period of time, the R2 value could be closer to 1.0. ",
    "url": "https://arxiv.org/abs/2208.03415",
    "authors": [
      "Khondhaker Al Momin",
      "Saurav Barua",
      "Md. Shahreer Jamil",
      "Omar Faruqe Hamim"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.03437",
    "title": "Exploring the Effects of Data Augmentation for Drivable Area  Segmentation",
    "abstract": "The real-time segmentation of drivable areas plays a vital role in accomplishing autonomous perception in cars. Recently there have been some rapid strides in the development of image segmentation models using deep learning. However, most of the advancements have been made in model architecture design. In solving any supervised deep learning problem related to segmentation, the success of the model that one builds depends upon the amount and quality of input training data we use for that model. This data should contain well-annotated varied images for better working of the segmentation model. Issues like this pertaining to annotations in a dataset can lead the model to conclude with overwhelming Type I and II errors in testing and validation, causing malicious issues when trying to tackle real world problems. To address this problem and to make our model more accurate, dynamic, and robust, data augmentation comes into usage as it helps in expanding our sample training data and making it better and more diversified overall. Hence, in our study, we focus on investigating the benefits of data augmentation by analyzing pre-existing image datasets and performing augmentations accordingly. Our results show that the performance and robustness of existing state of the art (or SOTA) models can be increased dramatically without any increase in model complexity or inference time. The augmentations decided on and used in this paper were decided only after thorough research of several other augmentation methodologies and strategies and their corresponding effects that are in widespread usage today. All our results are being reported on the widely used Cityscapes Dataset. ",
    "url": "https://arxiv.org/abs/2208.03437",
    "authors": [
      "Srinjoy Bhuiya",
      "Ayushman Kumar",
      "Sankalok Sen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.03445",
    "title": "Detecting Algorithmically Generated Domains Using a GCNN-LSTM Hybrid  Neural Network",
    "abstract": "Domain generation algorithm (DGA) is used by botnets to build a stealthy command and control (C&C) communication channel between the C&C server and the bots. A DGA can periodically produce a large number of pseudo-random algorithmically generated domains (AGDs). AGD detection algorithms provide a lightweight, promising solution in response to the existing DGA techniques. In this paper, a GCNN (gated convolutional neural network)-LSTM (long short-term memory) Hybrid Neural Network (GLHNN) for AGD detection is proposed. In GLHNN, GCNN is applied to extract the informative features from domain names on top of LSTM which further processes the feature sequence. GLHNN is experimentally validated using representative AGDs covering six classes of DGAs. GLHNN is compared with the state-of-the-art detection models and demonstrates the best overall detection performance among these tested models. ",
    "url": "https://arxiv.org/abs/2208.03445",
    "authors": [
      "Zheng Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03451",
    "title": "Fast detection of specific fragments against a set of sequences",
    "abstract": "We design alignment-free techniques for comparing a sequence or word, called a target, against a set of words, called a reference. A target-specific factor of a target $T$ against a reference $R$ is a factor $w$ of a word in $T$ which is not a factor of a word of $R$ and such that any proper factor of $w$ is a factor of a word of $R$. We first address the computation of the set of target-specific factors of a target $T$ against a reference $R$, where $T$ and $R$ are finite sets of sequences. The result is the construction of an automaton accepting the set of all considered target-specific factors. The construction algorithm runs in linear time according to the size of $T\\cup R$. The second result consists in the design of an algorithm to compute all the occurrences in a single sequence $T$ of its target-specific factors against a reference $R$. The algorithm runs in real-time on the target sequence, independently of the number of occurrences of target-specific factors. ",
    "url": "https://arxiv.org/abs/2208.03451",
    "authors": [
      "Marie-Pierre Béal",
      "Maxime Crochemore"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2208.03454",
    "title": "LFGCF: Light Folksonomy Graph Collaborative Filtering for Tag-Aware  Recommendation",
    "abstract": "Tag-aware recommendation is a task of predicting a personalized list of items for a user by their tagging behaviors. It is crucial for many applications with tagging capabilities like last.fm or movielens. Recently, many efforts have been devoted to improving Tag-aware recommendation systems (TRS) with Graph Convolutional Networks (GCN), which has become new state-of-the-art for the general recommendation. However, some solutions are directly inherited from GCN without justifications, which is difficult to alleviate the sparsity, ambiguity, and redundancy issues introduced by tags, thus adding to difficulties of training and degrading recommendation performance. In this work, we aim to simplify the design of GCN to make it more concise for TRS. We propose a novel tag-aware recommendation model named Light Folksonomy Graph Collaborative Filtering (LFGCF), which only includes the essential GCN components. Specifically, LFGCF first constructs Folksonomy Graphs from the records of user assigning tags and item getting tagged. Then we leverage the simple design of aggregation to learn the high-order representations on Folksonomy Graphs and use the weighted sum of the embeddings learned at several layers for information updating. We share tags embeddings to bridge the information gap between users and items. Besides, a regularization function named TransRT is proposed to better depict user preferences and item features. Extensive hyperparameters experiments and ablation studies on three real-world datasets show that LFGCF uses fewer parameters and significantly outperforms most baselines for the tag-aware top-N recommendations. ",
    "url": "https://arxiv.org/abs/2208.03454",
    "authors": [
      "Yin Zhang",
      "Can Xu",
      "XianJun Wu",
      "Yan Zhang",
      "LiGang Dong",
      "Weigang Wang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2208.03466",
    "title": "Preventing or Mitigating Adversarial Supply Chain Attacks; a legal  analysis",
    "abstract": "The world is currently strongly connected through both the internet at large, but also the very supply chains which provide everything from food to infrastructure and technology. The supply chains are themselves vulnerable to adversarial attacks, both in a digital and physical sense, which can disrupt or at worst destroy them. In this paper, we take a look at two examples of such successful attacks and consider what their consequences may be going forward, and analyse how EU and national law can prevent these attacks or otherwise punish companies which do not try to mitigate them at all possible costs. We find that the current types of national regulation are not technology specific enough, and cannot force or otherwise mandate the correct parties who could play the biggest role in preventing supply chain attacks to do everything in their power to mitigate them. But, current EU law is on the right path, and further vigilance may be what is necessary to consider these large threats, as national law tends to fail at properly regulating companies when it comes to cybersecurity. ",
    "url": "https://arxiv.org/abs/2208.03466",
    "authors": [
      "Kaspar Rosager Ludvigsen",
      "Shishir Nagaraja",
      "Angela Daly"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.03467",
    "title": "Real-time Neural Dense Elevation Mapping for Urban Terrain with  Uncertainty Estimations",
    "abstract": "Having good knowledge of terrain information is essential for improving the performance of various downstream tasks on complex terrains, especially for the locomotion and navigation of legged robots. We present a novel framework for neural urban terrain reconstruction with uncertainty estimations. It generates dense robot-centric elevation maps online from sparse LiDAR observations. We design a novel pre-processing and point features representation approach that ensures high robustness and computational efficiency when integrating multiple point cloud frames. A Bayesian-GAN model then recovers the detailed terrain structures while simultaneously providing the pixel-wise reconstruction uncertainty. We evaluate the proposed pipeline through extensive simulation and real-world experiments. It demonstrates efficient terrain reconstruction with high quality and real-time performance on a mobile platform, which further benefits the downstream tasks of legged robots. (See https://kin-zhang.github.io/ndem/ for more details.) ",
    "url": "https://arxiv.org/abs/2208.03467",
    "authors": [
      "Bowen Yang",
      "Qingwen Zhang",
      "Ruoyu Geng",
      "Lujia Wang",
      "Ming Liu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2208.03471",
    "title": "Oversquashing in GNNs through the lens of information contraction and  graph expansion",
    "abstract": "The quality of signal propagation in message-passing graph neural networks (GNNs) strongly influences their expressivity as has been observed in recent works. In particular, for prediction tasks relying on long-range interactions, recursive aggregation of node features can lead to an undesired phenomenon called \"oversquashing\". We present a framework for analyzing oversquashing based on information contraction. Our analysis is guided by a model of reliable computation due to von Neumann that lends a new insight into oversquashing as signal quenching in noisy computation graphs. Building on this, we propose a graph rewiring algorithm aimed at alleviating oversquashing. Our algorithm employs a random local edge flip primitive motivated by an expander graph construction. We compare the spectral expansion properties of our algorithm with that of an existing curvature-based non-local rewiring strategy. Synthetic experiments show that while our algorithm in general has a slower rate of expansion, it is overall computationally cheaper, preserves the node degrees exactly and never disconnects the graph. ",
    "url": "https://arxiv.org/abs/2208.03471",
    "authors": [
      "Pradeep Kr. Banerjee",
      "Kedar Karhadkar",
      "Yu Guang Wang",
      "Uri Alon",
      "Guido Montúfar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2208.03486",
    "title": "HaloAE: An HaloNet based Local Transformer Auto-Encoder for Anomaly  Detection and Localization",
    "abstract": "Unsupervised anomaly detection and localization is a crucial task as it is impossible to collect and label all possible anomalies. Many studies have emphasized the importance of integrating local and global information to achieve accurate segmentation of anomalies. To this end, there has been a growing interest in Transformer, which allows modeling long-range content interactions. However, global interactions through self attention are generally too expensive for most image scales. In this study, we introduce HaloAE, the first auto-encoder based on a local 2D version of Transformer with HaloNet. With HaloAE, we have created a hybrid model that combines convolution and local 2D block-wise self-attention layers and jointly performs anomaly detection and segmentation through a single model. We achieved competitive results on the MVTec dataset, suggesting that vision models incorporating Transformer could benefit from a local computation of the self-attention operation, and pave the way for other applications. ",
    "url": "https://arxiv.org/abs/2208.03486",
    "authors": [
      "E. Mathian",
      "H. Liu",
      "L. Fernandez-Cuesta",
      "D. Samaras",
      "M. Foll",
      "L. Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.03497",
    "title": "Contrastive Positive Mining for Unsupervised 3D Action Representation  Learning",
    "abstract": "Recent contrastive based 3D action representation learning has made great progress. However, the strict positive/negative constraint is yet to be relaxed and the use of non-self positive is yet to be explored. In this paper, a Contrastive Positive Mining (CPM) framework is proposed for unsupervised skeleton 3D action representation learning. The CPM identifies non-self positives in a contextual queue to boost learning. Specifically, the siamese encoders are adopted and trained to match the similarity distributions of the augmented instances in reference to all instances in the contextual queue. By identifying the non-self positive instances in the queue, a positive-enhanced learning strategy is proposed to leverage the knowledge of mined positives to boost the robustness of the learned latent space against intra-class and inter-class diversity. Experimental results have shown that the proposed CPM is effective and outperforms the existing state-of-the-art unsupervised methods on the challenging NTU and PKU-MMD datasets. ",
    "url": "https://arxiv.org/abs/2208.03497",
    "authors": [
      "Haoyuan Zhang",
      "Yonghong Hou",
      "Wenjing Zhang",
      "Wanqing Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2208.03514",
    "title": "Semiconductor Defect Detection by Hybrid Classical-Quantum Deep Learning",
    "abstract": "With the rapid development of artificial intelligence and autonomous driving technology, the demand for semiconductors is projected to rise substantially. However, the massive expansion of semiconductor manufacturing and the development of new technology will bring many defect wafers. If these defect wafers have not been correctly inspected, the ineffective semiconductor processing on these defect wafers will cause additional impact to our environment, such as excessive carbon dioxide emission and energy consumption. In this paper, we utilize the information processing advantages of quantum computing to promote the defect learning defect review (DLDR). We propose a classical-quantum hybrid algorithm for deep learning on near-term quantum processors. By tuning parameters implemented on it, quantum circuit driven by our framework learns a given DLDR task, include of wafer defect map classification, defect pattern classification, and hotspot detection. In addition, we explore parametrized quantum circuits with different expressibility and entangling capacities. These results can be used to build a future roadmap to develop circuit-based quantum deep learning for semiconductor defect detection. ",
    "url": "https://arxiv.org/abs/2208.03514",
    "authors": [
      "YuanFu Yang",
      "Min Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03523",
    "title": "Graph Pooling with Maximum-Weight $k$-Independent Sets",
    "abstract": "Graph reductions are fundamental when dealing with large scale networks and relational data. They allow to downsize tasks of high computational impact by solving them in coarsened structures. At the same time, graph reductions play the role of pooling layers in graph neural networks, to extract multi-resolution representations from structures. In these contexts, the ability of the reduction mechanism to preserve distance relationships and topological properties appears fundamental, along with a scalability enabling its application to real-world sized problems. In this paper, we introduce a graph coarsening mechanism based on the graph-theoretic concept of maximum-weight $k$-independent sets, providing a greedy algorithm that allows efficient parallel implementation on GPUs. Our method is the first graph-structured counterpart of controllable equispaced coarsening mechanisms in regular data (images, sequences). We prove theoretical guarantees for distortion bounds on path lengths, as well as the ability to preserve key topological properties in the coarsened graphs. We leverage these concepts to define a graph pooling mechanism that we empirically assess in graph classification tasks, showing that it compares favorably against pooling methods in literature. ",
    "url": "https://arxiv.org/abs/2208.03523",
    "authors": [
      "Davide Bacciu",
      "Alessio Conte",
      "Francesco Landolfi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03526",
    "title": "Multiplex-detection Based Multiple Instance Learning Network for Whole  Slide Image Classification",
    "abstract": "Multiple instance learning (MIL) is a powerful approach to classify whole slide images (WSIs) for diagnostic pathology. A fundamental challenge of MIL on WSI classification is to discover the \\textit{critical instances} that trigger the bag label. However, previous methods are primarily designed under the independent and identical distribution hypothesis (\\textit{i.i.d}), ignoring either the correlations between instances or heterogeneity of tumours. In this paper, we propose a novel multiplex-detection-based multiple instance learning (MDMIL) to tackle the issues above. Specifically, MDMIL is constructed by the internal query generation module (IQGM) and the multiplex detection module (MDM) and assisted by the memory-based contrastive loss during training. Firstly, IQGM gives the probability of instances and generates the internal query (IQ) for the subsequent MDM by aggregating highly reliable features after the distribution analysis. Secondly, the multiplex-detection cross-attention (MDCA) and multi-head self-attention (MHSA) in MDM cooperate to generate the final representations for the WSI. In this process, the IQ and trainable variational query (VQ) successfully build up the connections between instances and significantly improve the model's robustness toward heterogeneous tumours. At last, to further enforce constraints in the feature space and stabilize the training process, we adopt a memory-based contrastive loss, which is practicable for WSI classification even with a single sample as input in each iteration. We conduct experiments on three computational pathology datasets, e.g., CAMELYON16, TCGA-NSCLC, and TCGA-RCC datasets. The superior accuracy and AUC demonstrate the superiority of our proposed MDMIL over other state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2208.03526",
    "authors": [
      "Zhikang Wang",
      "Yue Bi",
      "Tong Pan",
      "Chris Bain",
      "Richard Bassed",
      "Seiya Imoto",
      "Jianhua Yao",
      "Jiangning Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03543",
    "title": "MonoViT: Self-Supervised Monocular Depth Estimation with a Vision  Transformer",
    "abstract": "Self-supervised monocular depth estimation is an attractive solution that does not require hard-to-source depth labels for training. Convolutional neural networks (CNNs) have recently achieved great success in this task. However, their limited receptive field constrains existing network architectures to reason only locally, dampening the effectiveness of the self-supervised paradigm. In the light of the recent successes achieved by Vision Transformers (ViTs), we propose MonoViT, a brand-new framework combining the global reasoning enabled by ViT models with the flexibility of self-supervised monocular depth estimation. By combining plain convolutions with Transformer blocks, our model can reason locally and globally, yielding depth prediction at a higher level of detail and accuracy, allowing MonoViT to achieve state-of-the-art performance on the established KITTI dataset. Moreover, MonoViT proves its superior generalization capacities on other datasets such as Make3D and DrivingStereo. ",
    "url": "https://arxiv.org/abs/2208.03543",
    "authors": [
      "Chaoqiang Zhao",
      "Youmin Zhang",
      "Matteo Poggi",
      "Fabio Tosi",
      "Xianda Guo",
      "Zheng Zhu",
      "Guan Huang",
      "Yang Tang",
      "Stefano Mattoccia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03559",
    "title": "Triple Sparsification of Graph Convolutional Networks without  Sacrificing the Accuracy",
    "abstract": "Graph Neural Networks (GNNs) are widely used to perform different machine learning tasks on graphs. As the size of the graphs grows, and the GNNs get deeper, training and inference time become costly in addition to the memory requirement. Thus, without sacrificing accuracy, graph sparsification, or model compression becomes a viable approach for graph learning tasks. A few existing techniques only study the sparsification of graphs and GNN models. In this paper, we develop a SparseGCN pipeline to study all possible sparsification in GNN. We provide a theoretical analysis and empirically show that it can add up to 11.6\\% additional sparsity to the embedding matrix without sacrificing the accuracy of the commonly used benchmark graph datasets. ",
    "url": "https://arxiv.org/abs/2208.03559",
    "authors": [
      "Md. Khaledur Rahman",
      "Ariful Azad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2208.03565",
    "title": "Analysis of Temporal Robustness in Massive Machine Type Communications",
    "abstract": "The evolution of fifth generation (5G) networks needs to support the latest use cases, which demand robust network connectivity for the collaborative performance of the network agents, like multi-robot systems and vehicle to anything (V2X) communication. Unfortunately, the user device's limited communication range and battery constraint confirm the unfitness of known robustness metrics suggested for fixed networks, when applied to time-switching communication graphs. Furthermore, the calculation of most of the existing robustness metrics involves non-deterministic polynomial-time complexity, and hence are best-fitted only for small networks. Despite a large volume of works, the complete analysis of a $\\textit{low-complexity}$ temporal robustness metric for a communication network is absent in the literature, and the present work aims to fill this gap. More in detail, our work provides a stochastic analysis of network robustness for a massive machine type communication (mMTC) network. The numerical investigation corroborates the exactness of the proposed analytical framework for temporal robustness metric. Along with studying the impact on network robustness of various system parameters, such as cluster head (CH) probability, power threshold value, network size, and node failure probability, we justify the observed trend of numerical results probabilistically. ",
    "url": "https://arxiv.org/abs/2208.03565",
    "authors": [
      "Debjani Goswami",
      "Merim Dzaferagic",
      "Harun Siljak",
      "Suvra Sekhar Das",
      "Nicola Marchetti"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2208.03566",
    "title": "Towards Robust Deep Learning using Entropic Losses",
    "abstract": "Current deep learning solutions are well known for not informing whether they can reliably classify an example during inference. One of the most effective ways to build more reliable deep learning solutions is to improve their performance in the so-called out-of-distribution detection task, which essentially consists of \"know that you do not know\" or \"know the unknown\". In other words, out-of-distribution detection capable systems may reject performing a nonsense classification when submitted to instances of classes on which the neural network was not trained. This thesis tackles the defiant out-of-distribution detection task by proposing novel loss functions and detection scores. Uncertainty estimation is also a crucial auxiliary task in building more robust deep learning systems. Therefore, we also deal with this robustness-related task, which evaluates how realistic the probabilities presented by the deep neural network are. To demonstrate the effectiveness of our approach, in addition to a substantial set of experiments, which includes state-of-the-art results, we use arguments based on the principle of maximum entropy to establish the theoretical foundation of the proposed approaches. Unlike most current methods, our losses and scores are seamless and principled solutions that produce accurate predictions in addition to fast and efficient inference. Moreover, our approaches can be incorporated into current and future projects simply by replacing the loss used to train the deep neural network and computing a rapid score for detection. ",
    "url": "https://arxiv.org/abs/2208.03566",
    "authors": [
      "David Macêdo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03567",
    "title": "On the Fundamental Limits of Formally (Dis)Proving Robustness in  Proof-of-Learning",
    "abstract": "Proof-of-learning (PoL) proposes a model owner use machine learning training checkpoints to establish a proof of having expended the necessary compute for training. The authors of PoL forego cryptographic approaches and trade rigorous security guarantees for scalability to deep learning by being applicable to stochastic gradient descent and adaptive variants. This lack of formal analysis leaves the possibility that an attacker may be able to spoof a proof for a model they did not train. We contribute a formal analysis of why the PoL protocol cannot be formally (dis)proven to be robust against spoofing adversaries. To do so, we disentangle the two roles of proof verification in PoL: (a) efficiently determining if a proof is a valid gradient descent trajectory, and (b) establishing precedence by making it more expensive to craft a proof after training completes (i.e., spoofing). We show that efficient verification results in a tradeoff between accepting legitimate proofs and rejecting invalid proofs because deep learning necessarily involves noise. Without a precise analytical model for how this noise affects training, we cannot formally guarantee if a PoL verification algorithm is robust. Then, we demonstrate that establishing precedence robustly also reduces to an open problem in learning theory: spoofing a PoL post hoc training is akin to finding different trajectories with the same endpoint in non-convex learning. Yet, we do not rigorously know if priori knowledge of the final model weights helps discover such trajectories. We conclude that, until the aforementioned open problems are addressed, relying more heavily on cryptography is likely needed to formulate a new class of PoL protocols with formal robustness guarantees. In particular, this will help with establishing precedence. As a by-product of insights from our analysis, we also demonstrate two novel attacks against PoL. ",
    "url": "https://arxiv.org/abs/2208.03567",
    "authors": [
      "Congyu Fang",
      "Hengrui Jia",
      "Anvith Thudi",
      "Mohammad Yaghini",
      "Christopher A. Choquette-Choo",
      "Natalie Dullerud",
      "Varun Chandrasekaran",
      "Nicolas Papernot"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.03571",
    "title": "Transformer-based assignment decision network for multiple object  tracking",
    "abstract": "Data association is a crucial component for any multiple object tracking (MOT) method that follows the tracking-by-detection paradigm. To generate complete trajectories such methods employ a data association process to establish assignments between detections and existing targets during each timestep. Recent data association approaches try to solve a multi-dimensional linear assignment task or a network flow minimization problem or either tackle it via multiple hypotheses tracking. However, during inference an optimization step that computes optimal assignments is required for every sequence frame adding significant computational complexity in any given solution. To this end, in the context of this work we introduce Transformer-based Assignment Decision Network (TADN) that tackles data association without the need of any explicit optimization during inference. In particular, TADN can directly infer assignment pairs between detections and active targets in a single forward pass of the network. We have integrated TADN in a rather simple MOT framework, we designed a novel training strategy for efficient end-to-end training and demonstrate the high potential of our approach for online visual tracking-by-detection MOT on two popular benchmarks, i.e. MOT17 and UA-DETRAC. Our proposed approach outperforms the state-of-the-art in most evaluation metrics despite its simple nature as a tracker which lacks significant auxiliary components such as occlusion handling or re-identification. The implementation of our method is publicly available at https://github.com/psaltaath/tadn-mot. ",
    "url": "https://arxiv.org/abs/2208.03571",
    "authors": [
      "Athena Psalta",
      "Vasileios Tsironis",
      "Konstantinos Karantzalos"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.03578",
    "title": "Generalizability Analysis of Graph-based Trajectory Predictor with  Vectorized Representation",
    "abstract": "Trajectory prediction is one of the essential tasks for autonomous vehicles. Recent progress in machine learning gave birth to a series of advanced trajectory prediction algorithms. Lately, the effectiveness of using graph neural networks (GNNs) with vectorized representations for trajectory prediction has been demonstrated by many researchers. Nonetheless, these algorithms either pay little attention to models' generalizability across various scenarios or simply assume training and test data follow similar statistics. In fact, when test scenarios are unseen or Out-of-Distribution (OOD), the resulting train-test domain shift usually leads to significant degradation in prediction performance, which will impact downstream modules and eventually lead to severe accidents. Therefore, it is of great importance to thoroughly investigate the prediction models in terms of their generalizability, which can not only help identify their weaknesses but also provide insights on how to improve these models. This paper proposes a generalizability analysis framework using feature attribution methods to help interpret black-box models. For the case study, we provide an in-depth generalizability analysis of one of the state-of-the-art graph-based trajectory predictors that utilize vectorized representation. Results show significant performance degradation due to domain shift, and feature attribution provides insights to identify potential causes of these problems. Finally, we conclude the common prediction challenges and how weighting biases induced by the training process can deteriorate the accuracy. ",
    "url": "https://arxiv.org/abs/2208.03578",
    "authors": [
      "Juanwu Lu",
      "Wei Zhan",
      "Masayoshi Tomizuka",
      "Yeping Hu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03581",
    "title": "Improved Pancreatic Tumor Detection by Utilizing Clinically-Relevant  Secondary Features",
    "abstract": "Pancreatic cancer is one of the global leading causes of cancer-related deaths. Despite the success of Deep Learning in computer-aided diagnosis and detection (CAD) methods, little attention has been paid to the detection of Pancreatic Cancer. We propose a method for detecting pancreatic tumor that utilizes clinically-relevant features in the surrounding anatomical structures, thereby better aiming to exploit the radiologist's knowledge compared to other, conventional deep learning approaches. To this end, we collect a new dataset consisting of 99 cases with pancreatic ductal adenocarcinoma (PDAC) and 97 control cases without any pancreatic tumor. Due to the growth pattern of pancreatic cancer, the tumor may not be always visible as a hypodense lesion, therefore experts refer to the visibility of secondary external features that may indicate the presence of the tumor. We propose a method based on a U-Net-like Deep CNN that exploits the following external secondary features: the pancreatic duct, common bile duct and the pancreas, along with a processed CT scan. Using these features, the model segments the pancreatic tumor if it is present. This segmentation for classification and localization approach achieves a performance of 99% sensitivity (one case missed) and 99% specificity, which realizes a 5% increase in sensitivity over the previous state-of-the-art method. The model additionally provides location information with reasonable accuracy and a shorter inference time compared to previous PDAC detection methods. These results offer a significant performance improvement and highlight the importance of incorporating the knowledge of the clinical expert when developing novel CAD methods. ",
    "url": "https://arxiv.org/abs/2208.03581",
    "authors": [
      "Christiaan G.A. Viviers",
      "Mark Ramaekers",
      "Peter H.N. de With",
      "Dimitrios Mavroeidis",
      "Joost Nederend",
      "Misha Luyer",
      "Fons van der Sommen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03608",
    "title": "Shap-CAM: Visual Explanations for Convolutional Neural Networks based on  Shapley Value",
    "abstract": "Explaining deep convolutional neural networks has been recently drawing increasing attention since it helps to understand the networks' internal operations and why they make certain decisions. Saliency maps, which emphasize salient regions largely connected to the network's decision-making, are one of the most common ways for visualizing and analyzing deep networks in the computer vision community. However, saliency maps generated by existing methods cannot represent authentic information in images due to the unproven proposals about the weights of activation maps which lack solid theoretical foundation and fail to consider the relations between each pixel. In this paper, we develop a novel post-hoc visual explanation method called Shap-CAM based on class activation mapping. Unlike previous gradient-based approaches, Shap-CAM gets rid of the dependence on gradients by obtaining the importance of each pixel through Shapley value. We demonstrate that Shap-CAM achieves better visual performance and fairness for interpreting the decision making process. Our approach outperforms previous methods on both recognition and localization tasks. ",
    "url": "https://arxiv.org/abs/2208.03608",
    "authors": [
      "Quan Zheng",
      "Ziwei Wang",
      "Jie Zhou",
      "Jiwen Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2208.03610",
    "title": "Blackbox Attacks via Surrogate Ensemble Search",
    "abstract": "Blackbox adversarial attacks can be categorized into transfer- and query-based attacks. Transfer methods do not require any feedback from the victim model, but provide lower success rates compared to query-based methods. Query attacks often require a large number of queries for success. To achieve the best of both approaches, recent efforts have tried to combine them, but still require hundreds of queries to achieve high success rates (especially for targeted attacks). In this paper, we propose a novel method for blackbox attacks via surrogate ensemble search (BASES) that can generate highly successful blackbox attacks using an extremely small number of queries. We first define a perturbation machine that generates a perturbed image by minimizing a weighted loss function over a fixed set of surrogate models. To generate an attack for a given victim model, we search over the weights in the loss function using queries generated by the perturbation machine. Since the dimension of the search space is small (same as the number of surrogate models), the search requires a small number of queries. We demonstrate that our proposed method achieves better success rate with at least 30x fewer queries compared to state-of-the-art methods on different image classifiers trained with ImageNet (including VGG-19, DenseNet-121, and ResNext-50). In particular, our method requires as few as 3 queries per image (on average) to achieve more than a 90% success rate for targeted attacks and 1-2 queries per image for over a 99% success rate for non-targeted attacks. Our method is also effective on Google Cloud Vision API and achieved a 91% non-targeted attack success rate with 2.9 queries per image. We also show that the perturbations generated by our proposed method are highly transferable and can be adopted for hard-label blackbox attacks. ",
    "url": "https://arxiv.org/abs/2208.03610",
    "authors": [
      "Zikui Cai",
      "Chengyu Song",
      "Srikanth Krishnamurthy",
      "Amit Roy-Chowdhury",
      "M. Salman Asif"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03616",
    "title": "Transmission Neural Networks: From Virus Spread Models to Neural  Networks",
    "abstract": "This work connects models for virus spread on networks with their equivalent neural network representations. Based on this connection, we propose a new neural network architecture, called Transmission Neural Networks (TransNNs) where activation functions are primarily associated with links and are allowed to have different activation levels. Furthermore, this connection leads to the discovery and the derivation of three new activation functions with tunable or trainable parameters. Moreover, we prove that TransNNs with a single hidden layer and a fixed non-zero bias term are universal function approximators. Finally, we present new fundamental derivations of continuous time epidemic network models based on TransNNs. ",
    "url": "https://arxiv.org/abs/2208.03616",
    "authors": [
      "Shuang Gao",
      "Peter E. Caines"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2208.03620",
    "title": "Learning Omnidirectional Flow in 360-degree Video via Siamese  Representation",
    "abstract": "Optical flow estimation in omnidirectional videos faces two significant issues: the lack of benchmark datasets and the challenge of adapting perspective video-based methods to accommodate the omnidirectional nature. This paper proposes the first perceptually natural-synthetic omnidirectional benchmark dataset with a 360-degree field of view, FLOW360, with 40 different videos and 4,000 video frames. We conduct comprehensive characteristic analysis and comparisons between our dataset and existing optical flow datasets, which manifest perceptual realism, uniqueness, and diversity. To accommodate the omnidirectional nature, we present a novel Siamese representation Learning framework for Omnidirectional Flow (SLOF). We train our network in a contrastive manner with a hybrid loss function that combines contrastive loss and optical flow loss. Extensive experiments verify the proposed framework's effectiveness and show up to 40% performance improvement over the state-of-the-art approaches. Our FLOW360 dataset and code are available at https://siamlof.github.io/. ",
    "url": "https://arxiv.org/abs/2208.03620",
    "authors": [
      "Keshav Bhandari",
      "Bin Duan",
      "Gaowen Liu",
      "Hugo Latapie",
      "Ziliang Zong",
      "Yan Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03621",
    "title": "Bias Reducing Multitask Learning on Mental Health Prediction",
    "abstract": "There has been an increase in research in developing machine learning models for mental health detection or prediction in recent years due to increased mental health issues in society. Effective use of mental health prediction or detection models can help mental health practitioners re-define mental illnesses more objectively than currently done, and identify illnesses at an earlier stage when interventions may be more effective. However, there is still a lack of standard in evaluating bias in such machine learning models in the field, which leads to challenges in providing reliable predictions and in addressing disparities. This lack of standards persists due to factors such as technical difficulties, complexities of high dimensional clinical health data, etc., which are especially true for physiological signals. This along with prior evidence of relations between some physiological signals with certain demographic identities restates the importance of exploring bias in mental health prediction models that utilize physiological signals. In this work, we aim to perform a fairness analysis and implement a multi-task learning based bias mitigation method on anxiety prediction models using ECG data. Our method is based on the idea of epistemic uncertainty and its relationship with model weights and feature space representation. Our analysis showed that our anxiety prediction base model introduced some bias with regards to age, income, ethnicity, and whether a participant is born in the U.S. or not, and our bias mitigation method performed better at reducing the bias in the model, when compared to the reweighting mitigation technique. Our analysis on feature importance also helped identify relationships between heart rate variability and multiple demographic groupings. ",
    "url": "https://arxiv.org/abs/2208.03621",
    "authors": [
      "Khadija Zanna",
      "Kusha Sridhar",
      "Han Yu",
      "Akane Sano"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03624",
    "title": "Graph R-CNN: Towards Accurate 3D Object Detection with  Semantic-Decorated Local Graph",
    "abstract": "Two-stage detectors have gained much popularity in 3D object detection. Most two-stage 3D detectors utilize grid points, voxel grids, or sampled keypoints for RoI feature extraction in the second stage. Such methods, however, are inefficient in handling unevenly distributed and sparse outdoor points. This paper solves this problem in three aspects. 1) Dynamic Point Aggregation. We propose the patch search to quickly search points in a local region for each 3D proposal. The dynamic farthest voxel sampling is then applied to evenly sample the points. Especially, the voxel size varies along the distance to accommodate the uneven distribution of points. 2) RoI-graph Pooling. We build local graphs on the sampled points to better model contextual information and mine point relations through iterative message passing. 3) Visual Features Augmentation. We introduce a simple yet effective fusion strategy to compensate for sparse LiDAR points with limited semantic cues. Based on these modules, we construct our Graph R-CNN as the second stage, which can be applied to existing one-stage detectors to consistently improve the detection performance. Extensive experiments show that Graph R-CNN outperforms the state-of-the-art 3D detection models by a large margin on both the KITTI and Waymo Open Dataset. And we rank first place on the KITTI BEV car detection leaderboard. Code will be available at \\url{https://github.com/Nightmare-n/GraphRCNN}. ",
    "url": "https://arxiv.org/abs/2208.03624",
    "authors": [
      "Honghui Yang",
      "Zili Liu",
      "Xiaopei Wu",
      "Wenxiao Wang",
      "Wei Qian",
      "Xiaofei He",
      "Deng Cai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03635",
    "title": "Federated Adversarial Learning: A Framework with Convergence Analysis",
    "abstract": "Federated learning (FL) is a trending training paradigm to utilize decentralized training data. FL allows clients to update model parameters locally for several epochs, then share them to a global model for aggregation. This training paradigm with multi-local step updating before aggregation exposes unique vulnerabilities to adversarial attacks. Adversarial training is a popular and effective method to improve the robustness of networks against adversaries. In this work, we formulate a general form of federated adversarial learning (FAL) that is adapted from adversarial learning in the centralized setting. On the client side of FL training, FAL has an inner loop to generate adversarial samples for adversarial training and an outer loop to update local model parameters. On the server side, FAL aggregates local model updates and broadcast the aggregated model. We design a global robust training loss and formulate FAL training as a min-max optimization problem. Unlike the convergence analysis in classical centralized training that relies on the gradient direction, it is significantly harder to analyze the convergence in FAL for three reasons: 1) the complexity of min-max optimization, 2) model not updating in the gradient direction due to the multi-local updates on the client-side before aggregation and 3) inter-client heterogeneity. We address these challenges by using appropriate gradient approximation and coupling techniques and present the convergence analysis in the over-parameterized regime. Our main result theoretically shows that the minimum loss under our algorithm can converge to $\\epsilon$ small with chosen learning rate and communication rounds. It is noteworthy that our analysis is feasible for non-IID clients. ",
    "url": "https://arxiv.org/abs/2208.03635",
    "authors": [
      "Xiaoxiao Li",
      "Zhao Song",
      "Jiaming Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.03647",
    "title": "BSDGAN: Balancing Sensor Data Generative Adversarial Networks for Human  Activity Recognition",
    "abstract": "The development of IoT technology enables a variety of sensors can be integrated into mobile devices. Human Activity Recognition (HAR) based on sensor data has become an active research topic in the field of machine learning and ubiquitous computing. However, due to the inconsistent frequency of human activities, the amount of data for each activity in the human activity dataset is imbalanced. Considering the limited sensor resources and the high cost of manually labeled sensor data, human activity recognition is facing the challenge of highly imbalanced activity datasets. In this paper, we propose Balancing Sensor Data Generative Adversarial Networks (BSDGAN) to generate sensor data for minority human activities. The proposed BSDGAN consists of a generator model and a discriminator model. Considering the extreme imbalance of human activity dataset, an autoencoder is employed to initialize the training process of BSDGAN, ensure the data features of each activity can be learned. The generated activity data is combined with the original dataset to balance the amount of activity data across human activity classes. We deployed multiple human activity recognition models on two publicly available imbalanced human activity datasets, WISDM and UNIMIB. Experimental results show that the proposed BSDGAN can effectively capture the data features of real human activity sensor data, and generate realistic synthetic sensor data. Meanwhile, the balanced activity dataset can effectively help the activity recognition model to improve the recognition accuracy. ",
    "url": "https://arxiv.org/abs/2208.03647",
    "authors": [
      "Yifan Hu",
      "Yu Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03648",
    "title": "Weakly Supervised Online Action Detection for Infant General Movements",
    "abstract": "To make the earlier medical intervention of infants' cerebral palsy (CP), early diagnosis of brain damage is critical. Although general movements assessment(GMA) has shown promising results in early CP detection, it is laborious. Most existing works take videos as input to make fidgety movements(FMs) classification for the GMA automation. Those methods require a complete observation of videos and can not localize video frames containing normal FMs. Therefore we propose a novel approach named WO-GMA to perform FMs localization in the weakly supervised online setting. Infant body keypoints are first extracted as the inputs to WO-GMA. Then WO-GMA performs local spatio-temporal extraction followed by two network branches to generate pseudo clip labels and model online actions. With the clip-level pseudo labels, the action modeling branch learns to detect FMs in an online fashion. Experimental results on a dataset with 757 videos of different infants show that WO-GMA can get state-of-the-art video-level classification and cliplevel detection results. Moreover, only the first 20% duration of the video is needed to get classification results as good as fully observed, implying a significantly shortened FMs diagnosis time. Code is available at: https://github.com/scofiedluo/WO-GMA. ",
    "url": "https://arxiv.org/abs/2208.03648",
    "authors": [
      "Tongyi Luo",
      "Jia Xiao",
      "Chuncao Zhang",
      "Siheng Chen",
      "Yuan Tian",
      "Guangjun Yu",
      "Kang Dang",
      "Xiaowei Ding"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2208.03649",
    "title": "Energy Efficiency Analysis of Charging Pads-powered UAV-enabled Wireless  Networks",
    "abstract": "This paper analyzes the energy efficiency of a novel system model where unmanned aerial vehicles (UAVs) are used to provide coverage for user hotspots (user clusters) and are deployed on charging pads to enhance the flight time. We introduce a new notion of \"cluster pairs\" to capture the dynamic nature of the users' spatial distribution in order to exploit one of the top advantages of UAVs, which is the mobility and relocation flexibility. Using tools from stochastic geometry, we first derive a new distance distribution that is vital for energy efficiency analysis. Next, we compute the coverage probability under two deployment strategies: (i) one UAV per cluster pair, and (ii) one UAV per cluster. Finally, we compute the energy efficiency for both strategies. Our numerical results reveal which of the two strategies is better for different system parameters. Our work investigates some new aspects of the UAV-enabled communication system such as the dynamic density of users and the advantages or disadvantages of one- or two-UAV deployment strategies per cluster pair. By considering the relationships between the densities of user cluster pairs and the charging pads, it is shown that an optimal cluster pair density exists to maximize energy efficiency. ",
    "url": "https://arxiv.org/abs/2208.03649",
    "authors": [
      "Yujie Qin",
      "Mustafa A. Kishk",
      "Mohamed-Slim Alouini"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.03662",
    "title": "N2NSkip: Learning Highly Sparse Networks using Neuron-to-Neuron Skip  Connections",
    "abstract": "The over-parametrized nature of Deep Neural Networks leads to considerable hindrances during deployment on low-end devices with time and space constraints. Network pruning strategies that sparsify DNNs using iterative prune-train schemes are often computationally expensive. As a result, techniques that prune at initialization, prior to training, have become increasingly popular. In this work, we propose neuron-to-neuron skip connections, which act as sparse weighted skip connections, to enhance the overall connectivity of pruned DNNs. Following a preliminary pruning step, N2NSkip connections are randomly added between individual neurons/channels of the pruned network, while maintaining the overall sparsity of the network. We demonstrate that introducing N2NSkip connections in pruned networks enables significantly superior performance, especially at high sparsity levels, as compared to pruned networks without N2NSkip connections. Additionally, we present a heat diffusion-based connectivity analysis to quantitatively determine the connectivity of the pruned network with respect to the reference network. We evaluate the efficacy of our approach on two different preliminary pruning methods which prune at initialization, and consistently obtain superior performance by exploiting the enhanced connectivity resulting from N2NSkip connections. ",
    "url": "https://arxiv.org/abs/2208.03662",
    "authors": [
      "Arvind Subramaniam",
      "Avinash Sharma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03666",
    "title": "See What You See: Self-supervised Cross-modal Retrieval of Visual  Stimuli from Brain Activity",
    "abstract": "Recent studies demonstrate the use of a two-stage supervised framework to generate images that depict human perception to visual stimuli from EEG, referring to EEG-visual reconstruction. They are, however, unable to reproduce the exact visual stimulus, since it is the human-specified annotation of images, not their data, that determines what the synthesized images are. Moreover, synthesized images often suffer from noisy EEG encodings and unstable training of generative models, making them hard to recognize. Instead, we present a single-stage EEG-visual retrieval paradigm where data of two modalities are correlated, as opposed to their annotations, allowing us to recover the exact visual stimulus for an EEG clip. We maximize the mutual information between the EEG encoding and associated visual stimulus through optimization of a contrastive self-supervised objective, leading to two additional benefits. One, it enables EEG encodings to handle visual classes beyond seen ones during training, since learning is not directed at class annotations. In addition, the model is no longer required to generate every detail of the visual stimulus, but rather focuses on cross-modal alignment and retrieves images at the instance level, ensuring distinguishable model output. Empirical studies are conducted on the largest single-subject EEG dataset that measures brain activities evoked by image stimuli. We demonstrate the proposed approach completes an instance-level EEG-visual retrieval task which existing methods cannot. We also examine the implications of a range of EEG and visual encoder structures. Furthermore, for a mostly studied semantic-level EEG-visual classification task, despite not using class annotations, the proposed method outperforms state-of-the-art supervised EEG-visual reconstruction approaches, particularly on the capability of open class recognition. ",
    "url": "https://arxiv.org/abs/2208.03666",
    "authors": [
      "Zesheng Ye",
      "Lina Yao",
      "Yu Zhang",
      "Silvia Gustin"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2208.03677",
    "title": "A New Robust Algorithm for Computation of a Triangle Circumscribed  Sphere in E3 and a Hypersphere Simplex",
    "abstract": "There are many applications in which a bounding sphere containing the given triangle E3 is needed, e.g. fast collision detection, ray-triangle intersecting in raytracing etc. This is a typical geometrical problem in E3 and it has also applications in computational problems in general. In this paper a new fast and robust algorithm of circumscribed sphere computation in the -dimensional space is presented and specification for the E3 space is given, too. The presented method is convenient for use on GPU or with SSE or Intel AVX instructions on a standard CPU ",
    "url": "https://arxiv.org/abs/2208.03677",
    "authors": [
      "Vaclav Skala"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2208.03704",
    "title": "Jointformer: Single-Frame Lifting Transformer with Error Prediction and  Refinement for 3D Human Pose Estimation",
    "abstract": "Monocular 3D human pose estimation technologies have the potential to greatly increase the availability of human movement data. The best-performing models for single-image 2D-3D lifting use graph convolutional networks (GCNs) that typically require some manual input to define the relationships between different body joints. We propose a novel transformer-based approach that uses the more generalised self-attention mechanism to learn these relationships within a sequence of tokens representing joints. We find that the use of intermediate supervision, as well as residual connections between the stacked encoders benefits performance. We also suggest that using error prediction as part of a multi-task learning framework improves performance by allowing the network to compensate for its confidence level. We perform extensive ablation studies to show that each of our contributions increases performance. Furthermore, we show that our approach outperforms the recent state of the art for single-frame 3D human pose estimation by a large margin. Our code and trained models are made publicly available on Github. ",
    "url": "https://arxiv.org/abs/2208.03704",
    "authors": [
      "Sebastian Lutz",
      "Richard Blythman",
      "Koustav Ghosal",
      "Matthew Moynihan",
      "Ciaran Simms",
      "Aljosa Smolic"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03705",
    "title": "Rate Splitting Multiple Access for Next Generation Cognitive Radio  Enabled LEO Satellite Networks",
    "abstract": "This paper proposes a cognitive radio enabled LEO SatCom using RSMA radio access technique with the coexistence of GEO SatCom network. In particular, this work aims to maximize the sum rate of LEO SatCom by simultaneously optimizing the power budget over different beams, RSMA power allocation for users over each beam, and subcarrier user assignment while restricting the interference temperature to GEO SatCom. The problem of sum rate maximization is formulated as non-convex, where the global optimal solution is challenging to obtain. Thus, an efficient solution can be obtained in three steps: first we employ a successive convex approximation technique to reduce the complexity and make the problem more tractable. Second, for any given resource block user assignment, we adopt KKT conditions to calculate the transmit power over different beams and RSMA power allocation of users over each beam. Third, using the allocated power, we design an efficient algorithm based on the greedy approach for resource block user assignment. Numerical results demonstrate the benefits of the proposed optimization scheme compared to the benchmark schemes. ",
    "url": "https://arxiv.org/abs/2208.03705",
    "authors": [
      "ali Ullah Khan",
      "Zain Ali",
      "Eva Lagunas",
      "Asad Mahmood",
      "Muhammad Asif",
      "Asim Ihsan",
      "Symeon Chatzinotas",
      "Björn Ottersten",
      "Octavia A. Dobre"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2208.03708",
    "title": "Optimal Tracking in Prediction with Expert Advice",
    "abstract": "We study the prediction with expert advice setting, where the aim is to produce a decision by combining the decisions generated by a set of experts, e.g., independently running algorithms. We achieve the min-max optimal dynamic regret under the prediction with expert advice setting, i.e., we can compete against time-varying (not necessarily fixed) combinations of expert decisions in an optimal manner. Our end-algorithm is truly online with no prior information, such as the time horizon or loss ranges, which are commonly used by different algorithms in the literature. Both our regret guarantees and the min-max lower bounds are derived with the general consideration that the expert losses can have time-varying properties and are possibly unbounded. Our algorithm can be adapted for restrictive scenarios regarding both loss feedback and decision making. Our guarantees are universal, i.e., our end-algorithm can provide regret guarantee against any competitor sequence in a min-max optimal manner with logarithmic complexity. Note that, to our knowledge, for the prediction with expert advice problem, our algorithms are the first to produce such universally optimal, adaptive and truly online guarantees with no prior knowledge. ",
    "url": "https://arxiv.org/abs/2208.03708",
    "authors": [
      "Hakan Gokcesu",
      "Suleyman S. Kozat"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2208.03710",
    "title": "Adaptive incomplete multi-view learning via tensor graph completion",
    "abstract": "With the advancement of the data acquisition techniques, multi-view learning has become a hot topic. Some multi-view learning methods assume that the multi-view data is complete, which means that all instances are present, but this too ideal. Certain tensor-based methods for handing incomplete multi-view data have emerged and have achieved better result. However, there are still some problems, such as use of traditional tensor norm which makes the computation high and is not able to handle out-of-sample. To solve these two problems, we proposed a new incomplete multi view learning method. A new tensor norm is defined to implement graph tensor data recover. The recovered graphs are then regularized to a consistent low-dimensional representation of the samples. In addition, adaptive weights are equipped to each view to adjust the importance of different views. Compared with the existing methods, our method nor only explores the consistency among views, but also obtains the low-dimensional representation of the new samples by using the learned projection matrix. An efficient algorithm based on inexact augmented Lagrange multiplier (ALM) method are designed to solve the model and convergence is proved. Experimental results on four datasets show the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2208.03710",
    "authors": [
      "Heng Zhang",
      "Xiaohong Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03712",
    "title": "The Influence of Network Structural Preference on Node Classification  and Link Prediction",
    "abstract": "Recent advances in complex network analysis opened a wide range of possibilities for applications in diverse fields. The power of the network analysis depends on the node features. The topology-based node features are realizations of local and global spatial relations and node connectivity structure. Hence, collecting correct information on the node characteristics and the connectivity structure of the neighboring nodes plays the most prominent role in node classification and link prediction in complex network analysis. The present work introduces a new feature abstraction method, namely the Transition Probabilities Matrix (TPM), based on embedding anonymous random walks on feature vectors. The node feature vectors consist of transition probabilities obtained from sets of walks in a predefined radius. The transition probabilities are directly related to the local connectivity structure, hence correctly embedded onto feature vectors. The success of the proposed embedding method is tested on node identification/classification and link prediction on three commonly used real-world networks. In real-world networks, nodes with similar connectivity structures are common; Thus, obtaining information from similar networks for predictions on the new networks is the distinguishing characteristic that makes the proposed algorithm superior to the state-of-the-art algorithms in terms of cross-networks generalization tasks. ",
    "url": "https://arxiv.org/abs/2208.03712",
    "authors": [
      "Sarmad N. Mohammed",
      "Semra Gündüç"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2208.03727",
    "title": "Robust Multi-Object Tracking by Marginal Inference",
    "abstract": "Multi-object tracking in videos requires to solve a fundamental problem of one-to-one assignment between objects in adjacent frames. Most methods address the problem by first discarding impossible pairs whose feature distances are larger than a threshold, followed by linking objects using Hungarian algorithm to minimize the overall distance. However, we find that the distribution of the distances computed from Re-ID features may vary significantly for different videos. So there isn't a single optimal threshold which allows us to safely discard impossible pairs. To address the problem, we present an efficient approach to compute a marginal probability for each pair of objects in real time. The marginal probability can be regarded as a normalized distance which is significantly more stable than the original feature distance. As a result, we can use a single threshold for all videos. The approach is general and can be applied to the existing trackers to obtain about one point improvement in terms of IDF1 metric. It achieves competitive results on MOT17 and MOT20 benchmarks. In addition, the computed probability is more interpretable which facilitates subsequent post-processing operations. ",
    "url": "https://arxiv.org/abs/2208.03727",
    "authors": [
      "Yifu Zhang",
      "Chunyu Wang",
      "Xinggang Wang",
      "Wenjun Zeng",
      "Wenyu Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03740",
    "title": "Multi-agent reinforcement learning for intent-based service assurance in  cellular networks",
    "abstract": "Recently, intent-based management is receiving good attention in telecom networks owing to stringent performance requirements for many of the use cases. Several approaches on the literature employ traditional methods in the telecom domain to fulfill intents on the KPIs, which can be defined as a closed loop. However, these methods consider every closed-loop independent of each other which degrades the combined closed-loop performance. Also, when many closed loops are needed, these methods are not easily scalable. Multi-agent reinforcement learning (MARL) techniques have shown significant promise in many areas in which traditional closed-loop control falls short, typically for complex coordination and conflict management among loops. In this work, we propose a method based on MARL to achieve intent-based management without the requirement of the model of the underlying system. Moreover, when there are conflicting intents, the MARL agents can implicitly incentivize the loops to cooperate, without human interaction, by prioritizing the important KPIs. Experiments have been performed on a network emulator on optimizing KPIs for three services and we observe the proposed system performs well and is able to fulfill all existing intents when there are enough resources or prioritize the KPIs when there are scarce resources. ",
    "url": "https://arxiv.org/abs/2208.03740",
    "authors": [
      "Satheesh K. Perepu",
      "Jean P. Martins",
      "Ricardo Souza S",
      "Kaushik Dey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.03742",
    "title": "PS-NeRV: Patch-wise Stylized Neural Representations for Videos",
    "abstract": "We study how to represent a video with implicit neural representations (INRs). Classical INRs methods generally utilize MLPs to map input coordinates to output pixels. While some recent works have tried to directly reconstruct the whole image with CNNs. However, we argue that both the above pixel-wise and image-wise strategies are not favorable to video data. Instead, we propose a patch-wise solution, PS-NeRV, which represents videos as a function of patches and the corresponding patch coordinate. It naturally inherits the advantages of image-wise methods, and achieves excellent reconstruction performance with fast decoding speed. The whole method includes conventional modules, like positional embedding, MLPs and CNNs, while also introduces AdaIN to enhance intermediate features. These simple yet essential changes could help the network easily fit high-frequency details. Extensive experiments have demonstrated its effectiveness in several video-related tasks, such as video compression and video inpainting. ",
    "url": "https://arxiv.org/abs/2208.03742",
    "authors": [
      "Yunpeng Bai",
      "Chao Dong",
      "Cairong Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03763",
    "title": "Label Semantic Knowledge Distillation for Unbiased Scene Graph  Generation",
    "abstract": "The Scene Graph Generation (SGG) task aims to detect all the objects and their pairwise visual relationships in a given image. Although SGG has achieved remarkable progress over the last few years, almost all existing SGG models follow the same training paradigm: they treat both object and predicate classification in SGG as a single-label classification problem, and the ground-truths are one-hot target labels. However, this prevalent training paradigm has overlooked two characteristics of current SGG datasets: 1) For positive samples, some specific subject-object instances may have multiple reasonable predicates. 2) For negative samples, there are numerous missing annotations. Regardless of the two characteristics, SGG models are easy to be confused and make wrong predictions. To this end, we propose a novel model-agnostic Label Semantic Knowledge Distillation (LS-KD) for unbiased SGG. Specifically, LS-KD dynamically generates a soft label for each subject-object instance by fusing a predicted Label Semantic Distribution (LSD) with its original one-hot target label. LSD reflects the correlations between this instance and multiple predicate categories. Meanwhile, we propose two different strategies to predict LSD: iterative self-KD and synchronous self-KD. Extensive ablations and results on three SGG tasks have attested to the superiority and generality of our proposed LS-KD, which can consistently achieve decent trade-off performance between different predicate categories. ",
    "url": "https://arxiv.org/abs/2208.03763",
    "authors": [
      "Lin Li",
      "Long Chen",
      "Hanrong Shi",
      "Wenxiao Wang",
      "Jian Shao",
      "Yi Yang",
      "Jun Xiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03776",
    "title": "Stochastic Scaling in Loss Functions for Physics-Informed Neural  Networks",
    "abstract": "Differential equations are used in a wide variety of disciplines, describing the complex behavior of the physical world. Analytic solutions to these equations are often difficult to solve for, limiting our current ability to solve complex differential equations and necessitating sophisticated numerical methods to approximate solutions. Trained neural networks act as universal function approximators, able to numerically solve differential equations in a novel way. In this work, methods and applications of neural network algorithms for numerically solving differential equations are explored, with an emphasis on varying loss functions and biological applications. Variations on traditional loss function and training parameters show promise in making neural network-aided solutions more efficient, allowing for the investigation of more complex equations governing biological principles. ",
    "url": "https://arxiv.org/abs/2208.03776",
    "authors": [
      "Ethan Mills",
      "Alexey Pozdnyakov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2208.03779",
    "title": "Sample hardness based gradient loss for long-tailed cervical cell  detection",
    "abstract": "Due to the difficulty of cancer samples collection and annotation, cervical cancer datasets usually exhibit a long-tailed data distribution. When training a detector to detect the cancer cells in a WSI (Whole Slice Image) image captured from the TCT (Thinprep Cytology Test) specimen, head categories (e.g. normal cells and inflammatory cells) typically have a much larger number of samples than tail categories (e.g. cancer cells). Most existing state-of-the-art long-tailed learning methods in object detection focus on category distribution statistics to solve the problem in the long-tailed scenario without considering the \"hardness\" of each sample. To address this problem, in this work we propose a Grad-Libra Loss that leverages the gradients to dynamically calibrate the degree of hardness of each sample for different categories, and re-balance the gradients of positive and negative samples. Our loss can thus help the detector to put more emphasis on those hard samples in both head and tail categories. Extensive experiments on a long-tailed TCT WSI image dataset show that the mainstream detectors, e.g. RepPoints, FCOS, ATSS, YOLOF, etc. trained using our proposed Gradient-Libra Loss, achieved much higher (7.8%) mAP than that trained using cross-entropy classification loss. ",
    "url": "https://arxiv.org/abs/2208.03779",
    "authors": [
      "Minmin Liu",
      "Xuechen Li",
      "Xiangbo Gao",
      "Junliang Chen",
      "Linlin Shen",
      "Huisi Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03796",
    "title": "Estimating Topic Exposure for Under-Represented Users on Social Media",
    "abstract": "Online Social Networks (OSNs) facilitate access to a variety of data allowing researchers to analyze users' behavior and develop user behavioral analysis models. These models rely heavily on the observed data which is usually biased due to the participation inequality. This inequality consists of three groups of online users: the lurkers - users that solely consume the content, the engagers - users that contribute little to the content creation, and the contributors - users that are responsible for creating the majority of the online content. Failing to consider the contribution of all the groups while interpreting population-level interests or sentiments may yield biased results. To reduce the bias induced by the contributors, in this work, we focus on highlighting the engagers' contributions in the observed data as they are more likely to contribute when compared to lurkers, and they comprise a bigger population as compared to the contributors. The first step in behavioral analysis of these users is to find the topics they are exposed to but did not engage with. To do so, we propose a novel framework that aids in identifying these users and estimates their topic exposure. The exposure estimation mechanism is modeled by incorporating behavioral patterns from similar contributors as well as users' demographic and profile information. ",
    "url": "https://arxiv.org/abs/2208.03796",
    "authors": [
      "Mansooreh Karami",
      "Ahmadreza Mosallanezhad",
      "Paras Sheth",
      "Huan Liu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03806",
    "title": "HWGN2: Side-channel Protected Neural Networks through Secure and Private  Function Evaluation",
    "abstract": "Recent work has highlighted the risks of intellectual property (IP) piracy of deep learning (DL) models from the side-channel leakage of DL hardware accelerators. In response, to provide side-channel leakage resiliency to DL hardware accelerators, several approaches have been proposed, mainly borrowed from the methodologies devised for cryptographic implementations. Therefore, as expected, the same challenges posed by the complex design of such countermeasures should be dealt with. This is despite the fact that fundamental cryptographic approaches, specifically secure and private function evaluation, could potentially improve the robustness against side-channel leakage. To examine this and weigh the costs and benefits, we introduce hardware garbled NN (HWGN2), a DL hardware accelerator implemented on FPGA. HWGN2 also provides NN designers with the flexibility to protect their IP in real-time applications, where hardware resources are heavily constrained, through a hardware-communication cost trade-off. Concretely, we apply garbled circuits, implemented using a MIPS architecture that achieves up to 62.5x fewer logical and 66x less memory utilization than the state-of-the-art approaches at the price of communication overhead. Further, the side-channel resiliency of HWGN2 is demonstrated by employing the test vector leakage assessment (TVLA) test against both power and electromagnetic side-channels. This is in addition to the inherent feature of HWGN2: it ensures the privacy of users' input, including the architecture of NNs. We also demonstrate a natural extension to the malicious security modeljust as a by-product of our implementation. ",
    "url": "https://arxiv.org/abs/2208.03806",
    "authors": [
      "Mohammad Hashemi",
      "Steffi Roy",
      "Domenic Forte",
      "Fatemeh Ganji"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.03819",
    "title": "Cross-Skeleton Interaction Graph Aggregation Network for Representation  Learning of Mouse Social Behaviour",
    "abstract": "Automated social behaviour analysis of mice has become an increasingly popular research area in behavioural neuroscience. Recently, pose information (i.e., locations of keypoints or skeleton) has been used to interpret social behaviours of mice. Nevertheless, effective encoding and decoding of social interaction information underlying the keypoints of mice has been rarely investigated in the existing methods. In particular, it is challenging to model complex social interactions between mice due to highly deformable body shapes and ambiguous movement patterns. To deal with the interaction modelling problem, we here propose a Cross-Skeleton Interaction Graph Aggregation Network (CS-IGANet) to learn abundant dynamics of freely interacting mice, where a Cross-Skeleton Node-level Interaction module (CS-NLI) is used to model multi-level interactions (i.e., intra-, inter- and cross-skeleton interactions). Furthermore, we design a novel Interaction-Aware Transformer (IAT) to dynamically learn the graph-level representation of social behaviours and update the node-level representation, guided by our proposed interaction-aware self-attention mechanism. Finally, to enhance the representation ability of our model, an auxiliary self-supervised learning task is proposed for measuring the similarity between cross-skeleton nodes. Experimental results on the standard CRMI13-Skeleton and our PDMB-Skeleton datasets show that our proposed model outperforms several other state-of-the-art approaches. ",
    "url": "https://arxiv.org/abs/2208.03819",
    "authors": [
      "Feixiang Zhou",
      "Xinyu Yang",
      "Fang Chen",
      "Long Chen",
      "Zheheng Jiang",
      "Hui Zhu",
      "Reiko Heckel",
      "Haikuan Wang",
      "Minrui Fei",
      "Huiyu Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03822",
    "title": "Garbled EDA: Privacy Preserving Electronic Design Automation",
    "abstract": "The complexity of modern integrated circuits (ICs) necessitates collaboration between multiple distrusting parties, including thirdparty intellectual property (3PIP) vendors, design houses, CAD/EDA tool vendors, and foundries, which jeopardizes confidentiality and integrity of each party's IP. IP protection standards and the existing techniques proposed by researchers are ad hoc and vulnerable to numerous structural, functional, and/or side-channel attacks. Our framework, Garbled EDA, proposes an alternative direction through formulating the problem in a secure multi-party computation setting, where the privacy of IPs, CAD tools, and process design kits (PDKs) is maintained. As a proof-of-concept, Garbled EDA is evaluated in the context of simulation, where multiple IP description formats (Verilog, C, S) are supported. Our results demonstrate a reasonable logical-resource cost and negligible memory overhead. To further reduce the overhead, we present another efficient implementation methodology, feasible when the resource utilization is a bottleneck, but the communication between two parties is not restricted. Interestingly, this implementation is private and secure even in the presence of malicious adversaries attempting to, e.g., gain access to PDKs or in-house IPs of the CAD tool providers. ",
    "url": "https://arxiv.org/abs/2208.03822",
    "authors": [
      "Mohammad Hashemi",
      "Steffi Roy",
      "Fatemeh Ganji",
      "Domenic Forte"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.03824",
    "title": "Towards Graph Representation Learning Based Surgical Workflow  Anticipation",
    "abstract": "Surgical workflow anticipation can give predictions on what steps to conduct or what instruments to use next, which is an essential part of the computer-assisted intervention system for surgery, e.g. workflow reasoning in robotic surgery. However, current approaches are limited to their insufficient expressive power for relationships between instruments. Hence, we propose a graph representation learning framework to comprehensively represent instrument motions in the surgical workflow anticipation problem. In our proposed graph representation, we maps the bounding box information of instruments to the graph nodes in the consecutive frames and build inter-frame/inter-instrument graph edges to represent the trajectory and interaction of the instruments over time. This design enhances the ability of our network on modeling both the spatial and temporal patterns of surgical instruments and their interactions. In addition, we design a multi-horizon learning strategy to balance the understanding of various horizons indifferent anticipation tasks, which significantly improves the model performance in anticipation with various horizons. Experiments on the Cholec80 dataset demonstrate the performance of our proposed method can exceed the state-of-the-art method based on richer backbones, especially in instrument anticipation (1.27 v.s. 1.48 for inMAE; 1.48 v.s. 2.68 for eMAE). To the best of our knowledge, we are the first to introduce a spatial-temporal graph representation into surgical workflow anticipation. ",
    "url": "https://arxiv.org/abs/2208.03824",
    "authors": [
      "Xiatian Zhang",
      "Noura Al Moubayed",
      "Hubert P. H. Shum"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03835",
    "title": "How Adversarial Robustness Transfers from Pre-training to Downstream  Tasks",
    "abstract": "Given the rise of large-scale training regimes, adapting pre-trained models to a wide range of downstream tasks has become a standard approach in machine learning. While large benefits in empirical performance have been observed, it is not yet well understood how robustness properties transfer from a pre-trained model to a downstream task. We prove that the robustness of a predictor on downstream tasks can be bound by the robustness of its underlying representation, irrespective of the pre-training protocol. Taken together, our results precisely characterize what is required of the representation function for reliable performance upon deployment. ",
    "url": "https://arxiv.org/abs/2208.03835",
    "authors": [
      "Laura Fee Nern",
      "Yash Sharma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.03871",
    "title": "Optimal Dynamic Orchestration in NDN-based Computing Networks",
    "abstract": "Named Data Networking (NDN) offers promising advantages in deploying next-generation service applications over distributed computing networks. We consider the problem of dynamic orchestration over a NDN-based computing network, in which nodes can be equipped with communication, computation, and data producing resources. Given a set of services with function-chaining structures, we address the design of distributed online algorithm that controls each node to make adaptive decisions on flowing service requests, committing function implementations, and/or producing data. We design a Service Discovery Assisted Dynamic Orchestration (SDADO) algorithm that reduces the end-to-end (E2E) delay of delivering the services, while providing optimal throughput performance. The proposed algorithm hybrids queuing-based flexibility and topology-based discipline, where the topological information is not pre-available but obtained through our proposed service discovery mechanism. We provide throughput-optimality analysis for SDADO, and then provide numerical results that confirm our analysis and demonstrates reduced round-trip E2E delay. ",
    "url": "https://arxiv.org/abs/2208.03871",
    "authors": [
      "Hao Feng",
      "Yi Zhang",
      "Srikathyayani Srikanteswara",
      "Marcin Spoczynski",
      "Gabriel Arrobo",
      "Jing Zhu",
      "Nageen Himayat"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2208.03879",
    "title": "Clear Memory-Augmented Auto-Encoder for Surface Defect Detection",
    "abstract": "In surface defect detection, due to the extreme imbalance in the number of positive and negative samples, positive-samples-based anomaly detection methods have received more and more attention. Specifically, reconstruction-based methods are the most popular. However, exiting methods are either difficult to repair abnormal foregrounds or reconstruct clear backgrounds. Therefore, we propose a clear memory-augmented auto-encoder. At first, we propose a novel clear memory-augmented module, which combines the encoding and memory-encoding in a way of forgetting and inputting, thereby repairing abnormal foregrounds and preservation clear backgrounds. Secondly, a general artificial anomaly generation algorithm is proposed to simulate anomalies that are as realistic and feature-rich as possible. At last, we propose a novel multi scale feature residual detection method for defect segmentation, which makes the defect location more accurate. CMA-AE conducts comparative experiments using 11 state-of-the-art methods on five benchmark datasets, showing an average 18.6% average improvement in F1-measure. ",
    "url": "https://arxiv.org/abs/2208.03879",
    "authors": [
      "Wei Luo",
      "Tongzhi Niu",
      "Lixin Tang",
      "Wenyong Yu",
      "Bin Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.03884",
    "title": "Differential biases, $c$-differential uniformity, and their relation to  differential attacks",
    "abstract": "Differential cryptanalysis famously uses statistical biases in the propagation of differences in a block cipher to attack the cipher. In this paper, we investigate the existence of more general statistical biases in the differences. To this end, we discuss the $c$-differential uniformity of S-boxes, which is a concept that was recently introduced in Ellingsen et. al. to measure certain statistical biases that could potentially be used in attacks similar to differential attacks. Firstly, we prove that a large class of potential candidates for S-boxes necessarily has large $c$-differential uniformity for all but at most $B$ choices of $c$, where $B$ is a constant independent of the size of the finite field $q$. This result implies that for a large class of functions, certain statistical differential biases are inevitable. In a second part, we discuss the practical possibility of designing a differential attack based on weaknesses of S-boxes related to their $c$-differential uniformity. ",
    "url": "https://arxiv.org/abs/2208.03884",
    "authors": [
      "Daniele Bartoli",
      "Lukas Kölsch",
      "Giacomo Micheli"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2208.03889",
    "title": "Robust Training and Verification of Implicit Neural Networks: A  Non-Euclidean Contractive Approach",
    "abstract": "This paper proposes a theoretical and computational framework for training and robustness verification of implicit neural networks based upon non-Euclidean contraction theory. The basic idea is to cast the robustness analysis of a neural network as a reachability problem and use (i) the $\\ell_{\\infty}$-norm input-output Lipschitz constant and (ii) the tight inclusion function of the network to over-approximate its reachable sets. First, for a given implicit neural network, we use $\\ell_{\\infty}$-matrix measures to propose sufficient conditions for its well-posedness, design an iterative algorithm to compute its fixed points, and provide upper bounds for its $\\ell_\\infty$-norm input-output Lipschitz constant. Second, we introduce a related embedded network and show that the embedded network can be used to provide an $\\ell_\\infty$-norm box over-approximation of the reachable sets of the original network. Moreover, we use the embedded network to design an iterative algorithm for computing the upper bounds of the original system's tight inclusion function. Third, we use the upper bounds of the Lipschitz constants and the upper bounds of the tight inclusion functions to design two algorithms for the training and robustness verification of implicit neural networks. Finally, we apply our algorithms to train implicit neural networks on the MNIST dataset and compare the robustness of our models with the models trained via existing approaches in the literature. ",
    "url": "https://arxiv.org/abs/2208.03889",
    "authors": [
      "Saber Jafarpour",
      "Alexander Davydov",
      "Matthew Abate",
      "Francesco Bullo",
      "Samuel Coogan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2208.03903",
    "title": "Semantic Enhanced Text-to-SQL Parsing via Iteratively Learning Schema  Linking Graph",
    "abstract": "The generalizability to new databases is of vital importance to Text-to-SQL systems which aim to parse human utterances into SQL statements. Existing works achieve this goal by leveraging the exact matching method to identify the lexical matching between the question words and the schema items. However, these methods fail in other challenging scenarios, such as the synonym substitution in which the surface form differs between the corresponding question words and schema items. In this paper, we propose a framework named ISESL-SQL to iteratively build a semantic enhanced schema-linking graph between question tokens and database schemas. First, we extract a schema linking graph from PLMs through a probing procedure in an unsupervised manner. Then the schema linking graph is further optimized during the training process through a deep graph learning method. Meanwhile, we also design an auxiliary task called graph regularization to improve the schema information mentioned in the schema-linking graph. Extensive experiments on three benchmarks demonstrate that ISESL-SQL could consistently outperform the baselines and further investigations show its generalizability and robustness. ",
    "url": "https://arxiv.org/abs/2208.03903",
    "authors": [
      "Aiwei Liu",
      "Xuming Hu",
      "Li Lin",
      "Lijie Wen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.03918",
    "title": "Depth Quality-Inspired Feature Manipulation for Efficient RGB-D and  Video Salient Object Detection",
    "abstract": "Recently CNN-based RGB-D salient object detection (SOD) has obtained significant improvement on detection accuracy. However, existing models often fail to perform well in terms of efficiency and accuracy simultaneously. This hinders their potential applications on mobile devices as well as many real-world problems. To bridge the accuracy gap between lightweight and large models for RGB-D SOD, in this paper, an efficient module that can greatly improve the accuracy but adds little computation is proposed. Inspired by the fact that depth quality is a key factor influencing the accuracy, we propose an efficient depth quality-inspired feature manipulation (DQFM) process, which can dynamically filter depth features according to depth quality. The proposed DQFM resorts to the alignment of low-level RGB and depth features, as well as holistic attention of the depth stream to explicitly control and enhance cross-modal fusion. We embed DQFM to obtain an efficient lightweight RGB-D SOD model called DFM-Net, where we in addition design a tailored depth backbone and a two-stage decoder as basic parts. Extensive experimental results on nine RGB-D datasets demonstrate that our DFM-Net outperforms recent efficient models, running at about 20 FPS on CPU with only 8.5Mb model size, and meanwhile being 2.9/2.4 times faster and 6.7/3.1 times smaller than the latest best models A2dele and MobileSal. It also maintains state-of-the-art accuracy when even compared to non-efficient models. Interestingly, further statistics and analyses verify the ability of DQFM in distinguishing depth maps of various qualities without any quality labels. Last but not least, we further apply DFM-Net to deal with video SOD (VSOD), achieving comparable performance against recent efficient models while being 3/2.3 times faster/smaller than the prior best in this field. Our code is available at https://github.com/zwbx/DFM-Net. ",
    "url": "https://arxiv.org/abs/2208.03918",
    "authors": [
      "Wenbo Zhang",
      "Keren Fu",
      "Zhuo Wang",
      "Ge-Peng Ji",
      "Qijun Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03922",
    "title": "CSSAM:Code Search via Attention Matching of Code Semantics and  Structures",
    "abstract": "Despite the continuous efforts in improving both the effectiveness and efficiency of code search, two issues remained unsolved. First, programming languages have inherent strong structural linkages, and feature mining of code as text form would omit the structural information contained inside it. Second, there is a potential semantic relationship between code and query, it is challenging to align code and text across sequences so that vectors are spatially consistent during similarity matching. To tackle both issues, in this paper, a code search model named CSSAM (Code Semantics and Structures Attention Matching) is proposed. By introducing semantic and structural matching mechanisms, CSSAM effectively extracts and fuses multidimensional code features. Specifically, the cross and residual layer was developed to facilitate high-latitude spatial alignment of code and query at the token level. By leveraging the residual interaction, a matching module is designed to preserve more code semantics and descriptive features, that enhances the adhesion between the code and its corresponding query text. Besides, to improve the model's comprehension of the code's inherent structure, a code representation structure named CSRG (Code Semantic Representation Graph) is proposed for jointly representing abstract syntax tree nodes and the data flow of the codes. According to the experimental results on two publicly available datasets containing 540k and 330k code segments, CSSAM significantly outperforms the baselines in terms of achieving the highest SR@1/5/10, MRR, and NDCG@50 on both datasets respectively. Moreover, the ablation study is conducted to quantitatively measure the impact of each key component of CSSAM on the efficiency and effectiveness of code search, which offers the insights into the improvement of advanced code search solutions. ",
    "url": "https://arxiv.org/abs/2208.03922",
    "authors": [
      "Yi Hu",
      "Bo Cai",
      "Yaoxiang Yu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2208.03923",
    "title": "Adversarial robustness of $β-$VAE through the lens of local geometry",
    "abstract": "Variational autoencoders (VAEs) are susceptible to adversarial attacks. An adversary can find a small perturbation in the input sample to change its latent encoding non-smoothly, thereby compromising the reconstruction. A known reason for such vulnerability is the latent space distortions arising from a mismatch between approximated latent posterior and a prior distribution. Consequently, a slight change in the inputs leads to a significant change in the latent space encodings. This paper demonstrates that the sensitivity around a data point is due to a directional bias of a stochastic pullback metric tensor induced by the encoder network. The pullback metric tensor measures the infinitesimal volume change from input to latent space. Thus, it can be viewed as a lens to analyse the effect of small changes in the input leading to distortions in the latent space. We propose robustness evaluation scores using the eigenspectrum of a pullback metric. Moreover, we empirically show that the scores correlate with the robustness parameter $\\beta$ of the $\\beta-$VAE. ",
    "url": "https://arxiv.org/abs/2208.03923",
    "authors": [
      "Asif Khan",
      "Amos Storkey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03936",
    "title": "Sparse Representation Learning with Modified q-VAE towards Minimal  Realization of World Model",
    "abstract": "Extraction of low-dimensional latent space from high-dimensional observation data is essential to construct a real-time robot controller with a world model on the extracted latent space. However, there is no established method for tuning the dimension size of the latent space automatically, suffering from finding the necessary and sufficient dimension size, i.e. the minimal realization of the world model. In this study, we analyze and improve Tsallis-based variational autoencoder (q-VAE), and reveal that, under an appropriate configuration, it always facilitates making the latent space sparse. Even if the dimension size of the pre-specified latent space is redundant compared to the minimal realization, this sparsification collapses unnecessary dimensions, allowing for easy removal of them. We experimentally verified the benefits of the sparsification by the proposed method that it can easily find the necessary and sufficient six dimensions for a reaching task with a mobile manipulator that requires a six-dimensional state space. Moreover, by planning with such a minimal-realization world model learned in the extracted dimensions, the proposed method was able to exert a more optimal action sequence in real-time, reducing the reaching accomplishment time by around 20 %. The attached video is uploaded on youtube: https://youtu.be/-QjITrnxaRs ",
    "url": "https://arxiv.org/abs/2208.03936",
    "authors": [
      "Taisuke Kobayashi",
      "Ryoma Watanuki"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2208.03941",
    "title": "A high-resolution dynamical view on momentum methods for  over-parameterized neural networks",
    "abstract": "In this paper, we present the convergence analysis of momentum methods in training a two-layer over-parameterized ReLU neural network, where the number of parameters is significantly larger than that of training instances. Existing works on momentum methods show that the heavy-ball method (HB) and Nesterov's accelerated method (NAG) share the same limiting ordinary differential equation (ODE), which leads to identical convergence rate. From a high-resolution dynamical view, we show that HB differs from NAG in terms of the convergence rate. In addition, our findings provide tighter upper bounds on convergence for the high-resolution ODEs of HB and NAG. ",
    "url": "https://arxiv.org/abs/2208.03941",
    "authors": [
      "Xin Liu",
      "Wei Tao",
      "Jun Wang",
      "Zhisong Pan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.03944",
    "title": "Robust and Imperceptible Black-box DNN Watermarking Based on Fourier  Perturbation Analysis and Frequency Sensitivity Clustering",
    "abstract": "Recently, more and more attention has been focused on the intellectual property protection of deep neural networks (DNNs), promoting DNN watermarking to become a hot research topic. Compared with embedding watermarks directly into DNN parameters, inserting trigger-set watermarks enables us to verify the ownership without knowing the internal details of the DNN, which is more suitable for application scenarios. The cost is we have to carefully craft the trigger samples. Mainstream methods construct the trigger samples by inserting a noticeable pattern to the clean samples in the spatial domain, which does not consider sample imperceptibility, sample robustness and model robustness, and therefore has limited the watermarking performance and the model generalization. It has motivated the authors in this paper to propose a novel DNN watermarking method based on Fourier perturbation analysis and frequency sensitivity clustering. First, we analyze the perturbation impact of different frequency components of the input sample on the task functionality of the DNN by applying random perturbation. Then, by K-means clustering, we determine the frequency components that result in superior watermarking performance for crafting the trigger samples. Our experiments show that the proposed work not only maintains the performance of the DNN on its original task, but also provides better watermarking performance compared with related works. ",
    "url": "https://arxiv.org/abs/2208.03944",
    "authors": [
      "Yong Liu",
      "Hanzhou Wu",
      "Xinpeng Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.03948",
    "title": "AWEncoder: Adversarial Watermarking Pre-trained Encoders in Contrastive  Learning",
    "abstract": "As a self-supervised learning paradigm, contrastive learning has been widely used to pre-train a powerful encoder as an effective feature extractor for various downstream tasks. This process requires numerous unlabeled training data and computational resources, which makes the pre-trained encoder become valuable intellectual property of the owner. However, the lack of a priori knowledge of downstream tasks makes it non-trivial to protect the intellectual property of the pre-trained encoder by applying conventional watermarking methods. To deal with this problem, in this paper, we introduce AWEncoder, an adversarial method for watermarking the pre-trained encoder in contrastive learning. First, as an adversarial perturbation, the watermark is generated by enforcing the training samples to be marked to deviate respective location and surround a randomly selected key image in the embedding space. Then, the watermark is embedded into the pre-trained encoder by further optimizing a joint loss function. As a result, the watermarked encoder not only performs very well for downstream tasks, but also enables us to verify its ownership by analyzing the discrepancy of output provided using the encoder as the backbone under both white-box and black-box conditions. Extensive experiments demonstrate that the proposed work enjoys pretty good effectiveness and robustness on different contrastive learning algorithms and downstream tasks, which has verified the superiority and applicability of the proposed work. ",
    "url": "https://arxiv.org/abs/2208.03948",
    "authors": [
      "Tianxing Zhang",
      "Hanzhou Wu",
      "Xiaofeng Lu",
      "Guangling Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2208.03958",
    "title": "Abutting Grating Illusion: Cognitive Challenge to Neural Network Models",
    "abstract": "Even the state-of-the-art deep learning models lack fundamental abilities compared to humans. Multiple comparison paradigms have been proposed to explore the distinctions between humans and deep learning. While most comparisons rely on corruptions inspired by mathematical transformations, very few have bases on human cognitive phenomena. In this study, we propose a novel corruption method based on the abutting grating illusion, which is a visual phenomenon widely discovered in both human and a wide range of animal species. The corruption method destroys the gradient-defined boundaries and generates the perception of illusory contours using line gratings abutting each other. We applied the method on MNIST, high resolution MNIST, and silhouette object images. Various deep learning models are tested on the corruption, including models trained from scratch and 109 models pretrained with ImageNet or various data augmentation techniques. Our results show that abutting grating corruption is challenging even for state-of-the-art deep learning models because most models are randomly guessing. We also discovered that the DeepAugment technique can greatly improve robustness against abutting grating illusion. Visualisation of early layers indicates that better performing models exhibit stronger end-stopping property, which is consistent with neuroscience discoveries. To validate the corruption method, 24 human subjects are involved to classify samples of corrupted datasets. ",
    "url": "https://arxiv.org/abs/2208.03958",
    "authors": [
      "Jinyu Fan",
      "Yi Zeng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.03974",
    "title": "Aerial Monocular 3D Object Detection",
    "abstract": "Drones equipped with cameras can significantly enhance human ability to perceive the world because of their remarkable maneuverability in 3D space. Ironically, object detection for drones has always been conducted in the 2D image space, which fundamentally limits their ability to understand 3D scenes. Furthermore, existing 3D object detection methods developed for autonomous driving cannot be directly applied to drones due to the lack of deformation modeling, which is essential for the distant aerial perspective with sensitive distortion and small objects. To fill the gap, this work proposes a dual-view detection system named DVDET to achieve aerial monocular object detection in both the 2D image space and the 3D physical space. To address the severe view deformation issue, we propose a novel trainable geo-deformable transformation module that can properly warp information from the drone's perspective to the BEV. Compared to the monocular methods for cars, our transformation includes a learnable deformable network for explicitly revising the severe deviation. To address the dataset challenge, we propose a new large-scale simulation dataset named AM3D-Sim, generated by the co-simulation of AirSIM and CARLA, and a new real-world aerial dataset named AM3D-Real, collected by DJI Matrice 300 RTK, in both datasets, high-quality annotations for 3D object detection are provided. Extensive experiments show that i) aerial monocular 3D object detection is feasible; ii) the model pre-trained on the simulation dataset benefits real-world performance, and iii) DVDET also benefits monocular 3D object detection for cars. To encourage more researchers to investigate this area, we will release the dataset and related code in https://sjtu-magic.github.io/dataset/AM3D/. ",
    "url": "https://arxiv.org/abs/2208.03974",
    "authors": [
      "Yue Hu",
      "Shaoheng Fang",
      "Weidi Xie",
      "Siheng Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.03980",
    "title": "Towards lifelong learning of Recurrent Neural Networks for control  design",
    "abstract": "This paper proposes a method for lifelong learning of Recurrent Neural Networks, such as NNARX, ESN, LSTM, and GRU, to be used as plant models in control system synthesis. The problem is significant because in many practical applications it is required to adapt the model when new information is available and/or the system undergoes changes, without the need to store an increasing amount of data as time proceeds. Indeed, in this context, many problems arise, such as the well known Catastrophic Forgetting and Capacity Saturation ones. We propose an adaptation algorithm inspired by Moving Horizon Estimators, deriving conditions for its convergence. The described method is applied to a simulated chemical plant, already adopted as a challenging benchmark in the existing literature. The main results achieved are discussed. ",
    "url": "https://arxiv.org/abs/2208.03980",
    "authors": [
      "Fabio Bonassi",
      "Jing Xie",
      "Marcello Farina",
      "Riccardo Scattolini"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03986",
    "title": "One-Hop Listening Based ARQs for Low-Latency Communication in Multi-Hop  Networks",
    "abstract": "Inspired by emerging applications in vehicular networks, we address the problem of achieving high-reliability and low-latency communication in multi-hop wireless networks. We propose a new family of Automatic-Repeat-Requests (ARQs) based cooperative strategies wherein high end-to-end reliability is obtained using packet re-transmissions at each hop while the low-latency constraint is met by imposing an upper bound on the total number of packet retransmissions across the network. A hallmark of our strategies is the one-hop listening capability wherein nodes utilize the unused ARQs of their preceding node just by counting the number of failed attempts due to decoding errors. We further extend the idea of one-hop listening to multi-hop listening, wherein a set of consecutive nodes form clusters to utilize the unused ARQs of the preceding nodes, beyond its nearest neighbour, to further improve reliability. Thus, our strategies provide the high-reliability feature with no compromise in the original latency-constraint. For the proposed strategies, we solve non-linear optimization problems on distributing the ARQs across the nodes so as to minimize packet drop probability (PDP) subject to a total number of ARQs in the network. Through extensive theoretical results on PDP and delay profiles, we show that the proposed strategies outperform the best-known strategies in this space. ",
    "url": "https://arxiv.org/abs/2208.03986",
    "authors": [
      "Jaya Goel",
      "J. Harshan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2208.03993",
    "title": "CaST: A Toolchain for Creating and Characterizing Realistic Wireless  Network Emulation Scenarios",
    "abstract": "Large-scale wireless testbeds have been extensively used by researchers in the past years. Among others, high-fidelity FPGA-based emulation platforms have unique capabilities in faithfully mimicking the conditions of real-world wireless environments in real-time, at scale, and with full repeatability. However, the reliability of the solutions developed in emulated platforms is heavily dependent on the emulation precision. CaST brings to the wireless network emulator landscape what it has been missing so far: an open, virtualized and software-based channel generator and sounder toolchain with unmatched precision in creating and characterizing quasi-real-world wireless network scenarios. CaST consists of (i) a framework to create mobile wireless scenarios from ray-tracing models for FPGA-based emulation platforms, and (ii) a containerized Software Defined Radio-based channel sounder to precisely characterize the emulated channels. We design, deploy and validate multi-path mobile scenarios on the world's largest wireless network emulator, Colosseum, and further demonstrate that CaST achieves up to 20 ns accuracy in sounding the Channel Impulse Response tap delays, and 0.5 dB accuracy in measuring the tap gains. ",
    "url": "https://arxiv.org/abs/2208.03993",
    "authors": [
      "Davide Villa",
      "Miead Tehrani-Moayyed",
      "Pedram Johari",
      "Stefano Basagni",
      "Tommaso Melodia"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2208.04010",
    "title": "Application of Guessing to Sequential Decoding of Polarization-Adjusted  Convolutional (PAC) Codes",
    "abstract": "Despite the extreme error-correction performance, the amount of computation of sequential decoding of the polarization-adjusted convolutional (PAC) codes is random. In sequential decoding of convolutional codes, the computational cutoff rate denotes the region between rates whose average computational complexity of decoding is finite and those which is infinite. In this paper, by benefiting from the polarization and guessing techniques, we prove that the computational cutoff rate in sequential decoding of pre-transformed polar codes polarizes. The polarization of the computational cutoff rate affects the criteria for the rate-profile construction of the pre-transformed polar codes. We propose a technique for taming the Reed-Muller (RM) rate-profile construction, and the performance results demonstrate that the error-correction performance of the PAC codes can achieve the theoretical bounds using the tamed-RM rate-profile construction and requires a significantly lower computational complexity than the RM rate-profile construction. ",
    "url": "https://arxiv.org/abs/2208.04010",
    "authors": [
      "Mohsen Moradi"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2208.04018",
    "title": "Hybrid-ARQ Based Relaying Strategies for Enhancing Reliability in  Delay-Bounded Networks",
    "abstract": "Inspired by several delay-bounded mission-critical applications, this paper investigates chase-combining-based hybrid automatic repeat request (CC-HARQ) protocols to achieve high reliability in delay-constrained applications. A salient feature of our approach is to use the end-to-end delay constraint for computing the total number of ARQs permitted in the network, and then optimally distributing them across the nodes so as to minimize packet-drop-probability (PDP), which is the end-to-end reliability metric of interest. Since the chase-combining strategy combines the received packets across multiple attempts, we observe that the PDP of the network depends on the coherence-time of the intermediate wireless channels. As a result, we address the question of computing optimal allocation of ARQs for CC-HARQ strategies under both slow-fading and fast-fading scenarios. For both the channel conditions, we derive closed-form expressions for the PDP, and then formulate several optimization problems for minimizing the PDP for a given delay-bound. Using extensive theoretical results on the local minima of the optimization problems, we synthesize low-complexity algorithms to obtain near-optimal ARQ distributions. Besides using extensive simulation results to validate our findings, a detailed end-to-end delay analysis is also presented to show that the proposed CC-HARQ strategies outperform already known Type-1 ARQ based strategies in several scenarios. ",
    "url": "https://arxiv.org/abs/2208.04018",
    "authors": [
      "Jaya Goel",
      "J. Harshan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2208.04022",
    "title": "Sparse Attentive Memory Network for Click-through Rate Prediction with  Long Sequences",
    "abstract": "Sequential recommendation predicts users' next behaviors with their historical interactions. Recommending with longer sequences improves recommendation accuracy and increases the degree of personalization. As sequences get longer, existing works have not yet addressed the following two main challenges. Firstly, modeling long-range intra-sequence dependency is difficult with increasing sequence lengths. Secondly, it requires efficient memory and computational speeds. In this paper, we propose a Sparse Attentive Memory (SAM) network for long sequential user behavior modeling. SAM supports efficient training and real-time inference for user behavior sequences with lengths on the scale of thousands. In SAM, we model the target item as the query and the long sequence as the knowledge database, where the former continuously elicits relevant information from the latter. SAM simultaneously models target-sequence dependencies and long-range intra-sequence dependencies with O(L) complexity and O(1) number of sequential updates, which can only be achieved by the self-attention mechanism with O(L^2) complexity. Extensive empirical results demonstrate that our proposed solution is effective not only in long user behavior modeling but also on short sequences modeling. Implemented on sequences of length 1000, SAM is successfully deployed on one of the largest international E-commerce platforms. This inference time is within 30ms, with a substantial 7.30% click-through rate improvement for the online A/B test. To the best of our knowledge, it is the first end-to-end long user sequence modeling framework that models intra-sequence and target-sequence dependencies with the aforementioned degree of efficiency and successfully deployed on a large-scale real-time industrial recommender system. ",
    "url": "https://arxiv.org/abs/2208.04022",
    "authors": [
      "Qianying Lin",
      "Wen-Ji Zhou",
      "Yanshi Wang",
      "Qing Da",
      "Qing-Guo Chen",
      "Bing Wang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.04024",
    "title": "Social Simulacra: Creating Populated Prototypes for Social Computing  Systems",
    "abstract": "Social computing prototypes probe the social behaviors that may arise in an envisioned system design. This prototyping practice is currently limited to recruiting small groups of people. Unfortunately, many challenges do not arise until a system is populated at a larger scale. Can a designer understand how a social system might behave when populated, and make adjustments to the design before the system falls prey to such challenges? We introduce social simulacra, a prototyping technique that generates a breadth of realistic social interactions that may emerge when a social computing system is populated. Social simulacra take as input the designer's description of a community's design -- goal, rules, and member personas -- and produce as output an instance of that design with simulated behavior, including posts, replies, and anti-social behaviors. We demonstrate that social simulacra shift the behaviors that they generate appropriately in response to design changes, and that they enable exploration of \"what if?\" scenarios where community members or moderators intervene. To power social simulacra, we contribute techniques for prompting a large language model to generate thousands of distinct community members and their social interactions with each other; these techniques are enabled by the observation that large language models' training data already includes a wide variety of positive and negative behavior on social media platforms. In evaluations, we show that participants are often unable to distinguish social simulacra from actual community behavior and that social computing designers successfully refine their social computing designs when using social simulacra. ",
    "url": "https://arxiv.org/abs/2208.04024",
    "authors": [
      "Joon Sung Park",
      "Lindsay Popowski",
      "Carrie J. Cai",
      "Meredith Ringel Morris",
      "Percy Liang",
      "Michael S. Bernstein"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2208.04026",
    "title": "Two-Stream Networks for Object Segmentation in Videos",
    "abstract": "Existing matching-based approaches perform video object segmentation (VOS) via retrieving support features from a pixel-level memory, while some pixels may suffer from lack of correspondence in the memory (i.e., unseen), which inevitably limits their segmentation performance. In this paper, we present a Two-Stream Network (TSN). Our TSN includes (i) a pixel stream with a conventional pixel-level memory, to segment the seen pixels based on their pixellevel memory retrieval. (ii) an instance stream for the unseen pixels, where a holistic understanding of the instance is obtained with dynamic segmentation heads conditioned on the features of the target instance. (iii) a pixel division module generating a routing map, with which output embeddings of the two streams are fused together. The compact instance stream effectively improves the segmentation accuracy of the unseen pixels, while fusing two streams with the adaptive routing map leads to an overall performance boost. Through extensive experiments, we demonstrate the effectiveness of our proposed TSN, and we also report state-of-the-art performance of 86.1% on YouTube-VOS 2018 and 87.5% on the DAVIS-2017 validation split. ",
    "url": "https://arxiv.org/abs/2208.04026",
    "authors": [
      "Hannan Lu",
      "Zhi Tian",
      "Lirong Yang",
      "Haibing Ren",
      "Wangmeng Zuo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04035",
    "title": "TGAVC: Improving Autoencoder Voice Conversion with Text-Guided and  Adversarial Training",
    "abstract": "Non-parallel many-to-many voice conversion remains an interesting but challenging speech processing task. Recently, AutoVC, a conditional autoencoder based method, achieved excellent conversion results by disentangling the speaker identity and the speech content using information-constraining bottlenecks. However, due to the pure autoencoder training method, it is difficult to evaluate the separation effect of content and speaker identity. In this paper, a novel voice conversion framework, named $\\boldsymbol T$ext $\\boldsymbol G$uided $\\boldsymbol A$utoVC(TGAVC), is proposed to more effectively separate content and timbre from speech, where an expected content embedding produced based on the text transcriptions is designed to guide the extraction of voice content. In addition, the adversarial training is applied to eliminate the speaker identity information in the estimated content embedding extracted from speech. Under the guidance of the expected content embedding and the adversarial training, the content encoder is trained to extract speaker-independent content embedding from speech. Experiments on AIShell-3 dataset show that the proposed model outperforms AutoVC in terms of naturalness and similarity of converted speech. ",
    "url": "https://arxiv.org/abs/2208.04035",
    "authors": [
      "Huaizhen Tang",
      "Xulong Zhang",
      "Jianzong Wang",
      "Ning Cheng",
      "Zhen Zeng",
      "Edward Xiao",
      "Jing Xiao"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2208.04043",
    "title": "SLiDE: Self-supervised LiDAR De-snowing through Reconstruction  Difficulty",
    "abstract": "LiDAR is widely used to capture accurate 3D outdoor scene structures. However, LiDAR produces many undesirable noise points in snowy weather, which hamper analyzing meaningful 3D scene structures. Semantic segmentation with snow labels would be a straightforward solution for removing them, but it requires laborious point-wise annotation. To address this problem, we propose a novel self-supervised learning framework for snow points removal in LiDAR point clouds. Our method exploits the structural characteristic of the noise points: low spatial correlation with their neighbors. Our method consists of two deep neural networks: Point Reconstruction Network (PR-Net) reconstructs each point from its neighbors; Reconstruction Difficulty Network (RD-Net) predicts point-wise difficulty of the reconstruction by PR-Net, which we call reconstruction difficulty. With simple post-processing, our method effectively detects snow points without any label. Our method achieves the state-of-the-art performance among label-free approaches and is comparable to the fully-supervised method. Moreover, we demonstrate that our method can be exploited as a pretext task to improve label-efficiency of supervised training of de-snowing. ",
    "url": "https://arxiv.org/abs/2208.04043",
    "authors": [
      "Gwangtak Bae",
      "Byungjun Kim",
      "Seongyong Ahn",
      "Jihong Min",
      "Inwook Shim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04045",
    "title": "Rapid Flow Behavior Modeling of Thermal Interface Materials Using Deep  Neural Networks",
    "abstract": "Thermal Interface Materials (TIMs) are widely used in electronic packaging. Increasing power density and limited assembly space pose high demands on thermal management. Large cooling surfaces need to be covered efficiently. When joining the heatsink, previously dispensed TIM spreads over the cooling surface. Recommendations on the dispensing pattern exist only for simple surface geometries such as rectangles. For more complex geometries, Computational Fluid Dynamics (CFD) simulations are used in combination with manual experiments. While CFD simulations offer a high accuracy, they involve simulation experts and are rather expensive to set up. We propose a lightweight heuristic to model the spreading behavior of TIM. We further speed up the calculation by training an Artificial Neural Network (ANN) on data from this model. This offers rapid computation times and further supplies gradient information. This ANN can not only be used to aid manual pattern design of TIM, but also enables an automated pattern optimization. We compare this approach against the state-of-the-art and use real product samples for validation. ",
    "url": "https://arxiv.org/abs/2208.04045",
    "authors": [
      "Simon Baeuerle",
      "Marius Gebhardt",
      "Jonas Barth",
      "Andreas Steimer",
      "Ralf Mikut"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04050",
    "title": "Bluetooth Low Energy mesh network for power-limited, robust and reliable  IoT services",
    "abstract": "Bluetooth Low Energy (BLE) is an emerging wireless technology created for short-range control and monitoring applications that is becoming increasingly widespread among the Internet of Things (IoT) services because of its low-cost and low-energy consumption. In this paper, we propose a novel neighbor discovery scheme and failure recovery techniques for multi-path and single-path low-power and reliable BLE networks. By exploiting energy-efficient access control and fast and robust routing ideas with adaptive failure recovery, the proposed methods outperform the well-known flooding approach used by the BLE Mesh standard. We show varying improvements in packet latency and power consumption in event-driven simulations as network topology and traffic changes. The failure recovery approaches proposed are optimized and demonstrated during the simulations, showing the varying of the overall failure recovery latency and node power consumption in different use cases. ",
    "url": "https://arxiv.org/abs/2208.04050",
    "authors": [
      "Davide Villa",
      "Chih-Kuang Lin",
      "Adam Kuenzi",
      "Michael Lang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2208.04055",
    "title": "Neural Set Function Extensions: Learning with Discrete Functions in High  Dimensions",
    "abstract": "Integrating functions on discrete domains into neural networks is key to developing their capability to reason about discrete objects. But, discrete domains are (1) not naturally amenable to gradient-based optimization, and (2) incompatible with deep learning architectures that rely on representations in high-dimensional vector spaces. In this work, we address both difficulties for set functions, which capture many important discrete problems. First, we develop a framework for extending set functions onto low-dimensional continuous domains, where many extensions are naturally defined. Our framework subsumes many well-known extensions as special cases. Second, to avoid undesirable low-dimensional neural network bottlenecks, we convert low-dimensional extensions into representations in high-dimensional spaces, taking inspiration from the success of semidefinite programs for combinatorial optimization. Empirically, we observe benefits of our extensions for unsupervised neural combinatorial optimization, in particular with high-dimensional representations. ",
    "url": "https://arxiv.org/abs/2208.04055",
    "authors": [
      "Nikolaos Karalias",
      "Joshua Robinson",
      "Andreas Loukas",
      "Stefanie Jegelka"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04074",
    "title": "Bug-Fix Variants: Visualizing Unique Source Code Changes across GitHub  Forks",
    "abstract": "Forking is a common practice for developers when building upon on already existing projects. These forks create variants, which have a common code base but then evolve the code in different directions, which is specific to that forked project requirements. An interesting side-effect of having multiple forks is the ability to select between different evolution directions of the code which is based on developers fixing bugs in the code base. However, the key issue that this decentralized form of information is difficult to analyze. In this study, we propose a visualization to analyze active changes in fork repositories that have not been merged back to the original project. Our visualization shows code commit activities in multiple forks with highlight on bug fix commits in the history of forks. While the commit activity of each repository is visualized similarly to the code frequency view of GitHub, our view shows only commits unique to fork repositories. To illustrate the effectiveness of our visualization, we have applied our view to two use cases: identifying forks from a repository no longer maintained, and identifying a bug fix among forks. In the first case, we identify a fork of a suspended project named Obfuscator-LLVM. Our view shows the original repository and its most active fork that continue the development on the top. In the second case, we identify a bug fix in a fork of Clipy project. Our view shows that the most active fork has its own bug fixes; we could easily identify a patch for the bug highlighted in the view. As a new ideas paper, we then present our outline of three research questions to spark real world use-cases and goals for our visualization has the potential to uncover. A prototype of our visualization is available at \\textcolor{blue}{\\url{https://naist-se.github.io/vissoft2022/} ",
    "url": "https://arxiv.org/abs/2208.04074",
    "authors": [
      "Daigo Imamura",
      "Takashi Ishio",
      "Raula Gaikovina Kula",
      "Kenichi Matsumoto"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2208.04087",
    "title": "Self-Dual Convolutional Codes",
    "abstract": "This paper investigates the concept of self-dual convolutional code. We derive the basic properties of this interesting class of codes and we show how some of the techniques to construct self-dual linear block codes generalize to self-dual convolutional codes. As for self-dual linear block codes we are able to give a complete classification for some small parameters. ",
    "url": "https://arxiv.org/abs/2208.04087",
    "authors": [
      "Sebastian Heri",
      "Julia Lieb",
      "Joachim Rosenthal"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2208.04097",
    "title": "You are what you browse: A robust framework for uncovering political  ideology",
    "abstract": "The political opinion landscape, in a democratic country, lays the foundation for the policies that are enacted, and the political actions of individuals. As such, a reliable measure of ideology is an important first step in a river of downstream problems, such as; understanding polarization, opinion dynamics modeling, and detecting and intervening in disinformation campaigns. However, ideology detection is an inherently difficult task, and researchers encounter two main hindrances when approaching an ideology pipeline. Firstly, the ground truth that forms the basis for ideology detection is often labor-intensive to collect and becomes irrelevant with time. Furthermore, these sources are often biased and not robust between domains. Secondly, it is not clear through what lens to view users to infer their ideology, given a small set of users where this ideology is known. In this work, we present an end-to-end political ideology pipeline, which includes; a domain-independent ground truth based on the slant of media users' share, a socially-informed lense allowing performant ideology inference, and an appropriate classifier methodology. We apply the pipeline to both the conventional use case of left-right ideology detection, and the detection of far-right users (who are often of more concern). The ideology detection pipeline can be applied directly to investigate communities of interest, and sets a strong footing for a plethora of downstream tasks. ",
    "url": "https://arxiv.org/abs/2208.04097",
    "authors": [
      "Rohit Ram",
      "Marian-Andrei Rizoiu"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2208.04114",
    "title": "Automatic lesion analysis for increased efficiency in outcome prediction  of traumatic brain injury",
    "abstract": "The accurate prognosis for traumatic brain injury (TBI) patients is difficult yet essential to inform therapy, patient management, and long-term after-care. Patient characteristics such as age, motor and pupil responsiveness, hypoxia and hypotension, and radiological findings on computed tomography (CT), have been identified as important variables for TBI outcome prediction. CT is the acute imaging modality of choice in clinical practice because of its acquisition speed and widespread availability. However, this modality is mainly used for qualitative and semi-quantitative assessment, such as the Marshall scoring system, which is prone to subjectivity and human errors. This work explores the predictive power of imaging biomarkers extracted from routinely-acquired hospital admission CT scans using a state-of-the-art, deep learning TBI lesion segmentation method. We use lesion volumes and corresponding lesion statistics as inputs for an extended TBI outcome prediction model. We compare the predictive power of our proposed features to the Marshall score, independently and when paired with classic TBI biomarkers. We find that automatically extracted quantitative CT features perform similarly or better than the Marshall score in predicting unfavourable TBI outcomes. Leveraging automatic atlas alignment, we also identify frontal extra-axial lesions as important indicators of poor outcome. Our work may contribute to a better understanding of TBI, and provides new insights into how automated neuroimaging analysis can be used to improve prognostication after TBI. ",
    "url": "https://arxiv.org/abs/2208.04114",
    "authors": [
      "Margherita Rosnati",
      "Eyal Soreq",
      "Miguel Monteiro",
      "Lucia Li",
      "Neil S.N. Graham",
      "Karl Zimmerman",
      "Carlotta Rossi",
      "Greta Carrara",
      "Guido Bertolini",
      "David J. Sharp",
      "Ben Glocker"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04125",
    "title": "Is this Change the Answer to that Problem? Correlating Descriptions of  Bug and Code Changes for Evaluating Patch Correctness",
    "abstract": "In this work, we propose a novel perspective to the problem of patch correctness assessment: a correct patch implements changes that \"answer\" to a problem posed by buggy behaviour. Concretely, we turn the patch correctness assessment into a Question Answering problem. To tackle this problem, our intuition is that natural language processing can provide the necessary representations and models for assessing the semantic correlation between a bug (question) and a patch (answer). Specifically, we consider as inputs the bug reports as well as the natural language description of the generated patches. Our approach, Quatrain, first considers state of the art commit message generation models to produce the relevant inputs associated to each generated patch. Then we leverage a neural network architecture to learn the semantic correlation between bug reports and commit messages. Experiments on a large dataset of 9135 patches generated for three bug datasets (Defects4j, Bugs.jar and Bears) show that Quatrain can achieve an AUC of 0.886 on predicting patch correctness, and recalling 93% correct patches while filtering out 62% incorrect patches. Our experimental results further demonstrate the influence of inputs quality on prediction performance. We further perform experiments to highlight that the model indeed learns the relationship between bug reports and code change descriptions for the prediction. Finally, we compare against prior work and discuss the benefits of our approach. ",
    "url": "https://arxiv.org/abs/2208.04125",
    "authors": [
      "Haoye Tian",
      "Xunzhu Tang",
      "Andrew Habib",
      "Shangwen Wang",
      "Kui Liu",
      "Xin Xia",
      "Jacques Klein",
      "Tegawendé F. Bissyandé"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.04130",
    "title": "Reliability Analysis of Complex Multi-State System Based on Universal  Generating Function and Bayesian Network",
    "abstract": "In the complex multi-state system (MSS), reliability analysis is a significant research content, both for equipment design, manufacturing, usage and maintenance. Universal Generating Function (UGF) is an important method in the reliability analysis, which efficiently obtains the system reliability by a fast algebraic procedure. However, when structural relationships between subsystems or components are not clear or without explicit expressions, the UGF method is difficult to use or not applicable at all. Bayesian Network (BN) has a natural advantage in terms of uncertainty inference for the relationship without explicit expressions. For the number of components is extremely large, though, it has the defects of low efficiency. To overcome the respective defects of UGF and BN, a novel reliability analysis method called UGF-BN is proposed for the complex MSS. In the UGF-BN framework, the UGF method is firstly used to analyze the bottom components with a large number. Then probability distributions obtained are taken as the input of BN. Finally, the reliability of the complex MSS is modeled by the BN method. This proposed method improves the computational efficiency, especially for the MSS with the large number of bottom components. Besides, the aircraft reliability-based design optimization based on the UGF-BN method is further studied with budget constraints on mass, power, and cost. Finally, two cases are used to demonstrate and verify the proposed method. ",
    "url": "https://arxiv.org/abs/2208.04130",
    "authors": [
      "Xu Liu",
      "Wen Yao",
      "Xiaohu Zheng",
      "Yingchun Xu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04135",
    "title": "Adversarial Attacks on Image Generation With Made-Up Words",
    "abstract": "Text-guided image generation models can be prompted to generate images using nonce words adversarially designed to robustly evoke specific visual concepts. Two approaches for such generation are introduced: macaronic prompting, which involves designing cryptic hybrid words by concatenating subword units from different languages; and evocative prompting, which involves designing nonce words whose broad morphological features are similar enough to that of existing words to trigger robust visual associations. The two methods can also be combined to generate images associated with more specific visual concepts. The implications of these techniques for the circumvention of existing approaches to content moderation, and particularly the generation of offensive or harmful images, are discussed. ",
    "url": "https://arxiv.org/abs/2208.04135",
    "authors": [
      "Raphaël Millière"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04144",
    "title": "An Urban Population Health Observatory for Disease Causal Pathway  Analysis and Decision Support: Underlying Explainable Artificial Intelligence  Model",
    "abstract": "This study sought to (1) expand our existing Urban Population Health Observatory (UPHO) system by incorporating a semantics layer; (2) cohesively employ machine learning and semantic/logical inference to provide measurable evidence and detect pathways leading to undesirable health outcomes; (3) provide clinical use case scenarios and design case studies to identify socioenvironmental determinants of health associated with the prevalence of obesity, and (4) design a dashboard that demonstrates the use of UPHO in the context of obesity surveillance using the provided scenarios. The system design includes a knowledge graph generation component that provides contextual knowledge from relevant domains of interest. This system leverages semantics using concepts, properties, and axioms from existing ontologies. In addition, we used the publicly available US Centers for Disease Control and Prevention 500 Cities data set to perform multivariate analysis. A cohesive approach that employs machine learning and semantic/logical inference reveals pathways leading to diseases. In this study, we present 2 clinical case scenarios and a proof-of-concept prototype design of a dashboard that provides warnings, recommendations, and explanations and demonstrates the use of UPHO in the context of obesity surveillance, treatment, and prevention. While exploring the case scenarios using a support vector regression machine learning model, we found that poverty, lack of physical activity, education, and unemployment were the most important predictive variables that contribute to obesity in Memphis, TN. The application of UPHO could help reduce health disparities and improve urban population health. The expanded UPHO feature incorporates an additional level of interpretable knowledge to enhance physicians, researchers, and health officials' informed decision-making at both patient and community levels. ",
    "url": "https://arxiv.org/abs/2208.04144",
    "authors": [
      "Whitney S Brakefield",
      "Nariman Ammar",
      "Arash Shaban-Nejad"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04150",
    "title": "Efficient Neural Net Approaches in Metal Casting Defect Detection",
    "abstract": "One of the most pressing challenges prevalent in the steel manufacturing industry is the identification of surface defects. Early identification of casting defects can help boost performance, including streamlining production processes. Though, deep learning models have helped bridge this gap and automate most of these processes, there is a dire need to come up with lightweight models that can be deployed easily with faster inference times. This research proposes a lightweight architecture that is efficient in terms of accuracy and inference time compared with sophisticated pre-trained CNN architectures like MobileNet, Inception, and ResNet, including vision transformers. Methodologies to minimize computational requirements such as depth-wise separable convolution and global average pooling (GAP) layer, including techniques that improve architectural efficiencies and augmentations, have been experimented. Our results indicate that a custom model of 590K parameters with depth-wise separable convolutions outperformed pretrained architectures such as Resnet and Vision transformers in terms of accuracy (81.87%) and comfortably outdid architectures such as Resnet, Inception, and Vision transformers in terms of faster inference times (12 ms). Blurpool fared outperformed other techniques, with an accuracy of 83.98%. Augmentations had a paradoxical effect on the model performance. No direct correlation between depth-wise and 3x3 convolutions on inference time, they, however, they played a direct role in improving model efficiency by enabling the networks to go deeper and by decreasing the number of trainable parameters. Our work sheds light on the fact that custom networks with efficient architectures and faster inference times can be built without the need of relying on pre-trained architectures. ",
    "url": "https://arxiv.org/abs/2208.04150",
    "authors": [
      "Rohit Lal",
      "Bharath Kumar Bolla",
      "Sabeesh Ethiraj"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2208.04153",
    "title": "[Reproducibility Report] Path Planning using Neural A* Search",
    "abstract": "The following paper is a reproducibility report for \"Path Planning using Neural A* Search\" published in ICML2 2021 as part of the ML Reproducibility Challenge 2021. The original paper proposes the Neural A* planner, and claims it achieves an optimal balance between the reduction of node expansions and path accuracy. We verify this claim by reimplementing the model in a different framework and reproduce the data published in the original paper. We have also provided a code-flow diagram to aid comprehension of the code structure. As extensions to the original paper, we explore the effects of (1) generalizing the model by training it on a shuffled dataset, (2) introducing dropout, (3) implementing empirically chosen hyperparameters as trainable parameters in the model, (4) altering the network model to Generative Adversarial Networks (GANs) to introduce stochasticity, (5) modifying the encoder from Unet to Unet++, (6) incorporating cost maps obtained from the Neural A* module in other variations of A* search. ",
    "url": "https://arxiv.org/abs/2208.04153",
    "authors": [
      "Shreya Bhatt",
      "Aayush Jain",
      "Parv Maheshwari",
      "Animesh Jha",
      "Debashish Chakravarty"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.04165",
    "title": "Neural Message Passing for Visual Relationship Detection",
    "abstract": "Visual relationship detection aims to detect the interactions between objects in an image; however, this task suffers from combinatorial explosion due to the variety of objects and interactions. Since the interactions associated with the same object are dependent, we explore the dependency of interactions to reduce the search space. We explicitly model objects and interactions by an interaction graph and then propose a message-passing-style algorithm to propagate the contextual information. We thus call the proposed method neural message passing (NMP). We further integrate language priors and spatial cues to rule out unrealistic interactions and capture spatial interactions. Experimental results on two benchmark datasets demonstrate the superiority of our proposed method. Our code is available at https://github.com/PhyllisH/NMP. ",
    "url": "https://arxiv.org/abs/2208.04165",
    "authors": [
      "Yue Hu",
      "Siheng Chen",
      "Xu Chen",
      "Ya Zhang",
      "Xiao Gu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04171",
    "title": "Object Detection Using Sim2Real Domain Randomization for Robotic  Applications",
    "abstract": "Robots working in unstructured environments must be capable of sensing and interpreting their surroundings. One of the main obstacles of deep learning based models in the field of robotics is the lack of domain-specific labeled data for different industrial applications. In this paper, we propose a sim2real transfer learning method based on domain randomization for object detection with which labeled synthetic datasets of arbitrary size and object types can be automatically generated. Subsequently, a state-of-the-art convolutional neural network, YOLOv4, is trained to detect the different types of industrial objects. With the proposed domain randomization method, we could shrink the reality gap to a satisfactory level, achieving 86.32% and 97.38% mAP50 scores respectively in the case of zero-shot and one-shot transfers, on our manually annotated dataset containing 190 real images. On a GeForce RTX 2080 Ti GPU, the data generation process takes less than 0.5s per image and the training lasts around 12h which makes it convenient for industrial use. Our solution matches industrial needs as it can reliably differentiate similar classes of objects by using only 1 real image for training. To our best knowledge, this is the only work thus far satisfying these constraints. ",
    "url": "https://arxiv.org/abs/2208.04171",
    "authors": [
      "Dániel Horváth",
      "Gábor Erdős",
      "Zoltán Istenes",
      "Tomáš Horváth",
      "Sándor Földi"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04173",
    "title": "SsaA: A Self-supervised auto-Annotation System for Online Visual  Inspection and Manufacturing Automation",
    "abstract": "Recent trends in cloud computing technology effectively boosted the application of visual inspection. However, most of the available systems work in a human-in-the-loop manner and can not provide long-term support to the online application. To make a step forward, this paper outlines an automatic annotation system called SsaA, working in a self-supervised learning manner, for continuously making the online visual inspection in the manufacturing automation scenarios. Benefit from the self-supervised learning, SsaA is effective to establish a visual inspection application for the whole life-cycle of manufacturing. In the early stage, with only the anomaly-free data, the unsupervised algorithms are adopted to process the pretext task and generate coarse labels for the following data. Then supervised algorithms are trained for the downstream task. With user-friendly web-based interfaces, SsaA is very convenient to integrate and deploy both of the unsupervised and supervised algorithms. So far, the SsaA system has been adopted for some real-life industrial applications. ",
    "url": "https://arxiv.org/abs/2208.04173",
    "authors": [
      "Jiawei Li",
      "Bolin Jiang",
      "Yan Liu",
      "Chengxiao Luo",
      "Naiqi Li",
      "Bin Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.04190",
    "title": "SA-NET.v2: Real-time vehicle detection from oblique UAV images with use  of uncertainty estimation in deep meta-learning",
    "abstract": "In recent years, unmanned aerial vehicle (UAV) imaging is a suitable solution for real-time monitoring different vehicles on the urban scale. Real-time vehicle detection with the use of uncertainty estimation in deep meta-learning for the portable platforms (e.g., UAV) potentially improves video understanding in real-world applications with a small training dataset, while many vehicle monitoring approaches appear to understand single-time detection with a big training dataset. The purpose of real-time vehicle detection from oblique UAV images is to locate the vehicle on the time series UAV images by using semantic segmentation. Real-time vehicle detection is more difficult due to the variety of depth and scale vehicles in oblique view UAV images. Motivated by these facts, in this manuscript, we consider the problem of real-time vehicle detection for oblique UAV images based on a small training dataset and deep meta-learning. The proposed architecture, called SA-Net.v2, is a developed method based on the SA-CNN for real-time vehicle detection by reformulating the squeeze-and-attention mechanism. The SA-Net.v2 is composed of two components, including the squeeze-and-attention function that extracts the high-level feature based on a small training dataset, and the gated CNN. For the real-time vehicle detection scenario, we test our model on the UAVid dataset. UAVid is a time series oblique UAV images dataset consisting of 30 video sequences. We examine the proposed method's applicability for stand real-time vehicle detection in urban environments using time series UAV images. The experiments show that the SA-Net.v2 achieves promising performance in time series oblique UAV images. ",
    "url": "https://arxiv.org/abs/2208.04190",
    "authors": [
      "Mehdi Khoshboresh-Masouleh",
      "Reza Shah-Hosseini"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04192",
    "title": "Institutional Collaboration Recommendation: An expertise-based framework  using NLP and Network Analysis",
    "abstract": "The shift from 'trust-based funding' to 'performance-based funding' is one of the factors that has forced institutions to strive for continuous improvement of performance. Several studies have established the importance of collaboration in enhancing the performance of paired institutions. However, identification of suitable institutions for collaboration is sometimes difficult and therefore institutional collaboration recommendation systems can be vital. Currently, there are no well-developed institutional collaboration recommendation systems. In order to bridge this gap, we design a framework that recognizes thematic strengths and core competencies of institutions, which can in turn be used for collaboration recommendations. The framework, based on NLP and network analysis techniques, is capable of determining the strengths of an institution in different thematic areas within a field and thereby determining the core competency and potential core competency areas of that institution. A major advantage of the system is that it can help to determine and improve the research portfolio of an institution within a field through suitable collaboration, which may lead to the overall improvement of the performance of the institution in that field. The framework is demonstrated by analyzing the performance of 195 Indian institutions in the field of 'Computer Science'. Upon validation using standard metrics for novelty, coverage and diversity of recommendation systems, the framework is found to be of sufficient coverage and capable of tossing novel and diverse recommendations. The article thus presents an institutional collaboration recommendation system which can be used by institutions to identify potential collaborators. ",
    "url": "https://arxiv.org/abs/2208.04192",
    "authors": [
      "Hiran H Lathabai",
      "Abhirup Nandy",
      "Vivek Kumar Singh"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)"
    ]
  },
  {
    "id": "arXiv:2208.04201",
    "title": "Content-Based Landmark Retrieval Combining Global and Local Features  using Siamese Neural Networks",
    "abstract": "In this work, we present a method for landmark retrieval that utilizes global and local features. A Siamese network is used for global feature extraction and metric learning, which gives an initial ranking of the landmark search. We utilize the extracted feature maps from the Siamese architecture as local descriptors, the search results are then further refined using a cosine similarity between local descriptors. We conduct a deeper analysis of the Google Landmark Dataset, which is used for evaluation, and augment the dataset to handle various intra-class variances. Furthermore, we conduct several experiments to compare the effects of transfer learning and metric learning, as well as experiments using other local descriptors. We show that a re-ranking using local features can improve the search results. We believe that the proposed local feature extraction using cosine similarity is a simple approach that can be extended to many other retrieval tasks. ",
    "url": "https://arxiv.org/abs/2208.04201",
    "authors": [
      "Tianyi Hu",
      "Monika Kwiatkowski",
      "Simon Matern",
      "Olaf Hellwich"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04226",
    "title": "SKDCGN: Source-free Knowledge Distillation of Counterfactual Generative  Networks using cGANs",
    "abstract": "With the usage of appropriate inductive biases, Counterfactual Generative Networks (CGNs) can generate novel images from random combinations of shape, texture, and background manifolds. These images can be utilized to train an invariant classifier, avoiding the wide spread problem of deep architectures learning spurious correlations rather than meaningful ones. As a consequence, out-of-domain robustness is improved. However, the CGN architecture comprises multiple over parameterized networks, namely BigGAN and U2-Net. Training these networks requires appropriate background knowledge and extensive computation. Since one does not always have access to the precise training details, nor do they always possess the necessary knowledge of counterfactuals, our work addresses the following question: Can we use the knowledge embedded in pre-trained CGNs to train a lower-capacity model, assuming black-box access (i.e., only access to the pretrained CGN model) to the components of the architecture? In this direction, we propose a novel work named SKDCGN that attempts knowledge transfer using Knowledge Distillation (KD). In our proposed architecture, each independent mechanism (shape, texture, background) is represented by a student 'TinyGAN' that learns from the pretrained teacher 'BigGAN'. We demonstrate the efficacy of the proposed method using state-of-the-art datasets such as ImageNet, and MNIST by using KD and appropriate loss functions. Moreover, as an additional contribution, our paper conducts a thorough study on the composition mechanism of the CGNs, to gain a better understanding of how each mechanism influences the classification accuracy of an invariant classifier. Code available at: https://github.com/ambekarsameer96/SKDCGN ",
    "url": "https://arxiv.org/abs/2208.04226",
    "authors": [
      "Sameer Ambekar",
      "Ankit Ankit",
      "Diego van der Mast",
      "Mark Alence",
      "Matteo Tafuro"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04231",
    "title": "ReSiPI: A Reconfigurable Silicon-Photonic 2.5D Chiplet Network with PCMs  for Energy-Efficient Interposer Communication",
    "abstract": "2.5D chiplet systems have been proposed to improve the low manufacturing yield of large-scale chips. However, connecting the chiplets through an electronic interposer imposes a high traffic load on the interposer network. Silicon photonics technology has shown great promise towards handling a high volume of traffic with low latency in intra-chip network-on-chip (NoC) fabrics. Although recent advances in silicon photonic devices have extended photonic NoCs to enable high bandwidth communication in 2.5D chiplet systems, such interposer-based photonic networks still suffer from high power consumption. In this work, we design and analyze a novel Reconfigurable power-efficient and congestion-aware Silicon Photonic 2.5D Interposer network, called ReSiPI. Considering run-time traffic, ReSiPI is able to dynamically deploy inter-chiplet photonic gateways to improve the overall network congestion. ReSiPI also employs switching elements based on phase change materials (PCMs) to dynamically reconfigure and power-gate the photonic interposer network, thereby improving the network power efficiency. Compared to the best prior state-of-the-art 2.5D photonic network, ReSiPI demonstrates, on average, 37% lower latency, 25% power reduction, and 53% energy minimization in the network. ",
    "url": "https://arxiv.org/abs/2208.04231",
    "authors": [
      "Ebadollah Taheri",
      "Sudeep Pasricha",
      "Mahdi Nikdast"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Emerging Technologies (cs.ET)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2208.04233",
    "title": "Sampling, Communication, and Prediction Co-Design for Synchronizing the  Real-World Device and Digital Model in Metaverse",
    "abstract": "The metaverse has the potential to revolutionize the next generation of the Internet by supporting highly interactive services with the help of Mixed Reality (MR) technologies; still, to provide a satisfactory experience for users, the synchronization between the physical world and its digital models is crucial. This work proposes a sampling, communication and prediction co-design framework to minimize the communication load subject to a constraint on tracking the Mean Squared Error (MSE) between a real-world device and its digital model in the metaverse. To optimize the sampling rate and the prediction horizon, we exploit expert knowledge and develop a constrained Deep Reinforcement Learning (DRL) algorithm, named Knowledge-assisted Constrained Twin-Delayed Deep Deterministic (KC-TD3) policy gradient algorithm. We validate our framework on a prototype composed of a real-world robotic arm and its digital model. Compared with existing approaches: (1) When the tracking error constraint is stringent (MSE=0.002 degrees), our policy degenerates into the policy in the sampling-communication co-design framework. (2) When the tracking error constraint is mild (MSE=0.007 degrees), our policy degenerates into the policy in the prediction-communication co-design framework. (3) Our framework achieves a better trade-off between the average MSE and the average communication load compared with a communication system without sampling and prediction. For example, the average communication load can be reduced up to 87% when the track error constraint is 0.002 degrees. (4) Our policy outperforms the benchmark with the static sampling rate and prediction horizon optimized by exhaustive search, in terms of the tail probability of the tracking error. Furthermore, with the assistance of expert knowledge, the proposed algorithm KC-TD3 achieves better convergence time, stability, and final policy performance. ",
    "url": "https://arxiv.org/abs/2208.04233",
    "authors": [
      "Zhen Meng",
      "Changyang She",
      "Guodong Zhao",
      "Daniele De Martini"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04237",
    "title": "Multi-Agent Reinforcement Learning for Long-Term Network Resource  Allocation through Auction: a V2X Application",
    "abstract": "We formulate offloading of computational tasks from a dynamic group of mobile agents (e.g., cars) as decentralized decision making among autonomous agents. We design an interaction mechanism that incentivizes such agents to align private and system goals by balancing between competition and cooperation. In the static case, the mechanism provably has Nash equilibria with optimal resource allocation. In a dynamic environment, this mechanism's requirement of complete information is impossible to achieve. For such environments, we propose a novel multi-agent online learning algorithm that learns with partial, delayed and noisy state information, thus greatly reducing information need. Our algorithm is also capable of learning from long-term and sparse reward signals with varying delay. Empirical results from the simulation of a V2X application confirm that through learning, agents with the learning algorithm significantly improve both system and individual performance, reducing up to 30% of offloading failure rate, communication overhead and load variation, increasing computation resource utilization and fairness. Results also confirm the algorithm's good convergence and generalization property in different environments. ",
    "url": "https://arxiv.org/abs/2208.04237",
    "authors": [
      "Jing Tan",
      "Ramin Khalili",
      "Holger Karl",
      "Artur Hecker"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04247",
    "title": "Challenges and Opportunities for Simultaneous Multi-functional Networks  in the UHF Bands",
    "abstract": "Multi-functional wireless networks are rapidly evolving and aspire to become a promising attribute of the upcoming 6G networks. Enabling multiple simultaneous networking functions with a single radio fosters the development of more integrated and simpler equipment, overcoming design and technology barriers inherited from radio systems of the past. We are seeing numerous trends exploiting these features in newly designed radios, such as those operating on the mmWave band. In this article, however, we carefully analyze the challenges and opportunities for multi-functional wireless networks in UHF bands, advocating the reuse of existing infrastructures and technologies, and exploring the possibilities of expanding their functionality without requiring architectural changes. We believe that both modern and legacy technologies can be turned into multi-functional systems if the right scientific and technological challenges are properly addressed. This transformation can foster the development of new applications and extend the useful life of these systems, contributing to a more sustainable digitization by delaying equipment obsolescence. ",
    "url": "https://arxiv.org/abs/2208.04247",
    "authors": [
      "Xavier Vilajosana",
      "Guillem Boquet",
      "Joan Melià",
      "Pere Tuset-Peiró",
      "Borja Martinez",
      "Ferran Adelantado"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.04248",
    "title": "Fast 3D Sparse Topological Skeleton Graph Generation for Mobile Robot  Global Planning",
    "abstract": "In recent years, mobile robots are becoming ambitious and deployed in large-scale scenarios. Serving as a high-level understanding of environments, a sparse skeleton graph is beneficial for more efficient global planning. Currently, existing solutions for skeleton graph generation suffer from several major limitations, including poor adaptiveness to different map representations, dependency on robot inspection trajectories and high computational overhead. In this paper, we propose an efficient and flexible algorithm generating a trajectory-independent 3D sparse topological skeleton graph capturing the spatial structure of the free space. In our method, an efficient ray sampling and validating mechanism are adopted to find distinctive free space regions, which contributes to skeleton graph vertices, with traversability between adjacent vertices as edges. A cycle formation scheme is also utilized to maintain skeleton graph compactness. Benchmark comparison with state-of-the-art works demonstrates that our approach generates sparse graphs in a substantially shorter time, giving high-quality global planning paths. Experiments conducted in real-world maps further validate the capability of our method in real-world scenarios. Our method will be made open source to benefit the community. ",
    "url": "https://arxiv.org/abs/2208.04248",
    "authors": [
      "Xinyi Chen",
      "Boyu Zhou",
      "Jiarong Lin",
      "Yichen Zhang",
      "Fu Zhang",
      "Shaojie Shen"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2208.04259",
    "title": "First Come First Served: The Impact of File Position on Code Review",
    "abstract": "The most popular code review tools (e.g., Gerrit and GitHub) present the files to review sorted in alphabetical order. Could this choice or, more generally, the relative position in which a file is presented bias the outcome of code reviews? We investigate this hypothesis by triangulating complementary evidence in a two-step study. First, we observe developers' code review activity. We analyze the review comments pertaining to 219,476 Pull Requests (PRs) from 138 popular Java projects on GitHub. We found files shown earlier in a PR to receive more comments than files shown later, also when controlling for possible confounding factors: e.g., the presence of discussion threads or the lines added in a file. Second, we measure the impact of file position on defect finding in code review. Recruiting 106 participants, we conduct an online controlled experiment in which we measure participants' performance in detecting two unrelated defects seeded into two different files. Participants are assigned to one of two treatments in which the position of the defective files is switched. For one type of defect, participants are not affected by its file's position; for the other, they have 64% lower odds to identify it when its file is last as opposed to first. Overall, our findings provide evidence that the relative position in which files are presented has an impact on code reviews' outcome; we discuss these results and implications for tool design and code review. Data and materials: https://doi.org/10.5281/zenodo.6901285 ",
    "url": "https://arxiv.org/abs/2208.04259",
    "authors": [
      "Enrico Fregnan",
      "Larissa Braz",
      "Marco D'Ambros",
      "Gül Çalikli",
      "Alberto Bacchelli"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2208.04261",
    "title": "Software Security during Modern Code Review: The Developer's Perspective",
    "abstract": "To avoid software vulnerabilities, organizations are shifting security to earlier stages of the software development, such as at code review time. In this paper, we aim to understand the developers' perspective on assessing software security during code review, the challenges they encounter, and the support that companies and projects provide. To this end, we conduct a two-step investigation: we interview 10 professional developers and survey 182 practitioners about software security assessment during code review. The outcome is an overview of how developers perceive software security during code review and a set of identified challenges. Our study revealed that most developers do not immediately report to focus on security issues during code review. Only after being asked about software security, developers state to always consider it during review and acknowledge its importance. Most companies do not provide security training, yet expect developers to still ensure security during reviews. Accordingly, developers report the lack of training and security knowledge as the main challenges they face when checking for security issues. In addition, they have challenges with third-party libraries and to identify interactions between parts of code that could have security implications. Moreover, security may be disregarded during reviews due to developers' assumptions about the security dynamic of the application they develop. Data and materials: https://doi.org/10.5281/zenodo.6875435 ",
    "url": "https://arxiv.org/abs/2208.04261",
    "authors": [
      "Larissa Braz",
      "Alberto Bacchelli"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2208.04278",
    "title": "Self-Supervised Contrastive Representation Learning for 3D Mesh  Segmentation",
    "abstract": "3D deep learning is a growing field of interest due to the vast amount of information stored in 3D formats. Triangular meshes are an efficient representation for irregular, non-uniform 3D objects. However, meshes are often challenging to annotate due to their high geometrical complexity. Specifically, creating segmentation masks for meshes is tedious and time-consuming. Therefore, it is desirable to train segmentation networks with limited-labeled data. Self-supervised learning (SSL), a form of unsupervised representation learning, is a growing alternative to fully-supervised learning which can decrease the burden of supervision for training. We propose SSL-MeshCNN, a self-supervised contrastive learning method for pre-training CNNs for mesh segmentation. We take inspiration from traditional contrastive learning frameworks to design a novel contrastive learning algorithm specifically for meshes. Our preliminary experiments show promising results in reducing the heavy labeled data requirement needed for mesh segmentation by at least 33%. ",
    "url": "https://arxiv.org/abs/2208.04278",
    "authors": [
      "Ayaan Haque",
      "Hankyu Moon",
      "Heng Hao",
      "Sima Didari",
      "Jae Oh Woo",
      "Patrick Bangert"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.04297",
    "title": "Analyzing and modeling network travel patterns during the Ukraine  invasion using crowd-sourced pervasive traffic data",
    "abstract": "In 2022, Ukraine is suffering an invasion which has resulted in acute impacts playing out over time and geography. This paper examines the impact of the ongoing disruption on traffic behavior using analytics as well as zonal-based network models. The methodology is a data-driven approach that utilizes obtained travel-time conditions within an evolutionary algorithm framework which infers origin-destination demand values in an automated process based on traffic assignment. Because of the automation of the implementation, numerous daily models can be approximated for multiple cities. The novelty of this paper versus the previously published core methodology includes an analysis to ensure the obtained data is appropriate since some data sources were disabled due to the ongoing disruption. Further, novelty includes a direct linkage of the analysis to the timeline of disruptions to examine the interaction in a new way. Finally, specific network metrics are identified which are particularly suited for conceptualizing the impact of conflict disruptions on traffic network conditions. The ultimate aim is to establish processes, concepts and analysis to advance the broader activity of rapidly quantifying the traffic impacts of conflict scenarios. ",
    "url": "https://arxiv.org/abs/2208.04297",
    "authors": [
      "S. Travis Waller",
      "Moeid Qurashi",
      "Anna Sotnikova",
      "Lavina Karva",
      "Sai Chand"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2208.04298",
    "title": "Gaze Estimation Approach Using Deep Differential Residual Network",
    "abstract": "Gaze estimation, which is a method to determine where a person is looking at given the person's full face, is a valuable clue for understanding human intention. Similarly to other domains of computer vision, deep learning (DL) methods have gained recognition in the gaze estimation domain. However, there are still gaze calibration problems in the gaze estimation domain, thus preventing existing methods from further improving the performances. An effective solution is to directly predict the difference information of two human eyes, such as the differential network (Diff-Nn). However, this solution results in a loss of accuracy when using only one inference image. We propose a differential residual model (DRNet) combined with a new loss function to make use of the difference information of two eye images. We treat the difference information as auxiliary information. We assess the proposed model (DRNet) mainly using two public datasets (1) MpiiGaze and (2) Eyediap. Considering only the eye features, DRNet outperforms the state-of-the-art gaze estimation methods with $angular-error$ of 4.57 and 6.14 using MpiiGaze and Eyediap datasets, respectively. Furthermore, the experimental results also demonstrate that DRNet is extremely robust to noise images. ",
    "url": "https://arxiv.org/abs/2208.04298",
    "authors": [
      "Longzhao Huang",
      "Yujie Li",
      "Xu Wang",
      "Haoyu Wang",
      "Ahmed Bouridane",
      "Ahmad Chaddad"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2205.01897",
    "title": "Virtual Analog Modeling of Distortion Circuits Using Neural Ordinary  Differential Equations",
    "abstract": "Recent research in deep learning has shown that neural networks can learn differential equations governing dynamical systems. In this paper, we adapt this concept to Virtual Analog (VA) modeling to learn the ordinary differential equations (ODEs) governing the first-order and the second-order diode clipper. The proposed models achieve performance comparable to state-of-the-art recurrent neural networks (RNNs) albeit using fewer parameters. We show that this approach does not require oversampling and allows to increase the sampling rate after the training has completed, which results in increased accuracy. Using a sophisticated numerical solver allows to increase the accuracy at the cost of slower processing. ODEs learned this way do not require closed forms but are still physically interpretable. ",
    "url": "https://arxiv.org/abs/2205.01897",
    "authors": [
      "Jan Wilczek",
      "Alec Wright",
      "Vesa Välimäki",
      "Emanuël Habets"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2208.03325",
    "title": "Isoform Function Prediction Using Deep Neural Network",
    "abstract": "Isoforms are mRNAs produced from the same gene site in the phenomenon called Alternative Splicing. Studies have shown that more than 95% of human multi-exon genes have undergone alternative splicing. Although there are few changes in mRNA sequence, They may have a systematic effect on cell function and regulation. It is widely reported that isoforms of a gene have distinct or even contrasting functions. Most studies have shown that alternative splicing plays a significant role in human health and disease. Despite the wide range of gene function studies, there is little information about isoforms' functionalities. Recently, some computational methods based on Multiple Instance Learning have been proposed to predict isoform function using gene function and gene expression profile. However, their performance is not desirable due to the lack of labeled training data. In addition, probabilistic models such as Conditional Random Field (CRF) have been used to model the relation between isoforms. This project uses all the data and valuable information such as isoform sequences, expression profiles, and gene ontology graphs and proposes a comprehensive model based on Deep Neural Networks. The UniProt Gene Ontology (GO) database is used as a standard reference for gene functions. The NCBI RefSeq database is used for extracting gene and isoform sequences, and the NCBI SRA database is used for expression profile data. Metrics such as Receiver Operating Characteristic Area Under the Curve (ROC AUC) and Precision-Recall Under the Curve (PR AUC) are used to measure the prediction accuracy. ",
    "url": "https://arxiv.org/abs/2208.03325",
    "authors": [
      "Sara Ghazanfari",
      "Ali Rasteh",
      "Seyed Abolfazl Motahari",
      "Mahdieh Soleymani Baghshah"
    ],
    "subjectives": [
      "Genomics (q-bio.GN)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03421",
    "title": "SSDPT: Self-Supervised Dual-Path Transformer for Anomalous Sound  Detection in Machine Condition Monitoring",
    "abstract": "Anomalous sound detection for machine condition monitoring has great potential in the development of Industry 4.0. However, these anomalous sounds of machines are usually unavailable in normal conditions. Therefore, the models employed have to learn acoustic representations with normal sounds for training, and detect anomalous sounds while testing. In this article, we propose a self-supervised dual-path Transformer (SSDPT) network to detect anomalous sounds in machine monitoring. The SSDPT network splits the acoustic features into segments and employs several DPT blocks for time and frequency modeling. DPT blocks use attention modules to alternately model the interactive information about the frequency and temporal components of the segmented acoustic features. To address the problem of lack of anomalous sound, we adopt a self-supervised learning approach to train the network with normal sound. Specifically, this approach randomly masks and reconstructs the acoustic features, and jointly classifies machine identity information to improve the performance of anomalous sound detection. We evaluated our method on the DCASE2021 task2 dataset. The experimental results show that the SSDPT network achieves a significant increase in the harmonic mean AUC score, in comparison to present state-of-the-art methods of anomalous sound detection. ",
    "url": "https://arxiv.org/abs/2208.03421",
    "authors": [
      "Jisheng Bai",
      "Jianfeng Chen",
      "Mou Wang",
      "Muhammad Saad Ayub",
      "Qingli Yan"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2208.03558",
    "title": "An Adaptive and Altruistic PSO-based Deep Feature Selection Method for  Pneumonia Detection from Chest X-Rays",
    "abstract": "Pneumonia is one of the major reasons for child mortality especially in income-deprived regions of the world. Although it can be detected and treated with very less sophisticated instruments and medication, Pneumonia detection still remains a major concern in developing countries. Computer-aided based diagnosis (CAD) systems can be used in such countries due to their lower operating costs than professional medical experts. In this paper, we propose a CAD system for Pneumonia detection from Chest X-rays, using the concepts of deep learning and a meta-heuristic algorithm. We first extract deep features from the pre-trained ResNet50, fine-tuned on a target Pneumonia dataset. Then, we propose a feature selection technique based on particle swarm optimization (PSO), which is modified using a memory-based adaptation parameter, and enriched by incorporating an altruistic behavior into the agents. We name our feature selection method as adaptive and altruistic PSO (AAPSO). The proposed method successfully eliminates non-informative features obtained from the ResNet50 model, thereby improving the Pneumonia detection ability of the overall framework. Extensive experimentation and thorough analysis on a publicly available Pneumonia dataset establish the superiority of the proposed method over several other frameworks used for Pneumonia detection. Apart from Pneumonia detection, AAPSO is further evaluated on some standard UCI datasets, gene expression datasets for cancer prediction and a COVID-19 prediction dataset. The overall results are satisfactory, thereby confirming the usefulness of AAPSO in dealing with varied real-life problems. The supporting source codes of this work can be found at https://github.com/rishavpramanik/AAPSO ",
    "url": "https://arxiv.org/abs/2208.03558",
    "authors": [
      "Rishav Pramanik",
      "Sourodip Sarkar",
      "Ram Sarkar"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2208.03569",
    "title": "Constrained self-supervised method with temporal ensembling for fiber  bundle detection on anatomic tracing data",
    "abstract": "Anatomic tracing data provides detailed information on brain circuitry essential for addressing some of the common errors in diffusion MRI tractography. However, automated detection of fiber bundles on tracing data is challenging due to sectioning distortions, presence of noise and artifacts and intensity/contrast variations. In this work, we propose a deep learning method with a self-supervised loss function that takes anatomy-based constraints into account for accurate segmentation of fiber bundles on the tracer sections from macaque brains. Also, given the limited availability of manual labels, we use a semi-supervised training technique for efficiently using unlabeled data to improve the performance, and location constraints for further reduction of false positives. Evaluation of our method on unseen sections from a different macaque yields promising results with a true positive rate of ~0.90. The code for our method is available at https://github.com/v-sundaresan/fiberbundle_seg_tracing. ",
    "url": "https://arxiv.org/abs/2208.03569",
    "authors": [
      "Vaanathi Sundaresan",
      "Julia F. Lehman",
      "Sean Fitzgibbon",
      "Saad Jbabdi",
      "Suzanne N. Haber",
      "Anastasia Yendiki"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03703",
    "title": "Granger Causality using Neural Networks",
    "abstract": "The Granger Causality (GC) test is a famous statistical hypothesis test for investigating if the past of one time series affects the future of the other. It helps in answering the question whether one time series is helpful in forecasting. Standard traditional approaches to Granger causality detection commonly assume linear dynamics, but such simplification does not hold in many real-world applications, e.g., neuroscience or genomics that are inherently non-linear. In such cases, imposing linear models such as Vector Autoregressive (VAR) models can lead to inconsistent estimation of true Granger Causal interactions. Machine Learning (ML) can learn the hidden patterns in the datasets specifically Deep Learning (DL) has shown tremendous promise in learning the non-linear dynamics of complex systems. Recent work of Tank et al propose to overcome the issue of linear simplification in VAR models by using neural networks combined with sparsity-inducing penalties on the learn-able weights. In this work, we build upon ideas introduced by Tank et al. We propose several new classes of models that can handle underlying non-linearity. Firstly, we present the Learned Kernal VAR(LeKVAR) model-an extension of VAR models that also learns kernel parametrized by a neural net. Secondly, we show one can directly decouple lags and individual time series importance via decoupled penalties. This decoupling provides better scaling and allows us to embed lag selection into RNNs. Lastly, we propose a new training algorithm that supports mini-batching, and it is compatible with commonly used adaptive optimizers such as Adam.he proposed techniques are evaluated on several simulated datasets inspired by real-world applications.We also apply these methods to the Electro-Encephalogram (EEG) data for an epilepsy patient to study the evolution of GC before , during and after seizure across the 19 EEG channels. ",
    "url": "https://arxiv.org/abs/2208.03703",
    "authors": [
      "Samuel Horvath",
      "Malik Shahid Sultan",
      "Hernando Ombao"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03743",
    "title": "The 2-center Problem in Maximal Outerplanar Graph",
    "abstract": "We consider the problem of computing 2-center in maximal outerplanar graph. In this problem, we want to find an optimal solution where two centers cover all the vertices with the smallest radius. We provide the following result. We can compute the optimal centers and the optimal radius in $O(n^2)$ time for a given maximal outerplanar graph with $n$ vertices. We try to let the maximal outerplanar graph be cut into two subgraphs with an internal edge, each center will cover vertices which are continuous. ",
    "url": "https://arxiv.org/abs/2208.03743",
    "authors": [
      "Hsiu-Fu Yeh"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2208.03761",
    "title": "An Empirical Analysis of the Laplace and Neural Tangent Kernels",
    "abstract": "The neural tangent kernel is a kernel function defined over the parameter distribution of an infinite width neural network. Despite the impracticality of this limit, the neural tangent kernel has allowed for a more direct study of neural networks and a gaze through the veil of their black box. More recently, it has been shown theoretically that the Laplace kernel and neural tangent kernel share the same reproducing kernel Hilbert space in the space of $\\mathbb{S}^{d-1}$ alluding to their equivalence. In this work, we analyze the practical equivalence of the two kernels. We first do so by matching the kernels exactly and then by matching posteriors of a Gaussian process. Moreover, we analyze the kernels in $\\mathbb{R}^d$ and experiment with them in the task of regression. ",
    "url": "https://arxiv.org/abs/2208.03761",
    "authors": [
      "Ronaldas Paulius Lencevicius"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Functional Analysis (math.FA)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2208.03881",
    "title": "Network Critical Slowing Down: Data-Driven Detection of Critical  Transitions in Nonlinear Networks",
    "abstract": "In a Nature article, Scheffer et al. presented a novel data-driven framework to predict critical transitions in complex systems. These transitions, which may stem from failures, degradation, or adversarial actions, have been attributed to bifurcations in the nonlinear dynamics. Their approach was built upon the phenomenon of critical slowing down, i.e., slow recovery in response to small perturbations near bifurcations. We extend their approach to detect and localize critical transitions in nonlinear networks. By introducing the notion of network critical slowing down, the objective of this paper is to detect that the network is undergoing a bifurcation only by analyzing its signatures from measurement data. We focus on two classes of widely-used nonlinear networks: (1) Kuramoto model for the synchronization of coupled oscillators and (2) attraction-repulsion dynamics in swarms, each of which presents a specific type of bifurcation. Based on the phenomenon of critical slowing down, we study the asymptotic behavior of the perturbed system away and close to the bifurcation and leverage this fact to develop a deterministic method to detect and identify critical transitions in nonlinear networks. Furthermore, we study the state covariance matrix subject to a stochastic noise process away and close to the bifurcation and use it to develop a stochastic framework for detecting critical transitions. Our simulation results show the strengths and limitations of the methods. ",
    "url": "https://arxiv.org/abs/2208.03881",
    "authors": [
      "Mohammad Pirani",
      "Saber Jafarpour"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)",
      "Chaotic Dynamics (nlin.CD)"
    ]
  },
  {
    "id": "arXiv:2208.03897",
    "title": "Neural Optimization Machine: A Neural Network Approach for Optimization",
    "abstract": "A novel neural network (NN) approach is proposed for constrained optimization. The proposed method uses a specially designed NN architecture and training/optimization procedure called Neural Optimization Machine (NOM). The objective functions for the NOM are approximated with NN models. The optimization process is conducted by the neural network's built-in backpropagation algorithm. The NOM solves optimization problems by extending the architecture of the NN objective function model. This is achieved by appropriately designing the NOM's structure, activation function, and loss function. The NN objective function can have arbitrary architectures and activation functions. The application of the NOM is not limited to specific optimization problems, e.g., linear and quadratic programming. It is shown that the increase of dimension of design variables does not increase the computational cost significantly. Then, the NOM is extended for multiobjective optimization. Finally, the NOM is tested using numerical optimization problems and applied for the optimal design of processing parameters in additive manufacturing. ",
    "url": "https://arxiv.org/abs/2208.03897",
    "authors": [
      "Jie Chen",
      "Yongming Liu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.03904",
    "title": "SelfCoLearn: Self-supervised collaborative learning for accelerating  dynamic MR imaging",
    "abstract": "Lately, deep learning has been extensively investigated for accelerating dynamic magnetic resonance (MR) imaging, with encouraging progresses achieved. However, without fully sampled reference data for training, current approaches may have limited abilities in recovering fine details or structures. To address this challenge, this paper proposes a self-supervised collaborative learning framework (SelfCoLearn) for accurate dynamic MR image reconstruction from undersampled k-space data. The proposed framework is equipped with three important components, namely, dual-network collaborative learning, reunderampling data augmentation and a specially designed co-training loss. The framework is flexible to be integrated with both data-driven networks and model-based iterative un-rolled networks. Our method has been evaluated on in-vivo dataset and compared it to four state-of-the-art methods. Results show that our method possesses strong capabilities in capturing essential and inherent representations for direct reconstructions from the undersampled k-space data and thus enables high-quality and fast dynamic MR imaging. ",
    "url": "https://arxiv.org/abs/2208.03904",
    "authors": [
      "Juan Zou",
      "Cheng Li",
      "Sen Jia",
      "Ruoyou Wu",
      "Tingrui Pei",
      "Hairong Zheng",
      "Shanshan Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03968",
    "title": "All-optical image classification through unknown random diffusers using  a single-pixel diffractive network",
    "abstract": "Classification of an object behind a random and unknown scattering medium sets a challenging task for computational imaging and machine vision fields. Recent deep learning-based approaches demonstrated the classification of objects using diffuser-distorted patterns collected by an image sensor. These methods demand relatively large-scale computing using deep neural networks running on digital computers. Here, we present an all-optical processor to directly classify unknown objects through unknown, random phase diffusers using broadband illumination detected with a single pixel. A set of transmissive diffractive layers, optimized using deep learning, forms a physical network that all-optically maps the spatial information of an input object behind a random diffuser into the power spectrum of the output light detected through a single pixel at the output plane of the diffractive network. We numerically demonstrated the accuracy of this framework using broadband radiation to classify unknown handwritten digits through random new diffusers, never used during the training phase, and achieved a blind testing accuracy of 88.53%. This single-pixel all-optical object classification system through random diffusers is based on passive diffractive layers that process broadband input light and can operate at any part of the electromagnetic spectrum by simply scaling the diffractive features proportional to the wavelength range of interest. These results have various potential applications in, e.g., biomedical imaging, security, robotics, and autonomous driving. ",
    "url": "https://arxiv.org/abs/2208.03968",
    "authors": [
      "Yi Luo",
      "Bijie Bai",
      "Yuhang Li",
      "Ege Cetintas",
      "Aydogan Ozcan"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2208.04017",
    "title": "Stain-Adaptive Self-Supervised Learning for Histopathology Image  Analysis",
    "abstract": "It is commonly recognized that color variations caused by differences in stains is a critical issue for histopathology image analysis. Existing methods adopt color matching, stain separation, stain transfer or the combination of them to alleviate the stain variation problem. In this paper, we propose a novel Stain-Adaptive Self-Supervised Learning(SASSL) method for histopathology image analysis. Our SASSL integrates a domain-adversarial training module into the SSL framework to learn distinctive features that are robust to both various transformations and stain variations. The proposed SASSL is regarded as a general method for domain-invariant feature extraction which can be flexibly combined with arbitrary downstream histopathology image analysis modules (e.g. nuclei/tissue segmentation) by fine-tuning the features for specific downstream tasks. We conducted experiments on publicly available pathological image analysis datasets including the PANDA, BreastPathQ, and CAMELYON16 datasets, achieving the state-of-the-art performance. Experimental results demonstrate that the proposed method can robustly improve the feature extraction ability of the model, and achieve stable performance improvement in downstream tasks. ",
    "url": "https://arxiv.org/abs/2208.04017",
    "authors": [
      "Hai-Li Ye",
      "Da-Han Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04068",
    "title": "Systematic Review of Newton-Schulz Iterations with Unified  Factorizations : Integration in the Richardson Method and Application to  Robust Failure Detection in Electrical Networks",
    "abstract": "Systematic overview of Newton-Schulz and Durand iterations with convergence analysis and factorizations is presented in the chronological sequence in unified framework. Practical recommendations for the choice of the order and factorizations of the algorithms and integration into Richardson iteration are given. The simplest combination of Newton-Schulz and Richardson iteration is applied to the parameter estimation problem associated with the failure detection via evaluation of the frequency content of the signals in electrical network. The detection is performed on real data for which the software failure was simulated, which resulted in the rank deficient information matrix. Robust preconditioning for rank deficient matrices is proposed and the efficiency of the approach is demonstrated by simulations via comparison with standard LU decomposition method. ",
    "url": "https://arxiv.org/abs/2208.04068",
    "authors": [
      "Alexander Stotsky"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Dynamical Systems (math.DS)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2208.04081",
    "title": "Image Quality Assessment with Gradient Siamese Network",
    "abstract": "In this work, we introduce Gradient Siamese Network (GSN) for image quality assessment. The proposed method is skilled in capturing the gradient features between distorted images and reference images in full-reference image quality assessment(IQA) task. We utilize Central Differential Convolution to obtain both semantic features and detail difference hidden in image pair. Furthermore, spatial attention guides the network to concentrate on regions related to image detail. For the low-level, mid-level and high-level features extracted by the network, we innovatively design a multi-level fusion method to improve the efficiency of feature utilization. In addition to the common mean square error supervision, we further consider the relative distance among batch samples and successfully apply KL divergence loss to the image quality assessment task. We experimented the proposed algorithm GSN on several publicly available datasets and proved its superior performance. Our network won the second place in NTIRE 2022 Perceptual Image Quality Assessment Challenge track 1 Full-Reference. ",
    "url": "https://arxiv.org/abs/2208.04081",
    "authors": [
      "Heng Cong",
      "Lingzhi Fu",
      "Rongyu Zhang",
      "Yusheng Zhang",
      "Hao Wang",
      "Jiarong He",
      "Jin Gao"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.04303",
    "title": "Boosting neural video codecs by exploiting hierarchical redundancy",
    "abstract": "In video compression, coding efficiency is improved by reusing pixels from previously decoded frames via motion and residual compensation. We define two levels of hierarchical redundancy in video frames: 1) first-order: redundancy in pixel space, i.e., similarities in pixel values across neighboring frames, which is effectively captured using motion and residual compensation, 2) second-order: redundancy in motion and residual maps due to smooth motion in natural videos. While most of the existing neural video coding literature addresses first-order redundancy, we tackle the problem of capturing second-order redundancy in neural video codecs via predictors. We introduce generic motion and residual predictors that learn to extrapolate from previously decoded data. These predictors are lightweight, and can be employed with most neural video codecs in order to improve their rate-distortion performance. Moreover, while RGB is the dominant colorspace in neural video coding literature, we introduce general modifications for neural video codecs to embrace the YUV420 colorspace and report YUV420 results. Our experiments show that using our predictors with a well-known neural video codec leads to 38% and 34% bitrate savings in RGB and YUV420 colorspaces measured on the UVG dataset. ",
    "url": "https://arxiv.org/abs/2208.04303",
    "authors": [
      "Reza Pourreza",
      "Hoang Le",
      "Amir Said",
      "Guillaume Sautiere",
      "Auke Wiggers"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:1905.10170",
    "title": "Fast Flow Reconstruction via Robust Invertible nxn Convolution",
    "abstract": " Title: Fast Flow Reconstruction via Robust Invertible nxn Convolution ",
    "url": "https://arxiv.org/abs/1905.10170",
    "authors": [
      "Thanh-Dat Truong",
      "Khoa Luu",
      "Chi Nhan Duong",
      "Ngan Le",
      "Minh-Triet Tran"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:1908.08655",
    "title": "Spiking Neural Predictive Coding for Continual Learning from Data  Streams",
    "abstract": " Comments: Newest revised version of manuscript ",
    "url": "https://arxiv.org/abs/1908.08655",
    "authors": [
      "Alexander Ororbia"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:1910.07921",
    "title": "FASHION: Functional and Attack graph Secured HybrId Optimization of  virtualized Networks",
    "abstract": " Comments: Accepted to IEEE TDSC. This version adds an online evaluation Sections 4.2 and 5.2.4 ",
    "url": "https://arxiv.org/abs/1910.07921",
    "authors": [
      "Devon Callahan",
      "Timothy Curry",
      "Hazel Davidson",
      "Heytem Zitoun",
      "Benjamin Fuller",
      "Laurent Michel"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2001.06588",
    "title": "FlexiBO: A Decoupled Cost-Aware Multi-Objective Optimization Approach  for Deep Neural Networks",
    "abstract": " Title: FlexiBO: A Decoupled Cost-Aware Multi-Objective Optimization Approach  for Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2001.06588",
    "authors": [
      "Md Shahriar Iqbal",
      "Jianhai Su",
      "Lars Kotthoff",
      "Pooyan Jamshidi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2009.13008",
    "title": "NAS-Navigator: Visual Steering for Explainable One-Shot Deep Neural  Network Synthesis",
    "abstract": " Comments: Pre-print of the accepted paper at IEEE Transactions on Visualization and Computer Graphics, 2022 ",
    "url": "https://arxiv.org/abs/2009.13008",
    "authors": [
      "Anjul Tyagi",
      "Cong Xie",
      "Klaus Mueller"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2012.04723",
    "title": "Robustness of Model Predictions under Extension",
    "abstract": " Comments: Forthcoming in Proceedings of the 38th Conference on Uncertainty in Artificial Intelligence (UAI 2022) ",
    "url": "https://arxiv.org/abs/2012.04723",
    "authors": [
      "Tineke Blom",
      "Joris M. Mooij"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2101.09530",
    "title": "A Primer for Neural Arithmetic Logic Modules",
    "abstract": " Comments: JMLR Accepted Version, 58 pages ",
    "url": "https://arxiv.org/abs/2101.09530",
    "authors": [
      "Bhumika Mistry",
      "Katayoun Farrahi",
      "Jonathon Hare"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2104.08987",
    "title": "Quantum algorithms for SVD-based data representation and analysis",
    "abstract": " Title: Quantum algorithms for SVD-based data representation and analysis ",
    "url": "https://arxiv.org/abs/2104.08987",
    "authors": [
      "Armando Bellante",
      "Alessandro Luongo",
      "Stefano Zanero"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.14805",
    "title": "Few-Shot Video Object Detection",
    "abstract": " Comments: ECCV 2022 ",
    "url": "https://arxiv.org/abs/2104.14805",
    "authors": [
      "Qi Fan",
      "Chi-Keung Tang",
      "Yu-Wing Tai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.06421",
    "title": "Using Self-Supervised Auxiliary Tasks to Improve Fine-Grained Facial  Representation",
    "abstract": " Title: Using Self-Supervised Auxiliary Tasks to Improve Fine-Grained Facial  Representation ",
    "url": "https://arxiv.org/abs/2105.06421",
    "authors": [
      "Mahdi Pourmirzaei",
      "Gholam Ali Montazer",
      "Farzaneh Esmaili"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.12508",
    "title": "Adversarial Robustness against Multiple and Single $l_p$-Threat Models  via Quick Fine-Tuning of Robust Classifiers",
    "abstract": " Comments: ICML 2022 ",
    "url": "https://arxiv.org/abs/2105.12508",
    "authors": [
      "Francesco Croce",
      "Matthias Hein"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.01001",
    "title": "Warming-up recurrent neural networks to maximize reachable  multi-stability greatly improves learning",
    "abstract": " Comments: 16 pages, 21 pages total, 20 figures ",
    "url": "https://arxiv.org/abs/2106.01001",
    "authors": [
      "Gaspard Lambrechts",
      "Florent De Geeter",
      "Nicolas Vecoven",
      "Damien Ernst",
      "Guillaume Drion"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.02154",
    "title": "Laplacian-Based Dimensionality Reduction Including Spectral Clustering,  Laplacian Eigenmap, Locality Preserving Projection, Graph Embedding, and  Diffusion Map: Tutorial and Survey",
    "abstract": " Comments: To appear as a part of an upcoming textbook on dimensionality reduction and manifold learning. v2: applied readers' feedback ",
    "url": "https://arxiv.org/abs/2106.02154",
    "authors": [
      "Benyamin Ghojogh",
      "Ali Ghodsi",
      "Fakhri Karray",
      "Mark Crowley"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.02272",
    "title": "Multi-layer network approach in modeling epidemics in an urban town",
    "abstract": " Comments: 10 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2109.02272",
    "authors": [
      "Meliksah Turker",
      "Haluk O. Bingol"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2109.02327",
    "title": "Robust Congestion Control for Demand-Based Optimization in Precoded  Multi-Beam High Throughput Satellite Communications",
    "abstract": " Comments: 20 pages, 12 figures, and 1 table. Accepted to publish in the IEEE TCOM ",
    "url": "https://arxiv.org/abs/2109.02327",
    "authors": [
      "Van-Phuc Bui",
      "Trinh Van Chien",
      "Eva Lagunas",
      "Joël Grotz",
      "Symeon Chatzinotas",
      "Björn Ottersten"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2110.02329",
    "title": "Task-aware Privacy Preservation for Multi-dimensional Data",
    "abstract": " Comments: Accepted by 39th International Conference on Machine Learning (ICML 2022) ",
    "url": "https://arxiv.org/abs/2110.02329",
    "authors": [
      "Jiangnan Cheng",
      "Ao Tang",
      "Sandeep Chinchali"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.06933",
    "title": "Style-based quantum generative adversarial networks for Monte Carlo  events",
    "abstract": " Comments: 15 pages, 10 figures, accepted in Quantum, code available in this https URL ",
    "url": "https://arxiv.org/abs/2110.06933",
    "authors": [
      "Carlos Bravo-Prieto",
      "Julien Baglio",
      "Marco Cè",
      "Anthony Francis",
      "Dorota M. Grabowska",
      "Stefano Carrazza"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)"
    ]
  },
  {
    "id": "arXiv:2110.07610",
    "title": "Non-contact Atrial Fibrillation Detection from Face Videos by Learning  Systolic Peaks",
    "abstract": " Comments: Published on JBHI ",
    "url": "https://arxiv.org/abs/2110.07610",
    "authors": [
      "Zhaodong Sun",
      "Juhani Junttila",
      "Mikko Tulppo",
      "Tapio Seppänen",
      "Xiaobai Li"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.15087",
    "title": "MOOMIN: Deep Molecular Omics Network for Anti-Cancer Drug Combination  Therapy",
    "abstract": " Title: MOOMIN: Deep Molecular Omics Network for Anti-Cancer Drug Combination  Therapy ",
    "url": "https://arxiv.org/abs/2110.15087",
    "authors": [
      "Benedek Rozemberczki",
      "Anna Gogleva",
      "Sebastian Nilsson",
      "Gavin Edwards",
      "Andriy Nikolov",
      "Eliseo Papa"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2111.09515",
    "title": "Range-Aware Attention Network for LiDAR-based 3D Object Detection with  Auxiliary Point Density Level Estimation",
    "abstract": " Title: Range-Aware Attention Network for LiDAR-based 3D Object Detection with  Auxiliary Point Density Level Estimation ",
    "url": "https://arxiv.org/abs/2111.09515",
    "authors": [
      "Yantao Lu",
      "Xuetao Hao",
      "Yilan Li",
      "Weiheng Chai",
      "Shiqi Sun",
      "Senem Velipasalar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.12264",
    "title": "Pixel-wise Energy-biased Abstention Learning for Anomaly Segmentation on  Complex Urban Driving Scenes",
    "abstract": " Comments: ECCV 2022 Oral ",
    "url": "https://arxiv.org/abs/2111.12264",
    "authors": [
      "Yu Tian",
      "Yuyuan Liu",
      "Guansong Pang",
      "Fengbei Liu",
      "Yuanhong Chen",
      "Gustavo Carneiro"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.12851",
    "title": "A Tractable Approach to Coverage Analysis in Downlink Satellite Networks",
    "abstract": " Comments: 15 pages ",
    "url": "https://arxiv.org/abs/2111.12851",
    "authors": [
      "Jeonghun Park",
      "Jinseok Choi",
      "Namyoon Lee"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2112.00183",
    "title": "Descriptive vs. inferential community detection",
    "abstract": " Comments: 57 pages, 18 figures ",
    "url": "https://arxiv.org/abs/2112.00183",
    "authors": [
      "Tiago P. Peixoto"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2112.07663",
    "title": "Learning Connectivity-Maximizing Network Configurations",
    "abstract": " Comments: 8 pages, 10 figures, final RA-L version ",
    "url": "https://arxiv.org/abs/2112.07663",
    "authors": [
      "Daniel Mox",
      "Vijay Kumar",
      "Alejandro Ribeiro"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2201.01262",
    "title": "An algebraic attack to the Bluetooth stream cipher E0",
    "abstract": " Comments: 24 pages, 1 figure. To appear in Finite Fields and Their Applications ",
    "url": "https://arxiv.org/abs/2201.01262",
    "authors": [
      "Roberto La Scala",
      "Sergio Polese",
      "Sharwan K. Tiwari",
      "Andrea Visconti"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Symbolic Computation (cs.SC)",
      "Commutative Algebra (math.AC)",
      "Rings and Algebras (math.RA)"
    ]
  },
  {
    "id": "arXiv:2201.01647",
    "title": "Comparison of biomedical relationship extraction methods and models for  knowledge graph creation",
    "abstract": " Comments: Paper submitted to Journal of Semantic Web ",
    "url": "https://arxiv.org/abs/2201.01647",
    "authors": [
      "Nikola Milosevic",
      "Wolfgang Thielemann"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.09360",
    "title": "POTHER: Patch-Voted Deep Learning-Based Chest X-ray Bias Analysis for  COVID-19 Detection",
    "abstract": " Comments: Accepted at International Conference on Computational Science (ICCS) 2022, London ",
    "url": "https://arxiv.org/abs/2201.09360",
    "authors": [
      "Tomasz Szczepański",
      "Arkadiusz Sitek",
      "Tomasz Trzciński",
      "Szymon Płotka"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.09772",
    "title": "In Defence of Visual Analytics Systems: Replies to Critics",
    "abstract": " Comments: 9+2 pages, 4 figures. Accepted to IEEE VIS 2022 ",
    "url": "https://arxiv.org/abs/2201.09772",
    "authors": [
      "Aoyu Wu",
      "Dazhen Deng",
      "Furui Cheng",
      "Yingcai Wu",
      "Shixia Liu",
      "Huamin Qu"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2201.13271",
    "title": "StRegA: Unsupervised Anomaly Detection in Brain MRIs using a Compact  Context-encoding Variational Autoencoder",
    "abstract": " Title: StRegA: Unsupervised Anomaly Detection in Brain MRIs using a Compact  Context-encoding Variational Autoencoder ",
    "url": "https://arxiv.org/abs/2201.13271",
    "authors": [
      "Soumick Chatterjee",
      "Alessandro Sciarra",
      "Max Dünnwald",
      "Pavan Tummala",
      "Shubham Kumar Agrawal",
      "Aishwarya Jauhari",
      "Aman Kalra",
      "Steffen Oeltze-Jafra",
      "Oliver Speck",
      "Andreas Nürnberger"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2202.04506",
    "title": "Optimising hadronic collider simulations using amplitude neural networks",
    "abstract": " Comments: 6 pages, 6 figures, Proceedings of the 20th International Workshop on Advanced Computing and Analysis Techniques in Physics Research (ACAT 2021) ",
    "url": "https://arxiv.org/abs/2202.04506",
    "authors": [
      "Ryan Moodie"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.06312",
    "title": "Adversarial Fine-tuning for Backdoor Defense: Connecting Backdoor  Attacks to Adversarial Attacks",
    "abstract": " Title: Adversarial Fine-tuning for Backdoor Defense: Connecting Backdoor  Attacks to Adversarial Attacks ",
    "url": "https://arxiv.org/abs/2202.06312",
    "authors": [
      "Bingxu Mu",
      "Zhenxing Niu",
      "Le Wang",
      "Xue Wang",
      "Rong Jin",
      "Gang Hua"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.00714",
    "title": "Subspace-Based Pilot Decontamination in User-Centric Scalable Cell-Free  Wireless Networks",
    "abstract": " Title: Subspace-Based Pilot Decontamination in User-Centric Scalable Cell-Free  Wireless Networks ",
    "url": "https://arxiv.org/abs/2203.00714",
    "authors": [
      "Fabian Göttsch",
      "Noboru Osawa",
      "Takeo Ohseki",
      "Kosuke Yamazaki",
      "Giuseppe Caire"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2203.02662",
    "title": "A Survey on Metaverse: Fundamentals, Security, and Privacy",
    "abstract": " Comments: 31 pages, 17 figures, 11 tables. Accepted by IEEE Communications Surveys & Tutorials ",
    "url": "https://arxiv.org/abs/2203.02662",
    "authors": [
      "Yuntao Wang",
      "Zhou Su",
      "Ning Zhang",
      "Rui Xing",
      "Dongxiao Liu",
      "Tom H. Luan",
      "Xuemin Shen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.00154",
    "title": "An End-to-end Supervised Domain Adaptation Framework for Cross-Domain  Change Detection",
    "abstract": " Comments: Accepted by Pattern Recognition ",
    "url": "https://arxiv.org/abs/2204.00154",
    "authors": [
      "Jia Liu",
      "Wenjie Xuan",
      "Yuhang Gan",
      "Juhua Liu",
      "Bo Du"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03216",
    "title": "Neural Implicit Flow: a mesh-agnostic dimensionality reduction paradigm  of spatio-temporal data",
    "abstract": " Comments: 59 pages ",
    "url": "https://arxiv.org/abs/2204.03216",
    "authors": [
      "Shaowu Pan",
      "Steven L. Brunton",
      "J. Nathan Kutz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2204.06386",
    "title": "Efficient Deep Neural Network Accelerator Using Controlled Ferroelectric  Domain Dynamics",
    "abstract": " Title: Efficient Deep Neural Network Accelerator Using Controlled Ferroelectric  Domain Dynamics ",
    "url": "https://arxiv.org/abs/2204.06386",
    "authors": [
      "Sayani Majumdar"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:2204.10586",
    "title": "Efficient Training of Neural Transducer for Speech Recognition",
    "abstract": " Comments: accepted at Interspeech 2022 ",
    "url": "https://arxiv.org/abs/2204.10586",
    "authors": [
      "Wei Zhou",
      "Wilfried Michel",
      "Ralf Schlüter",
      "Hermann Ney"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.11032",
    "title": "Heterogeneous Separation Consistency Training for Adaptation of  Unsupervised Speech Separation",
    "abstract": " Title: Heterogeneous Separation Consistency Training for Adaptation of  Unsupervised Speech Separation ",
    "url": "https://arxiv.org/abs/2204.11032",
    "authors": [
      "Jiangyu Han",
      "Yanhua Long"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.11852",
    "title": "Completing Networks by Learning Local Connection Patterns",
    "abstract": " Comments: 15 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2204.11852",
    "authors": [
      "Zhang Zhang",
      "Ruyi Tao",
      "Yongzai Tao",
      "Mingze Qi",
      "Jiang Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.02652",
    "title": "Can collaborative learning be private, robust and scalable?",
    "abstract": " Comments: Accepted at MICCAI DeCaF 2022 ",
    "url": "https://arxiv.org/abs/2205.02652",
    "authors": [
      "Dmitrii Usynin",
      "Helena Klause",
      "Johannes C. Paetzold",
      "Daniel Rueckert",
      "Georgios Kaissis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.05874",
    "title": "Distinction Maximization Loss: Efficiently Improving Out-of-Distribution  Detection and Uncertainty Estimation by Replacing the Loss and Calibrating",
    "abstract": " Title: Distinction Maximization Loss: Efficiently Improving Out-of-Distribution  Detection and Uncertainty Estimation by Replacing the Loss and Calibrating ",
    "url": "https://arxiv.org/abs/2205.05874",
    "authors": [
      "David Macêdo",
      "Cleber Zanchettin",
      "Teresa Ludermir"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2205.08806",
    "title": "Entity Alignment with Reliable Path Reasoning and Relation-Aware  Heterogeneous Graph Transformer",
    "abstract": " Comments: Accepted by IJCAI-ECAI 2022 ",
    "url": "https://arxiv.org/abs/2205.08806",
    "authors": [
      "Weishan Cai",
      "Wenjun Ma",
      "Jieyu Zhan",
      "Yuncheng Jiang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.08957",
    "title": "Meta-Learning Sparse Compression Networks",
    "abstract": " Comments: Published in TMLR (2022) ",
    "url": "https://arxiv.org/abs/2205.08957",
    "authors": [
      "Jonathan Richard Schwarz",
      "Yee Whye Teh"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.09362",
    "title": "Sparse Adversarial Attack in Multi-agent Reinforcement Learning",
    "abstract": " Title: Sparse Adversarial Attack in Multi-agent Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2205.09362",
    "authors": [
      "Yizheng Hu",
      "Zhihua Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.09850",
    "title": "Human Gender Prediction Based on Deep Transfer Learning from Panoramic  Radiograph Images",
    "abstract": " Comments: 12 pages, 10 figures, 12 tables ",
    "url": "https://arxiv.org/abs/2205.09850",
    "authors": [
      "I. Atas"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.10249",
    "title": "Sampling Is All You Need on Modeling Long-Term User Behaviors for CTR  Prediction",
    "abstract": " Comments: Accepted by CIKM 2022, 10 pages ",
    "url": "https://arxiv.org/abs/2205.10249",
    "authors": [
      "Yue Cao",
      "XiaoJiang Zhou",
      "Jiaqi Feng",
      "Peihao Huang",
      "Yao Xiao",
      "Dayao Chen",
      "Sheng Chen"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.10780",
    "title": "Data-aided Active User Detection with a User Activity Extraction Network  for Grant-free SCMA Systems",
    "abstract": " Title: Data-aided Active User Detection with a User Activity Extraction Network  for Grant-free SCMA Systems ",
    "url": "https://arxiv.org/abs/2205.10780",
    "authors": [
      "Minsig Han",
      "Ameha T. Abebe",
      "Chung G. Kang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2205.11230",
    "title": "A Deep Learning Ensemble Framework for Off-Nadir Geocentric Pose  Prediction",
    "abstract": " Comments: 2022 5th International Conference on Pattern Recognition and Artificial Intelligence (PRAI) ",
    "url": "https://arxiv.org/abs/2205.11230",
    "authors": [
      "Christopher Sun",
      "Jai Sharma",
      "Milind Maiti"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.12853",
    "title": "Deep Gradient Learning for Efficient Camouflaged Object Detection",
    "abstract": " Comments: Accepted by Machine Intelligence Research ",
    "url": "https://arxiv.org/abs/2205.12853",
    "authors": [
      "Ge-Peng Ji",
      "Deng-Ping Fan",
      "Yu-Cheng Chou",
      "Dengxin Dai",
      "Alexander Liniger",
      "Luc Van Gool"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.14371",
    "title": "GLITCH: Automated Polyglot Security Smell Detection in Infrastructure as  Code",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:1907.07159 by other authors ",
    "url": "https://arxiv.org/abs/2205.14371",
    "authors": [
      "Nuno Saavedra",
      "João F. Ferreira"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2205.15357",
    "title": "Searching for the Essence of Adversarial Perturbations",
    "abstract": " Title: Searching for the Essence of Adversarial Perturbations ",
    "url": "https://arxiv.org/abs/2205.15357",
    "authors": [
      "Dennis Y. Menn",
      "Hung-yi Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2206.00390",
    "title": "Attention-embedded Quadratic Network (Qttention) for Effective and  Interpretable Bearing Fault Diagnosis",
    "abstract": " Comments: update abstract add experiments in classification results delete small data experiment add comparison experiments of qttention and convolution ",
    "url": "https://arxiv.org/abs/2206.00390",
    "authors": [
      "Jing-Xiao Liao",
      "Hang-Cheng Dong",
      "Zhi-Qi Sun",
      "Jinwei Sun",
      "Shiping Zhang",
      "Feng-Lei Fan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.02176",
    "title": "Development of research network on Quantum Annealing Computation and  Information using Google Scholar data",
    "abstract": " Comments: Submitted in Philosophical Transactions A (invited contribution for issue \"Quantum Annealing and Computation: Present Understanding of Quantum Spin Glasses and Future Perspective of Quantum Information Processing\") ",
    "url": "https://arxiv.org/abs/2206.02176",
    "authors": [
      "Antika Sinha"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2206.03864",
    "title": "Discontinuity Computing using Physics-Informed Neural Network",
    "abstract": " Title: Discontinuity Computing using Physics-Informed Neural Network ",
    "url": "https://arxiv.org/abs/2206.03864",
    "authors": [
      "Li Liu",
      "Shengping Liu",
      "Hui Xie",
      "Fansheng Xiong",
      "Tengchao Yu",
      "Mengjuan Xiao",
      "Lufeng Liu",
      "Heng Yong"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2206.05741",
    "title": "Multimodal Fake News Detection with Adaptive Unimodal Representation  Aggregation",
    "abstract": " Comments: We found a problem in the method and wish to redo some of the experiments ",
    "url": "https://arxiv.org/abs/2206.05741",
    "authors": [
      "Qichao Ying",
      "Yangming Zhou",
      "Zhenxing Qian",
      "Dan Zeng",
      "Shiming Ge"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.07510",
    "title": "Deep Multi-Task Networks For Occluded Pedestrian Pose Estimation",
    "abstract": " Comments: 4 pages, 5 tables, 2 figures ",
    "url": "https://arxiv.org/abs/2206.07510",
    "authors": [
      "Arindam Das",
      "Sudip Das",
      "Ganesh Sistu",
      "Jonathan Horgan",
      "Ujjwal Bhattacharya",
      "Edward Jones",
      "Martin Glavin",
      "Ciarán Eising"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.09299",
    "title": "Enforcing continuous symmetries in physics-informed neural network for  solving forward and inverse problems of partial differential equations",
    "abstract": " Title: Enforcing continuous symmetries in physics-informed neural network for  solving forward and inverse problems of partial differential equations ",
    "url": "https://arxiv.org/abs/2206.09299",
    "authors": [
      "Zhi-Yong Zhang",
      "Hui Zhang",
      "Li-Sheng Zhang",
      "Lei-Lei Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.11825",
    "title": "YOLOSA: Object detection based on 2D local feature superimposed  self-attention",
    "abstract": " Comments: This paper is under consideration at Pattern Recognition Letters ",
    "url": "https://arxiv.org/abs/2206.11825",
    "authors": [
      "Weisheng Li",
      "Lin Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.11894",
    "title": "MaskViT: Masked Visual Pre-Training for Video Prediction",
    "abstract": " Comments: Project page: this https URL ",
    "url": "https://arxiv.org/abs/2206.11894",
    "authors": [
      "Agrim Gupta",
      "Stephen Tian",
      "Yunzhi Zhang",
      "Jiajun Wu",
      "Roberto Martín-Martín",
      "Li Fei-Fei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2206.12484",
    "title": "An Intensity and Phase Stacked Analysis of Phase-OTDR System using Deep  Transfer Learning and Recurrent Neural Networks",
    "abstract": " Comments: 15 pages, 9 figures. Title updated ",
    "url": "https://arxiv.org/abs/2206.12484",
    "authors": [
      "Ceyhun Efe Kayan",
      "Kivilcim Yuksel Aldogan",
      "Abdurrahman Gumus"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2206.13758",
    "title": "Exploring linguistic feature and model combination for speech  recognition based automatic AD detection",
    "abstract": " Comments: Accepted by INTERSPEECH 2022 ",
    "url": "https://arxiv.org/abs/2206.13758",
    "authors": [
      "Yi Wang",
      "Tianzi Wang",
      "Zi Ye",
      "Lingwei Meng",
      "Shoukang Hu",
      "Xixin Wu",
      "Xunying Liu",
      "Helen Meng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2207.07338",
    "title": "Context-sensitive neocortical neurons transform the effectiveness and  efficiency of neural information processing",
    "abstract": " Title: Context-sensitive neocortical neurons transform the effectiveness and  efficiency of neural information processing ",
    "url": "https://arxiv.org/abs/2207.07338",
    "authors": [
      "Ahsan Adeel",
      "Mario Franco",
      "Mohsin Raza",
      "Khubaib Ahmed"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.07704",
    "title": "Maximizing Fair Content Spread via Edge Suggestion in Social Networks",
    "abstract": " Comments: 16 pages, 17 figures, 8 tables. VLDB '22. Technical Report ",
    "url": "https://arxiv.org/abs/2207.07704",
    "authors": [
      "Ian P. Swift",
      "Sana Ebrahimi",
      "Azade Nova",
      "Abolfazl Asudeh"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2207.08803",
    "title": "Adversarial Pixel Restoration as a Pretext Task for Transferable  Perturbations",
    "abstract": " Title: Adversarial Pixel Restoration as a Pretext Task for Transferable  Perturbations ",
    "url": "https://arxiv.org/abs/2207.08803",
    "authors": [
      "Hashmat Shadab Malik",
      "Shahina K Kunhimon",
      "Muzammal Naseer",
      "Salman Khan",
      "Fahad Shahbaz Khan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.10796",
    "title": "Multiple Robust Learning for Recommendation",
    "abstract": " Comments: More details will be added ",
    "url": "https://arxiv.org/abs/2207.10796",
    "authors": [
      "Haoxuan Li",
      "Quanyu Dai",
      "Yuru Li",
      "Yan Lyu",
      "Zhenhua Dong",
      "Peng Wu",
      "Xiao-Hua Zhou"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2207.11341",
    "title": "Dynamic Graph Reasoning for Multi-person 3D Pose Estimation",
    "abstract": " Comments: ACM Multimedia 2022 ",
    "url": "https://arxiv.org/abs/2207.11341",
    "authors": [
      "Zhongwei Qiu",
      "Qiansheng Yang",
      "Jian Wang",
      "Dongmei Fu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2207.11491",
    "title": "Dimensional Reduction of Solvency Contagion Dynamics on Financial  Networks",
    "abstract": " Title: Dimensional Reduction of Solvency Contagion Dynamics on Financial  Networks ",
    "url": "https://arxiv.org/abs/2207.11491",
    "authors": [
      "Gianmarco Ricciardi",
      "Guido Montagna",
      "Guido Caldarelli",
      "Giulio Cimini"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Social and Information Networks (cs.SI)",
      "Risk Management (q-fin.RM)"
    ]
  },
  {
    "id": "arXiv:2207.11788",
    "title": "Privacy Against Inference Attacks in Vertical Federated Learning",
    "abstract": " Title: Privacy Against Inference Attacks in Vertical Federated Learning ",
    "url": "https://arxiv.org/abs/2207.11788",
    "authors": [
      "Borzoo Rassouli",
      "Morteza Varasteh",
      "Deniz Gunduz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2207.11900",
    "title": "GA2MIF: Graph and Attention-based Two-stage Multi-source Information  Fusion for Conversational Emotion Detection",
    "abstract": " Comments: 12 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2207.11900",
    "authors": [
      "Jiang Li",
      "Xiaoping Wang",
      "Guoqing Lv",
      "Zhigang Zeng"
    ],
    "subjectives": [
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2207.12373",
    "title": "Dimension of Activity in Random Neural Networks",
    "abstract": " Comments: 12 pages, 4 figures; correction to g-&gt;1+ analysis ",
    "url": "https://arxiv.org/abs/2207.12373",
    "authors": [
      "David G. Clark",
      "L.F. Abbott",
      "Ashok Litwin-Kumar"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2207.13586",
    "title": "Encoding Concepts in Graph Neural Networks",
    "abstract": " Title: Encoding Concepts in Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2207.13586",
    "authors": [
      "Lucie Charlotte Magister",
      "Pietro Barbiero",
      "Dmitry Kazhdan",
      "Federico Siciliano",
      "Gabriele Ciravegna",
      "Fabrizio Silvestri",
      "Mateja Jamnik",
      "Pietro Lio"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2207.14358",
    "title": "Topological structure of complex predictions",
    "abstract": " Title: Topological structure of complex predictions ",
    "url": "https://arxiv.org/abs/2207.14358",
    "authors": [
      "Meng Liu",
      "Tamal K. Dey",
      "David F. Gleich"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Human-Computer Interaction (cs.HC)",
      "Social and Information Networks (cs.SI)",
      "Algebraic Topology (math.AT)"
    ]
  },
  {
    "id": "arXiv:2208.00031",
    "title": "Paddy Leaf diseases identification on Infrared Images based on  Convolutional Neural Networks",
    "abstract": " Comments: Uploaded a different draft by mistake ",
    "url": "https://arxiv.org/abs/2208.00031",
    "authors": [
      "Petchiammal A",
      "Briskline Kiruba S",
      "D. Murugan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.00277",
    "title": "MobileNeRF: Exploiting the Polygon Rasterization Pipeline for Efficient  Neural Field Rendering on Mobile Architectures",
    "abstract": " Comments: Project page: this https URL, code: this https URL ",
    "url": "https://arxiv.org/abs/2208.00277",
    "authors": [
      "Zhiqin Chen",
      "Thomas Funkhouser",
      "Peter Hedman",
      "Andrea Tagliasacchi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.01008",
    "title": "CBAG: An Efficient Genetic Algorithm for the Graph Burning Problem",
    "abstract": " Comments: 10 pages, 6 figures, 4 tables. Source code used for this work is available online: see this https URL ",
    "url": "https://arxiv.org/abs/2208.01008",
    "authors": [
      "Mahdi Nazeri",
      "Ali Mollahosseini",
      "Iman Izadi"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2208.01720",
    "title": "Simple, strict, proper, happy: A study of reachability in temporal  graphs",
    "abstract": " Comments: 20 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2208.01720",
    "authors": [
      "Arnaud Casteigts",
      "Timothée Corsini",
      "Writika Sarkar"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2208.01881",
    "title": "Graph Signal Processing for Heterogeneous Change Detection Part I:  Vertex Domain Filtering",
    "abstract": " Title: Graph Signal Processing for Heterogeneous Change Detection Part I:  Vertex Domain Filtering ",
    "url": "https://arxiv.org/abs/2208.01881",
    "authors": [
      "Yuli Sun",
      "Lin Lei",
      "Dongdong Guan",
      "Gangyao Kuang",
      "Li Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2208.01905",
    "title": "Graph Signal Processing for Heterogeneous Change Detection Part II:  Spectral Domain Analysis",
    "abstract": " Title: Graph Signal Processing for Heterogeneous Change Detection Part II:  Spectral Domain Analysis ",
    "url": "https://arxiv.org/abs/2208.01905",
    "authors": [
      "Yuli Sun",
      "Lin Lei",
      "Dongdong Guan",
      "Gangyao Kuang",
      "Li Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.02384",
    "title": "POMDP-based Handoffs for User-Centric Cell-Free MIMO Networks",
    "abstract": " Comments: IEEE Global Communications Conference 2022 ",
    "url": "https://arxiv.org/abs/2208.02384",
    "authors": [
      "Hussein A. Ammar",
      "Raviraj Adve",
      "Shahram Shahbazpanahi",
      "Gary Boudreau",
      "Kothapalli Venkata Srinivas"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2208.02712",
    "title": "UTOPIC: Uncertainty-aware Overlap Prediction Network for Partial Point  Cloud Registration",
    "abstract": " Title: UTOPIC: Uncertainty-aware Overlap Prediction Network for Partial Point  Cloud Registration ",
    "url": "https://arxiv.org/abs/2208.02712",
    "authors": [
      "Zhilei Chen",
      "Honghua Chen",
      "Lina Gong",
      "Xuefeng Yan",
      "Jun Wang",
      "Yanwen Guo",
      "Jing Qin",
      "Mingqiang Wei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.02803",
    "title": "Implicit Semantic Augmentation for Distance Metric Learning in Domain  Generalization",
    "abstract": " Comments: Accept to ACMMM2022 ",
    "url": "https://arxiv.org/abs/2208.02803",
    "authors": [
      "Mengzhu Wang",
      "Jianlong Yuan",
      "Qi Qian",
      "Zhibin Wang",
      "Hao Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Algebraic Topology (math.AT)"
    ]
  },
  {
    "id": "arXiv:2208.03162",
    "title": "Robust Acoustic Domain Identification with its Application to Speaker  Diarization",
    "abstract": " Comments: Accepted for publication in International Journal of Speech Technology (Springer Nature) ",
    "url": "https://arxiv.org/abs/2208.03162",
    "authors": [
      "A Kishore Kumar",
      "Shefali Waldekar",
      "Md Sahidullah",
      "Goutam Saha"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  }
]