[
  {
    "id": "arXiv:2403.18825",
    "title": "Numerical evaluation of code live-load models for estimating the forces  caused by actual vehicles that act on bridge substructures",
    "abstract": "The present paper assesses the efficacy of code live-load models in accurately estimating the vehicular loads transferred to bridge substructures, such as abutments, piers, and foundations. Realistic traffic vehicle data are represented using four Weigh-in-Motion databases, which provide an authentic representation of vehicle information, thus providing a realistic basis for the examination of the bridges studied. The evaluation includes various bridge models, such as single-span girder bridges and two-, three-, and four-span continuous pinned-support girder bridges. By analyzing exceedance rates, the study compares the extreme force values obtained for vehicles in the databases with those predicted by selected code live-load models. These exceedance rates are presented in spectra format, as a function of the span length. The significant variations observed in the exceedance rates highlight the need for improving existing code live-load models to achieve more accurate estimations of the forces transferred to bridge substructures. Such improvements would lead to more uniform reliability levels for any limit state, such as resistance, fatigue, serviceability, and cracking. ",
    "url": "https://arxiv.org/abs/2403.18825",
    "authors": [
      "Alejandro Hernandez-Martinez",
      "Adrian D. Garcia-Soto",
      "Jesus G. Valdes-Vazquez"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2403.18827",
    "title": "Bridging Generative Networks with the Common Model of Cognition",
    "abstract": "This article presents a theoretical framework for adapting the Common Model of Cognition to large generative network models within the field of artificial intelligence. This can be accomplished by restructuring modules within the Common Model into shadow production systems that are peripheral to a central production system, which handles higher-level reasoning based on the shadow productions' output. Implementing this novel structure within the Common Model allows for a seamless connection between cognitive architectures and generative neural networks. ",
    "url": "https://arxiv.org/abs/2403.18827",
    "authors": [
      "Robert L. West",
      "Spencer Eckler",
      "Brendan Conway-Smith",
      "Nico Turcas",
      "Eilene Tomkins-Flanagan",
      "Mary Alexandria Kelly"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2403.18846",
    "title": "The Blind Normalized Stein Variational Gradient Descent-Based Detection  for Intelligent Massive Random Access",
    "abstract": "The lack of an efficient preamble detection algorithm remains a challenge for solving preamble collision problems in intelligent massive random access (RA) in practical communication scenarios. To solve this problem, we present a novel early preamble detection scheme based on a maximum likelihood estimation (MLE) model at the first step of the grant-based RA procedure. A novel blind normalized Stein variational gradient descent (SVGD)-based detector is proposed to obtain an approximate solution to the MLE model. First, by exploring the relationship between the Hadamard transform and wavelet transform, a new modified Hadamard transform (MHT) is developed to separate high-frequencies from important components using the second-order derivative filter. Next, to eliminate noise and mitigate the vanishing gradients problem in the SVGD-based detectors, the block MHT layer is designed based on the MHT, scaling layer, soft-thresholding layer, inverse MHT and sparsity penalty. Then, the blind normalized SVGD algorithm is derived to perform preamble detection without prior knowledge of noise power and the number of active devices. The experimental results show the proposed block MHT layer outperforms other transform-based methods in terms of computation costs and denoising performance. Furthermore, with the assistance of the block MHT layer, the proposed blind normalized SVGD algorithm achieves a higher preamble detection accuracy and throughput than other state-of-the-art detection methods. ",
    "url": "https://arxiv.org/abs/2403.18846",
    "authors": [
      "Xin Zhu",
      "Ahmet Enis Cetin"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.18855",
    "title": "Directed Criteria Citation Recommendation and Ranking Through Link  Prediction",
    "abstract": "We explore link prediction as a proxy for automatically surfacing documents from existing literature that might be topically or contextually relevant to a new document. Our model uses transformer-based graph embeddings to encode the meaning of each document, presented as a node within a citation network. We show that the semantic representations that our model generates can outperform other content-based methods in recommendation and ranking tasks. This provides a holistic approach to exploring citation graphs in domains where it is critical that these documents properly cite each other, so as to minimize the possibility of any inconsistencies ",
    "url": "https://arxiv.org/abs/2403.18855",
    "authors": [
      "William Watson",
      "Lawrence Yong"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.18866",
    "title": "Graph Bayesian Optimization for Multiplex Influence Maximization",
    "abstract": "Influence maximization (IM) is the problem of identifying a limited number of initial influential users within a social network to maximize the number of influenced users. However, previous research has mostly focused on individual information propagation, neglecting the simultaneous and interactive dissemination of multiple information items. In reality, when users encounter a piece of information, such as a smartphone product, they often associate it with related products in their minds, such as earphones or computers from the same brand. Additionally, information platforms frequently recommend related content to users, amplifying this cascading effect and leading to multiplex influence diffusion. This paper first formulates the Multiplex Influence Maximization (Multi-IM) problem using multiplex diffusion models with an information association mechanism. In this problem, the seed set is a combination of influential users and information. To effectively manage the combinatorial complexity, we propose Graph Bayesian Optimization for Multi-IM (GBIM). The multiplex diffusion process is thoroughly investigated using a highly effective global kernelized attention message-passing module. This module, in conjunction with Bayesian linear regression (BLR), produces a scalable surrogate model. A data acquisition module incorporating the exploration-exploitation trade-off is developed to optimize the seed set further. Extensive experiments on synthetic and real-world datasets have proven our proposed framework effective. The code is available at https://github.com/zirui-yuan/GBIM. ",
    "url": "https://arxiv.org/abs/2403.18866",
    "authors": [
      "Zirui Yuan",
      "Minglai Shao",
      "Zhiqian Chen"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.18868",
    "title": "A recommender network perspective on the informational value of critics  and crowds",
    "abstract": "How do the ratings of critics and amateurs compare and how should they be combined? Previous research has produced mixed results about the first question, while the second remains unanswered. We have created a new, unique dataset, with wine ratings from critics and amateurs, and simulated a recommender system using the k-nearest-neighbor algorithm. We then formalized the advice seeking network spanned by that algorithm and studied people's relative influence. We find that critics are more consistent than amateurs, and thus their advice is more predictive than advice from amateurs. Getting advice from both groups can further boost performance. Our network theoretic approach allows us to identify influential critics, talented amateurs, and the information flow between groups. Our results provide evidence about the informational function of critics, while our framework is broadly applicable and can be leveraged to devise good decision strategies and more transparent recommender systems. ",
    "url": "https://arxiv.org/abs/2403.18868",
    "authors": [
      "Pantelis P. Analytis",
      "Karthikeya Kaushik",
      "Stefan Herzog",
      "Bahador Bahrami",
      "Ophelia Deroy"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.18869",
    "title": "Efficient Unsupervised Community Search with Pre-trained Graph  Transformer",
    "abstract": "Community search has aroused widespread interest in the past decades. Among existing solutions, the learning-based models exhibit outstanding performance in terms of accuracy by leveraging labels to 1) train the model for community score learning, and 2) select the optimal threshold for community identification. However, labeled data are not always available in real-world scenarios. To address this notable limitation of learning-based models, we propose a pre-trained graph Transformer based community search framework that uses Zero label (i.e., unsupervised), termed TransZero. TransZero has two key phases, i.e., the offline pre-training phase and the online search phase. Specifically, in the offline pretraining phase, we design an efficient and effective community search graph transformer (CSGphormer) to learn node representation. To pre-train CSGphormer without the usage of labels, we introduce two self-supervised losses, i.e., personalization loss and link loss, motivated by the inherent uniqueness of node and graph topology, respectively. In the online search phase, with the representation learned by the pre-trained CSGphormer, we compute the community score without using labels by measuring the similarity of representations between the query nodes and the nodes in the graph. To free the framework from the usage of a label-based threshold, we define a new function named expected score gain to guide the community identification process. Furthermore, we propose two efficient and effective algorithms for the community identification process that run without the usage of labels. Extensive experiments over 10 public datasets illustrate the superior performance of TransZero regarding both accuracy and efficiency. ",
    "url": "https://arxiv.org/abs/2403.18869",
    "authors": [
      "Jianwei Wang",
      "Kai Wang",
      "Xuemin Lin",
      "Wenjie Zhang",
      "Ying Zhang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2403.18874",
    "title": "Neural Attributed Community Search at Billion Scale",
    "abstract": "Community search has been extensively studied in the past decades. In recent years, there is a growing interest in attributed community search that aims to identify a community based on both the query nodes and query attributes. A set of techniques have been investigated. Though the recent methods based on advanced learning models such as graph neural networks (GNNs) can achieve state-of-the-art performance in terms of accuracy, we notice that 1) they suffer from severe efficiency issues; 2) they directly model community search as a node classification problem and thus cannot make good use of interdependence among different entities in the graph. Motivated by these, in this paper, we propose a new neurAL attrIbuted Community sEarch model for large-scale graphs, termed ALICE. ALICE first extracts a candidate subgraph to reduce the search scope and subsequently predicts the community by the Consistency-aware Net , termed ConNet. Specifically, in the extraction phase, we introduce the density sketch modularity that uses a unified form to combine the strengths of two existing powerful modularities, i.e., classical modularity and density modularity. Based on the new modularity metric, we first adaptively obtain the candidate subgraph, formed by the k-hop neighbors of the query nodes, with the maximum modularity. Then, we construct a node-attribute bipartite graph to take attributes into consideration. After that, ConNet adopts a cross-attention encoder to encode the interaction between the query and the graph. The training of the model is guided by the structure-attribute consistency and the local consistency to achieve better performance. Extensive experiments over 11 real-world datasets including one billion-scale graph demonstrate the superiority of ALICE in terms of accuracy, efficiency, and scalability. ",
    "url": "https://arxiv.org/abs/2403.18874",
    "authors": [
      "Jianwei Wang",
      "Kai Wang",
      "Xuemin Lin",
      "Wenjie Zhang",
      "Ying Zhang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.18878",
    "title": "AIC-UNet: Anatomy-informed Cascaded UNet for Robust Multi-Organ  Segmentation",
    "abstract": "Imposing key anatomical features, such as the number of organs, their shapes, sizes, and relative positions, is crucial for building a robust multi-organ segmentation model. Current attempts to incorporate anatomical features include broadening effective receptive fields (ERF) size with resource- and data-intensive modules such as self-attention or introducing organ-specific topology regularizers, which may not scale to multi-organ segmentation problems where inter-organ relation also plays a huge role. We introduce a new approach to impose anatomical constraints on any existing encoder-decoder segmentation model by conditioning model prediction with learnable anatomy prior. More specifically, given an abdominal scan, a part of the encoder spatially warps a learnable prior to align with the given input scan using thin plate spline (TPS) grid interpolation. The warped prior is then integrated during the decoding phase to guide the model for more anatomy-informed predictions. Code is available at \\hyperlink{https://anonymous.4open.science/r/AIC-UNet-7048}{https://anonymous.4open.science/r/AIC-UNet-7048}. ",
    "url": "https://arxiv.org/abs/2403.18878",
    "authors": [
      "Young Seok Jeon",
      "Hongfei Yang",
      "Huazhu Fu",
      "Mengling Feng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2403.18910",
    "title": "A Geometric Explanation of the Likelihood OOD Detection Paradox",
    "abstract": "Likelihood-based deep generative models (DGMs) commonly exhibit a puzzling behaviour: when trained on a relatively complex dataset, they assign higher likelihood values to out-of-distribution (OOD) data from simpler sources. Adding to the mystery, OOD samples are never generated by these DGMs despite having higher likelihoods. This two-pronged paradox has yet to be conclusively explained, making likelihood-based OOD detection unreliable. Our primary observation is that high-likelihood regions will not be generated if they contain minimal probability mass. We demonstrate how this seeming contradiction of large densities yet low probability mass can occur around data confined to low-dimensional manifolds. We also show that this scenario can be identified through local intrinsic dimension (LID) estimation, and propose a method for OOD detection which pairs the likelihoods and LID estimates obtained from a pre-trained DGM. Our method can be applied to normalizing flows and score-based diffusion models, and obtains results which match or surpass state-of-the-art OOD detection benchmarks using the same DGM backbones. Our code is available at https://github.com/layer6ai-labs/dgm_ood_detection. ",
    "url": "https://arxiv.org/abs/2403.18910",
    "authors": [
      "Hamidreza Kamkari",
      "Brendan Leigh Ross",
      "Jesse C. Cresswell",
      "Anthony L. Caterini",
      "Rahul G. Krishnan",
      "Gabriel Loaiza-Ganem"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.18930",
    "title": "Optimizing Wireless Networks with Deep Unfolding: Comparative Study on  Two Deep Unfolding Mechanisms",
    "abstract": "In this work, we conduct a comparative study on two deep unfolding mechanisms to efficiently perform power control in the next generation wireless networks. The power control problem is formulated as energy efficiency over multiple interference links. The problem is nonconvex. We employ fractional programming transformation to design two solutions for the problem. The first solution is a numerical solution while the second solution is a closed-form solution. Based on the first solution, we design a semi-unfolding deep learning model where we combine the domain knowledge of the wireless communications and the recent advances in the data-driven deep learning. Moreover, on the highlights of the closed-form solution, fully deep unfolded deep learning model is designed in which we fully leveraged the expressive closed-form power control solution and deep learning advances. In the simulation results, we compare the performance of the proposed deep learning models and the iterative solutions in terms of accuracy and inference speed to show their suitability for the real-time application in next generation networks. ",
    "url": "https://arxiv.org/abs/2403.18930",
    "authors": [
      "Abuzar B. M. Adam",
      "Mohammed A. M. Elhassan",
      "Elhadj Moustapha Diallo"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.18946",
    "title": "Random Aggregate Beamforming for Over-the-Air Federated Learning in  Large-Scale Networks",
    "abstract": "At present, there is a trend to deploy ubiquitous artificial intelligence (AI) applications at the edge of the network. As a promising framework that enables secure edge intelligence, federated learning (FL) has received widespread attention, and over-the-air computing (AirComp) has been integrated to further improve the communication efficiency. In this paper, we consider a joint device selection and aggregate beamforming design with the objectives of minimizing the aggregate error and maximizing the number of selected devices. This yields a combinatorial problem, which is difficult to solve especially in large-scale networks. To tackle the problems in a cost-effective manner, we propose a random aggregate beamforming-based scheme, which generates the aggregator beamforming vector via random sampling rather than optimization. The implementation of the proposed scheme does not require the channel estimation. We additionally use asymptotic analysis to study the obtained aggregate error and the number of the selected devices when the number of devices becomes large. Furthermore, a refined method that runs with multiple randomizations is also proposed for performance improvement. Extensive simulation results are presented to demonstrate the effectiveness of the proposed random aggregate beamforming-based scheme as well as the refined method. ",
    "url": "https://arxiv.org/abs/2403.18946",
    "authors": [
      "Chunmei Xu",
      "Shengheng Liu",
      "Yongming Huang",
      "Bjorn Ottersten",
      "Dusit Niyato"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.18947",
    "title": "Self-Supervised Interpretable Sensorimotor Learning via Latent  Functional Modularity",
    "abstract": "We introduce MoNet, a novel method that combines end-to-end learning with modular network architectures for self-supervised and interpretable sensorimotor learning. MoNet is composed of three functionally distinct neural modules: Perception, Planning, and Control. Leveraging its inherent modularity through a cognition-guided contrastive loss function, MoNet efficiently learns task-specific decision-making processes in latent space, without requiring task-level supervision. Moreover, our method incorporates an online post-hoc explainability approach, which enhances the interpretability of the end-to-end inferences without a trade-off in sensorimotor performance. In real-world indoor environments, MoNet demonstrates effective visual autonomous navigation, surpassing baseline models by 11% to 47% in task specificity analysis. We further delve into the interpretability of our network through the post-hoc analysis of perceptual saliency maps and latent decision vectors. This offers insights into the incorporation of explainable artificial intelligence within the realm of robotic learning, encompassing both perceptual and behavioral perspectives. ",
    "url": "https://arxiv.org/abs/2403.18947",
    "authors": [
      "Hyunki Seong",
      "David Hyunchul Shim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.18949",
    "title": "An IoT Based Water-Logging Detection System: A Case Study of Dhaka",
    "abstract": "With a large number of populations, many problems are rising rapidly in Dhaka, the capital city of Bangladesh. Water-logging is one of the major issues among them. Heavy rainfall, lack of awareness and poor maintenance causes bad sewerage system in the city. As a result, water is overflowed on the roads and sometimes it gets mixed with the drinking water. To overcome this problem, this paper realizes the potential of using Internet of Things to combat water-logging in drainage pipes which are used to move wastes as well as rainwater away from the city. The proposed system will continuously monitor real time water level, water flow and gas level inside the drainage pipe. Moreover, all the monitoring data will be stored in the central database for graphical representation and further analysis. In addition to that if any emergency arises in the drainage system, an alert will be sent directly to the nearest maintenance office. ",
    "url": "https://arxiv.org/abs/2403.18949",
    "authors": [
      "Md Manirul Islam",
      "Md. Sadad Mahamud",
      "Umme Salsabil",
      "A.A.M. Mazharul Amin",
      "Samiul Haque Suman"
    ],
    "subjectives": [
      "Other Computer Science (cs.OH)"
    ]
  },
  {
    "id": "arXiv:2403.18960",
    "title": "Robust In-Hand Manipulation with Extrinsic Contacts",
    "abstract": "We present in-hand manipulation tasks where a robot moves an object in grasp, maintains its external contact mode with the environment, and adjusts its in-hand pose simultaneously. The proposed manipulation task leads to complex contact interactions which can be very susceptible to uncertainties in kinematic and physical parameters. Therefore, we propose a robust in-hand manipulation method, which consists of two parts. First, an in-gripper mechanics model that computes a na\\\"ive motion cone assuming all parameters are precise. Then, a robust planning method refines the motion cone to maintain desired contact mode regardless of parametric errors. Real-world experiments were conducted to illustrate the accuracy of the mechanics model and the effectiveness of the robust planning framework in the presence of kinematics parameter errors. ",
    "url": "https://arxiv.org/abs/2403.18960",
    "authors": [
      "Boyuan Liang",
      "Kei Ota",
      "Masayoshi Tomizuka",
      "Devesh Jha"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.18985",
    "title": "Robustness and Visual Explanation for Black Box Image, Video, and ECG  Signal Classification with Reinforcement Learning",
    "abstract": "We present a generic Reinforcement Learning (RL) framework optimized for crafting adversarial attacks on different model types spanning from ECG signal analysis (1D), image classification (2D), and video classification (3D). The framework focuses on identifying sensitive regions and inducing misclassifications with minimal distortions and various distortion types. The novel RL method outperforms state-of-the-art methods for all three applications, proving its efficiency. Our RL approach produces superior localization masks, enhancing interpretability for image classification and ECG analysis models. For applications such as ECG analysis, our platform highlights critical ECG segments for clinicians while ensuring resilience against prevalent distortions. This comprehensive tool aims to bolster both resilience with adversarial training and transparency across varied applications and data types. ",
    "url": "https://arxiv.org/abs/2403.18985",
    "authors": [
      "Soumyendu Sarkar",
      "Ashwin Ramesh Babu",
      "Sajad Mousavi",
      "Vineet Gundecha",
      "Avisek Naug",
      "Sahand Ghorbanpour"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2403.19001",
    "title": "Cross--domain Fiber Cluster Shape Analysis for Language Performance  Cognitive Score Prediction",
    "abstract": "Shape plays an important role in computer graphics, offering informative features to convey an object's morphology and functionality. Shape analysis in brain imaging can help interpret structural and functionality correlations of the human brain. In this work, we investigate the shape of the brain's 3D white matter connections and its potential predictive relationship to human cognitive function. We reconstruct brain connections as sequences of 3D points using diffusion magnetic resonance imaging (dMRI) tractography. To describe each connection, we extract 12 shape descriptors in addition to traditional dMRI connectivity and tissue microstructure features. We introduce a novel framework, Shape--fused Fiber Cluster Transformer (SFFormer), that leverages a multi-head cross-attention feature fusion module to predict subject-specific language performance based on dMRI tractography. We assess the performance of the method on a large dataset including 1065 healthy young adults. The results demonstrate that both the transformer-based SFFormer model and its inter/intra feature fusion with shape, microstructure, and connectivity are informative, and together, they improve the prediction of subject-specific language performance scores. Overall, our results indicate that the shape of the brain's connections is predictive of human language function. ",
    "url": "https://arxiv.org/abs/2403.19001",
    "authors": [
      "Yui Lo",
      "Yuqian Chen",
      "Dongnan Liu",
      "Wan Liu",
      "Leo Zekelman",
      "Fan Zhang",
      "Yogesh Rathi",
      "Nikos Makris",
      "Alexandra J. Golby",
      "Weidong Cai",
      "Lauren J. O'Donnell"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Image and Video Processing (eess.IV)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2403.19002",
    "title": "Robust Active Speaker Detection in Noisy Environments",
    "abstract": "This paper addresses the issue of active speaker detection (ASD) in noisy environments and formulates a robust active speaker detection (rASD) problem. Existing ASD approaches leverage both audio and visual modalities, but non-speech sounds in the surrounding environment can negatively impact performance. To overcome this, we propose a novel framework that utilizes audio-visual speech separation as guidance to learn noise-free audio features. These features are then utilized in an ASD model, and both tasks are jointly optimized in an end-to-end framework. Our proposed framework mitigates residual noise and audio quality reduction issues that can occur in a naive cascaded two-stage framework that directly uses separated speech for ASD, and enables the two tasks to be optimized simultaneously. To further enhance the robustness of the audio features and handle inherent speech noises, we propose a dynamic weighted loss approach to train the speech separator. We also collected a real-world noise audio dataset to facilitate investigations. Experiments demonstrate that non-speech audio noises significantly impact ASD models, and our proposed approach improves ASD performance in noisy environments. The framework is general and can be applied to different ASD approaches to improve their robustness. Our code, models, and data will be released. ",
    "url": "https://arxiv.org/abs/2403.19002",
    "authors": [
      "Siva Sai Nagender Vasireddy",
      "Chenxu Zhang",
      "Xiaohu Guo",
      "Yapeng Tian"
    ],
    "subjectives": [
      "Multimedia (cs.MM)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2403.19009",
    "title": "Towards Sustainable SecureML: Quantifying Carbon Footprint of  Adversarial Machine Learning",
    "abstract": "The widespread adoption of machine learning (ML) across various industries has raised sustainability concerns due to its substantial energy usage and carbon emissions. This issue becomes more pressing in adversarial ML, which focuses on enhancing model security against different network-based attacks. Implementing defenses in ML systems often necessitates additional computational resources and network security measures, exacerbating their environmental impacts. In this paper, we pioneer the first investigation into adversarial ML's carbon footprint, providing empirical evidence connecting greater model robustness to higher emissions. Addressing the critical need to quantify this trade-off, we introduce the Robustness Carbon Trade-off Index (RCTI). This novel metric, inspired by economic elasticity principles, captures the sensitivity of carbon emissions to changes in adversarial robustness. We demonstrate the RCTI through an experiment involving evasion attacks, analyzing the interplay between robustness against attacks, performance, and carbon emissions. ",
    "url": "https://arxiv.org/abs/2403.19009",
    "authors": [
      "Syed Mhamudul Hasan",
      "Abdur R. Shahid",
      "Ahmed Imteaj"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.19016",
    "title": "Resource Allocation in Large Language Model Integrated 6G Vehicular  Networks",
    "abstract": "In the upcoming 6G era, vehicular networks are shifting from simple Vehicle-to-Vehicle (V2V) communication to the more complex Vehicle-to-Everything (V2X) connectivity. At the forefront of this shift is the incorporation of Large Language Models (LLMs) into vehicles. Known for their sophisticated natural language processing abilities, LLMs change how users interact with their vehicles. This integration facilitates voice-driven commands and interactions, departing from the conventional manual control systems. However, integrating LLMs into vehicular systems presents notable challenges. The substantial computational demands and energy requirements of LLMs pose significant challenges, especially in the constrained environment of a vehicle. Additionally, the time-sensitive nature of tasks in vehicular networks adds another layer of complexity. In this paper, we consider an edge computing system where vehicles process the initial layers of LLM computations locally, and offload the remaining LLM computation tasks to the Roadside Units (RSUs), envisioning a vehicular ecosystem where LLM computations seamlessly interact with the ultra-low latency and high-bandwidth capabilities of 6G networks. To balance the trade-off between completion time and energy consumption, we formulate a multi-objective optimization problem to minimize the total cost of the vehicles and RSUs. The problem is then decomposed into two sub-problems, which are solved by sequential quadratic programming (SQP) method and fractional programming technique. The simulation results clearly indicate that the algorithm we have proposed is highly effective in reducing both the completion time and energy consumption of the system. ",
    "url": "https://arxiv.org/abs/2403.19016",
    "authors": [
      "Chang Liu",
      "Jun Zhao"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Signal Processing (eess.SP)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2403.19026",
    "title": "Egocentric Scene-aware Human Trajectory Prediction",
    "abstract": "Wearable collaborative robots stand to assist human wearers who need fall prevention assistance or wear exoskeletons. Such a robot needs to be able to predict the ego motion of the wearer based on egocentric vision and the surrounding scene. In this work, we leveraged body-mounted cameras and sensors to anticipate the trajectory of human wearers through complex surroundings. To facilitate research in ego-motion prediction, we have collected a comprehensive walking scene navigation dataset centered on the user's perspective. We present a method to predict human motion conditioning on the surrounding static scene. Our method leverages a diffusion model to produce a distribution of potential future trajectories, taking into account the user's observation of the environment. We introduce a compact representation to encode the user's visual memory of the surroundings, as well as an efficient sample-generating technique to speed up real-time inference of a diffusion model. We ablate our model and compare it to baselines, and results show that our model outperforms existing methods on key metrics of collision avoidance and trajectory mode coverage. ",
    "url": "https://arxiv.org/abs/2403.19026",
    "authors": [
      "Weizhuo Wang",
      "C. Karen Liu",
      "Monroe Kennedy III"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19031",
    "title": "Evaluating Large Language Models for Health-Related Text Classification  Tasks with Public Social Media Data",
    "abstract": "Large language models (LLMs) have demonstrated remarkable success in NLP tasks. However, there is a paucity of studies that attempt to evaluate their performances on social media-based health-related natural language processing tasks, which have traditionally been difficult to achieve high scores in. We benchmarked one supervised classic machine learning model based on Support Vector Machines (SVMs), three supervised pretrained language models (PLMs) based on RoBERTa, BERTweet, and SocBERT, and two LLM based classifiers (GPT3.5 and GPT4), across 6 text classification tasks. We developed three approaches for leveraging LLMs for text classification: employing LLMs as zero-shot classifiers, us-ing LLMs as annotators to annotate training data for supervised classifiers, and utilizing LLMs with few-shot examples for augmentation of manually annotated data. Our comprehensive experiments demonstrate that employ-ing data augmentation using LLMs (GPT-4) with relatively small human-annotated data to train lightweight supervised classification models achieves superior results compared to training with human-annotated data alone. Supervised learners also outperform GPT-4 and GPT-3.5 in zero-shot settings. By leveraging this data augmentation strategy, we can harness the power of LLMs to develop smaller, more effective domain-specific NLP models. LLM-annotated data without human guidance for training light-weight supervised classification models is an ineffective strategy. However, LLM, as a zero-shot classifier, shows promise in excluding false negatives and potentially reducing the human effort required for data annotation. Future investigations are imperative to explore optimal training data sizes and the optimal amounts of augmented data. ",
    "url": "https://arxiv.org/abs/2403.19031",
    "authors": [
      "Yuting Guo",
      "Anthony Ovadje",
      "Mohammed Ali Al-Garadi",
      "Abeed Sarker"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19043",
    "title": "Illicit object detection in X-ray images using Vision Transformers",
    "abstract": "Illicit object detection is a critical task performed at various high-security locations, including airports, train stations, subways, and ports. The continuous and tedious work of examining thousands of X-ray images per hour can be mentally taxing. Thus, Deep Neural Networks (DNNs) can be used to automate the X-ray image analysis process, improve efficiency and alleviate the security officers' inspection burden. The neural architectures typically utilized in relevant literature are Convolutional Neural Networks (CNNs), with Vision Transformers (ViTs) rarely employed. In order to address this gap, this paper conducts a comprehensive evaluation of relevant ViT architectures on illicit item detection in X-ray images. This study utilizes both Transformer and hybrid backbones, such as SWIN and NextViT, and detectors, such as DINO and RT-DETR. The results demonstrate the remarkable accuracy of the DINO Transformer detector in the low-data regime, the impressive real-time performance of YOLOv8, and the effectiveness of the hybrid NextViT backbone. ",
    "url": "https://arxiv.org/abs/2403.19043",
    "authors": [
      "Jorgen Cani",
      "Ioannis Mademlis",
      "Adamantia Anna Rebolledo Chrysochoou",
      "Georgios Th. Papadopoulos"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19061",
    "title": "One Code Fits All: Strong stuck-at codes for versatile memory encoding",
    "abstract": "In this work we consider a generalization of the well-studied problem of coding for ``stuck-at'' errors, which we refer to as ``strong stuck-at'' codes. In the traditional framework of stuck-at codes, the task involves encoding a message into a one-dimensional binary vector. However, a certain number of the bits in this vector are 'frozen', meaning they are fixed at a predetermined value and cannot be altered by the encoder. The decoder, aware of the proportion of frozen bits but not their specific positions, is responsible for deciphering the intended message. We consider a more challenging version of this problem where the decoder does not know also the fraction of frozen bits. We construct explicit and efficient encoding and decoding algorithms that get arbitrarily close to capacity in this scenario. Furthermore, to the best of our knowledge, our construction is the first, fully explicit construction of stuck-at codes that approach capacity. ",
    "url": "https://arxiv.org/abs/2403.19061",
    "authors": [
      "Roni Con",
      "Ryan Gabrys",
      "Eitan Yaakobi"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2403.19078",
    "title": "MVEB: Self-Supervised Learning with Multi-View Entropy Bottleneck",
    "abstract": "Self-supervised learning aims to learn representation that can be effectively generalized to downstream tasks. Many self-supervised approaches regard two views of an image as both the input and the self-supervised signals, assuming that either view contains the same task-relevant information and the shared information is (approximately) sufficient for predicting downstream tasks. Recent studies show that discarding superfluous information not shared between the views can improve generalization. Hence, the ideal representation is sufficient for downstream tasks and contains minimal superfluous information, termed minimal sufficient representation. One can learn this representation by maximizing the mutual information between the representation and the supervised view while eliminating superfluous information. Nevertheless, the computation of mutual information is notoriously intractable. In this work, we propose an objective termed multi-view entropy bottleneck (MVEB) to learn minimal sufficient representation effectively. MVEB simplifies the minimal sufficient learning to maximizing both the agreement between the embeddings of two views and the differential entropy of the embedding distribution. Our experiments confirm that MVEB significantly improves performance. For example, it achieves top-1 accuracy of 76.9\\% on ImageNet with a vanilla ResNet-50 backbone on linear evaluation. To the best of our knowledge, this is the new state-of-the-art result with ResNet-50. ",
    "url": "https://arxiv.org/abs/2403.19078",
    "authors": [
      "Liangjian Wen",
      "Xiasi Wang",
      "Jianzhuang Liu",
      "Zenglin Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.19079",
    "title": "A Real-Time Framework for Domain-Adaptive Underwater Object Detection  with Image Enhancement",
    "abstract": "In recent years, significant progress has been made in the field of underwater image enhancement (UIE). However, its practical utility for high-level vision tasks, such as underwater object detection (UOD) in Autonomous Underwater Vehicles (AUVs), remains relatively unexplored. It may be attributed to several factors: (1) Existing methods typically employ UIE as a pre-processing step, which inevitably introduces considerable computational overhead and latency. (2) The process of enhancing images prior to training object detectors may not necessarily yield performance improvements. (3) The complex underwater environments can induce significant domain shifts across different scenarios, seriously deteriorating the UOD performance. To address these challenges, we introduce EnYOLO, an integrated real-time framework designed for simultaneous UIE and UOD with domain-adaptation capability. Specifically, both the UIE and UOD task heads share the same network backbone and utilize a lightweight design. Furthermore, to ensure balanced training for both tasks, we present a multi-stage training strategy aimed at consistently enhancing their performance. Additionally, we propose a novel domain-adaptation strategy to align feature embeddings originating from diverse underwater environments. Comprehensive experiments demonstrate that our framework not only achieves state-of-the-art (SOTA) performance in both UIE and UOD tasks, but also shows superior adaptability when applied to different underwater scenarios. Our efficiency analysis further highlights the substantial potential of our framework for onboard deployment. ",
    "url": "https://arxiv.org/abs/2403.19079",
    "authors": [
      "Junjie Wen",
      "Jinqiang Cui",
      "Benyun Zhao",
      "Bingxin Han",
      "Xuchen Liu",
      "Zhi Gao",
      "Ben M. Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19080",
    "title": "MMCert: Provable Defense against Adversarial Attacks to Multi-modal  Models",
    "abstract": "Different from a unimodal model whose input is from a single modality, the input (called multi-modal input) of a multi-modal model is from multiple modalities such as image, 3D points, audio, text, etc. Similar to unimodal models, many existing studies show that a multi-modal model is also vulnerable to adversarial perturbation, where an attacker could add small perturbation to all modalities of a multi-modal input such that the multi-modal model makes incorrect predictions for it. Existing certified defenses are mostly designed for unimodal models, which achieve sub-optimal certified robustness guarantees when extended to multi-modal models as shown in our experimental results. In our work, we propose MMCert, the first certified defense against adversarial attacks to a multi-modal model. We derive a lower bound on the performance of our MMCert under arbitrary adversarial attacks with bounded perturbations to both modalities (e.g., in the context of auto-driving, we bound the number of changed pixels in both RGB image and depth image). We evaluate our MMCert using two benchmark datasets: one for the multi-modal road segmentation task and the other for the multi-modal emotion recognition task. Moreover, we compare our MMCert with a state-of-the-art certified defense extended from unimodal models. Our experimental results show that our MMCert outperforms the baseline. ",
    "url": "https://arxiv.org/abs/2403.19080",
    "authors": [
      "Yanting Wang",
      "Hongye Fu",
      "Wei Zou",
      "Jinyuan Jia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.19082",
    "title": "Enhancing Conformal Prediction Using E-Test Statistics",
    "abstract": "Conformal Prediction (CP) serves as a robust framework that quantifies uncertainty in predictions made by Machine Learning (ML) models. Unlike traditional point predictors, CP generates statistically valid prediction regions, also known as prediction intervals, based on the assumption of data exchangeability. Typically, the construction of conformal predictions hinges on p-values. This paper, however, ventures down an alternative path, harnessing the power of e-test statistics to augment the efficacy of conformal predictions by introducing a BB-predictor (bounded from the below predictor). ",
    "url": "https://arxiv.org/abs/2403.19082",
    "authors": [
      "A.A.Balinsky",
      "A.D.Balinsky"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2403.19083",
    "title": "Improving Cancer Imaging Diagnosis with Bayesian Networks and Deep  Learning: A Bayesian Deep Learning Approach",
    "abstract": "With recent advancements in the development of artificial intelligence applications using theories and algorithms in machine learning, many accurate models can be created to train and predict on given datasets. With the realization of the importance of imaging interpretation in cancer diagnosis, this article aims to investigate the theory behind Deep Learning and Bayesian Network prediction models. Based on the advantages and drawbacks of each model, different approaches will be used to construct a Bayesian Deep Learning Model, combining the strengths while minimizing the weaknesses. Finally, the applications and accuracy of the resulting Bayesian Deep Learning approach in the health industry in classifying images will be analyzed. ",
    "url": "https://arxiv.org/abs/2403.19083",
    "authors": [
      "Pei Xi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2403.19085",
    "title": "Real-time accident detection and physiological signal monitoring to  enhance motorbike safety and emergency response",
    "abstract": "Rapid urbanization and improved living standards have led to a substantial increase in the number of vehicles on the road, consequently resulting in a rise in the frequency of accidents. Among these accidents, motorbike accidents pose a particularly high risk, often resulting in serious injuries or deaths. A significant number of these fatalities occur due to delayed or inadequate medical attention. To this end, we propose a novel automatic detection and notification system specifically designed for motorbike accidents. The proposed system comprises two key components: a detection system and a physiological signal monitoring system. The detection system is integrated into the helmet and consists of a microcontroller, accelerometer, GPS, GSM, and Wi-Fi modules. The physio-monitoring system incorporates a sensor for monitoring pulse rate and SpO$_{2}$ saturation. All collected data are presented on an LCD display and wirelessly transmitted to the detection system through the microcontroller of the physiological signal monitoring system. If the accelerometer readings consistently deviate from the specified threshold decided through extensive experimentation, the system identifies the event as an accident and transmits the victim's information -- including the GPS location, pulse rate, and SpO$_{2}$ saturation rate -- to the designated emergency contacts. Preliminary results demonstrate the efficacy of the proposed system in accurately detecting motorbike accidents and promptly alerting emergency contacts. We firmly believe that the proposed system has the potential to significantly mitigate the risks associated with motorbike accidents and save lives. ",
    "url": "https://arxiv.org/abs/2403.19085",
    "authors": [
      "S. M. Kayser Mehbub Siam",
      "Khadiza Islam Sumaiya",
      "Md Rakib Al-Amin",
      "Tamim Hasan Turjo",
      "Ahsanul Islam",
      "A.H.M.A. Rahim",
      "Md Rakibul Hasan"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2403.19090",
    "title": "A Stabilized Physics Informed Neural Networks Method for Wave Equations",
    "abstract": "In this article, we propose a novel Stabilized Physics Informed Neural Networks method (SPINNs) for solving wave equations. In general, this method not only demonstrates theoretical convergence but also exhibits higher efficiency compared to the original PINNs. By replacing the $L^2$ norm with $H^1$ norm in the learning of initial condition and boundary condition, we theoretically proved that the error of solution can be upper bounded by the risk in SPINNs. Based on this, we decompose the error of SPINNs into approximation error, statistical error and optimization error. Furthermore, by applying the approximating theory of $ReLU^3$ networks and the learning theory on Rademacher complexity, covering number and pseudo-dimension of neural networks, we present a systematical non-asymptotic convergence analysis on our method, which shows that the error of SPINNs can be well controlled if the number of training samples, depth and width of the deep neural networks have been appropriately chosen. Two illustrative numerical examples on 1-dimensional and 2-dimensional wave equations demonstrate that SPINNs can achieve a faster and better convergence than classical PINNs method. ",
    "url": "https://arxiv.org/abs/2403.19090",
    "authors": [
      "Yuling Jiao",
      "Yuhui Liu",
      "Jerry Zhijian Yang",
      "Cheng Yuan"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Mathematical Physics (math-ph)"
    ]
  },
  {
    "id": "arXiv:2403.19096",
    "title": "SCALE: Constructing Structured Natural Language Comment Trees for  Software Vulnerability Detection",
    "abstract": "Recently, there has been a growing interest in automatic software vulnerability detection. Pre-trained model-based approaches have demonstrated superior performance than other Deep Learning (DL)-based approaches in detecting vulnerabilities. However, the existing pre-trained model-based approaches generally employ code sequences as input during prediction, and may ignore vulnerability-related structural information, as reflected in the following two aspects. First, they tend to fail to infer the semantics of the code statements with complex logic such as those containing multiple operators and pointers. Second, they are hard to comprehend various code execution sequences, which is essential for precise vulnerability detection. To mitigate the challenges, we propose a Structured Natural Language Comment tree-based vulnerAbiLity dEtection framework based on the pre-trained models, named SCALE. The proposed Structured Natural Language Comment Tree (SCT) integrates the semantics of code statements with code execution sequences based on the Abstract Syntax Trees (ASTs). Specifically, SCALE comprises three main modules: (1) Comment Tree Construction, which aims at enhancing the model's ability to infer the semantics of code statements by first incorporating Large Language Models (LLMs) for comment generation and then adding the comment node to ASTs. (2) Structured Natural Language Comment Tree Construction}, which aims at explicitly involving code execution sequence by combining the code syntax templates with the comment tree. (3) SCT-Enhanced Representation, which finally incorporates the constructed SCTs for well capturing vulnerability patterns. ",
    "url": "https://arxiv.org/abs/2403.19096",
    "authors": [
      "Xin-Cheng Wen",
      "Cuiyun Gao",
      "Shuzheng Gao",
      "Yang Xiao",
      "Michael R. Lyu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.19098",
    "title": "GraphAD: Interaction Scene Graph for End-to-end Autonomous Driving",
    "abstract": "Modeling complicated interactions among the ego-vehicle, road agents, and map elements has been a crucial part for safety-critical autonomous driving. Previous works on end-to-end autonomous driving rely on the attention mechanism for handling heterogeneous interactions, which fails to capture the geometric priors and is also computationally intensive. In this paper, we propose the Interaction Scene Graph (ISG) as a unified method to model the interactions among the ego-vehicle, road agents, and map elements. With the representation of the ISG, the driving agents aggregate essential information from the most influential elements, including the road agents with potential collisions and the map elements to follow. Since a mass of unnecessary interactions are omitted, the more efficient scene-graph-based framework is able to focus on indispensable connections and leads to better performance. We evaluate the proposed method for end-to-end autonomous driving on the nuScenes dataset. Compared with strong baselines, our method significantly outperforms in the full-stack driving tasks, including perception, prediction, and planning. Code will be released at https://github.com/zhangyp15/GraphAD. ",
    "url": "https://arxiv.org/abs/2403.19098",
    "authors": [
      "Yunpeng Zhang",
      "Deheng Qian",
      "Ding Li",
      "Yifeng Pan",
      "Yong Chen",
      "Zhenbao Liang",
      "Zhiyao Zhang",
      "Shurui Zhang",
      "Hongxu Li",
      "Maolei Fu",
      "Yun Ye",
      "Zhujin Liang",
      "Yi Shan",
      "Dalong Du"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19104",
    "title": "CRKD: Enhanced Camera-Radar Object Detection with Cross-modality  Knowledge Distillation",
    "abstract": "In the field of 3D object detection for autonomous driving, LiDAR-Camera (LC) fusion is the top-performing sensor configuration. Still, LiDAR is relatively high cost, which hinders adoption of this technology for consumer automobiles. Alternatively, camera and radar are commonly deployed on vehicles already on the road today, but performance of Camera-Radar (CR) fusion falls behind LC fusion. In this work, we propose Camera-Radar Knowledge Distillation (CRKD) to bridge the performance gap between LC and CR detectors with a novel cross-modality KD framework. We use the Bird's-Eye-View (BEV) representation as the shared feature space to enable effective knowledge distillation. To accommodate the unique cross-modality KD path, we propose four distillation losses to help the student learn crucial features from the teacher model. We present extensive evaluations on the nuScenes dataset to demonstrate the effectiveness of the proposed CRKD framework. The project page for CRKD is https://song-jingyu.github.io/CRKD. ",
    "url": "https://arxiv.org/abs/2403.19104",
    "authors": [
      "Lingjun Zhao",
      "Jingyu Song",
      "Katherine A. Skinner"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.19107",
    "title": "Synthetic Medical Imaging Generation with Generative Adversarial  Networks For Plain Radiographs",
    "abstract": "In medical imaging, access to data is commonly limited due to patient privacy restrictions and the issue that it can be difficult to acquire enough data in the case of rare diseases.[1] The purpose of this investigation was to develop a reusable open-source synthetic image generation pipeline, the GAN Image Synthesis Tool (GIST), that is easy to use as well as easy to deploy. The pipeline helps to improve and standardize AI algorithms in the digital health space by generating high quality synthetic image data that is not linked to specific patients. Its image generation capabilities include the ability to generate imaging of pathologies or injuries with low incidence rates. This improvement of digital health AI algorithms could improve diagnostic accuracy, aid in patient care, decrease medicolegal claims, and ultimately decrease the overall cost of healthcare. The pipeline builds on existing Generative Adversarial Networks (GANs) algorithms, and preprocessing and evaluation steps were included for completeness. For this work, we focused on ensuring the pipeline supports radiography, with a focus on synthetic knee and elbow x-ray images. In designing the pipeline, we evaluated the performance of current GAN architectures, studying the performance on available x-ray data. We show that the pipeline is capable of generating high quality and clinically relevant images based on a lay person's evaluation and the Fr\\'echet Inception Distance (FID) metric. ",
    "url": "https://arxiv.org/abs/2403.19107",
    "authors": [
      "John R. McNulty",
      "Lee Kho",
      "Alexandria L. Case",
      "Charlie Fornaca",
      "Drew Johnston",
      "David Slater",
      "Joshua M. Abzug",
      "Sybil A. Russell"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19109",
    "title": "Enhancing Evolutionary Solver Efficiency for NP Hard Single Machine  Scheduling Problems",
    "abstract": "The study explores the optimization of evolutionary solver parameters for minimizing total tardiness in single machine scheduling, an NP-hard problem with zero ready times included. It investigates various parameter combinations, including population sizes, mutation rates, and a constant convergence rate, both above and below default values. The aim is to enhance the solver's effectiveness in addressing this complex challenge. The findings contribute to improving scheduling efficiency in manufacturing and operations management contexts. ",
    "url": "https://arxiv.org/abs/2403.19109",
    "authors": [
      "Mohammed Alromema",
      "Mohammed A. Makarem"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2403.19111",
    "title": "Patch Spatio-Temporal Relation Prediction for Video Anomaly Detection",
    "abstract": "Video Anomaly Detection (VAD), aiming to identify abnormalities within a specific context and timeframe, is crucial for intelligent Video Surveillance Systems. While recent deep learning-based VAD models have shown promising results by generating high-resolution frames, they often lack competence in preserving detailed spatial and temporal coherence in video frames. To tackle this issue, we propose a self-supervised learning approach for VAD through an inter-patch relationship prediction task. Specifically, we introduce a two-branch vision transformer network designed to capture deep visual features of video frames, addressing spatial and temporal dimensions responsible for modeling appearance and motion patterns, respectively. The inter-patch relationship in each dimension is decoupled into inter-patch similarity and the order information of each patch. To mitigate memory consumption, we convert the order information prediction task into a multi-label learning problem, and the inter-patch similarity prediction task into a distance matrix regression problem. Comprehensive experiments demonstrate the effectiveness of our method, surpassing pixel-generation-based methods by a significant margin across three public benchmarks. Additionally, our approach outperforms other self-supervised learning-based methods. ",
    "url": "https://arxiv.org/abs/2403.19111",
    "authors": [
      "Hao Shen",
      "Lu Shi",
      "Wanru Xu",
      "Yigang Cen",
      "Linna Zhang",
      "Gaoyun An"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19113",
    "title": "FACTOID: FACtual enTailment fOr hallucInation Detection",
    "abstract": "The widespread adoption of Large Language Models (LLMs) has facilitated numerous benefits. However, hallucination is a significant concern. In response, Retrieval Augmented Generation (RAG) has emerged as a highly promising paradigm to improve LLM outputs by grounding them in factual information. RAG relies on textual entailment (TE) or similar methods to check if the text produced by LLMs is supported or contradicted, compared to retrieved documents. This paper argues that conventional TE methods are inadequate for spotting hallucinations in content generated by LLMs. For instance, consider a prompt about the 'USA's stance on the Ukraine war''. The AI-generated text states, ...U.S. President Barack Obama says the U.S. will not put troops in Ukraine...'' However, during the war the U.S. president is Joe Biden which contradicts factual reality. Moreover, current TE systems are unable to accurately annotate the given text and identify the exact portion that is contradicted. To address this, we introduces a new type of TE called ``Factual Entailment (FE).'', aims to detect factual inaccuracies in content generated by LLMs while also highlighting the specific text segment that contradicts reality. We present FACTOID (FACTual enTAILment for hallucInation Detection), a benchmark dataset for FE. We propose a multi-task learning (MTL) framework for FE, incorporating state-of-the-art (SoTA) long text embeddings such as e5-mistral-7b-instruct, along with GPT-3, SpanBERT, and RoFormer. The proposed MTL architecture for FE achieves an avg. 40\\% improvement in accuracy on the FACTOID benchmark compared to SoTA TE methods. As FE automatically detects hallucinations, we assessed 15 modern LLMs and ranked them using our proposed Auto Hallucination Vulnerability Index (HVI_auto). This index quantifies and offers a comparative scale to evaluate and rank LLMs according to their hallucinations. ",
    "url": "https://arxiv.org/abs/2403.19113",
    "authors": [
      "Vipula Rawte",
      "S.M Towhidul Islam Tonmoy",
      "Krishnav Rajbangshi",
      "Shravani Nag",
      "Aman Chadha",
      "Amit P. Sheth",
      "Amitava Das"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.19115",
    "title": "HiRoPE: Length Extrapolation for Code Models",
    "abstract": "Addressing the limitation of context length in large language models for code-related tasks is the primary focus of this paper. Existing LLMs are constrained by their pre-trained context lengths, leading to performance issues in handling long complex code sequences. Inspired by how human programmers navigate code, we introduce Hierarchical Rotary Position Embedding (HiRoPE), a novel approach that enhances the traditional rotary position embedding into a hierarchical format based on the hierarchical structure of source code. HiRoPE offers easy integration into existing LLMs without extra training costs. Our method is extensively evaluated with various LLMs, demonstrating stable performance in tasks such as language modeling and long code completion. We also introduce a new long code understanding task with real-world code projects, in hopes of promoting further development in this code-related field. Theoretically and experimentally, we find that HiRoPE also addresses the out-of-distribution issue in position encoding. Our HiRoPE significantly expands the context length capabilities of LLMs, enabling inference at lengths exponentially greater than the training length. ",
    "url": "https://arxiv.org/abs/2403.19115",
    "authors": [
      "Kechi Zhang",
      "Ge Li",
      "Huangzhao Zhang",
      "Zhi Jin"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.19121",
    "title": "Code Comparison Tuning for Code Large Language Models",
    "abstract": "We present Code Comparison Tuning (CCT), a simple and effective tuning method for code large language models (Code LLMs) to better handle subtle code errors. Specifically, we integrate the concept of comparison into instruction tuning, both at the token and sequence levels, enabling the model to discern even the slightest deviations in code. To compare the original code with an erroneous version containing manually added code errors, we use token-level preference loss for detailed token-level comparisons. Additionally, we combine code segments to create a new instruction tuning sample for sequence-level comparisons, enhancing the model's bug-fixing capability. Experimental results on the HumanEvalFix benchmark show that CCT surpasses instruction tuning in pass@1 scores by up to 4 points across diverse code LLMs, and extensive analysis demonstrates the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2403.19121",
    "authors": [
      "Yufan Jiang",
      "Qiaozhi He",
      "Xiaomin Zhuang",
      "Zhihua Wu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.19124",
    "title": "PoCo: A Self-Supervised Approach via Polar Transformation Based  Progressive Contrastive Learning for Ophthalmic Disease Diagnosis",
    "abstract": "Automatic ophthalmic disease diagnosis on fundus images is important in clinical practice. However, due to complex fundus textures and limited annotated data, developing an effective automatic method for this problem is still challenging. In this paper, we present a self-supervised method via polar transformation based progressive contrastive learning, called PoCo, for ophthalmic disease diagnosis. Specifically, we novelly inject the polar transformation into contrastive learning to 1) promote contrastive learning pre-training to be faster and more stable and 2) naturally capture task-free and rotation-related textures, which provides insights into disease recognition on fundus images. Beneficially, simple normal translation-invariant convolution on transformed images can equivalently replace the complex rotation-invariant and sector convolution on raw images. After that, we develop a progressive contrastive learning method to efficiently utilize large unannotated images and a novel progressive hard negative sampling scheme to gradually reduce the negative sample number for efficient training and performance enhancement. Extensive experiments on three public ophthalmic disease datasets show that our PoCo achieves state-of-the-art performance with good generalization ability, validating that our method can reduce annotation efforts and provide reliable diagnosis. Codes are available at \\url{https://github.com/wjh892521292/PoCo}. ",
    "url": "https://arxiv.org/abs/2403.19124",
    "authors": [
      "Jinhong Wang",
      "Tingting Chen",
      "Jintai Chen",
      "Yixuan Wu",
      "Yuyang Xu",
      "Danny Chen",
      "Haochao Ying",
      "Jian Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19143",
    "title": "Tiny Graph Neural Networks for Radio Resource Management",
    "abstract": "The surge in demand for efficient radio resource management has necessitated the development of sophisticated yet compact neural network architectures. In this paper, we introduce a novel approach to Graph Neural Networks (GNNs) tailored for radio resource management by presenting a new architecture: the Low Rank Message Passing Graph Neural Network (LR-MPGNN). The cornerstone of LR-MPGNN is the implementation of a low-rank approximation technique that substitutes the conventional linear layers with their low-rank counterparts. This innovative design significantly reduces the model size and the number of parameters. We evaluate the performance of the proposed LR-MPGNN model based on several key metrics: model size, number of parameters, weighted sum rate of the communication system, and the distribution of eigenvalues of weight matrices. Our extensive evaluations demonstrate that the LR-MPGNN model achieves a sixtyfold decrease in model size, and the number of model parameters can be reduced by up to 98%. Performance-wise, the LR-MPGNN demonstrates robustness with a marginal 2% reduction in the best-case scenario in the normalized weighted sum rate compared to the original MPGNN model. Additionally, the distribution of eigenvalues of the weight matrices in the LR-MPGNN model is more uniform and spans a wider range, suggesting a strategic redistribution of weights. ",
    "url": "https://arxiv.org/abs/2403.19143",
    "authors": [
      "Ahmad Ghasemi",
      "Hossein Pishro-Nik"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.19147",
    "title": "Resilience-Oriented Operation of Micro-Grids in both Grid-Connected and  Isolated Conditions within Sustainable Active Distribution Networks",
    "abstract": "Due to the increasing occurrence of natural disasters, importance of maintaining sustainable energy for cities and society is felt more than ever. On the other hand, power loss reduction is a challenging issue of active distribution networks (ADNs). In this paper, a new convex optimization model is proposed with two objective functions including energy loss reduction in normal operating mode and system load shedding minimization in critical conditions after the occurrence of natural disasters. This purpose is fulfilled through optimal allocation of distributed generation (DG) units from both conventional and renewable types as well as energy storage systems (ESSs). In addition, a new formulation has been derived to form optimal micro-grids (MGs) aiming at energy loss reduction in normal operating condition and resiliency index improvement under emergency situations. The developed model is implemented in GAMS software and the studies have been tested and analyzed on the IEEE 33-bus system. The results verify the effectiveness of the proposed method in terms of energy loss reduction as well as resilience enhancement in extreme operation condition following severe disruptions in the system. ",
    "url": "https://arxiv.org/abs/2403.19147",
    "authors": [
      "Saeed Behzadi",
      "Amir Bagheri",
      "Abbas Rabiee"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.19148",
    "title": "GenAI Detection Tools, Adversarial Techniques and Implications for  Inclusivity in Higher Education",
    "abstract": "This study investigates the efficacy of six major Generative AI (GenAI) text detectors when confronted with machine-generated content that has been modified using techniques designed to evade detection by these tools (n=805). The results demonstrate that the detectors' already low accuracy rates (39.5%) show major reductions in accuracy (17.4%) when faced with manipulated content, with some techniques proving more effective than others in evading detection. The accuracy limitations and the potential for false accusations demonstrate that these tools cannot currently be recommended for determining whether violations of academic integrity have occurred, underscoring the challenges educators face in maintaining inclusive and fair assessment practices. However, they may have a role in supporting student learning and maintaining academic integrity when used in a non-punitive manner. These results underscore the need for a combined approach to addressing the challenges posed by GenAI in academia to promote the responsible and equitable use of these emerging technologies. The study concludes that the current limitations of AI text detectors require a critical approach for any possible implementation in HE and highlight possible alternatives to AI assessment strategies. ",
    "url": "https://arxiv.org/abs/2403.19148",
    "authors": [
      "Mike Perkins",
      "Jasper Roe",
      "Binh H. Vu",
      "Darius Postma",
      "Don Hickerson",
      "James McGaughran",
      "Huy Q. Khuat"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.19149",
    "title": "Topological Cycle Graph Attention Network for Brain Functional  Connectivity",
    "abstract": "This study, we introduce a novel Topological Cycle Graph Attention Network (CycGAT), designed to delineate a functional backbone within brain functional graph--key pathways essential for signal transmissio--from non-essential, redundant connections that form cycles around this core structure. We first introduce a cycle incidence matrix that establishes an independent cycle basis within a graph, mapping its relationship with edges. We propose a cycle graph convolution that leverages a cycle adjacency matrix, derived from the cycle incidence matrix, to specifically filter edge signals in a domain of cycles. Additionally, we strengthen the representation power of the cycle graph convolution by adding an attention mechanism, which is further augmented by the introduction of edge positional encodings in cycles, to enhance the topological awareness of CycGAT. We demonstrate CycGAT's localization through simulation and its efficacy on an ABCD study's fMRI data (n=8765), comparing it with baseline models. CycGAT outperforms these models, identifying a functional backbone with significantly fewer cycles, crucial for understanding neural circuits related to general intelligence. Our code will be released once accepted. ",
    "url": "https://arxiv.org/abs/2403.19149",
    "authors": [
      "Jinghan Huang",
      "Nanguang Chen",
      "Anqi Qiu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2403.19150",
    "title": "Towards Understanding Dual BN In Hybrid Adversarial Training",
    "abstract": "There is a growing concern about applying batch normalization (BN) in adversarial training (AT), especially when the model is trained on both adversarial samples and clean samples (termed Hybrid-AT). With the assumption that adversarial and clean samples are from two different domains, a common practice in prior works is to adopt Dual BN, where BN and BN are used for adversarial and clean branches, respectively. A popular belief for motivating Dual BN is that estimating normalization statistics of this mixture distribution is challenging and thus disentangling it for normalization achieves stronger robustness. In contrast to this belief, we reveal that disentangling statistics plays a less role than disentangling affine parameters in model training. This finding aligns with prior work (Rebuffi et al., 2023), and we build upon their research for further investigations. We demonstrate that the domain gap between adversarial and clean samples is not very large, which is counter-intuitive considering the significant influence of adversarial perturbation on the model accuracy. We further propose a two-task hypothesis which serves as the empirical foundation and a unified framework for Hybrid-AT improvement. We also investigate Dual BN in test-time and reveal that affine parameters characterize the robustness during inference. Overall, our work sheds new light on understanding the mechanism of Dual BN in Hybrid-AT and its underlying justification. ",
    "url": "https://arxiv.org/abs/2403.19150",
    "authors": [
      "Chenshuang Zhang",
      "Chaoning Zhang",
      "Kang Zhang",
      "Axi Niu",
      "Junmo Kim",
      "In So Kweon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19163",
    "title": "D'OH: Decoder-Only random Hypernetworks for Implicit Neural  Representations",
    "abstract": "Deep implicit functions have been found to be an effective tool for efficiently encoding all manner of natural signals. Their attractiveness stems from their ability to compactly represent signals with little to no off-line training data. Instead, they leverage the implicit bias of deep networks to decouple hidden redundancies within the signal. In this paper, we explore the hypothesis that additional compression can be achieved by leveraging the redundancies that exist between layers. We propose to use a novel run-time decoder-only hypernetwork - that uses no offline training data - to better model this cross-layer parameter redundancy. Previous applications of hyper-networks with deep implicit functions have applied feed-forward encoder/decoder frameworks that rely on large offline datasets that do not generalize beyond the signals they were trained on. We instead present a strategy for the initialization of run-time deep implicit functions for single-instance signals through a Decoder-Only randomly projected Hypernetwork (D'OH). By directly changing the dimension of a latent code to approximate a target implicit neural architecture, we provide a natural way to vary the memory footprint of neural representations without the costly need for neural architecture search on a space of alternative low-rate structures. ",
    "url": "https://arxiv.org/abs/2403.19163",
    "authors": [
      "Cameron Gordon",
      "Lachlan Ewen MacDonald",
      "Hemanth Saratchandran",
      "Simon Lucey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19171",
    "title": "Mining Bug Repositories for Multi-Fault Programs",
    "abstract": "Datasets such as Defects4J and BugsInPy that contain bugs from real-world software projects are necessary for a realistic evaluation of automated debugging tools. However these datasets largely identify only a single bug in each entry, while real-world software projects (including those used in Defects4J and BugsInPy) typically contain multiple bugs at the same time. We lift this limitation and describe an extension to these datasets in which multiple bugs are identified in individual entries. We use test case transplantation and fault location translation, in order to expose and locate the bugs, respectively. We thus provide datasets of true multi-fault versions within real-world software projects, which maintain the properties and usability of the original datasets. ",
    "url": "https://arxiv.org/abs/2403.19171",
    "authors": [
      "Dylan Callaghan",
      "Bernd Fischer"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.19174",
    "title": "Algorithmic Ways of Seeing: Using Object Detection to Facilitate Art  Exploration",
    "abstract": "This Research through Design paper explores how object detection may be applied to a large digital art museum collection to facilitate new ways of encountering and experiencing art. We present the design and evaluation of an interactive application called SMKExplore, which allows users to explore a museum's digital collection of paintings by browsing through objects detected in the images, as a novel form of open-ended exploration. We provide three contributions. First, we show how an object detection pipeline can be integrated into a design process for visual exploration. Second, we present the design and development of an app that enables exploration of an art museum's collection. Third, we offer reflections on future possibilities for museums and HCI researchers to incorporate object detection techniques into the digitalization of museums. ",
    "url": "https://arxiv.org/abs/2403.19174",
    "authors": [
      "Louie Søs Meyer",
      "Johanne Engel Aaen",
      "Anitamalina Regitse Tranberg",
      "Peter Kun",
      "Matthias Freiberger",
      "Sebastian Risi",
      "Anders Sundnes Løvlie"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19178",
    "title": "Enhancing Trust and Privacy in Distributed Networks: A Comprehensive  Survey on Blockchain-based Federated Learning",
    "abstract": "While centralized servers pose a risk of being a single point of failure, decentralized approaches like blockchain offer a compelling solution by implementing a consensus mechanism among multiple entities. Merging distributed computing with cryptographic techniques, decentralized technologies introduce a novel computing paradigm. Blockchain ensures secure, transparent, and tamper-proof data management by validating and recording transactions via consensus across network nodes. Federated Learning (FL), as a distributed machine learning framework, enables participants to collaboratively train models while safeguarding data privacy by avoiding direct raw data exchange. Despite the growing interest in decentralized methods, their application in FL remains underexplored. This paper presents a thorough investigation into Blockchain-based FL (BCFL), spotlighting the synergy between blockchain's security features and FL's privacy-preserving model training capabilities. First, we present the taxonomy of BCFL from three aspects, including decentralized, separate networks, and reputation-based architectures. Then, we summarize the general architecture of BCFL systems, providing a comprehensive perspective on FL architectures informed by blockchain. Afterward, we analyze the application of BCFL in healthcare, IoT, and other privacy-sensitive areas. Finally, we identify future research directions of BCFL. ",
    "url": "https://arxiv.org/abs/2403.19178",
    "authors": [
      "Ji Liu",
      "Chunlu Chen",
      "Yu Li",
      "Lin Sun",
      "Yulun Song",
      "Jingbo Zhou",
      "Bo Jing",
      "Dejing Dou"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19185",
    "title": "Deep CSI Compression for Dual-Polarized Massive MIMO Channels with  Disentangled Representation Learning",
    "abstract": "Channel state information (CSI) feedback is critical for achieving the promised advantages of enhancing spectral and energy efficiencies in massive multiple-input multiple-output (MIMO) wireless communication systems. Deep learning (DL)-based methods have been proven effective in reducing the required signaling overhead for CSI feedback. In practical dual-polarized MIMO scenarios, channels in the vertical and horizontal polarization directions tend to exhibit high polarization correlation. To fully exploit the inherent propagation similarity within dual-polarized channels, we propose a disentangled representation neural network (NN) for CSI feedback, referred to as DiReNet. The proposed DiReNet disentangles dual-polarized CSI into three components: polarization-shared information, vertical polarization-specific information, and horizontal polarization-specific information. This disentanglement of dual-polarized CSI enables the minimization of information redundancy caused by the polarization correlation and improves the performance of CSI compression and recovery. Additionally, flexible quantization and network extension schemes are designed. Consequently, our method provides a pragmatic solution for CSI feedback to harness the physical MIMO polarization as a priori information. Our experimental results show that the performance of our proposed DiReNet surpasses that of existing DL-based networks, while also effectively reducing the number of network parameters by nearly one third. ",
    "url": "https://arxiv.org/abs/2403.19185",
    "authors": [
      "Suhang Fan",
      "Wei Xu",
      "Renjie Xie",
      "Shi Jin",
      "Derrick Wing Kwan Ng",
      "Naofal Al-Dhahir"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.19197",
    "title": "Ordering Collective Unit Tasks: from Scheduling to Computational Social  Choice",
    "abstract": "We study the collective schedules problem, which consists in computing a one machine schedule of a set of tasks, knowing that a set of individuals (also called voters) have preferences regarding the order of the execution of the tasks. Our aim is to return a consensus schedule. We consider the setting in which all tasks have the same length -- such a schedule can therefore also be viewed as a ranking. We study two rules, one based on a distance criterion, and another one based one a binary criterion, and we show that these rules extend classic scheduling criteria. We also consider time constraints and precedence constraints between the tasks, and focus on two cases: the preferences of the voters fulfill these constraints, or they do not fulfill these constraints (but the collective schedule should fulfill them). In each case, either we show that the problem is NP-hard, or we provide a polynomial time algorithm which solves it. We also provide an analysis of a heuristic, which appears to be a 2 approximation of the Spearman's rule. ",
    "url": "https://arxiv.org/abs/2403.19197",
    "authors": [
      "Martin Durand",
      "Fanny Pascual"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2403.19205",
    "title": "From Activation to Initialization: Scaling Insights for Optimizing  Neural Fields",
    "abstract": "In the realm of computer vision, Neural Fields have gained prominence as a contemporary tool harnessing neural networks for signal representation. Despite the remarkable progress in adapting these networks to solve a variety of problems, the field still lacks a comprehensive theoretical framework. This article aims to address this gap by delving into the intricate interplay between initialization and activation, providing a foundational basis for the robust optimization of Neural Fields. Our theoretical insights reveal a deep-seated connection among network initialization, architectural choices, and the optimization process, emphasizing the need for a holistic approach when designing cutting-edge Neural Fields. ",
    "url": "https://arxiv.org/abs/2403.19205",
    "authors": [
      "Hemanth Saratchandran",
      "Sameera Ramasinghe",
      "Simon Lucey"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19218",
    "title": "A piecewise neural network method for solving large interval solution to  initial value problem of ordinary differential equations",
    "abstract": "Various traditional numerical methods for solving initial value problems of differential equations often produce local solutions near the initial value point, despite the problems having larger interval solutions. Even current popular neural network algorithms or deep learning methods cannot guarantee yielding large interval solutions for these problems. In this paper, we propose a piecewise neural network approach to obtain a large interval numerical solution for initial value problems of differential equations. In this method, we first divide the solution interval, on which the initial problem is to be solved, into several smaller intervals. Neural networks with a unified structure are then employed on each sub-interval to solve the related sub-problems. By assembling these neural network solutions, a piecewise expression of the large interval solution to the problem is constructed, referred to as the piecewise neural network solution. The continuous differentiability of the solution over the entire interval, except for finite points, is proven through theoretical analysis and employing a parameter transfer technique. Additionally, a parameter transfer and multiple rounds of pre-training technique are utilized to enhance the accuracy of the approximation solution. Compared with existing neural network algorithms, this method does not increase the network size and training data scale for training the network on each sub-domain. Finally, several numerical experiments are presented to demonstrate the efficiency of the proposed algorithm. ",
    "url": "https://arxiv.org/abs/2403.19218",
    "authors": [
      "Dongpeng Han",
      "Chaolu Temuer"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2403.19219",
    "title": "Collaborative Knowledge Infusion for Low-resource Stance Detection",
    "abstract": "Stance detection is the view towards a specific target by a given context (\\textit{e.g.} tweets, commercial reviews). Target-related knowledge is often needed to assist stance detection models in understanding the target well and making detection correctly. However, prevailing works for knowledge-infused stance detection predominantly incorporate target knowledge from a singular source that lacks knowledge verification in limited domain knowledge. The low-resource training data further increases the challenge for the data-driven large models in this task. To address those challenges, we propose a collaborative knowledge infusion approach for low-resource stance detection tasks, employing a combination of aligned knowledge enhancement and efficient parameter learning techniques. Specifically, our stance detection approach leverages target background knowledge collaboratively from different knowledge sources with the help of knowledge alignment. Additionally, we also introduce the parameter-efficient collaborative adaptor with a staged optimization algorithm, which collaboratively addresses the challenges associated with low-resource stance detection tasks from both network structure and learning perspectives. To assess the effectiveness of our method, we conduct extensive experiments on three public stance detection datasets, including low-resource and cross-target settings. The results demonstrate significant performance improvements compared to the existing stance detection approaches. ",
    "url": "https://arxiv.org/abs/2403.19219",
    "authors": [
      "Ming Yan",
      "Joey Tianyi Zhou",
      "Ivor W. Tsang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.19220",
    "title": "GeoAuxNet: Towards Universal 3D Representation Learning for Multi-sensor  Point Clouds",
    "abstract": "Point clouds captured by different sensors such as RGB-D cameras and LiDAR possess non-negligible domain gaps. Most existing methods design different network architectures and train separately on point clouds from various sensors. Typically, point-based methods achieve outstanding performances on even-distributed dense point clouds from RGB-D cameras, while voxel-based methods are more efficient for large-range sparse LiDAR point clouds. In this paper, we propose geometry-to-voxel auxiliary learning to enable voxel representations to access point-level geometric information, which supports better generalisation of the voxel-based backbone with additional interpretations of multi-sensor point clouds. Specifically, we construct hierarchical geometry pools generated by a voxel-guided dynamic point network, which efficiently provide auxiliary fine-grained geometric information adapted to different stages of voxel features. We conduct experiments on joint multi-sensor datasets to demonstrate the effectiveness of GeoAuxNet. Enjoying elaborate geometric information, our method outperforms other models collectively trained on multi-sensor datasets, and achieve competitive results with the-state-of-art experts on each single dataset. ",
    "url": "https://arxiv.org/abs/2403.19220",
    "authors": [
      "Shengjun Zhang",
      "Xin Fei",
      "Yueqi Duan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19221",
    "title": "Towards Multimodal Video Paragraph Captioning Models Robust to Missing  Modality",
    "abstract": "Video paragraph captioning (VPC) involves generating detailed narratives for long videos, utilizing supportive modalities such as speech and event boundaries. However, the existing models are constrained by the assumption of constant availability of a single auxiliary modality, which is impractical given the diversity and unpredictable nature of real-world scenarios. To this end, we propose a Missing-Resistant framework MR-VPC that effectively harnesses all available auxiliary inputs and maintains resilience even in the absence of certain modalities. Under this framework, we propose the Multimodal VPC (MVPC) architecture integrating video, speech, and event boundary inputs in a unified manner to process various auxiliary inputs. Moreover, to fortify the model against incomplete data, we introduce DropAM, a data augmentation strategy that randomly omits auxiliary inputs, paired with DistillAM, a regularization target that distills knowledge from teacher models trained on modality-complete data, enabling efficient learning in modality-deficient environments. Through exhaustive experimentation on YouCook2 and ActivityNet Captions, MR-VPC has proven to deliver superior performance on modality-complete and modality-missing test data. This work highlights the significance of developing resilient VPC models and paves the way for more adaptive, robust multimodal video understanding. ",
    "url": "https://arxiv.org/abs/2403.19221",
    "authors": [
      "Sishuo Chen",
      "Lei Li",
      "Shuhuai Ren",
      "Rundong Gao",
      "Yuanxin Liu",
      "Xiaohan Bi",
      "Xu Sun",
      "Lu Hou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.19224",
    "title": "Emotion Neural Transducer for Fine-Grained Speech Emotion Recognition",
    "abstract": "The mainstream paradigm of speech emotion recognition (SER) is identifying the single emotion label of the entire utterance. This line of works neglect the emotion dynamics at fine temporal granularity and mostly fail to leverage linguistic information of speech signal explicitly. In this paper, we propose Emotion Neural Transducer for fine-grained speech emotion recognition with automatic speech recognition (ASR) joint training. We first extend typical neural transducer with emotion joint network to construct emotion lattice for fine-grained SER. Then we propose lattice max pooling on the alignment lattice to facilitate distinguishing emotional and non-emotional frames. To adapt fine-grained SER to transducer inference manner, we further make blank, the special symbol of ASR, serve as underlying emotion indicator as well, yielding Factorized Emotion Neural Transducer. For typical utterance-level SER, our ENT models outperform state-of-the-art methods on IEMOCAP in low word error rate. Experiments on IEMOCAP and the latest speech emotion diarization dataset ZED also demonstrate the superiority of fine-grained emotion modeling. Our code is available at https://github.com/ECNU-Cross-Innovation-Lab/ENT. ",
    "url": "https://arxiv.org/abs/2403.19224",
    "authors": [
      "Siyuan Shen",
      "Yu Gao",
      "Feng Liu",
      "Hanyang Wang",
      "Aimin Zhou"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2403.19232",
    "title": "AZ-NAS: Assembling Zero-Cost Proxies for Network Architecture Search",
    "abstract": "Training-free network architecture search (NAS) aims to discover high-performing networks with zero-cost proxies, capturing network characteristics related to the final performance. However, network rankings estimated by previous training-free NAS methods have shown weak correlations with the performance. To address this issue, we propose AZ-NAS, a novel approach that leverages the ensemble of various zero-cost proxies to enhance the correlation between a predicted ranking of networks and the ground truth substantially in terms of the performance. To achieve this, we introduce four novel zero-cost proxies that are complementary to each other, analyzing distinct traits of architectures in the views of expressivity, progressivity, trainability, and complexity. The proxy scores can be obtained simultaneously within a single forward and backward pass, making an overall NAS process highly efficient. In order to integrate the rankings predicted by our proxies effectively, we introduce a non-linear ranking aggregation method that highlights the networks highly-ranked consistently across all the proxies. Experimental results conclusively demonstrate the efficacy and efficiency of AZ-NAS, outperforming state-of-the-art methods on standard benchmarks, all while maintaining a reasonable runtime cost. ",
    "url": "https://arxiv.org/abs/2403.19232",
    "authors": [
      "Junghyup Lee",
      "Bumsub Ham"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19246",
    "title": "MPXGAT: An Attention based Deep Learning Model for Multiplex Graphs  Embedding",
    "abstract": "Graph representation learning has rapidly emerged as a pivotal field of study. Despite its growing popularity, the majority of research has been confined to embedding single-layer graphs, which fall short in representing complex systems with multifaceted relationships. To bridge this gap, we introduce MPXGAT, an innovative attention-based deep learning model tailored to multiplex graph embedding. Leveraging the robustness of Graph Attention Networks (GATs), MPXGAT captures the structure of multiplex networks by harnessing both intra-layer and inter-layer connections. This exploitation facilitates accurate link prediction within and across the network's multiple layers. Our comprehensive experimental evaluation, conducted on various benchmark datasets, confirms that MPXGAT consistently outperforms state-of-the-art competing algorithms. ",
    "url": "https://arxiv.org/abs/2403.19246",
    "authors": [
      "Marco Bongiovanni",
      "Luca Gallo",
      "Roberto Grasso",
      "Alfredo Pulvirenti"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Discrete Mathematics (cs.DM)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.19248",
    "title": "Genos: General In-Network Unsupervised Intrusion Detection by Rule  Extraction",
    "abstract": "Anomaly-based network intrusion detection systems (A-NIDS) use unsupervised models to detect unforeseen attacks. However, existing A-NIDS solutions suffer from low throughput, lack of interpretability, and high maintenance costs. Recent in-network intelligence (INI) exploits programmable switches to offer line-rate deployment of NIDS. Nevertheless, current in-network NIDS are either model-specific or only apply to supervised models. In this paper, we propose Genos, a general in-network framework for unsupervised A-NIDS by rule extraction, which consists of a Model Compiler, a Model Interpreter, and a Model Debugger. Specifically, observing benign data are multimodal and usually located in multiple subspaces in the feature space, we utilize a divide-and-conquer approach for model-agnostic rule extraction. In the Model Compiler, we first propose a tree-based clustering algorithm to partition the feature space into subspaces, then design a decision boundary estimation mechanism to approximate the source model in each subspace. The Model Interpreter interprets predictions by important attributes to aid network operators in understanding the predictions. The Model Debugger conducts incremental updating to rectify errors by only fine-tuning rules on affected subspaces, thus reducing maintenance costs. We implement a prototype using physical hardware, and experiments demonstrate its superior performance of 100 Gbps throughput, great interpretability, and trivial updating overhead. ",
    "url": "https://arxiv.org/abs/2403.19248",
    "authors": [
      "Ruoyu Li",
      "Qing Li",
      "Yu Zhang",
      "Dan Zhao",
      "Xi Xiao",
      "Yong Jiang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.19253",
    "title": "Inferring Latent Temporal Sparse Coordination Graph for Multi-Agent  Reinforcement Learning",
    "abstract": "Effective agent coordination is crucial in cooperative Multi-Agent Reinforcement Learning (MARL). While agent cooperation can be represented by graph structures, prevailing graph learning methods in MARL are limited. They rely solely on one-step observations, neglecting crucial historical experiences, leading to deficient graphs that foster redundant or detrimental information exchanges. Additionally, high computational demands for action-pair calculations in dense graphs impede scalability. To address these challenges, we propose inferring a Latent Temporal Sparse Coordination Graph (LTS-CG) for MARL. The LTS-CG leverages agents' historical observations to calculate an agent-pair probability matrix, where a sparse graph is sampled from and used for knowledge exchange between agents, thereby simultaneously capturing agent dependencies and relation uncertainty. The computational complexity of this procedure is only related to the number of agents. This graph learning process is further augmented by two innovative characteristics: Predict-Future, which enables agents to foresee upcoming observations, and Infer-Present, ensuring a thorough grasp of the environmental context from limited data. These features allow LTS-CG to construct temporal graphs from historical and real-time information, promoting knowledge exchange during policy learning and effective collaboration. Graph learning and agent training occur simultaneously in an end-to-end manner. Our demonstrated results on the StarCraft II benchmark underscore LTS-CG's superior performance. ",
    "url": "https://arxiv.org/abs/2403.19253",
    "authors": [
      "Wei Duan",
      "Jie Lu",
      "Junyu Xuan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2403.19260",
    "title": "NaijaHate: Evaluating Hate Speech Detection on Nigerian Twitter Using  Representative Data",
    "abstract": "To address the global issue of hateful content proliferating in online platforms, hate speech detection (HSD) models are typically developed on datasets collected in the United States, thereby failing to generalize to English dialects from the Majority World. Furthermore, HSD models are often evaluated on curated samples, raising concerns about overestimating model performance in real-world settings. In this work, we introduce NaijaHate, the first dataset annotated for HSD which contains a representative sample of Nigerian tweets. We demonstrate that HSD evaluated on biased datasets traditionally used in the literature largely overestimates real-world performance on representative data. We also propose NaijaXLM-T, a pretrained model tailored to the Nigerian Twitter context, and establish the key role played by domain-adaptive pretraining and finetuning in maximizing HSD performance. Finally, we show that in this context, a human-in-the-loop approach to content moderation where humans review 1% of Nigerian tweets flagged as hateful would enable to moderate 60% of all hateful content. Taken together, these results pave the way towards robust HSD systems and a better protection of social media users from hateful content in low-resource settings. ",
    "url": "https://arxiv.org/abs/2403.19260",
    "authors": [
      "Manuel Tonneau",
      "Pedro Vitor Quinta de Castro",
      "Karim Lasri",
      "Ibrahim Farouq",
      "Lakshminarayanan Subramanian",
      "Victor Orozco-Olvera",
      "Samuel Fraiberger"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.19265",
    "title": "Neural Fields for 3D Tracking of Anatomy and Surgical Instruments in  Monocular Laparoscopic Video Clips",
    "abstract": "Laparoscopic video tracking primarily focuses on two target types: surgical instruments and anatomy. The former could be used for skill assessment, while the latter is necessary for the projection of virtual overlays. Where instrument and anatomy tracking have often been considered two separate problems, in this paper, we propose a method for joint tracking of all structures simultaneously. Based on a single 2D monocular video clip, we train a neural field to represent a continuous spatiotemporal scene, used to create 3D tracks of all surfaces visible in at least one frame. Due to the small size of instruments, they generally cover a small part of the image only, resulting in decreased tracking accuracy. Therefore, we propose enhanced class weighting to improve the instrument tracks. We evaluate tracking on video clips from laparoscopic cholecystectomies, where we find mean tracking accuracies of 92.4% for anatomical structures and 87.4% for instruments. Additionally, we assess the quality of depth maps obtained from the method's scene reconstructions. We show that these pseudo-depths have comparable quality to a state-of-the-art pre-trained depth estimator. On laparoscopic videos in the SCARED dataset, the method predicts depth with an MAE of 2.9 mm and a relative error of 9.2%. These results show the feasibility of using neural fields for monocular 3D reconstruction of laparoscopic scenes. ",
    "url": "https://arxiv.org/abs/2403.19265",
    "authors": [
      "Beerend G.A. Gerats",
      "Jelmer M. Wolterink",
      "Seb P. Mol",
      "Ivo A.M.J. Broeders"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19273",
    "title": "A Machine Learning Approach for Crop Yield and Disease Prediction  Integrating Soil Nutrition and Weather Factors",
    "abstract": "The development of an intelligent agricultural decision-supporting system for crop selection and disease forecasting in Bangladesh is the main objective of this work. The economy of the nation depends heavily on agriculture. However, choosing crops with better production rates and efficiently controlling crop disease are obstacles that farmers have to face. These issues are addressed in this research by utilizing machine learning methods and real-world datasets. The recommended approach uses a variety of datasets on the production of crops, soil conditions, agro-meteorological regions, crop disease, and meteorological factors. These datasets offer insightful information on disease trends, soil nutrition demand of crops, and agricultural production history. By incorporating this knowledge, the model first recommends the list of primarily selected crops based on the soil nutrition of a particular user location. Then the predictions of meteorological variables like temperature, rainfall, and humidity are made using SARIMAX models. These weather predictions are then used to forecast the possibilities of diseases for the primary crops list by utilizing the support vector classifier. Finally, the developed model makes use of the decision tree regression model to forecast crop yield and provides a final crop list along with associated possible disease forecast. Utilizing the outcome of the model, farmers may choose the best productive crops as well as prevent crop diseases and reduce output losses by taking preventive actions. Consequently, planning and decision-making processes are supported and farmers can predict possible crop yields. Overall, by offering a detailed decision support system for crop selection and disease prediction, this work can play a vital role in advancing agricultural practices in Bangladesh. ",
    "url": "https://arxiv.org/abs/2403.19273",
    "authors": [
      "Forkan Uddin Ahmed",
      "Annesha Das",
      "Md Zubair"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.19275",
    "title": "Knowledge Boundary and Persona Dynamic Shape A Better Social Media Agent",
    "abstract": "Constructing personalized and anthropomorphic agents holds significant importance in the simulation of social networks. However, there are still two key problems in existing works: the agent possesses world knowledge that does not belong to its personas, and it cannot eliminate the interference of diverse persona information on current actions, which reduces the personalization and anthropomorphism of the agent. To solve the above problems, we construct the social media agent based on personalized knowledge and dynamic persona information. For personalized knowledge, we add external knowledge sources and match them with the persona information of agents, thereby giving the agent personalized world knowledge. For dynamic persona information, we use current action information to internally retrieve the persona information of the agent, thereby reducing the interference of diverse persona information on the current action. To make the agent suitable for social media, we design five basic modules for it: persona, planning, action, memory and reflection. To provide an interaction and verification environment for the agent, we build a social media simulation sandbox. In the experimental verification, automatic and human evaluations demonstrated the effectiveness of the agent we constructed. ",
    "url": "https://arxiv.org/abs/2403.19275",
    "authors": [
      "Junkai Zhou",
      "Liang Pang",
      "Ya Jing",
      "Jia Gu",
      "Huawei Shen",
      "Xueqi Cheng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.19276",
    "title": "Enhanced Bayesian Personalized Ranking for Robust Hard Negative Sampling  in Recommender Systems",
    "abstract": "In implicit collaborative filtering, hard negative mining techniques are developed to accelerate and enhance the recommendation model learning. However, the inadvertent selection of false negatives remains a major concern in hard negative sampling, as these false negatives can provide incorrect information and mislead the model learning. To date, only a small number of studies have been committed to solve the false negative problem, primarily focusing on designing sophisticated sampling algorithms to filter false negatives. In contrast, this paper shifts its focus to refining the loss function. We find that the original Bayesian Personalized Ranking (BPR), initially designed for uniform negative sampling, is inadequate in adapting to hard sampling scenarios. Hence, we introduce an enhanced Bayesian Personalized Ranking objective, named as Hard-BPR, which is specifically crafted for dynamic hard negative sampling to mitigate the influence of false negatives. This method is simple yet efficient for real-world deployment. Extensive experiments conducted on three real-world datasets demonstrate the effectiveness and robustness of our approach, along with the enhanced ability to distinguish false negatives. ",
    "url": "https://arxiv.org/abs/2403.19276",
    "authors": [
      "Kexin Shi",
      "Jing Zhang",
      "Linjiajie Fang",
      "Wenjia Wang",
      "Bingyi Jing"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2403.19278",
    "title": "CAT: Exploiting Inter-Class Dynamics for Domain Adaptive Object  Detection",
    "abstract": "Domain adaptive object detection aims to adapt detection models to domains where annotated data is unavailable. Existing methods have been proposed to address the domain gap using the semi-supervised student-teacher framework. However, a fundamental issue arises from the class imbalance in the labelled training set, which can result in inaccurate pseudo-labels. The relationship between classes, especially where one class is a majority and the other minority, has a large impact on class bias. We propose Class-Aware Teacher (CAT) to address the class bias issue in the domain adaptation setting. In our work, we approximate the class relationships with our Inter-Class Relation module (ICRm) and exploit it to reduce the bias within the model. In this way, we are able to apply augmentations to highly related classes, both inter- and intra-domain, to boost the performance of minority classes while having minimal impact on majority classes. We further reduce the bias by implementing a class-relation weight to our classification loss. Experiments conducted on various datasets and ablation studies show that our method is able to address the class bias in the domain adaptation setting. On the Cityscapes to Foggy Cityscapes dataset, we attained a 52.5 mAP, a substantial improvement over the 51.2 mAP achieved by the state-of-the-art method. ",
    "url": "https://arxiv.org/abs/2403.19278",
    "authors": [
      "Mikhail Kennerley",
      "Jian-Gang Wang",
      "Bharadwaj Veeravalli",
      "Robby T. Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19286",
    "title": "Adaptive optimization of isogeometric multi-patch discretizations using  artificial neural networks",
    "abstract": "In isogeometric analysis, isogeometric function spaces are employed for accurately representing the solution to a partial differential equation (PDE) on a parameterized domain. They are generated from a tensor-product spline space by composing the basis functions with the inverse of the parameterization. Depending on the geometry of the domain and on the data of the PDE, the solution might not have maximum Sobolev regularity, leading to a reduced convergence rate. In this case it is necessary to reduce the local mesh size close to the singularities. The classical approach is to perform adaptive h-refinement, which either leads to an unnecessarily large number of degrees of freedom or to a spline space that does not possess a tensor-product structure. Based on the concept of r-adaptivity we present a novel approach for finding a suitable isogeometric function space for a given PDE without sacrificing the tensor-product structure of the underlying spline space. In particular, we use the fact that different reparameterizations of the same computational domain lead to different isogeometric function spaces while preserving the geometry. Starting from a multi-patch domain consisting of bilinearly parameterized patches, we aim to find the biquadratic multi-patch parameterization that leads to the isogeometric function space with the smallest best approximation error of the solution. In order to estimate the location of the optimal control points, we employ a trained residual neural network that is applied to the graph surfaces of the approximated solution and its derivatives. In our experimental results, we observe that our new method results in a vast improvement of the approximation error for different PDE problems on multi-patch domains. ",
    "url": "https://arxiv.org/abs/2403.19286",
    "authors": [
      "Dany Rios",
      "Felix Scholz",
      "Thomas Takacs"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2403.19289",
    "title": "Graph Neural Networks for Treatment Effect Prediction",
    "abstract": "Estimating causal effects in e-commerce tends to involve costly treatment assignments which can be impractical in large-scale settings. Leveraging machine learning to predict such treatment effects without actual intervention is a standard practice to diminish the risk. However, existing methods for treatment effect prediction tend to rely on training sets of substantial size, which are built from real experiments and are thus inherently risky to create. In this work we propose a graph neural network to diminish the required training set size, relying on graphs that are common in e-commerce data. Specifically, we view the problem as node regression with a restricted number of labeled instances, develop a two-model neural architecture akin to previous causal effect estimators, and test varying message-passing layers for encoding. Furthermore, as an extra step, we combine the model with an acquisition function to guide the creation of the training set in settings with extremely low experimental budget. The framework is flexible since each step can be used separately with other models or policies. The experiments on real large-scale networks indicate a clear advantage of our methodology over the state of the art, which in many cases performs close to random underlining the need for models that can generalize with limited labeled samples to reduce experimental risks. ",
    "url": "https://arxiv.org/abs/2403.19289",
    "authors": [
      "George Panagopoulos",
      "Daniele Malitesta",
      "Fragkiskos D. Malliaros",
      "Jun Pang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2403.19294",
    "title": "FlowDepth: Decoupling Optical Flow for Self-Supervised Monocular Depth  Estimation",
    "abstract": "Self-supervised multi-frame methods have currently achieved promising results in depth estimation. However, these methods often suffer from mismatch problems due to the moving objects, which break the static assumption. Additionally, unfairness can occur when calculating photometric errors in high-freq or low-texture regions of the images. To address these issues, existing approaches use additional semantic priori black-box networks to separate moving objects and improve the model only at the loss level. Therefore, we propose FlowDepth, where a Dynamic Motion Flow Module (DMFM) decouples the optical flow by a mechanism-based approach and warps the dynamic regions thus solving the mismatch problem. For the unfairness of photometric errors caused by high-freq and low-texture regions, we use Depth-Cue-Aware Blur (DCABlur) and Cost-Volume sparsity loss respectively at the input and the loss level to solve the problem. Experimental results on the KITTI and Cityscapes datasets show that our method outperforms the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2403.19294",
    "authors": [
      "Yiyang Sun",
      "Zhiyuan Xu",
      "Xiaonian Wang",
      "Jing Yao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19319",
    "title": "Mesh2NeRF: Direct Mesh Supervision for Neural Radiance Field  Representation and Generation",
    "abstract": "We present Mesh2NeRF, an approach to derive ground-truth radiance fields from textured meshes for 3D generation tasks. Many 3D generative approaches represent 3D scenes as radiance fields for training. Their ground-truth radiance fields are usually fitted from multi-view renderings from a large-scale synthetic 3D dataset, which often results in artifacts due to occlusions or under-fitting issues. In Mesh2NeRF, we propose an analytic solution to directly obtain ground-truth radiance fields from 3D meshes, characterizing the density field with an occupancy function featuring a defined surface thickness, and determining view-dependent color through a reflection function considering both the mesh and environment lighting. Mesh2NeRF extracts accurate radiance fields which provides direct supervision for training generative NeRFs and single scene representation. We validate the effectiveness of Mesh2NeRF across various tasks, achieving a noteworthy 3.12dB improvement in PSNR for view synthesis in single scene representation on the ABO dataset, a 0.69 PSNR enhancement in the single-view conditional generation of ShapeNet Cars, and notably improved mesh extraction from NeRF in the unconditional generation of Objaverse Mugs. ",
    "url": "https://arxiv.org/abs/2403.19319",
    "authors": [
      "Yujin Chen",
      "Yinyu Nie",
      "Benjamin Ummenhofer",
      "Reiner Birkl",
      "Michael Paulitsch",
      "Matthias Müller",
      "Matthias Nießner"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19326",
    "title": "MedBN: Robust Test-Time Adaptation against Malicious Test Samples",
    "abstract": "Test-time adaptation (TTA) has emerged as a promising solution to address performance decay due to unforeseen distribution shifts between training and test data. While recent TTA methods excel in adapting to test data variations, such adaptability exposes a model to vulnerability against malicious examples, an aspect that has received limited attention. Previous studies have uncovered security vulnerabilities within TTA even when a small proportion of the test batch is maliciously manipulated. In response to the emerging threat, we propose median batch normalization (MedBN), leveraging the robustness of the median for statistics estimation within the batch normalization layer during test-time inference. Our method is algorithm-agnostic, thus allowing seamless integration with existing TTA frameworks. Our experimental results on benchmark datasets, including CIFAR10-C, CIFAR100-C and ImageNet-C, consistently demonstrate that MedBN outperforms existing approaches in maintaining robust performance across different attack scenarios, encompassing both instant and cumulative attacks. Through extensive experiments, we show that our approach sustains the performance even in the absence of attacks, achieving a practical balance between robustness and performance. ",
    "url": "https://arxiv.org/abs/2403.19326",
    "authors": [
      "Hyejin Park",
      "Jeongyeon Hwang",
      "Sunung Mun",
      "Sangdon Park",
      "Jungseul Ok"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19328",
    "title": "Complex generalized Gauss-Radau quadrature rules for Hankel transforms  of integer order",
    "abstract": "Complex Gaussian quadrature rules for oscillatory integral transforms have the advantage that they can achieve optimal asymptotic order. However, their existence for Hankel transform can only be guaranteed when the order of the transform belongs to $[0,1/2]$. In this paper we consider the construction of generalized Gauss-Radau quadrature rules for Hankel transform. We show that, if adding certain value and derivative information at the left endpoint, then complex generalized Gauss-Radau quadrature rules for Hankel transform of integer order can be constructed with theoretical guarantees. Orthogonal polynomials that are closely related to such quadrature rules are investigated and their existence for even degrees is proved. Numerical experiments are presented to confirm our findings. ",
    "url": "https://arxiv.org/abs/2403.19328",
    "authors": [
      "Haiyong Wang",
      "Menghan Wu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Classical Analysis and ODEs (math.CA)"
    ]
  },
  {
    "id": "arXiv:2403.19339",
    "title": "An Interactive Human-Machine Learning Interface for Collecting and  Learning from Complex Annotations",
    "abstract": "Human-Computer Interaction has been shown to lead to improvements in machine learning systems by boosting model performance, accelerating learning and building user confidence. In this work, we aim to alleviate the expectation that human annotators adapt to the constraints imposed by traditional labels by allowing for extra flexibility in the form that supervision information is collected. For this, we propose a human-machine learning interface for binary classification tasks which enables human annotators to utilise counterfactual examples to complement standard binary labels as annotations for a dataset. Finally we discuss the challenges in future extensions of this work. ",
    "url": "https://arxiv.org/abs/2403.19339",
    "authors": [
      "Jonathan Erskine",
      "Matt Clifford",
      "Alexander Hepburn",
      "Raúl Santos-Rodríguez"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2403.19344",
    "title": "Gain-Only Neural Operator Approximators of PDE Backstepping Controllers",
    "abstract": "For the recently introduced deep learning-powered approach to PDE backstepping control, we present an advancement applicable across all the results developed thus far: approximating the control gain function only (a function of one variable), rather than the entire kernel function of the backstepping transformation (a function of two variables). We introduce this idea on a couple benchmark (unstable) PDEs, hyperbolic and parabolic. We alter the approach of quantifying the effect of the approximation error by replacing a backstepping transformation that employs the approximated kernel (suitable for adaptive control) by a transformation that employs the exact kernel (suitable for gain scheduling). A major simplification in the target system arises, with the perturbation due to the approximation shifting from the domain to the boundary condition. This results in a significant difference in the Lyapunov analysis, which nevertheless results in a guarantee of the stability being retained with the simplified approximation approach. The approach of approximating only the control gain function simplifies the operator being approximated and the training of its neural approximation, with an expected reduction in the neural network size. The price for the savings in approximation is paid through a somewhat more intricate Lyapunov analysis, in higher Sobolev spaces for some PDEs, as well as some restrictions on initial conditions that result from higher Sobolev spaces. While the proposed approach appears inapplicable to uses in adaptive control, it is almost certainly applicable in gain scheduling applications of neural operator-approximated PDE backstepping controllers. ",
    "url": "https://arxiv.org/abs/2403.19344",
    "authors": [
      "Rafael Vazquez",
      "Miroslav Krstic"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2403.19347",
    "title": "Breaking the Length Barrier: LLM-Enhanced CTR Prediction in Long Textual  User Behaviors",
    "abstract": "With the rise of large language models (LLMs), recent works have leveraged LLMs to improve the performance of click-through rate (CTR) prediction. However, we argue that a critical obstacle remains in deploying LLMs for practical use: the efficiency of LLMs when processing long textual user behaviors. As user sequences grow longer, the current efficiency of LLMs is inadequate for training on billions of users and items. To break through the efficiency barrier of LLMs, we propose Behavior Aggregated Hierarchical Encoding (BAHE) to enhance the efficiency of LLM-based CTR modeling. Specifically, BAHE proposes a novel hierarchical architecture that decouples the encoding of user behaviors from inter-behavior interactions. Firstly, to prevent computational redundancy from repeated encoding of identical user behaviors, BAHE employs the LLM's pre-trained shallow layers to extract embeddings of the most granular, atomic user behaviors from extensive user sequences and stores them in the offline database. Subsequently, the deeper, trainable layers of the LLM facilitate intricate inter-behavior interactions, thereby generating comprehensive user embeddings. This separation allows the learning of high-level user representations to be independent of low-level behavior encoding, significantly reducing computational complexity. Finally, these refined user embeddings, in conjunction with correspondingly processed item embeddings, are incorporated into the CTR model to compute the CTR scores. Extensive experimental results show that BAHE reduces training time and memory by five times for CTR models using LLMs, especially with longer user sequences. BAHE has been deployed in a real-world system, allowing for daily updates of 50 million CTR data on 8 A100 GPUs, making LLMs practical for industrial CTR prediction. ",
    "url": "https://arxiv.org/abs/2403.19347",
    "authors": [
      "Binzong Geng",
      "Zhaoxin Huan",
      "Xiaolu Zhang",
      "Yong He",
      "Liang Zhang",
      "Fajie Yuan",
      "Jun Zhou",
      "Linjian Mo"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.19353",
    "title": "A Software-Defined Networking Solution for Interconnecting Network  Functions in Service-Based Architectures",
    "abstract": "Mobile core networks handle critical control functions for delivering services in modern cellular networks. Traditional point-to-point architectures, where network functions are directly connected through standardized interfaces, are being substituted by service-based architectures (SBAs), where core functionalities are finer-grained microservices decoupled from the underlying infrastructure. In this way, network functions and services can be distributed, with scaling and fail-over mechanisms, and can be dynamically deployed, updated, or removed to support slicing. A myriad of network functions can be deployed or removed according to traffic flows, thereby increasing the complexity of connection management. In this context, 3GPP Release 16 defines the service communication proxy (SCP) as a unified communication interface for a set of network functions. In this paper, we propose a novel software-defined networking (SDN)-based solution with the same role for a service mesh architecture where network functions can be deployed anywhere in the infrastructure. We demonstrated its efficiency in comparison with alternative architectures. ",
    "url": "https://arxiv.org/abs/2403.19353",
    "authors": [
      "Pablo Fondo-Ferreiro",
      "Felipe Gil-Castiñeira",
      "Francisco Javier González-Castaño",
      "David Candal-Ventureira"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2403.19355",
    "title": "Artificial Intelligence (AI) Based Prediction of Mortality, for COVID-19  Patients",
    "abstract": "For severely affected COVID-19 patients, it is crucial to identify high-risk patients and predict survival and need for intensive care (ICU). Most of the proposed models are not well reported making them less reproducible and prone to high risk of bias particularly in presence of imbalance data/class. In this study, the performances of nine machine and deep learning algorithms in combination with two widely used feature selection methods were investigated to predict last status representing mortality, ICU requirement, and ventilation days. Fivefold cross-validation was used for training and validation purposes. To minimize bias, the training and testing sets were split maintaining similar distributions. Only 10 out of 122 features were found to be useful in prediction modelling with Acute kidney injury during hospitalization feature being the most important one. The algorithms performances depend on feature numbers and data pre-processing techniques. LSTM performs the best in predicting last status and ICU requirement with 90%, 92%, 86% and 95% accuracy, sensitivity, specificity, and AUC respectively. DNN performs the best in predicting Ventilation days with 88% accuracy. Considering all the factors and limitations including absence of exact time point of clinical onset, LSTM with carefully selected features can accurately predict last status and ICU requirement. DNN performs the best in predicting Ventilation days. Appropriate machine learning algorithm with carefully selected features and balance data can accurately predict mortality, ICU requirement and ventilation support. Such model can be very useful in emergency and pandemic where prompt and precise ",
    "url": "https://arxiv.org/abs/2403.19355",
    "authors": [
      "Mahbubunnabi Tamala",
      "Mohammad Marufur Rahmanb",
      "Maryam Alhasimc",
      "Mobarak Al Mulhimd",
      "Mohamed Derichee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19356",
    "title": "A robust two-level overlapping preconditioner for Darcy flow in  high-contrast media",
    "abstract": "In this article, a two-level overlapping domain decomposition preconditioner is developed for solving linear algebraic systems obtained from simulating Darcy flow in high-contrast media. Our preconditioner starts at a mixed finite element method for discretizing the partial differential equation by Darcy's law with the no-flux boundary condition and is then followed by a velocity elimination technique to yield a linear algebraic system with only unknowns of pressure. Then, our main objective is to design a robust and efficient domain decomposition preconditioner for this system, which is accomplished by engineering a multiscale coarse space that is capable of characterizing high-contrast features of the permeability field. A generalized eigenvalue problem is solved in each non-overlapping coarse element in a communication-free manner to form the global solver, which is accompanied by local solvers originated from additive Schwarz methods but with a non-Galerkin discretization to derive the two-level preconditioner. We provide a rigorous analysis that indicates that the condition number of the preconditioned system could be bounded above with several assumptions. Extensive numerical experiments with various types of three-dimensional high-contrast models are exhibited. In particular, we study the robustness against the contrast of the media as well as the influences of numbers of eigenfunctions, oversampling sizes, and subdomain partitions on the efficiency of the proposed preconditioner. Besides, strong and weak scalability performances are also examined. ",
    "url": "https://arxiv.org/abs/2403.19356",
    "authors": [
      "Changqing Ye",
      "Shubin Fu",
      "Eric T. Chung",
      "Jizu Huang"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2403.19358",
    "title": "Risk prediction of pathological gambling on social media",
    "abstract": "This paper addresses the problem of risk prediction on social media data, specifically focusing on the classification of Reddit users as having a pathological gambling disorder. To tackle this problem, this paper focuses on incorporating temporal and emotional features into the model. The preprocessing phase involves dealing with the time irregularity of posts by padding sequences. Two baseline architectures are used for preliminary evaluation: BERT classifier on concatenated posts per user and GRU with LSTM on sequential data. Experimental results demonstrate that the sequential models outperform the concatenation-based model. The results of the experiments conclude that the incorporation of a time decay layer (TD) and passing the emotion classification layer (EmoBERTa) through LSTM improves the performance significantly. Experiments concluded that the addition of a self-attention layer didn't significantly improve the performance of the model, however provided easily interpretable attention scores. The developed architecture with the inclusion of EmoBERTa and TD layers achieved a high F1 score, beating existing benchmarks on pathological gambling dataset. Future work may involve the early prediction of risk factors associated with pathological gambling disorder and testing models on other datasets. Overall, this research highlights the significance of the sequential processing of posts including temporal and emotional features to boost the predictive power, as well as adding an attention layer for interpretability. ",
    "url": "https://arxiv.org/abs/2403.19358",
    "authors": [
      "Angelina Parfenova",
      "Marianne Clausel"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.19366",
    "title": "Infrared Small Target Detection with Scale and Location Sensitivity",
    "abstract": "Recently, infrared small target detection (IRSTD) has been dominated by deep-learning-based methods. However, these methods mainly focus on the design of complex model structures to extract discriminative features, leaving the loss functions for IRSTD under-explored. For example, the widely used Intersection over Union (IoU) and Dice losses lack sensitivity to the scales and locations of targets, limiting the detection performance of detectors. In this paper, we focus on boosting detection performance with a more effective loss but a simpler model structure. Specifically, we first propose a novel Scale and Location Sensitive (SLS) loss to handle the limitations of existing losses: 1) for scale sensitivity, we compute a weight for the IoU loss based on target scales to help the detector distinguish targets with different scales: 2) for location sensitivity, we introduce a penalty term based on the center points of targets to help the detector localize targets more precisely. Then, we design a simple Multi-Scale Head to the plain U-Net (MSHNet). By applying SLS loss to each scale of the predictions, our MSHNet outperforms existing state-of-the-art methods by a large margin. In addition, the detection performance of existing detectors can be further improved when trained with our SLS loss, demonstrating the effectiveness and generalization of our SLS loss. The code is available at https://github.com/ying-fu/MSHNet. ",
    "url": "https://arxiv.org/abs/2403.19366",
    "authors": [
      "Qiankun Liu",
      "Rui Liu",
      "Bolun Zheng",
      "Hongkui Wang",
      "Ying Fu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19374",
    "title": "A noise-tolerant, resource-saving probabilistic binary neural network  implemented by the SOT-MRAM compute-in-memory system",
    "abstract": "We report a spin-orbit torque(SOT) magnetoresistive random-access memory(MRAM)-based probabilistic binary neural network(PBNN) for resource-saving and hardware noise-tolerant computing applications. With the presence of thermal fluctuation, the non-destructive SOT-driven magnetization switching characteristics lead to a random weight matrix with controllable probability distribution. In the meanwhile, the proposed CIM architecture allows for the concurrent execution of the probabilistic vector-matrix multiplication (PVMM) and binarization. Furthermore, leveraging the effectiveness of random binary cells to propagate multi-bit probabilistic information, our SOT-MRAM-based PBNN system achieves a 97.78\\% classification accuracy under a 7.01\\% weight variation on the MNIST database through 10 sampling cycles, and the number of bit-level computation operations is reduced by a factor of 6.9 compared to that of the full-precision LeNet-5 network. Our work provides a compelling framework for the design of reliable neural networks tailored to the applications with low power consumption and limited computational resources. ",
    "url": "https://arxiv.org/abs/2403.19374",
    "authors": [
      "Yu Gu",
      "Puyang Huang",
      "Tianhao Chen",
      "Chenyi Fu",
      "Aitian Chen",
      "Shouzhong Peng",
      "Xixiang Zhang",
      "Xufeng Kou"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.19412",
    "title": "A Simple and Effective Point-based Network for Event Camera 6-DOFs Pose  Relocalization",
    "abstract": "Event cameras exhibit remarkable attributes such as high dynamic range, asynchronicity, and low latency, making them highly suitable for vision tasks that involve high-speed motion in challenging lighting conditions. These cameras implicitly capture movement and depth information in events, making them appealing sensors for Camera Pose Relocalization (CPR) tasks. Nevertheless, existing CPR networks based on events neglect the pivotal fine-grained temporal information in events, resulting in unsatisfactory performance. Moreover, the energy-efficient features are further compromised by the use of excessively complex models, hindering efficient deployment on edge devices. In this paper, we introduce PEPNet, a simple and effective point-based network designed to regress six degrees of freedom (6-DOFs) event camera poses. We rethink the relationship between the event camera and CPR tasks, leveraging the raw Point Cloud directly as network input to harness the high-temporal resolution and inherent sparsity of events. PEPNet is adept at abstracting the spatial and implicit temporal features through hierarchical structure and explicit temporal features by Attentive Bi-directional Long Short-Term Memory (A-Bi-LSTM). By employing a carefully crafted lightweight design, PEPNet delivers state-of-the-art (SOTA) performance on both indoor and outdoor datasets with meager computational resources. Specifically, PEPNet attains a significant 38% and 33% performance improvement on the random split IJRR and M3ED datasets, respectively. Moreover, the lightweight design version PEPNet$_{tiny}$ accomplishes results comparable to the SOTA while employing a mere 0.5% of the parameters. ",
    "url": "https://arxiv.org/abs/2403.19412",
    "authors": [
      "Hongwei Ren",
      "Jiadong Zhu",
      "Yue Zhou",
      "Haotian FU",
      "Yulong Huang",
      "Bojun Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19417",
    "title": "OAKINK2: A Dataset of Bimanual Hands-Object Manipulation in Complex Task  Completion",
    "abstract": "We present OAKINK2, a dataset of bimanual object manipulation tasks for complex daily activities. In pursuit of constructing the complex tasks into a structured representation, OAKINK2 introduces three level of abstraction to organize the manipulation tasks: Affordance, Primitive Task, and Complex Task. OAKINK2 features on an object-centric perspective for decoding the complex tasks, treating them as a sequence of object affordance fulfillment. The first level, Affordance, outlines the functionalities that objects in the scene can afford, the second level, Primitive Task, describes the minimal interaction units that humans interact with the object to achieve its affordance, and the third level, Complex Task, illustrates how Primitive Tasks are composed and interdependent. OAKINK2 dataset provides multi-view image streams and precise pose annotations for the human body, hands and various interacting objects. This extensive collection supports applications such as interaction reconstruction and motion synthesis. Based on the 3-level abstraction of OAKINK2, we explore a task-oriented framework for Complex Task Completion (CTC). CTC aims to generate a sequence of bimanual manipulation to achieve task objectives. Within the CTC framework, we employ Large Language Models (LLMs) to decompose the complex task objectives into sequences of Primitive Tasks and have developed a Motion Fulfillment Model that generates bimanual hand motion for each Primitive Task. OAKINK2 datasets and models are available at https://oakink.net/v2. ",
    "url": "https://arxiv.org/abs/2403.19417",
    "authors": [
      "Xinyu Zhan",
      "Lixin Yang",
      "Yifei Zhao",
      "Kangrui Mao",
      "Hanlin Xu",
      "Zenan Lin",
      "Kailin Li",
      "Cewu Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19419",
    "title": "Fairness in Ranking: Robustness through Randomization without the  Protected Attribute",
    "abstract": "There has been great interest in fairness in machine learning, especially in relation to classification problems. In ranking-related problems, such as in online advertising, recommender systems, and HR automation, much work on fairness remains to be done. Two complications arise: first, the protected attribute may not be available in many applications. Second, there are multiple measures of fairness of rankings, and optimization-based methods utilizing a single measure of fairness of rankings may produce rankings that are unfair with respect to other measures. In this work, we propose a randomized method for post-processing rankings, which do not require the availability of the protected attribute. In an extensive numerical study, we show the robustness of our methods with respect to P-Fairness and effectiveness with respect to Normalized Discounted Cumulative Gain (NDCG) from the baseline ranking, improving on previously proposed methods. ",
    "url": "https://arxiv.org/abs/2403.19419",
    "authors": [
      "Andrii Kliachkin",
      "Eleni Psaroudaki",
      "Jakub Marecek",
      "Dimitris Fotakis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2403.19432",
    "title": "Uncovering Misattributed Suicide Causes through Annotation Inconsistency  Detection in Death Investigation Notes",
    "abstract": "Data accuracy is essential for scientific research and policy development. The National Violent Death Reporting System (NVDRS) data is widely used for discovering the patterns and causes of death. Recent studies suggested the annotation inconsistencies within the NVDRS and the potential impact on erroneous suicide-cause attributions. We present an empirical Natural Language Processing (NLP) approach to detect annotation inconsistencies and adopt a cross-validation-like paradigm to identify problematic instances. We analyzed 267,804 suicide death incidents between 2003 and 2020 from the NVDRS. Our results showed that incorporating the target state's data into training the suicide-crisis classifier brought an increase of 5.4% to the F-1 score on the target state's test set and a decrease of 1.1% on other states' test set. To conclude, we demonstrated the annotation inconsistencies in NVDRS's death investigation notes, identified problematic instances, evaluated the effectiveness of correcting problematic instances, and eventually proposed an NLP improvement solution. ",
    "url": "https://arxiv.org/abs/2403.19432",
    "authors": [
      "Song Wang",
      "Yiliang Zhou",
      "Ziqiang Han",
      "Cui Tao",
      "Yunyu Xiao",
      "Ying Ding",
      "Joydeep Ghosh",
      "Yifan Peng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.19433",
    "title": "Puzzle game: Prediction and Classification of Wordle Solution Words",
    "abstract": "With the popularity of the Wordle game launched by the New York Times, more and more players are getting involved in this challenging game. Submitting the correct answer not only requires your luck, but is also influenced by various attributes of the word. For question 1, we preprocessed the original data by removing and replacing the abnormal data firstly. Then, we established an ARIMA-based prediction model for the number of reported results, with the parameters p=0, d=1, q=1 of the model determined. And it gave [20337, 21673] as the prediction interval for the number of reported results on March 1, 2023. Then we selected the frequency of word usage (FREQ), the information entropy of the word (WIE) and the number of repeated letters contained in the word (NRE) as attributes of the word and we made correlation analysis between these three attributes and seven percentages of tries. The results showed that FREQ was positively correlated with the number of tries, while WIE and NRE were negatively correlated with the number of tries. For problem 2, we established a regression model based on XGBoost algorithm for predicting the distribution of the reported results, and the three attributes selected for problem 1 were used to establish seven regression models for seven different tries, named XGB1 - XGB7. Since the percentage of 1 try was small and XGB1's prediction effect was poor, so we use the mean value of 1 try data - 0.5 as the prediction value of XGB1, and XGB2 - XGB7 model predicted 85.67%, 83.23%, 80.34%, 78.77%, 79.89%, and 84.63% respectively, with an overall accuracy of 82.1%. The associated percentages of (1, 2, 3, 4, 5, 6, X) of \"EERIE\" was predicted to be 0.5, 2.3, 13.8, 21.7, 29.4, 22.3 and 10. Due to length limitations, we will not continue to display more content. ",
    "url": "https://arxiv.org/abs/2403.19433",
    "authors": [
      "Haidong Xin",
      "Fang Wu",
      "Zhitong Zhou",
      "Dongping Liu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2403.19441",
    "title": "A Novel Stochastic Transformer-based Approach for Post-Traumatic Stress  Disorder Detection using Audio Recording of Clinical Interviews",
    "abstract": "Post-traumatic stress disorder (PTSD) is a mental disorder that can be developed after witnessing or experiencing extremely traumatic events. PTSD can affect anyone, regardless of ethnicity, or culture. An estimated one in every eleven people will experience PTSD during their lifetime. The Clinician-Administered PTSD Scale (CAPS) and the PTSD Check List for Civilians (PCL-C) interviews are gold standards in the diagnosis of PTSD. These questionnaires can be fooled by the subject's responses. This work proposes a deep learning-based approach that achieves state-of-the-art performances for PTSD detection using audio recordings during clinical interviews. Our approach is based on MFCC low-level features extracted from audio recordings of clinical interviews, followed by deep high-level learning using a Stochastic Transformer. Our proposed approach achieves state-of-the-art performances with an RMSE of 2.92 on the eDAIC dataset thanks to the stochastic depth, stochastic deep learning layers, and stochastic activation function. ",
    "url": "https://arxiv.org/abs/2403.19441",
    "authors": [
      "Mamadou Dia",
      "Ghazaleh Khodabandelou",
      "Alice Othmani"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2403.19442",
    "title": "Exploiting Individual Graph Structures to Enhance Ecological Momentary  Assessment (EMA) Forecasting",
    "abstract": "In the evolving field of psychopathology, the accurate assessment and forecasting of data derived from Ecological Momentary Assessment (EMA) is crucial. EMA offers contextually-rich psychopathological measurements over time, that practically lead to Multivariate Time Series (MTS) data. Thus, many challenges arise in analysis from the temporal complexities inherent in emotional, behavioral, and contextual EMA data as well as their inter-dependencies. To address both of these aspects, this research investigates the performance of Recurrent and Temporal Graph Neural Networks (GNNs). Overall, GNNs, by incorporating additional information from graphs reflecting the inner relationships between the variables, notably enhance the results by decreasing the Mean Squared Error (MSE) to 0.84 compared to the baseline LSTM model at 1.02. Therefore, the effect of constructing graphs with different characteristics on GNN performance is also explored. Additionally, GNN-learned graphs, which are dynamically refined during the training process, were evaluated. Using such graphs showed a similarly good performance. Thus, graph learning proved also promising for other GNN methods, potentially refining the pre-defined graphs. ",
    "url": "https://arxiv.org/abs/2403.19442",
    "authors": [
      "Mandani Ntekouli",
      "Gerasimos Spanakis",
      "Lourens Waldorp",
      "Anne Roefs"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19444",
    "title": "Transparent and Clinically Interpretable AI for Lung Cancer Detection in  Chest X-Rays",
    "abstract": "The rapidly advancing field of Explainable Artificial Intelligence (XAI) aims to tackle the issue of trust regarding the use of complex black-box deep learning models in real-world applications. Existing post-hoc XAI techniques have recently been shown to have poor performance on medical data, producing unreliable explanations which are infeasible for clinical use. To address this, we propose an ante-hoc approach based on concept bottleneck models which introduces for the first time clinical concepts into the classification pipeline, allowing the user valuable insight into the decision-making process. On a large public dataset of chest X-rays and associated medical reports, we focus on the binary classification task of lung cancer detection. Our approach yields improved classification performance in lung cancer detection when compared to baseline deep learning models (F1 > 0.9), while also generating clinically relevant and more reliable explanations than existing techniques. We evaluate our approach against post-hoc image XAI techniques LIME and SHAP, as well as CXR-LLaVA, a recent textual XAI tool which operates in the context of question answering on chest X-rays. ",
    "url": "https://arxiv.org/abs/2403.19444",
    "authors": [
      "Amy Rafferty",
      "Rishi Ramaesh",
      "Ajitha Rajan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19473",
    "title": "Benchmarking Implicit Neural Representation and Geometric Rendering in  Real-Time RGB-D SLAM",
    "abstract": "Implicit neural representation (INR), in combination with geometric rendering, has recently been employed in real-time dense RGB-D SLAM. Despite active research endeavors being made, there lacks a unified protocol for fair evaluation, impeding the evolution of this area. In this work, we establish, to our knowledge, the first open-source benchmark framework to evaluate the performance of a wide spectrum of commonly used INRs and rendering functions for mapping and localization. The goal of our benchmark is to 1) gain an intuition of how different INRs and rendering functions impact mapping and localization and 2) establish a unified evaluation protocol w.r.t. the design choices that may impact the mapping and localization. With the framework, we conduct a large suite of experiments, offering various insights in choosing the INRs and geometric rendering functions: for example, the dense feature grid outperforms other INRs (e.g. tri-plane and hash grid), even when geometric and color features are jointly encoded for memory efficiency. To extend the findings into the practical scenario, a hybrid encoding strategy is proposed to bring the best of the accuracy and completion from the grid-based and decomposition-based INRs. We further propose explicit hybrid encoding for high-fidelity dense grid mapping to comply with the RGB-D SLAM system that puts the premise on robustness and computation efficiency. ",
    "url": "https://arxiv.org/abs/2403.19473",
    "authors": [
      "Tongyan Hua",
      "Lin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19474",
    "title": "SG-PGM: Partial Graph Matching Network with Semantic Geometric Fusion  for 3D Scene Graph Alignment and Its Downstream Tasks",
    "abstract": "Scene graphs have been recently introduced into 3D spatial understanding as a comprehensive representation of the scene. The alignment between 3D scene graphs is the first step of many downstream tasks such as scene graph aided point cloud registration, mosaicking, overlap checking, and robot navigation. In this work, we treat 3D scene graph alignment as a partial graph-matching problem and propose to solve it with a graph neural network. We reuse the geometric features learned by a point cloud registration method and associate the clustered point-level geometric features with the node-level semantic feature via our designed feature fusion module. Partial matching is enabled by using a learnable method to select the top-k similar node pairs. Subsequent downstream tasks such as point cloud registration are achieved by running a pre-trained registration network within the matched regions. We further propose a point-matching rescoring method, that uses the node-wise alignment of the 3D scene graph to reweight the matching candidates from a pre-trained point cloud registration method. It reduces the false point correspondences estimated especially in low-overlapping cases. Experiments show that our method improves the alignment accuracy by 10~20% in low-overlap and random transformation scenarios and outperforms the existing work in multiple downstream tasks. ",
    "url": "https://arxiv.org/abs/2403.19474",
    "authors": [
      "Yaxu Xie",
      "Alain Pagani",
      "Didier Stricker"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.19489",
    "title": "Evolving Assembly Code in an Adversarial Environment",
    "abstract": "In this work, we evolve assembly code for the CodeGuru competition. The competition's goal is to create a survivor -- an assembly program that runs the longest in shared memory, by resisting attacks from adversary survivors and finding their weaknesses. For evolving top-notch solvers, we specify a Backus Normal Form (BNF) for the assembly language and synthesize the code from scratch using Genetic Programming (GP). We evaluate the survivors by running CodeGuru games against human-written winning survivors. Our evolved programs found weaknesses in the programs they were trained against and utilized them. In addition, we compare our approach with a Large-Language Model, demonstrating that the latter cannot generate a survivor that can win at any competition. This work has important applications for cyber-security, as we utilize evolution to detect weaknesses in survivors. The assembly BNF is domain-independent; thus, by modifying the fitness function, it can detect code weaknesses and help fix them. Finally, the CodeGuru competition offers a novel platform for analyzing GP and code evolution in adversarial environments. To support further research in this direction, we provide a thorough qualitative analysis of the evolved survivors and the weaknesses found. ",
    "url": "https://arxiv.org/abs/2403.19489",
    "authors": [
      "Irina Maliukov",
      "Gera Weiss",
      "Oded Margalit",
      "Achiya Elyasaf"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2403.19510",
    "title": "On the Robustness of LDP Protocols for Numerical Attributes under Data  Poisoning Attacks",
    "abstract": "Recent studies reveal that local differential privacy (LDP) protocols are vulnerable to data poisoning attacks where an attacker can manipulate the final estimate on the server by leveraging the characteristics of LDP and sending carefully crafted data from a small fraction of controlled local clients. This vulnerability raises concerns regarding the robustness and reliability of LDP in hostile environments. In this paper, we conduct a systematic investigation of the robustness of state-of-the-art LDP protocols for numerical attributes, i.e., categorical frequency oracles (CFOs) with binning and consistency, and distribution reconstruction. We evaluate protocol robustness through an attack-driven approach and propose new metrics for cross-protocol attack gain measurement. The results indicate that Square Wave and CFO-based protocols in the Server setting are more robust against the attack compared to the CFO-based protocols in the User setting. Our evaluation also unfolds new relationships between LDP security and its inherent design choices. We found that the hash domain size in local-hashing-based LDP has a profound impact on protocol robustness beyond the well-known effect on utility. Further, we propose a zero-shot attack detection by leveraging the rich reconstructed distribution information. The experiment show that our detection significantly improves the existing methods and effectively identifies data manipulation in challenging scenarios. ",
    "url": "https://arxiv.org/abs/2403.19510",
    "authors": [
      "Xiaoguang Li",
      "Zitao Li",
      "Ninghui Li",
      "Wenhai Sun"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.19514",
    "title": "CDIMC-net: Cognitive Deep Incomplete Multi-view Clustering Network",
    "abstract": "In recent years, incomplete multi-view clustering, which studies the challenging multi-view clustering problem on missing views, has received growing research interests. Although a series of methods have been proposed to address this issue, the following problems still exist: 1) Almost all of the existing methods are based on shallow models, which is difficult to obtain discriminative common representations. 2) These methods are generally sensitive to noise or outliers since the negative samples are treated equally as the important samples. In this paper, we propose a novel incomplete multi-view clustering network, called Cognitive Deep Incomplete Multi-view Clustering Network (CDIMC-net), to address these issues. Specifically, it captures the high-level features and local structure of each view by incorporating the view-specific deep encoders and graph embedding strategy into a framework. Moreover, based on the human cognition, i.e., learning from easy to hard, it introduces a self-paced strategy to select the most confident samples for model training, which can reduce the negative influence of outliers. Experimental results on several incomplete datasets show that CDIMC-net outperforms the state-of-the-art incomplete multi-view clustering methods. ",
    "url": "https://arxiv.org/abs/2403.19514",
    "authors": [
      "Jie Wen",
      "Zheng Zhang",
      "Yong Xu",
      "Bob Zhang",
      "Lunke Fei",
      "Guo-Sen Xie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19531",
    "title": "SecGraph: Towards SGX-based Efficient and Confidentiality-Preserving  Graph Search",
    "abstract": "Graphs have more expressive power and are widely researched in various search demand scenarios, compared with traditional relational and XML models. Today, many graph search services have been deployed on a third-party server, which can alleviate users from the burdens of maintaining large-scale graphs and huge computation costs. Nevertheless, outsourcing graph search services to the third-party server may invade users' privacy. PeGraph was recently proposed to achieve the encrypted search over the social graph. The main idea of PeGraph is to maintain two data structures XSet and TSet motivated by the OXT technology to support encrypted conductive search. However, PeGraph still has some limitations. First, PeGraph suffers from high communication and computation costs in search operations. Second, PeGraph cannot support encrypted search over dynamic graphs. In this paper, we propose an SGX-based efficient and confidentiality-preserving graph search scheme SecGraph that can support insertion and deletion operations. We first design a new proxy-token generation method to reduce the communication cost. Then, we design an LDCF-encoded XSet based on the Logarithmic Dynamic Cuckoo Filter to reduce the computation cost. Finally, we design a new dynamic version of TSet named Twin-TSet to enable encrypted search over dynamic graphs. We have demonstrated the confidentiality preservation property of SecGraph through rigorous security analysis. Experiment results show that SecGraph yields up to 208x improvement in search time compared with PeGraph and the communication cost in PeGraph is up to 540x larger than that in SecGraph. ",
    "url": "https://arxiv.org/abs/2403.19531",
    "authors": [
      "Qiuhao Wang",
      "Xu Yang",
      "Saiyu Qi",
      "Yong Qi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Databases (cs.DB)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.19559",
    "title": "Improving Adversarial Data Collection by Supporting Annotators: Lessons  from GAHD, a German Hate Speech Dataset",
    "abstract": "Hate speech detection models are only as good as the data they are trained on. Datasets sourced from social media suffer from systematic gaps and biases, leading to unreliable models with simplistic decision boundaries. Adversarial datasets, collected by exploiting model weaknesses, promise to fix this problem. However, adversarial data collection can be slow and costly, and individual annotators have limited creativity. In this paper, we introduce GAHD, a new German Adversarial Hate speech Dataset comprising ca.\\ 11k examples. During data collection, we explore new strategies for supporting annotators, to create more diverse adversarial examples more efficiently and provide a manual analysis of annotator disagreements for each strategy. Our experiments show that the resulting dataset is challenging even for state-of-the-art hate speech detection models, and that training on GAHD clearly improves model robustness. Further, we find that mixing multiple support strategies is most advantageous. We make GAHD publicly available at https://github.com/jagol/gahd. ",
    "url": "https://arxiv.org/abs/2403.19559",
    "authors": [
      "Janis Goldzycher",
      "Paul Röttger",
      "Gerold Schneider"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.19561",
    "title": "Self-Improved Learning for Scalable Neural Combinatorial Optimization",
    "abstract": "The end-to-end neural combinatorial optimization (NCO) method shows promising performance in solving complex combinatorial optimization problems without the need for expert design. However, existing methods struggle with large-scale problems, hindering their practical applicability. To overcome this limitation, this work proposes a novel Self-Improved Learning (SIL) method for better scalability of neural combinatorial optimization. Specifically, we develop an efficient self-improved mechanism that enables direct model training on large-scale problem instances without any labeled data. Powered by an innovative local reconstruction approach, this method can iteratively generate better solutions by itself as pseudo-labels to guide efficient model training. In addition, we design a linear complexity attention mechanism for the model to efficiently handle large-scale combinatorial problem instances with low computation overhead. Comprehensive experiments on the Travelling Salesman Problem (TSP) and the Capacitated Vehicle Routing Problem (CVRP) with up to 100K nodes in both uniform and real-world distributions demonstrate the superior scalability of our method. ",
    "url": "https://arxiv.org/abs/2403.19561",
    "authors": [
      "Fu Luo",
      "Xi Lin",
      "Zhenkun Wang",
      "Tong Xialiang",
      "Mingxuan Yuan",
      "Qingfu Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.19570",
    "title": "GrINd: Grid Interpolation Network for Scattered Observations",
    "abstract": "Predicting the evolution of spatiotemporal physical systems from sparse and scattered observational data poses a significant challenge in various scientific domains. Traditional methods rely on dense grid-structured data, limiting their applicability in scenarios with sparse observations. To address this challenge, we introduce GrINd (Grid Interpolation Network for Scattered Observations), a novel network architecture that leverages the high-performance of grid-based models by mapping scattered observations onto a high-resolution grid using a Fourier Interpolation Layer. In the high-resolution space, a NeuralPDE-class model predicts the system's state at future timepoints using differentiable ODE solvers and fully convolutional neural networks parametrizing the system's dynamics. We empirically evaluate GrINd on the DynaBench benchmark dataset, comprising six different physical systems observed at scattered locations, demonstrating its state-of-the-art performance compared to existing models. GrINd offers a promising approach for forecasting physical systems from sparse, scattered observational data, extending the applicability of deep learning methods to real-world scenarios with limited data availability. ",
    "url": "https://arxiv.org/abs/2403.19570",
    "authors": [
      "Andrzej Dulny",
      "Paul Heinisch",
      "Andreas Hotho",
      "Anna Krause"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19572",
    "title": "Swarm Characteristics Classification Using Neural Networks",
    "abstract": "Understanding the characteristics of swarming autonomous agents is critical for defense and security applications. This article presents a study on using supervised neural network time series classification (NN TSC) to predict key attributes and tactics of swarming autonomous agents for military contexts. Specifically, NN TSC is applied to infer two binary attributes - communication and proportional navigation - which combine to define four mutually exclusive swarm tactics. We identify a gap in literature on using NNs for swarm classification and demonstrate the effectiveness of NN TSC in rapidly deducing intelligence about attacking swarms to inform counter-maneuvers. Through simulated swarm-vs-swarm engagements, we evaluate NN TSC performance in terms of observation window requirements, noise robustness, and scalability to swarm size. Key findings show NNs can predict swarm behaviors with 97% accuracy using short observation windows of 20 time steps, while also demonstrating graceful degradation down to 80% accuracy under 50% noise, as well as excellent scalability to swarm sizes from 10 to 100 agents. These capabilities are promising for real-time decision-making support in defense scenarios by rapidly inferring insights about swarm behavior. ",
    "url": "https://arxiv.org/abs/2403.19572",
    "authors": [
      "Donald W. Peltier III",
      "Isaac Kaminer",
      "Abram Clark",
      "Marko Orescanin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19579",
    "title": "The Bad Batches: Enhancing Self-Supervised Learning in Image  Classification Through Representative Batch Curation",
    "abstract": "The pursuit of learning robust representations without human supervision is a longstanding challenge. The recent advancements in self-supervised contrastive learning approaches have demonstrated high performance across various representation learning challenges. However, current methods depend on the random transformation of training examples, resulting in some cases of unrepresentative positive pairs that can have a large impact on learning. This limitation not only impedes the convergence of the learning process but the robustness of the learnt representation as well as requiring larger batch sizes to improve robustness to such bad batches. This paper attempts to alleviate the influence of false positive and false negative pairs by employing pairwise similarity calculations through the Fr\\'echet ResNet Distance (FRD), thereby obtaining robust representations from unlabelled data. The effectiveness of the proposed method is substantiated by empirical results, where a linear classifier trained on self-supervised contrastive representations achieved an impressive 87.74\\% top-1 accuracy on STL10 and 99.31\\% on the Flower102 dataset. These results emphasize the potential of the proposed approach in pushing the boundaries of the state-of-the-art in self-supervised contrastive learning, particularly for image classification tasks. ",
    "url": "https://arxiv.org/abs/2403.19579",
    "authors": [
      "Ozgu Goksu",
      "Nicolas Pugeault"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19580",
    "title": "OV-Uni3DETR: Towards Unified Open-Vocabulary 3D Object Detection via  Cycle-Modality Propagation",
    "abstract": "In the current state of 3D object detection research, the severe scarcity of annotated 3D data, substantial disparities across different data modalities, and the absence of a unified architecture, have impeded the progress towards the goal of universality. In this paper, we propose \\textbf{OV-Uni3DETR}, a unified open-vocabulary 3D detector via cycle-modality propagation. Compared with existing 3D detectors, OV-Uni3DETR offers distinct advantages: 1) Open-vocabulary 3D detection: During training, it leverages various accessible data, especially extensive 2D detection images, to boost training diversity. During inference, it can detect both seen and unseen classes. 2) Modality unifying: It seamlessly accommodates input data from any given modality, effectively addressing scenarios involving disparate modalities or missing sensor information, thereby supporting test-time modality switching. 3) Scene unifying: It provides a unified multi-modal model architecture for diverse scenes collected by distinct sensors. Specifically, we propose the cycle-modality propagation, aimed at propagating knowledge bridging 2D and 3D modalities, to support the aforementioned functionalities. 2D semantic knowledge from large-vocabulary learning guides novel class discovery in the 3D domain, and 3D geometric knowledge provides localization supervision for 2D detection images. OV-Uni3DETR achieves the state-of-the-art performance on various scenarios, surpassing existing methods by more than 6\\% on average. Its performance using only RGB images is on par with or even surpasses that of previous point cloud based methods. Code and pre-trained models will be released later. ",
    "url": "https://arxiv.org/abs/2403.19580",
    "authors": [
      "Zhenyu Wang",
      "Yali Li",
      "Taichi Liu",
      "Hengshuang Zhao",
      "Shengjin Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19612",
    "title": "ILPO-NET: Network for the invariant recognition of arbitrary volumetric  patterns in 3D",
    "abstract": "Effective recognition of spatial patterns and learning their hierarchy is crucial in modern spatial data analysis. Volumetric data applications seek techniques ensuring invariance not only to shifts but also to pattern rotations. While traditional methods can readily achieve translational invariance, rotational invariance possesses multiple challenges and remains an active area of research. Here, we present ILPO-Net (Invariant to Local Patterns Orientation Network), a novel approach that handles arbitrarily shaped patterns with the convolutional operation inherently invariant to local spatial pattern orientations using the Wigner matrix expansions. Our architecture seamlessly integrates the new convolution operator and, when benchmarked on diverse volumetric datasets such as MedMNIST and CATH, demonstrates superior performance over the baselines with significantly reduced parameter counts - up to 1000 times fewer in the case of MedMNIST. Beyond these demonstrations, ILPO-Net's rotational invariance paves the way for other applications across multiple disciplines. Our code is publicly available at https://gricad-gitlab.univ-grenoble-alpes.fr/GruLab/ILPONet. ",
    "url": "https://arxiv.org/abs/2403.19612",
    "authors": [
      "Dmitrii Zhemchuzhnikov",
      "Sergei Grudinin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19625",
    "title": "Top-$k$ Classification and Cardinality-Aware Prediction",
    "abstract": "We present a detailed study of top-$k$ classification, the task of predicting the $k$ most probable classes for an input, extending beyond single-class prediction. We demonstrate that several prevalent surrogate loss functions in multi-class classification, such as comp-sum and constrained losses, are supported by $H$-consistency bounds with respect to the top-$k$ loss. These bounds guarantee consistency in relation to the hypothesis set $H$, providing stronger guarantees than Bayes-consistency due to their non-asymptotic and hypothesis-set specific nature. To address the trade-off between accuracy and cardinality $k$, we further introduce cardinality-aware loss functions through instance-dependent cost-sensitive learning. For these functions, we derive cost-sensitive comp-sum and constrained surrogate losses, establishing their $H$-consistency bounds and Bayes-consistency. Minimizing these losses leads to new cardinality-aware algorithms for top-$k$ classification. We report the results of extensive experiments on CIFAR-100, ImageNet, CIFAR-10, and SVHN datasets demonstrating the effectiveness and benefit of these algorithms. ",
    "url": "https://arxiv.org/abs/2403.19625",
    "authors": [
      "Anqi Mao",
      "Mehryar Mohri",
      "Yutao Zhong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.19633",
    "title": "Lane-Change in Dense Traffic with Model Predictive Control and Neural  Networks",
    "abstract": "This paper presents an online smooth-path lane-change control framework. We focus on dense traffic where inter-vehicle space gaps are narrow, and cooperation with surrounding drivers is essential to achieve the lane-change maneuver. We propose a two-stage control framework that harmonizes Model Predictive Control (MPC) with Generative Adversarial Networks (GAN) by utilizing driving intentions to generate smooth lane-change maneuvers. To improve performance in practice, the system is augmented with an adaptive safety boundary and a Kalman Filter to mitigate sensor noise. Simulation studies are investigated in different levels of traffic density and cooperativeness of other drivers. The simulation results support the effectiveness, driving comfort, and safety of the proposed method. ",
    "url": "https://arxiv.org/abs/2403.19633",
    "authors": [
      "Sangjae Bae",
      "David Isele",
      "Alireza Nakhaei",
      "Peng Xu",
      "Alexandre Miranda Anon",
      "Chiho Choi",
      "Kikuo Fujimura",
      "Scott Moura"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.19646",
    "title": "Change-Agent: Towards Interactive Comprehensive Change Interpretation  and Analysis from Change Detection and Change Captioning",
    "abstract": "Monitoring changes in the Earth's surface is crucial for understanding natural processes and human impacts, necessitating precise and comprehensive interpretation methodologies. Remote sensing satellite imagery offers a unique perspective for monitoring these changes, leading to the emergence of remote sensing image change interpretation (RSICI) as a significant research focus. Current RSICI technology encompasses change detection and change captioning, each with its limitations in providing comprehensive interpretation. To address this, we propose an interactive Change-Agent which integrates a multi-level change interpretation (MCI) model as eyes and a large language model (LLM) as the brain. Our Change-Agent can follow user instructions to achieve comprehensive change interpretation and insightful analysis according to user instructions, such as change detection and change captioning, change object counting, change cause analysis, etc. Our proposed MCI model contains two branches of pixel-level change detection and semantic-level change captioning, in which multiple BI-temporal Iterative Interaction (BI3) layers utilize Local Perception Enhancement (LPE) and the Global Difference Fusion Attention (GDFA) modules to enhance the model's discriminative feature representation capabilities. To train the MCI model, we build the LEVIR-MCI dataset with change masks and captions of bi-temporal images. Extensive experiments demonstrate the effectiveness of the proposed change interpretation model and highlight the promising potential of our Change-Agent in facilitating comprehensive and intelligent interpretation of surface changes. We will make our dataset and codebase of the change interpretation model and Change-Agent publicly available to facilitate future research at https://github.com/Chen-Yang-Liu/Change-Agent ",
    "url": "https://arxiv.org/abs/2403.19646",
    "authors": [
      "Chenyang Liu",
      "Keyan Chen",
      "Haotian Zhang",
      "Zipeng Qi",
      "Zhengxia Zou",
      "Zhenwei Shi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19647",
    "title": "Sparse Feature Circuits: Discovering and Editing Interpretable Causal  Graphs in Language Models",
    "abstract": "We introduce methods for discovering and applying sparse feature circuits. These are causally implicated subnetworks of human-interpretable features for explaining language model behaviors. Circuits identified in prior work consist of polysemantic and difficult-to-interpret units like attention heads or neurons, rendering them unsuitable for many downstream applications. In contrast, sparse feature circuits enable detailed understanding of unanticipated mechanisms. Because they are based on fine-grained units, sparse feature circuits are useful for downstream tasks: We introduce SHIFT, where we improve the generalization of a classifier by ablating features that a human judges to be task-irrelevant. Finally, we demonstrate an entirely unsupervised and scalable interpretability pipeline by discovering thousands of sparse feature circuits for automatically discovered model behaviors. ",
    "url": "https://arxiv.org/abs/2403.19647",
    "authors": [
      "Samuel Marks",
      "Can Rager",
      "Eric J. Michaud",
      "Yonatan Belinkov",
      "David Bau",
      "Aaron Mueller"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.19651",
    "title": "MagicLens: Self-Supervised Image Retrieval with Open-Ended Instructions",
    "abstract": "Image retrieval, i.e., finding desired images given a reference image, inherently encompasses rich, multi-faceted search intents that are difficult to capture solely using image-based measures. Recent work leverages text instructions to allow users to more freely express their search intents. However, existing work primarily focuses on image pairs that are visually similar and/or can be characterized by a small set of pre-defined relations. The core thesis of this paper is that text instructions can enable retrieving images with richer relations beyond visual similarity. To show this, we introduce MagicLens, a series of self-supervised image retrieval models that support open-ended instructions. MagicLens is built on a key novel insight: image pairs that naturally occur on the same web pages contain a wide range of implicit relations (e.g., inside view of), and we can bring those implicit relations explicit by synthesizing instructions via large multimodal models (LMMs) and large language models (LLMs). Trained on 36.7M (query image, instruction, target image) triplets with rich semantic relations mined from the web, MagicLens achieves comparable or better results on eight benchmarks of various image retrieval tasks than prior state-of-the-art (SOTA) methods. Remarkably, it outperforms previous SOTA but with a 50X smaller model size on multiple benchmarks. Additional human analyses on a 1.4M-image unseen corpus further demonstrate the diversity of search intents supported by MagicLens. ",
    "url": "https://arxiv.org/abs/2403.19651",
    "authors": [
      "Kai Zhang",
      "Yi Luan",
      "Hexiang Hu",
      "Kenton Lee",
      "Siyuan Qiao",
      "Wenhu Chen",
      "Yu Su",
      "Ming-Wei Chang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2403.18840",
    "title": "Feynman Diagrams as Computational Graphs",
    "abstract": "We propose a computational graph representation of high-order Feynman diagrams in Quantum Field Theory (QFT), applicable to any combination of spatial, temporal, momentum, and frequency domains. Utilizing the Dyson-Schwinger and parquet equations, our approach effectively organizes these diagrams into a fractal structure of tensor operations, significantly reducing computational redundancy. This approach not only streamlines the evaluation of complex diagrams but also facilitates an efficient implementation of the field-theoretic renormalization scheme, crucial for enhancing perturbative QFT calculations. Key to this advancement is the integration of Taylor-mode automatic differentiation, a key technique employed in machine learning packages to compute higher-order derivatives efficiently on computational graphs. To operationalize these concepts, we develop a Feynman diagram compiler that optimizes diagrams for various computational platforms, utilizing machine learning frameworks. Demonstrating this methodology's effectiveness, we apply it to the three-dimensional uniform electron gas problem, achieving unprecedented accuracy in calculating the quasiparticle effective mass at metal density. Our work demonstrates the synergy between QFT and machine learning, establishing a new avenue for applying AI techniques to complex quantum many-body problems. ",
    "url": "https://arxiv.org/abs/2403.18840",
    "authors": [
      "Pengcheng Hou",
      "Tao Wang",
      "Daniel Cerkoney",
      "Xiansheng Cai",
      "Zhiyi Li",
      "Youjin Deng",
      "Lei Wang",
      "Kun Chen"
    ],
    "subjectives": [
      "High Energy Physics - Theory (hep-th)",
      "Strongly Correlated Electrons (cond-mat.str-el)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Phenomenology (hep-ph)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2403.18963",
    "title": "Using Quantum Computing to Infer Dynamic Behaviors of Biological and  Artificial Neural Networks",
    "abstract": "The exploration of new problem classes for quantum computation is an active area of research. An essentially completely unexplored topic is the use of quantum algorithms and computing to explore and ask questions \\textit{about} the functional dynamics of neural networks. This is a component of the still-nascent topic of applying quantum computing to the modeling and simulations of biological and artificial neural networks. In this work, we show how a carefully constructed set of conditions can use two foundational quantum algorithms, Grover and Deutsch-Josza, in such a way that the output measurements admit an interpretation that guarantees we can infer if a simple representation of a neural network (which applies to both biological and artificial networks) after some period of time has the potential to continue sustaining dynamic activity. Or whether the dynamics are guaranteed to stop either through 'epileptic' dynamics or quiescence. ",
    "url": "https://arxiv.org/abs/2403.18963",
    "authors": [
      "Gabriel A. Silva"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2403.18994",
    "title": "Causal-StoNet: Causal Inference for High-Dimensional Complex Data",
    "abstract": "With the advancement of data science, the collection of increasingly complex datasets has become commonplace. In such datasets, the data dimension can be extremely high, and the underlying data generation process can be unknown and highly nonlinear. As a result, the task of making causal inference with high-dimensional complex data has become a fundamental problem in many disciplines, such as medicine, econometrics, and social science. However, the existing methods for causal inference are frequently developed under the assumption that the data dimension is low or that the underlying data generation process is linear or approximately linear. To address these challenges, this paper proposes a novel causal inference approach for dealing with high-dimensional complex data. The proposed approach is based on deep learning techniques, including sparse deep learning theory and stochastic neural networks, that have been developed in recent literature. By using these techniques, the proposed approach can address both the high dimensionality and unknown data generation process in a coherent way. Furthermore, the proposed approach can also be used when missing values are present in the datasets. Extensive numerical studies indicate that the proposed approach outperforms existing ones. ",
    "url": "https://arxiv.org/abs/2403.18994",
    "authors": [
      "Yaxin Fang",
      "Faming Liang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19099",
    "title": "Optimizing Quantum Convolutional Neural Network Architectures for  Arbitrary Data Dimension",
    "abstract": "Quantum convolutional neural networks (QCNNs) represent a promising approach in quantum machine learning, paving new directions for both quantum and classical data analysis. This approach is particularly attractive due to the absence of the barren plateau problem, a fundamental challenge in training quantum neural networks (QNNs), and its feasibility. However, a limitation arises when applying QCNNs to classical data. The network architecture is most natural when the number of input qubits is a power of two, as this number is reduced by a factor of two in each pooling layer. The number of input qubits determines the dimensions (i.e. the number of features) of the input data that can be processed, restricting the applicability of QCNN algorithms to real-world data. To address this issue, we propose a QCNN architecture capable of handling arbitrary input data dimensions while optimizing the allocation of quantum resources such as ancillary qubits and quantum gates. This optimization is not only important for minimizing computational resources, but also essential in noisy intermediate-scale quantum (NISQ) computing, as the size of the quantum circuits that can be executed reliably is limited. Through numerical simulations, we benchmarked the classification performance of various QCNN architectures when handling arbitrary input data dimensions on the MNIST and Breast Cancer datasets. The results validate that the proposed QCNN architecture achieves excellent classification performance while utilizing a minimal resource overhead, providing an optimal solution when reliable quantum computation is constrained by noise and imperfections. ",
    "url": "https://arxiv.org/abs/2403.19099",
    "authors": [
      "Changwon Lee",
      "Israel F. Araujo",
      "Dongha Kim",
      "Junghan Lee",
      "Siheon Park",
      "Ju-Young Ryu",
      "Daniel K. Park"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19180",
    "title": "A Multi-hop Secure UWOC assisted Local Area Network for UIoT and  Underwater Monitoring",
    "abstract": "Underwater environment is substantially less explored territory as compared to earth surface due to lack of robust underwater communication infrastructure. For Internet of Underwater things connectivity, underwater wireless optical communication can play a vital role, compared to conventional radio frequency communication, due to longer range, high data rate, low latency, and unregulated bandwidth. This study proposes underwater wireless optical communication driven local area network UWOC LAN, comprised of multiple network nodes with optical transceivers. Moreover, the temperature sensor data is encapsulated with individual authentication identity to enhance the security of the framework at the user end. The proposed system is evaluated in a specially designed water tank of 4 meters. The proposed system evaluation analysis shows that the system can transmit underwater temperature data reliably in real time. The proposed secure UWOC LAN is tested within a communication range of 16 meters by incorporating multi hop connectivity to monitor the underwater environment. ",
    "url": "https://arxiv.org/abs/2403.19180",
    "authors": [
      "Maaz Salman",
      "Javad Bolboli",
      "Wan-Young Chung"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2403.19203",
    "title": "Single-Shared Network with Prior-Inspired Loss for Parameter-Efficient  Multi-Modal Imaging Skin Lesion Classification",
    "abstract": "In this study, we introduce a multi-modal approach that efficiently integrates multi-scale clinical and dermoscopy features within a single network, thereby substantially reducing model parameters. The proposed method includes three novel fusion schemes. Firstly, unlike current methods that usually employ two individual models for for clinical and dermoscopy modalities, we verified that multimodal feature can be learned by sharing the parameters of encoder while leaving the individual modal-specific classifiers. Secondly, the shared cross-attention module can replace the individual one to efficiently interact between two modalities at multiple layers. Thirdly, different from current methods that equally optimize dermoscopy and clinical branches, inspired by prior knowledge that dermoscopy images play a more significant role than clinical images, we propose a novel biased loss. This loss guides the single-shared network to prioritize dermoscopy information over clinical information, implicitly learning a better joint feature representation for the modal-specific task. Extensive experiments on a well-recognized Seven-Point Checklist (SPC) dataset and a collected dataset demonstrate the effectiveness of our method on both CNN and Transformer structures. Furthermore, our method exhibits superiority in both accuracy and model parameters compared to currently advanced methods. ",
    "url": "https://arxiv.org/abs/2403.19203",
    "authors": [
      "Peng Tang",
      "Tobias Lasser"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19262",
    "title": "Removing the need for ground truth UWB data collection: self-supervised  ranging error correction using deep reinforcement learning",
    "abstract": "Indoor positioning using UWB technology has gained interest due to its centimeter-level accuracy potential. However, multipath effects and non-line-of-sight conditions cause ranging errors between anchors and tags. Existing approaches for mitigating these ranging errors rely on collecting large labeled datasets, making them impractical for real-world deployments. This paper proposes a novel self-supervised deep reinforcement learning approach that does not require labeled ground truth data. A reinforcement learning agent uses the channel impulse response as a state and predicts corrections to minimize the error between corrected and estimated ranges. The agent learns, self-supervised, by iteratively improving corrections that are generated by combining the predictability of trajectories with filtering and smoothening. Experiments on real-world UWB measurements demonstrate comparable performance to state-of-the-art supervised methods, overcoming data dependency and lack of generalizability limitations. This makes self-supervised deep reinforcement learning a promising solution for practical and scalable UWB-ranging error correction. ",
    "url": "https://arxiv.org/abs/2403.19262",
    "authors": [
      "Dieter Coppens",
      "Ben Van Herbruggen",
      "Adnan Shahid",
      "Eli De Poorter"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.19300",
    "title": "Random Multi-Type Spanning Forests for Synchronization on Sparse Graphs",
    "abstract": "Random diffusions are a popular tool in Monte-Carlo estimations, with well established algorithms such as Walk-on-Spheres (WoS) going back several decades. In this work, we introduce diffusion estimators for the problems of angular synchronization and smoothing on graphs, in the presence of a rotation associated to each edge. Unlike classical WoS algorithms, these estimators allow for global estimations by propagating along the branches of multi-type spanning forests, and we show that they can outperform standard numerical-linear-algebra solvers in challenging instances, depending on the topology and density of the graph. ",
    "url": "https://arxiv.org/abs/2403.19300",
    "authors": [
      "Hugo Jaquard",
      "Pierre-Olivier Amblard",
      "Simon Barthelmé",
      "Nicolas Tremblay"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Data Structures and Algorithms (cs.DS)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2403.19425",
    "title": "A Robust Ensemble Algorithm for Ischemic Stroke Lesion Segmentation:  Generalizability and Clinical Utility Beyond the ISLES Challenge",
    "abstract": "Diffusion-weighted MRI (DWI) is essential for stroke diagnosis, treatment decisions, and prognosis. However, image and disease variability hinder the development of generalizable AI algorithms with clinical value. We address this gap by presenting a novel ensemble algorithm derived from the 2022 Ischemic Stroke Lesion Segmentation (ISLES) challenge. ISLES'22 provided 400 patient scans with ischemic stroke from various medical centers, facilitating the development of a wide range of cutting-edge segmentation algorithms by the research community. Through collaboration with leading teams, we combined top-performing algorithms into an ensemble model that overcomes the limitations of individual solutions. Our ensemble model achieved superior ischemic lesion detection and segmentation accuracy on our internal test set compared to individual algorithms. This accuracy generalized well across diverse image and disease variables. Furthermore, the model excelled in extracting clinical biomarkers. Notably, in a Turing-like test, neuroradiologists consistently preferred the algorithm's segmentations over manual expert efforts, highlighting increased comprehensiveness and precision. Validation using a real-world external dataset (N=1686) confirmed the model's generalizability. The algorithm's outputs also demonstrated strong correlations with clinical scores (admission NIHSS and 90-day mRS) on par with or exceeding expert-derived results, underlining its clinical relevance. This study offers two key findings. First, we present an ensemble algorithm (https://github.com/Tabrisrei/ISLES22_Ensemble) that detects and segments ischemic stroke lesions on DWI across diverse scenarios on par with expert (neuro)radiologists. Second, we show the potential for biomedical challenge outputs to extend beyond the challenge's initial objectives, demonstrating their real-world clinical applicability. ",
    "url": "https://arxiv.org/abs/2403.19425",
    "authors": [
      "Ezequiel de la Rosa",
      "Mauricio Reyes",
      "Sook-Lei Liew",
      "Alexandre Hutton",
      "Roland Wiest",
      "Johannes Kaesmacher",
      "Uta Hanning",
      "Arsany Hakim",
      "Richard Zubal",
      "Waldo Valenzuela",
      "David Robben",
      "Diana M. Sima",
      "Vincenzo Anania",
      "Arne Brys",
      "James A. Meakin",
      "Anne Mickan",
      "Gabriel Broocks",
      "Christian Heitkamp",
      "Shengbo Gao",
      "Kongming Liang",
      "Ziji Zhang",
      "Md Mahfuzur Rahman Siddiquee",
      "Andriy Myronenko",
      "Pooya Ashtari",
      "Sabine Van Huffel",
      "Hyun-su Jeong",
      "Chi-ho Yoon",
      "Chulhong Kim",
      "Jiayu Huo",
      "Sebastien Ourselin",
      "Rachel Sparks",
      "Albert Clèrigues",
      "Arnau Oliver",
      "Xavier Lladó",
      "Liam Chalcroft",
      "Ioannis Pappas",
      "Jeroen Bertels",
      "Ewout Heylen",
      "Juliette Moreau",
      "Nima Hatami",
      "Carole Frindel",
      "Abdul Qayyum",
      "Moona Mazher",
      "Domenec Puig",
      "Shao-Chieh Lin",
      "Chun-Jung Juan",
      "Tianxi Hu",
      "Lyndon Boone",
      "Maged Goubran",
      "Yi-Jui Liu",
      "Susanne Wegener"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.19516",
    "title": "Maximum Likelihood Estimation on Stochastic Blockmodels for Directed  Graph Clustering",
    "abstract": "This paper studies the directed graph clustering problem through the lens of statistics, where we formulate clustering as estimating underlying communities in the directed stochastic block model (DSBM). We conduct the maximum likelihood estimation (MLE) on the DSBM and thereby ascertain the most probable community assignment given the observed graph structure. In addition to the statistical point of view, we further establish the equivalence between this MLE formulation and a novel flow optimization heuristic, which jointly considers two important directed graph statistics: edge density and edge orientation. Building on this new formulation of directed clustering, we introduce two efficient and interpretable directed clustering algorithms, a spectral clustering algorithm and a semidefinite programming based clustering algorithm. We provide a theoretical upper bound on the number of misclustered vertices of the spectral clustering algorithm using tools from matrix perturbation theory. We compare, both quantitatively and qualitatively, our proposed algorithms with existing directed clustering methods on both synthetic and real-world data, thus providing further ground to our theoretical contributions. ",
    "url": "https://arxiv.org/abs/2403.19516",
    "authors": [
      "Mihai Cucuringu",
      "Xiaowen Dong",
      "Ning Zhang"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2403.19605",
    "title": "Data-Adaptive Tradeoffs among Multiple Risks in Distribution-Free  Prediction",
    "abstract": "Decision-making pipelines are generally characterized by tradeoffs among various risk functions. It is often desirable to manage such tradeoffs in a data-adaptive manner. As we demonstrate, if this is done naively, state-of-the art uncertainty quantification methods can lead to significant violations of putative risk guarantees. To address this issue, we develop methods that permit valid control of risk when threshold and tradeoff parameters are chosen adaptively. Our methodology supports monotone and nearly-monotone risks, but otherwise makes no distributional assumptions. To illustrate the benefits of our approach, we carry out numerical experiments on synthetic data and the large-scale vision dataset MS-COCO. ",
    "url": "https://arxiv.org/abs/2403.19605",
    "authors": [
      "Drew T. Nguyen",
      "Reese Pathak",
      "Anastasios N. Angelopoulos",
      "Stephen Bates",
      "Michael I. Jordan"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2007.15776",
    "title": "Random Vector Functional Link Networks for Function Approximation on  Manifolds",
    "abstract": " Comments: 37 pages, 1 figure ",
    "url": "https://arxiv.org/abs/2007.15776",
    "authors": [
      "Deanna Needell",
      "Aaron A. Nelson",
      "Rayan Saab",
      "Palina Salanevich",
      "Olov Schavemaker"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2202.04291",
    "title": "L2B: Learning to Bootstrap Robust Models for Combating Label Noise",
    "abstract": " Comments: CVPR 2024; code is available at this https URL ",
    "url": "https://arxiv.org/abs/2202.04291",
    "authors": [
      "Yuyin Zhou",
      "Xianhang Li",
      "Fengze Liu",
      "Qingyue Wei",
      "Xuxi Chen",
      "Lequan Yu",
      "Cihang Xie",
      "Matthew P. Lungren",
      "Lei Xing"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.11970",
    "title": "Visual Acuity Prediction on Real-Life Patient Data Using a Machine  Learning Based Multistage System",
    "abstract": " Comments: Preprint for journal Scientific Reports (Springer) ",
    "url": "https://arxiv.org/abs/2204.11970",
    "authors": [
      "Tobias Schlosser",
      "Frederik Beuth",
      "Trixy Meyer",
      "Arunodhayan Sampath Kumar",
      "Gabriel Stolze",
      "Olga Furashova",
      "Katrin Engelmann",
      "Danny Kowerko"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13690",
    "title": "Supervised Semantic Similarity-based Conflict Detection Algorithm: S3CDA",
    "abstract": " Title: Supervised Semantic Similarity-based Conflict Detection Algorithm: S3CDA ",
    "url": "https://arxiv.org/abs/2206.13690",
    "authors": [
      "Garima Malik",
      "Mucahit Cevik",
      "Devang Parikh",
      "Ayse Basar"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2208.11274",
    "title": "Revisiting Code Search in a Two-Stage Paradigm",
    "abstract": " Comments: Accepted by WSDM 2023 ",
    "url": "https://arxiv.org/abs/2208.11274",
    "authors": [
      "Fan Hu",
      "Yanlin Wang",
      "Lun Du",
      "Xirong Li",
      "Hongyu Zhang",
      "Shi Han",
      "Dongmei Zhang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2211.01579",
    "title": "Data-free Defense of Black Box Models Against Adversarial Attacks",
    "abstract": " Comments: CVPR Workshop (Under Review) ",
    "url": "https://arxiv.org/abs/2211.01579",
    "authors": [
      "Gaurav Kumar Nayak",
      "Inder Khatri",
      "Ruchit Rawal",
      "Anirban Chakraborty"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.13375",
    "title": "Optimal Transport Perturbations for Safe Reinforcement Learning with  Robustness Guarantees",
    "abstract": " Comments: Transactions on Machine Learning Research (TMLR), 2024 ",
    "url": "https://arxiv.org/abs/2301.13375",
    "authors": [
      "James Queeney",
      "Erhan Can Ozcan",
      "Ioannis Ch. Paschalidis",
      "Christos G. Cassandras"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.03357",
    "title": "Towards Enhancing Time Series Contrastive Learning: A Dynamic Bad Pair  Mining Approach",
    "abstract": " Comments: ICLR 2024 Camera Ready (this https URL) ",
    "url": "https://arxiv.org/abs/2302.03357",
    "authors": [
      "Xiang Lan",
      "Hanshu Yan",
      "Shenda Hong",
      "Mengling Feng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.03788",
    "title": "Toward a Theory of Causation for Interpreting Neural Code Models",
    "abstract": " Comments: Accepted to appear in IEEE Transactions on Software Engineering ",
    "url": "https://arxiv.org/abs/2302.03788",
    "authors": [
      "David N. Palacio",
      "Alejandro Velasco",
      "Nathan Cooper",
      "Alvaro Rodriguez",
      "Kevin Moran",
      "Denys Poshyvanyk"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2304.05684",
    "title": "InterGen: Diffusion-based Multi-human Motion Generation under Complex  Interactions",
    "abstract": " Comments: accepted by IJCV 2024 ",
    "url": "https://arxiv.org/abs/2304.05684",
    "authors": [
      "Han Liang",
      "Wenqian Zhang",
      "Wenxuan Li",
      "Jingyi Yu",
      "Lan Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.11342",
    "title": "NaviNeRF: NeRF-based 3D Representation Disentanglement by Latent  Semantic Navigation",
    "abstract": " Title: NaviNeRF: NeRF-based 3D Representation Disentanglement by Latent  Semantic Navigation ",
    "url": "https://arxiv.org/abs/2304.11342",
    "authors": [
      "Baao Xie",
      "Bohan Li",
      "Zequn Zhang",
      "Junting Dong",
      "Xin Jin",
      "Jingyu Yang",
      "Wenjun Zeng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.18034",
    "title": "A Corpus for Sentence-level Subjectivity Detection on English News  Articles",
    "abstract": " Comments: Accepted at LREC-COLING 2024 ",
    "url": "https://arxiv.org/abs/2305.18034",
    "authors": [
      "Francesco Antici",
      "Andrea Galassi",
      "Federico Ruggeri",
      "Katerina Korre",
      "Arianna Muti",
      "Alessandra Bardi",
      "Alice Fedotova",
      "Alberto Barrón-Cedeño"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.10367",
    "title": "Query2GMM: Learning Representation with Gaussian Mixture Model for  Reasoning over Knowledge Graphs",
    "abstract": " Comments: 10 pages, 4 figures, accepted by WWW 2024 ",
    "url": "https://arxiv.org/abs/2306.10367",
    "authors": [
      "Yuhan Wu",
      "Yuanyuan Xu",
      "Wenjie Zhang",
      "Xiwei Xu",
      "Ying Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2306.16324",
    "title": "DoseDiff: Distance-aware Diffusion Model for Dose Prediction in  Radiotherapy",
    "abstract": " Title: DoseDiff: Distance-aware Diffusion Model for Dose Prediction in  Radiotherapy ",
    "url": "https://arxiv.org/abs/2306.16324",
    "authors": [
      "Yiwen Zhang",
      "Chuanpu Li",
      "Liming Zhong",
      "Zeli Chen",
      "Wei Yang",
      "Xuetao Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.17077",
    "title": "RAPGen: An Approach for Fixing Code Inefficiencies in Zero-Shot",
    "abstract": " Title: RAPGen: An Approach for Fixing Code Inefficiencies in Zero-Shot ",
    "url": "https://arxiv.org/abs/2306.17077",
    "authors": [
      "Spandan Garg",
      "Roshanak Zilouchian Moghaddam",
      "Neel Sundaresan"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.01362",
    "title": "Direct Superpoints Matching for Robust Point Cloud Registration",
    "abstract": " Title: Direct Superpoints Matching for Robust Point Cloud Registration ",
    "url": "https://arxiv.org/abs/2307.01362",
    "authors": [
      "Aniket Gupta",
      "Yiming Xie",
      "Hanumant Singh",
      "Huaizu Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.01579",
    "title": "With Trail to Follow: Measurements of Real-world Non-fungible Token  Phishing Attacks on Ethereum",
    "abstract": " Comments: The content of the article has undergone major changes ",
    "url": "https://arxiv.org/abs/2307.01579",
    "authors": [
      "Jingjing Yang",
      "Jieli Liu",
      "Jiajing Wu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.02496",
    "title": "Learning to reconstruct the bubble distribution with conductivity maps  using Invertible Neural Networks and Error Diffusion",
    "abstract": " Comments: Accepted for Oral presentation at WCIPT11 (11th World Congress on Industrial Process Tomography) ",
    "url": "https://arxiv.org/abs/2307.02496",
    "authors": [
      "Nishant Kumar",
      "Lukas Krause",
      "Thomas Wondrak",
      "Sven Eckert",
      "Kerstin Eckert",
      "Stefan Gumhold"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.04977",
    "title": "Model-Driven Sensing-Node Selection and Power Allocation for Tracking  Maneuvering Targets in Perceptive Mobile Networks",
    "abstract": " Title: Model-Driven Sensing-Node Selection and Power Allocation for Tracking  Maneuvering Targets in Perceptive Mobile Networks ",
    "url": "https://arxiv.org/abs/2307.04977",
    "authors": [
      "Lei Xie",
      "Hengtao He",
      "Shenghui Song",
      "Yonina C. Eldar"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2307.10924",
    "title": "Intrinsic Image Decomposition Using Point Cloud Representation",
    "abstract": " Comments: Code: this https URL ",
    "url": "https://arxiv.org/abs/2307.10924",
    "authors": [
      "Xiaoyan Xing",
      "Konrad Groh",
      "Sezer Karaoglu",
      "Theo Gevers"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.10757",
    "title": "To Whom are You Talking? A Deep Learning Model to Endow Social Robots  with Addressee Estimation Skills",
    "abstract": " Comments: Accepted v. of IJCNN 2023 publication. Funded by the Horizon Europe project TERAIS (G.A. 101079338), the UKRI Node on Trust (EP/V026682/1), the EU projects TRAINCREASE and MUSAE, and the US project THRIVE++. Cite: this https URL Code: this https URL Data: this https URL 10 pages, 8 Figures, 3 Tables ",
    "url": "https://arxiv.org/abs/2308.10757",
    "authors": [
      "Carlo Mazzola",
      "Marta Romeo",
      "Francesco Rea",
      "Alessandra Sciutti",
      "Angelo Cangelosi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2309.13302",
    "title": "Gaining the Sparse Rewards by Exploring Lottery Tickets in Spiking  Neural Network",
    "abstract": " Comments: This paper is under submission ",
    "url": "https://arxiv.org/abs/2309.13302",
    "authors": [
      "Hao Cheng",
      "Jiahang Cao",
      "Erjia Xiao",
      "Mengshu Sun",
      "Renjing Xu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.13610",
    "title": "VisionKG: Unleashing the Power of Visual Datasets via Knowledge Graph",
    "abstract": " Comments: Accepted at ESWC 2024 ",
    "url": "https://arxiv.org/abs/2309.13610",
    "authors": [
      "Jicheng Yuan",
      "Anh Le-Tuan",
      "Manh Nguyen-Duc",
      "Trung-Kien Tran",
      "Manfred Hauswirth",
      "Danh Le-Phuoc"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.17053",
    "title": "On the Power of the Weisfeiler-Leman Test for Graph Motif Parameters",
    "abstract": " Title: On the Power of the Weisfeiler-Leman Test for Graph Motif Parameters ",
    "url": "https://arxiv.org/abs/2309.17053",
    "authors": [
      "Matthias Lanzinger",
      "Pablo Barceló"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.00926",
    "title": "Integration of Graph Neural Network and Neural-ODEs for Tumor Dynamic  Prediction",
    "abstract": " Title: Integration of Graph Neural Network and Neural-ODEs for Tumor Dynamic  Prediction ",
    "url": "https://arxiv.org/abs/2310.00926",
    "authors": [
      "Omid Bazgir",
      "Zichen Wang",
      "Ji Won Park",
      "Marc Hafner",
      "James Lu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.02861",
    "title": "Rayleigh Quotient Graph Neural Networks for Graph-level Anomaly  Detection",
    "abstract": " Title: Rayleigh Quotient Graph Neural Networks for Graph-level Anomaly  Detection ",
    "url": "https://arxiv.org/abs/2310.02861",
    "authors": [
      "Xiangyu Dong",
      "Xingyi Zhang",
      "Sibo Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.04190",
    "title": "On the Two Sides of Redundancy in Graph Neural Networks",
    "abstract": " Title: On the Two Sides of Redundancy in Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2310.04190",
    "authors": [
      "Franka Bause",
      "Samir Moustafa",
      "Johannes Langguth",
      "Wilfried N. Gansterer",
      "Nils M. Kriege"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.14344",
    "title": "What's in a Prior? Learned Proximal Networks for Inverse Problems",
    "abstract": " Title: What's in a Prior? Learned Proximal Networks for Inverse Problems ",
    "url": "https://arxiv.org/abs/2310.14344",
    "authors": [
      "Zhenghan Fang",
      "Sam Buchanan",
      "Jeremias Sulam"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.09519",
    "title": "Leveraging Code to Improve In-context Learning for Semantic Parsing",
    "abstract": " Comments: Accepted to NAACL 2024 ",
    "url": "https://arxiv.org/abs/2311.09519",
    "authors": [
      "Ben Bogin",
      "Shivanshu Gupta",
      "Peter Clark",
      "Ashish Sabharwal"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.11016",
    "title": "SNI-SLAM: Semantic Neural Implicit SLAM",
    "abstract": " Comments: Accepted to CVPR 2024 ",
    "url": "https://arxiv.org/abs/2311.11016",
    "authors": [
      "Siting Zhu",
      "Guangming Wang",
      "Hermann Blum",
      "Jiuming Liu",
      "Liang Song",
      "Marc Pollefeys",
      "Hesheng Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2311.11278",
    "title": "Transcending Forgery Specificity with Latent Space Augmentation for  Generalizable Deepfake Detection",
    "abstract": " Title: Transcending Forgery Specificity with Latent Space Augmentation for  Generalizable Deepfake Detection ",
    "url": "https://arxiv.org/abs/2311.11278",
    "authors": [
      "Zhiyuan Yan",
      "Yuhao Luo",
      "Siwei Lyu",
      "Qingshan Liu",
      "Baoyuan Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.14097",
    "title": "ACT-Diffusion: Efficient Adversarial Consistency Training for One-step  Diffusion Models",
    "abstract": " Comments: To appear in CVPR 2024 ",
    "url": "https://arxiv.org/abs/2311.14097",
    "authors": [
      "Fei Kong",
      "Jinhao Duan",
      "Lichao Sun",
      "Hao Cheng",
      "Renjing Xu",
      "Hengtao Shen",
      "Xiaofeng Zhu",
      "Xiaoshuang Shi",
      "Kaidi Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.03160",
    "title": "HybridNeRF: Efficient Neural Rendering via Adaptive Volumetric Surfaces",
    "abstract": " Comments: CVPR 2024 Project page: this https URL ",
    "url": "https://arxiv.org/abs/2312.03160",
    "authors": [
      "Haithem Turki",
      "Vasu Agrawal",
      "Samuel Rota Bulò",
      "Lorenzo Porzi",
      "Peter Kontschieder",
      "Deva Ramanan",
      "Michael Zollhöfer",
      "Christian Richardt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.13936",
    "title": "GVE-Leiden: Fast Leiden Algorithm for Community Detection in Shared  Memory Setting",
    "abstract": " Comments: 12 pages, 10 figures, 1 table. arXiv admin note: substantial text overlap with arXiv:2312.04876 ",
    "url": "https://arxiv.org/abs/2312.13936",
    "authors": [
      "Subhajit Sahu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2312.14810",
    "title": "Accurate, scalable, and efficient Bayesian Optimal Experimental Design  with derivative-informed neural operators",
    "abstract": " Title: Accurate, scalable, and efficient Bayesian Optimal Experimental Design  with derivative-informed neural operators ",
    "url": "https://arxiv.org/abs/2312.14810",
    "authors": [
      "Jinwoo Go",
      "Peng Chen"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Optimization and Control (math.OC)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2401.00365",
    "title": "HQ-VAE: Hierarchical Discrete Representation Learning with Variational  Bayes",
    "abstract": " Comments: 34 pages with 17 figures, accepted for TMLR ",
    "url": "https://arxiv.org/abs/2401.00365",
    "authors": [
      "Yuhta Takida",
      "Yukara Ikemiya",
      "Takashi Shibuya",
      "Kazuki Shimada",
      "Woosung Choi",
      "Chieh-Hsin Lai",
      "Naoki Murata",
      "Toshimitsu Uesaka",
      "Kengo Uchida",
      "Wei-Hsiang Liao",
      "Yuki Mitsufuji"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.12214",
    "title": "Quality-Aware Hydraulic Control in Drinking Water Networks via  Controllability Proxies",
    "abstract": " Title: Quality-Aware Hydraulic Control in Drinking Water Networks via  Controllability Proxies ",
    "url": "https://arxiv.org/abs/2401.12214",
    "authors": [
      "Salma M. Elsherif",
      "Mohamad H. Kazma",
      "Ahmad F. Taha"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2402.02160",
    "title": "Data Poisoning for In-context Learning",
    "abstract": " Title: Data Poisoning for In-context Learning ",
    "url": "https://arxiv.org/abs/2402.02160",
    "authors": [
      "Pengfei He",
      "Han Xu",
      "Yue Xing",
      "Hui Liu",
      "Makoto Yamada",
      "Jiliang Tang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.08714",
    "title": "PRDP: Proximal Reward Difference Prediction for Large-Scale Reward  Finetuning of Diffusion Models",
    "abstract": " Comments: CVPR 2024. Project page: this https URL ",
    "url": "https://arxiv.org/abs/2402.08714",
    "authors": [
      "Fei Deng",
      "Qifei Wang",
      "Wei Wei",
      "Matthias Grundmann",
      "Tingbo Hou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.13492",
    "title": "Retrieval Helps or Hurts? A Deeper Dive into the Efficacy of Retrieval  Augmentation to Language Models",
    "abstract": " Comments: NAACL2024 (main) ",
    "url": "https://arxiv.org/abs/2402.13492",
    "authors": [
      "Seiji Maekawa",
      "Hayate Iso",
      "Sairam Gurajada",
      "Nikita Bhutani"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.17729",
    "title": "Towards Fairness-Aware Adversarial Learning",
    "abstract": " Comments: This work will appear in the CVPR 2024 conference proceedings ",
    "url": "https://arxiv.org/abs/2402.17729",
    "authors": [
      "Yanghao Zhang",
      "Tianle Zhang",
      "Ronghui Mu",
      "Xiaowei Huang",
      "Wenjie Ruan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.01121",
    "title": "OpenGraph: Towards Open Graph Foundation Models",
    "abstract": " Title: OpenGraph: Towards Open Graph Foundation Models ",
    "url": "https://arxiv.org/abs/2403.01121",
    "authors": [
      "Lianghao Xia",
      "Ben Kao",
      "Chao Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.02472",
    "title": "OffLanDat: A Community Based Implicit Offensive Language Dataset  Generated by Large Language Model Through Prompt Engineering",
    "abstract": " Title: OffLanDat: A Community Based Implicit Offensive Language Dataset  Generated by Large Language Model Through Prompt Engineering ",
    "url": "https://arxiv.org/abs/2403.02472",
    "authors": [
      "Amit Das",
      "Mostafa Rahgouy",
      "Dongji Feng",
      "Zheng Zhang",
      "Tathagata Bhattacharya",
      "Nilanjana Raychawdhary",
      "Mary Sandage",
      "Lauramarie Pope",
      "Gerry Dozier",
      "Cheryl Seals"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.05950",
    "title": "Classifying Objects in 3D Point Clouds Using Recurrent Neural Network: A  GRU LSTM Hybrid Approach",
    "abstract": " Title: Classifying Objects in 3D Point Clouds Using Recurrent Neural Network: A  GRU LSTM Hybrid Approach ",
    "url": "https://arxiv.org/abs/2403.05950",
    "authors": [
      "Ramin Mousa",
      "Mitra Khezli",
      "Mohamadreza Azadi",
      "Vahid Nikoofard",
      "Saba Hesaraki"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.07728",
    "title": "CAP: A General Algorithm for Online Selective Conformal Prediction with  FCR Control",
    "abstract": " Title: CAP: A General Algorithm for Online Selective Conformal Prediction with  FCR Control ",
    "url": "https://arxiv.org/abs/2403.07728",
    "authors": [
      "Yajie Bao",
      "Yuyang Huo",
      "Haojie Ren",
      "Changliang Zou"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2403.09412",
    "title": "OpenGraph: Open-Vocabulary Hierarchical 3D Graph Representation in  Large-Scale Outdoor Environments",
    "abstract": " Title: OpenGraph: Open-Vocabulary Hierarchical 3D Graph Representation in  Large-Scale Outdoor Environments ",
    "url": "https://arxiv.org/abs/2403.09412",
    "authors": [
      "Yinan Deng",
      "Jiahui Wang",
      "Jingyu Zhao",
      "Xinyu Tian",
      "Guangyan Chen",
      "Yi Yang",
      "Yufeng Yue"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.11505",
    "title": "COVID-19 detection from pulmonary CT scans using a novel EfficientNet  with attention mechanism",
    "abstract": " Title: COVID-19 detection from pulmonary CT scans using a novel EfficientNet  with attention mechanism ",
    "url": "https://arxiv.org/abs/2403.11505",
    "authors": [
      "Ramy Farag",
      "Parth Upadhyay",
      "Yixiang Gao",
      "Jacket Demby",
      "Katherin Garces Montoya",
      "Seyed Mohamad Ali Tousi",
      "Gbenga Omotara",
      "Guilherme DeSouza"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.11624",
    "title": "Dual-Channel Multiplex Graph Neural Networks for Recommendation",
    "abstract": " Title: Dual-Channel Multiplex Graph Neural Networks for Recommendation ",
    "url": "https://arxiv.org/abs/2403.11624",
    "authors": [
      "Xiang Li",
      "Chaofan Fu",
      "Zhongying Zhao",
      "Guanjie Zheng",
      "Chao Huang",
      "Junyu Dong",
      "Yanwei Yu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.12659",
    "title": "Graph Neural Networks for Carbon Dioxide Adsorption Prediction in  Aluminium-Exchanged Zeolites",
    "abstract": " Title: Graph Neural Networks for Carbon Dioxide Adsorption Prediction in  Aluminium-Exchanged Zeolites ",
    "url": "https://arxiv.org/abs/2403.12659",
    "authors": [
      "Marko Petković",
      "José Manuel Vicent-Luna",
      "Vlado Menkovski",
      "Sofía Calero"
    ],
    "subjectives": [
      "Materials Science (cond-mat.mtrl-sci)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.14302",
    "title": "SpikingResformer: Bridging ResNet and Vision Transformer in Spiking  Neural Networks",
    "abstract": " Comments: To be published in the 2024 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) ",
    "url": "https://arxiv.org/abs/2403.14302",
    "authors": [
      "Xinyu Shi",
      "Zecheng Hao",
      "Zhaofei Yu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.15955",
    "title": "Finding needles in a haystack: A Black-Box Approach to Invisible  Watermark Detection",
    "abstract": " Title: Finding needles in a haystack: A Black-Box Approach to Invisible  Watermark Detection ",
    "url": "https://arxiv.org/abs/2403.15955",
    "authors": [
      "Minzhou Pan",
      "Zhengting Wang",
      "Xin Dong",
      "Vikash Sehwag",
      "Lingjuan Lyu",
      "Xue Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.15981",
    "title": "Exploring Accurate 3D Phenotyping in Greenhouse through Neural Radiance  Fields",
    "abstract": " Title: Exploring Accurate 3D Phenotyping in Greenhouse through Neural Radiance  Fields ",
    "url": "https://arxiv.org/abs/2403.15981",
    "authors": [
      "Junhong Zhao",
      "Wei Ying",
      "Yaoqiang Pan",
      "Zhenfeng Yi",
      "Chao Chen",
      "Kewei Hu",
      "Hanwen Kang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.16097",
    "title": "Can Language Models Pretend Solvers? Logic Code Simulation with LLMs",
    "abstract": " Comments: 12 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2403.16097",
    "authors": [
      "Minyu Chen",
      "Guoqiang Li",
      "Ling-I Wu",
      "Ruibang Liu",
      "Yuxin Su",
      "Xi Chang",
      "Jianxin Xue"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Logic in Computer Science (cs.LO)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.16341",
    "title": "NonlinearSolve.jl: High-Performance and Robust Solvers for Systems of  Nonlinear Equations in Julia",
    "abstract": " Title: NonlinearSolve.jl: High-Performance and Robust Solvers for Systems of  Nonlinear Equations in Julia ",
    "url": "https://arxiv.org/abs/2403.16341",
    "authors": [
      "Avik Pal",
      "Flemming Holtorf",
      "Axel Larsson",
      "Torkel Loman",
      "Utkarsh",
      "Frank Schäefer",
      "Qingyu Qu",
      "Alan Edelman",
      "Chris Rackauckas"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2403.16451",
    "title": "DeepMachining: Online Prediction of Machining Errors of Lathe Machines",
    "abstract": " Title: DeepMachining: Online Prediction of Machining Errors of Lathe Machines ",
    "url": "https://arxiv.org/abs/2403.16451",
    "authors": [
      "Xiang-Li Lu",
      "Hwai-Jung Hsu",
      "Che-Wei Chou",
      "H. T. Kung",
      "Chen-Hsin Lee",
      "Sheng-Mao Cheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.16591",
    "title": "Deciphering the Interplay between Local Differential Privacy, Average  Bayesian Privacy, and Maximum Bayesian Privacy",
    "abstract": " Title: Deciphering the Interplay between Local Differential Privacy, Average  Bayesian Privacy, and Maximum Bayesian Privacy ",
    "url": "https://arxiv.org/abs/2403.16591",
    "authors": [
      "Xiaojin Zhang",
      "Yulin Fei",
      "Wei Chen",
      "Hai Jin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.16797",
    "title": "Privacy Preservation by Intermittent Transmission in Cooperative LQG  Control Systems",
    "abstract": " Title: Privacy Preservation by Intermittent Transmission in Cooperative LQG  Control Systems ",
    "url": "https://arxiv.org/abs/2403.16797",
    "authors": [
      "Wenhao Lin",
      "Yuqing Ni",
      "Wen Yang",
      "Chao Yang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.16898",
    "title": "Concerned with Data Contamination? Assessing Countermeasures in Code  Language Model",
    "abstract": " Comments: Adjust the format so that the layout looks better ",
    "url": "https://arxiv.org/abs/2403.16898",
    "authors": [
      "Jialun Cao",
      "Wuqi Zhang",
      "Shing-Chi Cheung"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.17210",
    "title": "CADGL: Context-Aware Deep Graph Learning for Predicting Drug-Drug  Interactions",
    "abstract": " Comments: 8 Pages, 4 Figures; In review ",
    "url": "https://arxiv.org/abs/2403.17210",
    "authors": [
      "Azmine Toushik Wasi",
      "Taki Hasan Rafi",
      "Raima Islam",
      "Serbetar Karlo",
      "Dong-Kyu Chae"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Biomolecules (q-bio.BM)",
      "Molecular Networks (q-bio.MN)"
    ]
  },
  {
    "id": "arXiv:2403.17458",
    "title": "Expectations Versus Reality: Evaluating Intrusion Detection Systems in  Practice",
    "abstract": " Comments: 10 pages ",
    "url": "https://arxiv.org/abs/2403.17458",
    "authors": [
      "Jake Hesford",
      "Daniel Cheng",
      "Alan Wan",
      "Larry Huynh",
      "Seungho Kim",
      "Hyoungshick Kim",
      "Jin B. Hong"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.17608",
    "title": "Fake or JPEG? Revealing Common Biases in Generated Image Detection  Datasets",
    "abstract": " Title: Fake or JPEG? Revealing Common Biases in Generated Image Detection  Datasets ",
    "url": "https://arxiv.org/abs/2403.17608",
    "authors": [
      "Patrick Grommelt",
      "Louis Weiss",
      "Franz-Josef Pfreundt",
      "Janis Keuper"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.17633",
    "title": "UADA3D: Unsupervised Adversarial Domain Adaptation for 3D Object  Detection with Sparse LiDAR and Large Domain Gaps",
    "abstract": " Title: UADA3D: Unsupervised Adversarial Domain Adaptation for 3D Object  Detection with Sparse LiDAR and Large Domain Gaps ",
    "url": "https://arxiv.org/abs/2403.17633",
    "authors": [
      "Maciej K Wozniak",
      "Mattias Hansson",
      "Marko Thiel",
      "Patric Jensfelt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.17740",
    "title": "All-in-One: Heterogeneous Interaction Modeling for Cold-Start Rating  Prediction",
    "abstract": " Comments: 14 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2403.17740",
    "authors": [
      "Shuheng Fang",
      "Kangfei Zhao",
      "Yu Rong",
      "Zhixun Li",
      "Jeffrey Xu Yu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.18339",
    "title": "H2ASeg: Hierarchical Adaptive Interaction and Weighting Network for  Tumor Segmentation in PET/CT Images",
    "abstract": " Comments: 10 pages,4 figures ",
    "url": "https://arxiv.org/abs/2403.18339",
    "authors": [
      "Jinpeng Lu",
      "Jingyun Chen",
      "Linghan Cai",
      "Songhan Jiang",
      "Yongbing Zhang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.18346",
    "title": "Quantifying and Mitigating Unimodal Biases in Multimodal Large Language  Models: A Causal Perspective",
    "abstract": " Title: Quantifying and Mitigating Unimodal Biases in Multimodal Large Language  Models: A Causal Perspective ",
    "url": "https://arxiv.org/abs/2403.18346",
    "authors": [
      "Meiqi Chen",
      "Yixin Cao",
      "Yan Zhang",
      "Chaochao Lu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.18479",
    "title": "Lightweight Embeddings for Graph Collaborative Filtering",
    "abstract": " Comments: Accepted by SIGIR '24 ",
    "url": "https://arxiv.org/abs/2403.18479",
    "authors": [
      "Xurong Liang",
      "Tong Chen",
      "Lizhen Cui",
      "Yang Wang",
      "Meng Wang",
      "Hongzhi Yin"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2403.18621",
    "title": "Performance Analysis of Integrated Sensing and Communication Networks  with Blockage Effects",
    "abstract": " Comments: Submitted to IEEE Transactions on Vehicular Technology ",
    "url": "https://arxiv.org/abs/2403.18621",
    "authors": [
      "Zezhong Sun",
      "Shi Yan",
      "Ning Jiang",
      "Jiaen Zhou",
      "Mugen Peng"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.18703",
    "title": "FPGA-Based Neural Thrust Controller for UAVs",
    "abstract": " Title: FPGA-Based Neural Thrust Controller for UAVs ",
    "url": "https://arxiv.org/abs/2403.18703",
    "authors": [
      "Sharif Azem",
      "David Scheunert",
      "Mengguang Li",
      "Jonas Gehrunger",
      "Kai Cui",
      "Christian Hochberger",
      "Heinz Koeppl"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.18755",
    "title": "Many-Objective Evolutionary Influence Maximization: Balancing Spread,  Budget, Fairness, and Time",
    "abstract": " Comments: To appear in Genetic and Evolutionary Computation Conference (GECCO 24 Companion), July 14 18, 2024, Melbourne, VIC, Australia. ACM, New York, NY, USA ",
    "url": "https://arxiv.org/abs/2403.18755",
    "authors": [
      "Elia Cunegatti",
      "Leonardo Lucio Custode",
      "Giovanni Iacca"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  }
]