[
  {
    "id": "arXiv:2107.04616",
    "title": "SITHCon: A neural network robust to variations in input scaling on the  time dimension",
    "abstract": "In machine learning, convolutional neural networks (CNNs) have been extremely influential in both computer vision and in recognizing patterns extended over time. In computer vision, part of the flexibility arises from the use of max-pooling operations over the convolutions to attain translation invariance. In the mammalian brain, neural representations of time use a set of temporal basis functions. Critically, these basis functions appear to be arranged in a geometric series such that the basis set is evenly distributed over logarithmic time. This paper introduces a Scale-Invariant Temporal History Convolution network (SITHCon) that uses a logarithmically-distributed temporal memory. A max-pool over a logarithmically-distributed temporal memory results in scale-invariance in time. We compare performance of SITHCon to a Temporal Convolution Network (TCN) and demonstrate that, although both networks can learn classification and regression problems on both univariate and multivariate time series $f(t)$, only SITHCon has the property that it generalizes without retraining to rescaled versions of the input $f(at)$. This property, inspired by findings from neuroscience and psychology, could lead to large-scale networks with dramatically different capabilities, including faster training and greater generalizability, even with significantly fewer free parameters. ",
    "url": "https://arxiv.org/abs/2107.04616",
    "authors": [
      "Brandon G. Jacques",
      "Zoran Tiganj",
      "Aakash Sarkar",
      "Marc W. Howard",
      "Per B. Sederberg"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.04654",
    "title": "Realizable piecewise linear paths of persistence diagrams with Reeb  graphs",
    "abstract": "Reeb graphs are widely used in a range of fields for the purposes of analyzing and comparing complex spaces via a simpler combinatorial object. Further, they are closely related to extended persistence diagrams, which largely but not completely encode the information of the Reeb graph. In this paper, we investigate the effect on the persistence diagram of a particular continuous operation on Reeb graphs; namely the (truncated) smoothing operation. This construction arises in the context of the Reeb graph interleaving distance, but separately from that viewpoint provides a simplification of the Reeb graph which continuously shrinks small loops. We then use this characterization to initiate the study of inverse problems for Reeb graphs using smoothing by showing which paths in persistence diagram space (commonly known as vineyards) can be realized by a path in the space of Reeb graphs via these simple operations. This allows us to solve the inverse problem on a certain family of piecewise linear vineyards when fixing an initial Reeb graph. ",
    "url": "https://arxiv.org/abs/2107.04654",
    "authors": [
      "Rehab Alharbi",
      "Erin Wolf Chambers",
      "Elizabeth Munch"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2107.04781",
    "title": "Formal context reduction in deriving concept hierarchies from corpora  using adaptive evolutionary clustering algorithm star",
    "abstract": "It is beneficial to automate the process of deriving concept hierarchies from corpora since a manual construction of concept hierarchies is typically a time-consuming and resource-intensive process. As such, the overall process of learning concept hierarchies from corpora encompasses a set of steps: parsing the text into sentences, splitting the sentences and then tokenising it. After the lemmatisation step, the pairs are extracted using FCA. However, there might be some uninteresting and erroneous pairs in the formal context. Generating formal context may lead to a time-consuming process, so formal context size reduction is required to remove uninterested and erroneous pairs, taking less time to extract the concept lattice and concept hierarchies accordingly. In this premise, this study aims to propose two frameworks: (1) A framework to review the current process of deriving concept hierarchies from corpus utilising FCA; (2) A framework to decrease the formal contexts ambiguity of the first framework using an adaptive version of ECA*. Experiments are conducted by applying 385 sample corpora from Wikipedia on the two frameworks to examine the reducing size of formal context, which leads to yield concept lattice and concept hierarchy. The resulting lattice of formal context is evaluated to the standard one using concept lattice-invariants. Accordingly, the homomorphic between the two lattices preserves the quality of resulting concept hierarchies by 89% in contrast to the basic ones, and the reduced concept lattice inherits the structural relation of the standard one. The adaptive ECA* is examined against its four counterpart baseline algorithms to measure the execution time on random datasets with different densities (fill ratios). The results show that adaptive ECA* performs concept lattice faster than other mentioned competitive techniques in different fill ratios. ",
    "url": "https://arxiv.org/abs/2107.04781",
    "authors": [
      "Bryar A. Hassan",
      "Tarik A. Rashid",
      "Seyedali Mirjalili"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2107.04798",
    "title": "Hamiltonicity: Variants and Generalization in $P_5$-free Chordal  Bipartite graphs",
    "abstract": "A bipartite graph is chordal bipartite if every cycle of length at least six has a chord in it. M$\\ddot{\\rm u}$ller \\cite {muller1996Hamiltonian} has shown that the Hamiltonian cycle problem is NP-complete on chordal bipartite graphs by presenting a polynomial-time reduction from the satisfiability problem. The microscopic view of the reduction instances reveals that the instances are $P_9$-free chordal bipartite graphs, and hence the status of Hamiltonicity in $P_8$-free chordal bipartite graphs is open. In this paper, we identify the first non-trivial subclass of $P_8$-free chordal bipartite graphs which is $P_5$-free chordal bipartite graphs, and present structural and algorithmic results on $P_5$-free chordal bipartite graphs. We investigate the structure of $P_5$-free chordal bipartite graphs and show that these graphs have a {\\em Nested Neighborhood Ordering (NNO)}, a special ordering among its vertices. Further, using this ordering, we present polynomial-time algorithms for classical problems such as the Hamiltonian cycle (path), also the variants and generalizations of the Hamiltonian cycle (path) problem. We also obtain polynomial-time algorithms for treewidth (pathwidth), and minimum fill-in in $P_5$-free chordal bipartite graph. We also present some results on complement graphs of $P_5$-free chordal bipartite graphs. ",
    "url": "https://arxiv.org/abs/2107.04798",
    "authors": [
      "S.Aadhavan",
      "R.Mahendra Kumar",
      "P.Renjith",
      "N.Sadagopan"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2107.05220",
    "title": "On the undecidability of the Panopticon detection problem",
    "abstract": "The Panopticon (which means \"watcher of everything\") is a well-known structure of continuous surveillance and discipline proposed by Bentham in 1785. This device was, later, used by Foucault and other philosophers as a paradigm and metaphor for the study of constitutional power and knowledge as well as a model of individuals' deprivation of freedom. Nowadays, technological achievements have given rise to new, non-physical (unlike prisons), means of constant surveillance that transcend physical boundaries. This, combined with the confession of some governmental institutions that they actually collaborate with these Internet giants to collect or deduce information about people, creates a worrisome situation of several co-existing Panopticons that can act separately or in close collaboration. Thus, they can only be detected and identified through the expense of (perhaps considerable) effort. In this paper we provide a theoretical framework for studying the detectability status of Panopticons that fall under two theoretical, but not unrealistic, definitions. We show, using Oracle Turing Machines, that detecting modern day, ICT-based, Panopticons is an undecidable problem. Furthermore, we show that for each sufficiently expressive formal system, we can effectively construct a Turing Machine for which it is impossible to prove, within the formal system, either that it is a Panopticon or it is not a Panopticon. ",
    "url": "https://arxiv.org/abs/2107.05220",
    "authors": [
      "Vasiliki Liagkou",
      "Panayotis Nastou",
      "Paul Spirakis",
      "Yannis Stamatiou"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2107.05243",
    "title": "Putting words into the system's mouth: A targeted attack on neural  machine translation using monolingual data poisoning",
    "abstract": "Neural machine translation systems are known to be vulnerable to adversarial test inputs, however, as we show in this paper, these systems are also vulnerable to training attacks. Specifically, we propose a poisoning attack in which a malicious adversary inserts a small poisoned sample of monolingual text into the training set of a system trained using back-translation. This sample is designed to induce a specific, targeted translation behaviour, such as peddling misinformation. We present two methods for crafting poisoned examples, and show that only a tiny handful of instances, amounting to only 0.02% of the training set, is sufficient to enact a successful attack. We outline a defence method against said attacks, which partly ameliorates the problem. However, we stress that this is a blind-spot in modern NMT, demanding immediate attention. ",
    "url": "https://arxiv.org/abs/2107.05243",
    "authors": [
      "Jun Wang",
      "Chang Xu",
      "Francisco Guzman",
      "Ahmed El-Kishky",
      "Yuqing Tang",
      "Benjamin I. P. Rubinstein",
      "Trevor Cohn"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2107.05298",
    "title": "HEMP: High-order Entropy Minimization for neural network comPression",
    "abstract": "We formulate the entropy of a quantized artificial neural network as a differentiable function that can be plugged as a regularization term into the cost function minimized by gradient descent. Our formulation scales efficiently beyond the first order and is agnostic of the quantization scheme. The network can then be trained to minimize the entropy of the quantized parameters, so that they can be optimally compressed via entropy coding. We experiment with our entropy formulation at quantizing and compressing well-known network architectures over multiple datasets. Our approach compares favorably over similar methods, enjoying the benefits of higher order entropy estimate, showing flexibility towards non-uniform quantization (we use Lloyd-max quantization), scalability towards any entropy order to be minimized and efficiency in terms of compression. We show that HEMP is able to work in synergy with other approaches aiming at pruning or quantizing the model itself, delivering significant benefits in terms of storage size compressibility without harming the model's performance. ",
    "url": "https://arxiv.org/abs/2107.05298",
    "authors": [
      "Enzo Tartaglione",
      "Stéphane Lathuilière",
      "Attilio Fiandrotti",
      "Marco Cagnazzo",
      "Marco Grangetto"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2107.05424",
    "title": "Plasmonic nonvolatile memory crossbar arrays for artificial neural  networks",
    "abstract": "Here it is proposed a three-dimensional plasmonic nonvolatile memory crossbar arrays that can ensure a dual-mode operation in electrical and optical domains. This can be realized through plasmonics that serves as a bridge between photonics and electronics as the metal electrode is part of the waveguide. The proposed arrangement is based on low-loss long-range dielectric-loaded surface plasmon polariton waveguide where a metal stripe is placed between a buffer layer and ridge. To achieve a dual-mode operation the materials were defined that can provide both electrical and optical modulation functionality. ",
    "url": "https://arxiv.org/abs/2107.05424",
    "authors": [
      "Jacek Gosciniak"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2107.05434",
    "title": "Polynomial-time algorithm for Maximum Independent Set in bounded-degree  graphs with no long induced claws",
    "abstract": "For graphs $G$ and $H$, we say that $G$ is $H$-free if it does not contain $H$ as an induced subgraph. Already in the early 1980s Alekseev observed that if $H$ is connected, then the \\textsc{Max Weight Independent Set} problem (MWIS) remains \\textsc{NP}-hard in $H$-free graphs, unless $H$ is a path or a subdivided claw, i.e., a graph obtained from the three-leaf star by subdividing each edge some number of times (possibly zero). Since then determining the complexity of MWIS in these remaining cases is one of the most important problems in algorithmic graph theory. A general belief is that the problem is polynomial-time solvable, which is witnessed by algorithmic results for graphs excluding some small paths or subdivided claws. A more conclusive evidence was given by the recent breakthrough result by Gartland and Lokshtanov [FOCS 2020]: They proved that MWIS can be solved in quasipolynomial time in $H$-free graphs, where $H$ is any fixed path. If $H$ is an arbitrary subdivided claw, we know much less: The problem admits a QPTAS and a subexponential-time algorithm [Chudnovsky et al., SODA 2019]. In this paper we make an important step towards solving the problem by showing that for any subdivided claw $H$, MWIS is polynomial-time solvable in $H$-free graphs of bounded degree. ",
    "url": "https://arxiv.org/abs/2107.05434",
    "authors": [
      "Tara Abrishami",
      "Maria Chudnovsky",
      "Cemil Dibek",
      "Paweł Rzążewski"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2107.05465",
    "title": "Priority prediction of Asian Hornet sighting report using machine  learning methods",
    "abstract": "As infamous invaders to the North American ecosystem, the Asian giant hornet (Vespa mandarinia) is devastating not only to native bee colonies, but also to local apiculture. One of the most effective way to combat the harmful species is to locate and destroy their nests. By mobilizing the public to actively report possible sightings of the Asian giant hornet, the governmentcould timely send inspectors to confirm and possibly destroy the nests. However, such confirmation requires lab expertise, where manually checking the reports one by one is extremely consuming of human resources. Further given the limited knowledge of the public about the Asian giant hornet and the randomness of report submission, only few of the numerous reports proved positive, i.e. existing nests. How to classify or prioritize the reports efficiently and automatically, so as to determine the dispatch of personnel, is of great significance to the control of the Asian giant hornet. In this paper, we propose a method to predict the priority of sighting reports based on machine learning. We model the problem of optimal prioritization of sighting reports as a problem of classification and prediction. We extracted a variety of rich features in the report: location, time, image(s), and textual description. Based on these characteristics, we propose a classification model based on logistic regression to predict the credibility of a certain report. Furthermore, our model quantifies the impact between reports to get the priority ranking of the reports. Extensive experiments on the public dataset from the WSDA (the Washington State Department of Agriculture) have proved the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2107.05465",
    "authors": [
      "Yixin Liu",
      "Jiaxin Guo",
      "Jieyang Dong",
      "Luoqian Jiang",
      "Haoyuan Ouyang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2107.05489",
    "title": "Comparing seven methods for state-of-health time series prediction for  the lithium-ion battery packs of forklifts",
    "abstract": "A key aspect for the forklifts is the state-of-health (SoH) assessment to ensure the safety and the reliability of uninterrupted power source. Forecasting the battery SoH well is imperative to enable preventive maintenance and hence to reduce the costs. This paper demonstrates the capabilities of gradient boosting regression for predicting the SoH timeseries under circumstances when there is little prior information available about the batteries. We compared the gradient boosting method with light gradient boosting, extra trees, extreme gradient boosting, random forests, long short-term memory networks and with combined convolutional neural network and long short-term memory networks methods. We used multiple predictors and lagged target signal decomposition results as additional predictors and compared the yielded prediction results with different sets of predictors for each method. For this work, we are in possession of a unique data set of 45 lithium-ion battery packs with large variation in the data. The best model that we derived was validated by a novel walk-forward algorithm that also calculates point-wise confidence intervals for the predictions; we yielded reasonable predictions and confidence intervals for the predictions. Furthermore, we verified this model against five other lithium-ion battery packs; the best model generalised to greater extent to this set of battery packs. The results about the final model suggest that we were able to enhance the results in respect to previously developed models. Moreover, we further validated the model for extracting cycle counts presented in our previous work with data from new forklifts; their battery packs completed around 3000 cycles in a 10-year service period, which corresponds to the cycle life for commercial Nickel-Cobalt-Manganese (NMC) cells. ",
    "url": "https://arxiv.org/abs/2107.05489",
    "authors": [
      "Matti Huotari",
      "Shashank Arora",
      "Avleen Malhi",
      "Kary Främling"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.05532",
    "title": "Context-aware virtual adversarial training for anatomically-plausible  segmentation",
    "abstract": "Despite their outstanding accuracy, semi-supervised segmentation methods based on deep neural networks can still yield predictions that are considered anatomically impossible by clinicians, for instance, containing holes or disconnected regions. To solve this problem, we present a Context-aware Virtual Adversarial Training (CaVAT) method for generating anatomically plausible segmentation. Unlike approaches focusing solely on accuracy, our method also considers complex topological constraints like connectivity which cannot be easily modeled in a differentiable loss function. We use adversarial training to generate examples violating the constraints, so the network can learn to avoid making such incorrect predictions on new examples, and employ the Reinforce algorithm to handle non-differentiable segmentation constraints. The proposed method offers a generic and efficient way to add any constraint on top of any segmentation network. Experiments on two clinically-relevant datasets show our method to produce segmentations that are both accurate and anatomically-plausible in terms of region connectivity. ",
    "url": "https://arxiv.org/abs/2107.05532",
    "authors": [
      "Ping Wang",
      "Jizong Peng",
      "Marco Pedersoli",
      "Yuanfeng Zhou",
      "Caiming Zhang",
      "Christian Desrosiers"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.05023",
    "title": "NeoUNet: Towards accurate colon polyp segmentation and neoplasm  detection",
    "abstract": "Automatic polyp segmentation has proven to be immensely helpful for endoscopy procedures, reducing the missing rate of adenoma detection for endoscopists while increasing efficiency. However, classifying a polyp as being neoplasm or not and segmenting it at the pixel level is still a challenging task for doctors to perform in a limited time. In this work, we propose a fine-grained formulation for the polyp segmentation problem. Our formulation aims to not only segment polyp regions, but also identify those at high risk of malignancy with high accuracy. In addition, we present a UNet-based neural network architecture called NeoUNet, along with a hybrid loss function to solve this problem. Experiments show highly competitive results for NeoUNet on our benchmark dataset compared to existing polyp segmentation models. ",
    "url": "https://arxiv.org/abs/2107.05023",
    "authors": [
      "Phan Ngoc Lan",
      "Nguyen Sy An",
      "Dao Viet Hang",
      "Dao Van Long",
      "Tran Quang Trung",
      "Nguyen Thi Thuy",
      "Dinh Viet Sang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.05056",
    "title": "T-s3ra: traffic-aware scheduling for secure slicing and resource  allocation in sdn/nfv enabled 5g networks",
    "abstract": "Network slicing and resource allocation play pivotal roles in software-defined network (SDN)/network function virtualization (NFV)-assisted 5G networks. In 5G communications, the traffic rate is high, necessitating high data rates and low latency. Deep learning is a potential solution for overcoming these constraints. Secure slicing avoids resource wastage; however, DDoS attackers can exploit the sliced network. Therefore, we focused on secure slicing with resource allocation under massive network traffic. Traffic-aware scheduling is proposed for secure slicing and resource allocation over SDN/NFV-enabled 5G networks. In this approach (T-S3RA), user devices are authenticated using Boolean logic with a password-based key derivation function. The traffic is scheduled in 5G access points, and secure network slicing and resource allocation are implemented using deep learning models such as SliceNet and HopFieldNet, respectively. To predict DDoS attackers, we computed the Renyi entropy for packet classification. Experiments were conducted using a network simulator with 250 nodes in the network topology. Performance was evaluated using metrics such as throughput, latency, packet transmission ratio, packet loss ratio, slice capacity, bandwidth consumption, and slice acceptance ratio. T-S3RA was implemented in three 5G use cases with different requirements including massive machine-type communication, ultrareliable low-latency communication, and enhanced mobile broadband. ",
    "url": "https://arxiv.org/abs/2107.05056",
    "authors": [
      "Ali J. Ramadhan"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2107.05222",
    "title": "Perceptual-based deep-learning denoiser as a defense against adversarial  attacks on ASR systems",
    "abstract": "In this paper we investigate speech denoising as a defense against adversarial attacks on automatic speech recognition (ASR) systems. Adversarial attacks attempt to force misclassification by adding small perturbations to the original speech signal. We propose to counteract this by employing a neural-network based denoiser as a pre-processor in the ASR pipeline. The denoiser is independent of the downstream ASR model, and thus can be rapidly deployed in existing systems. We found that training the denoisier using a perceptually motivated loss function resulted in increased adversarial robustness without compromising ASR performance on benign samples. Our defense was evaluated (as a part of the DARPA GARD program) on the 'Kenansville' attack strategy across a range of attack strengths and speech samples. An average improvement in Word Error Rate (WER) of about 7.7% was observed over the undefended model at 20 dB signal-to-noise-ratio (SNR) attack strength. ",
    "url": "https://arxiv.org/abs/2107.05222",
    "authors": [
      "Anirudh Sreeram",
      "Nicholas Mehlman",
      "Raghuveer Peri",
      "Dillon Knox",
      "Shrikanth Narayanan"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2107.05527",
    "title": "Collective intelligence and the blockchain: Technology, communities and  social experiments",
    "abstract": "Blockchains are still perceived chiefly as a new technology. But each blockchain is also a community and a social experiment, built around social consensus. Here I discuss three examples showing how collective intelligence can help, threat or capitalize on blockchain-based ecosystems. They concern the immutability of smart contracts, code transparency and new forms of property. The examples show that more research, new norms and, eventually, laws are needed to manage the interaction between collective behaviour and the blockchain technology. Insights from researchers in collective intelligence can help society rise up to the challenge. ",
    "url": "https://arxiv.org/abs/2107.05527",
    "authors": [
      "Andrea Baronchelli"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computers and Society (cs.CY)",
      "General Economics (econ.GN)"
    ]
  },
  {
    "id": "arXiv:2107.05595",
    "title": "Coloring graphs with forbidden bipartite subgraphs",
    "abstract": "A conjecture of Alon, Krivelevich, and Sudakov states that, for any graph $F$, there is a constant $c_F > 0$ such that if $G$ is an $F$-free graph of maximum degree $\\Delta$, then $\\chi(G) \\leq c_F \\Delta / \\log\\Delta$. It follows from work by Davies, Kang, Pirot, and Sereni that this conjecture holds for $F$ bipartite; moreover, if $G$ is $K_{t,t}$-free, then $\\chi(G) \\leq (t + o(1)) \\Delta / \\log\\Delta$ as $\\Delta \\to \\infty$. We improve this bound to $(1+o(1)) \\Delta/\\log \\Delta$, making the constant factor independent of $t$. We further extend our result to the DP-coloring setting (also known as correspondence coloring), introduced by Dvo\\v{r}\\'ak and Postle. ",
    "url": "https://arxiv.org/abs/2107.05595",
    "authors": [
      "James Anderson",
      "Anton Bernshteyn",
      "Abhishek Dhawan"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:1912.09004",
    "title": "Online route choice modeling for Mobility-as-a-Service networks with  non-separable, congestible link capacity effects",
    "abstract": " Title: Online route choice modeling for Mobility-as-a-Service networks with  non-separable, congestible link capacity effects ",
    "url": "https://arxiv.org/abs/1912.09004",
    "authors": [
      "Susan Jia Xu",
      "Joseph Y. J. Chow"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2008.00997",
    "title": "Segmenting overlapped cell clusters in biomedical images by concave  point detection",
    "abstract": " Title: Segmenting overlapped cell clusters in biomedical images by concave  point detection ",
    "url": "https://arxiv.org/abs/2008.00997",
    "authors": [
      "Miquel Miró-Nicolau",
      "Biel Moyà-Alcover",
      "Manuel González-Hidalgo",
      "Antoni Jaume-i-Capó"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2009.03675",
    "title": "Space efficient merging of de Bruijn graphs and Wheeler graphs",
    "abstract": " Comments: 24 pages, 10 figures. arXiv admin note: text overlap with arXiv:1902.02889 ",
    "url": "https://arxiv.org/abs/2009.03675",
    "authors": [
      "Lavinia Egidi",
      "Felipe A. Louza",
      "Giovanni Manzini"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2009.11948",
    "title": "Compressive spectral image classification using 3D coded convolutional  neural network",
    "abstract": " Title: Compressive spectral image classification using 3D coded convolutional  neural network ",
    "url": "https://arxiv.org/abs/2009.11948",
    "authors": [
      "Hao Zhang",
      "Xu Ma",
      "Xianhong Zhao",
      "Gonzalo R. Arce"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2010.05463",
    "title": "Power law dynamics in genealogical graphs",
    "abstract": " Title: Power law dynamics in genealogical graphs ",
    "url": "https://arxiv.org/abs/2010.05463",
    "authors": [
      "Francisco Leonardo Bezerra Martins",
      "José Cláudio do Nascimento"
    ],
    "subjectives": [
      "Computation (stat.CO)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Data Analysis, Statistics and Probability (physics.data-an)"
    ]
  },
  {
    "id": "arXiv:2010.12637",
    "title": "Comparative analysis of word embeddings in assessing semantic similarity  of complex sentences",
    "abstract": " Comments: 14 pages, 6 figures, submitted to IEEE Access ",
    "url": "https://arxiv.org/abs/2010.12637",
    "authors": [
      "Dhivya Chandrasekaran",
      "Vijay Mago"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2011.08464",
    "title": "Exploring intermediate representation for monocular vehicle pose  estimation",
    "abstract": " Comments: CVPR 2021 with supplementary materials ",
    "url": "https://arxiv.org/abs/2011.08464",
    "authors": [
      "Shichao Li",
      "Zengqiang Yan",
      "Hongyang Li",
      "Kwang-Ting Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2102.01807",
    "title": "Building population models for large-scale neural recordings:  opportunities and pitfalls",
    "abstract": " Title: Building population models for large-scale neural recordings:  opportunities and pitfalls ",
    "url": "https://arxiv.org/abs/2102.01807",
    "authors": [
      "Cole Hurwitz",
      "Nina Kudryashova",
      "Arno Onken",
      "Matthias H. Hennig"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2103.08659",
    "title": "Function approximation by deep neural networks with parameters $\\{0,\\pm  \\frac{1}{2}, \\pm 1, 2\\}$",
    "abstract": " Title: Function approximation by deep neural networks with parameters $\\{0,\\pm  \\frac{1}{2}, \\pm 1, 2\\}$ ",
    "url": "https://arxiv.org/abs/2103.08659",
    "authors": [
      "Aleksandr Beknazaryan"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2104.06301",
    "title": "Position-based cryptography: Single-qubit protocol secure against  multi-qubit attacks",
    "abstract": " Comments: 26 pages, 4 figures. Content significantly expanded. In particular, we have added the function BB84 protocol and prove its security in Section 4. Finally, we give lower bounds for concrete functions in Section 6 ",
    "url": "https://arxiv.org/abs/2104.06301",
    "authors": [
      "Andreas Bluhm",
      "Matthias Christandl",
      "Florian Speelman"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2104.10683",
    "title": "Explainable artificial intelligence for mechanics: physics-informing  neural networks for constitutive models",
    "abstract": " Comments: Preprint - Rev-2 (minor grammatical changes; prevent Google from archiving) ",
    "url": "https://arxiv.org/abs/2104.10683",
    "authors": [
      "Arnd Koeppe",
      "Franz Bamer",
      "Michael Selzer",
      "Britta Nestler",
      "Bernd Markert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2105.11781",
    "title": "A unified framework based on graph consensus term for multi-view  learning",
    "abstract": " Title: A unified framework based on graph consensus term for multi-view  learning ",
    "url": "https://arxiv.org/abs/2105.11781",
    "authors": [
      "Xiangzhu Meng",
      "Lin Feng",
      "Chonghui Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.13786",
    "title": "Data efficiency in graph networks through equivariance",
    "abstract": " Comments: Presented at the ICML 2021 Workshop on Subset Selection in Machine Learning: From Theory to Practice. arXiv admin note: text overlap with arXiv:2105.14058 ",
    "url": "https://arxiv.org/abs/2106.13786",
    "authors": [
      "Francesco Farina",
      "Emma Slade"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.14473",
    "title": "Error analysis for physics informed neural networks (PINNs)  approximating Kolmogorov PDEs",
    "abstract": " Title: Error analysis for physics informed neural networks (PINNs)  approximating Kolmogorov PDEs ",
    "url": "https://arxiv.org/abs/2106.14473",
    "authors": [
      "Tim De Ryck",
      "Siddhartha Mishra"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.15240",
    "title": "Towards self-organized control: Using neural cellular automata to  robustly control a cart-pole agent",
    "abstract": " Title: Towards self-organized control: Using neural cellular automata to  robustly control a cart-pole agent ",
    "url": "https://arxiv.org/abs/2106.15240",
    "authors": [
      "Alexandre Variengien",
      "Stefano Nichele",
      "Tom Glover",
      "Sidney Pontes-Filho"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  }
]