[
  {
    "id": "arXiv:2107.06330",
    "title": "Multi-variance replica exchange stochastic gradient MCMC for inverse and  forward Bayesian physics-informed neural network",
    "abstract": "Physics-informed neural network (PINN) has been successfully applied in solving a variety of nonlinear non-convex forward and inverse problems. However, the training is challenging because of the non-convex loss functions and the multiple optima in the Bayesian inverse problem. In this work, we propose a multi-variance replica exchange stochastic gradient Langevin diffusion method to tackle the challenge of the multiple local optima in the optimization and the challenge of the multiple modal posterior distribution in the inverse problem. Replica exchange methods are capable of escaping from the local traps and accelerating the convergence. However, it may not be efficient to solve mathematical inversion problems by using the vanilla replica method directly since the method doubles the computational cost in evaluating the forward solvers (likelihood functions) in the two chains. To address this issue, we propose to make different assumptions on the energy function estimation and this facilities one to use solvers of different fidelities in the likelihood function evaluation. We give an unbiased estimate of the swapping rate and give an estimation of the discretization error of the scheme. To verify our idea, we design and solve four inverse problems which have multiple modes. The proposed method is also employed to train the Bayesian PINN to solve the forward and inverse problems; faster and more accurate convergence has been observed when compared to the stochastic gradient Langevin diffusion (SGLD) method and vanila replica exchange methods. ",
    "url": "https://arxiv.org/abs/2107.06330",
    "authors": [
      "Guang Lin",
      "Yating Wang",
      "Zecheng Zhang"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2107.06386",
    "title": "Geometry and Generalization: Eigenvalues as predictors of where a  network will fail to generalize",
    "abstract": "We study the deformation of the input space by a trained autoencoder via the Jacobians of the trained weight matrices. In doing so, we prove bounds for the mean squared errors for points in the input space, under assumptions regarding the orthogonality of the eigenvectors. We also show that the trace and the product of the eigenvalues of the Jacobian matrices is a good predictor of the MSE on test points. This is a dataset independent means of testing an autoencoder's ability to generalize on new input. Namely, no knowledge of the dataset on which the network was trained is needed, only the parameters of the trained model. ",
    "url": "https://arxiv.org/abs/2107.06386",
    "authors": [
      "Susama Agarwala",
      "Benjamin Dees",
      "Andrew Gearhart",
      "Corey Lowman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Differential Geometry (math.DG)"
    ]
  },
  {
    "id": "arXiv:2107.06445",
    "title": "MSFNet:Multi-scale features network for monocular depth estimation",
    "abstract": "In recent years, monocular depth estimation is applied to understand the surrounding 3D environment and has made great progress. However, there is an ill-posed problem on how to gain depth information directly from a single image. With the rapid development of deep learning, this problem is possible to be solved. Although more and more approaches are proposed one after another, most of existing methods inevitably lost details due to continuous downsampling when mapping from RGB space to depth space. To the end, we design a Multi-scale Features Network (MSFNet), which consists of Enhanced Diverse Attention (EDA) module and Upsample-Stage Fusion (USF) module. The EDA module employs the spatial attention method to learn significant spatial information, while USF module complements low-level detail information with high-level semantic information from the perspective of multi-scale feature fusion to improve the predicted effect. In addition, since the simple samples are always trained to a better effect first, the hard samples are difficult to converge. Therefore, we design a batch-loss to assign large loss factors to the harder samples in a batch. Experiments on NYU-Depth V2 dataset and KITTI dataset demonstrate that our proposed approach is more competitive with the state-of-the-art methods in both qualitative and quantitative evaluation. ",
    "url": "https://arxiv.org/abs/2107.06445",
    "authors": [
      "Meiqi Pei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.06657",
    "title": "DeepMutants: Training neural bug detectors with contextual mutations",
    "abstract": "Learning-based bug detectors promise to find bugs in large code bases by exploiting natural hints such as names of variables and functions or comments. Still, existing techniques tend to underperform when presented with realistic bugs. We believe bug detector learning to currently suffer from a lack of realistic defective training examples. In fact, real world bugs are scarce which has driven existing methods to train on artificially created and mostly unrealistic mutants. In this work, we propose a novel contextual mutation operator which incorporates knowledge about the mutation context to dynamically inject natural and more realistic faults into code. Our approach employs a masked language model to produce a context-dependent distribution over feasible token replacements. The evaluation shows that sampling from a language model does not only produce mutants which more accurately represent real bugs but also lead to better performing bug detectors, both on artificial benchmarks and on real world source code. ",
    "url": "https://arxiv.org/abs/2107.06657",
    "authors": [
      "Cedric Richter",
      "Heike Wehrheim"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.06667",
    "title": "Polarization and coherence in mean field games driven by private and  social utility",
    "abstract": "We study a mean field game in continuous time over a finite horizon, T, where the state of each agent is binary and where players base their strategic decisions on two, possibly competing, factors: the willingness to align with the majority (conformism) and the aspiration of sticking with the own type (stubbornness). We also consider a quadratic cost related to the rate at which a change in the state happens: changing opinion may be a costly operation. Depending on the parameters of the model, the game may have more than one Nash equilibrium, even though the corresponding N-player game does not. Moreover, it exhibits a very rich phase diagram, where polarized/unpolarized, coherent/incoherent equilibria may coexist, except for T small, where the equilibrium is always unique. We fully describe such phase diagram in closed form and provide a detailed numerical analysis of the N-player counterpart of the mean field game. In this finite dimensional setting, the equilibrium selected by the population of players is always coherent (favoring the subpopulation whose type is aligned with the initial condition), but it does not necessarily minimize the cost functional. Rather, it seems that, among the coherent ones, the equilibrium prevailing is the one that most benefits the underdog subpopulation forced to change opinion. ",
    "url": "https://arxiv.org/abs/2107.06667",
    "authors": [
      "Dai Pra Paolo",
      "Sartori Elena",
      "Tolotti Marco"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2107.06695",
    "title": "Solving discrete constrained problems on de Rham complex",
    "abstract": "The main difficulty is solving the discrete constrained problem is its poor and even ill condition. In this paper, we transform the discrete constrained problems on de Rham complex to Laplace-like problems. This transformation not only make the constrained problems solvable, but also make it easy to use the existing iterative methods and preconditioning techniques to solving large-scale discrete constrained problems. ",
    "url": "https://arxiv.org/abs/2107.06695",
    "authors": [
      "Zhongjie Lu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2107.06507",
    "title": "Deep learning based parameter search for an agent based social network  model",
    "abstract": "Interactions between humans give rise to complex social networks that are characterized by heterogeneous degree distribution, weight-topology relation, overlapping community structure, and dynamics of links. Understanding such networks is a primary goal of science due to serving as the scaffold for many emergent social phenomena from disease spreading to political movements. An appropriate tool for studying them is agent-based modeling, in which nodes, representing persons, make decisions about creating and deleting links, thus yielding various macroscopic behavioral patterns. Here we focus on studying a generalization of the weighted social network model, being one of the most fundamental agent-based models for describing the formation of social ties and social networks. This Generalized Weighted Social Network (GWSN) model incorporates triadic closure, homophilic interactions, and various link termination mechanisms, which have been studied separately in the previous works. Accordingly, the GWSN model has an increased number of input parameters and the model behavior gets excessively complex, making it challenging to clarify the model behavior. We have executed massive simulations with a supercomputer and using the results as the training data for deep neural networks to conduct regression analysis for predicting the properties of the generated networks from the input parameters. The obtained regression model was also used for global sensitivity analysis to identify which parameters are influential or insignificant. We believe that this methodology is applicable for a large class of complex network models, thus opening the way for more realistic quantitative agent-based modeling. ",
    "url": "https://arxiv.org/abs/2107.06507",
    "authors": [
      "Yohsuke Murase",
      "Hang-Hyun Jo",
      "János Török",
      "János Kertész",
      "Kimmo Kaski"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2107.06621",
    "title": "Rough McKean-Vlasov dynamics for robust ensemble Kalman filtering",
    "abstract": "Motivated by the challenge of incorporating data into misspecified and multiscale dynamical models, we study a McKean-Vlasov equation that contains the data stream as a common driving rough path. This setting allows us to prove well-posedness as well as continuity with respect to the driver in an appropriate rough-path topology. The latter property is key in our subsequent development of a robust data assimilation methodology: We establish propagation of chaos for the associated interacting particle system, which in turn is suggestive of a numerical scheme that can be viewed as an extension of the ensemble Kalman filter to a rough-path framework. Finally, we discuss a data-driven method based on subsampling to construct suitable rough path lifts and demonstrate the robustness of our scheme in a number of numerical experiments related to parameter estimation problems in multiscale contexts. ",
    "url": "https://arxiv.org/abs/2107.06621",
    "authors": [
      "Michele Coghi",
      "Torstein Nilssen",
      "Nikolas Nüsken"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Numerical Analysis (math.NA)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2107.06773",
    "title": "Relational graph convolutional networks for predicting blood-brain  barrier penetration of drug molecules",
    "abstract": "The evaluation of the BBB penetrating ability of drug molecules is a critical step in brain drug development. Computational prediction based on machine learning has proved to be an efficient way to conduct the evaluation. However, performance of the established models has been limited by their incapability of dealing with the interactions between drugs and proteins, which play an important role in the mechanism behind BBB penetrating behaviors. To address this issue, we employed the relational graph convolutional network (RGCN) to handle the drug-protein (denoted by the encoding gene) relations as well as the features of each individual drug. In addition, drug-drug similarity was also introduced to connect structurally similar drugs in the graph. The RGCN model was initially trained without input of any drug features. And the performance was already promising, demonstrating the significant role of the drug-protein/drug-drug relations in the prediction of BBB permeability. Moreover, molecular embeddings from a pre-trained knowledge graph were used as the drug features to further enhance the predictive ability of the model. Finally, the best performing RGCN model was built with a large number of unlabeled drugs integrated into the graph. ",
    "url": "https://arxiv.org/abs/2107.06773",
    "authors": [
      "Yan Ding",
      "Xiaoqian Jiang",
      "Yejin Kim"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:1912.10419",
    "title": "Link prediction in dynamic networks using random dot product graphs",
    "abstract": " Title: Link prediction in dynamic networks using random dot product graphs ",
    "url": "https://arxiv.org/abs/1912.10419",
    "authors": [
      "Francesco Sanna Passino",
      "Anna S. Bertiger",
      "Joshua C. Neil",
      "Nicholas A. Heard"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2105.02065",
    "title": "Auxiliary iterative schemes for the discrete operators on de Rham  complex",
    "abstract": " Title: Auxiliary iterative schemes for the discrete operators on de Rham  complex ",
    "url": "https://arxiv.org/abs/2105.02065",
    "authors": [
      "Zhongjie Lu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2107.06104",
    "title": "Functional Magnetic Resonance Imaging data augmentation through  conditional ICA",
    "abstract": " Comments: 14 pages, 5 figures, 7 tables ",
    "url": "https://arxiv.org/abs/2107.06104",
    "authors": [
      "Badr Tajini",
      "Hugo Richard",
      "Bertrand Thirion"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  }
]