[
  {
    "id": "arXiv:2206.13508",
    "title": "Data Augmentation techniques in time series domain: A survey and  taxonomy",
    "abstract": "With the latest advances in deep learning generative models, it has not taken long to take advantage of their remarkable performance in the area of time series. Deep neural networks used to work with time series depend heavily on the breadth and consistency of the datasets used in training. These types of characteristic are not usually abundant in the real world, where they are usually limited and often with privacy constraints that must be guaranteed. Therefore, an effective way is to increase the number of data using \\gls{da} techniques, either by adding noise or permutations and by generating new synthetic data. It is systematically review the current state-of-the-art in the area to provide an overview of all available algorithms and proposes a taxonomy of the most relevant researches. The efficiency of the different variants will be evaluated; as a vital part of the process, the different metrics to evaluate the performance and the main problems concerning each model will be analysed. The ultimate goal of this study is to provide a summary of the evolution and performance of areas that produce better results to guide future researchers in this field. ",
    "url": "https://arxiv.org/abs/2206.13508",
    "authors": [
      "Edgar Talavera",
      "Guillermo Iglesias",
      "Ángel González-Prieto",
      "Alberto Mozo",
      "Sandra Gómez-Canaval"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.13510",
    "title": "Structural Entropy Guided Graph Hierarchical Pooling",
    "abstract": "Following the success of convolution on non-Euclidean space, the corresponding pooling approaches have also been validated on various tasks regarding graphs. However, because of the fixed compression quota and stepwise pooling design, these hierarchical pooling methods still suffer from local structure damage and suboptimal problem. In this work, inspired by structural entropy, we propose a hierarchical pooling approach, SEP, to tackle the two issues. Specifically, without assigning the layer-specific compression quota, a global optimization algorithm is designed to generate the cluster assignment matrices for pooling at once. Then, we present an illustration of the local structure damage from previous methods in the reconstruction of ring and grid synthetic graphs. In addition to SEP, we further design two classification models, SEP-G and SEP-N for graph classification and node classification, respectively. The results show that SEP outperforms state-of-the-art graph pooling methods on graph classification benchmarks and obtains superior performance on node classifications. ",
    "url": "https://arxiv.org/abs/2206.13510",
    "authors": [
      "Junran Wu",
      "Xueyuan Chen",
      "Ke Xu",
      "Shangzhe Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13585",
    "title": "Heterogeneous mixtures of dictionary functions to approximate subspace  invariance in Koopman operators",
    "abstract": "Koopman operators model nonlinear dynamics as a linear dynamic system acting on a nonlinear function as the state. This nonstandard state is often called a Koopman observable and is usually approximated numerically by a superposition of functions drawn from a \\textit{dictionary}. A widely used algorithm, is \\textit{Extended Dynamic Mode Decomposition}, where the dictionary functions are drawn from a fixed, homogeneous class of functions. Recently, deep learning combined with EDMD has been used to learn novel dictionary functions in an algorithm called deep dynamic mode decomposition (deepDMD). The learned representation both (1) accurately models and (2) scales well with the dimension of the original nonlinear system. In this paper we analyze the learned dictionaries from deepDMD and explore the theoretical basis for their strong performance. We discover a novel class of dictionary functions to approximate Koopman observables. Error analysis of these dictionary functions show they satisfy a property of subspace approximation, which we define as uniform finite approximate closure. We discover that structured mixing of heterogeneous dictionary functions drawn from different classes of nonlinear functions achieve the same accuracy and dimensional scaling as deepDMD. This mixed dictionary does so with an order of magnitude reduction in parameters, while maintaining geometric interpretability. Our results provide a hypothesis to explain the success of deep neural networks in learning numerical approximations to Koopman operators. ",
    "url": "https://arxiv.org/abs/2206.13585",
    "authors": [
      "Charles A. Johnson",
      "Shara Balakrishnan",
      "Enoch Yeung"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13591",
    "title": "Reduced Optimal Power Flow Using Graph Neural Network",
    "abstract": "OPF problems are formulated and solved for power system operations, especially for determining generation dispatch points in real-time. For large and complex power system networks with large numbers of variables and constraints, finding the optimal solution for real-time OPF in a timely manner requires a massive amount of computing power. This paper presents a new method to reduce the number of constraints in the original OPF problem using a graph neural network (GNN). GNN is an innovative machine learning model that utilizes features from nodes, edges, and network topology to maximize its performance. In this paper, we proposed a GNN model to predict which lines would be heavily loaded or congested with given load profiles and generation capacities. Only these critical lines will be monitored in an OPF problem, creating a reduced OPF (ROPF) problem. Significant saving in computing time is expected from the proposed ROPF model. A comprehensive analysis of predictions from the GNN model was also made. It is concluded that the application of GNN for ROPF is able to reduce computing time while retaining solution quality. ",
    "url": "https://arxiv.org/abs/2206.13591",
    "authors": [
      "Thuan Pham",
      "Xingpeng Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13594",
    "title": "Cyber Network Resilience against Self-Propagating Malware Attacks",
    "abstract": "Self-propagating malware (SPM) has led to huge financial losses, major data breaches, and widespread service disruptions in recent years. In this paper, we explore the problem of developing cyber resilient systems capable of mitigating the spread of SPM attacks. We begin with an in-depth study of a well-known self-propagating malware, WannaCry, and present a compartmental model called SIIDR that accurately captures the behavior observed in real-world attack traces. Next, we investigate ten cyber defense techniques, including existing edge and node hardening strategies, as well as newly developed methods based on reconfiguring network communication (NodeSplit) and isolating communities. We evaluate all defense strategies in detail using six real-world communication graphs collected from a large retail network and compare their performance across a wide range of attacks and network topologies. We show that several of these defenses are able to efficiently reduce the spread of SPM attacks modeled with SIIDR. For instance, given a strong attack that infects 97% of nodes when no defense is employed, strategically securing a small number of nodes (0.08%) reduces the infection footprint in one of the networks down to 1%. ",
    "url": "https://arxiv.org/abs/2206.13594",
    "authors": [
      "Alesia Chernikova",
      "Nicolò Gozzi",
      "Simona Boboila",
      "Priyanka Angadi",
      "John Loughner",
      "Matthew Wilden",
      "Nicola Perra",
      "Tina Eliassi-Rad",
      "Alina Oprea"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Dynamical Systems (math.DS)",
      "Spectral Theory (math.SP)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2206.13597",
    "title": "NeuRIS: Neural Reconstruction of Indoor Scenes Using Normal Priors",
    "abstract": "Reconstructing 3D indoor scenes from 2D images is an important task in many computer vision and graphics applications. A main challenge in this task is that large texture-less areas in typical indoor scenes make existing methods struggle to produce satisfactory reconstruction results. We propose a new method, named NeuRIS, for high quality reconstruction of indoor scenes. The key idea of NeuRIS is to integrate estimated normal of indoor scenes as a prior in a neural rendering framework for reconstructing large texture-less shapes and, importantly, to do this in an adaptive manner to also enable the reconstruction of irregular shapes with fine details. Specifically, we evaluate the faithfulness of the normal priors on-the-fly by checking the multi-view consistency of reconstruction during the optimization process. Only the normal priors accepted as faithful will be utilized for 3D reconstruction, which typically happens in the regions of smooth shapes possibly with weak texture. However, for those regions with small objects or thin structures, for which the normal priors are usually unreliable, we will only rely on visual features of the input images, since such regions typically contain relatively rich visual features (e.g., shade changes and boundary contours). Extensive experiments show that NeuRIS significantly outperforms the state-of-the-art methods in terms of reconstruction quality. ",
    "url": "https://arxiv.org/abs/2206.13597",
    "authors": [
      "Jiepeng Wang",
      "Peng Wang",
      "Xiaoxiao Long",
      "Christian Theobalt",
      "Taku Komura",
      "Lingjie Liu",
      "Wenping Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13607",
    "title": "Improved Text Classification via Test-Time Augmentation",
    "abstract": "Test-time augmentation -- the aggregation of predictions across transformed examples of test inputs -- is an established technique to improve the performance of image classification models. Importantly, TTA can be used to improve model performance post-hoc, without additional training. Although test-time augmentation (TTA) can be applied to any data modality, it has seen limited adoption in NLP due in part to the difficulty of identifying label-preserving transformations. In this paper, we present augmentation policies that yield significant accuracy improvements with language models. A key finding is that augmentation policy design -- for instance, the number of samples generated from a single, non-deterministic augmentation -- has a considerable impact on the benefit of TTA. Experiments across a binary classification task and dataset show that test-time augmentation can deliver consistent improvements over current state-of-the-art approaches. ",
    "url": "https://arxiv.org/abs/2206.13607",
    "authors": [
      "Helen Lu",
      "Divya Shanmugam",
      "Harini Suresh",
      "John Guttag"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2206.13614",
    "title": "Measuring and Clustering Network Attackers using Medium-Interaction  Honeypots",
    "abstract": "Network honeypots are often used by information security teams to measure the threat landscape in order to secure their networks. With the advancement of honeypot development, today's medium-interaction honeypots provide a way for security teams and researchers to deploy these active defense tools that require little maintenance on a variety of protocols. In this work, we deploy such honeypots on five different protocols on the public Internet and study the intent and sophistication of the attacks we observe. We then use the information gained to develop a clustering approach that identifies correlations in attacker behavior to discover IPs that are highly likely to be controlled by a single operator, illustrating the advantage of using these honeypots for data collection. ",
    "url": "https://arxiv.org/abs/2206.13614",
    "authors": [
      "Zain Shamsi",
      "Daniel Zhang",
      "Daehyun Kyoung",
      "Alex Liu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2206.13628",
    "title": "Multi-scale Network with Attentional Multi-resolution Fusion for Point  Cloud Semantic Segmentation",
    "abstract": "In this paper, we present a comprehensive point cloud semantic segmentation network that aggregates both local and global multi-scale information. First, we propose an Angle Correlation Point Convolution (ACPConv) module to effectively learn the local shapes of points. Second, based upon ACPConv, we introduce a local multi-scale split (MSS) block that hierarchically connects features within one single block and gradually enlarges the receptive field which is beneficial for exploiting the local context. Third, inspired by HRNet which has excellent performance on 2D image vision tasks, we build an HRNet customized for point cloud to learn global multi-scale context. Lastly, we introduce a point-wise attention fusion approach that fuses multi-resolution predictions and further improves point cloud semantic segmentation performance. Our experimental results and ablations on several benchmark datasets show that our proposed method is effective and able to achieve state-of-the-art performances compared to existing methods. ",
    "url": "https://arxiv.org/abs/2206.13628",
    "authors": [
      "Yuyan Li",
      "Ye Duan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13646",
    "title": "On bounds for norms of reparameterized ReLU artificial neural network  parameters: sums of fractional powers of the Lipschitz norm control the  network parameter vector",
    "abstract": "It is an elementary fact in the scientific literature that the Lipschitz norm of the realization function of a feedforward fully-connected rectified linear unit (ReLU) artificial neural network (ANN) can, up to a multiplicative constant, be bounded from above by sums of powers of the norm of the ANN parameter vector. Roughly speaking, in this work we reveal in the case of shallow ANNs that the converse inequality is also true. More formally, we prove that the norm of the equivalence class of ANN parameter vectors with the same realization function is, up to a multiplicative constant, bounded from above by the sum of powers of the Lipschitz norm of the ANN realization function (with the exponents $ 1/2 $ and $ 1 $). Moreover, we prove that this upper bound only holds when employing the Lipschitz norm but does neither hold for H\\\"older norms nor for Sobolev-Slobodeckij norms. Furthermore, we prove that this upper bound only holds for sums of powers of the Lipschitz norm with the exponents $ 1/2 $ and $ 1 $ but does not hold for the Lipschitz norm alone. ",
    "url": "https://arxiv.org/abs/2206.13646",
    "authors": [
      "Arnulf Jentzen",
      "Timo Kröger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2206.13654",
    "title": "Wav2Vec-Aug: Improved self-supervised training with limited data",
    "abstract": "Self-supervised learning (SSL) of speech representations has received much attention over the last few years but most work has focused on languages and domains with an abundance of unlabeled data. However, for many languages there is a shortage even in the unlabeled data which limits the effectiveness of SSL. In this work, we focus on the problem of applying SSL to domains with limited available data by leveraging data augmentation for Wav2Vec 2.0 pretraining. Further, we propose improvements to each component of the model which result in a combined relative word error rate (WER) improvement of up to 13% compared to Wav2Vec 2.0 on Librispeech test-clean / other. ",
    "url": "https://arxiv.org/abs/2206.13654",
    "authors": [
      "Anuroop Sriram",
      "Michael Auli",
      "Alexei Baevski"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2206.13658",
    "title": "Geo-Situation for Modeling Causality of Geo-Events in Knowledge Graphs",
    "abstract": "This paper proposes a framework for representing and reasoning causality between geographic events by introducing the notion of Geo-Situation. This concept links to observational snapshots that represent sets of conditions, and either acts as the setting of a geo-event or influences the initiation of a geo-event. We envision the use of this framework within knowledge graphs that represent geographic entities will help answer the important question of why a geographic event occurred. ",
    "url": "https://arxiv.org/abs/2206.13658",
    "authors": [
      "Shirly Stephen",
      "Wenwen Li",
      "Torsten Hahmann"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.13660",
    "title": "DF-SCA: Dynamic Frequency Side Channel Attacks are Practical",
    "abstract": "The arm race between hardware security engineers and side-channel researchers has become more competitive with more sophisticated attacks and defenses in the last decade. While modern hardware features improve the system performance significantly, they may create new attack surfaces for malicious people to extract sensitive information about users without physical access to the victim device. Although many previously exploited hardware and OS features were patched by OS developers and chip vendors, any feature that is accessible from userspace applications can be exploited to perform software-based side-channel attacks. In this paper, we present DF-SCA, which is a software-based dynamic frequency side-channel attack on Linux and Android OS devices. We exploit unprivileged access to cpufreq interface that exposes real-time CPU core frequency values directly correlated with the system utilization, creating a reliable side-channel for attackers. We show that Dynamic Voltage and Frequency Scaling (DVFS) feature in modern systems can be utilized to perform website fingerprinting attacks for Google Chrome and Tor browsers on modern Intel, AMD, and ARM architectures. We further extend our analysis to a wide selection of scaling governors on Intel and AMD CPUs, verifying that all scaling governors provide enough information on the visited web page. Moreover, we extract properties of keystroke patterns on frequency readings, that leads to 95% accuracy to distinguish the keystrokes from other activities on Android phones. We leverage inter-keystroke timings of a user by training a k-th nearest neighbor model, which achieves 88% password recovery rate in the first guess on Bank of America application. Finally, we propose several countermeasures to mask the user activity to mitigate DF-SCA on Linux-based systems. ",
    "url": "https://arxiv.org/abs/2206.13660",
    "authors": [
      "Debopriya Roy Dipta",
      "Berk Gulmezoglu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2206.13676",
    "title": "TTS-CGAN: A Transformer Time-Series Conditional GAN for Biosignal Data  Augmentation",
    "abstract": "Signal measurement appearing in the form of time series is one of the most common types of data used in medical machine learning applications. Such datasets are often small in size, expensive to collect and annotate, and might involve privacy issues, which hinders our ability to train large, state-of-the-art deep learning models for biomedical applications. For time-series data, the suite of data augmentation strategies we can use to expand the size of the dataset is limited by the need to maintain the basic properties of the signal. Generative Adversarial Networks (GANs) can be utilized as another data augmentation tool. In this paper, we present TTS-CGAN, a transformer-based conditional GAN model that can be trained on existing multi-class datasets and generate class-specific synthetic time-series sequences of arbitrary length. We elaborate on the model architecture and design strategies. Synthetic sequences generated by our model are indistinguishable from real ones, and can be used to complement or replace real signals of the same type, thus achieving the goal of data augmentation. To evaluate the quality of the generated data, we modify the wavelet coherence metric to be able to compare the similarity between two sets of signals, and also conduct a case study where a mix of synthetic and real data are used to train a deep learning model for sequence classification. Together with other visualization techniques and qualitative evaluation approaches, we demonstrate that TTS-CGAN generated synthetic data are similar to real data, and that our model performs better than the other state-of-the-art GAN models built for time-series data generation. ",
    "url": "https://arxiv.org/abs/2206.13676",
    "authors": [
      "Xiaomin Li",
      "Anne Hee Hiong Ngu",
      "Vangelis Metsis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13687",
    "title": "POEM: Out-of-Distribution Detection with Posterior Sampling",
    "abstract": "Out-of-distribution (OOD) detection is indispensable for machine learning models deployed in the open world. Recently, the use of an auxiliary outlier dataset during training (also known as outlier exposure) has shown promising performance. As the sample space for potential OOD data can be prohibitively large, sampling informative outliers is essential. In this work, we propose a novel posterior sampling-based outlier mining framework, POEM, which facilitates efficient use of outlier data and promotes learning a compact decision boundary between ID and OOD data for improved detection. We show that POEM establishes state-of-the-art performance on common benchmarks. Compared to the current best method that uses a greedy sampling strategy, POEM improves the relative performance by 42.0% and 24.2% (FPR95) on CIFAR-10 and CIFAR-100, respectively. We further provide theoretical insights on the effectiveness of POEM for OOD detection. ",
    "url": "https://arxiv.org/abs/2206.13687",
    "authors": [
      "Yifei Ming",
      "Ying Fan",
      "Yixuan Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13689",
    "title": "Tiny-Sepformer: A Tiny Time-Domain Transformer Network for Speech  Separation",
    "abstract": "Time-domain Transformer neural networks have proven their superiority in speech separation tasks. However, these models usually have a large number of network parameters, thus often encountering the problem of GPU memory explosion. In this paper, we proposed Tiny-Sepformer, a tiny version of Transformer network for speech separation. We present two techniques to reduce the model parameters and memory consumption: (1) Convolution-Attention (CA) block, spliting the vanilla Transformer to two paths, multi-head attention and 1D depthwise separable convolution, (2) parameter sharing, sharing the layer parameters within the CA block. In our experiments, Tiny-Sepformer could greatly reduce the model size, and achieves comparable separation performance with vanilla Sepformer on WSJ0-2/3Mix datasets. ",
    "url": "https://arxiv.org/abs/2206.13689",
    "authors": [
      "Jian Luo",
      "Jianzong Wang",
      "Ning Cheng",
      "Edward Xiao",
      "Xulong Zhang",
      "Jing Xiao"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2206.13691",
    "title": "Dummy Prototypical Networks for Few-Shot Open-Set Keyword Spotting",
    "abstract": "Keyword spotting is the task of detecting a keyword in streaming audio. Conventional keyword spotting targets predefined keywords classification, but there is growing attention in few-shot (query-by-example) keyword spotting, e.g., N-way classification given M-shot support samples. Moreover, in real-world scenarios, there can be utterances from unexpected categories (open-set) which need to be rejected rather than classified as one of the N classes. Combining the two needs, we tackle few-shot open-set keyword spotting with a new benchmark setting, named splitGSC. We propose episode-known dummy prototypes based on metric learning to detect an open-set better and introduce a simple and powerful approach, Dummy Prototypical Networks (D-ProtoNets). Our D-ProtoNets shows clear margins compared to recent few-shot open-set recognition (FSOSR) approaches in the suggested splitGSC. We also verify our method on a standard benchmark, miniImageNet, and D-ProtoNets shows the state-of-the-art open-set detection rate in FSOSR. ",
    "url": "https://arxiv.org/abs/2206.13691",
    "authors": [
      "Byeonggeun Kim",
      "Seunghan Yang",
      "Inseop Chung",
      "Simyung Chang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2206.13697",
    "title": "Graph Condensation via Receptive Field Distribution Matching",
    "abstract": "Graph neural networks (GNNs) enable the analysis of graphs using deep learning, with promising results in capturing structured information in graphs. This paper focuses on creating a small graph to represent the original graph, so that GNNs trained on the size-reduced graph can make accurate predictions. We view the original graph as a distribution of receptive fields and aim to synthesize a small graph whose receptive fields share a similar distribution. Thus, we propose Graph Condesation via Receptive Field Distribution Matching (GCDM), which is accomplished by optimizing the synthetic graph through the use of a distribution matching loss quantified by maximum mean discrepancy (MMD). Additionally, we demonstrate that the synthetic graph generated by GCDM is highly generalizable to a variety of models in evaluation phase and that the condensing speed is significantly improved using this framework. ",
    "url": "https://arxiv.org/abs/2206.13697",
    "authors": [
      "Mengyang Liu",
      "Shanchuan Li",
      "Xinshi Chen",
      "Le Song"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.13717",
    "title": "A Combination of Host Overloading Detection and Virtual Machine  Selection in Cloud Server Consolidation based on Learning Method",
    "abstract": "In cloud data center (CDC), reducing energy consumption while maintaining performance has always been a hot issue. In server consolidation, the traditional solution is to divide the problem into multiple small problems such as host overloading detection, virtual machine (VM) selection and VM placement and solve them step by step. However, the design of host overloading detection strategies and VM selection strategies cannot be directly linked to the ultimate goal of reducing energy consumption and ensuring performance. This paper proposes a learning-based VM selection strategy that selects appropriate VMs for migration without direct host overloading detection. Thereby reducing the generation of SLAV, ensuring the performance and reducing the energy consumption of CDC. Simulations driven by real VM workload traces show that our method outperforms the existing methods in reducing SLAV generation and CDC energy consumption. ",
    "url": "https://arxiv.org/abs/2206.13717",
    "authors": [
      "Li Huixi",
      "Xiao Yinhao",
      "Shen Yongluo"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2206.13720",
    "title": "SHELS: Exclusive Feature Sets for Novelty Detection and Continual  Learning Without Class Boundaries",
    "abstract": "While deep neural networks (DNNs) have achieved impressive classification performance in closed-world learning scenarios, they typically fail to generalize to unseen categories in dynamic open-world environments, in which the number of concepts is unbounded. In contrast, human and animal learners have the ability to incrementally update their knowledge by recognizing and adapting to novel observations. In particular, humans characterize concepts via exclusive (unique) sets of essential features, which are used for both recognizing known classes and identifying novelty. Inspired by natural learners, we introduce a Sparse High-level-Exclusive, Low-level-Shared feature representation (SHELS) that simultaneously encourages learning exclusive sets of high-level features and essential, shared low-level features. The exclusivity of the high-level features enables the DNN to automatically detect out-of-distribution (OOD) data, while the efficient use of capacity via sparse low-level features permits accommodating new knowledge. The resulting approach uses OOD detection to perform class-incremental continual learning without known class boundaries. We show that using SHELS for novelty detection results in statistically significant improvements over state-of-the-art OOD detection approaches over a variety of benchmark datasets. Further, we demonstrate that the SHELS model mitigates catastrophic forgetting in a class-incremental learning setting,enabling a combined novelty detection and accommodation framework that supports learning in open-world settings ",
    "url": "https://arxiv.org/abs/2206.13720",
    "authors": [
      "Meghna Gummadi",
      "David Kent",
      "Jorge A. Mendez",
      "Eric Eaton"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.13723",
    "title": "Prescribed-Time Synchronization of Multiweighted and Directed Complex  Networks",
    "abstract": "In this note, we study the prescribed-time (PT) synchronization of multiweighted and directed complex networks (MWDCNs) via pinning control. Unlike finite-time and fixed-time synchronization, the time for synchronization can be preset as needed, which is independent of initial values and parameters like coupling strength. First and foremost, we reveal the essence of PT stability by improper integral, L'Hospital rule and Taylor expansion theory. Many controllers established previously for PT stability can be included in our new model. Then, we apply this new result on MWDCNs as an application. The synchronization error at the prescribed time is discussed carefully, so, PT synchronization can be reached. The network topology can be directed and disconnected, which means that the outer coupling matrices (OCMs) can be asymmetric and not connected. The relationships between nodes are allowed to be cooperative or competitive, so elements in OCMs and inner coupling matrices (ICMs) can be positive or negative. We use the rearranging variables' order technique to combine ICMs and OCMs together to get the sum matrices, which can make a bridge between multiweighted and single-weighted networks. Finally, simulations are presented to illustrate the effectiveness of our theory. ",
    "url": "https://arxiv.org/abs/2206.13723",
    "authors": [
      "Linlong Xu",
      "Xiwei Liu"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2206.13728",
    "title": "Boosting R-CNN: Reweighting R-CNN Samples by RPN's Error for Underwater  Object Detection",
    "abstract": "Complicated underwater environments bring new challenges to object detection, such as unbalanced light conditions, low contrast, occlusion, and mimicry of aquatic organisms. Under these circumstances, the objects captured by the underwater camera will become vague, and the generic detectors often fail on these vague objects. This work aims to solve the problem from two perspectives: uncertainty modeling and hard example mining. We propose a two-stage underwater detector named boosting R-CNN, which comprises three key components. First, a new region proposal network named RetinaRPN is proposed, which provides high-quality proposals and considers objectness and IoU prediction for uncertainty to model the object prior probability. Second, the probabilistic inference pipeline is introduced to combine the first-stage prior uncertainty and the second-stage classification score to model the final detection score. Finally, we propose a new hard example mining method named boosting reweighting. Specifically, when the region proposal network miscalculates the object prior probability for a sample, boosting reweighting will increase the classification loss of the sample in the R-CNN head during training, while reducing the loss of easy samples with accurately estimated priors. Thus, a robust detection head in the second stage can be obtained. During the inference stage, the R-CNN has the capability to rectify the error of the first stage to improve the performance. Comprehensive experiments on two underwater datasets and two generic object detection datasets demonstrate the effectiveness and robustness of our method. ",
    "url": "https://arxiv.org/abs/2206.13728",
    "authors": [
      "Pinhao Song",
      "Hong Liu",
      "Linhui Dai",
      "Tao Wang",
      "Zhan Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13734",
    "title": "H-GCN: A Graph Convolutional Network Accelerator on Versal ACAP  Architecture",
    "abstract": "Graph Neural Networks (GNNs) have drawn tremendous attention due to their unique capability to extend Machine Learning (ML) approaches to applications broadly-defined as having unstructured data, especially graphs. Compared with other Machine Learning (ML) modalities, the acceleration of Graph Neural Networks (GNNs) is more challenging due to the irregularity and heterogeneity derived from graph typologies. Existing efforts, however, have focused mainly on handling graphs' irregularity and have not studied their heterogeneity. To this end we propose H-GCN, a PL (Programmable Logic) and AIE (AI Engine) based hybrid accelerator that leverages the emerging heterogeneity of Xilinx Versal Adaptive Compute Acceleration Platforms (ACAPs) to achieve high-performance GNN inference. In particular, H-GCN partitions each graph into three subgraphs based on its inherent heterogeneity, and processes them using PL and AIE, respectively. To further improve performance, we explore the sparsity support of AIE and develop an efficient density-aware method to automatically map tiles of sparse matrix-matrix multiplication (SpMM) onto the systolic tensor array. Compared with state-of-the-art GCN accelerators, H-GCN achieves, on average, speedups of 1.1~2.3X. ",
    "url": "https://arxiv.org/abs/2206.13734",
    "authors": [
      "Chengming Zhang",
      "Tong Geng",
      "Anqi Guo",
      "Jiannan Tian",
      "Martin Herbordt",
      "Ang Li",
      "Dingwen Tao"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13737",
    "title": "Adversarial Consistency for Single Domain Generalization in Medical  Image Segmentation",
    "abstract": "An organ segmentation method that can generalize to unseen contrasts and scanner settings can significantly reduce the need for retraining of deep learning models. Domain Generalization (DG) aims to achieve this goal. However, most DG methods for segmentation require training data from multiple domains during training. We propose a novel adversarial domain generalization method for organ segmentation trained on data from a \\emph{single} domain. We synthesize the new domains via learning an adversarial domain synthesizer (ADS) and presume that the synthetic domains cover a large enough area of plausible distributions so that unseen domains can be interpolated from synthetic domains. We propose a mutual information regularizer to enforce the semantic consistency between images from the synthetic domains, which can be estimated by patch-level contrastive learning. We evaluate our method for various organ segmentation for unseen modalities, scanning protocols, and scanner sites. ",
    "url": "https://arxiv.org/abs/2206.13737",
    "authors": [
      "Yanwu Xu",
      "Shaoan Xie",
      "Maxwell Reynolds1",
      "Matthew Ragoza1",
      "Mingming Gong",
      "Kayhan Batmanghelich"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13741",
    "title": "Social-aware Cooperative Caching in Fog Radio Access Networks",
    "abstract": "In this paper, the cooperative caching problem in fog radio access networks (F-RANs) is investigated to jointly optimize the transmission delay and energy consumption. Exploiting the potential social relationships among fog access points (F-APs), we firstly propose a clustering scheme based on hedonic coalition game (HCG) to improve the potential cooperation gain. Then, considering that the optimization problem is non-deterministic polynomial hard (NP-hard), we further propose an improved firefly algorithm (FA) based cooperative caching scheme, which utilizes a mutation strategy based on local content popularity to avoid pre-mature convergence. Simulation results show that our proposed scheme can effectively reduce the content transmission delay and energy consumption in comparison with the baselines. ",
    "url": "https://arxiv.org/abs/2206.13741",
    "authors": [
      "Baotian Fan",
      "Yanxiang Jiang",
      "Fu-Chun Zheng",
      "Mehdi Bennis",
      "Xiaohu You"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.13748",
    "title": "Phrase Mining",
    "abstract": "Extracting frequent words from a collection of texts is performed on a great scale in many subjects. Extracting phrases, on the other hand, is not commonly done due to inherent complications when extracting phrases, the most significant complication being that of double-counting, where words or phrases are counted when they appear inside longer phrases that themselves are also counted. Several papers have been written on phrase mining that describe solutions to this issue; however, they either require a list of so-called quality phrases to be available to the extracting process, or they require human interaction to identify those quality phrases during the process. We present a method that eliminates double-counting without the need to identify lists of quality phrases. In the context of a set of texts, we define a principal phrase as a phrase that does not cross punctuation marks, does not start with a stop word, with the exception of the stop words \"not\" and \"no\", does not end with a stop word, is frequent within those texts without being double counted, and is meaningful to the user. Our method can identify such principal phrases independently without human input, and enables their extraction from any texts. An R package called phm has been developed that implements this method. ",
    "url": "https://arxiv.org/abs/2206.13748",
    "authors": [
      "Ellie Small",
      "Javier Cabrera"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2206.13749",
    "title": "Adaptive Multi-view Rule Discovery for Weakly-Supervised Compatible  Products Prediction",
    "abstract": "On e-commerce platforms, predicting if two products are compatible with each other is an important functionality to achieve trustworthy product recommendation and search experience for consumers. However, accurately predicting product compatibility is difficult due to the heterogeneous product data and the lack of manually curated training data. We study the problem of discovering effective labeling rules that can enable weakly-supervised product compatibility prediction. We develop AMRule, a multi-view rule discovery framework that can (1) adaptively and iteratively discover novel rulers that can complement the current weakly-supervised model to improve compatibility prediction; (2) discover interpretable rules from both structured attribute tables and unstructured product descriptions. AMRule adaptively discovers labeling rules from large-error instances via a boosting-style strategy, the high-quality rules can remedy the current model's weak spots and refine the model iteratively. For rule discovery from structured product attributes, we generate composable high-order rules from decision trees; and for rule discovery from unstructured product descriptions, we generate prompt-based rules from a pre-trained language model. Experiments on 4 real-world datasets show that AMRule outperforms the baselines by 5.98% on average and improves rule quality and rule proposal efficiency. ",
    "url": "https://arxiv.org/abs/2206.13749",
    "authors": [
      "Rongzhi Zhang",
      "Rebecca West",
      "Xiquan Cui",
      "Chao Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2206.13752",
    "title": "Sub-Block Rearranged Staircase Codes for Optical Transport Networks",
    "abstract": "We propose a new family of spatially coupled product codes, called sub-block rearranged staircase (SR-staircase) codes. Each SR-staircase code block is constructed by encoding rearranged preceding code blocks and new information blocks, where the rearrangement involves sub-blocks decomposition and transposition. The proposed codes can be constructed to have each code block size of $1/q$ to that of the conventional staircase codes while having the same rate and component codes, for any positive integer $q$. In this regard, we can use strong algebraic component codes to construct SR-staircase codes with a similar or the same code block size and rate as staircase codes with weak component codes. Moreover, both waterfall and error floor performance can be further improved by using a large coupling width. The superior performance of the proposed codes is demonstrated through density evolution and error floor analysis as well as simulation. ",
    "url": "https://arxiv.org/abs/2206.13752",
    "authors": [
      "Min Qiu",
      "Jinhong Yuan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.13758",
    "title": "Exploring linguistic feature and model combination for speech  recognition based automatic AD detection",
    "abstract": "Early diagnosis of Alzheimer's disease (AD) is crucial in facilitating preventive care and delay progression. Speech based automatic AD screening systems provide a non-intrusive and more scalable alternative to other clinical screening techniques. Scarcity of such specialist data leads to uncertainty in both model selection and feature learning when developing such systems. To this end, this paper investigates the use of feature and model combination approaches to improve the robustness of domain fine-tuning of BERT and Roberta pre-trained text encoders on limited data, before the resulting embedding features being fed into an ensemble of backend classifiers to produce the final AD detection decision via majority voting. Experiments conducted on the ADReSS20 Challenge dataset suggest consistent performance improvements were obtained using model and feature combination in system development. State-of-the-art AD detection accuracies of 91.67 percent and 93.75 percent were obtained using manual and ASR speech transcripts respectively on the ADReSS20 test set consisting of 48 elderly speakers. ",
    "url": "https://arxiv.org/abs/2206.13758",
    "authors": [
      "Yi Wang",
      "Tianzi Wang",
      "Zi Ye",
      "Lingwei Meng",
      "Shoukang Hu",
      "Xixin Wu",
      "Xunying Liu",
      "Helen Meng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2206.13801",
    "title": "Joint Precoding for Active Intelligent Transmitting Surface Empowered  Outdoor-to-Indoor Communication in mmWave Cellular Networks",
    "abstract": "Outdoor-to-indoor communications in millimeter-wave (mmWave) cellular networks have been one challenging research problem due to the severe attenuation and the high penetration loss caused by the propagation characteristics of mmWave signals. We propose a viable solution to implement the outdoor-to-indoor mmWave communication system with the aid of an active intelligent transmitting surface (active-ITS), where the active-ITS allows the incoming signal from an outdoor base station (BS) to pass through the surface and be received by the indoor user-equipments (UEs) after shifting its phase and magnifying its amplitude. Then, the problem of joint precoding of the BS and active-ITS is investigated to maximize the weighted sum-rate (WSR) of the communication system. An efficient block coordinate descent (BCD) based algorithm is developed to solve it with the suboptimal solutions in nearly closed-forms. In addition, to reduce the size and hardware cost of an active-ITS, we provide a block-amplifying architecture to partially remove the circuit components for power-amplifying, where multiple transmissive-type elements (TEs) in each block share a same power amplifier. Simulations indicate that active-ITS has the potential of achieving a given performance with much fewer TEs compared to the passive-ITS under the same total system power consumption, which makes it suitable for application to the size-limited and aesthetic-needed scenario, and the inevitable performance degradation caused by the block-amplifying architecture is acceptable. ",
    "url": "https://arxiv.org/abs/2206.13801",
    "authors": [
      "Xie Xie",
      "Chen He",
      "Feifei Gao",
      "Zhu Han",
      "Z. Jane Wang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.13813",
    "title": "Sublinear-Time Clustering Oracle for Signed Graphs",
    "abstract": "Social networks are often modeled using signed graphs, where vertices correspond to users and edges have a sign that indicates whether an interaction between users was positive or negative. The arising signed graphs typically contain a clear community structure in the sense that the graph can be partitioned into a small number of polarized communities, each defining a sparse cut and indivisible into smaller polarized sub-communities. We provide a local clustering oracle for signed graphs with such a clear community structure, that can answer membership queries, i.e., \"Given a vertex $v$, which community does $v$ belong to?\", in sublinear time by reading only a small portion of the graph. Formally, when the graph has bounded maximum degree and the number of communities is at most $O(\\log n)$, then with $\\tilde{O}(\\sqrt{n}\\operatorname{poly}(1/\\varepsilon))$ preprocessing time, our oracle can answer each membership query in $\\tilde{O}(\\sqrt{n}\\operatorname{poly}(1/\\varepsilon))$ time, and it correctly classifies a $(1-\\varepsilon)$-fraction of vertices w.r.t. a set of hidden planted ground-truth communities. Our oracle is desirable in applications where the clustering information is needed for only a small number of vertices. Previously, such local clustering oracles were only known for unsigned graphs; our generalization to signed graphs requires a number of new ideas and gives a novel spectral analysis of the behavior of random walks with signs. We evaluate our algorithm for constructing such an oracle and answering membership queries on both synthetic and real-world datasets, validating its performance in practice. ",
    "url": "https://arxiv.org/abs/2206.13813",
    "authors": [
      "Stefan Neumann",
      "Pan Peng"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2206.13816",
    "title": "Learning the Evolutionary and Multi-scale Graph Structure for  Multivariate Time Series Forecasting",
    "abstract": "Recent studies have shown great promise in applying graph neural networks for multivariate time series forecasting, where the interactions of time series are described as a graph structure and the variables are represented as the graph nodes. Along this line, existing methods usually assume that the graph structure (or the adjacency matrix), which determines the aggregation manner of graph neural network, is fixed either by definition or self-learning. However, the interactions of variables can be dynamic and evolutionary in real-world scenarios. Furthermore, the interactions of time series are quite different if they are observed at different time scales. To equip the graph neural network with a flexible and practical graph structure, in this paper, we investigate how to model the evolutionary and multi-scale interactions of time series. In particular, we first provide a hierarchical graph structure cooperated with the dilated convolution to capture the scale-specific correlations among time series. Then, a series of adjacency matrices are constructed under a recurrent manner to represent the evolving correlations at each layer. Moreover, a unified neural network is provided to integrate the components above to get the final prediction. In this way, we can capture the pair-wise correlations and temporal dependency simultaneously. Finally, experiments on both single-step and multi-step forecasting tasks demonstrate the superiority of our method over the state-of-the-art approaches. ",
    "url": "https://arxiv.org/abs/2206.13816",
    "authors": [
      "Junchen Ye",
      "Zihan Liu",
      "Bowen Du",
      "Leilei Sun",
      "Weimiao Li",
      "Yanjie Fu",
      "Hui Xiong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.13817",
    "title": "Comparison of Speech Representations for the MOS Prediction System",
    "abstract": "Automatic methods to predict Mean Opinion Score (MOS) of listeners have been researched to assure the quality of Text-to-Speech systems. Many previous studies focus on architectural advances (e.g. MBNet, LDNet, etc.) to capture relations between spectral features and MOS in a more effective way and achieved high accuracy. However, the optimal representation in terms of generalization capability still largely remains unknown. To this end, we compare the performance of Self-Supervised Learning (SSL) features obtained by the wav2vec framework to that of spectral features such as magnitude of spectrogram and melspectrogram. Moreover, we propose to combine the SSL features and features which we believe to retain essential information to the automatic MOS to compensate each other for their drawbacks. We conduct comprehensive experiments on a large-scale listening test corpus collected from past Blizzard and Voice Conversion Challenges. We found that the wav2vec feature set showed the best generalization even though the given ground-truth was not always reliable. Furthermore, we found that the combinations performed the best and analyzed how they bridged the gap between spectral and the wav2vec feature sets. ",
    "url": "https://arxiv.org/abs/2206.13817",
    "authors": [
      "Aki Kunikoshi",
      "Jaebok Kim",
      "Wonsuk Jun",
      "Kåre Sjölander"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2206.13829",
    "title": "Cross-Forgery Analysis of Vision Transformers and CNNs for Deepfake  Image Detection",
    "abstract": "Deepfake Generation Techniques are evolving at a rapid pace, making it possible to create realistic manipulated images and videos and endangering the serenity of modern society. The continual emergence of new and varied techniques brings with it a further problem to be faced, namely the ability of deepfake detection models to update themselves promptly in order to be able to identify manipulations carried out using even the most recent methods. This is an extremely complex problem to solve, as training a model requires large amounts of data, which are difficult to obtain if the deepfake generation method is too recent. Moreover, continuously retraining a network would be unfeasible. In this paper, we ask ourselves if, among the various deep learning techniques, there is one that is able to generalise the concept of deepfake to such an extent that it does not remain tied to one or more specific deepfake generation methods used in the training set. We compared a Vision Transformer with an EfficientNetV2 on a cross-forgery context based on the ForgeryNet dataset. From our experiments, It emerges that EfficientNetV2 has a greater tendency to specialize often obtaining better results on training methods while Vision Transformers exhibit a superior generalization ability that makes them more competent even on images generated with new methodologies. ",
    "url": "https://arxiv.org/abs/2206.13829",
    "authors": [
      "Davide Alessandro Coccomini",
      "Roberto Caldelli",
      "Fabrizio Falchi",
      "Claudio Gennaro",
      "Giuseppe Amato"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13858",
    "title": "Accurate and Real-time Pseudo Lidar Detection: Is Stereo Neural Network  Really Necessary?",
    "abstract": "The proposal of Pseudo-Lidar representation has significantly narrowed the gap between visual-based and active Lidar-based 3D object detection. However, current researches exclusively focus on pushing the accuracy improvement of Pseudo-Lidar by taking the advantage of complex and time-consuming neural networks. Seldom explore the profound characteristics of Pseudo-Lidar representation to obtain the promoting opportunities. In this paper, we dive deep into the pseudo Lidar representation and argue that the performance of 3D object detection is not fully dependent on the high precision stereo depth estimation. We demonstrate that even for the unreliable depth estimation, with proper data processing and refining, it can achieve comparable 3D object detection accuracy. With this finding, we further show the possibility that utilizing fast but inaccurate stereo matching algorithms in the Pseudo-Lidar system to achieve low latency responsiveness. In the experiments, we develop a system with a less powerful stereo matching predictor and adopt the proposed refinement schemes to improve the accuracy. The evaluation on the KITTI benchmark shows that the presented system achieves competitive accuracy to the state-of-the-art approaches with only 23 ms computing, showing it is a suitable candidate for deploying to real car-hold applications. ",
    "url": "https://arxiv.org/abs/2206.13858",
    "authors": [
      "Haitao Meng",
      "Changcai Li",
      "Gang Chen",
      "Alois Knoll"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13882",
    "title": "CSI Sensing from Heterogeneous User Feedbacks: A Constrained Phase  Retrieval Approach",
    "abstract": "This paper investigates the downlink channel state information (CSI) sensing in 5G heterogeneous networks composed of user equipments (UEs) with different feedback capabilities. We aim to enhance the CSI accuracy of UEs only affording the low-resolution Type-I codebook. While existing works have demonstrated that the task can be accomplished by solving a phase retrieval (PR) formulation based on the feedback of precoding matrix indicator (PMI) and channel quality indicator (CQI), they need many feedback rounds. In this paper, we propose a novel CSI sensing scheme that can significantly reduce the feedback overhead. Our scheme involves a novel parameter dimension reduction design by exploiting the spatial consistency of wireless channels among nearby UEs, and a constrained PR (CPR) formulation that characterizes the feasible region of CSI by the PMI information. To address the computational challenge due to the non-convexity and the large number of constraints of CPR, we develop a two-stage algorithm that firstly identifies and removes inactive constraints, followed by a fast first-order algorithm. The study is further extended to multi-carrier systems. Extensive tests over DeepMIMO and QuaDriGa datasets showcase that our designs greatly outperform existing methods and achieve the high-resolution Type-II codebook performance with a few rounds of feedback. ",
    "url": "https://arxiv.org/abs/2206.13882",
    "authors": [
      "Lei Li",
      "Xing Zeng",
      "Ya-Feng Liu",
      "Yanqing Xu",
      "Tsung-Hui Chang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2206.13889",
    "title": "Parallel Instance Filtering for Malware Detection",
    "abstract": "Machine learning algorithms are widely used in the area of malware detection. With the growth of sample amounts, training of classification algorithms becomes more and more expensive. In addition, training data sets may contain redundant or noisy instances. The problem to be solved is how to select representative instances from large training data sets without reducing the accuracy. This work presents a new parallel instance selection algorithm called Parallel Instance Filtering (PIF). The main idea of the algorithm is to split the data set into non-overlapping subsets of instances covering the whole data set and apply a filtering process for each subset. Each subset consists of instances that have the same nearest enemy. As a result, the PIF algorithm is fast since subsets are processed independently of each other using parallel computation. We compare the PIF algorithm with several state-of-the-art instance selection algorithms on a large data set of 500,000 malicious and benign samples. The feature set was extracted using static analysis, and it includes metadata from the portable executable file format. Our experimental results demonstrate that the proposed instance selection algorithm reduces the size of a training data set significantly with the only slightly decreased accuracy. The PIF algorithm outperforms existing instance selection methods used in the experiments in terms of the ratio between average classification accuracy and storage percentage. ",
    "url": "https://arxiv.org/abs/2206.13889",
    "authors": [
      "Martin Jureček",
      "Olha Jurečková"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13904",
    "title": "A Contribution to the Defense of Liquid Democracy",
    "abstract": "Liquid democracy is a hybrid direct-representative decision making process that provides each voter with the option of either voting directly or to delegate their vote to another voter, i.e., to a representative of their choice. One of the proposed advantages of liquid democracy is that, in general, it is assumed that voters will delegate their vote to others that are better informed, which leads to more informed and better decisions. Considering an audience from various knowledge domains, we provide an accessible high-level analysis of a prominent critique of liquid democracy by Caragiannis and Micha. Caragiannis and Micha's critique contains three central topics: 1. Analysis using their $\\alpha$-delegation model, which does not assume delegation to the more informed; 2. Novel delegation network structures where it is advantageous to delegate to the less informed rather than the more informed; and 3. Due to NP hardness, the implied impracticability of a social network obtaining an optimal delegation structure. We show that in the real world, Caragiannis and Micha's critique of liquid democracy has little or no relevance. Respectively, our critique is based on: 1. The identification of incorrect $\\alpha$-delegation model assumptions; 2. A lack of novel delegation structures and their effect in a real-world implementation of liquid democracy, which would be guaranteed with constraints that sensibly distribute voting power; and 3. The irrelevance of an optimal delegation structure if the correct result is guaranteed regardless. We conclude that Caragiannis and Micha's critique has no significant negative relevance to the proposition of liquid democracy. ",
    "url": "https://arxiv.org/abs/2206.13904",
    "authors": [
      "Gregory Butterworth",
      "Richard Booth"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Computer Science and Game Theory (cs.GT)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2206.13905",
    "title": "Fast Simulation of Particulate Suspensions Enabled by Graph Neural  Network",
    "abstract": "Predicting the dynamic behaviors of particles in suspension subject to hydrodynamic interaction (HI) and external drive can be critical for many applications. By harvesting advanced deep learning techniques, the present work introduces a new framework, hydrodynamic interaction graph neural network (HIGNN), for inferring and predicting the particles' dynamics in Stokes suspensions. It overcomes the limitations of traditional approaches in computational efficiency, accuracy, and/or transferability. In particular, by uniting the data structure represented by a graph and the neural networks with learnable parameters, the HIGNN constructs surrogate modeling for the mobility tensor of particles which is the key to predicting the dynamics of particles subject to HI and external forces. To account for the many-body nature of HI, we generalize the state-of-the-art GNN by introducing higher-order connectivity into the graph and the corresponding convolutional operation. For training the HIGNN, we only need the data for a small number of particles in the domain of interest, and hence the training cost can be maintained low. Once constructed, the HIGNN permits fast predictions of the particles' velocities and is transferable to suspensions of different numbers/concentrations of particles in the same domain and to any external forcing. It has the ability to accurately capture both the long-range HI and short-range lubrication effects. We demonstrate the accuracy, efficiency, and transferability of the proposed HIGNN framework in a variety of systems. The requirement on computing resource is minimum: most simulations only require a desktop with one GPU; the simulations for a large suspension of 100,000 particles call for up to 6 GPUs. ",
    "url": "https://arxiv.org/abs/2206.13905",
    "authors": [
      "Zhan Ma",
      "Zisheng Ye",
      "Wenxiao Pan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2206.13953",
    "title": "RAW-GNN: RAndom Walk Aggregation based Graph Neural Network",
    "abstract": "Graph-Convolution-based methods have been successfully applied to representation learning on homophily graphs where nodes with the same label or similar attributes tend to connect with one another. Due to the homophily assumption of Graph Convolutional Networks (GCNs) that these methods use, they are not suitable for heterophily graphs where nodes with different labels or dissimilar attributes tend to be adjacent. Several methods have attempted to address this heterophily problem, but they do not change the fundamental aggregation mechanism of GCNs because they rely on summation operators to aggregate information from neighboring nodes, which is implicitly subject to the homophily assumption. Here, we introduce a novel aggregation mechanism and develop a RAndom Walk Aggregation-based Graph Neural Network (called RAW-GNN) method. The proposed approach integrates the random walk strategy with graph neural networks. The new method utilizes breadth-first random walk search to capture homophily information and depth-first search to collect heterophily information. It replaces the conventional neighborhoods with path-based neighborhoods and introduces a new path-based aggregator based on Recurrent Neural Networks. These designs make RAW-GNN suitable for both homophily and heterophily graphs. Extensive experimental results showed that the new method achieved state-of-the-art performance on a variety of homophily and heterophily graphs. ",
    "url": "https://arxiv.org/abs/2206.13953",
    "authors": [
      "Di Jin",
      "Rui Wang",
      "Meng Ge",
      "Dongxiao He",
      "Xiang Li",
      "Wei Lin",
      "Weixiong Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13962",
    "title": "Multi-Prior Learning via Neural Architecture Search for Blind Face  Restoration",
    "abstract": "Blind Face Restoration (BFR) aims to recover high-quality face images from low-quality ones and usually resorts to facial priors for improving restoration performance. However, current methods still suffer from two major difficulties: 1) how to derive a powerful network architecture without extensive hand tuning; 2) how to capture complementary information from multiple facial priors in one network to improve restoration performance. To this end, we propose a Face Restoration Searching Network (FRSNet) to adaptively search the suitable feature extraction architecture within our specified search space, which can directly contribute to the restoration quality. On the basis of FRSNet, we further design our Multiple Facial Prior Searching Network (MFPSNet) with a multi-prior learning scheme. MFPSNet optimally extracts information from diverse facial priors and fuses the information into image features, ensuring that both external guidance and internal features are reserved. In this way, MFPSNet takes full advantage of semantic-level (parsing maps), geometric-level (facial heatmaps), reference-level (facial dictionaries) and pixel-level (degraded images) information and thus generates faithful and realistic images. Quantitative and qualitative experiments show that MFPSNet performs favorably on both synthetic and real-world datasets against the state-of-the-art BFR methods. The codes are publicly available at: https://github.com/YYJ1anG/MFPSNet. ",
    "url": "https://arxiv.org/abs/2206.13962",
    "authors": [
      "Yanjiang Yu",
      "Puyang Zhang",
      "Kaihao Zhang",
      "Wenhan Luo",
      "Changsheng Li",
      "Ye Yuan",
      "Guoren Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13963",
    "title": "Primitive Graph Learning for Unified Vector Mapping",
    "abstract": "Large-scale vector mapping is important for transportation, city planning, and survey and census. We propose GraphMapper, a unified framework for end-to-end vector map extraction from satellite images. Our key idea is a novel unified representation of shapes of different topologies named \"primitive graph\", which is a set of shape primitives and their pairwise relationship matrix. Then, we convert vector shape prediction, regularization, and topology reconstruction into a unique primitive graph learning problem. Specifically, GraphMapper is a generic primitive graph learning network based on global shape context modelling through multi-head-attention. An embedding space sorting method is developed for accurate primitive relationship modelling. We empirically demonstrate the effectiveness of GraphMapper on two challenging mapping tasks, building footprint regularization and road network topology reconstruction. Our model outperforms state-of-the-art methods by 8-10% in both tasks on public benchmarks. All code will be publicly available. ",
    "url": "https://arxiv.org/abs/2206.13963",
    "authors": [
      "Lei Wang",
      "Min Dai",
      "Jianan He",
      "Jingwei Huang",
      "Mingwei Sun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13964",
    "title": "Learning Gait Representation from Massive Unlabelled Walking Videos: A  Benchmark",
    "abstract": "Gait depicts individuals' unique and distinguishing walking patterns and has become one of the most promising biometric features for human identification. As a fine-grained recognition task, gait recognition is easily affected by many factors and usually requires a large amount of completely annotated data that is costly and insatiable. This paper proposes a large-scale self-supervised benchmark for gait recognition with contrastive learning, aiming to learn the general gait representation from massive unlabelled walking videos for practical applications via offering informative walking priors and diverse real-world variations. Specifically, we collect a large-scale unlabelled gait dataset GaitLU-1M consisting of 1.02M walking sequences and propose a conceptually simple yet empirically powerful baseline model GaitSSB. Experimentally, we evaluate the pre-trained model on four widely-used gait benchmarks, CASIA-B, OU-MVLP, GREW and Gait3D with or without transfer learning. The unsupervised results are comparable to or even better than the early model-based and GEI-based methods. After transfer learning, our method outperforms existing methods by a large margin in most cases. Theoretically, we discuss the critical issues for gait-specific contrastive framework and present some insights for further study. As far as we know, GaitLU-1M is the first large-scale unlabelled gait dataset, and GaitSSB is the first method that achieves remarkable unsupervised results on the aforementioned benchmarks. The source code of GaitSSB will be integrated into OpenGait which is available at https://github.com/ShiqiYu/OpenGait. ",
    "url": "https://arxiv.org/abs/2206.13964",
    "authors": [
      "Chao Fan",
      "Saihui Hou",
      "Jilong Wang",
      "Yongzhen Huang",
      "Shiqi Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13979",
    "title": "Attack Agnostic Dataset: Towards Generalization and Stabilization of  Audio DeepFake Detection",
    "abstract": "Audio DeepFakes allow the creation of high-quality, convincing utterances and therefore pose a threat due to its potential applications such as impersonation or fake news. Methods for detecting these manipulations should be characterized by good generalization and stability leading to robustness against attacks conducted with techniques that are not explicitly included in the training. In this work, we introduce Attack Agnostic Dataset - a combination of two audio DeepFakes and one anti-spoofing datasets that, thanks to the disjoint use of attacks, can lead to better generalization of detection methods. We present a thorough analysis of current DeepFake detection methods and consider different audio features (front-ends). In addition, we propose a model based on LCNN with LFCC and mel-spectrogram front-end, which not only is characterized by a good generalization and stability results but also shows improvement over LFCC-based mode - we decrease standard deviation on all folds and EER in two folds by up to 5%. ",
    "url": "https://arxiv.org/abs/2206.13979",
    "authors": [
      "Piotr Kawa",
      "Marcin Plata",
      "Piotr Syga"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13980",
    "title": "Label-enhanced Prototypical Network with Contrastive Learning for  Multi-label Few-shot Aspect Category Detection",
    "abstract": "Multi-label aspect category detection allows a given review sentence to contain multiple aspect categories, which is shown to be more practical in sentiment analysis and attracting increasing attention. As annotating large amounts of data is time-consuming and labor-intensive, data scarcity occurs frequently in real-world scenarios, which motivates multi-label few-shot aspect category detection. However, research on this problem is still in infancy and few methods are available. In this paper, we propose a novel label-enhanced prototypical network (LPN) for multi-label few-shot aspect category detection. The highlights of LPN can be summarized as follows. First, it leverages label description as auxiliary knowledge to learn more discriminative prototypes, which can retain aspect-relevant information while eliminating the harmful effect caused by irrelevant aspects. Second, it integrates with contrastive learning, which encourages that the sentences with the same aspect label are pulled together in embedding space while simultaneously pushing apart the sentences with different aspect labels. In addition, it introduces an adaptive multi-label inference module to predict the aspect count in the sentence, which is simple yet effective. Extensive experimental results on three datasets demonstrate that our proposed model LPN can consistently achieve state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2206.13980",
    "authors": [
      "Han Liu",
      "Feng Zhang",
      "Xiaotong Zhang",
      "Siyang Zhao",
      "Junjie Sun",
      "Hong Yu",
      "Xianchao Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13982",
    "title": "A Proposed Bi-LSTM Method to Fake News Detection",
    "abstract": "Recent years have seen an explosion in social media usage, allowing people to connect with others. Since the appearance of platforms such as Facebook and Twitter, such platforms influence how we speak, think, and behave. This problem negatively undermines confidence in content because of the existence of fake news. For instance, false news was a determining factor in influencing the outcome of the U.S. presidential election and other sites. Because this information is so harmful, it is essential to make sure we have the necessary tools to detect and resist it. We applied Bidirectional Long Short-Term Memory (Bi-LSTM) to determine if the news is false or real in order to showcase this study. A number of foreign websites and newspapers were used for data collection. After creating & running the model, the work achieved 84% model accuracy and 62.0 F1-macro scores with training data. ",
    "url": "https://arxiv.org/abs/2206.13982",
    "authors": [
      "Taminul Islam",
      "MD Alamin Hosen",
      "Akhi Mony",
      "MD Touhid Hasan",
      "Israt Jahan",
      "Arindom Kundu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13983",
    "title": "BAGEL: A Benchmark for Assessing Graph Neural Network Explanations",
    "abstract": "The problem of interpreting the decisions of machine learning is a well-researched and important. We are interested in a specific type of machine learning model that deals with graph data called graph neural networks. Evaluating interpretability approaches for graph neural networks (GNN) specifically are known to be challenging due to the lack of a commonly accepted benchmark. Given a GNN model, several interpretability approaches exist to explain GNN models with diverse (sometimes conflicting) evaluation methodologies. In this paper, we propose a benchmark for evaluating the explainability approaches for GNNs called Bagel. In Bagel, we firstly propose four diverse GNN explanation evaluation regimes -- 1) faithfulness, 2) sparsity, 3) correctness. and 4) plausibility. We reconcile multiple evaluation metrics in the existing literature and cover diverse notions for a holistic evaluation. Our graph datasets range from citation networks, document graphs, to graphs from molecules and proteins. We conduct an extensive empirical study on four GNN models and nine post-hoc explanation approaches for node and graph classification tasks. We open both the benchmarks and reference implementations and make them available at https://github.com/Mandeep-Rathee/Bagel-benchmark. ",
    "url": "https://arxiv.org/abs/2206.13983",
    "authors": [
      "Mandeep Rathee",
      "Thorben Funke",
      "Avishek Anand",
      "Megha Khosla"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.13991",
    "title": "Increasing Confidence in Adversarial Robustness Evaluations",
    "abstract": "Hundreds of defenses have been proposed to make deep neural networks robust against minimal (adversarial) input perturbations. However, only a handful of these defenses held up their claims because correctly evaluating robustness is extremely challenging: Weak attacks often fail to find adversarial examples even if they unknowingly exist, thereby making a vulnerable network look robust. In this paper, we propose a test to identify weak attacks, and thus weak defense evaluations. Our test slightly modifies a neural network to guarantee the existence of an adversarial example for every sample. Consequentially, any correct attack must succeed in breaking this modified network. For eleven out of thirteen previously-published defenses, the original evaluation of the defense fails our test, while stronger attacks that break these defenses pass it. We hope that attack unit tests - such as ours - will be a major component in future robustness evaluations and increase confidence in an empirical field that is currently riddled with skepticism. ",
    "url": "https://arxiv.org/abs/2206.13991",
    "authors": [
      "Roland S. Zimmermann",
      "Wieland Brendel",
      "Florian Tramer",
      "Nicholas Carlini"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.14004",
    "title": "On the amplification of security and privacy risks by post-hoc  explanations in machine learning models",
    "abstract": "A variety of explanation methods have been proposed in recent years to help users gain insights into the results returned by neural networks, which are otherwise complex and opaque black-boxes. However, explanations give rise to potential side-channels that can be leveraged by an adversary for mounting attacks on the system. In particular, post-hoc explanation methods that highlight input dimensions according to their importance or relevance to the result also leak information that weakens security and privacy. In this work, we perform the first systematic characterization of the privacy and security risks arising from various popular explanation techniques. First, we propose novel explanation-guided black-box evasion attacks that lead to 10 times reduction in query count for the same success rate. We show that the adversarial advantage from explanations can be quantified as a reduction in the total variance of the estimated gradient. Second, we revisit the membership information leaked by common explanations. Contrary to observations in prior studies, via our modified attacks we show significant leakage of membership information (above 100% improvement over prior results), even in a much stricter black-box setting. Finally, we study explanation-guided model extraction attacks and demonstrate adversarial gains through a large reduction in query count. ",
    "url": "https://arxiv.org/abs/2206.14004",
    "authors": [
      "Pengrui Quan",
      "Supriyo Chakraborty",
      "Jeya Vikranth Jeyakumar",
      "Mani Srivastava"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2206.14020",
    "title": "Rethinking Adversarial Examples for Location Privacy Protection",
    "abstract": "We have investigated a new application of adversarial examples, namely location privacy protection against landmark recognition systems. We introduce mask-guided multimodal projected gradient descent (MM-PGD), in which adversarial examples are trained on different deep models. Image contents are protected by analyzing the properties of regions to identify the ones most suitable for blending in adversarial examples. We investigated two region identification strategies: class activation map-based MM-PGD, in which the internal behaviors of trained deep models are targeted; and human-vision-based MM-PGD, in which regions that attract less human attention are targeted. Experiments on the Places365 dataset demonstrated that these strategies are potentially effective in defending against black-box landmark recognition systems without the need for much image manipulation. ",
    "url": "https://arxiv.org/abs/2206.14020",
    "authors": [
      "Trung-Nghia Le",
      "Ta Gu",
      "Huy H. Nguyen",
      "Isao Echizen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.14056",
    "title": "Deep Neural Networks pruning via the Structured Perspective  Regularization",
    "abstract": "In Machine Learning, Artificial Neural Networks (ANNs) are a very powerful tool, broadly used in many applications. Often, the selected (deep) architectures include many layers, and therefore a large amount of parameters, which makes training, storage and inference expensive. This motivated a stream of research about compressing the original networks into smaller ones without excessively sacrificing performances. Among the many proposed compression approaches, one of the most popular is \\emph{pruning}, whereby entire elements of the ANN (links, nodes, channels, \\ldots) and the corresponding weights are deleted. Since the nature of the problem is inherently combinatorial (what elements to prune and what not), we propose a new pruning method based on Operational Research tools. We start from a natural Mixed-Integer-Programming model for the problem, and we use the Perspective Reformulation technique to strengthen its continuous relaxation. Projecting away the indicator variables from this reformulation yields a new regularization term, which we call the Structured Perspective Regularization, that leads to structured pruning of the initial architecture. We test our method on some ResNet architectures applied to CIFAR-10, CIFAR-100 and ImageNet datasets, obtaining competitive performances w.r.t.~the state of the art for structured pruning. ",
    "url": "https://arxiv.org/abs/2206.14056",
    "authors": [
      "Matteo Cacciola",
      "Antonio Frangioni",
      "Xinlin Li",
      "Andrea Lodi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2206.14068",
    "title": "FuSeBMC v4: Improving code coverage with smart seeds via fuzzing and  static analysis",
    "abstract": "Bounded model checking (BMC) and fuzzing techniques are among the most effective methods for detecting errors and security vulnerabilities in software. However, there is still a shortcoming in detecting these errors due to the inability to cover large areas in the target code. Coverage standards and measures are also an excellent way to ascertain the effectiveness of the test suite. We propose FuSeBMC v4, a test generator that relies on smart seeds to improve the hybrid fuzzer to achieve high C programs coverage. First, FuSeBMC analyses and incrementally injects goal labels into the given C program to guide BMC and Evolutionary Fuzzing engines. Also, It ranks these goal labels according to the given strategy. After that, the engines are employed to produce smart seeds quickly to use later. Then, FuSeBMC coordinates between the engines and seed distribution by the Tracer. This Tracer generally manages the tool to record the goals covered and transfer the information between the engines by providing a shared memory to harness the power and take advantage of the power of each engine. So that the BMC engine helps give the seed that makes the fuzzing engine not struggle with complex mathematical guards. Furthermore, Tracer evaluates test cases dynamically to convert high-impact cases into seeds for subsequent test fuzzing. As a result, we received three awards for participation in the fourth international competition in software testing (Test-Comp 2022), outperforming all state-of-the-art tools in every category, including the coverage category. ",
    "url": "https://arxiv.org/abs/2206.14068",
    "authors": [
      "Kaled M. Alshmrany",
      "Mohannad Aldughaim",
      "Ahmed Bhayat",
      "Fedor Shmarov",
      "Fatimah Aljaafari",
      "Lucas C. Cordeiro"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2206.14076",
    "title": "Reasoning about Moving Target Defense in Attack Modeling Formalisms",
    "abstract": "Since 2009, Moving Target Defense (MTD) has become a new paradigm of defensive mechanism that frequently changes the state of the target system to confuse the attacker. This frequent change is costly and leads to a trade-off between misleading the attacker and disrupting the quality of service. Optimizing the MTD activation frequency is necessary to develop this defense mechanism when facing realistic, multi-step attack scenarios. Attack modeling formalisms based on DAG are prominently used to specify these scenarios. Our contribution is a new DAG-based formalism for MTDs and its translation into a Price Timed Markov Decision Process to find the best activation frequencies against the attacker's time/cost-optimal strategies. For the first time, MTD activation frequencies are analyzed in a state-of-the-art DAG-based representation. Moreover, this is the first paper that considers the specificity of MTDs in the automatic analysis of attack modeling formalisms. Finally, we present some experimental results using Uppaal Stratego to demonstrate its applicability and relevance. ",
    "url": "https://arxiv.org/abs/2206.14076",
    "authors": [
      "Gabriel Ballot",
      "Vadim Malvone",
      "Jean Leneutre",
      "Etienne Borde"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2206.14092",
    "title": "Learning the Solution Operator of Boundary Value Problems using Graph  Neural Networks",
    "abstract": "As an alternative to classical numerical solvers for partial differential equations (PDEs) subject to boundary value constraints, there has been a surge of interest in investigating neural networks that can solve such problems efficiently. In this work, we design a general solution operator for two different time-independent PDEs using graph neural networks (GNNs) and spectral graph convolutions. We train the networks on simulated data from a finite elements solver on a variety of shapes and inhomogeneities. In contrast to previous works, we focus on the ability of the trained operator to generalize to previously unseen scenarios. Specifically, we test generalization to meshes with different shapes and superposition of solutions for a different number of inhomogeneities. We find that training on a diverse dataset with lots of variation in the finite element meshes is a key ingredient for achieving good generalization results in all cases. With this, we believe that GNNs can be used to learn solution operators that generalize over a range of properties and produce solutions much faster than a generic solver. Our dataset, which we make publicly available, can be used and extended to verify the robustness of these models under varying conditions. ",
    "url": "https://arxiv.org/abs/2206.14092",
    "authors": [
      "Winfried Lötzsch",
      "Simon Ohler",
      "Johannes S. Otterbach"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2206.14098",
    "title": "RevBiFPN: The Fully Reversible Bidirectional Feature Pyramid Network",
    "abstract": "This work introduces the RevSilo, the first reversible module for bidirectional multi-scale feature fusion. Like other reversible methods, RevSilo eliminates the need to store hidden activations by recomputing them. Existing reversible methods, however, do not apply to multi-scale feature fusion and are therefore not applicable to a large class of networks. Bidirectional multi-scale feature fusion promotes local and global coherence and has become a de facto design principle for networks targeting spatially sensitive tasks e.g. HRNet and EfficientDet. When paired with high-resolution inputs, these networks achieve state-of-the-art results across various computer vision tasks, but training them requires substantial accelerator memory for saving large, multi-resolution activations. These memory requirements cap network size and limit progress. Using reversible recomputation, the RevSilo alleviates memory issues while still operating across resolution scales. Stacking RevSilos, we create RevBiFPN, a fully reversible bidirectional feature pyramid network. For classification, RevBiFPN is competitive with networks such as EfficientNet while using up to 19.8x lesser training memory. When fine-tuned on COCO, RevBiFPN provides up to a 2.5% boost in AP over HRNet using fewer MACs and a 2.4x reduction in training-time memory. ",
    "url": "https://arxiv.org/abs/2206.14098",
    "authors": [
      "Vitaliy Chiley",
      "Vithursan Thangarasa",
      "Abhay Gupta",
      "Anshul Samar",
      "Joel Hestness",
      "Dennis DeCoste"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.14116",
    "title": "SSL-Lanes: Self-Supervised Learning for Motion Forecasting in Autonomous  Driving",
    "abstract": "Self-supervised learning (SSL) is an emerging technique that has been successfully employed to train convolutional neural networks (CNNs) and graph neural networks (GNNs) for more transferable, generalizable, and robust representation learning. However its potential in motion forecasting for autonomous driving has rarely been explored. In this study, we report the first systematic exploration and assessment of incorporating self-supervision into motion forecasting. We first propose to investigate four novel self-supervised learning tasks for motion forecasting with theoretical rationale and quantitative and qualitative comparisons on the challenging large-scale Argoverse dataset. Secondly, we point out that our auxiliary SSL-based learning setup not only outperforms forecasting methods which use transformers, complicated fusion mechanisms and sophisticated online dense goal candidate optimization algorithms in terms of performance accuracy, but also has low inference time and architectural complexity. Lastly, we conduct several experiments to understand why SSL improves motion forecasting. Code is open-sourced at \\url{https://github.com/AutoVision-cloud/SSL-Lanes}. ",
    "url": "https://arxiv.org/abs/2206.14116",
    "authors": [
      "Prarthana Bhattacharyya",
      "Chengjie Huang",
      "Krzysztof Czarnecki"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2206.14122",
    "title": "Learning Variable Impedance Control for Aerial Sliding on Uneven  Heterogeneous Surfaces by Proprioceptive and Tactile Sensing",
    "abstract": "The recent development of novel aerial vehicles capable of physically interacting with the environment leads to new applications such as contact-based inspection. These tasks require the robotic system to exchange forces with partially-known environments, which may contain uncertainties including unknown spatially-varying friction properties and discontinuous variations of the surface geometry. Finding a control strategy that is robust against these environmental uncertainties remains an open challenge. This paper presents a learning-based adaptive control strategy for aerial sliding tasks. In particular, the gains of a standard impedance controller are adjusted in real-time by a policy based on the current control signals, proprioceptive measurements, and tactile sensing. This policy is trained in simulation with simplified actuator dynamics in a student-teacher learning setup. The real-world performance of the proposed approach is verified using a tilt-arm omnidirectional flying vehicle. The proposed controller structure combines data-driven and model-based control methods, enabling our approach to successfully transfer directly and without adaptation from simulation to the real platform. Compared to fine-tuned state of the art interaction control methods we achieve reduced tracking error and improved disturbance rejection. ",
    "url": "https://arxiv.org/abs/2206.14122",
    "authors": [
      "Weixuan Zhang",
      "Lionel Ott",
      "Marco Tognon",
      "Roland Siegwart"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2206.14135",
    "title": "Towards Explainable Metaheuristic: Mining Surrogate Fitness Models for  Importance of Variables",
    "abstract": "Metaheuristic search algorithms look for solutions that either maximise or minimise a set of objectives, such as cost or performance. However most real-world optimisation problems consist of nonlinear problems with complex constraints and conflicting objectives. The process by which a GA arrives at a solution remains largely unexplained to the end-user. A poorly understood solution will dent the confidence a user has in the arrived at solution. We propose that investigation of the variables that strongly influence solution quality and their relationship would be a step toward providing an explanation of the near-optimal solution presented by a metaheuristic. Through the use of four benchmark problems we use the population data generated by a Genetic Algorithm (GA) to train a surrogate model, and investigate the learning of the search space by the surrogate model. We compare what the surrogate has learned after being trained on population data generated after the first generation and contrast this with a surrogate model trained on the population data from all generations. We show that the surrogate model picks out key characteristics of the problem as it is trained on population data from each generation. Through mining the surrogate model we can build a picture of the learning process of a GA, and thus an explanation of the solution presented by the GA. The aim being to build trust and confidence in the end-user about the solution presented by the GA, and encourage adoption of the model. ",
    "url": "https://arxiv.org/abs/2206.14135",
    "authors": [
      "Manjinder Singh",
      "Alexander E.I. Brownlee",
      "David Cairns"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.14150",
    "title": "Autonomous Smart Grid Fault Detection",
    "abstract": "Smart grid plays a crucial role for the smart society and the upcoming carbon neutral society. Achieving autonomous smart grid fault detection is critical for smart grid system state awareness, maintenance and operation. This paper focuses on fault monitoring in smart grid and discusses the inherent technical challenges and solutions. In particular, we first present the basic principles of smart grid fault detection. Then, we explain the new requirements for autonomous smart grid fault detection, the technical challenges and their possible solutions. A case study is introduced, as a preliminary study for autonomous smart grid fault detection. In addition, we highlight relevant directions for future research. ",
    "url": "https://arxiv.org/abs/2206.14150",
    "authors": [
      "Qiyue Li",
      "Yuxing Deng",
      "Xin Liu",
      "Wei Sun",
      "Weitao Li",
      "Jie Li",
      "Zhi Liu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2206.14168",
    "title": "Comparison of metadata with relevance for bibliometrics between  Microsoft Academic Graph and OpenAlex until 2020",
    "abstract": "Microsoft Academic Graph (MAG) has been studied a lot concerning its suitability for bibliometric evaluations. In May 2021, it was announced that it would retire on December 31, 2021. Soon after that, the non-profit organization OurResearch, aiming at providing 'a fully open catalog of the global research system', announced they would preserve and incorporate the last full MAG corpus, only excluding patent data, and to continue and hopefully improve it. After the launch of OpenAlex in January 2022, it is of interest to know if the usefulness of the MAG data is preserved or even improved in OpenAlex. To this end, we compared metadata that are relevant for bibliometric analyses (in particular field and time normalization of citations) of MAG and OpenAlex: - the coverage of documents over the years, - the agreement of bibliographic data, - the numbers of references of each document, - the kind and distribution of document types, - the distribution and relation of subject classifications. ",
    "url": "https://arxiv.org/abs/2206.14168",
    "authors": [
      "Thomas Scheidsteger",
      "Robin Haunschild"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)"
    ]
  },
  {
    "id": "arXiv:2206.14169",
    "title": "Creation and Analysis of an International Corpus of Privacy Laws",
    "abstract": "The landscape of privacy laws and regulations around the world is complex and ever-changing. National and super-national laws, agreements, decrees, and other government-issued rules form a patchwork that companies must follow to operate internationally. To examine the status and evolution of this patchwork, we introduce the Government Privacy Instructions Corpus, or GPI Corpus, of 1,043 privacy laws, regulations, and guidelines, covering 182 jurisdictions. This corpus enables a large-scale quantitative and qualitative examination of legal foci on privacy. We examine the temporal distribution of when GPIs were created and illustrate the dramatic increase in privacy legislation over the past 50 years, although a finer-grained examination reveals that the rate of increase varies depending on the personal data types that GPIs address. Our exploration also demonstrates that most privacy laws respectively address relatively few personal data types, showing that comprehensive privacy legislation remains rare. Additionally, topic modeling results show the prevalence of common themes in GPIs, such as finance, healthcare, and telecommunications. Finally, we release the corpus to the research community to promote further study. ",
    "url": "https://arxiv.org/abs/2206.14169",
    "authors": [
      "Sonu Gupta",
      "Ellen Poplavska",
      "Nora O'Toole",
      "Siddhant Arora",
      "Thomas Norton",
      "Norman Sadeh",
      "Shomir Wilson"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2206.14195",
    "title": "Pedestrian 3D Bounding Box Prediction",
    "abstract": "Safety is still the main issue of autonomous driving, and in order to be globally deployed, they need to predict pedestrians' motions sufficiently in advance. While there is a lot of research on coarse-grained (human center prediction) and fine-grained predictions (human body keypoints prediction), we focus on 3D bounding boxes, which are reasonable estimates of humans without modeling complex motion details for autonomous vehicles. This gives the flexibility to predict in longer horizons in real-world settings. We suggest this new problem and present a simple yet effective model for pedestrians' 3D bounding box prediction. This method follows an encoder-decoder architecture based on recurrent neural networks, and our experiments show its effectiveness in both the synthetic (JTA) and real-world (NuScenes) datasets. The learned representation has useful information to enhance the performance of other tasks, such as action anticipation. Our code is available online: https://github.com/vita-epfl/bounding-box-prediction ",
    "url": "https://arxiv.org/abs/2206.14195",
    "authors": [
      "Saeed Saadatnejad",
      "Yi Zhou Ju",
      "Alexandre Alahi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2206.13505",
    "title": "Deep Learning-Based Defect Classification and Detection in SEM Images",
    "abstract": "This proposes a novel ensemble deep learning-based model to accurately classify, detect and localize different defect categories for aggressive pitches and thin resists (High NA applications).In particular, we train RetinaNet models using different ResNet, VGGNet architectures as backbone and present the comparison between the accuracies of these models and their performance analysis on SEM images with different types of defect patterns such as bridge, break and line collapses. Finally, we propose a preference-based ensemble strategy to combine the output predictions from different models in order to achieve better performance on classification and detection of defects. As CDSEM images inherently contain a significant level of noise, detailed feature information is often shadowed by noise. For certain resist profiles, the challenge is also to differentiate between a microbridge, footing, break, and zones of probable breaks. Therefore, we have applied an unsupervised machine learning model to denoise the SEM images to remove the False-Positive defects and optimize the effect of stochastic noise on structured pixels for better metrology and enhanced defect inspection. We repeated the defect inspection step with the same trained model and performed a comparative analysis for \"robustness\" and \"accuracy\" metric with conventional approach for both noisy/denoised image pair. The proposed ensemble method demonstrates improvement of the average precision metric (mAP) of the most difficult defect classes. In this work we have developed a novel robust supervised deep learning training scheme to accurately classify as well as localize different defect types in SEM images with high degree of accuracy. Our proposed approach demonstrates its effectiveness both quantitatively and qualitatively. ",
    "url": "https://arxiv.org/abs/2206.13505",
    "authors": [
      "Bappaditya Deya",
      "Dipam Goswamif",
      "Sandip Haldera",
      "Kasem Khalilb",
      "Philippe Leraya",
      "Magdy A. Bayoumi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13581",
    "title": "Exact Spectral Norm Regularization for Neural Networks",
    "abstract": "We pursue a line of research that seeks to regularize the spectral norm of the Jacobian of the input-output mapping for deep neural networks. While previous work rely on upper bounding techniques, we provide a scheme that targets the exact spectral norm. We showcase that our algorithm achieves an improved generalization performance compared to previous spectral regularization techniques while simultaneously maintaining a strong safeguard against natural and adversarial noise. Moreover, we further explore some previous reasoning concerning the strong adversarial protection that Jacobian regularization provides and show that it can be misleading. ",
    "url": "https://arxiv.org/abs/2206.13581",
    "authors": [
      "Anton Johansson",
      "Claes Strannegård",
      "Niklas Engsner",
      "Petter Mostad"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13632",
    "title": "Omni-Seg+: A Scale-aware Dynamic Network for Pathological Image  Segmentation",
    "abstract": "Comprehensive semantic segmentation on renal pathological images is challenging due to the heterogeneous scales of the objects. For example, on a whole slide image (WSI), the cross-sectional areas of glomeruli can be 64 times larger than that of the peritubular capillaries, making it impractical to segment both objects on the same patch, at the same scale. To handle this scaling issue, prior studies have typically trained multiple segmentation networks in order to match the optimal pixel resolution of heterogeneous tissue types. This multi-network solution is resource-intensive and fails to model the spatial relationship between tissue types. In this paper, we propose the Omni-Seg+ network, a scale-aware dynamic neural network that achieves multi-object (six tissue types) and multi-scale (5X to 40X scale) pathological image segmentation via a single neural network. The contribution of this paper is three-fold: (1) a novel scale-aware controller is proposed to generalize the dynamic neural network from single-scale to multi-scale; (2) semi-supervised consistency regularization of pseudo-labels is introduced to model the inter-scale correlation of unannotated tissue types into a single end-to-end learning paradigm; and (3) superior scale-aware generalization is evidenced by directly applying a model trained on human kidney images to mouse kidney images, without retraining. By learning from ~150,000 human pathological image patches from six tissue types at three different resolutions, our approach achieved superior segmentation performance according to human visual assessment and evaluation of image-omics (i.e., spatial transcriptomics). The official implementation is available at https://github.com/ddrrnn123/Omni-Seg. ",
    "url": "https://arxiv.org/abs/2206.13632",
    "authors": [
      "Ruining Deng",
      "Quan Liu",
      "Can Cui",
      "Tianyuan Yao",
      "Jun Long",
      "Zuhayr Asad",
      "R. Michael Womick",
      "Zheyu Zhu",
      "Agnes B. Fogo",
      "Shilin Zhao",
      "Haichun Yang",
      "Yuankai Huo"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13762",
    "title": "A Hierarchical Speaker Representation Framework for One-shot Singing  Voice Conversion",
    "abstract": "Typically, singing voice conversion (SVC) depends on an embedding vector, extracted from either a speaker lookup table (LUT) or a speaker recognition network (SRN), to model speaker identity. However, singing contains more expressive speaker characteristics than conversational speech. It is suspected that a single embedding vector may only capture averaged and coarse-grained speaker characteristics, which is insufficient for the SVC task. To this end, this work proposes a novel hierarchical speaker representation framework for SVC, which can capture fine-grained speaker characteristics at different granularity. It consists of an up-sampling stream and three down-sampling streams. The up-sampling stream transforms the linguistic features into audio samples, while one down-sampling stream of the three operates in the reverse direction. It is expected that the temporal statistics of each down-sampling block can represent speaker characteristics at different granularity, which will be engaged in the up-sampling blocks to enhance the speaker modeling. Experiment results verify that the proposed method outperforms both the LUT and SRN based SVC systems. Moreover, the proposed system supports the one-shot SVC with only a few seconds of reference audio. ",
    "url": "https://arxiv.org/abs/2206.13762",
    "authors": [
      "Xu Li",
      "Shansong Liu",
      "Ying Shan"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2206.13807",
    "title": "Two Methods for Spoofing-Aware Speaker Verification: Multi-Layer  Perceptron Score Fusion Model and Integrated Embedding Projector",
    "abstract": "The use of deep neural networks (DNN) has dramatically elevated the performance of automatic speaker verification (ASV) over the last decade. However, ASV systems can be easily neutralized by spoofing attacks. Therefore, the Spoofing-Aware Speaker Verification (SASV) challenge is designed and held to promote development of systems that can perform ASV considering spoofing attacks by integrating ASV and spoofing countermeasure (CM) systems. In this paper, we propose two back-end systems: multi-layer perceptron score fusion model (MSFM) and integrated embedding projector (IEP). The MSFM, score fusion back-end system, derived SASV score utilizing ASV and CM scores and embeddings. On the other hand,IEP combines ASV and CM embeddings into SASV embedding and calculates final SASV score based on the cosine similarity. We effectively integrated ASV and CM systems through proposed MSFM and IEP and achieved the SASV equal error rates 0.56%, 1.32% on the official evaluation trials of the SASV 2022 challenge. ",
    "url": "https://arxiv.org/abs/2206.13807",
    "authors": [
      "Jungwoo Heo",
      "Ju-ho Kim",
      "Hyun-seo Shin"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2206.13872",
    "title": "Disentangling Embedding Spaces with Minimal Distributional Assumptions",
    "abstract": "Interest in understanding and factorizing learned embedding spaces is growing. For instance, recent concept-based explanation techniques analyze a machine learning model in terms of interpretable latent components. Such components have to be discovered in the model's embedding space, e.g., through independent component analysis (ICA) or modern disentanglement learning techniques. While these unsupervised approaches offer a sound formal framework, they either require access to a data generating function or impose rigid assumptions on the data distribution, such as independence of components, that are often violated in practice. In this work, we link conceptual explainability for vision models with disentanglement learning and ICA. This enables us to provide first theoretical results on how components can be identified without requiring any distributional assumptions. From these insights, we derive the disjoint attributions (DA) concept discovery method that is applicable to a broader class of problems than current approaches but yet possesses a formal identifiability guarantee. In an extensive comparison against component analysis and over 300 state-of-the-art disentanglement models, DA stably maintains superior performance, even under varying distributions and correlation strengths. ",
    "url": "https://arxiv.org/abs/2206.13872",
    "authors": [
      "Tobias Leemann",
      "Michael Kirchhof",
      "Yao Rong",
      "Enkelejda Kasneci",
      "Gjergji Kasneci"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.13903",
    "title": "AS-IntroVAE: Adversarial Similarity Distance Makes Robust IntroVAE",
    "abstract": "Recently, introspective models like IntroVAE and S-IntroVAE have excelled in image generation and reconstruction tasks. The principal characteristic of introspective models is the adversarial learning of VAE, where the encoder attempts to distinguish between the real and the fake (i.e., synthesized) images. However, due to the unavailability of an effective metric to evaluate the difference between the real and the fake images, the posterior collapse and the vanishing gradient problem still exist, reducing the fidelity of the synthesized images. In this paper, we propose a new variation of IntroVAE called Adversarial Similarity Distance Introspective Variational Autoencoder (AS-IntroVAE). We theoretically analyze the vanishing gradient problem and construct a new Adversarial Similarity Distance (AS-Distance) using the 2-Wasserstein distance and the kernel trick. With weight annealing on AS-Distance and KL-Divergence, the AS-IntroVAE are able to generate stable and high-quality images. The posterior collapse problem is addressed by making per-batch attempts to transform the image so that it better fits the prior distribution in the latent space. Compared with the per-image approach, this strategy fosters more diverse distributions in the latent space, allowing our model to produce images of great diversity. Comprehensive experiments on benchmark datasets demonstrate the effectiveness of AS-IntroVAE on image generation and reconstruction tasks. ",
    "url": "https://arxiv.org/abs/2206.13903",
    "authors": [
      "Changjie Lu",
      "Shen Zheng",
      "Zirui Wang",
      "Omar Dib",
      "Gaurav Gupta"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.14109",
    "title": "Optimization of QKD Networks with Classical and Quantum Annealing",
    "abstract": "This paper analyses a classical and a quantum annealing approach to compute the minimum deployment of Quantum Key Distribution (QKD) hardware in a tier 1 provider network. The ensemble of QKD systems needs to be able to exchange as many encryption keys between all network nodes in order to encrypt the data payload, which is defined by traffic demand matrices. Redundancy and latency requirements add additional boundary conditions. The result of the optimization problem yields a classical heuristic network planners may utilize for planning future QKD quantum networks. ",
    "url": "https://arxiv.org/abs/2206.14109",
    "authors": [
      "Bob Godar",
      "Christoph Roch",
      "Jonas Stein",
      "Marc Geitz",
      "Bettina Lehmann",
      "Matthias Gunkel",
      "Volker Fürst",
      "Fred Hofmann"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2206.14115",
    "title": "Quantum Neural Architecture Search with Quantum Circuits Metric and  Bayesian Optimization",
    "abstract": "Quantum neural networks are promising for a wide range of applications in the Noisy Intermediate-Scale Quantum era. As such, there is an increasing demand for automatic quantum neural architecture search. We tackle this challenge by designing a quantum circuits metric for Bayesian optimization with Gaussian process. To this goal, we propose a new quantum gates distance that characterizes the gates' action over every quantum state and provide a theoretical perspective on its geometrical properties. Our approach significantly outperforms the benchmark on three empirical quantum machine learning problems including training a quantum generative adversarial network, solving combinatorial optimization in the MaxCut problem, and simulating quantum Fourier transform. Our method can be extended to characterize behaviors of various quantum machine learning models. ",
    "url": "https://arxiv.org/abs/2206.14115",
    "authors": [
      "Trong Duong",
      "Sang T. Truong",
      "Minh Tam",
      "Bao Bach",
      "Ju-Young Ryu",
      "June-Koo Kevin Rhee"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.14184",
    "title": "Integral Transforms in a Physics-Informed (Quantum) Neural Network  setting: Applications & Use-Cases",
    "abstract": "In many computational problems in engineering and science, function or model differentiation is essential, but also integration is needed. An important class of computational problems include so-called integro-differential equations which include both integrals and derivatives of a function. In another example, stochastic differential equations can be written in terms of a partial differential equation of a probability density function of the stochastic variable. To learn characteristics of the stochastic variable based on the density function, specific integral transforms, namely moments, of the density function need to be calculated. Recently, the machine learning paradigm of Physics-Informed Neural Networks emerged with increasing popularity as a method to solve differential equations by leveraging automatic differentiation. In this work, we propose to augment the paradigm of Physics-Informed Neural Networks with automatic integration in order to compute complex integral transforms on trained solutions, and to solve integro-differential equations where integrals are computed on-the-fly during training. Furthermore, we showcase the techniques in various application settings, numerically simulating quantum computer-based neural networks as well as classical neural networks. ",
    "url": "https://arxiv.org/abs/2206.14184",
    "authors": [
      "Niraj Kumar",
      "Evan Philip",
      "Vincent E. Elfving"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1906.00756",
    "title": "The Strength of Structural Diversity in Online Social Networks",
    "abstract": " Comments: 16 pages, 6 figures ",
    "url": "https://arxiv.org/abs/1906.00756",
    "authors": [
      "Yafei Zhang",
      "Lin Wang",
      "Jonathan J. H. Zhu",
      "Xiaofan Wang",
      "Alex 'Sandy' Pentland"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2008.10796",
    "title": "Deep Variational Network Toward Blind Image Restoration",
    "abstract": " Comments: Extended Version of VDNet (NeurIPS 2019) ",
    "url": "https://arxiv.org/abs/2008.10796",
    "authors": [
      "Zongsheng Yue",
      "Hongwei Yong",
      "Qian Zhao",
      "Lei Zhang",
      "Deyu Meng",
      "Kwan-Yen K. Wong"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2008.12073",
    "title": "DrumGAN: Synthesis of Drum Sounds With Timbral Feature Conditioning  Using Generative Adversarial Networks",
    "abstract": " Comments: 8 pages, 1 figure, 3 tables, accepted in Proc. of the 21st International Society for Music Information Retrieval (ISMIR2020) ",
    "url": "https://arxiv.org/abs/2008.12073",
    "authors": [
      "J. Nistal",
      "S. Lattner",
      "G. Richard"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2101.00756",
    "title": "NCQ: Code reuse support for node.js developers",
    "abstract": " Comments: Submitted to IEEE Transactions on Software Engineering ",
    "url": "https://arxiv.org/abs/2101.00756",
    "authors": [
      "Brittany Reid",
      "Marcelo d`Amorim",
      "Markus Wagner",
      "Christoph Treude"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2101.03297",
    "title": "Incentive Design and Profit Sharing in Multi-modal Transportation  Network",
    "abstract": " Title: Incentive Design and Profit Sharing in Multi-modal Transportation  Network ",
    "url": "https://arxiv.org/abs/2101.03297",
    "authors": [
      "Yuntian Deng",
      "Shiping Shao",
      "Archak Mittal",
      "Richard Twumasi-Boakye",
      "James Fishelson",
      "Abhishek Gupta",
      "Ness B. Shroff"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2103.15708",
    "title": "Dynamically Modelling Heterogeneous Higher-Order Interactions for  Malicious Behavior Detection in Event Logs",
    "abstract": " Title: Dynamically Modelling Heterogeneous Higher-Order Interactions for  Malicious Behavior Detection in Event Logs ",
    "url": "https://arxiv.org/abs/2103.15708",
    "authors": [
      "Corentin Larroche",
      "Johan Mazel",
      "Stephan Clémençon"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2104.15022",
    "title": "Deep Image Destruction: Vulnerability of Deep Image-to-Image Models  against Adversarial Attacks",
    "abstract": " Comments: ICPR2022 ",
    "url": "https://arxiv.org/abs/2104.15022",
    "authors": [
      "Jun-Ho Choi",
      "Huan Zhang",
      "Jun-Hyuk Kim",
      "Cho-Jui Hsieh",
      "Jong-Seok Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2105.03726",
    "title": "Mental Models of Adversarial Machine Learning",
    "abstract": " Comments: accepted at SOUPS 2022 ",
    "url": "https://arxiv.org/abs/2105.03726",
    "authors": [
      "Lukas Bieringer",
      "Kathrin Grosse",
      "Michael Backes",
      "Battista Biggio",
      "Katharina Krombholz"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.02866",
    "title": "Conditional Contrastive Learning for Improving Fairness in  Self-Supervised Learning",
    "abstract": " Title: Conditional Contrastive Learning for Improving Fairness in  Self-Supervised Learning ",
    "url": "https://arxiv.org/abs/2106.02866",
    "authors": [
      "Martin Q. Ma",
      "Yao-Hung Hubert Tsai",
      "Paul Pu Liang",
      "Han Zhao",
      "Kun Zhang",
      "Ruslan Salakhutdinov",
      "Louis-Philippe Morency"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.03693",
    "title": "Learning by Transference: Training Graph Neural Networks on Growing  Graphs",
    "abstract": " Title: Learning by Transference: Training Graph Neural Networks on Growing  Graphs ",
    "url": "https://arxiv.org/abs/2106.03693",
    "authors": [
      "Juan Cervino",
      "Luana Ruiz",
      "Alejandro Ribeiro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2106.08176",
    "title": "Automated triaging of head MRI examinations using convolutional neural  networks",
    "abstract": " Comments: Accepted as an oral presentation at Medical Imaging with Deep Learning (MIDL) 2021 ",
    "url": "https://arxiv.org/abs/2106.08176",
    "authors": [
      "David A. Wood",
      "Sina Kafiabadi",
      "Ayisha Al Busaidi",
      "Emily Guilhem",
      "Antanas Montvila",
      "Siddharth Agarwal",
      "Jeremy Lynch",
      "Matthew Townend",
      "Gareth Barker",
      "Sebastien Ourselin",
      "James H. Cole",
      "Thomas C. Booth"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.08829",
    "title": "Visual Adversarial Imitation Learning using Variational Models",
    "abstract": " Title: Visual Adversarial Imitation Learning using Variational Models ",
    "url": "https://arxiv.org/abs/2107.08829",
    "authors": [
      "Rafael Rafailov",
      "Tianhe Yu",
      "Aravind Rajeswaran",
      "Chelsea Finn"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2108.06706",
    "title": "Temporal Action Segmentation with High-level Complex Activity Labels",
    "abstract": " Comments: 12 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2108.06706",
    "authors": [
      "Guodong Ding",
      "Angela Yao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.03856",
    "title": "Local Augmentation for Graph Neural Networks",
    "abstract": " Comments: Accepted by ICML'22 ",
    "url": "https://arxiv.org/abs/2109.03856",
    "authors": [
      "Songtao Liu",
      "Rex Ying",
      "Hanze Dong",
      "Lanqing Li",
      "Tingyang Xu",
      "Yu Rong",
      "Peilin Zhao",
      "Junzhou Huang",
      "Dinghao Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.04344",
    "title": "EvilModel 2.0: Bringing Neural Network Models into Malware Attacks",
    "abstract": " Comments: A newer version of this paper has been accepted at Computers & Security. Free access to the final version at this https URL before August 16, 2022. This paper is an extended version of work that was first presented at the 26th IEEE Symposium on Computers and Communications (ISCC 2021) ",
    "url": "https://arxiv.org/abs/2109.04344",
    "authors": [
      "Zhi Wang",
      "Chaoge Liu",
      "Xiang Cui",
      "Jie Yin",
      "Xutong Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.09190",
    "title": "Harnessing the Power of Ego Network Layers for Link Prediction in Online  Social Networks",
    "abstract": " Comments: This work was partially funded by the following projects. European Union's Horizon 2020 research and innovation programme: SoBigData++ (No 871042), HumaneAI-Net (No 952026), MARVEL (No 957337). Italian PON-MISE program: OK-INSAID project (No ARS01 00917). CHIST-ERA program: SAI project (grant CHIST-ERA-19-XAI-010, funded by MUR, grant number not yet available). in IEEE Transactions on Computational Social Systems, 2022 ",
    "url": "https://arxiv.org/abs/2109.09190",
    "authors": [
      "Mustafa Toprak",
      "Chiara Boldrini",
      "Andrea Passarella",
      "Marco Conti"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.12065",
    "title": "DeepStroke: An Efficient Stroke Screening Framework for Emergency Rooms  with Multimodal Adversarial Deep Learning",
    "abstract": " Title: DeepStroke: An Efficient Stroke Screening Framework for Emergency Rooms  with Multimodal Adversarial Deep Learning ",
    "url": "https://arxiv.org/abs/2109.12065",
    "authors": [
      "Tongan Cai",
      "Haomiao Ni",
      "Mingli Yu",
      "Xiaolei Huang",
      "Kelvin Wong",
      "John Volpi",
      "James Z. Wang",
      "Stephen T.C. Wong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2109.12079",
    "title": "SEED: Semantic Graph based Deep detection for type-4 clone",
    "abstract": " Comments: 18 pages ",
    "url": "https://arxiv.org/abs/2109.12079",
    "authors": [
      "Zhipeng Xue",
      "Zhijie Jiang",
      "Chenlin Huang",
      "Rulin Xu",
      "Xiangbing Huang",
      "Liumin Hu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2109.13099",
    "title": "Clone-based code method usage pattern mining",
    "abstract": " Comments: 5 pages, accepted by ICPC2022-ERA ",
    "url": "https://arxiv.org/abs/2109.13099",
    "authors": [
      "Zhipeng Xue",
      "Yuanliang Zhang",
      "Rulin Xu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2110.01925",
    "title": "Journalists' ego networks in Twitter: invariant and distinctive  structural features",
    "abstract": " Comments: This work was partially funded by the following projects. European Union's Horizon 2020 research and innovation programme: SoBigData++ (No 871042), HumaneAI-Net (No 952026), MARVEL (No 957337). Italian PON-MISE program: OK-INSAID project (No ARS01 00917). CHIST-ERA program: SAI project (grant CHIST-ERA-19-XAI-010, funded by MUR, grant number not yet available) ",
    "url": "https://arxiv.org/abs/2110.01925",
    "authors": [
      "Mustafa Toprak",
      "Chiara Boldrini",
      "Andrea Passarella",
      "Marco Conti"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2110.05371",
    "title": "Graph-Based Machine Learning Improves Just-in-Time Defect Prediction",
    "abstract": " Comments: 18 pages, 2 figures, 2 tables; references added; expanded results to match baseline conditions ",
    "url": "https://arxiv.org/abs/2110.05371",
    "authors": [
      "Jonathan Bryan",
      "Pablo Moriano"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.08101",
    "title": "An Artificial Neural Network-Based Model Predictive Control for  Three-phase Flying Capacitor Multi-Level Inverter",
    "abstract": " Comments: This paper has been accepted for publication at IEEE Access. It has 12 pages, 22 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2110.08101",
    "authors": [
      "Abualkasim Bakeer",
      "Ihab S. Mohamed",
      "Parisa Boodaghi Malidarreh",
      "Intissar Hattabi",
      "Lantao Liu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.08232",
    "title": "Fire Together Wire Together: A Dynamic Pruning Approach with  Self-Supervised Mask Prediction",
    "abstract": " Title: Fire Together Wire Together: A Dynamic Pruning Approach with  Self-Supervised Mask Prediction ",
    "url": "https://arxiv.org/abs/2110.08232",
    "authors": [
      "Sara Elkerdawy",
      "Mostafa Elhoushi",
      "Hong Zhang",
      "Nilanjan Ray"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.14763",
    "title": "Using PPP Information to Implement a Global Real-Time Virtual Network  DGNSS Approach",
    "abstract": " Comments: 14 pages, 8 tables, 4 figures, Code and data are available at this https URL ",
    "url": "https://arxiv.org/abs/2110.14763",
    "authors": [
      "Wang Hu",
      "Ashim Neupane",
      "Jay A. Farrell"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2111.02740",
    "title": "Sequential Movie Genre Prediction using Average Transition Probability  with Clustering",
    "abstract": " Comments: Published as a journal (this https URL) ",
    "url": "https://arxiv.org/abs/2111.02740",
    "authors": [
      "Jihyeon Kim",
      "Jinkyung Kim",
      "Jaeyoung Choi"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2111.04904",
    "title": "Joint Neural AEC and Beamforming with Double-Talk Detection",
    "abstract": " Comments: Accepted in Interspeech 2022 ",
    "url": "https://arxiv.org/abs/2111.04904",
    "authors": [
      "Vinay Kothapally",
      "Yong Xu",
      "Meng Yu",
      "Shi-Xiong Zhang",
      "Dong Yu"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2112.02265",
    "title": "\"Stop Asian Hate!\" : Refining Detection of Anti-Asian Hate Speech During  the COVID-19 Pandemic",
    "abstract": " Title: \"Stop Asian Hate!\" : Refining Detection of Anti-Asian Hate Speech During  the COVID-19 Pandemic ",
    "url": "https://arxiv.org/abs/2112.02265",
    "authors": [
      "Huy Nghiem",
      "Fred Morstatter"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2112.11628",
    "title": "SkipNode: On Alleviating Over-smoothing for Deep Graph Convolutional  Networks",
    "abstract": " Comments: 12 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2112.11628",
    "authors": [
      "Weigang Lu",
      "Yibing Zhan",
      "Ziyu Guan",
      "Liu Liu",
      "Baosheng Yu",
      "Wei Zhao",
      "Yaming Yang",
      "Dacheng Tao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.00150",
    "title": "Cross-Domain Deep Code Search with Few-Shot Meta Learning",
    "abstract": " Comments: Accepted by ICSE 2022 (The 44th International Conference on Software Engineering) ",
    "url": "https://arxiv.org/abs/2201.00150",
    "authors": [
      "Yitian Chai",
      "Hongyu Zhang",
      "Beijun Shen",
      "Xiaodong Gu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2201.09659",
    "title": "Surrogate Neural Network Model for Sensitivity Analysis and Uncertainty  Quantification of the Mechanical Behavior in the Optical Lens-Barrel Assembly",
    "abstract": " Title: Surrogate Neural Network Model for Sensitivity Analysis and Uncertainty  Quantification of the Mechanical Behavior in the Optical Lens-Barrel Assembly ",
    "url": "https://arxiv.org/abs/2201.09659",
    "authors": [
      "Shantanu Shahane",
      "Erman Guleryuz",
      "Diab W Abueidda",
      "Allen Lee",
      "Joe Liu",
      "Xin Yu",
      "Raymond Chiu",
      "Seid Koric",
      "Narayana R Aluru",
      "Placid M Ferreira"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2202.02628",
    "title": "Improved Certified Defenses against Data Poisoning with (Deterministic)  Finite Aggregation",
    "abstract": " Comments: International Conference on Machine Learning (ICML), 2022 ",
    "url": "https://arxiv.org/abs/2202.02628",
    "authors": [
      "Wenxiao Wang",
      "Alexander Levine",
      "Soheil Feizi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2202.02981",
    "title": "Neural Tangent Kernel Analysis of Deep Narrow Neural Networks",
    "abstract": " Title: Neural Tangent Kernel Analysis of Deep Narrow Neural Networks ",
    "url": "https://arxiv.org/abs/2202.02981",
    "authors": [
      "Jongmin Lee",
      "Joo Young Choi",
      "Ernest K. Ryu",
      "Albert No"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2202.06503",
    "title": "Adaptive Graph Convolutional Networks for Weakly Supervised Anomaly  Detection in Videos",
    "abstract": " Title: Adaptive Graph Convolutional Networks for Weakly Supervised Anomaly  Detection in Videos ",
    "url": "https://arxiv.org/abs/2202.06503",
    "authors": [
      "Congqi Cao",
      "Xin Zhang",
      "Shizhou Zhang",
      "Peng Wang",
      "Yanning Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.09791",
    "title": "Contextual Semantic Embeddings for Ontology Subsumption Prediction",
    "abstract": " Comments: This article arXiv:2202.09791 should be replaced by our new version arXiv:2112.10006 ",
    "url": "https://arxiv.org/abs/2202.09791",
    "authors": [
      "Jiaoyan Chen",
      "Yuan He",
      "Ernesto Jimenez-Ruiz",
      "Hang Dong",
      "Ian Horrocks"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2202.12664",
    "title": "Automorphisms of Set Families and of Families of Cliques in an Interval  Graph in FPT Time",
    "abstract": " Title: Automorphisms of Set Families and of Families of Cliques in an Interval  Graph in FPT Time ",
    "url": "https://arxiv.org/abs/2202.12664",
    "authors": [
      "Deniz Ağaoğlu Çağırıcı",
      "Petr Hliněný"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2203.02846",
    "title": "Region Proposal Rectification Towards Robust Instance Segmentation of  Biological Images",
    "abstract": " Title: Region Proposal Rectification Towards Robust Instance Segmentation of  Biological Images ",
    "url": "https://arxiv.org/abs/2203.02846",
    "authors": [
      "Qilong Zhangli",
      "Jingru Yi",
      "Di Liu",
      "Xiaoxiao He",
      "Zhaoyang Xia",
      "Qi Chang",
      "Ligong Han",
      "Yunhe Gao",
      "Song Wen",
      "Haiming Tang",
      "He Wang",
      "Mu Zhou",
      "Dimitris Metaxas"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.04503",
    "title": "An Energy Sharing Mechanism Considering Network Constraints and Market  Power Limitation",
    "abstract": " Comments: 23 pages, 14 figures ",
    "url": "https://arxiv.org/abs/2203.04503",
    "authors": [
      "Yue Chen",
      "Changhong Zhao",
      "Steven H. Low",
      "Adam Wierman"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.06768",
    "title": "Let Users Decide: Navigating the Trade-offs between Costs and Robustness  in Algorithmic Recourse",
    "abstract": " Title: Let Users Decide: Navigating the Trade-offs between Costs and Robustness  in Algorithmic Recourse ",
    "url": "https://arxiv.org/abs/2203.06768",
    "authors": [
      "Martin Pawelczyk",
      "Teresa Datta",
      "Johannes van-den-Heuvel",
      "Gjergji Kasneci",
      "Himabindu Lakkaraju"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2203.12937",
    "title": "SelfRemaster: Self-Supervised Speech Restoration with  Analysis-by-Synthesis Approach Using Channel Modeling",
    "abstract": " Comments: Accepted to INTERSPEECH 2022 ",
    "url": "https://arxiv.org/abs/2203.12937",
    "authors": [
      "Takaaki Saeki",
      "Shinnosuke Takamichi",
      "Tomohiko Nakamura",
      "Naoko Tanji",
      "Hiroshi Saruwatari"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.02033",
    "title": "Enhanced Neck Feature Representation for Object Detection in Aerial  Images",
    "abstract": " Comments: 5 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2204.02033",
    "authors": [
      "Yuchen Shen",
      "Dong Zhang",
      "Zhihao Song",
      "Xuesong Jiang",
      "Qiaolin Ye"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.06478",
    "title": "BEHM-GAN: Bandwidth Extension of Historical Music using Generative  Adversarial Networks",
    "abstract": " Comments: Accepted at IEEE Transactions on Audio, Speech, and Language Processing ",
    "url": "https://arxiv.org/abs/2204.06478",
    "authors": [
      "Eloi Moliner",
      "Vesa Välimäki"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.08198",
    "title": "UTNLP at SemEval-2022 Task 6: A Comparative Analysis of Sarcasm  Detection Using Generative-based and Mutation-based Data Augmentation",
    "abstract": " Comments: 6 pages, 2 figures, International Workshop on Semantic Evaluation co-located with NAACL ",
    "url": "https://arxiv.org/abs/2204.08198",
    "authors": [
      "Amirhossein Abaskohi",
      "Arash Rasouli",
      "Tanin Zeraati",
      "Behnam Bahrak"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.11515",
    "title": "Multimodal Dual Emotion with Fusion of Visual Sentiment for Rumor  Detection",
    "abstract": " Title: Multimodal Dual Emotion with Fusion of Visual Sentiment for Rumor  Detection ",
    "url": "https://arxiv.org/abs/2204.11515",
    "authors": [
      "Ge Wang",
      "Li Tan",
      "Ziliang Shang",
      "He Liu"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.05715",
    "title": "Causal discovery under a confounder blanket",
    "abstract": " Comments: Camera ready version (UAI 2022) ",
    "url": "https://arxiv.org/abs/2205.05715",
    "authors": [
      "David S. Watson",
      "Ricardo Silva"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.11725",
    "title": "A Survey on Neural Open Information Extraction: Current Status and  Future Directions",
    "abstract": " Comments: Accepted by IJCAI22 survey track ",
    "url": "https://arxiv.org/abs/2205.11725",
    "authors": [
      "Shaowen Zhou",
      "Bowen Yu",
      "Aixin Sun",
      "Cheng Long",
      "Jingyang Li",
      "Haiyang Yu",
      "Jian Sun",
      "Yongbin Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2206.01413",
    "title": "Impact of the composition of feature extraction and class sampling in  medicare fraud detection",
    "abstract": " Title: Impact of the composition of feature extraction and class sampling in  medicare fraud detection ",
    "url": "https://arxiv.org/abs/2206.01413",
    "authors": [
      "Akrity Kumari",
      "Narinder Singh Punn",
      "Sanjay Kumar Sonbhadra",
      "Sonali Agarwal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.05837",
    "title": "NeuralODF: Learning Omnidirectional Distance Fields for 3D Shape  Representation",
    "abstract": " Title: NeuralODF: Learning Omnidirectional Distance Fields for 3D Shape  Representation ",
    "url": "https://arxiv.org/abs/2206.05837",
    "authors": [
      "Trevor Houchens",
      "Cheng-You Lu",
      "Shivam Duggal",
      "Rao Fu",
      "Srinath Sridhar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.09055",
    "title": "Augmented Imagefication: A Data-driven Fault Detection Method for  Aircraft Air Data Sensors",
    "abstract": " Comments: a crucial design defect to acquire flying data by simulation ",
    "url": "https://arxiv.org/abs/2206.09055",
    "authors": [
      "Hang Zhao",
      "Jinyi Ma",
      "Zhongzhi Li",
      "Yiqun Dong",
      "Jianliang Ai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.09961",
    "title": "Critical Investigation of Failure Modes in Physics-informed Neural  Networks",
    "abstract": " Title: Critical Investigation of Failure Modes in Physics-informed Neural  Networks ",
    "url": "https://arxiv.org/abs/2206.09961",
    "authors": [
      "Shamsulhaq Basir",
      "Inanc Senocak"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2206.11017",
    "title": "Object Type Clustering using Markov Directly-Follow Multigraph in  Object-Centric Process Mining",
    "abstract": " Title: Object Type Clustering using Markov Directly-Follow Multigraph in  Object-Centric Process Mining ",
    "url": "https://arxiv.org/abs/2206.11017",
    "authors": [
      "Amin Jalali"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.11168",
    "title": "Ordered Subgraph Aggregation Networks",
    "abstract": " Comments: Fixed link to code repository ",
    "url": "https://arxiv.org/abs/2206.11168",
    "authors": [
      "Chendi Qian",
      "Gaurav Rattan",
      "Floris Geerts",
      "Christopher Morris",
      "Mathias Niepert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Data Structures and Algorithms (cs.DS)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2206.11339",
    "title": "Precipitation event-based networks: an analysis of the relations between  network metrics and meteorological properties",
    "abstract": " Comments: 5 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2206.11339",
    "authors": [
      "Aurelienne A. S. Jorge",
      "Douglas Uba",
      "Alex A. Fernandes",
      "Izabelly C. Costa",
      "Leonardo B. L. Santos"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2206.11723",
    "title": "Self-Supervised Training with Autoencoders for Visual Anomaly Detection",
    "abstract": " Title: Self-Supervised Training with Autoencoders for Visual Anomaly Detection ",
    "url": "https://arxiv.org/abs/2206.11723",
    "authors": [
      "Alexander Bauer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.11892",
    "title": "DDPM-CD: Remote Sensing Change Detection using Denoising Diffusion  Probabilistic Models",
    "abstract": " Comments: Code available at: this https URL ",
    "url": "https://arxiv.org/abs/2206.11892",
    "authors": [
      "Wele Gedara Chaminda Bandara",
      "Nithin Gopalakrishnan Nair",
      "Vishal M. Patel"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.12236",
    "title": "Multi-relational Instruction Association Graph for Cross-architecture  Binary Similarity Comparison",
    "abstract": " Comments: Accepted by EAI SecureComm 2022, 20 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2206.12236",
    "authors": [
      "Qige Song",
      "Yongzheng Zhang",
      "Shuhao Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2206.12401",
    "title": "Debiasing Learning for Membership Inference Attacks Against Recommender  Systems",
    "abstract": " Comments: Accepted by KDD 2022 ",
    "url": "https://arxiv.org/abs/2206.12401",
    "authors": [
      "Zihan Wang",
      "Na Huang",
      "Fei Sun",
      "Pengjie Ren",
      "Zhumin Chen",
      "Hengliang Luo",
      "Maarten de Rijke",
      "Zhaochun Ren"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.12520",
    "title": "Learning to learn online with neuromodulated synaptic plasticity in  spiking neural networks",
    "abstract": " Title: Learning to learn online with neuromodulated synaptic plasticity in  spiking neural networks ",
    "url": "https://arxiv.org/abs/2206.12520",
    "authors": [
      "Samuel Schmidgall",
      "Joe Hays"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.12755",
    "title": "Training Your Sparse Neural Network Better with Any Mask",
    "abstract": " Comments: Accepted by ICML 2022 ",
    "url": "https://arxiv.org/abs/2206.12755",
    "authors": [
      "Ajay Jaiswal",
      "Haoyu Ma",
      "Tianlong Chen",
      "Ying Ding",
      "Zhangyang Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.12869",
    "title": "Image Aesthetics Assessment Using Graph Attention Network",
    "abstract": " Comments: International Conference on Pattern Recognition (ICPR), 2022 ",
    "url": "https://arxiv.org/abs/2206.12869",
    "authors": [
      "Koustav Ghosal",
      "Aljosa Smolic"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13280",
    "title": "Expressive power of binary and ternary neural networks",
    "abstract": " Title: Expressive power of binary and ternary neural networks ",
    "url": "https://arxiv.org/abs/2206.13280",
    "authors": [
      "Aleksandr Beknazaryan"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2206.13318",
    "title": "Key-frame Guided Network for Thyroid Nodule Recognition using Ultrasound  Videos",
    "abstract": " Title: Key-frame Guided Network for Thyroid Nodule Recognition using Ultrasound  Videos ",
    "url": "https://arxiv.org/abs/2206.13318",
    "authors": [
      "Yuchen Wang",
      "Zhongyu Li",
      "Xiangxiang Cui",
      "Liangliang Zhang",
      "Xiang Luo",
      "Meng Yang",
      "Shi Chang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2206.13404",
    "title": "Avocodo: Generative Adversarial Network for Artifact-free Vocoder",
    "abstract": " Title: Avocodo: Generative Adversarial Network for Artifact-free Vocoder ",
    "url": "https://arxiv.org/abs/2206.13404",
    "authors": [
      "Taejun Bak",
      "Junmo Lee",
      "Hanbin Bae",
      "Jinhyeok Yang",
      "Jae-Sung Bae",
      "Young-Sun Joo"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Sound (cs.SD)"
    ]
  }
]