[
  {
    "id": "arXiv:2310.16848",
    "title": "Detecting Changes in Crowdsourced Social Media Images",
    "abstract": "We propose a novel service framework to detect changes in crowdsourced images. We use a service-oriented approach to model and represent crowdsourced images as image services. Non-functional attributes of an image service are leveraged to detect changes in an image. The changes are reported in form of a version tree. The version tree is constructed in a way that it reflects the extent of changes introduced in different versions. Afterwards, we find semantic differences in between different versions to determine the extent of changes introduced in a specific version. Preliminary experimental results demonstrate the effectiveness of the proposed approach. ",
    "url": "https://arxiv.org/abs/2310.16848",
    "authors": [
      "Muhammad Umair",
      "Athman Bouguettaya",
      "Abdallah Lakhdari"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2310.16853",
    "title": "CP-BCS: Binary Code Summarization Guided by Control Flow Graph and  Pseudo Code",
    "abstract": "Automatically generating function summaries for binaries is an extremely valuable but challenging task, since it involves translating the execution behavior and semantics of the low-level language (assembly code) into human-readable natural language. However, most current works on understanding assembly code are oriented towards generating function names, which involve numerous abbreviations that make them still confusing. To bridge this gap, we focus on generating complete summaries for binary functions, especially for stripped binary (no symbol table and debug information in reality). To fully exploit the semantics of assembly code, we present a control flow graph and pseudo code guided binary code summarization framework called CP-BCS. CP-BCS utilizes a bidirectional instruction-level control flow graph and pseudo code that incorporates expert knowledge to learn the comprehensive binary function execution behavior and logic semantics. We evaluate CP-BCS on 3 different binary optimization levels (O1, O2, and O3) for 3 different computer architectures (X86, X64, and ARM). The evaluation results demonstrate CP-BCS is superior and significantly improves the efficiency of reverse engineering. ",
    "url": "https://arxiv.org/abs/2310.16853",
    "authors": [
      "Tong Ye",
      "Lingfei Wu",
      "Tengfei Ma",
      "Xuhong Zhang",
      "Yangkai Du",
      "Peiyu Liu",
      "Shouling Ji",
      "Wenhai Wang"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.16858",
    "title": "4D-Editor: Interactive Object-level Editing in Dynamic Neural Radiance  Fields via 4D Semantic Segmentation",
    "abstract": "This paper targets interactive object-level editing(e.g., deletion, recoloring, transformation, composition) in dynamic scenes. Recently, some methods aiming for flexible editing static scenes represented by neural radiance field (NeRF) have shown impressive synthesis quality, while similar capabilities in time-variant dynamic scenes remain limited. To solve this problem, we propose 4D-Editor, an interactive semantic-driven editing framework, allowing editing multiple objects in dynamic NeRF based on user strokes on a single frame. Our dynamic scene representation is built upon hybrid semantic feature fields so that the spatial-temporal consistency can be maintained after editing. In addition, we design recursive selection refinement that significantly boosts segmentation accuracy in a dynamic NeRF to aid the editing process. Moreover, we develop multi-view reprojection inpainting to fill holes caused by incomplete scene capture after editing. Extensive experiments and editing examples on real-world demonstrate that 4D-Editor achieves photo-realistic dynamic NeRF editing. Project page: https://patrickddj.github.io/4D-Editor ",
    "url": "https://arxiv.org/abs/2310.16858",
    "authors": [
      "Dadong Jiang",
      "Zhihui Ke",
      "Xiaobo Zhou",
      "Xidong Shi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.16862",
    "title": "Balancing Augmentation with Edge-Utility Filter for Signed GNNs",
    "abstract": "Signed graph neural networks (SGNNs) has recently drawn more attention as many real-world networks are signed networks containing two types of edges: positive and negative. The existence of negative edges affects the SGNN robustness on two aspects. One is the semantic imbalance as the negative edges are usually hard to obtain though they can provide potentially useful information. The other is the structural unbalance, e.g. unbalanced triangles, an indication of incompatible relationship among nodes. In this paper, we propose a balancing augmentation method to address the above two aspects for SGNNs. Firstly, the utility of each negative edge is measured by calculating its occurrence in unbalanced structures. Secondly, the original signed graph is selectively augmented with the use of (1) an edge perturbation regulator to balance the number of positive and negative edges and to determine the ratio of perturbed edges to original edges and (2) an edge utility filter to remove the negative edges with low utility to make the graph structure more balanced. Finally, a SGNN is trained on the augmented graph which effectively explores the credible relationships. A detailed theoretical analysis is also conducted to prove the effectiveness of each module. Experiments on five real-world datasets in link prediction demonstrate that our method has the advantages of effectiveness and generalization and can significantly improve the performance of SGNN backbones. ",
    "url": "https://arxiv.org/abs/2310.16862",
    "authors": [
      "Ke-Jia Chen",
      "Yaming Ji",
      "Youran Qu",
      "Chuhan Xu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.16897",
    "title": "Divide et Impera: Multi-Transformer Architectures for Complex NLP-Tasks",
    "abstract": "The growing capabilities of transformer models pave the way for solving increasingly complex NLP tasks. A key to supporting application-specific requirements is the ability to fine-tune. However, compiling a fine-tuning dataset tailored to complex tasks is tedious and results in large datasets, limiting the ability to control transformer output. We present an approach in which complex tasks are divided into simpler subtasks. Multiple transformer models are fine-tuned to one subtask each, and lined up to accomplish the complex task. This simplifies the compilation of fine-tuning datasets and increases overall controllability. Using the example of reducing gender bias as a complex task, we demonstrate our approach and show that it performs better than using a single model. ",
    "url": "https://arxiv.org/abs/2310.16897",
    "authors": [
      "Solveig Helland",
      "Elena Gavagnin",
      "Alexandre de Spindler"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.16919",
    "title": "Wide Flat Minimum Watermarking for Robust Ownership Verification of GANs",
    "abstract": "We propose a novel multi-bit box-free watermarking method for the protection of Intellectual Property Rights (IPR) of GANs with improved robustness against white-box attacks like fine-tuning, pruning, quantization, and surrogate model attacks. The watermark is embedded by adding an extra watermarking loss term during GAN training, ensuring that the images generated by the GAN contain an invisible watermark that can be retrieved by a pre-trained watermark decoder. In order to improve the robustness against white-box model-level attacks, we make sure that the model converges to a wide flat minimum of the watermarking loss term, in such a way that any modification of the model parameters does not erase the watermark. To do so, we add random noise vectors to the parameters of the generator and require that the watermarking loss term is as invariant as possible with respect to the presence of noise. This procedure forces the generator to converge to a wide flat minimum of the watermarking loss. The proposed method is architectureand dataset-agnostic, thus being applicable to many different generation tasks and models, as well as to CNN-based image processing architectures. We present the results of extensive experiments showing that the presence of the watermark has a negligible impact on the quality of the generated images, and proving the superior robustness of the watermark against model modification and surrogate model attacks. ",
    "url": "https://arxiv.org/abs/2310.16919",
    "authors": [
      "Jianwei Fei",
      "Zhihua Xia",
      "Benedetta Tondi",
      "Mauro Barni"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.16924",
    "title": "Physician Detection of Clinical Harm in Machine Translation: Quality  Estimation Aids in Reliance and Backtranslation Identifies Critical Errors",
    "abstract": "A major challenge in the practical use of Machine Translation (MT) is that users lack guidance to make informed decisions about when to rely on outputs. Progress in quality estimation research provides techniques to automatically assess MT quality, but these techniques have primarily been evaluated in vitro by comparison against human judgments outside of a specific context of use. This paper evaluates quality estimation feedback in vivo with a human study simulating decision-making in high-stakes medical settings. Using Emergency Department discharge instructions, we study how interventions based on quality estimation versus backtranslation assist physicians in deciding whether to show MT outputs to a patient. We find that quality estimation improves appropriate reliance on MT, but backtranslation helps physicians detect more clinically harmful errors that QE alone often misses. ",
    "url": "https://arxiv.org/abs/2310.16924",
    "authors": [
      "Nikita Mehandru",
      "Sweta Agrawal",
      "Yimin Xiao",
      "Elaine C Khoong",
      "Ge Gao",
      "Marine Carpuat",
      "Niloufar Salehi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2310.16941",
    "title": "Exploring Behavior Discovery Methods for Heterogeneous Swarms of  Limited-Capability Robots",
    "abstract": "We study the problem of determining the emergent behaviors that are possible given a functionally heterogeneous swarm of robots with limited capabilities. Prior work has considered behavior search for homogeneous swarms and proposed the use of novelty search over either a hand-specified or learned behavior space followed by clustering to return a taxonomy of emergent behaviors to the user. In this paper, we seek to better understand the role of novelty search and the efficacy of using clustering to discover novel emergent behaviors. Through a large set of experiments and ablations, we analyze the effect of representations, evolutionary search, and various clustering methods in the search for novel behaviors in a heterogeneous swarm. Our results indicate that prior methods fail to discover many interesting behaviors and that an iterative human-in-the-loop discovery process discovers more behaviors than random search, swarm chemistry, and automated behavior discovery. The combined discoveries of our experiments uncover 23 emergent behaviors, 18 of which are novel discoveries. To the best of our knowledge, these are the first known emergent behaviors for heterogeneous swarms of computation-free agents. Videos, code, and appendix are available at the project website: https://sites.google.com/view/heterogeneous-bd-methods ",
    "url": "https://arxiv.org/abs/2310.16941",
    "authors": [
      "Connor Mattson",
      "Jeremy C. Clark",
      "Daniel S. Brown"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2310.16955",
    "title": "Break it, Imitate it, Fix it: Robustness by Generating Human-Like  Attacks",
    "abstract": "Real-world natural language processing systems need to be robust to human adversaries. Collecting examples of human adversaries for training is an effective but expensive solution. On the other hand, training on synthetic attacks with small perturbations - such as word-substitution - does not actually improve robustness to human adversaries. In this paper, we propose an adversarial training framework that uses limited human adversarial examples to generate more useful adversarial examples at scale. We demonstrate the advantages of this system on the ANLI and hate speech detection benchmark datasets - both collected via an iterative, adversarial human-and-model-in-the-loop procedure. Compared to training only on observed human attacks, also training on our synthetic adversarial examples improves model robustness to future rounds. In ANLI, we see accuracy gains on the current set of attacks (44.1%$\\,\\to\\,$50.1%) and on two future unseen rounds of human generated attacks (32.5%$\\,\\to\\,$43.4%, and 29.4%$\\,\\to\\,$40.2%). In hate speech detection, we see AUC gains on current attacks (0.76 $\\to$ 0.84) and a future round (0.77 $\\to$ 0.79). Attacks from methods that do not learn the distribution of existing human adversaries, meanwhile, degrade robustness. ",
    "url": "https://arxiv.org/abs/2310.16955",
    "authors": [
      "Aradhana Sinha",
      "Ananth Balashankar",
      "Ahmad Beirami",
      "Thi Avrahami",
      "Jilin Chen",
      "Alex Beutel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.16961",
    "title": "Neural Distributed Compressor Discovers Binning",
    "abstract": "We consider lossy compression of an information source when the decoder has lossless access to a correlated one. This setup, also known as the Wyner-Ziv problem, is a special case of distributed source coding. To this day, practical approaches for the Wyner-Ziv problem have neither been fully developed nor heavily investigated. We propose a data-driven method based on machine learning that leverages the universal function approximation capability of artificial neural networks. We find that our neural network-based compression scheme, based on variational vector quantization, recovers some principles of the optimum theoretical solution of the Wyner-Ziv setup, such as binning in the source space as well as optimal combination of the quantization index and side information, for exemplary sources. These behaviors emerge although no structure exploiting knowledge of the source distributions was imposed. Binning is a widely used tool in information theoretic proofs and methods, and to our knowledge, this is the first time it has been explicitly observed to emerge from data-driven learning. ",
    "url": "https://arxiv.org/abs/2310.16961",
    "authors": [
      "Ezgi Ozyilkan",
      "Johannes Ballé",
      "Elza Erkip"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2310.16968",
    "title": "Understanding Social Structures from Contemporary Literary Fiction using  Character Interaction Graph -- Half Century Chronology of Influential Bengali  Writers",
    "abstract": "Social structures and real-world incidents often influence contemporary literary fiction. Existing research in literary fiction analysis explains these real-world phenomena through the manual critical analysis of stories. Conventional Natural Language Processing (NLP) methodologies, including sentiment analysis, narrative summarization, and topic modeling, have demonstrated substantial efficacy in analyzing and identifying similarities within fictional works. However, the intricate dynamics of character interactions within fiction necessitate a more nuanced approach that incorporates visualization techniques. Character interaction graphs (or networks) emerge as a highly suitable means for visualization and information retrieval from the realm of fiction. Therefore, we leverage character interaction graphs with NLP-derived features to explore a diverse spectrum of societal inquiries about contemporary culture's impact on the landscape of literary fiction. Our study involves constructing character interaction graphs from fiction, extracting relevant graph features, and exploiting these features to resolve various real-life queries. Experimental evaluation of influential Bengali fiction over half a century demonstrates that character interaction graphs can be highly effective in specific assessments and information retrieval from literary fiction. Our data and codebase are available at https://cutt.ly/fbMgGEM ",
    "url": "https://arxiv.org/abs/2310.16968",
    "authors": [
      "Nafis Irtiza Tripto",
      "Mohammed Eunus Ali"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2310.16972",
    "title": "The Word2vec Graph Model for Author Attribution and Genre Detection in  Literary Analysis",
    "abstract": "Analyzing the writing styles of authors and articles is a key to supporting various literary analyses such as author attribution and genre detection. Over the years, rich sets of features that include stylometry, bag-of-words, n-grams have been widely used to perform such analysis. However, the effectiveness of these features largely depends on the linguistic aspects of a particular language and datasets specific characteristics. Consequently, techniques based on these feature sets cannot give desired results across domains. In this paper, we propose a novel Word2vec graph based modeling of a document that can rightly capture both context and style of the document. By using these Word2vec graph based features, we perform classification to perform author attribution and genre detection tasks. Our detailed experimental study with a comprehensive set of literary writings shows the effectiveness of this method over traditional feature based approaches. Our code and data are publicly available at https://cutt.ly/svLjSgk ",
    "url": "https://arxiv.org/abs/2310.16972",
    "authors": [
      "Nafis Irtiza Tripto",
      "Mohammed Eunus Ali"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2310.16976",
    "title": "On the Interplay between Social Welfare and Tractability of Equilibria",
    "abstract": "Computational tractability and social welfare (aka. efficiency) of equilibria are two fundamental but in general orthogonal considerations in algorithmic game theory. Nevertheless, we show that when (approximate) full efficiency can be guaranteed via a smoothness argument \\`a la Roughgarden, Nash equilibria are approachable under a family of no-regret learning algorithms, thereby enabling fast and decentralized computation. We leverage this connection to obtain new convergence results in large games -- wherein the number of players $n \\gg 1$ -- under the well-documented property of full efficiency via smoothness in the limit. Surprisingly, our framework unifies equilibrium computation in disparate classes of problems including games with vanishing strategic sensitivity and two-player zero-sum games, illuminating en route an immediate but overlooked equivalence between smoothness and a well-studied condition in the optimization literature known as the Minty property. Finally, we establish that a family of no-regret dynamics attains a welfare bound that improves over the smoothness framework while at the same time guaranteeing convergence to the set of coarse correlated equilibria. We show this by employing the clairvoyant mirror descent algortihm recently introduced by Piliouras et al. ",
    "url": "https://arxiv.org/abs/2310.16976",
    "authors": [
      "Ioannis Anagnostides",
      "Tuomas Sandholm"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2310.16999",
    "title": "Trust, but Verify: Robust Image Segmentation using Deep Learning",
    "abstract": "We describe a method for verifying the output of a deep neural network for medical image segmentation that is robust to several classes of random as well as worst-case perturbations i.e. adversarial attacks. This method is based on a general approach recently developed by the authors called ``Trust, but Verify\" wherein an auxiliary verification network produces predictions about certain masked features in the input image using the segmentation as an input. A well-designed auxiliary network will produce high-quality predictions when the input segmentations are accurate, but will produce low-quality predictions when the segmentations are incorrect. Checking the predictions of such a network with the original image allows us to detect bad segmentations. However, to ensure the verification method is truly robust, we need a method for checking the quality of the predictions that does not itself rely on a black-box neural network. Indeed, we show that previous methods for segmentation evaluation that do use deep neural regression networks are vulnerable to false negatives i.e. can inaccurately label bad segmentations as good. We describe the design of a verification network that avoids such vulnerability and present results to demonstrate its robustness compared to previous methods. ",
    "url": "https://arxiv.org/abs/2310.16999",
    "authors": [
      "Fahim Ahmed Zaman",
      "Xiaodong Wu",
      "Weiyu Xu",
      "Milan Sonka",
      "Raghuraman Mudumbai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2310.17015",
    "title": "Data Augmentation for Emotion Detection in Small Imbalanced Text Data",
    "abstract": "Emotion recognition in text, the task of identifying emotions such as joy or anger, is a challenging problem in NLP with many applications. One of the challenges is the shortage of available datasets that have been annotated with emotions. Certain existing datasets are small, follow different emotion taxonomies and display imbalance in their emotion distribution. In this work, we studied the impact of data augmentation techniques precisely when applied to small imbalanced datasets, for which current state-of-the-art models (such as RoBERTa) under-perform. Specifically, we utilized four data augmentation methods (Easy Data Augmentation EDA, static and contextual Embedding-based, and ProtAugment) on three datasets that come from different sources and vary in size, emotion categories and distributions. Our experimental results show that using the augmented data when training the classifier model leads to significant improvements. Finally, we conducted two case studies: a) directly using the popular chat-GPT API to paraphrase text using different prompts, and b) using external data to augment the training set. Results show the promising potential of these methods. ",
    "url": "https://arxiv.org/abs/2310.17015",
    "authors": [
      "Anna Koufakou",
      "Diego Grisales",
      "Ragy Costa de jesus",
      "Oscar Fox"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.17025",
    "title": "netFound: Foundation Model for Network Security",
    "abstract": "In ML for network security, traditional workflows rely on high-quality labeled data and manual feature engineering, but limited datasets and human expertise hinder feature selection, leading to models struggling to capture crucial relationships and generalize effectively. Inspired by recent advancements in ML application domains like GPT-4 and Vision Transformers, we have developed netFound, a foundational model for network security. This model undergoes pre-training using self-supervised algorithms applied to readily available unlabeled network packet traces. netFound's design incorporates hierarchical and multi-modal attributes of network traffic, effectively capturing hidden networking contexts, including application logic, communication protocols, and network conditions. With this pre-trained foundation in place, we can fine-tune netFound for a wide array of downstream tasks, even when dealing with low-quality, limited, and noisy labeled data. Our experiments demonstrate netFound's superiority over existing state-of-the-art ML-based solutions across three distinct network downstream tasks: traffic classification, network intrusion detection, and APT detection. Furthermore, we emphasize netFound's robustness against noisy and missing labels, as well as its ability to generalize across temporal variations and diverse network environments. Finally, through a series of ablation studies, we provide comprehensive insights into how our design choices enable netFound to more effectively capture hidden networking contexts, further solidifying its performance and utility in network security applications. ",
    "url": "https://arxiv.org/abs/2310.17025",
    "authors": [
      "Satyandra Guthula",
      "Navya Battula",
      "Roman Beltiukov",
      "Wenbo Guo",
      "Arpit Gupta"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.17042",
    "title": "StochGradAdam: Accelerating Neural Networks Training with Stochastic  Gradient Sampling",
    "abstract": "In the rapidly advancing domain of deep learning optimization, this paper unveils the StochGradAdam optimizer, a novel adaptation of the well-regarded Adam algorithm. Central to StochGradAdam is its gradient sampling technique. This method not only ensures stable convergence but also leverages the advantages of selective gradient consideration, fostering robust training by potentially mitigating the effects of noisy or outlier data and enhancing the exploration of the loss landscape for more dependable convergence. In both image classification and segmentation tasks, StochGradAdam has demonstrated superior performance compared to the traditional Adam optimizer. By judiciously sampling a subset of gradients at each iteration, the optimizer is optimized for managing intricate models. The paper provides a comprehensive exploration of StochGradAdam's methodology, from its mathematical foundations to bias correction strategies, heralding a promising advancement in deep learning training techniques. ",
    "url": "https://arxiv.org/abs/2310.17042",
    "authors": [
      "Juyoung Yun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2310.17078",
    "title": "HCT: Hybrid Convnet-Transformer for Parkinson's disease detection and  severity prediction from gait",
    "abstract": "In this paper, we propose a novel deep learning method based on a new Hybrid ConvNet-Transformer architecture to detect and stage Parkinson's disease (PD) from gait data. We adopt a two-step approach by dividing the problem into two sub-problems. Our Hybrid ConvNet-Transformer model first distinguishes healthy versus parkinsonian patients. If the patient is parkinsonian, a multi-class Hybrid ConvNet-Transformer model determines the Hoehn and Yahr (H&Y) score to assess the PD severity stage. Our hybrid architecture exploits the strengths of both Convolutional Neural Networks (ConvNets) and Transformers to accurately detect PD and determine the severity stage. In particular, we take advantage of ConvNets to capture local patterns and correlations in the data, while we exploit Transformers for handling long-term dependencies in the input signal. We show that our hybrid method achieves superior performance when compared to other state-of-the-art methods, with a PD detection accuracy of 97% and a severity staging accuracy of 87%. Our source code is available at: https://github.com/SafwenNaimi ",
    "url": "https://arxiv.org/abs/2310.17078",
    "authors": [
      "Safwen Naimi",
      "Wassim Bouachir",
      "Guillaume-Alexandre Bilodeau"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17097",
    "title": "Navigating Data Heterogeneity in Federated Learning: A Semi-Supervised  Approach for Object Detection",
    "abstract": "Federated Learning (FL) has emerged as a potent framework for training models across distributed data sources while maintaining data privacy. Nevertheless, it faces challenges with limited high-quality labels and non-IID client data, particularly in applications like autonomous driving. To address these hurdles, we navigate the uncharted waters of Semi-Supervised Federated Object Detection (SSFOD). We present a pioneering SSFOD framework, designed for scenarios where labeled data reside only at the server while clients possess unlabeled data. Notably, our method represents the inaugural implementation of SSFOD for clients with 0% labeled non-IID data, a stark contrast to previous studies that maintain some subset of labels at each client. We propose FedSTO, a two-stage strategy encompassing Selective Training followed by Orthogonally enhanced full-parameter training, to effectively address data shift (e.g. weather conditions) between server and clients. Our contributions include selectively refining the backbone of the detector to avert overfitting, orthogonality regularization to boost representation divergence, and local EMA-driven pseudo label assignment to yield high-quality pseudo labels. Extensive validation on prominent autonomous driving datasets (BDD100K, Cityscapes, and SODA10M) attests to the efficacy of our approach, demonstrating state-of-the-art results. Remarkably, FedSTO, using just 20-30% of labels, performs nearly as well as fully-supervised centralized training methods. ",
    "url": "https://arxiv.org/abs/2310.17097",
    "authors": [
      "Taehyeon Kim",
      "Eric Lin",
      "Junu Lee",
      "Christian Lau",
      "Vaikkunth Mugunthan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2310.17100",
    "title": "Network Design through Graph Neural Networks: Identifying Challenges and  Improving Performance",
    "abstract": "Graph Neural Network (GNN) research has produced strategies to modify a graph's edges using gradients from a trained GNN, with the goal of network design. However, the factors which govern gradient-based editing are understudied, obscuring why edges are chosen and if edits are grounded in an edge's importance. Thus, we begin by analyzing the gradient computation in previous works, elucidating the factors that influence edits and highlighting the potential over-reliance on structural properties. Specifically, we find that edges can achieve high gradients due to structural biases, rather than importance, leading to erroneous edits when the factors are unrelated to the design task. To improve editing, we propose ORE, an iterative editing method that (a) edits the highest scoring edges and (b) re-embeds the edited graph to refresh gradients, leading to less biased edge choices. We empirically study ORE through a set of proposed design tasks, each with an external validation method, demonstrating that ORE improves upon previous methods by up to 50%. ",
    "url": "https://arxiv.org/abs/2310.17100",
    "authors": [
      "Donald Loveland",
      "Rajmonda Caceres"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17109",
    "title": "LP-OVOD: Open-Vocabulary Object Detection by Linear Probing",
    "abstract": "This paper addresses the challenging problem of open-vocabulary object detection (OVOD) where an object detector must identify both seen and unseen classes in test images without labeled examples of the unseen classes in training. A typical approach for OVOD is to use joint text-image embeddings of CLIP to assign box proposals to their closest text label. However, this method has a critical issue: many low-quality boxes, such as over- and under-covered-object boxes, have the same similarity score as high-quality boxes since CLIP is not trained on exact object location information. To address this issue, we propose a novel method, LP-OVOD, that discards low-quality boxes by training a sigmoid linear classifier on pseudo labels retrieved from the top relevant region proposals to the novel text. Experimental results on COCO affirm the superior performance of our approach over the state of the art, achieving $\\textbf{40.5}$ in $\\text{AP}_{novel}$ using ResNet50 as the backbone and without external datasets or knowing novel classes during training. Our code will be available at https://github.com/VinAIResearch/LP-OVOD. ",
    "url": "https://arxiv.org/abs/2310.17109",
    "authors": [
      "Chau Pham",
      "Truong Vu",
      "Khoi Nguyen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.17119",
    "title": "FLEEK: Factual Error Detection and Correction with Evidence Retrieved  from External Knowledge",
    "abstract": "Detecting factual errors in textual information, whether generated by large language models (LLM) or curated by humans, is crucial for making informed decisions. LLMs' inability to attribute their claims to external knowledge and their tendency to hallucinate makes it difficult to rely on their responses. Humans, too, are prone to factual errors in their writing. Since manual detection and correction of factual errors is labor-intensive, developing an automatic approach can greatly reduce human effort. We present FLEEK, a prototype tool that automatically extracts factual claims from text, gathers evidence from external knowledge sources, evaluates the factuality of each claim, and suggests revisions for identified errors using the collected evidence. Initial empirical evaluation on fact error detection (77-85\\% F1) shows the potential of FLEEK. A video demo of FLEEK can be found at https://youtu.be/NapJFUlkPdQ. ",
    "url": "https://arxiv.org/abs/2310.17119",
    "authors": [
      "Farima Fatahi Bayat",
      "Kun Qian",
      "Benjamin Han",
      "Yisi Sang",
      "Anton Belyi",
      "Samira Khorshidi",
      "Fei Wu",
      "Ihab F. Ilyas",
      "Yunyao Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.17121",
    "title": "Test-time Augmentation for Factual Probing",
    "abstract": "Factual probing is a method that uses prompts to test if a language model \"knows\" certain world knowledge facts. A problem in factual probing is that small changes to the prompt can lead to large changes in model output. Previous work aimed to alleviate this problem by optimizing prompts via text mining or fine-tuning. However, such approaches are relation-specific and do not generalize to unseen relation types. Here, we propose to use test-time augmentation (TTA) as a relation-agnostic method for reducing sensitivity to prompt variations by automatically augmenting and ensembling prompts at test time. Experiments show improved model calibration, i.e., with TTA, model confidence better reflects prediction accuracy. Improvements in prediction accuracy are observed for some models, but for other models, TTA leads to degradation. Error analysis identifies the difficulty of producing high-quality prompt variations as the main challenge for TTA. ",
    "url": "https://arxiv.org/abs/2310.17121",
    "authors": [
      "Go Kamoda",
      "Benjamin Heinzerling",
      "Keisuke Sakaguchi",
      "Kentaro Inui"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.17127",
    "title": "A Method for Network Intrusion Detection Using Flow Sequence and BERT  Framework",
    "abstract": "A Network Intrusion Detection System (NIDS) is a tool that identifies potential threats to a network. Recently, different flow-based NIDS designs utilizing Machine Learning (ML) algorithms have been proposed as solutions to detect intrusions efficiently. However, conventional ML-based classifiers have not seen widespread adoption in the real world due to their poor domain adaptation capability. In this research, our goal is to explore the possibility of using sequences of flows to improve the domain adaptation capability of network intrusion detection systems. Our proposal employs natural language processing techniques and Bidirectional Encoder Representations from Transformers framework, which is an effective technique for modeling data with respect to its context. Early empirical results show that our approach has improved domain adaptation capability compared to previous approaches. The proposed approach provides a new research method for building a robust intrusion detection system. ",
    "url": "https://arxiv.org/abs/2310.17127",
    "authors": [
      "Loc Gia Nguyen",
      "Kohei Watabe"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.17129",
    "title": "ECN based Congestion Control for a Software Defined Network",
    "abstract": "This paper deals with congestion control in a software defined network (SDN) setting. Presently, explicit router schemes, such as Explicit Congestion Notification (ECN), work in conjunction with the TCP protocol to handle congestion in a distributed manner. With the emergence of SDN and centralized control, it is possible to leverage the global view of the network state to make better congestion control decisions. In this work, we explore the advantages of bringing in global information into distributed congestion control. We propose a framework where the controller with its global view of the network actively participates in the congestion control decisions of the end TCP hosts, by setting the ECN bits of IP packets appropriately. Our framework can be deployed very easily without any change to the end node TCPs or the SDN switches. We also show 30x improvement over the TCP Cubic variant and 1.7x improvement over TCP/RED in terms of flow completion times for one implementation of this framework, using the Mininet emulator. ",
    "url": "https://arxiv.org/abs/2310.17129",
    "authors": [
      "Mohana Prasad Sathya Moorthy",
      "Manoj Kumar Sure",
      "Krishna M. Sivalingam"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2310.17136",
    "title": "Core Challenge 2023: Solver and Graph Descriptions",
    "abstract": "This paper collects all descriptions of solvers and ISR instances submitted to CoRe Challenge 2023. ",
    "url": "https://arxiv.org/abs/2310.17136",
    "authors": [
      "Takehide Soh",
      "Yoshio Okamoto",
      "Takehiro Ito"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Artificial Intelligence (cs.AI)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2310.17140",
    "title": "Symbolic Planning and Code Generation for Grounded Dialogue",
    "abstract": "Large language models (LLMs) excel at processing and generating both text and code. However, LLMs have had limited applicability in grounded task-oriented dialogue as they are difficult to steer toward task objectives and fail to handle novel grounding. We present a modular and interpretable grounded dialogue system that addresses these shortcomings by composing LLMs with a symbolic planner and grounded code execution. Our system consists of a reader and planner: the reader leverages an LLM to convert partner utterances into executable code, calling functions that perform grounding. The translated code's output is stored to track dialogue state, while a symbolic planner determines the next appropriate response. We evaluate our system's performance on the demanding OneCommon dialogue task, involving collaborative reference resolution on abstract images of scattered dots. Our system substantially outperforms the previous state-of-the-art, including improving task success in human evaluations from 56% to 69% in the most challenging setting. ",
    "url": "https://arxiv.org/abs/2310.17140",
    "authors": [
      "Justin T. Chiu",
      "Wenting Zhao",
      "Derek Chen",
      "Saujas Vaduguru",
      "Alexander M. Rush",
      "Daniel Fried"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.17149",
    "title": "Explainable Spatio-Temporal Graph Neural Networks",
    "abstract": "Spatio-temporal graph neural networks (STGNNs) have gained popularity as a powerful tool for effectively modeling spatio-temporal dependencies in diverse real-world urban applications, including intelligent transportation and public safety. However, the black-box nature of STGNNs limits their interpretability, hindering their application in scenarios related to urban resource allocation and policy formulation. To bridge this gap, we propose an Explainable Spatio-Temporal Graph Neural Networks (STExplainer) framework that enhances STGNNs with inherent explainability, enabling them to provide accurate predictions and faithful explanations simultaneously. Our framework integrates a unified spatio-temporal graph attention network with a positional information fusion layer as the STG encoder and decoder, respectively. Furthermore, we propose a structure distillation approach based on the Graph Information Bottleneck (GIB) principle with an explainable objective, which is instantiated by the STG encoder and decoder. Through extensive experiments, we demonstrate that our STExplainer outperforms state-of-the-art baselines in terms of predictive accuracy and explainability metrics (i.e., sparsity and fidelity) on traffic and crime prediction tasks. Furthermore, our model exhibits superior representation ability in alleviating data missing and sparsity issues. The implementation code is available at: https://github.com/HKUDS/STExplainer. ",
    "url": "https://arxiv.org/abs/2310.17149",
    "authors": [
      "Jiabin Tang",
      "Lianghao Xia",
      "Chao Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.17163",
    "title": "Low-Dimensional Gradient Helps Out-of-Distribution Detection",
    "abstract": "Detecting out-of-distribution (OOD) samples is essential for ensuring the reliability of deep neural networks (DNNs) in real-world scenarios. While previous research has predominantly investigated the disparity between in-distribution (ID) and OOD data through forward information analysis, the discrepancy in parameter gradients during the backward process of DNNs has received insufficient attention. Existing studies on gradient disparities mainly focus on the utilization of gradient norms, neglecting the wealth of information embedded in gradient directions. To bridge this gap, in this paper, we conduct a comprehensive investigation into leveraging the entirety of gradient information for OOD detection. The primary challenge arises from the high dimensionality of gradients due to the large number of network parameters. To solve this problem, we propose performing linear dimension reduction on the gradient using a designated subspace that comprises principal components. This innovative technique enables us to obtain a low-dimensional representation of the gradient with minimal information loss. Subsequently, by integrating the reduced gradient with various existing detection score functions, our approach demonstrates superior performance across a wide range of detection tasks. For instance, on the ImageNet benchmark, our method achieves an average reduction of 11.15% in the false positive rate at 95% recall (FPR95) compared to the current state-of-the-art approach. The code would be released. ",
    "url": "https://arxiv.org/abs/2310.17163",
    "authors": [
      "Yingwen Wu",
      "Tao Li",
      "Xinwen Cheng",
      "Jie Yang",
      "Xiaolin Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.17164",
    "title": "Bridging Phylogeny and Taxonomy with Protein-protein Interaction  Networks",
    "abstract": "The protein-protein interaction (PPI) network provides an overview of the complex biological reactions vital to an organism's metabolism and survival. Even though in the past PPI network were compared across organisms in detail, there has not been large-scale research on how individual PPI networks reflect on the species relationships. In this study we aim to increase our understanding of the tree of life and taxonomy by gleaming information from the PPI networks. We successful created (1) a predictor of network statistics based on known traits of existing species in the phylogeny, and (2) a taxonomic classifier of organism using the known protein network statistics, whether experimentally determined or predicted de novo. With the knowledge of protein interactions at its core, our two models effectively connects two field with widely diverging methodologies - the phylogeny and taxonomy of species. ",
    "url": "https://arxiv.org/abs/2310.17164",
    "authors": [
      "Long-Huei Chen",
      "Mohana Prasad Sathya Moorthy",
      "Pratyaksh Sharma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.17166",
    "title": "X-SNS: Cross-Lingual Transfer Prediction through Sub-Network Similarity",
    "abstract": "Cross-lingual transfer (XLT) is an emergent ability of multilingual language models that preserves their performance on a task to a significant extent when evaluated in languages that were not included in the fine-tuning process. While English, due to its widespread usage, is typically regarded as the primary language for model adaption in various tasks, recent studies have revealed that the efficacy of XLT can be amplified by selecting the most appropriate source languages based on specific conditions. In this work, we propose the utilization of sub-network similarity between two languages as a proxy for predicting the compatibility of the languages in the context of XLT. Our approach is model-oriented, better reflecting the inner workings of foundation models. In addition, it requires only a moderate amount of raw text from candidate languages, distinguishing it from the majority of previous methods that rely on external resources. In experiments, we demonstrate that our method is more effective than baselines across diverse tasks. Specifically, it shows proficiency in ranking candidates for zero-shot XLT, achieving an improvement of 4.6% on average in terms of NDCG@3. We also provide extensive analyses that confirm the utility of sub-networks for XLT prediction. ",
    "url": "https://arxiv.org/abs/2310.17166",
    "authors": [
      "Taejun Yun",
      "Jinhyeon Kim",
      "Deokyeong Kang",
      "Seong Hoon Lim",
      "Jihoon Kim",
      "Taeuk Kim"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.17173",
    "title": "DSAC-C: Constrained Maximum Entropy for Robust Discrete Soft-Actor  Critic",
    "abstract": "We present a novel extension to the family of Soft Actor-Critic (SAC) algorithms. We argue that based on the Maximum Entropy Principle, discrete SAC can be further improved via additional statistical constraints derived from a surrogate critic policy. Furthermore, our findings suggests that these constraints provide an added robustness against potential domain shifts, which are essential for safe deployment of reinforcement learning agents in the real-world. We provide theoretical analysis and show empirical results on low data regimes for both in-distribution and out-of-distribution variants of Atari 2600 games. ",
    "url": "https://arxiv.org/abs/2310.17173",
    "authors": [
      "Dexter Neo",
      "Tsuhan Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17180",
    "title": "A Forward Reachability Perspective on Robust Control Invariance and  Discount Factors in Reachability Analysis",
    "abstract": "Control invariant sets are crucial for various methods that aim to design safe control policies for systems whose state constraints must be satisfied over an indefinite time horizon. In this article, we explore the connections among reachability, control invariance, and Control Barrier Functions (CBFs) by examining the forward reachability problem associated with control invariant sets. We present the notion of an \"inevitable Forward Reachable Tube\" (FRT) as a tool for analyzing control invariant sets. Our findings show that the inevitable FRT of a robust control invariant set with a differentiable boundary is the set itself. We highlight the role of the differentiability of the boundary in shaping the FRTs of the sets through numerical examples. We also formulate a zero-sum differential game between the control and disturbance, where the inevitable FRT is characterized by the zero-superlevel set of the value function. By incorporating a discount factor in the cost function of the game, the barrier constraint of the CBF naturally arises as the constraint that is imposed on the optimal control policy. As a result, the value function of our FRT formulation serves as a CBF-like function, which has not been previously realized in reachability studies. Conversely, any valid CBF is also a forward reachability value function inside the control invariant set, thereby revealing the inverse optimality of the CBF. As such, our work establishes a strong link between reachability, control invariance, and CBFs, filling a gap that prior formulations based on backward reachability were unable to bridge. ",
    "url": "https://arxiv.org/abs/2310.17180",
    "authors": [
      "Jason J. Choi",
      "Donggun Lee",
      "Boyang Li",
      "Jonathan P. How",
      "Koushil Sreenath",
      "Sylvia L. Herbert",
      "Claire J. Tomlin"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.17190",
    "title": "Lookup Table meets Local Laplacian Filter: Pyramid Reconstruction  Network for Tone Mapping",
    "abstract": "Tone mapping aims to convert high dynamic range (HDR) images to low dynamic range (LDR) representations, a critical task in the camera imaging pipeline. In recent years, 3-Dimensional LookUp Table (3D LUT) based methods have gained attention due to their ability to strike a favorable balance between enhancement performance and computational efficiency. However, these methods often fail to deliver satisfactory results in local areas since the look-up table is a global operator for tone mapping, which works based on pixel values and fails to incorporate crucial local information. To this end, this paper aims to address this issue by exploring a novel strategy that integrates global and local operators by utilizing closed-form Laplacian pyramid decomposition and reconstruction. Specifically, we employ image-adaptive 3D LUTs to manipulate the tone in the low-frequency image by leveraging the specific characteristics of the frequency information. Furthermore, we utilize local Laplacian filters to refine the edge details in the high-frequency components in an adaptive manner. Local Laplacian filters are widely used to preserve edge details in photographs, but their conventional usage involves manual tuning and fixed implementation within camera imaging pipelines or photo editing tools. We propose to learn parameter value maps progressively for local Laplacian filters from annotated data using a lightweight network. Our model achieves simultaneous global tone manipulation and local edge detail preservation in an end-to-end manner. Extensive experimental results on two benchmark datasets demonstrate that the proposed method performs favorably against state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2310.17190",
    "authors": [
      "Feng Zhang",
      "Ming Tian",
      "Zhiqiang Li",
      "Bin Xu",
      "Qingbo Lu",
      "Changxin Gao",
      "Nong Sang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2310.17223",
    "title": "Quickest Change Detection with Controlled Sensing",
    "abstract": "In the problem of quickest change detection, a change occurs at some unknown time in the distribution of a sequence of random vectors that are monitored in real time, and the goal is to detect this change as quickly as possible subject to a certain false alarm constraint. In this work we consider this problem in the presence of parametric uncertainty in the post-change regime and controlled sensing. That is, the post-change distribution contains an unknown parameter, and the distribution of each observation, before and after the change, is affected by a control action. In this context, in addition to a stopping rule that determines the time at which it is declared that the change has occurred, one also needs to determine a sequential control policy, which chooses the control action at each time based on the already collected observations. We formulate this problem mathematically using Lorden's minimax criterion, and assuming that there are finitely many possible actions and post-change parameter values. We then propose a specific procedure for this problem that employs an adaptive CuSum statistic in which (i) the estimate of the parameter is based on a fixed number of the more recent observations, and (ii) each action is selected to maximize the Kullback-Leibler divergence of the next observation based on the current parameter estimate, apart from a small number of exploration times. We show that this procedure, which we call the Windowed Chernoff-CuSum (WCC), is first-order asymptotically optimal under Lorden's minimax criterion, for every possible possible value of the unknown post-change parameter, as the mean time to false alarm goes to infinity. We also provide simulation results to illustrate the performance of the WCC procedure. ",
    "url": "https://arxiv.org/abs/2310.17223",
    "authors": [
      "Venugopal V. Veeravalli",
      "Georgios Fellouris",
      "George V. Moustakides"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2310.17230",
    "title": "Codebook Features: Sparse and Discrete Interpretability for Neural  Networks",
    "abstract": "Understanding neural networks is challenging in part because of the dense, continuous nature of their hidden states. We explore whether we can train neural networks to have hidden states that are sparse, discrete, and more interpretable by quantizing their continuous features into what we call codebook features. Codebook features are produced by finetuning neural networks with vector quantization bottlenecks at each layer, producing a network whose hidden features are the sum of a small number of discrete vector codes chosen from a larger codebook. Surprisingly, we find that neural networks can operate under this extreme bottleneck with only modest degradation in performance. This sparse, discrete bottleneck also provides an intuitive way of controlling neural network behavior: first, find codes that activate when the desired behavior is present, then activate those same codes during generation to elicit that behavior. We validate our approach by training codebook Transformers on several different datasets. First, we explore a finite state machine dataset with far more hidden states than neurons. In this setting, our approach overcomes the superposition problem by assigning states to distinct codes, and we find that we can make the neural network behave as if it is in a different state by activating the code for that state. Second, we train Transformer language models with up to 410M parameters on two natural language datasets. We identify codes in these models representing diverse, disentangled concepts (ranging from negative emotions to months of the year) and find that we can guide the model to generate different topics by activating the appropriate codes during inference. Overall, codebook features appear to be a promising unit of analysis and control for neural networks and interpretability. Our codebase and models are open-sourced at https://github.com/taufeeque9/codebook-features. ",
    "url": "https://arxiv.org/abs/2310.17230",
    "authors": [
      "Alex Tamkin",
      "Mohammad Taufeeque",
      "Noah D. Goodman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.17233",
    "title": "EMMA-X: An EM-like Multilingual Pre-training Algorithm for Cross-lingual  Representation Learning",
    "abstract": "Expressing universal semantics common to all languages is helpful in understanding the meanings of complex and culture-specific sentences. The research theme underlying this scenario focuses on learning universal representations across languages with the usage of massive parallel corpora. However, due to the sparsity and scarcity of parallel data, there is still a big challenge in learning authentic ``universals'' for any two languages. In this paper, we propose EMMA-X: an EM-like Multilingual pre-training Algorithm, to learn (X)Cross-lingual universals with the aid of excessive multilingual non-parallel data. EMMA-X unifies the cross-lingual representation learning task and an extra semantic relation prediction task within an EM framework. Both the extra semantic classifier and the cross-lingual sentence encoder approximate the semantic relation of two sentences, and supervise each other until convergence. To evaluate EMMA-X, we conduct experiments on XRETE, a newly introduced benchmark containing 12 widely studied cross-lingual tasks that fully depend on sentence-level representations. Results reveal that EMMA-X achieves state-of-the-art performance. Further geometric analysis of the built representation space with three requirements demonstrates the superiority of EMMA-X over advanced models. ",
    "url": "https://arxiv.org/abs/2310.17233",
    "authors": [
      "Ping Guo",
      "Xiangpeng Wei",
      "Yue Hu",
      "Baosong Yang",
      "Dayiheng Liu",
      "Fei Huang",
      "Jun Xie"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.17238",
    "title": "Joint Entity and Relation Extraction with Span Pruning and Hypergraph  Neural Networks",
    "abstract": "Entity and Relation Extraction (ERE) is an important task in information extraction. Recent marker-based pipeline models achieve state-of-the-art performance, but still suffer from the error propagation issue. Also, most of current ERE models do not take into account higher-order interactions between multiple entities and relations, while higher-order modeling could be beneficial.In this work, we propose HyperGraph neural network for ERE ($\\hgnn{}$), which is built upon the PL-marker (a state-of-the-art marker-based pipleline model). To alleviate error propagation,we use a high-recall pruner mechanism to transfer the burden of entity identification and labeling from the NER module to the joint module of our model. For higher-order modeling, we build a hypergraph, where nodes are entities (provided by the span pruner) and relations thereof, and hyperedges encode interactions between two different relations or between a relation and its associated subject and object entities. We then run a hypergraph neural network for higher-order inference by applying message passing over the built hypergraph. Experiments on three widely used benchmarks (\\acef{}, \\ace{} and \\scierc{}) for ERE task show significant improvements over the previous state-of-the-art PL-marker. ",
    "url": "https://arxiv.org/abs/2310.17238",
    "authors": [
      "Zhaohui Yan",
      "Songlin Yang",
      "Wei Liu",
      "Kewei Tu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17247",
    "title": "Grokking Beyond Neural Networks: An Empirical Exploration with Model  Complexity",
    "abstract": "In some settings neural networks exhibit a phenomenon known as grokking, where they achieve perfect or near-perfect accuracy on the validation set long after the same performance has been achieved on the training set. In this paper, we discover that grokking is not limited to neural networks but occurs in other settings such as Gaussian process (GP) classification, GP regression and linear regression. We also uncover a mechanism by which to induce grokking on algorithmic datasets via the addition of dimensions containing spurious information. The presence of the phenomenon in non-neural architectures provides evidence that grokking is not specific to SGD or weight norm regularisation. Instead, grokking may be possible in any setting where solution search is guided by complexity and error. Based on this insight and further trends we see in the training trajectories of a Bayesian neural network (BNN) and GP regression model, we make progress towards a more general theory of grokking. Specifically, we hypothesise that the phenomenon is governed by the accessibility of certain regions in the error and complexity landscapes. ",
    "url": "https://arxiv.org/abs/2310.17247",
    "authors": [
      "Jack Miller",
      "Charles O'Neill",
      "Thang Bui"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2310.17250",
    "title": "IDENAS: Internal Dependency Exploration for Neural Architecture Search",
    "abstract": "Machine learning is a powerful tool for extracting valuable information and making various predictions from diverse datasets. Traditional algorithms rely on well-defined input and output variables however, there are scenarios where the distinction between the input and output variables and the underlying, associated (input and output) layers of the model, are unknown. Neural Architecture Search (NAS) and Feature Selection have emerged as promising solutions in such scenarios. This research proposes IDENAS, an Internal Dependency-based Exploration for Neural Architecture Search, integrating NAS with feature selection. The methodology explores internal dependencies in the complete parameter space for classification involving 1D sensor and 2D image data as well. IDENAS employs a modified encoder-decoder model and the Sequential Forward Search (SFS) algorithm, combining input-output configuration search with embedded feature selection. Experimental results demonstrate IDENASs superior performance in comparison to other algorithms, showcasing its effectiveness in model development pipelines and automated machine learning. On average, IDENAS achieved significant modelling improvements, underscoring its significant contribution to advancing the state-of-the-art in neural architecture search and feature selection integration. ",
    "url": "https://arxiv.org/abs/2310.17250",
    "authors": [
      "Anh T. Hoang",
      "Zsolt J. Viharos"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2310.17304",
    "title": "Static Semantics Reconstruction for Enhancing JavaScript-WebAssembly  Multilingual Malware Detection",
    "abstract": "The emergence of WebAssembly allows attackers to hide the malicious functionalities of JavaScript malware in cross-language interoperations, termed JavaScript-WebAssembly multilingual malware (JWMM). However, existing anti-virus solutions based on static program analysis are still limited to monolingual code. As a result, their detection effectiveness decreases significantly against JWMM. The detection of JWMM is challenging due to the complex interoperations and semantic diversity between JavaScript and WebAssembly. To bridge this gap, we present JWBinder, the first technique aimed at enhancing the static detection of JWMM. JWBinder performs a language-specific data-flow analysis to capture the cross-language interoperations and then characterizes the functionalities of JWMM through a unified high-level structure called Inter-language Program Dependency Graph. The extensive evaluation on one of the most representative real-world anti-virus platforms, VirusTotal, shows that \\system effectively enhances anti-virus systems from various vendors and increases the overall successful detection rate against JWMM from 49.1\\% to 86.2\\%. Additionally, we assess the side effects and runtime overhead of JWBinder, corroborating its practical viability in real-world applications. ",
    "url": "https://arxiv.org/abs/2310.17304",
    "authors": [
      "Yifan Xia",
      "Ping He",
      "Xuhong Zhang",
      "Peiyu Liu",
      "Shouling Ji",
      "Wenhai Wang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2310.17312",
    "title": "An Ensemble Method Based on the Combination of Transformers with  Convolutional Neural Networks to Detect Artificially Generated Text",
    "abstract": "Thanks to the state-of-the-art Large Language Models (LLMs), language generation has reached outstanding levels. These models are capable of generating high quality content, thus making it a challenging task to detect generated text from human-written content. Despite the advantages provided by Natural Language Generation, the inability to distinguish automatically generated text can raise ethical concerns in terms of authenticity. Consequently, it is important to design and develop methodologies to detect artificial content. In our work, we present some classification models constructed by ensembling transformer models such as Sci-BERT, DeBERTa and XLNet, with Convolutional Neural Networks (CNNs). Our experiments demonstrate that the considered ensemble architectures surpass the performance of the individual transformer models for classification. Furthermore, the proposed SciBERT-CNN ensemble model produced an F1-score of 98.36% on the ALTA shared task 2023 data. ",
    "url": "https://arxiv.org/abs/2310.17312",
    "authors": [
      "Vijini Liyanage",
      "Davide Buscaldi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.17317",
    "title": "RAN Functional Split Options for Integrated Terrestrial and  Non-Terrestrial 6G Networks",
    "abstract": "Leveraging non-terrestrial platforms in 6G networks holds immense significance as it opens up opportunities to expand network coverage, enhance connectivity, and support a wide range of innovative applications, including global-scale Internet of Things and ultra-high-definition content delivery. To accomplish the seamless integration between terrestrial and non-terrestrial networks, substantial changes in radio access network (RAN) architecture are required. These changes involve the development of new RAN solutions that can efficiently manage the diverse characteristics of both terrestrial and non-terrestrial components, ensuring smooth handovers, resource allocation, and quality of service across the integrated network ecosystem. Additionally, the establishment of robust interconnection and communication protocols between terrestrial and non-terrestrial elements will be pivotal to utilize the full potential of 6G technology. Additionally, innovative approaches have been introduced to split the functionalities within the RAN into centralized and distributed domains. These novel paradigms are designed to enhance RAN's flexibility while simultaneously lowering the costs associated with infrastructure deployment, all while ensuring that the quality of service for end-users remains unaffected. In this work, we provide an extensive examination of various Non-Terrestrial Networks (NTN) architectures and the necessary adaptations required on the existing 5G RAN architecture to align with the distinct attributes of NTN. Of particular significance, we emphasize the crucial RAN functional split choices essential for the seamless integration of terrestrial and non-terrestrial components within advanced 6G networks. ",
    "url": "https://arxiv.org/abs/2310.17317",
    "authors": [
      "Mohamed Rihan",
      "Tim Due",
      "MohammadAmin Vakilifard",
      "Dirk Wubben",
      "Armin Dekorsy"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.17331",
    "title": "A novel solution for seepage problems using physics-informed neural  networks",
    "abstract": "A Physics-Informed Neural Network (PINN) provides a distinct advantage by synergizing neural networks' capabilities with the problem's governing physical laws. In this study, we introduce an innovative approach for solving seepage problems by utilizing the PINN, harnessing the capabilities of Deep Neural Networks (DNNs) to approximate hydraulic head distributions in seepage analysis. To effectively train the PINN model, we introduce a comprehensive loss function comprising three components: one for evaluating differential operators, another for assessing boundary conditions, and a third for appraising initial conditions. The validation of the PINN involves solving four benchmark seepage problems. The results unequivocally demonstrate the exceptional accuracy of the PINN in solving seepage problems, surpassing the accuracy of FEM in addressing both steady-state and free-surface seepage problems. Hence, the presented approach highlights the robustness of the PINN and underscores its precision in effectively addressing a spectrum of seepage challenges. This amalgamation enables the derivation of accurate solutions, overcoming limitations inherent in conventional methods such as mesh generation and adaptability to complex geometries. ",
    "url": "https://arxiv.org/abs/2310.17331",
    "authors": [
      "Tianfu Luo",
      "Yelin Feng",
      "Qingfu Huang",
      "Zongliang Zhang",
      "Mingjiao Yan",
      "Zaihong Yang",
      "Dawei Zheng",
      "Yang Yang"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2310.17341",
    "title": "De-novo Chemical Reaction Generation by Means of Temporarily  Convolutional Neural Networks",
    "abstract": "We present here a combination of two networks, Recurrent Neural Networks (RNN) and Temporarily Convolutional Neural Networks (TCN) in de novo reaction generation using the novel Reaction Smiles-like representation of reactions (CGRSmiles) with atom mapping directly incorporated. Recurrent Neural Networks are known for their autoregressive properties and are frequently used in language modelling with direct application to SMILES generation. The relatively novel TCNs possess similar properties with wide receptive field while obeying the causality required for natural language processing (NLP). The combination of both latent representations expressed through TCN and RNN results in an overall better performance compared to RNN alone. Additionally, it is shown that different fine-tuning protocols have a profound impact on generative scope of the model when applied on a dataset of interest via transfer learning. ",
    "url": "https://arxiv.org/abs/2310.17341",
    "authors": [
      "Andrei Buin",
      "Hung Yi Chiang",
      "S. Andrew Gadsden",
      "Faraz A. Alderson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17348",
    "title": "Network Intrusion Detection with Edge-Directed Graph Multi-Head  Attention Networks",
    "abstract": "A network intrusion usually involves a number of network locations. Data flow (including the data generated by intrusion behaviors) among these locations (usually represented by IP addresses) naturally forms a graph. Thus, graph neural networks (GNNs) have been used in the construction of intrusion detection models in recent years since they have an excellent ability to capture graph topological features of intrusion data flow. However, existing GNN models treat node mean aggregation equally in node information aggregation. In reality, the correlations of nodes and their neighbors as well as the linked edges are different. Assigning higher weights to nodes and edges with high similarity can highlight the correlation among them, which will enhance the accuracy and expressiveness of the model. To this end, this paper proposes novel Edge-Directed Graph Multi-Head Attention Networks (EDGMAT) for network intrusion detection. The proposed EDGMAT model introduces a multi-head attention mechanism into the intrusion detection model. Additional weight learning is realized through the combination of a multi-head attention mechanism and edge features. Weighted aggregation makes better use of the relationship between different network traffic data. Experimental results on four recent NIDS benchmark datasets show that the performance of EDGMAT in terms of weighted F1-Score is significantly better than that of four state-of-the-art models in multi-class detection tasks. ",
    "url": "https://arxiv.org/abs/2310.17348",
    "authors": [
      "Xiang Li",
      "Jing Zhang",
      "Yali Yuan",
      "Cangqi Zhou"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.17355",
    "title": "Exploring the Trie of Rules: a fast data structure for the  representation of association rules",
    "abstract": "Association rule mining techniques can generate a large volume of sequential data when implemented on transactional databases. Extracting insights from a large set of association rules has been found to be a challenging process. When examining a ruleset, the fundamental question is how to summarise and represent meaningful mined knowledge efficiently. Many algorithms and strategies have been developed to address issue of knowledge extraction; however, the effectiveness of this process can be limited by the data structures. A better data structure can sufficiently affect the speed of the knowledge extraction process. This paper proposes a novel data structure, called the Trie of rules, for storing a ruleset that is generated by association rule mining. The resulting data structure is a prefix-tree graph structure made of pre-mined rules. This graph stores the rules as paths within the prefix-tree in a way that similar rules overlay each other. Each node in the tree represents a rule where a consequent is this node, and an antecedent is a path from this node to the root of the tree. The evaluation showed that the proposed representation technique is promising. It compresses a ruleset with almost no data loss and benefits in terms of time for basic operations such as searching for a specific rule and sorting, which is the base for many knowledge discovery methods. Moreover, our method demonstrated a significant improvement in traversing time, achieving an 8-fold increase compared to traditional data structures. ",
    "url": "https://arxiv.org/abs/2310.17355",
    "authors": [
      "Mikhail Kudriavtsev",
      "Dr Marija Bezbradica",
      "Dr Andrew McCarren"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17359",
    "title": "SE(3) Diffusion Model-based Point Cloud Registration for Robust 6D  Object Pose Estimation",
    "abstract": "In this paper, we introduce an SE(3) diffusion model-based point cloud registration framework for 6D object pose estimation in real-world scenarios. Our approach formulates the 3D registration task as a denoising diffusion process, which progressively refines the pose of the source point cloud to obtain a precise alignment with the model point cloud. Training our framework involves two operations: An SE(3) diffusion process and an SE(3) reverse process. The SE(3) diffusion process gradually perturbs the optimal rigid transformation of a pair of point clouds by continuously injecting noise (perturbation transformation). By contrast, the SE(3) reverse process focuses on learning a denoising network that refines the noisy transformation step-by-step, bringing it closer to the optimal transformation for accurate pose estimation. Unlike standard diffusion models used in linear Euclidean spaces, our diffusion model operates on the SE(3) manifold. This requires exploiting the linear Lie algebra $\\mathfrak{se}(3)$ associated with SE(3) to constrain the transformation transitions during the diffusion and reverse processes. Additionally, to effectively train our denoising network, we derive a registration-specific variational lower bound as the optimization objective for model learning. Furthermore, we show that our denoising network can be constructed with a surrogate registration model, making our approach applicable to different deep registration networks. Extensive experiments demonstrate that our diffusion registration framework presents outstanding pose estimation performance on the real-world TUD-L, LINEMOD, and Occluded-LINEMOD datasets. ",
    "url": "https://arxiv.org/abs/2310.17359",
    "authors": [
      "Haobo Jiang",
      "Mathieu Salzmann",
      "Zheng Dang",
      "Jin Xie",
      "Jian Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.17360",
    "title": "Towards Unifying Diffusion Models for Probabilistic Spatio-Temporal  Graph Learning",
    "abstract": "Spatio-temporal graph learning is a fundamental problem in the Web of Things era, which enables a plethora of Web applications such as smart cities, human mobility and climate analysis. Existing approaches tackle different learning tasks independently, tailoring their models to unique task characteristics. These methods, however, fall short of modeling intrinsic uncertainties in the spatio-temporal data. Meanwhile, their specialized designs limit their universality as general spatio-temporal learning solutions. In this paper, we propose to model the learning tasks in a unified perspective, viewing them as predictions based on conditional information with shared spatio-temporal patterns. Based on this proposal, we introduce Unified Spatio-Temporal Diffusion Models (USTD) to address the tasks uniformly within the uncertainty-aware diffusion framework. USTD is holistically designed, comprising a shared spatio-temporal encoder and attention-based denoising networks that are task-specific. The shared encoder, optimized by a pre-training strategy, effectively captures conditional spatio-temporal patterns. The denoising networks, utilizing both cross- and self-attention, integrate conditional dependencies and generate predictions. Opting for forecasting and kriging as downstream tasks, we design Gated Attention (SGA) and Temporal Gated Attention (TGA) for each task, with different emphases on the spatial and temporal dimensions, respectively. By combining the advantages of deterministic encoders and probabilistic diffusion models, USTD achieves state-of-the-art performances compared to deterministic and probabilistic baselines in both tasks, while also providing valuable uncertainty estimates. ",
    "url": "https://arxiv.org/abs/2310.17360",
    "authors": [
      "Junfeng Hu",
      "Xu Liu",
      "Zhencheng Fan",
      "Yuxuan Liang",
      "Roger Zimmermann"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17364",
    "title": "Distributed Adaptive Control for Uncertain Networks",
    "abstract": "Control of network systems with uncertain local dynamics has remained an open problem for a long time. In this paper, a distributed minimax adaptive control algorithm is proposed for such networks whose local dynamics has an uncertain parameter possibly taking finite number of values. To hedge against this uncertainty, each node in the network collects the historical data of its neighboring nodes to decide its control action along its edges by finding the parameter that best describes the observed disturbance trajectory. Our proposed distributed adaptive controller is scalable and we give both lower and upper bounds for its $\\ell_{2}$ gain. Numerical simulations demonstrate that once each node has sufficiently estimated its local uncertainty, the distributed minimax adaptive controller behaves like the optimal distributed $H_{\\infty}$ controller in hindsight. ",
    "url": "https://arxiv.org/abs/2310.17364",
    "authors": [
      "Venkatraman Renganathan",
      "Anders Rantzer",
      "Olle Kjellqvist"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.17378",
    "title": "Optimization dependent generalization bound for ReLU networks based on  sensitivity in the tangent bundle",
    "abstract": "Recent advances in deep learning have given us some very promising results on the generalization ability of deep neural networks, however literature still lacks a comprehensive theory explaining why heavily over-parametrized models are able to generalize well while fitting the training data. In this paper we propose a PAC type bound on the generalization error of feedforward ReLU networks via estimating the Rademacher complexity of the set of networks available from an initial parameter vector via gradient descent. The key idea is to bound the sensitivity of the network's gradient to perturbation of the input data along the optimization trajectory. The obtained bound does not explicitly depend on the depth of the network. Our results are experimentally verified on the MNIST and CIFAR-10 datasets. ",
    "url": "https://arxiv.org/abs/2310.17378",
    "authors": [
      "Dániel Rácz",
      "Mihály Petreczky",
      "András Csertán",
      "Bálint Daróczy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.17379",
    "title": "YOLO-BEV: Generating Bird's-Eye View in the Same Way as 2D Object  Detection",
    "abstract": "Vehicle perception systems strive to achieve comprehensive and rapid visual interpretation of their surroundings for improved safety and navigation. We introduce YOLO-BEV, an efficient framework that harnesses a unique surrounding cameras setup to generate a 2D bird's-eye view of the vehicular environment. By strategically positioning eight cameras, each at a 45-degree interval, our system captures and integrates imagery into a coherent 3x3 grid format, leaving the center blank, providing an enriched spatial representation that facilitates efficient processing. In our approach, we employ YOLO's detection mechanism, favoring its inherent advantages of swift response and compact model structure. Instead of leveraging the conventional YOLO detection head, we augment it with a custom-designed detection head, translating the panoramically captured data into a unified bird's-eye view map of ego car. Preliminary results validate the feasibility of YOLO-BEV in real-time vehicular perception tasks. With its streamlined architecture and potential for rapid deployment due to minimized parameters, YOLO-BEV poses as a promising tool that may reshape future perspectives in autonomous driving systems. ",
    "url": "https://arxiv.org/abs/2310.17379",
    "authors": [
      "Chang Liu",
      "Liguo Zhou",
      "Yanliang Huang",
      "Alois Knoll"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.17389",
    "title": "ToxicChat: Unveiling Hidden Challenges of Toxicity Detection in  Real-World User-AI Conversation",
    "abstract": "Despite remarkable advances that large language models have achieved in chatbots, maintaining a non-toxic user-AI interactive environment has become increasingly critical nowadays. However, previous efforts in toxicity detection have been mostly based on benchmarks derived from social media content, leaving the unique challenges inherent to real-world user-AI interactions insufficiently explored. In this work, we introduce ToxicChat, a novel benchmark based on real user queries from an open-source chatbot. This benchmark contains the rich, nuanced phenomena that can be tricky for current toxicity detection models to identify, revealing a significant domain difference compared to social media content. Our systematic evaluation of models trained on existing toxicity datasets has shown their shortcomings when applied to this unique domain of ToxicChat. Our work illuminates the potentially overlooked challenges of toxicity detection in real-world user-AI conversations. In the future, ToxicChat can be a valuable resource to drive further advancements toward building a safe and healthy environment for user-AI interactions. ",
    "url": "https://arxiv.org/abs/2310.17389",
    "authors": [
      "Zi Lin",
      "Zihan Wang",
      "Yongqi Tong",
      "Yangkun Wang",
      "Yuxin Guo",
      "Yujia Wang",
      "Jingbo Shang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.17394",
    "title": "Enhancing Graph Neural Networks with Structure-Based Prompt",
    "abstract": "Graph Neural Networks (GNNs) are powerful in learning semantics of graph data. Recently, a new paradigm \"pre-train, prompt\" has shown promising results in adapting GNNs to various tasks with less supervised data. The success of such paradigm can be attributed to the more consistent objectives of pre-training and task-oriented prompt tuning, where the pre-trained knowledge can be effectively transferred to downstream tasks. However, an overlooked issue of existing studies is that the structure information of graph is usually exploited during pre-training for learning node representations, while neglected in the prompt tuning stage for learning task-specific parameters. To bridge this gap, we propose a novel structure-based prompting method for GNNs, namely SAP, which consistently exploits structure information in both pre-training and prompt tuning stages. In particular, SAP 1) employs a dual-view contrastive learning to align the latent semantic spaces of node attributes and graph structure, and 2) incorporates structure information in prompted graph to elicit more pre-trained knowledge in prompt tuning. We conduct extensive experiments on node classification and graph classification tasks to show the effectiveness of SAP. Moreover, we show that SAP can lead to better performance in more challenging few-shot scenarios on both homophilous and heterophilous graphs. ",
    "url": "https://arxiv.org/abs/2310.17394",
    "authors": [
      "Qingqing Ge",
      "Zeyuan Zhao",
      "Yiding Liu",
      "Anfeng Cheng",
      "Xiang Li",
      "Shuaiqiang Wang",
      "Dawei Yin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17401",
    "title": "Energy Efficient Robust Beamforming for Vehicular ISAC with Imperfect  Channel Estimation",
    "abstract": "This paper investigates robust beamforming for system-centric energy efficiency (EE) optimization in the vehicular integrated sensing and communication (ISAC) system, where the mobility of vehicles poses significant challenges to channel estimation. To obtain the optimal beamforming under channel uncertainty, we first formulate an optimization problem for maximizing the system EE under bounded channel estimation errors. Next, fractional programming and semidefinite relaxation (SDR) are utilized to relax the rank-1 constraints. We further use Schur complement and S-Procedure to transform Cramer-Rao bound (CRB) and channel estimation error constraints into convex forms, respectively. Based on the Lagrangian dual function and Karush-Kuhn-Tucker (KKT) conditions, it is proved that the optimal beamforming solution is rank-1. Finally, we present comprehensive simulation results to demonstrate two key findings: 1) the proposed algorithm exhibits a favorable convergence rate, and 2) the approach effectively mitigates the impact of channel estimation errors. ",
    "url": "https://arxiv.org/abs/2310.17401",
    "authors": [
      "Hanwen Zhang",
      "Haijian Sun",
      "Tianyi He",
      "Weiming Xiang",
      "Rose Qingyang Hu"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2310.17403",
    "title": "Detection Defenses: An Empty Promise against Adversarial Patch Attacks  on Optical Flow",
    "abstract": "Adversarial patches undermine the reliability of optical flow predictions when placed in arbitrary scene locations. Therefore, they pose a realistic threat to real-world motion detection and its downstream applications. Potential remedies are defense strategies that detect and remove adversarial patches, but their influence on the underlying motion prediction has not been investigated. In this paper, we thoroughly examine the currently available detect-and-remove defenses ILP and LGS for a wide selection of state-of-the-art optical flow methods, and illuminate their side effects on the quality and robustness of the final flow predictions. In particular, we implement defense-aware attacks to investigate whether current defenses are able to withstand attacks that take the defense mechanism into account. Our experiments yield two surprising results: Detect-and-remove defenses do not only lower the optical flow quality on benign scenes, in doing so, they also harm the robustness under patch attacks for all tested optical flow methods except FlowNetC. As currently employed detect-and-remove defenses fail to deliver the promised adversarial robustness for optical flow, they evoke a false sense of security. The code is available at https://github.com/cv-stuttgart/DetectionDefenses. ",
    "url": "https://arxiv.org/abs/2310.17403",
    "authors": [
      "Erik Scheurer",
      "Jenny Schmalfuss",
      "Alexander Lis",
      "Andrés Bruhn"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17404",
    "title": "Invariance Measures for Neural Networks",
    "abstract": "Invariances in neural networks are useful and necessary for many tasks. However, the representation of the invariance of most neural network models has not been characterized. We propose measures to quantify the invariance of neural networks in terms of their internal representation. The measures are efficient and interpretable, and can be applied to any neural network model. They are also more sensitive to invariance than previously defined measures. We validate the measures and their properties in the domain of affine transformations and the CIFAR10 and MNIST datasets, including their stability and interpretability. Using the measures, we perform a first analysis of CNN models and show that their internal invariance is remarkably stable to random weight initializations, but not to changes in dataset or transformation. We believe the measures will enable new avenues of research in invariance representation. ",
    "url": "https://arxiv.org/abs/2310.17404",
    "authors": [
      "Facundo Manuel Quiroga",
      "Jordina Torrents-Barrena",
      "Laura Cristina Lanzarini",
      "Domenec Puig-Valls"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2310.17405",
    "title": "Causal Modeling with Stationary Diffusions",
    "abstract": "We develop a novel approach towards causal inference. Rather than structural equations over a causal graph, we learn stochastic differential equations (SDEs) whose stationary densities model a system's behavior under interventions. These stationary diffusion models do not require the formalism of causal graphs, let alone the common assumption of acyclicity. We show that in several cases, they generalize to unseen interventions on their variables, often better than classical approaches. Our inference method is based on a new theoretical result that expresses a stationarity condition on the diffusion's generator in a reproducing kernel Hilbert space. The resulting kernel deviation from stationarity (KDS) is an objective function of independent interest. ",
    "url": "https://arxiv.org/abs/2310.17405",
    "authors": [
      "Lars Lorch",
      "Andreas Krause",
      "Bernhard Schölkopf"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17413",
    "title": "Harnessing GPT-3.5-turbo for Rhetorical Role Prediction in Legal Cases",
    "abstract": "We propose a comprehensive study of one-stage elicitation techniques for querying a large pre-trained generative transformer (GPT-3.5-turbo) in the rhetorical role prediction task of legal cases. This task is known as requiring textual context to be addressed. Our study explores strategies such as zero-few shots, task specification with definitions and clarification of annotation ambiguities, textual context and reasoning with general prompts and specific questions. We show that the number of examples, the definition of labels, the presentation of the (labelled) textual context and specific questions about this context have a positive influence on the performance of the model. Given non-equivalent test set configurations, we observed that prompting with a few labelled examples from direct context can lead the model to a better performance than a supervised fined-tuned multi-class classifier based on the BERT encoder (weighted F1 score of = 72%). But there is still a gap to reach the performance of the best systems = 86%) in the LegalEval 2023 task which, on the other hand, require dedicated resources, architectures and training. ",
    "url": "https://arxiv.org/abs/2310.17413",
    "authors": [
      "Anas Belfathi",
      "Nicolas Hernandez",
      "Laura Monceaux"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.17430",
    "title": "A near-autonomous and incremental intrusion detection system through  active learning of known and unknown attacks",
    "abstract": "Intrusion detection is a traditional practice of security experts, however, there are several issues which still need to be tackled. Therefore, in this paper, after highlighting these issues, we present an architecture for a hybrid Intrusion Detection System (IDS) for an adaptive and incremental detection of both known and unknown attacks. The IDS is composed of supervised and unsupervised modules, namely, a Deep Neural Network (DNN) and the K-Nearest Neighbors (KNN) algorithm, respectively. The proposed system is near-autonomous since the intervention of the expert is minimized through the active learning (AL) approach. A query strategy for the labeling process is presented, it aims at teaching the supervised module to detect unknown attacks and improve the detection of the already-known attacks. This teaching is achieved through sliding windows (SW) in an incremental fashion where the DNN is retrained when the data is available over time, thus rendering the IDS adaptive to cope with the evolutionary aspect of the network traffic. A set of experiments was conducted on the CICIDS2017 dataset in order to evaluate the performance of the IDS, promising results were obtained. ",
    "url": "https://arxiv.org/abs/2310.17430",
    "authors": [
      "Lynda Boukela",
      "Gongxuan Zhang",
      "Meziane Yacoub",
      "Samia Bouzefrane"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.17432",
    "title": "Likelihood-based Out-of-Distribution Detection with Denoising Diffusion  Probabilistic Models",
    "abstract": "Out-of-Distribution detection between dataset pairs has been extensively explored with generative models. We show that likelihood-based Out-of-Distribution detection can be extended to diffusion models by leveraging the fact that they, like other likelihood-based generative models, are dramatically affected by the input sample complexity. Currently, all Out-of-Distribution detection methods with Diffusion Models are reconstruction-based. We propose a new likelihood ratio for Out-of-Distribution detection with Deep Denoising Diffusion Models, which we call the Complexity Corrected Likelihood Ratio. Our likelihood ratio is constructed using Evidence Lower-Bound evaluations from an individual model at various noising levels. We present results that are comparable to state-of-the-art Out-of-Distribution detection methods with generative models. ",
    "url": "https://arxiv.org/abs/2310.17432",
    "authors": [
      "Joseph Goodier",
      "Neill D.F. Campbell"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17436",
    "title": "Uncertainty-weighted Loss Functions for Improved Adversarial Attacks on  Semantic Segmentation",
    "abstract": "State-of-the-art deep neural networks have been shown to be extremely powerful in a variety of perceptual tasks like semantic segmentation. However, these networks are vulnerable to adversarial perturbations of the input which are imperceptible for humans but lead to incorrect predictions. Treating image segmentation as a sum of pixel-wise classifications, adversarial attacks developed for classification models were shown to be applicable to segmentation models as well. In this work, we present simple uncertainty-based weighting schemes for the loss functions of such attacks that (i) put higher weights on pixel classifications which can more easily perturbed and (ii) zero-out the pixel-wise losses corresponding to those pixels that are already confidently misclassified. The weighting schemes can be easily integrated into the loss function of a range of well-known adversarial attackers with minimal additional computational overhead, but lead to significant improved perturbation performance, as we demonstrate in our empirical analysis on several datasets and models. ",
    "url": "https://arxiv.org/abs/2310.17436",
    "authors": [
      "Kira Maag",
      "Asja Fischer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.17448",
    "title": "Dialect Adaptation and Data Augmentation for Low-Resource ASR: TalTech  Systems for the MADASR 2023 Challenge",
    "abstract": "This paper describes Tallinn University of Technology (TalTech) systems developed for the ASRU MADASR 2023 Challenge. The challenge focuses on automatic speech recognition of dialect-rich Indian languages with limited training audio and text data. TalTech participated in two tracks of the challenge: Track 1 that allowed using only the provided training data and Track 3 which allowed using additional audio data. In both tracks, we relied on wav2vec2.0 models. Our methodology diverges from the traditional procedure of finetuning pretrained wav2vec2.0 models in two key points: firstly, through the implementation of the aligned data augmentation technique to enhance the linguistic diversity of the training data, and secondly, via the application of deep prefix tuning for dialect adaptation of wav2vec2.0 models. In both tracks, our approach yielded significant improvements over the provided baselines, achieving the lowest word error rates across all participating teams. ",
    "url": "https://arxiv.org/abs/2310.17448",
    "authors": [
      "Tanel Alumäe",
      "Jiaming Kong",
      "Daniil Robnikov"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2310.17451",
    "title": "Generating by Understanding: Neural Visual Generation with Logical  Symbol Groundings",
    "abstract": "Despite the great success of neural visual generative models in recent years, integrating them with strong symbolic knowledge reasoning systems remains a challenging task. The main challenges are two-fold: one is symbol assignment, i.e. bonding latent factors of neural visual generators with meaningful symbols from knowledge reasoning systems. Another is rule learning, i.e. learning new rules, which govern the generative process of the data, to augment the knowledge reasoning systems. To deal with these symbol grounding problems, we propose a neural-symbolic learning approach, Abductive Visual Generation (AbdGen), for integrating logic programming systems with neural visual generative models based on the abductive learning framework. To achieve reliable and efficient symbol assignment, the quantized abduction method is introduced for generating abduction proposals by the nearest-neighbor lookups within semantic codebooks. To achieve precise rule learning, the contrastive meta-abduction method is proposed to eliminate wrong rules with positive cases and avoid less-informative rules with negative cases simultaneously. Experimental results on various benchmark datasets show that compared to the baselines, AbdGen requires significantly fewer instance-level labeling information for symbol assignment. Furthermore, our approach can effectively learn underlying logical generative rules from data, which is out of the capability of existing approaches. ",
    "url": "https://arxiv.org/abs/2310.17451",
    "authors": [
      "Yifei Peng",
      "Yu Jin",
      "Zhexu Luo",
      "Yao-Xiang Ding",
      "Wang-Zhou Dai",
      "Zhong Ren",
      "Kun Zhou"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2310.17463",
    "title": "Bayesian Neural Controlled Differential Equations for Treatment Effect  Estimation",
    "abstract": "Treatment effect estimation in continuous time is crucial for personalized medicine. However, existing methods for this task are limited to point estimates of the potential outcomes, whereas uncertainty estimates have been ignored. Needless to say, uncertainty quantification is crucial for reliable decision-making in medical applications. To fill this gap, we propose a novel Bayesian neural controlled differential equation (BNCDE) for treatment effect estimation in continuous time. In our BNCDE, the time dimension is modeled through a coupled system of neural controlled differential equations and neural stochastic differential equations, where the neural stochastic differential equations allow for tractable variational Bayesian inference. Thereby, for an assigned sequence of treatments, our BNCDE provides meaningful posterior predictive distributions of the potential outcomes. To the best of our knowledge, ours is the first tailored neural method to provide uncertainty estimates of treatment effects in continuous time. As such, our method is of direct practical value for promoting reliable decision-making in medicine. ",
    "url": "https://arxiv.org/abs/2310.17463",
    "authors": [
      "Konstantin Hess",
      "Valentyn Melnychuk",
      "Dennis Frauen",
      "Stefan Feuerriegel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17493",
    "title": "A Hybrid Graph Network for Complex Activity Detection in Video",
    "abstract": "Interpretation and understanding of video presents a challenging computer vision task in numerous fields - e.g. autonomous driving and sports analytics. Existing approaches to interpreting the actions taking place within a video clip are based upon Temporal Action Localisation (TAL), which typically identifies short-term actions. The emerging field of Complex Activity Detection (CompAD) extends this analysis to long-term activities, with a deeper understanding obtained by modelling the internal structure of a complex activity taking place within the video. We address the CompAD problem using a hybrid graph neural network which combines attention applied to a graph encoding the local (short-term) dynamic scene with a temporal graph modelling the overall long-duration activity. Our approach is as follows: i) Firstly, we propose a novel feature extraction technique which, for each video snippet, generates spatiotemporal `tubes' for the active elements (`agents') in the (local) scene by detecting individual objects, tracking them and then extracting 3D features from all the agent tubes as well as the overall scene. ii) Next, we construct a local scene graph where each node (representing either an agent tube or the scene) is connected to all other nodes. Attention is then applied to this graph to obtain an overall representation of the local dynamic scene. iii) Finally, all local scene graph representations are interconnected via a temporal graph, to estimate the complex activity class together with its start and end time. The proposed framework outperforms all previous state-of-the-art methods on all three datasets including ActivityNet-1.3, Thumos-14, and ROAD. ",
    "url": "https://arxiv.org/abs/2310.17493",
    "authors": [
      "Salman Khan",
      "Izzeddin Teeti",
      "Andrew Bradley",
      "Mohamed Elhoseiny",
      "Fabio Cuzzolin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.17498",
    "title": "CBD: A Certified Backdoor Detector Based on Local Dominant Probability",
    "abstract": "Backdoor attack is a common threat to deep neural networks. During testing, samples embedded with a backdoor trigger will be misclassified as an adversarial target by a backdoored model, while samples without the backdoor trigger will be correctly classified. In this paper, we present the first certified backdoor detector (CBD), which is based on a novel, adjustable conformal prediction scheme based on our proposed statistic local dominant probability. For any classifier under inspection, CBD provides 1) a detection inference, 2) the condition under which the attacks are guaranteed to be detectable for the same classification domain, and 3) a probabilistic upper bound for the false positive rate. Our theoretical results show that attacks with triggers that are more resilient to test-time noise and have smaller perturbation magnitudes are more likely to be detected with guarantees. Moreover, we conduct extensive experiments on four benchmark datasets considering various backdoor types, such as BadNet, CB, and Blend. CBD achieves comparable or even higher detection accuracy than state-of-the-art detectors, and it in addition provides detection certification. Notably, for backdoor attacks with random perturbation triggers bounded by $\\ell_2\\leq0.75$ which achieves more than 90\\% attack success rate, CBD achieves 100\\% (98\\%), 100\\% (84\\%), 98\\% (98\\%), and 72\\% (40\\%) empirical (certified) detection true positive rates on the four benchmark datasets GTSRB, SVHN, CIFAR-10, and TinyImageNet, respectively, with low false positive rates. ",
    "url": "https://arxiv.org/abs/2310.17498",
    "authors": [
      "Zhen Xiang",
      "Zidi Xiong",
      "Bo Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2310.17523",
    "title": "Adaptive Resource Management for Edge Network Slicing using Incremental  Multi-Agent Deep Reinforcement Learning",
    "abstract": "Multi-access edge computing provides local resources in mobile networks as the essential means for meeting the demands of emerging ultra-reliable low-latency communications. At the edge, dynamic computing requests require advanced resource management for adaptive network slicing, including resource allocations, function scaling and load balancing to utilize only the necessary resources in resource-constraint networks. Recent solutions are designed for a static number of slices. Therefore, the painful process of optimization is required again with any update on the number of slices. In addition, these solutions intend to maximize instant rewards, neglecting long-term resource scheduling. Unlike these efforts, we propose an algorithmic approach based on multi-agent deep deterministic policy gradient (MADDPG) for optimizing resource management for edge network slicing. Our objective is two-fold: (i) maximizing long-term network slicing benefits in terms of delay and energy consumption, and (ii) adapting to slice number changes. Through simulations, we demonstrate that MADDPG outperforms benchmark solutions including a static slicing-based one from the literature, achieving stable and high long-term performance. Additionally, we leverage incremental learning to facilitate a dynamic number of edge slices, with enhanced performance compared to pre-trained base models. Remarkably, this approach yields superior reward performance while saving approximately 90% of training time costs. ",
    "url": "https://arxiv.org/abs/2310.17523",
    "authors": [
      "Haiyuan Li",
      "Yuelin Liu",
      "Xueqing Zhou",
      "Xenofon Vasilakos",
      "Reza Nejabati",
      "Shuangyi Yan",
      "Dimitra Simenidou"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.17534",
    "title": "SoK: Pitfalls in Evaluating Black-Box Attacks",
    "abstract": "Numerous works study black-box attacks on image classifiers. However, these works make different assumptions on the adversary's knowledge and current literature lacks a cohesive organization centered around the threat model. To systematize knowledge in this area, we propose a taxonomy over the threat space spanning the axes of feedback granularity, the access of interactive queries, and the quality and quantity of the auxiliary data available to the attacker. Our new taxonomy provides three key insights. 1) Despite extensive literature, numerous under-explored threat spaces exist, which cannot be trivially solved by adapting techniques from well-explored settings. We demonstrate this by establishing a new state-of-the-art in the less-studied setting of access to top-k confidence scores by adapting techniques from well-explored settings of accessing the complete confidence vector, but show how it still falls short of the more restrictive setting that only obtains the prediction label, highlighting the need for more research. 2) Identification the threat model of different attacks uncovers stronger baselines that challenge prior state-of-the-art claims. We demonstrate this by enhancing an initially weaker baseline (under interactive query access) via surrogate models, effectively overturning claims in the respective paper. 3) Our taxonomy reveals interactions between attacker knowledge that connect well to related areas, such as model inversion and extraction attacks. We discuss how advances in other areas can enable potentially stronger black-box attacks. Finally, we emphasize the need for a more realistic assessment of attack success by factoring in local attack runtime. This approach reveals the potential for certain attacks to achieve notably higher success rates and the need to evaluate attacks in diverse and harder settings, highlighting the need for better selection criteria. ",
    "url": "https://arxiv.org/abs/2310.17534",
    "authors": [
      "Fnu Suya",
      "Anshuman Suri",
      "Tingwei Zhang",
      "Jingtao Hong",
      "Yuan Tian",
      "David Evans"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17579",
    "title": "BLIS-Net: Classifying and Analyzing Signals on Graphs",
    "abstract": "Graph neural networks (GNNs) have emerged as a powerful tool for tasks such as node classification and graph classification. However, much less work has been done on signal classification, where the data consists of many functions (referred to as signals) defined on the vertices of a single graph. These tasks require networks designed differently from those designed for traditional GNN tasks. Indeed, traditional GNNs rely on localized low-pass filters, and signals of interest may have intricate multi-frequency behavior and exhibit long range interactions. This motivates us to introduce the BLIS-Net (Bi-Lipschitz Scattering Net), a novel GNN that builds on the previously introduced geometric scattering transform. Our network is able to capture both local and global signal structure and is able to capture both low-frequency and high-frequency information. We make several crucial changes to the original geometric scattering architecture which we prove increase the ability of our network to capture information about the input signal and show that BLIS-Net achieves superior performance on both synthetic and real-world data sets based on traffic flow and fMRI data. ",
    "url": "https://arxiv.org/abs/2310.17579",
    "authors": [
      "Charles Xu",
      "Laney Goldman",
      "Valentina Guo",
      "Benjamin Hollander-Bodie",
      "Maedee Trank-Greene",
      "Ian Adelstein",
      "Edward De Brouwer",
      "Rex Ying",
      "Smita Krishnaswamy",
      "Michael Perlmutter"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2310.17594",
    "title": "SPA: A Graph Spectral Alignment Perspective for Domain Adaptation",
    "abstract": "Unsupervised domain adaptation (UDA) is a pivotal form in machine learning to extend the in-domain model to the distinctive target domains where the data distributions differ. Most prior works focus on capturing the inter-domain transferability but largely overlook rich intra-domain structures, which empirically results in even worse discriminability. In this work, we introduce a novel graph SPectral Alignment (SPA) framework to tackle the tradeoff. The core of our method is briefly condensed as follows: (i)-by casting the DA problem to graph primitives, SPA composes a coarse graph alignment mechanism with a novel spectral regularizer towards aligning the domain graphs in eigenspaces; (ii)-we further develop a fine-grained message propagation module -- upon a novel neighbor-aware self-training mechanism -- in order for enhanced discriminability in the target domain. On standardized benchmarks, the extensive experiments of SPA demonstrate that its performance has surpassed the existing cutting-edge DA methods. Coupled with dense model analysis, we conclude that our approach indeed possesses superior efficacy, robustness, discriminability, and transferability. Code and data are available at: https://github.com/CrownX/SPA. ",
    "url": "https://arxiv.org/abs/2310.17594",
    "authors": [
      "Zhiqing Xiao",
      "Haobo Wang",
      "Ying Jin",
      "Lei Feng",
      "Gang Chen",
      "Fei Huang",
      "Junbo Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.17616",
    "title": "Verifying Programs with Logic and Extended Proof Rules: Deep Embedding  v.s. Shallow Embedding",
    "abstract": "Many foundational program verification tools have been developed to build machine-checked program correctness proofs, a majority of which are based on Hoare logic. Their program logics, their assertion languages, and their underlying programming languages can be formalized by either a shallow embedding or a deep embedding. Tools like Iris and early versions of Verified Software Toolchain (VST) choose different shallow embeddings to formalize their program logics. But the pros and cons of these different embeddings were not yet well studied. Therefore, we want to study the impact of the program logic's embedding on logic's proof rules in this paper. This paper considers a set of useful extended proof rules, and four different logic embeddings: one deep embedding and three common shallow embeddings. We prove the validity of these extended rules under these embeddings and discuss their main challenges. Furthermore, we propose a method to lift existing shallowly embedded logics to deeply embedded ones to greatly simplify proofs of extended rules in specific proof systems. We evaluate our results on two existing verification tools. We lift the originally shallowly embedded VST to our deeply embedded VST to support extended rules, and we implement Iris-CF and deeply embedded Iris-Imp based on the Iris framework to evaluate our theory in real verification projects. ",
    "url": "https://arxiv.org/abs/2310.17616",
    "authors": [
      "Zhongye Wang",
      "Qinxiang Cao",
      "Yichen Tao"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2310.17622",
    "title": "Combating Representation Learning Disparity with Geometric Harmonization",
    "abstract": "Self-supervised learning (SSL) as an effective paradigm of representation learning has achieved tremendous success on various curated datasets in diverse scenarios. Nevertheless, when facing the long-tailed distribution in real-world applications, it is still hard for existing methods to capture transferable and robust representation. Conventional SSL methods, pursuing sample-level uniformity, easily leads to representation learning disparity where head classes dominate the feature regime but tail classes passively collapse. To address this problem, we propose a novel Geometric Harmonization (GH) method to encourage category-level uniformity in representation learning, which is more benign to the minority and almost does not hurt the majority under long-tailed distribution. Specially, GH measures the population statistics of the embedding space on top of self-supervised learning, and then infer an fine-grained instance-wise calibration to constrain the space expansion of head classes and avoid the passive collapse of tail classes. Our proposal does not alter the setting of SSL and can be easily integrated into existing methods in a low-cost manner. Extensive results on a range of benchmark datasets show the effectiveness of GH with high tolerance to the distribution skewness. Our code is available at https://github.com/MediaBrain-SJTU/Geometric-Harmonization. ",
    "url": "https://arxiv.org/abs/2310.17622",
    "authors": [
      "Zhihan Zhou",
      "Jiangchao Yao",
      "Feng Hong",
      "Ya Zhang",
      "Bo Han",
      "Yanfeng Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17626",
    "title": "A Survey on Transferability of Adversarial Examples across Deep Neural  Networks",
    "abstract": "The emergence of Deep Neural Networks (DNNs) has revolutionized various domains, enabling the resolution of complex tasks spanning image recognition, natural language processing, and scientific problem-solving. However, this progress has also exposed a concerning vulnerability: adversarial examples. These crafted inputs, imperceptible to humans, can manipulate machine learning models into making erroneous predictions, raising concerns for safety-critical applications. An intriguing property of this phenomenon is the transferability of adversarial examples, where perturbations crafted for one model can deceive another, often with a different architecture. This intriguing property enables \"black-box\" attacks, circumventing the need for detailed knowledge of the target model. This survey explores the landscape of the adversarial transferability of adversarial examples. We categorize existing methodologies to enhance adversarial transferability and discuss the fundamental principles guiding each approach. While the predominant body of research primarily concentrates on image classification, we also extend our discussion to encompass other vision tasks and beyond. Challenges and future prospects are discussed, highlighting the importance of fortifying DNNs against adversarial vulnerabilities in an evolving landscape. ",
    "url": "https://arxiv.org/abs/2310.17626",
    "authors": [
      "Jindong Gu",
      "Xiaojun Jia",
      "Pau de Jorge",
      "Wenqain Yu",
      "Xinwei Liu",
      "Avery Ma",
      "Yuan Xun",
      "Anjun Hu",
      "Ashkan Khakzar",
      "Zhijiang Li",
      "Xiaochun Cao",
      "Philip Torr"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.17630",
    "title": "InstOptima: Evolutionary Multi-objective Instruction Optimization via  Large Language Model-based Instruction Operators",
    "abstract": "Instruction-based language modeling has received significant attention in pretrained language models. However, the efficiency of instruction engineering remains low and hinders the development of instruction studies. Recent studies have focused on automating instruction generation, but they primarily aim to improve performance without considering other crucial objectives that impact instruction quality, such as instruction length and perplexity. Therefore, we propose a novel approach (i.e., InstOptima) that treats instruction generation as an evolutionary multi-objective optimization problem. In contrast to text edition-based methods, our approach utilizes a large language model (LLM) to simulate instruction operators, including mutation and crossover. Furthermore, we introduce an objective-guided mechanism for these operators, allowing the LLM to comprehend the objectives and enhance the quality of the generated instructions. Experimental results demonstrate improved fine-tuning performance and the generation of a diverse set of high-quality instructions. ",
    "url": "https://arxiv.org/abs/2310.17630",
    "authors": [
      "Heng Yang",
      "Ke Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.17643",
    "title": "Where you go is who you are -- A study on machine learning based  semantic privacy attacks",
    "abstract": "Concerns about data privacy are omnipresent, given the increasing usage of digital applications and their underlying business model that includes selling user data. Location data is particularly sensitive since they allow us to infer activity patterns and interests of users, e.g., by categorizing visited locations based on nearby points of interest (POI). On top of that, machine learning methods provide new powerful tools to interpret big data. In light of these considerations, we raise the following question: What is the actual risk that realistic, machine learning based privacy attacks can obtain meaningful semantic information from raw location data, subject to inaccuracies in the data? In response, we present a systematic analysis of two attack scenarios, namely location categorization and user profiling. Experiments on the Foursquare dataset and tracking data demonstrate the potential for abuse of high-quality spatial information, leading to a significant privacy loss even with location inaccuracy of up to 200m. With location obfuscation of more than 1 km, spatial information hardly adds any value, but a high privacy risk solely from temporal information remains. The availability of public context data such as POIs plays a key role in inference based on spatial information. Our findings point out the risks of ever-growing databases of tracking data and spatial context data, which policymakers should consider for privacy regulations, and which could guide individuals in their personal location protection measures. ",
    "url": "https://arxiv.org/abs/2310.17643",
    "authors": [
      "Nina Wiedemann",
      "Ourania Kounadi",
      "Martin Raubal",
      "Krzysztof Janowicz"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17645",
    "title": "Defending Against Transfer Attacks From Public Models",
    "abstract": "Adversarial attacks have been a looming and unaddressed threat in the industry. However, through a decade-long history of the robustness evaluation literature, we have learned that mounting a strong or optimal attack is challenging. It requires both machine learning and domain expertise. In other words, the white-box threat model, religiously assumed by a large majority of the past literature, is unrealistic. In this paper, we propose a new practical threat model where the adversary relies on transfer attacks through publicly available surrogate models. We argue that this setting will become the most prevalent for security-sensitive applications in the future. We evaluate the transfer attacks in this setting and propose a specialized defense method based on a game-theoretic perspective. The defenses are evaluated under 24 public models and 11 attack algorithms across three datasets (CIFAR-10, CIFAR-100, and ImageNet). Under this threat model, our defense, PubDef, outperforms the state-of-the-art white-box adversarial training by a large margin with almost no loss in the normal accuracy. For instance, on ImageNet, our defense achieves 62% accuracy under the strongest transfer attack vs only 36% of the best adversarially trained model. Its accuracy when not under attack is only 2% lower than that of an undefended model (78% vs 80%). We release our code at https://github.com/wagner-group/pubdef. ",
    "url": "https://arxiv.org/abs/2310.17645",
    "authors": [
      "Chawin Sitawarin",
      "Jaewon Chang",
      "David Huang",
      "Wesson Altoyan",
      "David Wagner"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.17650",
    "title": "A Coarse-to-Fine Pseudo-Labeling (C2FPL) Framework for Unsupervised  Video Anomaly Detection",
    "abstract": "Detection of anomalous events in videos is an important problem in applications such as surveillance. Video anomaly detection (VAD) is well-studied in the one-class classification (OCC) and weakly supervised (WS) settings. However, fully unsupervised (US) video anomaly detection methods, which learn a complete system without any annotation or human supervision, have not been explored in depth. This is because the lack of any ground truth annotations significantly increases the magnitude of the VAD challenge. To address this challenge, we propose a simple-but-effective two-stage pseudo-label generation framework that produces segment-level (normal/anomaly) pseudo-labels, which can be further used to train a segment-level anomaly detector in a supervised manner. The proposed coarse-to-fine pseudo-label (C2FPL) generator employs carefully-designed hierarchical divisive clustering and statistical hypothesis testing to identify anomalous video segments from a set of completely unlabeled videos. The trained anomaly detector can be directly applied on segments of an unseen test video to obtain segment-level, and subsequently, frame-level anomaly predictions. Extensive studies on two large-scale public-domain datasets, UCF-Crime and XD-Violence, demonstrate that the proposed unsupervised approach achieves superior performance compared to all existing OCC and US methods , while yielding comparable performance to the state-of-the-art WS methods. ",
    "url": "https://arxiv.org/abs/2310.17650",
    "authors": [
      "Anas Al-lahham",
      "Nurbek Tastan",
      "Zaigham Zaheer",
      "Karthik Nandakumar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17651",
    "title": "High-Dimensional Prediction for Sequential Decision Making",
    "abstract": "We study the problem of making predictions of an adversarially chosen high-dimensional state that are unbiased subject to an arbitrary collection of conditioning events, with the goal of tailoring these events to downstream decision makers. We give efficient algorithms for solving this problem, as well as a number of applications that stem from choosing an appropriate set of conditioning events. ",
    "url": "https://arxiv.org/abs/2310.17651",
    "authors": [
      "Georgy Noarov",
      "Ramya Ramalingam",
      "Aaron Roth",
      "Stephan Xie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.16857",
    "title": "Improvement in Alzheimer's Disease MRI Images Analysis by Convolutional  Neural Networks Via Topological Optimization",
    "abstract": "This research underscores the efficacy of Fourier topological optimization in refining MRI imagery, thereby bolstering the classification precision of Alzheimer's Disease through convolutional neural networks. Recognizing that MRI scans are indispensable for neurological assessments, but frequently grapple with issues like blurriness and contrast irregularities, the deployment of Fourier topological optimization offered enhanced delineation of brain structures, ameliorated noise, and superior contrast. The applied techniques prioritized boundary enhancement, contrast and brightness adjustments, and overall image lucidity. Employing CNN architectures VGG16, ResNet50, InceptionV3, and Xception, the post-optimization analysis revealed a marked elevation in performance. Conclusively, the amalgamation of Fourier topological optimization with CNNs delineates a promising trajectory for the nuanced classification of Alzheimer's Disease, portending a transformative impact on its diagnostic paradigms. ",
    "url": "https://arxiv.org/abs/2310.16857",
    "authors": [
      "Peiwen Tan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.16863",
    "title": "Graph-based multimodal multi-lesion DLBCL treatment response prediction  from PET images",
    "abstract": "Diffuse Large B-cell Lymphoma (DLBCL) is a lymphatic cancer involving one or more lymph nodes and extranodal sites. Its diagnostic and follow-up rely on Positron Emission Tomography (PET) and Computed Tomography (CT). After diagnosis, the number of nonresponding patients to standard front-line therapy remains significant (30-40%). This work aims to develop a computer-aided approach to identify high-risk patients requiring adapted treatment by efficiently exploiting all the information available for each patient, including both clinical and image data. We propose a method based on recent graph neural networks that combine imaging information from multiple lesions, and a cross-attention module to integrate different data modalities efficiently. The model is trained and evaluated on a private prospective multicentric dataset of 583 patients. Experimental results show that our proposed method outperforms classical supervised methods based on either clinical, imaging or both clinical and imaging data for the 2-year progression-free survival (PFS) classification accuracy. ",
    "url": "https://arxiv.org/abs/2310.16863",
    "authors": [
      "Oriane Thiery",
      "Mira Rizkallah",
      "Clément Bailly",
      "Caroline Bodet-Milin",
      "Emmanuel Itti",
      "René-Olivier Casasnovas",
      "Steven Le Gouill",
      "Thomas Carlier",
      "Diana Mateus"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2310.16945",
    "title": "Causal Q-Aggregation for CATE Model Selection",
    "abstract": "Accurate estimation of conditional average treatment effects (CATE) is at the core of personalized decision making. While there is a plethora of models for CATE estimation, model selection is a nontrivial task, due to the fundamental problem of causal inference. Recent empirical work provides evidence in favor of proxy loss metrics with double robust properties and in favor of model ensembling. However, theoretical understanding is lacking. Direct application of prior theoretical work leads to suboptimal oracle model selection rates due to the non-convexity of the model selection problem. We provide regret rates for the major existing CATE ensembling approaches and propose a new CATE model ensembling approach based on Q-aggregation using the doubly robust loss. Our main result shows that causal Q-aggregation achieves statistically optimal oracle model selection regret rates of $\\frac{\\log(M)}{n}$ (with $M$ models and $n$ samples), with the addition of higher-order estimation error terms related to products of errors in the nuisance functions. Crucially, our regret rate does not require that any of the candidate CATE models be close to the truth. We validate our new method on many semi-synthetic datasets and also provide extensions of our work to CATE model selection with instrumental variables and unobserved confounding. ",
    "url": "https://arxiv.org/abs/2310.16945",
    "authors": [
      "Hui Lan",
      "Vasilis Syrgkanis"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.16975",
    "title": "Efficient Neural Network Approaches for Conditional Optimal Transport  with Applications in Bayesian Inference",
    "abstract": "We present two neural network approaches that approximate the solutions of static and dynamic conditional optimal transport (COT) problems, respectively. Both approaches enable sampling and density estimation of conditional probability distributions, which are core tasks in Bayesian inference. Our methods represent the target conditional distributions as transformations of a tractable reference distribution and, therefore, fall into the framework of measure transport. COT maps are a canonical choice within this framework, with desirable properties such as uniqueness and monotonicity. However, the associated COT problems are computationally challenging, even in moderate dimensions. To improve the scalability, our numerical algorithms leverage neural networks to parameterize COT maps. Our methods exploit the structure of the static and dynamic formulations of the COT problem. PCP-Map models conditional transport maps as the gradient of a partially input convex neural network (PICNN) and uses a novel numerical implementation to increase computational efficiency compared to state-of-the-art alternatives. COT-Flow models conditional transports via the flow of a regularized neural ODE; it is slower to train but offers faster sampling. We demonstrate their effectiveness and efficiency by comparing them with state-of-the-art approaches using benchmark datasets and Bayesian inverse problems. ",
    "url": "https://arxiv.org/abs/2310.16975",
    "authors": [
      "Zheyu Oliver Wang",
      "Ricardo Baptista",
      "Youssef Marzouk",
      "Lars Ruthotto",
      "Deepanshu Verma"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.17158",
    "title": "CosmosDSR -- a methodology for automated detection and tracking of  orbital debris using the Unscented Kalman Filter",
    "abstract": "The Kessler syndrome refers to the escalating space debris from frequent space activities, threatening future space exploration. Addressing this issue is vital. Several AI models, including Convolutional Neural Networks (CNN), Kernel Principal Component Analysis (KPCA), and Model-Agnostic Meta-Learning (MAML), have been assessed with various data types. Earlier studies highlighted the combination of the YOLO object detector and a linear Kalman filter for object detection and tracking. Building on this, our project introduces CosmosDSR, a novel methodology combining YOLOv3 with an Unscented Kalman Filter for tracking satellites in sequential images, compared to a linear Kalman filter. Using the SPARK dataset from the University of Luxembourg for training and testing, the YOLOv3 precisely detected and classified all satellite categories (mAP=97.18%, F1=0.95) with few errors (TP=4163, FP=209, FN=237). Both CosmosDSR and the LKF tracked satellites accurately (UKF: MSE=2.83/RMSE=1.66, LKF: MSE=2.84/RMSE=1.66). Despite concerns of class imbalance and the absence of real images, the model shows promise. Future work should address these limitations, increase tracking sample size, and improve metrics. This research suggests the algorithm's potential in detecting and tracking satellites, paving the way for solutions to the Kessler syndrome. ",
    "url": "https://arxiv.org/abs/2310.17158",
    "authors": [
      "Daniel S. Roll",
      "Zeyneb Kurt",
      "Wai Lok Woo"
    ],
    "subjectives": [
      "Earth and Planetary Astrophysics (astro-ph.EP)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.17216",
    "title": "Three-dimensional Bone Image Synthesis with Generative Adversarial  Networks",
    "abstract": "Medical image processing has been highlighted as an area where deep learning-based models have the greatest potential. However, in the medical field in particular, problems of data availability and privacy are hampering research progress and thus rapid implementation in clinical routine. The generation of synthetic data not only ensures privacy, but also allows to \\textit{draw} new patients with specific characteristics, enabling the development of data-driven models on a much larger scale. This work demonstrates that three-dimensional generative adversarial networks (GANs) can be efficiently trained to generate high-resolution medical volumes with finely detailed voxel-based architectures. In addition, GAN inversion is successfully implemented for the three-dimensional setting and used for extensive research on model interpretability and applications such as image morphing, attribute editing and style mixing. The results are comprehensively validated on a database of three-dimensional HR-pQCT instances representing the bone micro-architecture of the distal radius. ",
    "url": "https://arxiv.org/abs/2310.17216",
    "authors": [
      "Christoph Angermann",
      "Johannes Bereiter-Payr",
      "Kerstin Stock",
      "Markus Haltmeier",
      "Gerald Degenhart"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2310.17574",
    "title": "Effective Prime Factorization via Quantum Annealing by Modular  Locally-structured Embedding",
    "abstract": "This paper investigates novel techniques to solve prime factorization by quantum annealing (QA). Our contribution is twofold. First, we present a novel and very compact modular encoding of a binary multiplier circuit into the Pegasus architecture of current D-Wave QA devices. The key contribution is a compact encoding of a controlled full-adder into an 8-qubit module in the Pegasus topology, which we synthesized offline by means of Optimization Modulo Theories. This allows us to encode up to a 21*12-bit multiplier (and a 22*8-bit one) into the Pegasus 5760-qubit topology of current annealers. To the best of our knowledge, these are the largest factorization problems ever encoded into a quantum annealer. Second, we have investigated the problem of actually solving encoded PF problems by running an extensive experimental evaluation on a D-Wave Advantage 4.1 quantum annealer. In order to help the annealer in reaching the global minimum, in the experiments we introduced different approaches to initialize the multiplier qubits and adopted several performance enhancement techniques. Overall, exploiting all the encoding and solving techniques described in this paper, 8, 219, 999 = 32, 749 * 251 was the highest prime product we were able to factorize within the limits of our QPU resources. To the best of our knowledge, this is the largest number which was ever factorized by means of a quantum annealer, and, more generally, by a quantum device. ",
    "url": "https://arxiv.org/abs/2310.17574",
    "authors": [
      "Jingwen Ding",
      "Giuseppe Spallitta",
      "Roberto Sebastiani"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2310.17584",
    "title": "A minimax optimal control approach for robust neural ODEs",
    "abstract": "In this paper, we address the adversarial training of neural ODEs from a robust control perspective. This is an alternative to the classical training via empirical risk minimization, and it is widely used to enforce reliable outcomes for input perturbations. Neural ODEs allow the interpretation of deep neural networks as discretizations of control systems, unlocking powerful tools from control theory for the development and the understanding of machine learning. In this specific case, we formulate the adversarial training with perturbed data as a minimax optimal control problem, for which we derive first order optimality conditions in the form of Pontryagin's Maximum Principle. We provide a novel interpretation of robust training leading to an alternative weighted technique, which we test on a low-dimensional classification task. ",
    "url": "https://arxiv.org/abs/2310.17584",
    "authors": [
      "Cristina Cipriani",
      "Alessandro Scagliotti",
      "Tobias Wöhrer"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2310.17646",
    "title": "Do Graph Neural Networks Dream of Landau Damping? Insights from Kinetic  Simulations of a Plasma Sheet Model",
    "abstract": "We explore the possibility of fully replacing a plasma physics kinetic simulator with a graph neural network-based simulator. We focus on this class of surrogate models given the similarity between their message-passing update mechanism and the traditional physics solver update, and the possibility of enforcing known physical priors into the graph construction and update. We show that our model learns the kinetic plasma dynamics of the one-dimensional plasma model, a predecessor of contemporary kinetic plasma simulation codes, and recovers a wide range of well-known kinetic plasma processes, including plasma thermalization, electrostatic fluctuations about thermal equilibrium, and the drag on a fast sheet and Landau damping. We compare the performance against the original plasma model in terms of run-time, conservation laws, and temporal evolution of key physical quantities. The limitations of the model are presented and possible directions for higher-dimensional surrogate models for kinetic plasmas are discussed. ",
    "url": "https://arxiv.org/abs/2310.17646",
    "authors": [
      "Diogo D Carvalho",
      "Diogo R Ferreira",
      "Luis O Silva"
    ],
    "subjectives": [
      "Plasma Physics (physics.plasm-ph)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2310.17648",
    "title": "Chip-to-chip ODDM network with optically enabled equalization",
    "abstract": "We propose and model an optical communication scheme for short distance datacom links based on the distribution of information across a wide comb spectrum. This modulation format, orthogonal delay division multiplexing, allows the multiplexing of data streams from multiple modulators, as well as the deserialization and equalization of the data in the optical domain. A concrete communication system, that allows the transport of 400 Gb/s across a single CWDM channel with a single 80 GHz cutoff lithium niobate on insulator modulator, is modeled under consideration of all noise sources present in the system and its sensitivity to group velocity dispersion is analyzed. Data is deserialized and equalized at the receiver with a 5-tap optical equalizer. This communication architecture may provide a path forward to implement high-baud-rate signaling in short-reach optical links without requiring high-speed ADCs and electronic deserializers at the receiver, thus maintaining the in-package power consumption at manageable levels. ",
    "url": "https://arxiv.org/abs/2310.17648",
    "authors": [
      "Andrea Zazzi",
      "Jeremy Witzens"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2009.01742",
    "title": "Online Estimation and Community Detection of Network Point Processes for  Event Streams",
    "abstract": " Comments: 45 pages ",
    "url": "https://arxiv.org/abs/2009.01742",
    "authors": [
      "Guanhua Fang",
      "Owen G. Ward",
      "Tian Zheng"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2106.07368",
    "title": "Quality-Aware Network for Face Parsing",
    "abstract": " Comments: 2nd place in Short-video Face Parsing Track of The 3rd Person in Context (PIC) Workshop and Challenge at CVPR 2021 ",
    "url": "https://arxiv.org/abs/2106.07368",
    "authors": [
      "Lu Yang",
      "Qing Song",
      "Xueshi Xin",
      "Wenhe Jia",
      "Zhiwei Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2106.09462",
    "title": "pysentimiento: A Python Toolkit for Opinion Mining and Social NLP tasks",
    "abstract": " Title: pysentimiento: A Python Toolkit for Opinion Mining and Social NLP tasks ",
    "url": "https://arxiv.org/abs/2106.09462",
    "authors": [
      "Juan Manuel Pérez",
      "Mariela Rajngewerc",
      "Juan Carlos Giudici",
      "Damián A. Furman",
      "Franco Luque",
      "Laura Alonso Alemany",
      "María Vanina Martínez"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2109.14251",
    "title": "Road Network Guided Fine-Grained Urban Traffic Flow Inference",
    "abstract": " Comments: This work has been accepted to TNNLS ",
    "url": "https://arxiv.org/abs/2109.14251",
    "authors": [
      "Lingbo Liu",
      "Mengmeng Liu",
      "Guanbin Li",
      "Ziyi Wu",
      "Junfan Lin",
      "Liang Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.12458",
    "title": "Local Advantage Networks for Cooperative Multi-Agent Reinforcement  Learning",
    "abstract": " Comments: this https URL ",
    "url": "https://arxiv.org/abs/2112.12458",
    "authors": [
      "Raphaël Avalos",
      "Mathieu Reymond",
      "Ann Nowé",
      "Diederik M. Roijers"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2205.03752",
    "title": "Efficient Representation of Large-Alphabet Probability Distributions",
    "abstract": " Comments: corrected typos ",
    "url": "https://arxiv.org/abs/2205.03752",
    "authors": [
      "Aviv Adler",
      "Jennifer Tang",
      "Yury Polyanskiy"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2205.15403",
    "title": "Neural Optimal Transport with General Cost Functionals",
    "abstract": " Title: Neural Optimal Transport with General Cost Functionals ",
    "url": "https://arxiv.org/abs/2205.15403",
    "authors": [
      "Arip Asadulaev",
      "Alexander Korotin",
      "Vage Egiazarian",
      "Petr Mokrov",
      "Evgeny Burnaev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.04306",
    "title": "Out-of-Distribution Detection in Time-Series Domain: A Novel Seasonal  Ratio Scoring Approach",
    "abstract": " Comments: Accepted for publication at ACM Transactions on Intelligent Systems and Technology (TIST) ",
    "url": "https://arxiv.org/abs/2207.04306",
    "authors": [
      "Taha Belkhouja",
      "Yan Yan",
      "Janardhan Rao Doppa"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2207.14469",
    "title": "Sharp Thresholds in Adaptive Random Graph Processes",
    "abstract": " Comments: Accepted to Random Structures and Algorithms (RSA). Minor corrections made to Section 3, and the exposition of Section 4 was improved from the previous arXiv version ",
    "url": "https://arxiv.org/abs/2207.14469",
    "authors": [
      "Calum MacRury",
      "Erlang Surya"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2208.01254",
    "title": "A Robust Morphological Approach for Semantic Segmentation of Very High  Resolution Images",
    "abstract": " Comments: Under review at Computer Vision and Image Understanding ",
    "url": "https://arxiv.org/abs/2208.01254",
    "authors": [
      "Siddharth Saravanan",
      "Aditya Challa",
      "Sravan Danda"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.12117",
    "title": "Coarser Equivalences for Causal Concurrency",
    "abstract": " Title: Coarser Equivalences for Causal Concurrency ",
    "url": "https://arxiv.org/abs/2208.12117",
    "authors": [
      "Azadeh Farzan",
      "Umang Mathur"
    ],
    "subjectives": [
      "Formal Languages and Automata Theory (cs.FL)",
      "Logic in Computer Science (cs.LO)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2209.06589",
    "title": "Towards Better Generalization with Flexible Representation of  Multi-Module Graph Neural Networks",
    "abstract": " Title: Towards Better Generalization with Flexible Representation of  Multi-Module Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2209.06589",
    "authors": [
      "Hyungeun Lee",
      "Kijung Yoon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2209.15543",
    "title": "Bayesian Neural Networks for Geothermal Resource Assessment: Prediction  with Uncertainty",
    "abstract": " Comments: 27 pages, 12 figures ",
    "url": "https://arxiv.org/abs/2209.15543",
    "authors": [
      "Stephen Brown",
      "William L. Rodi",
      "Marco Seracini",
      "Chen Gu",
      "Michael Fehler",
      "James Faulds",
      "Connor M. Smith",
      "Sven Treitel"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.10482",
    "title": "Effective Targeted Attacks for Adversarial Self-Supervised Learning",
    "abstract": " Comments: NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2210.10482",
    "authors": [
      "Minseon Kim",
      "Hyeonjeong Ha",
      "Sooel Son",
      "Sung Ju Hwang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.10485",
    "title": "Learning Transferable Adversarial Robust Representations via Multi-view  Consistency",
    "abstract": " Comments: *Equal contribution (Author ordering determined by coin flip). NeurIPS SafetyML workshop 2022, Under review ",
    "url": "https://arxiv.org/abs/2210.10485",
    "authors": [
      "Minseon Kim",
      "Hyeonjeong Ha",
      "Dong Bok Lee",
      "Sung Ju Hwang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.03654",
    "title": "Node-oriented Spectral Filtering for Graph Neural Networks",
    "abstract": " Comments: 15 pages, 10 figures, accepted by TPAMI ",
    "url": "https://arxiv.org/abs/2212.03654",
    "authors": [
      "Shuai Zheng",
      "Zhenfeng Zhu",
      "Zhizhe Liu",
      "Youru Li",
      "Yao Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2301.00157",
    "title": "Ponder: Point Cloud Pre-training via Neural Rendering",
    "abstract": " Comments: Project page: this https URL ",
    "url": "https://arxiv.org/abs/2301.00157",
    "authors": [
      "Di Huang",
      "Sida Peng",
      "Tong He",
      "Honghui Yang",
      "Xiaowei Zhou",
      "Wanli Ouyang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.03965",
    "title": "BiCurNet: Pre-Movement EEG based Neural Decoder for Biceps Curl  Trajectory Estimation",
    "abstract": " Title: BiCurNet: Pre-Movement EEG based Neural Decoder for Biceps Curl  Trajectory Estimation ",
    "url": "https://arxiv.org/abs/2301.03965",
    "authors": [
      "Manali Saini",
      "Anant Jain",
      "Lalan Kumar",
      "Suriya Prakash Muthukrishnan",
      "Shubhendu Bhasin",
      "Sitikantha Roy"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2301.06874",
    "title": "Training Methods of Multi-label Prediction Classifiers for Hyperspectral  Remote Sensing Images",
    "abstract": " Comments: 1- Added references. 2- updated methodology figure and added new figures to visualise the different training schemes and 3- Correcting typos 4- Revised introduction, no change in results or discussion ",
    "url": "https://arxiv.org/abs/2301.06874",
    "authors": [
      "Salma Haidar",
      "José Oramas"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.08951",
    "title": "Time-Conditioned Generative Modeling of Object-Centric Representations  for Video Decomposition and Prediction",
    "abstract": " Title: Time-Conditioned Generative Modeling of Object-Centric Representations  for Video Decomposition and Prediction ",
    "url": "https://arxiv.org/abs/2301.08951",
    "authors": [
      "Chengmin Gao",
      "Bin Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.11113",
    "title": "Finding Regions of Counterfactual Explanations via Robust Optimization",
    "abstract": " Title: Finding Regions of Counterfactual Explanations via Robust Optimization ",
    "url": "https://arxiv.org/abs/2301.11113",
    "authors": [
      "Donato Maragno",
      "Jannis Kurtz",
      "Tabea E. Röber",
      "Rob Goedhart",
      "Ş. Ilker Birbil",
      "Dick den Hertog"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.12593",
    "title": "Risk-Averse Model Uncertainty for Distributionally Robust Safe  Reinforcement Learning",
    "abstract": " Comments: 37th Conference on Neural Information Processing Systems (NeurIPS 2023) ",
    "url": "https://arxiv.org/abs/2301.12593",
    "authors": [
      "James Queeney",
      "Mouhacine Benosman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.12906",
    "title": "Curvature Filtrations for Graph Generative Model Evaluation",
    "abstract": " Comments: Accepted at the 37th Conference on Neural Information Processing Systems (NeurIPS) 2023 ",
    "url": "https://arxiv.org/abs/2301.12906",
    "authors": [
      "Joshua Southern",
      "Jeremy Wayland",
      "Michael Bronstein",
      "Bastian Rieck"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Algebraic Topology (math.AT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.01757",
    "title": "RS-Del: Edit Distance Robustness Certificates for Sequence Classifiers  via Randomized Deletion",
    "abstract": " Comments: To be published in NeurIPS 2023. 36 pages, 7 figures, 12 tables. Includes 20 pages of appendices ",
    "url": "https://arxiv.org/abs/2302.01757",
    "authors": [
      "Zhuoqun Huang",
      "Neil G. Marchant",
      "Keane Lucas",
      "Lujo Bauer",
      "Olga Ohrimenko",
      "Benjamin I. P. Rubinstein"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.02209",
    "title": "A Theory of Link Prediction via Relational Weisfeiler-Leman on Knowledge  Graphs",
    "abstract": " Comments: Proceedings of the Thirty-Seventh Annual Conference on Advances in Neural Information Processing Systems (NeurIPS 2023). Code available at: this https URL ",
    "url": "https://arxiv.org/abs/2302.02209",
    "authors": [
      "Xingyue Huang",
      "Miguel Romero Orth",
      "İsmail İlkan Ceylan",
      "Pablo Barceló"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.03857",
    "title": "Efficient Adversarial Contrastive Learning via Robustness-Aware Coreset  Selection",
    "abstract": " Comments: NeurIPS 2023 Spotlight ",
    "url": "https://arxiv.org/abs/2302.03857",
    "authors": [
      "Xilie Xu",
      "Jingfeng Zhang",
      "Feng Liu",
      "Masashi Sugiyama",
      "Mohan Kankanhalli"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2302.06961",
    "title": "DualStreamFoveaNet: A Dual Stream Fusion Architecture with Anatomical  Awareness for Robust Fovea Localization",
    "abstract": " Comments: This paper is prepared for IEEE Transactions on Biomedical Engineering ",
    "url": "https://arxiv.org/abs/2302.06961",
    "authors": [
      "Sifan Song",
      "Jinfeng Wang",
      "Zilong Wang",
      "Shaopeng Wang",
      "Jionglong Su",
      "Xiaowei Ding",
      "Kang Dang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2303.00198",
    "title": "Convolutional Visual Prompt for Robust Visual Perception",
    "abstract": " Title: Convolutional Visual Prompt for Robust Visual Perception ",
    "url": "https://arxiv.org/abs/2303.00198",
    "authors": [
      "Yun-Yun Tsai",
      "Chengzhi Mao",
      "Junfeng Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.04909",
    "title": "Robotic Fabric Flattening with Wrinkle Direction Detection",
    "abstract": " Comments: Accepted by the 18th International Symposium on Experimental Robotics (ISER 2023) ",
    "url": "https://arxiv.org/abs/2303.04909",
    "authors": [
      "Yulei Qiu",
      "Jihong Zhu",
      "Cosimo Della Santina",
      "Michael Gienger",
      "Jens Kober"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.07963",
    "title": "RoCNet: 3D Robust Registration of Point-Clouds using Deep Learning",
    "abstract": " Comments: 8 pages ",
    "url": "https://arxiv.org/abs/2303.07963",
    "authors": [
      "Karim Slimani",
      "Brahim Tamadazte",
      "Catherine Achard"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.11207",
    "title": "Investigating Topological Order using Recurrent Neural Networks",
    "abstract": " Comments: 15 pages, 6 figures, 2 tables. Published version in Physical Review B ",
    "url": "https://arxiv.org/abs/2303.11207",
    "authors": [
      "Mohamed Hibat-Allah",
      "Roger G. Melko",
      "Juan Carrasquilla"
    ],
    "subjectives": [
      "Strongly Correlated Electrons (cond-mat.str-el)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2303.11249",
    "title": "What Makes Data Suitable for a Locally Connected Neural Network? A  Necessary and Sufficient Condition Based on Quantum Entanglement",
    "abstract": " Comments: Accepted to NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2303.11249",
    "authors": [
      "Yotam Alexander",
      "Nimrod De La Vega",
      "Noam Razin",
      "Nadav Cohen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2303.15027",
    "title": "A Survey on Causal Discovery Methods for I.I.D. and Time Series Data",
    "abstract": " Title: A Survey on Causal Discovery Methods for I.I.D. and Time Series Data ",
    "url": "https://arxiv.org/abs/2303.15027",
    "authors": [
      "Uzma Hasan",
      "Emam Hossain",
      "Md Osman Gani"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01091",
    "title": "Changes to Captions: An Attentive Network for Remote Sensing Change  Captioning",
    "abstract": " Title: Changes to Captions: An Attentive Network for Remote Sensing Change  Captioning ",
    "url": "https://arxiv.org/abs/2304.01091",
    "authors": [
      "Shizhen Chang",
      "Pedram Ghamisi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.11411",
    "title": "Detecting Spoilers in Movie Reviews with External Movie Knowledge and  User Networks",
    "abstract": " Comments: EMNLP 2023 ",
    "url": "https://arxiv.org/abs/2304.11411",
    "authors": [
      "Heng Wang",
      "Wenqian Zhang",
      "Yuyang Bai",
      "Zhaoxuan Tan",
      "Shangbin Feng",
      "Qinghua Zheng",
      "Minnan Luo"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.02324",
    "title": "Cross-Stream Contrastive Learning for Self-Supervised Skeleton-Based  Action Recognition",
    "abstract": " Comments: 15 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2305.02324",
    "authors": [
      "Ding Li",
      "Yongqiang Tang",
      "Zhizhong Zhang",
      "Wensheng Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.13552",
    "title": "Squared Neural Families: A New Class of Tractable Density Models",
    "abstract": " Comments: Spotlight award at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2305.13552",
    "authors": [
      "Russell Tsuchida",
      "Cheng Soon Ong",
      "Dino Sejdinovic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.14077",
    "title": "Mind the spikes: Benign overfitting of kernels and neural networks in  fixed dimension",
    "abstract": " Comments: We provide Python code to reproduce all of our experimental results at this https URL ",
    "url": "https://arxiv.org/abs/2305.14077",
    "authors": [
      "Moritz Haas",
      "David Holzmüller",
      "Ulrike von Luxburg",
      "Ingo Steinwart"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2305.15134",
    "title": "Networks are Slacking Off: Understanding Generalization Problem in Image  Deraining",
    "abstract": " Comments: This article has been accepted by NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2305.15134",
    "authors": [
      "Jinjin Gu",
      "Xianzheng Ma",
      "Xiangtao Kong",
      "Yu Qiao",
      "Chao Dong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.16427",
    "title": "Neural (Tangent Kernel) Collapse",
    "abstract": " Title: Neural (Tangent Kernel) Collapse ",
    "url": "https://arxiv.org/abs/2305.16427",
    "authors": [
      "Mariia Seleznova",
      "Dana Weitzner",
      "Raja Giryes",
      "Gitta Kutyniok",
      "Hung-Hsu Chou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.16905",
    "title": "Improving Neural Additive Models with Bayesian Principles",
    "abstract": " Title: Improving Neural Additive Models with Bayesian Principles ",
    "url": "https://arxiv.org/abs/2305.16905",
    "authors": [
      "Kouroche Bouchiat",
      "Alexander Immer",
      "Hugo Yèche",
      "Gunnar Rätsch",
      "Vincent Fortuin"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.17380",
    "title": "No-Regret Online Reinforcement Learning with Adversarial Losses and  Transitions",
    "abstract": " Comments: Update the camera-ready version for NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2305.17380",
    "authors": [
      "Tiancheng Jin",
      "Junyan Liu",
      "Chloé Rouyer",
      "William Chang",
      "Chen-Yu Wei",
      "Haipeng Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.18353",
    "title": "Emergent representations in networks trained with the Forward-Forward  algorithm",
    "abstract": " Comments: 16 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2305.18353",
    "authors": [
      "Niccolò Tosato",
      "Lorenzo Basile",
      "Emanuele Ballarin",
      "Giuseppe de Alteriis",
      "Alberto Cazzaniga",
      "Alessio Ansuini"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.19470",
    "title": "Label Embedding via Low-Coherence Matrices",
    "abstract": " Title: Label Embedding via Low-Coherence Matrices ",
    "url": "https://arxiv.org/abs/2305.19470",
    "authors": [
      "Jianxin Zhang",
      "Clayton Scott"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2306.00984",
    "title": "StableRep: Synthetic Images from Text-to-Image Models Make Strong Visual  Representation Learners",
    "abstract": " Comments: code is available at: this https URL ",
    "url": "https://arxiv.org/abs/2306.00984",
    "authors": [
      "Yonglong Tian",
      "Lijie Fan",
      "Phillip Isola",
      "Huiwen Chang",
      "Dilip Krishnan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2306.01665",
    "title": "SourceP: Detecting Ponzi Schemes on Ethereum with Source Code",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2306.01665",
    "authors": [
      "Pengcheng Lu",
      "Liang Cai",
      "Keting Yin"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2306.01874",
    "title": "SACSoN: Scalable Autonomous Control for Social Navigation",
    "abstract": " Comments: 11 pages, 15 figures, 4 tables ",
    "url": "https://arxiv.org/abs/2306.01874",
    "authors": [
      "Noriaki Hirose",
      "Dhruv Shah",
      "Ajay Sridhar",
      "Sergey Levine"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.04618",
    "title": "Revisiting Out-of-distribution Robustness in NLP: Benchmark, Analysis,  and LLMs Evaluations",
    "abstract": " Comments: Accepted to NeurIPS 2023 Dataset and Benchmark Track. Code is available at \\url{this https URL} ",
    "url": "https://arxiv.org/abs/2306.04618",
    "authors": [
      "Lifan Yuan",
      "Yangyi Chen",
      "Ganqu Cui",
      "Hongcheng Gao",
      "Fangyuan Zou",
      "Xingyi Cheng",
      "Heng Ji",
      "Zhiyuan Liu",
      "Maosong Sun"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.05557",
    "title": "On Performance Discrepancies Across Local Homophily Levels in Graph  Neural Networks",
    "abstract": " Comments: 30 pages ",
    "url": "https://arxiv.org/abs/2306.05557",
    "authors": [
      "Donald Loveland",
      "Jiong Zhu",
      "Mark Heimann",
      "Benjamin Fish",
      "Michael T. Shaub",
      "Danai Koutra"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.07273",
    "title": "Gaussian Membership Inference Privacy",
    "abstract": " Comments: NeurIPS 2023 camera-ready. The first two authors contributed equally ",
    "url": "https://arxiv.org/abs/2306.07273",
    "authors": [
      "Tobias Leemann",
      "Martin Pawelczyk",
      "Gjergji Kasneci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.01951",
    "title": "A Neural Collapse Perspective on Feature Evolution in Graph Neural  Networks",
    "abstract": " Comments: NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2307.01951",
    "authors": [
      "Vignesh Kothapalli",
      "Tom Tirer",
      "Joan Bruna"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Information Theory (cs.IT)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.04110",
    "title": "Learning Space-Time Continuous Neural PDEs from Partially Observed  States",
    "abstract": " Title: Learning Space-Time Continuous Neural PDEs from Partially Observed  States ",
    "url": "https://arxiv.org/abs/2307.04110",
    "authors": [
      "Valerii Iakovlev",
      "Markus Heinonen",
      "Harri Lähdesmäki"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.07907",
    "title": "Seeing is not Believing: Robust Reinforcement Learning against Spurious  Correlation",
    "abstract": " Comments: Accepted to NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2307.07907",
    "authors": [
      "Wenhao Ding",
      "Laixi Shi",
      "Yuejie Chi",
      "Ding Zhao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.10922",
    "title": "Language-based Action Concept Spaces Improve Video Self-Supervised  Learning",
    "abstract": " Comments: Presented at NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2307.10922",
    "authors": [
      "Kanchana Ranasinghe",
      "Michael Ryoo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.04826",
    "title": "WaveNeRF: Wavelet-based Generalizable Neural Radiance Fields",
    "abstract": " Comments: Accepted to ICCV 2023. Project website: this https URL ",
    "url": "https://arxiv.org/abs/2308.04826",
    "authors": [
      "Muyu Xu",
      "Fangneng Zhan",
      "Jiahui Zhang",
      "Yingchen Yu",
      "Xiaoqin Zhang",
      "Christian Theobalt",
      "Ling Shao",
      "Shijian Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.09275",
    "title": "Stochastic Opinion Dynamics under Social Pressure in Arbitrary Networks",
    "abstract": " Comments: fixed typos ",
    "url": "https://arxiv.org/abs/2308.09275",
    "authors": [
      "Jennifer Tang",
      "Aviv Adler",
      "Amir Ajorlou",
      "Ali Jadbabaie"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Social and Information Networks (cs.SI)",
      "Dynamical Systems (math.DS)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2309.01270",
    "title": "COMEDIAN: Self-Supervised Learning and Knowledge Distillation for Action  Spotting using Transformers",
    "abstract": " Comments: Source code is available here: this https URL ",
    "url": "https://arxiv.org/abs/2309.01270",
    "authors": [
      "Julien Denize",
      "Mykola Liashuha",
      "Jaonary Rabarisoa",
      "Astrid Orcesi",
      "Romain Hérault"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.01522",
    "title": "What are Public Concerns about ChatGPT? A Novel Self-Supervised Neural  Topic Model Tells You",
    "abstract": " Comments: The paper requires major revision ",
    "url": "https://arxiv.org/abs/2309.01522",
    "authors": [
      "Rui Wang",
      "Xing Liu",
      "Yanan Wang",
      "Haiping Huang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2309.03004",
    "title": "A Theoretical Explanation of Activation Sparsity through Flat Minima and  Adversarial Robustness",
    "abstract": " Title: A Theoretical Explanation of Activation Sparsity through Flat Minima and  Adversarial Robustness ",
    "url": "https://arxiv.org/abs/2309.03004",
    "authors": [
      "Ze Peng",
      "Lei Qi",
      "Yinghuan Shi",
      "Yang Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.05035",
    "title": "Duplicate Question Retrieval and Confirmation Time Prediction in  Software Communities",
    "abstract": " Comments: Full paper accepted at ASONAM 2023: The 2023 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining ",
    "url": "https://arxiv.org/abs/2309.05035",
    "authors": [
      "Rima Hazra",
      "Debanjan Saha",
      "Amruit Sahoo",
      "Somnath Banerjee",
      "Animesh Mukherjee"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Software Engineering (cs.SE)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2309.06118",
    "title": "CHITNet: A Complementary to Harmonious Information Transfer Network for  Infrared and Visible Image Fusion",
    "abstract": " Title: CHITNet: A Complementary to Harmonious Information Transfer Network for  Infrared and Visible Image Fusion ",
    "url": "https://arxiv.org/abs/2309.06118",
    "authors": [
      "Yafei Zhang",
      "Keying Du",
      "Huafeng Li",
      "Zhengtao Yu",
      "Yu Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.01080",
    "title": "Rel2Graph: Automated Mapping From Relational Databases to a Unified  Property Knowledge Graph",
    "abstract": " Title: Rel2Graph: Automated Mapping From Relational Databases to a Unified  Property Knowledge Graph ",
    "url": "https://arxiv.org/abs/2310.01080",
    "authors": [
      "Ziyu Zhao",
      "Wei Liu",
      "Tim French",
      "Michael Stewart"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2310.08896",
    "title": "Migrant Resettlement by Evolutionary Multi-objective Optimization",
    "abstract": " Title: Migrant Resettlement by Evolutionary Multi-objective Optimization ",
    "url": "https://arxiv.org/abs/2310.08896",
    "authors": [
      "Dan-Xuan Liu",
      "Yu-Ran Gu",
      "Chao Qian",
      "Xin Mu",
      "Ke Tang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2310.12350",
    "title": "Equipping Federated Graph Neural Networks with Structure-aware Group  Fairness",
    "abstract": " Title: Equipping Federated Graph Neural Networks with Structure-aware Group  Fairness ",
    "url": "https://arxiv.org/abs/2310.12350",
    "authors": [
      "Nan Cui",
      "Xiuling Wang",
      "Wendy Hui Wang",
      "Violet Chen",
      "Yue Ning"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.12914",
    "title": "Network-Aware AutoML Framework for Software-Defined Sensor Networks",
    "abstract": " Title: Network-Aware AutoML Framework for Software-Defined Sensor Networks ",
    "url": "https://arxiv.org/abs/2310.12914",
    "authors": [
      "Emre Horsanali",
      "Yagmur Yigit",
      "Gokhan Secinti",
      "Aytac Karameseoglu",
      "Berk Canberk"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2310.12924",
    "title": "Digital Twin-Enabled Intelligent DDoS Detection Mechanism for Autonomous  Core Networks",
    "abstract": " Title: Digital Twin-Enabled Intelligent DDoS Detection Mechanism for Autonomous  Core Networks ",
    "url": "https://arxiv.org/abs/2310.12924",
    "authors": [
      "Yagmur Yigit",
      "Bahadir Bal",
      "Aytac Karameseoglu",
      "Trung Q. Duong",
      "Berk Canberk"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2310.13923",
    "title": "Diversified Outlier Exposure for Out-of-Distribution Detection via  Informative Extrapolation",
    "abstract": " Comments: accepted by NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2310.13923",
    "authors": [
      "Jianing Zhu",
      "Geng Yu",
      "Jiangchao Yao",
      "Tongliang Liu",
      "Gang Niu",
      "Masashi Sugiyama",
      "Bo Han"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.14814",
    "title": "Leveraging Ensemble Diversity for Robust Self-Training in the Presence  of Sample Selection Bias",
    "abstract": " Title: Leveraging Ensemble Diversity for Robust Self-Training in the Presence  of Sample Selection Bias ",
    "url": "https://arxiv.org/abs/2310.14814",
    "authors": [
      "Ambroise Odonnat",
      "Vasilii Feofanov",
      "Ievgen Redko"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.15581",
    "title": "Deep ReLU neural networks overcome the curse of dimensionality when  approximating semilinear partial integro-differential equations",
    "abstract": " Title: Deep ReLU neural networks overcome the curse of dimensionality when  approximating semilinear partial integro-differential equations ",
    "url": "https://arxiv.org/abs/2310.15581",
    "authors": [
      "Ariel Neufeld",
      "Tuan Anh Nguyen",
      "Sizhou Wu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Analysis of PDEs (math.AP)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2310.15712",
    "title": "GNeSF: Generalizable Neural Semantic Fields",
    "abstract": " Comments: NeurIPS 2023 ",
    "url": "https://arxiv.org/abs/2310.15712",
    "authors": [
      "Hanlin Chen",
      "Chen Li",
      "Mengqi Guo",
      "Zhiwen Yan",
      "Gim Hee Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.15890",
    "title": "Cross-feature Contrastive Loss for Decentralized Deep Learning on  Heterogeneous Data",
    "abstract": " Comments: 12 pages, 7 figures, 11 tables. arXiv admin note: text overlap with arXiv:2305.04792 ",
    "url": "https://arxiv.org/abs/2310.15890",
    "authors": [
      "Sai Aparna Aketi",
      "Kaushik Roy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.16020",
    "title": "ConvBKI: Real-Time Probabilistic Semantic Mapping Network with  Quantifiable Uncertainty",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2209.10663 ",
    "url": "https://arxiv.org/abs/2310.16020",
    "authors": [
      "Joey Wilson",
      "Yuewei Fu",
      "Joshua Friesen",
      "Parker Ewen",
      "Andrew Capodieci",
      "Paramsothy Jayakumar",
      "Kira Barton",
      "Maani Ghaffari"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.16190",
    "title": "Multilayer Environment and Toolchain for Holistic NetwOrk Design and  Analysis",
    "abstract": " Title: Multilayer Environment and Toolchain for Holistic NetwOrk Design and  Analysis ",
    "url": "https://arxiv.org/abs/2310.16190",
    "authors": [
      "Filip Rezabek",
      "Kilian Glas",
      "Richard von Seck",
      "Achraf Aroua",
      "Tizian Leonhardt",
      "Georg Carle"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Cryptography and Security (cs.CR)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2310.16350",
    "title": "Unraveling Feature Extraction Mechanisms in Neural Networks",
    "abstract": " Comments: Accepted by EMNLP 2023 ",
    "url": "https://arxiv.org/abs/2310.16350",
    "authors": [
      "Xiaobing Sun",
      "Jiaxi Li",
      "Wei Lu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.16605",
    "title": "Distributionally Robust Unsupervised Dense Retrieval Training on Web  Graphs",
    "abstract": " Comments: 9 pages, 5 figures, 5 tables ",
    "url": "https://arxiv.org/abs/2310.16605",
    "authors": [
      "Peixuan Han",
      "Zhenghao Liu",
      "Zhiyuan Liu",
      "Chenyan Xiong"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2310.16638",
    "title": "Robust Covariate Shift Adaptation for Density-Ratio Estimation",
    "abstract": " Title: Robust Covariate Shift Adaptation for Density-Ratio Estimation ",
    "url": "https://arxiv.org/abs/2310.16638",
    "authors": [
      "Masahiro Kato"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Econometrics (econ.EM)",
      "Machine Learning (stat.ML)"
    ]
  }
]