[
  {
    "id": "arXiv:2403.06993",
    "title": "Automatic driving lane change safety prediction model based on LSTM",
    "abstract": "Autonomous driving technology can improve traffic safety and reduce traffic accidents. In addition, it improves traffic flow, reduces congestion, saves energy and increases travel efficiency. In the relatively mature automatic driving technology, the automatic driving function is divided into several modules: perception, decision-making, planning and control, and a reasonable division of labor can improve the stability of the system. Therefore, autonomous vehicles need to have the ability to predict the trajectory of surrounding vehicles in order to make reasonable decision planning and safety measures to improve driving safety. By using deep learning method, a safety-sensitive deep learning model based on short term memory (LSTM) network is proposed. This model can alleviate the shortcomings of current automatic driving trajectory planning, and the output trajectory not only ensures high accuracy but also improves safety. The cell state simulation algorithm simulates the trackability of the trajectory generated by this model. The research results show that compared with the traditional model-based method, the trajectory prediction method based on LSTM network has obvious advantages in predicting the trajectory in the long time domain. The intention recognition module considering interactive information has higher prediction and accuracy, and the algorithm results show that the trajectory is very smooth based on the premise of safe prediction and efficient lane change. And autonomous vehicles can efficiently and safely complete lane changes. ",
    "url": "https://arxiv.org/abs/2403.06993",
    "authors": [
      "Wenjian Sun",
      "Linying Pan",
      "Jingyu Xu",
      "Weixiang Wan",
      "Yong Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.07022",
    "title": "A Unified Model for Spatio-Temporal Prediction Queries with Arbitrary  Modifiable Areal Units",
    "abstract": "Spatio-Temporal (ST) prediction is crucial for making informed decisions in urban location-based applications like ride-sharing. However, existing ST models often require region partition as a prerequisite, resulting in two main pitfalls. Firstly, location-based services necessitate ad-hoc regions for various purposes, requiring multiple ST models with varying scales and zones, which can be costly to support. Secondly, different ST models may produce conflicting outputs, resulting in confusing predictions. In this paper, we propose One4All-ST, a framework that can conduct ST prediction for arbitrary modifiable areal units using only one model. To reduce the cost of getting multi-scale predictions, we design an ST network with hierarchical spatial modeling and scale normalization modules to efficiently and equally learn multi-scale representations. To address prediction inconsistencies across scales, we propose a dynamic programming scheme to solve the formulated optimal combination problem, minimizing predicted error through theoretical analysis. Besides, we suggest using an extended quad-tree to index the optimal combinations for quick response to arbitrary modifiable areal units in practical online scenarios. Extensive experiments on two real-world datasets verify the efficiency and effectiveness of One4All-ST in ST prediction for arbitrary modifiable areal units. The source codes and data of this work are available at https://github.com/uctb/One4All-ST. ",
    "url": "https://arxiv.org/abs/2403.07022",
    "authors": [
      "Liyue Chen",
      "Jiangyi Fang",
      "Tengfei Liu",
      "Shaosheng Cao",
      "Leye Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.07027",
    "title": "FWin transformer for dengue prediction under climate and ocean influence",
    "abstract": "Dengue fever is one of the most deadly mosquito-born tropical infectious diseases. Detailed long range forecast model is vital in controlling the spread of disease and making mitigation efforts. In this study, we examine methods used to forecast dengue cases for long range predictions. The dataset consists of local climate/weather in addition to global climate indicators of Singapore from 2000 to 2019. We utilize newly developed deep neural networks to learn the intricate relationship between the features. The baseline models in this study are in the class of recent transformers for long sequence forecasting tasks. We found that a Fourier mixed window attention (FWin) based transformer performed the best in terms of both the mean square error and the maximum absolute error on the long range dengue forecast up to 60 weeks. ",
    "url": "https://arxiv.org/abs/2403.07027",
    "authors": [
      "Nhat Thanh Tran",
      "Jack Xin",
      "Guofa Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07029",
    "title": "A Model for Assessing Network Asset Vulnerability Using QPSO-LightGBM",
    "abstract": "With the continuous development of computer technology and network technology, the scale of the network continues to expand, the network space tends to be complex, and the application of computers and networks has been deeply into politics, the military, finance, electricity, and other important fields. When security events do not occur, the vulnerability assessment of these high-risk network assets can be actively carried out to prepare for rainy days, to effectively reduce the loss caused by security events. Therefore, this paper proposes a multi-classification prediction model of network asset vulnerability based on quantum particle swarm algorithm-Lightweight Gradient Elevator (QPSO-LightGBM). In this model, based on using the Synthetic minority oversampling technique (SMOTE) to balance the data, quantum particle swarm optimization (QPSO) was used for automatic parameter optimization, and LightGBM was used for modeling. Realize multi-classification prediction of network asset vulnerability. To verify the rationality of the model, the proposed model is compared with the model constructed by other algorithms. The results show that the proposed model is better in various predictive performance indexes. ",
    "url": "https://arxiv.org/abs/2403.07029",
    "authors": [
      "Xinyu Li",
      "Yu Gu",
      "Chenwei Wang",
      "Peng Zhao"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.07035",
    "title": "Multiple Population Alternate Evolution Neural Architecture Search",
    "abstract": "The effectiveness of Evolutionary Neural Architecture Search (ENAS) is influenced by the design of the search space. Nevertheless, common methods including the global search space, scalable search space and hierarchical search space have certain limitations. Specifically, the global search space requires a significant amount of computational resources and time, the scalable search space sacrifices the diversity of network structures and the hierarchical search space increases the search cost in exchange for network diversity. To address above limitation, we propose a novel paradigm of searching neural network architectures and design the Multiple Population Alternate Evolution Neural Architecture Search (MPAE), which can achieve module diversity with a smaller search cost. MPAE converts the search space into L interconnected units and sequentially searches the units, then the above search of the entire network be cycled several times to reduce the impact of previous units on subsequent units. To accelerate the population evolution process, we also propose the the population migration mechanism establishes an excellent migration archive and transfers the excellent knowledge and experience in the migration archive to new populations. The proposed method requires only 0.3 GPU days to search a neural network on the CIFAR dataset and achieves the state-of-the-art results. ",
    "url": "https://arxiv.org/abs/2403.07035",
    "authors": [
      "Juan Zou",
      "Han Chu",
      "Yizhang Xia",
      "Junwen Xu",
      "Yuan Liu",
      "Zhanglu Hou"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07038",
    "title": "Leveraging graph neural networks for supporting Automatic Triage of  Patients",
    "abstract": "Patient triage plays a crucial role in emergency departments, ensuring timely and appropriate care based on correctly evaluating the emergency grade of patient conditions. Triage methods are generally performed by human operator based on her own experience and information that are gathered from the patient management process. Thus, it is a process that can generate errors in emergency level associations. Recently, Traditional triage methods heavily rely on human decisions, which can be subjective and prone to errors. Recently, a growing interest has been focused on leveraging artificial intelligence (AI) to develop algorithms able to maximize information gathering and minimize errors in patient triage processing. We define and implement an AI based module to manage patients emergency code assignments in emergency departments. It uses emergency department historical data to train the medical decision process. Data containing relevant patient information, such as vital signs, symptoms, and medical history, are used to accurately classify patients into triage categories. Experimental results demonstrate that the proposed algorithm achieved high accuracy outperforming traditional triage methods. By using the proposed method we claim that healthcare professionals can predict severity index to guide patient management processing and resource allocation. ",
    "url": "https://arxiv.org/abs/2403.07038",
    "authors": [
      "Annamaria Defilippo",
      "Pierangelo Veltri",
      "Pietro Lio'",
      "Pietro Hiram Guzzi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07040",
    "title": "All in One: Multi-Task Prompting for Graph Neural Networks (Extended  Abstract)",
    "abstract": "This paper is an extended abstract of our original work published in KDD23, where we won the best research paper award (Xiangguo Sun, Hong Cheng, Jia Li, Bo Liu, and Jihong Guan. All in one: Multi-task prompting for graph neural networks. KDD 23) The paper introduces a novel approach to bridging the gap between pre-trained graph models and the diverse tasks they're applied to, inspired by the success of prompt learning in NLP. Recognizing the challenge of aligning pre-trained models with varied graph tasks (node level, edge level, and graph level), which can lead to negative transfer and poor performance, we propose a multi-task prompting method for graphs. This method involves unifying graph and language prompt formats, enabling NLP's prompting strategies to be adapted for graph tasks. By analyzing the task space of graph applications, we reformulate problems to fit graph-level tasks and apply meta-learning to improve prompt initialization for multiple tasks. Experiments show our method's effectiveness in enhancing model performance across different graph tasks. Beyond the original work, in this extended abstract, we further discuss the graph prompt from a bigger picture and provide some of the latest work toward this area. ",
    "url": "https://arxiv.org/abs/2403.07040",
    "authors": [
      "Xiangguo Sun",
      "Hong Cheng",
      "Jia Li",
      "Bo Liu",
      "Jihong Guan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.07071",
    "title": "LISO: Lidar-only Self-Supervised 3D Object Detection",
    "abstract": "3D object detection is one of the most important components in any Self-Driving stack, but current state-of-the-art (SOTA) lidar object detectors require costly & slow manual annotation of 3D bounding boxes to perform well. Recently, several methods emerged to generate pseudo ground truth without human supervision, however, all of these methods have various drawbacks: Some methods require sensor rigs with full camera coverage and accurate calibration, partly supplemented by an auxiliary optical flow engine. Others require expensive high-precision localization to find objects that disappeared over multiple drives. We introduce a novel self-supervised method to train SOTA lidar object detection networks which works on unlabeled sequences of lidar point clouds only, which we call trajectory-regularized self-training. It utilizes a SOTA self-supervised lidar scene flow network under the hood to generate, track, and iteratively refine pseudo ground truth. We demonstrate the effectiveness of our approach for multiple SOTA object detection networks across multiple real-world datasets. Code will be released. ",
    "url": "https://arxiv.org/abs/2403.07071",
    "authors": [
      "Stefan Baur",
      "Frank Moosmann",
      "Andreas Geiger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07078",
    "title": "Improving deep learning with prior knowledge and cognitive models: A  survey on enhancing explainability, adversarial robustness and zero-shot  learning",
    "abstract": "We review current and emerging knowledge-informed and brain-inspired cognitive systems for realizing adversarial defenses, eXplainable Artificial Intelligence (XAI), and zero-shot or few-short learning. Data-driven deep learning models have achieved remarkable performance and demonstrated capabilities surpassing human experts in many applications. Yet, their inability to exploit domain knowledge leads to serious performance limitations in practical applications. In particular, deep learning systems are exposed to adversarial attacks, which can trick them into making glaringly incorrect decisions. Moreover, complex data-driven models typically lack interpretability or explainability, i.e., their decisions cannot be understood by human subjects. Furthermore, models are usually trained on standard datasets with a closed-world assumption. Hence, they struggle to generalize to unseen cases during inference in practical open-world environments, thus, raising the zero- or few-shot generalization problem. Although many conventional solutions exist, explicit domain knowledge, brain-inspired neural network and cognitive architectures offer powerful new dimensions towards alleviating these problems. Prior knowledge is represented in appropriate forms and incorporated in deep learning frameworks to improve performance. Brain-inspired cognition methods use computational models that mimic the human mind to enhance intelligent behavior in artificial agents and autonomous robots. Ultimately, these models achieve better explainability, higher adversarial robustness and data-efficient learning, and can, in turn, provide insights for cognitive science and neuroscience-that is, to deepen human understanding on how the brain works in general, and how it handles these problems. ",
    "url": "https://arxiv.org/abs/2403.07078",
    "authors": [
      "Fuseinin Mumuni",
      "Alhassan Mumuni"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07090",
    "title": "Time Series Analysis of Key Societal Events as Reflected in Complex  Social Media Data Streams",
    "abstract": "Social media platforms hold valuable insights, yet extracting essential information can be challenging. Traditional top-down approaches often struggle to capture critical signals in rapidly changing events. As global events evolve swiftly, social media narratives, including instances of disinformation, become significant sources of insights. To address the need for an inductive strategy, we explore a niche social media platform GAB and an established messaging service Telegram, to develop methodologies applicable on a broader scale. This study investigates narrative evolution on these platforms using quantitative corpus-based discourse analysis techniques. Our approach is a novel mode to study multiple social media domains to distil key information which may be obscured otherwise, allowing for useful and actionable insights. The paper details the technical and methodological aspects of gathering and preprocessing GAB and Telegram data for a keyness (Log Ratio) metric analysis, identifying crucial nouns and verbs for deeper exploration. Empirically, this approach is applied to a case study of a well defined event that had global impact: the 2023 Wagner mutiny. The main findings are: (1) the time line can be deconstructed to provide useful data features allowing for improved interpretation; (2) a methodology is applied which provides a basis for generalization. The key contribution is an approach, that in some cases, provides the ability to capture the dynamic narrative shifts over time with elevated confidence. The approach can augment near-real-time assessment of key social movements, allowing for informed governance choices. This research is important because it lays out a useful methodology for time series relevant info-culling, which can enable proactive modes for positive social engagement. ",
    "url": "https://arxiv.org/abs/2403.07090",
    "authors": [
      "Andy Skumanich",
      "Han Kyul Kim"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.07094",
    "title": "FALCON: FLOP-Aware Combinatorial Optimization for Neural Network Pruning",
    "abstract": "The increasing computational demands of modern neural networks present deployment challenges on resource-constrained devices. Network pruning offers a solution to reduce model size and computational cost while maintaining performance. However, most current pruning methods focus primarily on improving sparsity by reducing the number of nonzero parameters, often neglecting other deployment costs such as inference time, which are closely related to the number of floating-point operations (FLOPs). In this paper, we propose FALCON, a novel combinatorial-optimization-based framework for network pruning that jointly takes into account model accuracy (fidelity), FLOPs, and sparsity constraints. A main building block of our approach is an integer linear program (ILP) that simultaneously handles FLOP and sparsity constraints. We present a novel algorithm to approximately solve the ILP. We propose a novel first-order method for our optimization framework which makes use of our ILP solver. Using problem structure (e.g., the low-rank structure of approx. Hessian), we can address instances with millions of parameters. Our experiments demonstrate that FALCON achieves superior accuracy compared to other pruning approaches within a fixed FLOP budget. For instance, for ResNet50 with 20% of the total FLOPs retained, our approach improves the accuracy by 48% relative to state-of-the-art. Furthermore, in gradual pruning settings with re-training between pruning steps, our framework outperforms existing pruning methods, emphasizing the significance of incorporating both FLOP and sparsity constraints for effective network pruning. ",
    "url": "https://arxiv.org/abs/2403.07094",
    "authors": [
      "Xiang Meng",
      "Wenyu Chen",
      "Riade Benbaki",
      "Rahul Mazumder"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07099",
    "title": "Rate-independent continuous inhibitory chemical reaction networks are  Turing-universal",
    "abstract": "We study the model of continuous chemical reaction networks (CRNs), consisting of reactions such as $A+B \\to C+D$ that can transform some continuous, nonnegative real-valued quantity (called a *concentration*) of chemical species $A$ and $B$ into equal concentrations of $C$ and $D$. Such a reaction can occur from any state in which both reactants $A$ and $B$ are present, i.e., have positive concentration. We modify the model to allow *inhibitors*, for instance, reaction $A+B \\to^{I} C+D$ can occur only if the reactants $A$ and $B$ are present and the inhibitor $I$ is absent. The computational power of non-inhibitory CRNs has been studied. For instance, the reaction $X_1+X_2 \\to Y$ can be thought to compute the function $f(x_1,x_2) = \\min(x_1,x_2)$. Under an \"adversarial\" model in which reaction rates can vary arbitrarily over time, it was found that exactly the continuous, piecewise linear functions can be computed, ruling out even simple functions such as $f(x) = x^2$. In contrast, in this paper we show that inhibitory CRNs can compute any computable function $f:\\mathbb{N}\\to\\mathbb{N}$. ",
    "url": "https://arxiv.org/abs/2403.07099",
    "authors": [
      "Kim Calabrese",
      "David Doty"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2403.07112",
    "title": "Parameterized Task Graph Scheduling Algorithm for Comparing Algorithmic  Components",
    "abstract": "Scheduling distributed applications modeled as directed, acyclic task graphs to run on heterogeneous compute networks is a fundamental (NP-Hard) problem in distributed computing for which many heuristic algorithms have been proposed over the past decades. Many of these algorithms fall under the list-scheduling paradigm, whereby the algorithm first computes priorities for the tasks and then schedules them greedily to the compute node that minimizes some cost function. Thus, many algorithms differ from each other only in a few key components (e.g., the way they prioritize tasks, their cost functions, where the algorithms consider inserting tasks into a partially complete schedule, etc.). In this paper, we propose a generalized parametric list-scheduling algorithm that allows mixing and matching different algorithmic components to produce 72 unique algorithms. We benchmark these algorithms on four datasets to study the individual and combined effects of different algorithmic components on performance and runtime. ",
    "url": "https://arxiv.org/abs/2403.07112",
    "authors": [
      "Jared Coleman",
      "Ravi Vivek Agrawal",
      "Ebrahim Hirani",
      "Bhaskar Krishnamachari"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2403.07118",
    "title": "Narrating Causal Graphs with Large Language Models",
    "abstract": "The use of generative AI to create text descriptions from graphs has mostly focused on knowledge graphs, which connect concepts using facts. In this work we explore the capability of large pretrained language models to generate text from causal graphs, where salient concepts are represented as nodes and causality is represented via directed, typed edges. The causal reasoning encoded in these graphs can support applications as diverse as healthcare or marketing. Using two publicly available causal graph datasets, we empirically investigate the performance of four GPT-3 models under various settings. Our results indicate that while causal text descriptions improve with training data, compared to fact-based graphs, they are harder to generate under zero-shot settings. Results further suggest that users of generative AI can deploy future applications faster since similar performances are obtained when training a model with only a few examples as compared to fine-tuning via a large curated dataset. ",
    "url": "https://arxiv.org/abs/2403.07118",
    "authors": [
      "Atharva Phatak",
      "Vijay K. Mago",
      "Ameeta Agrawal",
      "Aravind Inbasekaran",
      "Philippe J. Giabbanelli"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.07120",
    "title": "Comparing Task Graph Scheduling Algorithms: An Adversarial Approach",
    "abstract": "Scheduling a task graph representing an application over a heterogeneous network of computers is a fundamental problem in distributed computing. It is known to be not only NP-hard but also not polynomial-time approximable within a constant factor. As a result, many heuristic algorithms have been proposed over the past few decades. Yet it remains largely unclear how these algorithms compare to each other in terms of the quality of schedules they produce. We identify gaps in the traditional benchmarking approach to comparing task scheduling algorithms and propose a simulated annealing-based adversarial analysis approach called PISA to help address them. We also introduce SAGA, a new open-source library for comparing task scheduling algorithms. We use SAGA to benchmark 15 algorithms on 16 datasets and PISA to compare the algorithms in a pairwise manner. Algorithms that appear to perform similarly on benchmarking datasets are shown to perform very differently on adversarially chosen problem instances. Interestingly, the results indicate that this is true even when the adversarial search is constrained to selecting among well-structured, application-specific problem instances. This work represents an important step towards a more general understanding of the performance boundaries between task scheduling algorithms on different families of problem instances. ",
    "url": "https://arxiv.org/abs/2403.07120",
    "authors": [
      "Jared Coleman",
      "Bhaskar Krishnamachari"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2403.07150",
    "title": "Breaking Political Filter Bubbles via Social Comparison",
    "abstract": "Online social platforms allow users to filter out content they do not like. According to selective exposure theory, people tend to view content they agree with more to get more self-assurance. This causes people to live in ideological filter bubbles. We report on a user study that encourages users to break the political filter bubble of their Twitter feed by reading more diverse viewpoints through social comparison. The user study is conducted using political-bias analyzing and Twitter-mirroring tools to compare the political slant of what a user reads and what other Twitter users read about a topic, and in general. The results show that social comparison can have a great impact on users' reading behavior by motivating them to read viewpoints from the opposing political party. ",
    "url": "https://arxiv.org/abs/2403.07150",
    "authors": [
      "Nouran Soliman",
      "Motahhare Eslami",
      "Karrie Karahalios"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.07179",
    "title": "3M-Diffusion: Latent Multi-Modal Diffusion for Text-Guided Generation of  Molecular Graphs",
    "abstract": "Generating molecules with desired properties is a critical task with broad applications in drug discovery and materials design. Inspired by recent advances in large language models, there is a growing interest in using natural language descriptions of molecules to generate molecules with the desired properties. Most existing methods focus on generating molecules that precisely match the text description. However, practical applications call for methods that generate diverse, and ideally novel, molecules with the desired properties. We propose 3M-Diffusion, a novel multi-modal molecular graph generation method, to address this challenge. 3M-Diffusion first encodes molecular graphs into a graph latent space aligned with text descriptions. It then reconstructs the molecular structure and atomic attributes based on the given text descriptions using the molecule decoder. It then learns a probabilistic mapping from the text space to the latent molecular graph space using a diffusion model. The results of our extensive experiments on several datasets demonstrate that 3M-Diffusion can generate high-quality, novel and diverse molecular graphs that semantically match the textual description provided. ",
    "url": "https://arxiv.org/abs/2403.07179",
    "authors": [
      "Huaisheng Zhu",
      "Teng Xiao",
      "Vasant G Honavar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Biomolecules (q-bio.BM)"
    ]
  },
  {
    "id": "arXiv:2403.07185",
    "title": "Uncertainty in Graph Neural Networks: A Survey",
    "abstract": "Graph Neural Networks (GNNs) have been extensively used in various real-world applications. However, the predictive uncertainty of GNNs stemming from diverse sources such as inherent randomness in data and model training errors can lead to unstable and erroneous predictions. Therefore, identifying, quantifying, and utilizing uncertainty are essential to enhance the performance of the model for the downstream tasks as well as the reliability of the GNN predictions. This survey aims to provide a comprehensive overview of the GNNs from the perspective of uncertainty with an emphasis on its integration in graph learning. We compare and summarize existing graph uncertainty theory and methods, alongside the corresponding downstream tasks. Thereby, we bridge the gap between theory and practice, meanwhile connecting different GNN communities. Moreover, our work provides valuable insights into promising directions in this field. ",
    "url": "https://arxiv.org/abs/2403.07185",
    "authors": [
      "Fangxin Wang",
      "Yuqing Liu",
      "Kay Liu",
      "Yibo Wang",
      "Sourav Medya",
      "Philip S. Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.07194",
    "title": "Improving prediction of students' performance in intelligent tutoring  systems using attribute selection and ensembles of different multimodal data  sources",
    "abstract": "The aim of this study was to predict university students' learning performance using different sources of data from an Intelligent Tutoring System. We collected and preprocessed data from 40 students from different multimodal sources: learning strategies from system logs, emotions from face recording videos, interaction zones from eye tracking, and test performance from final knowledge evaluation. Our objective was to test whether the prediction could be improved by using attribute selection and classification ensembles. We carried out three experiments by applying six classification algorithms to numerical and discretized preprocessed multimodal data. The results show that the best predictions were produced using ensembles and selecting the best attributes approach with numerical data. ",
    "url": "https://arxiv.org/abs/2403.07194",
    "authors": [
      "W. Chango",
      "R. Cerezo",
      "M. Sanchez-Santillan",
      "R. Azevedo",
      "C. Romero"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07201",
    "title": "A multi-cohort study on prediction of acute brain dysfunction states  using selective state space models",
    "abstract": "Assessing acute brain dysfunction (ABD), including delirium and coma in the intensive care unit (ICU), is a critical challenge due to its prevalence and severe implications for patient outcomes. Current diagnostic methods rely on infrequent clinical observations, which can only determine a patient's ABD status after onset. Our research attempts to solve these problems by harnessing Electronic Health Records (EHR) data to develop automated methods for ABD prediction for patients in the ICU. Existing models solely predict a single state (e.g., either delirium or coma), require at least 24 hours of observation data to make predictions, do not dynamically predict fluctuating ABD conditions during ICU stay (typically a one-time prediction), and use small sample size, proprietary single-hospital datasets. Our research fills these gaps in the existing literature by dynamically predicting delirium, coma, and mortality for 12-hour intervals throughout an ICU stay and validating on two public datasets. Our research also introduces the concept of dynamically predicting critical transitions from non-ABD to ABD and between different ABD states in real time, which could be clinically more informative for the hospital staff. We compared the predictive performance of two state-of-the-art neural network models, the MAMBA selective state space model and the Longformer Transformer model. Using the MAMBA model, we achieved a mean area under the receiving operator characteristic curve (AUROC) of 0.95 on outcome prediction of ABD for 12-hour intervals. The model achieves a mean AUROC of 0.79 when predicting transitions between ABD states. Our study uses a curated dataset from the University of Florida Health Shands Hospital for internal validation and two publicly available datasets, MIMIC-IV and eICU, for external validation, demonstrating robustness across ICU stays from 203 hospitals and 140,945 patients. ",
    "url": "https://arxiv.org/abs/2403.07201",
    "authors": [
      "Brandon Silva",
      "Miguel Contreras",
      "Sabyasachi Bandyopadhyay",
      "Yuanfang Ren",
      "Ziyuan Guan",
      "Jeremy Balch",
      "Kia Khezeli",
      "Tezcan Ozrazgat Baslanti",
      "Ben Shickel",
      "Azra Bihorac",
      "Parisa Rashidi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2403.07209",
    "title": "The entropic doubling constant and robustness of Gaussian codebooks for  additive-noise channels",
    "abstract": "Entropy comparison inequalities are obtained for the differential entropy $h(X+Y)$ of the sum of two independent random vectors $X,Y$, when one is replaced by a Gaussian. For identically distributed random vectors $X,Y$, these are closely related to bounds on the entropic doubling constant, which quantifies the entropy increase when adding an independent copy of a random vector to itself. Consequences of both large and small doubling are explored. For the former, lower bounds are deduced on the entropy increase when adding an independent Gaussian, while for the latter, a qualitative stability result for the entropy power inequality is obtained. In the more general case of non-identically distributed random vectors $X,Y$, a Gaussian comparison inequality with interesting implications for channel coding is established: For additive-noise channels with a power constraint, Gaussian codebooks come within a $\\frac{{\\sf snr}}{3{\\sf snr}+2}$ factor of capacity. In the low-SNR regime this improves the half-a-bit additive bound of Zamir and Erez (2004). Analogous results are obtained for additive-noise multiple access channels, and for linear, additive-noise MIMO channels. ",
    "url": "https://arxiv.org/abs/2403.07209",
    "authors": [
      "Lampros Gavalakis",
      "Ioannis Kontoyiannis",
      "Mokshay Madiman"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2403.07218",
    "title": "SoK: Can Trajectory Generation Combine Privacy and Utility?",
    "abstract": "While location trajectories represent a valuable data source for analyses and location-based services, they can reveal sensitive information, such as political and religious preferences. Differentially private publication mechanisms have been proposed to allow for analyses under rigorous privacy guarantees. However, the traditional protection schemes suffer from a limiting privacy-utility trade-off and are vulnerable to correlation and reconstruction attacks. Synthetic trajectory data generation and release represent a promising alternative to protection algorithms. While initial proposals achieve remarkable utility, they fail to provide rigorous privacy guarantees. This paper proposes a framework for designing a privacy-preserving trajectory publication approach by defining five design goals, particularly stressing the importance of choosing an appropriate Unit of Privacy. Based on this framework, we briefly discuss the existing trajectory protection approaches, emphasising their shortcomings. This work focuses on the systematisation of the state-of-the-art generative models for trajectories in the context of the proposed framework. We find that no existing solution satisfies all requirements. Thus, we perform an experimental study evaluating the applicability of six sequential generative models to the trajectory domain. Finally, we conclude that a generative trajectory model providing semantic guarantees remains an open research question and propose concrete next steps for future research. ",
    "url": "https://arxiv.org/abs/2403.07218",
    "authors": [
      "Erik Buchholz",
      "Alsharif Abuadbba",
      "Shuo Wang",
      "Surya Nepal",
      "Salil S. Kanhere"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07232",
    "title": "Tractable Joint Prediction and Planning over Discrete Behavior Modes for  Urban Driving",
    "abstract": "Significant progress has been made in training multimodal trajectory forecasting models for autonomous driving. However, effectively integrating these models with downstream planners and model-based control approaches is still an open problem. Although these models have conventionally been evaluated for open-loop prediction, we show that they can be used to parameterize autoregressive closed-loop models without retraining. We consider recent trajectory prediction approaches which leverage learned anchor embeddings to predict multiple trajectories, finding that these anchor embeddings can parameterize discrete and distinct modes representing high-level driving behaviors. We propose to perform fully reactive closed-loop planning over these discrete latent modes, allowing us to tractably model the causal interactions between agents at each step. We validate our approach on a suite of more dynamic merging scenarios, finding that our approach avoids the $\\textit{frozen robot problem}$ which is pervasive in conventional planners. Our approach also outperforms the previous state-of-the-art in CARLA on challenging dense traffic scenarios when evaluated at realistic speeds. ",
    "url": "https://arxiv.org/abs/2403.07232",
    "authors": [
      "Adam Villaflor",
      "Brian Yang",
      "Huangyuan Su",
      "Katerina Fragkiadaki",
      "John Dolan",
      "Jeff Schneider"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07238",
    "title": "Towards Full Automation of Geometry Extraction for Biomechanical  Analysis of Abdominal Aortic Aneurysm; Neural Network-Based versus Classical  Methodologies",
    "abstract": "In this study we investigated the impact of image segmentation methods on the results of stress computation in the wall of abdominal aortic aneurysms (AAAs). We compared wall stress distributions and magnitudes calculated from geometry models obtained from classical semi-automated segmentation versus automated neural network-based segmentation. Ten different AAA contrast-enhanced computed tomography (CT) images were semi-automatically segmented by an analyst, taking, depending on the quality of an image, between 15 and 40 minutes of human effort per patient. The same images were automatically segmented using PRAEVAorta 2, commercial software by NUREA (https://www.nurea-soft.com/), developed based on artificial intelligence (AI) algorithms, requiring only 1-2 minutes of computer time per patient. Aneurysm wall stress calculations performed using the BioPARR software (https://bioparr.mech.uwa.edu.au/) revealed that, compared to the classical semi-automated segmentation, the automatic neural network-based segmentation leads to equivalent stress distributions, and slightly higher peak and 99th percentile maximum principal stress values. This difference is due to consistently larger lumen surface areas in automatically segmented models as compared to classical semi-automated segmentations, resulting in greater total pressure load on the wall. Our findings are a steppingstone toward a fully automated pipeline for biomechanical analysis of AAAs, starting with CT scans and concluding with wall stress assessment, while at the same time highlighting the critical importance of the repeatable and accurate segmentation of the lumen, the difficult problem often underestimated by the literature. ",
    "url": "https://arxiv.org/abs/2403.07238",
    "authors": [
      "Farah Alkhatib",
      "Mostafa Jamshidian",
      "Donatien Le Liepvre",
      "Florian Bernard",
      "Ludovic Minvielle",
      "Adam Wittek",
      "Karol Miller"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2403.07241",
    "title": "Calibrating Multi-modal Representations: A Pursuit of Group Robustness  without Annotations",
    "abstract": "Fine-tuning pre-trained vision-language models, like CLIP, has yielded success on diverse downstream tasks. However, several pain points persist for this paradigm: (i) directly tuning entire pre-trained models becomes both time-intensive and computationally costly. Additionally, these tuned models tend to become highly specialized, limiting their practicality for real-world deployment; (ii) recent studies indicate that pre-trained vision-language classifiers may overly depend on spurious features -- patterns that correlate with the target in training data, but are not related to the true labeling function; and (iii) existing studies on mitigating the reliance on spurious features, largely based on the assumption that we can identify such features, does not provide definitive assurance for real-world applications. As a piloting study, this work focuses on exploring mitigating the reliance on spurious features for CLIP without using any group annotation. To this end, we systematically study the existence of spurious correlation on CLIP and CILP+ERM. We first, following recent work on Deep Feature Reweighting (DFR), verify that last-layer retraining can greatly improve group robustness on pretrained CLIP. In view of them, we advocate a lightweight representation calibration method for fine-tuning CLIP, by first generating a calibration set using the pretrained CLIP, and then calibrating representations of samples within this set through contrastive learning, all without the need for group labels. Extensive experiments and in-depth visualizations on several benchmarks validate the effectiveness of our proposals, largely reducing reliance and significantly boosting the model generalization. ",
    "url": "https://arxiv.org/abs/2403.07241",
    "authors": [
      "Chenyu You",
      "Yifei Min",
      "Weicheng Dai",
      "Jasjeet S. Sekhon",
      "Lawrence Staib",
      "James S. Duncan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07246",
    "title": "Towards Zero-shot Human-Object Interaction Detection via Vision-Language  Integration",
    "abstract": "Human-object interaction (HOI) detection aims to locate human-object pairs and identify their interaction categories in images. Most existing methods primarily focus on supervised learning, which relies on extensive manual HOI annotations. In this paper, we propose a novel framework, termed Knowledge Integration to HOI (KI2HOI), that effectively integrates the knowledge of visual-language model to improve zero-shot HOI detection. Specifically, the verb feature learning module is designed based on visual semantics, by employing the verb extraction decoder to convert corresponding verb queries into interaction-specific category representations. We develop an effective additive self-attention mechanism to generate more comprehensive visual representations. Moreover, the innovative interaction representation decoder effectively extracts informative regions by integrating spatial and visual feature information through a cross-attention mechanism. To deal with zero-shot learning in low-data, we leverage a priori knowledge from the CLIP text encoder to initialize the linear classifier for enhanced interaction understanding. Extensive experiments conducted on the mainstream HICO-DET and V-COCO datasets demonstrate that our model outperforms the previous methods in various zero-shot and full-supervised settings. ",
    "url": "https://arxiv.org/abs/2403.07246",
    "authors": [
      "Weiying Xue",
      "Qi Liu",
      "Qiwei Xiong",
      "Yuxiao Wang",
      "Zhenao Wei",
      "Xiaofen Xing",
      "Xiangmin Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07249",
    "title": "Toward An Analytic Theory of Intrinsic Robustness for Dexterous Grasping",
    "abstract": "Conventional approaches to grasp planning require perfect knowledge of an object's pose and geometry. Uncertainties in these quantities induce uncertainties in the quality of planned grasps, which can lead to failure. Classically, grasp robustness refers to the ability to resist external disturbances after grasping an object. In contrast, this work studies robustness to intrinsic sources of uncertainty like object pose or geometry affecting grasp planning before execution. To do so, we develop a novel analytic theory of grasping that reasons about this intrinsic robustness by characterizing the effect of friction cone uncertainty on a grasp's force closure status. As a result, we show the Ferrari-Canny metric -- which measures the size of external disturbances a grasp can reject -- bounds the friction cone uncertainty a grasp can tolerate, and thus also measures intrinsic robustness. In tandem, we show that the recently proposed min-weight metric lower bounds the Ferrari-Canny metric, justifying it as a computationally-efficient, uncertainty-aware alternative. We validate this theory on hardware experiments versus a competitive baseline and demonstrate superior performance. Finally, we use our theory to develop an analytic notion of probabilistic force closure, which we show in simulation generates grasps that can incorporate uncertainty distributions over an object's geometry. ",
    "url": "https://arxiv.org/abs/2403.07249",
    "authors": [
      "Albert H. Li",
      "Preston Culbertson",
      "Aaron D. Ames"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.07261",
    "title": "Disentangling Policy from Offline Task Representation Learning via  Adversarial Data Augmentation",
    "abstract": "Offline meta-reinforcement learning (OMRL) proficiently allows an agent to tackle novel tasks while solely relying on a static dataset. For precise and efficient task identification, existing OMRL research suggests learning separate task representations that be incorporated with policy input, thus forming a context-based meta-policy. A major approach to train task representations is to adopt contrastive learning using multi-task offline data. The dataset typically encompasses interactions from various policies (i.e., the behavior policies), thus providing a plethora of contextual information regarding different tasks. Nonetheless, amassing data from a substantial number of policies is not only impractical but also often unattainable in realistic settings. Instead, we resort to a more constrained yet practical scenario, where multi-task data collection occurs with a limited number of policies. We observed that learned task representations from previous OMRL methods tend to correlate spuriously with the behavior policy instead of reflecting the essential characteristics of the task, resulting in unfavorable out-of-distribution generalization. To alleviate this issue, we introduce a novel algorithm to disentangle the impact of behavior policy from task representation learning through a process called adversarial data augmentation. Specifically, the objective of adversarial data augmentation is not merely to generate data analogous to offline data distribution; instead, it aims to create adversarial examples designed to confound learned task representations and lead to incorrect task identification. Our experiments show that learning from such adversarial samples significantly enhances the robustness and effectiveness of the task identification process and realizes satisfactory out-of-distribution generalization. ",
    "url": "https://arxiv.org/abs/2403.07261",
    "authors": [
      "Chengxing Jia",
      "Fuxiang Zhang",
      "Yi-Chen Li",
      "Chen-Xiao Gao",
      "Xu-Hui Liu",
      "Lei Yuan",
      "Zongzhang Zhang",
      "Yang Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.07263",
    "title": "Adaptive Bounding Box Uncertainties via Two-Step Conformal Prediction",
    "abstract": "Quantifying a model's predictive uncertainty is essential for safety-critical applications such as autonomous driving. We consider quantifying such uncertainty for multi-object detection. In particular, we leverage conformal prediction to obtain uncertainty intervals with guaranteed coverage for object bounding boxes. One challenge in doing so is that bounding box predictions are conditioned on the object's class label. Thus, we develop a novel two-step conformal approach that propagates uncertainty in predicted class labels into the uncertainty intervals for the bounding boxes. This broadens the validity of our conformal coverage guarantees to include incorrectly classified objects, ensuring their usefulness when maximal safety assurances are required. Moreover, we investigate novel ensemble and quantile regression formulations to ensure the bounding box intervals are adaptive to object size, leading to a more balanced coverage across sizes. Validating our two-step approach on real-world datasets for 2D bounding box localization, we find that desired coverage levels are satisfied with actionably tight predictive uncertainty intervals. ",
    "url": "https://arxiv.org/abs/2403.07263",
    "authors": [
      "Alexander Timans",
      "Christoph-Nikolas Straehle",
      "Kaspar Sakmann",
      "Eric Nalisnick"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.07265",
    "title": "Self-supervised Contrastive Learning for Implicit Collaborative  Filtering",
    "abstract": "Contrastive learning-based recommendation algorithms have significantly advanced the field of self-supervised recommendation, particularly with BPR as a representative ranking prediction task that dominates implicit collaborative filtering. However, the presence of false-positive and false-negative examples in recommendation systems hampers accurate preference learning. In this study, we propose a simple self-supervised contrastive learning framework that leverages positive feature augmentation and negative label augmentation to improve the self-supervisory signal. Theoretical analysis demonstrates that our learning method is equivalent to maximizing the likelihood estimation with latent variables representing user interest centers. Additionally, we establish an efficient negative label augmentation technique that samples unlabeled examples with a probability linearly dependent on their relative ranking positions, enabling efficient augmentation in constant time complexity. Through validation on multiple datasets, we illustrate the significant improvements our method achieves over the widely used BPR optimization objective while maintaining comparable runtime. ",
    "url": "https://arxiv.org/abs/2403.07265",
    "authors": [
      "Shipeng Song",
      "Bin Liu",
      "Fei Teng",
      "Tianrui Li"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2403.07277",
    "title": "A Bayesian Approach to OOD Robustness in Image Classification",
    "abstract": "An important and unsolved problem in computer vision is to ensure that the algorithms are robust to changes in image domains. We address this problem in the scenario where we have access to images from the target domains but no annotations. Motivated by the challenges of the OOD-CV benchmark where we encounter real world Out-of-Domain (OOD) nuisances and occlusion, we introduce a novel Bayesian approach to OOD robustness for object classification. Our work extends Compositional Neural Networks (CompNets), which have been shown to be robust to occlusion but degrade badly when tested on OOD data. We exploit the fact that CompNets contain a generative head defined over feature vectors represented by von Mises-Fisher (vMF) kernels, which correspond roughly to object parts, and can be learned without supervision. We obverse that some vMF kernels are similar between different domains, while others are not. This enables us to learn a transitional dictionary of vMF kernels that are intermediate between the source and target domains and train the generative model on this dictionary using the annotations on the source domain, followed by iterative refinement. This approach, termed Unsupervised Generative Transition (UGT), performs very well in OOD scenarios even when occlusion is present. UGT is evaluated on different OOD benchmarks including the OOD-CV dataset, several popular datasets (e.g., ImageNet-C [9]), artificial image corruptions (including adding occluders), and synthetic-to-real domain transfer, and does well in all scenarios outperforming SOTA alternatives (e.g. up to 10% top-1 accuracy on Occluded OOD-CV dataset). ",
    "url": "https://arxiv.org/abs/2403.07277",
    "authors": [
      "Prakhar Kaushik",
      "Adam Kortylewski",
      "Alan Yuille"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.07284",
    "title": "SparseLIF: High-Performance Sparse LiDAR-Camera Fusion for 3D Object  Detection",
    "abstract": "Sparse 3D detectors have received significant attention since the query-based paradigm embraces low latency without explicit dense BEV feature construction. However, these detectors achieve worse performance than their dense counterparts. In this paper, we find the key to bridging the performance gap is to enhance the awareness of rich representations in two modalities. Here, we present a high-performance fully sparse detector for end-to-end multi-modality 3D object detection. The detector, termed SparseLIF, contains three key designs, which are (1) Perspective-Aware Query Generation (PAQG) to generate high-quality 3D queries with perspective priors, (2) RoI-Aware Sampling (RIAS) to further refine prior queries by sampling RoI features from each modality, (3) Uncertainty-Aware Fusion (UAF) to precisely quantify the uncertainty of each sensor modality and adaptively conduct final multi-modality fusion, thus achieving great robustness against sensor noises. By the time of submission (2024/03/08), SparseLIF achieves state-of-the-art performance on the nuScenes dataset, ranking 1st on both validation set and test benchmark, outperforming all state-of-the-art 3D object detectors by a notable margin. The source code will be released upon acceptance. ",
    "url": "https://arxiv.org/abs/2403.07284",
    "authors": [
      "Hongcheng Zhang",
      "Liu Liang",
      "Pengxin Zeng",
      "Xiao Song",
      "Zhe Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07286",
    "title": "MENTOR: Multilingual tExt detectioN TOward leaRning by analogy",
    "abstract": "Text detection is frequently used in vision-based mobile robots when they need to interpret texts in their surroundings to perform a given task. For instance, delivery robots in multilingual cities need to be capable of doing multilingual text detection so that the robots can read traffic signs and road markings. Moreover, the target languages change from region to region, implying the need of efficiently re-training the models to recognize the novel/new languages. However, collecting and labeling training data for novel languages are cumbersome, and the efforts to re-train an existing/trained text detector are considerable. Even worse, such a routine would repeat whenever a novel language appears. This motivates us to propose a new problem setting for tackling the aforementioned challenges in a more efficient way: \"We ask for a generalizable multilingual text detection framework to detect and identify both seen and unseen language regions inside scene images without the requirement of collecting supervised training data for unseen languages as well as model re-training\". To this end, we propose \"MENTOR\", the first work to realize a learning strategy between zero-shot learning and few-shot learning for multilingual scene text detection. ",
    "url": "https://arxiv.org/abs/2403.07286",
    "authors": [
      "Hsin-Ju Lin",
      "Tsu-Chun Chung",
      "Ching-Chun Hsiao",
      "Pin-Yu Chen",
      "Wei-Chen Chiu",
      "Ching-Chun Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07292",
    "title": "Continual All-in-One Adverse Weather Removal with Knowledge Replay on a  Unified Network Structure",
    "abstract": "In real-world applications, image degeneration caused by adverse weather is always complex and changes with different weather conditions from days and seasons. Systems in real-world environments constantly encounter adverse weather conditions that are not previously observed. Therefore, it practically requires adverse weather removal models to continually learn from incrementally collected data reflecting various degeneration types. Existing adverse weather removal approaches, for either single or multiple adverse weathers, are mainly designed for a static learning paradigm, which assumes that the data of all types of degenerations to handle can be finely collected at one time before a single-phase learning process. They thus cannot directly handle the incremental learning requirements. To address this issue, we made the earliest effort to investigate the continual all-in-one adverse weather removal task, in a setting closer to real-world applications. Specifically, we develop a novel continual learning framework with effective knowledge replay (KR) on a unified network structure. Equipped with a principal component projection and an effective knowledge distillation mechanism, the proposed KR techniques are tailored for the all-in-one weather removal task. It considers the characteristics of the image restoration task with multiple degenerations in continual learning, and the knowledge for different degenerations can be shared and accumulated in the unified network structure. Extensive experimental results demonstrate the effectiveness of the proposed method to deal with this challenging task, which performs competitively to existing dedicated or joint training image restoration methods. Our code is available at https://github.com/xiaojihh/CL_all-in-one. ",
    "url": "https://arxiv.org/abs/2403.07292",
    "authors": [
      "De Cheng",
      "Yanling Ji",
      "Dong Gong",
      "Yan Li",
      "Nannan Wang",
      "Junwei Han",
      "Dingwen Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.07294",
    "title": "Graph Data Condensation via Self-expressive Graph Structure  Reconstruction",
    "abstract": "With the increasing demands of training graph neural networks (GNNs) on large-scale graphs, graph data condensation has emerged as a critical technique to relieve the storage and time costs during the training phase. It aims to condense the original large-scale graph to a much smaller synthetic graph while preserving the essential information necessary for efficiently training a downstream GNN. However, existing methods concentrate either on optimizing node features exclusively or endeavor to independently learn node features and the graph structure generator. They could not explicitly leverage the information of the original graph structure and failed to construct an interpretable graph structure for the synthetic dataset. To address these issues, we introduce a novel framework named \\textbf{G}raph Data \\textbf{C}ondensation via \\textbf{S}elf-expressive Graph Structure \\textbf{R}econstruction (\\textbf{GCSR}). Our method stands out by (1) explicitly incorporating the original graph structure into the condensing process and (2) capturing the nuanced interdependencies between the condensed nodes by reconstructing an interpretable self-expressive graph structure. Extensive experiments and comprehensive analysis validate the efficacy of the proposed method across diverse GNN models and datasets. Our code is available at https://www.dropbox.com/scl/fi/2aonyp5ln5gisdqtjimu8/GCSR.zip?rlkey=11cuwfpsf54wxiiktu0klud0x&dl=0 ",
    "url": "https://arxiv.org/abs/2403.07294",
    "authors": [
      "Zhanyu Liu",
      "Chaolv Zeng",
      "Guanjie Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.07308",
    "title": "Verification-Aided Learning of Neural Network Barrier Functions with  Termination Guarantees",
    "abstract": "Barrier functions are a general framework for establishing a safety guarantee for a system. However, there is no general method for finding these functions. To address this shortcoming, recent approaches use self-supervised learning techniques to learn these functions using training data that are periodically generated by a verification procedure, leading to a verification-aided learning framework. Despite its immense potential in automating barrier function synthesis, the verification-aided learning framework does not have termination guarantees and may suffer from a low success rate of finding a valid barrier function in practice. In this paper, we propose a holistic approach to address these drawbacks. With a convex formulation of the barrier function synthesis, we propose to first learn an empirically well-behaved NN basis function and then apply a fine-tuning algorithm that exploits the convexity and counterexamples from the verification failure to find a valid barrier function with finite-step termination guarantees: if there exist valid barrier functions, the fine-tuning algorithm is guaranteed to find one in a finite number of iterations. We demonstrate that our fine-tuning method can significantly boost the performance of the verification-aided learning framework on examples of different scales and using various neural network verifiers. ",
    "url": "https://arxiv.org/abs/2403.07308",
    "authors": [
      "Shaoru Chen",
      "Lekan Molu",
      "Mahyar Fazlyab"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.07311",
    "title": "Knowledge Graph Large Language Model (KG-LLM) for Link Prediction",
    "abstract": "The task of predicting multiple links within knowledge graphs (KGs) stands as a challenge in the field of knowledge graph analysis, a challenge increasingly resolvable due to advancements in natural language processing (NLP) and KG embedding techniques. This paper introduces a novel methodology, the Knowledge Graph Large Language Model Framework (KG-LLM), which leverages pivotal NLP paradigms, including chain-of-thought (CoT) prompting and in-context learning (ICL), to enhance multi-hop link prediction in KGs. By converting the KG to a CoT prompt, our framework is designed to discern and learn the latent representations of entities and their interrelations. To show the efficacy of the KG-LLM Framework, we fine-tune three leading Large Language Models (LLMs) within this framework, employing both non-ICL and ICL tasks for a comprehensive evaluation. Further, we explore the framework's potential to provide LLMs with zero-shot capabilities for handling previously unseen prompts. Our experimental findings discover that integrating ICL and CoT not only augments the performance of our approach but also significantly boosts the models' generalization capacity, thereby ensuring more precise predictions in unfamiliar scenarios. ",
    "url": "https://arxiv.org/abs/2403.07311",
    "authors": [
      "Dong Shu",
      "Tianle Chen",
      "Mingyu Jin",
      "Yiting Zhang",
      "Mengnan Du",
      "Yongfeng Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07320",
    "title": "Approaching Rate-Distortion Limits in Neural Compression with Lattice  Transform Coding",
    "abstract": "Neural compression has brought tremendous progress in designing lossy compressors with good rate-distortion (RD) performance at low complexity. Thus far, neural compression design involves transforming the source to a latent vector, which is then rounded to integers and entropy coded. While this approach has been shown to be optimal in a one-shot sense on certain sources, we show that it is highly sub-optimal on i.i.d. sequences, and in fact always recovers scalar quantization of the original source sequence. We demonstrate that the sub-optimality is due to the choice of quantization scheme in the latent space, and not the transform design. By employing lattice quantization instead of scalar quantization in the latent space, we demonstrate that Lattice Transform Coding (LTC) is able to recover optimal vector quantization at various dimensions and approach the asymptotically-achievable rate-distortion function at reasonable complexity. On general vector sources, LTC improves upon standard neural compressors in one-shot coding performance. LTC also enables neural compressors that perform block coding on i.i.d. vector sources, which yields coding gain over optimal one-shot coding. ",
    "url": "https://arxiv.org/abs/2403.07320",
    "authors": [
      "Eric Lei",
      "Hamed Hassani",
      "Shirin Saeedi Bidokhti"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2403.07321",
    "title": "GPT-generated Text Detection: Benchmark Dataset and Tensor-based  Detection Method",
    "abstract": "As natural language models like ChatGPT become increasingly prevalent in applications and services, the need for robust and accurate methods to detect their output is of paramount importance. In this paper, we present GPT Reddit Dataset (GRiD), a novel Generative Pretrained Transformer (GPT)-generated text detection dataset designed to assess the performance of detection models in identifying generated responses from ChatGPT. The dataset consists of a diverse collection of context-prompt pairs based on Reddit, with human-generated and ChatGPT-generated responses. We provide an analysis of the dataset's characteristics, including linguistic diversity, context complexity, and response quality. To showcase the dataset's utility, we benchmark several detection methods on it, demonstrating their efficacy in distinguishing between human and ChatGPT-generated responses. This dataset serves as a resource for evaluating and advancing detection techniques in the context of ChatGPT and contributes to the ongoing efforts to ensure responsible and trustworthy AI-driven communication on the internet. Finally, we propose GpTen, a novel tensor-based GPT text detection method that is semi-supervised in nature since it only has access to human-generated text and performs on par with fully-supervised baselines. ",
    "url": "https://arxiv.org/abs/2403.07321",
    "authors": [
      "Zubair Qazi",
      "William Shiao",
      "Evangelos E. Papalexakis"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.07326",
    "title": "SGE: Structured Light System Based on Gray Code with an Event Camera",
    "abstract": "Fast and accurate depth sensing has long been a significant research challenge. Event camera, as a device that quickly responds to intensity changes, provides a new solution for structured light (SL) systems. In this paper, we introduce Gray code into event-based SL systems for the first time. Our setup includes an event camera and Digital Light Processing (DLP) projector, enabling depth estimation through high-speed projection and decoding of Gray code patterns. By employing spatio-temporal encoding for point matching, our method is immune to timestamp noise, realizing high-speed depth estimation without loss of accuracy. The binary nature of events and Gray code minimizes data redundancy, enabling us to fully utilize sensor bandwidth at 100%. Experimental results show that our approach achieves accuracy comparable to state-of-the-art scanning methods while surpassing them in data acquisition speed (up to 41 times improvement) without sacrificing accuracy. Our proposed approach offers a highly promising solution for ultra-fast, real-time, and high-precision dense depth estimation. Code and dataset will be publicly available. ",
    "url": "https://arxiv.org/abs/2403.07326",
    "authors": [
      "Xingyu Lu",
      "Lei Sun",
      "Diyang Gu",
      "Zhijie Xu",
      "Kaiwei Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07331",
    "title": "LIST: Learning to Index Spatio-Textual Data for Embedding based Spatial  Keyword Queries",
    "abstract": "With the proliferation of spatio-textual data, Top-k KNN spatial keyword queries (TkQs), which return a list of objects based on a ranking function that evaluates both spatial and textual relevance, have found many real-life applications. Existing geo-textual indexes for TkQs use traditional retrieval models like BM25 to compute text relevance and usually exploit a simple linear function to compute spatial relevance, but its effectiveness is limited. To improve effectiveness, several deep learning models have recently been proposed, but they suffer severe efficiency issues. To the best of our knowledge, there are no efficient indexes specifically designed to accelerate the top-k search process for these deep learning models. To tackle these issues, we propose a novel technique, which Learns to Index the Spatio-Textual data for answering embedding based spatial keyword queries (called LIST). LIST is featured with two novel components. Firstly, we propose a lightweight and effective relevance model that is capable of learning both textual and spatial relevance. Secondly, we introduce a novel machine learning based Approximate Nearest Neighbor Search (ANNS) index, which utilizes a new learning-to-cluster technique to group relevant queries and objects together while separating irrelevant queries and objects. Two key challenges in building an effective and efficient index are the absence of high-quality labels and unbalanced clustering results. We develop a novel pseudo-label generation technique to address the two challenges. Experimental results show that LIST significantly outperforms state-of-the-art methods on effectiveness, with improvements up to 19.21% and 12.79% in terms of NDCG@1 and Recall@10, and is three orders of magnitude faster than the most effective baseline. ",
    "url": "https://arxiv.org/abs/2403.07331",
    "authors": [
      "Ziqi Yin",
      "Shanshan Feng",
      "Shang Liu",
      "Gao Cong",
      "Yew Soon Ong",
      "Bin Cui"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2403.07353",
    "title": "Graph Unlearning with Efficient Partial Retraining",
    "abstract": "Graph Neural Networks (GNNs) have achieved remarkable success in various real-world applications. However, GNNs may be trained on undesirable graph data, which can degrade their performance and reliability. To enable trained GNNs to efficiently unlearn unwanted data, a desirable solution is retraining-based graph unlearning, which partitions the training graph into subgraphs and trains sub-models on them, allowing fast unlearning through partial retraining. However, the graph partition process causes information loss in the training graph, resulting in the low model utility of sub-GNN models. In this paper, we propose GraphRevoker, a novel graph unlearning framework that better maintains the model utility of unlearnable GNNs. Specifically, we preserve the graph property with graph property-aware sharding and effectively aggregate the sub-GNN models for prediction with graph contrastive sub-model aggregation. We conduct extensive experiments to demonstrate the superiority of our proposed approach. ",
    "url": "https://arxiv.org/abs/2403.07353",
    "authors": [
      "Jiahao Zhang",
      "Lin Wang",
      "Shijie Wang",
      "Wenqi Fan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.07372",
    "title": "Eliminating Cross-modal Conflicts in BEV Space for LiDAR-Camera 3D  Object Detection",
    "abstract": "Recent 3D object detectors typically utilize multi-sensor data and unify multi-modal features in the shared bird's-eye view (BEV) representation space. However, our empirical findings indicate that previous methods have limitations in generating fusion BEV features free from cross-modal conflicts. These conflicts encompass extrinsic conflicts caused by BEV feature construction and inherent conflicts stemming from heterogeneous sensor signals. Therefore, we propose a novel Eliminating Conflicts Fusion (ECFusion) method to explicitly eliminate the extrinsic/inherent conflicts in BEV space and produce improved multi-modal BEV features. Specifically, we devise a Semantic-guided Flow-based Alignment (SFA) module to resolve extrinsic conflicts via unifying spatial distribution in BEV space before fusion. Moreover, we design a Dissolved Query Recovering (DQR) mechanism to remedy inherent conflicts by preserving objectness clues that are lost in the fusion BEV feature. In general, our method maximizes the effective information utilization of each modality and leverages inter-modal complementarity. Our method achieves state-of-the-art performance in the highly competitive nuScenes 3D object detection dataset. The code is released at https://github.com/fjhzhixi/ECFusion. ",
    "url": "https://arxiv.org/abs/2403.07372",
    "authors": [
      "Jiahui Fu",
      "Chen Gao",
      "Zitian Wang",
      "Lirong Yang",
      "Xiaofei Wang",
      "Beipeng Mu",
      "Si Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07379",
    "title": "Hallmarks of Optimization Trajectories in Neural Networks and LLMs: The  Lengths, Bends, and Dead Ends",
    "abstract": "We propose a fresh take on understanding the mechanisms of neural networks by analyzing the rich structure of parameters contained within their optimization trajectories. Towards this end, we introduce some natural notions of the complexity of optimization trajectories, both qualitative and quantitative, which reveal the inherent nuance and interplay involved between various optimization choices, such as momentum, weight decay, and batch size. We use them to provide key hallmarks about the nature of optimization in deep neural networks: when it goes right, and when it finds itself in a dead end. Further, thanks to our trajectory perspective, we uncover an intertwined behaviour of momentum and weight decay that promotes directional exploration, as well as a directional regularization behaviour of some others. We perform experiments over large-scale vision and language settings, including large language models (LLMs) with up to 12 billion parameters, to demonstrate the value of our approach. ",
    "url": "https://arxiv.org/abs/2403.07379",
    "authors": [
      "Sidak Pal Singh",
      "Bobby He",
      "Thomas Hofmann",
      "Bernhard Schölkopf"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2403.07392",
    "title": "ViT-CoMer: Vision Transformer with Convolutional Multi-scale Feature  Interaction for Dense Predictions",
    "abstract": "Although Vision Transformer (ViT) has achieved significant success in computer vision, it does not perform well in dense prediction tasks due to the lack of inner-patch information interaction and the limited diversity of feature scale. Most existing studies are devoted to designing vision-specific transformers to solve the above problems, which introduce additional pre-training costs. Therefore, we present a plain, pre-training-free, and feature-enhanced ViT backbone with Convolutional Multi-scale feature interaction, named ViT-CoMer, which facilitates bidirectional interaction between CNN and transformer. Compared to the state-of-the-art, ViT-CoMer has the following advantages: (1) We inject spatial pyramid multi-receptive field convolutional features into the ViT architecture, which effectively alleviates the problems of limited local information interaction and single-feature representation in ViT. (2) We propose a simple and efficient CNN-Transformer bidirectional fusion interaction module that performs multi-scale fusion across hierarchical features, which is beneficial for handling dense prediction tasks. (3) We evaluate the performance of ViT-CoMer across various dense prediction tasks, different frameworks, and multiple advanced pre-training. Notably, our ViT-CoMer-L achieves 64.3% AP on COCO val2017 without extra training data, and 62.1% mIoU on ADE20K val, both of which are comparable to state-of-the-art methods. We hope ViT-CoMer can serve as a new backbone for dense prediction tasks to facilitate future research. The code will be released at https://github.com/Traffic-X/ViT-CoMer. ",
    "url": "https://arxiv.org/abs/2403.07392",
    "authors": [
      "Chunlong Xia",
      "Xinliang Wang",
      "Feng Lv",
      "Xin Hao",
      "Yifeng Shi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07398",
    "title": "Complex Reasoning over Logical Queries on Commonsense Knowledge Graphs",
    "abstract": "Event commonsense reasoning requires the ability to reason about the relationship between events, as well as infer implicit context underlying that relationship. However, data scarcity makes it challenging for language models to learn to generate commonsense inferences for contexts and questions involving interactions between complex events. To address this demand, we present COM2 (COMplex COMmonsense), a new dataset created by sampling multi-hop logical queries (e.g., the joint effect or cause of both event A and B, or the effect of the effect of event C) from an existing commonsense knowledge graph (CSKG), and verbalizing them using handcrafted rules and large language models into multiple-choice and text generation questions. Our experiments show that language models trained on COM2 exhibit significant improvements in complex reasoning ability, resulting in enhanced zero-shot performance in both in-domain and out-of-domain tasks for question answering and generative commonsense reasoning, without expensive human annotations. ",
    "url": "https://arxiv.org/abs/2403.07398",
    "authors": [
      "Tianqing Fang",
      "Zeming Chen",
      "Yangqiu Song",
      "Antoine Bosselut"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.07404",
    "title": "Accelerated Inference and Reduced Forgetting: The Dual Benefits of  Early-Exit Networks in Continual Learning",
    "abstract": "Driven by the demand for energy-efficient employment of deep neural networks, early-exit methods have experienced a notable increase in research attention. These strategies allow for swift predictions by making decisions early in the network, thereby conserving computation time and resources. However, so far the early-exit networks have only been developed for stationary data distributions, which restricts their application in real-world scenarios with continuous non-stationary data. This study aims to explore the continual learning of the early-exit networks. We adapt existing continual learning methods to fit with early-exit architectures and investigate their behavior in the continual setting. We notice that early network layers exhibit reduced forgetting and can outperform standard networks even when using significantly fewer resources. Furthermore, we analyze the impact of task-recency bias on early-exit inference and propose Task-wise Logits Correction (TLC), a simple method that equalizes this bias and improves the network performance for every given compute budget in the class-incremental setting. We assess the accuracy and computational cost of various continual learning techniques enhanced with early-exits and TLC across standard class-incremental learning benchmarks such as 10 split CIFAR100 and ImageNetSubset and show that TLC can achieve the accuracy of the standard methods using less than 70\\% of their computations. Moreover, at full computational budget, our method outperforms the accuracy of the standard counterparts by up to 15 percentage points. Our research underscores the inherent synergy between early-exit networks and continual learning, emphasizing their practical utility in resource-constrained environments. ",
    "url": "https://arxiv.org/abs/2403.07404",
    "authors": [
      "Filip Szatkowski",
      "Fei Yang",
      "Bartłomiej Twardowski",
      "Tomasz Trzciński",
      "Joost van de Weijer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.07420",
    "title": "DragAnything: Motion Control for Anything using Entity Representation",
    "abstract": "We introduce DragAnything, which utilizes a entity representation to achieve motion control for any object in controllable video generation. Comparison to existing motion control methods, DragAnything offers several advantages. Firstly, trajectory-based is more userfriendly for interaction, when acquiring other guidance signals (e.g., masks, depth maps) is labor-intensive. Users only need to draw a line (trajectory) during interaction. Secondly, our entity representation serves as an open-domain embedding capable of representing any object, enabling the control of motion for diverse entities, including background. Lastly, our entity representation allows simultaneous and distinct motion control for multiple objects. Extensive experiments demonstrate that our DragAnything achieves state-of-the-art performance for FVD, FID, and User Study, particularly in terms of object motion control, where our method surpasses the previous methods (e.g., DragNUWA) by 26% in human voting. ",
    "url": "https://arxiv.org/abs/2403.07420",
    "authors": [
      "Weijia Wu",
      "Zhuang Li",
      "Yuchao Gu",
      "Rui Zhao",
      "Yefei He",
      "David Junhao Zhang",
      "Mike Zheng Shou",
      "Yan Li",
      "Tingting Gao",
      "Di Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07436",
    "title": "JSTR: Joint Spatio-Temporal Reasoning for Event-based Moving Object  Detection",
    "abstract": "Event-based moving object detection is a challenging task, where static background and moving object are mixed together. Typically, existing methods mainly align the background events to the same spatial coordinate system via motion compensation to distinguish the moving object. However, they neglect the potential spatial tailing effect of moving object events caused by excessive motion, which may affect the structure integrity of the extracted moving object. We discover that the moving object has a complete columnar structure in the point cloud composed of motion-compensated events along the timestamp. Motivated by this, we propose a novel joint spatio-temporal reasoning method for event-based moving object detection. Specifically, we first compensate the motion of background events using inertial measurement unit. In spatial reasoning stage, we project the compensated events into the same image coordinate, discretize the timestamp of events to obtain a time image that can reflect the motion confidence, and further segment the moving object through adaptive threshold on the time image. In temporal reasoning stage, we construct the events into a point cloud along timestamp, and use RANSAC algorithm to extract the columnar shape in the cloud for peeling off the background. Finally, we fuse the results from the two reasoning stages to extract the final moving object region. This joint spatio-temporal reasoning framework can effectively detect the moving object from motion confidence and geometric structure. Moreover, we conduct extensive experiments on various datasets to verify that the proposed method can improve the moving object detection accuracy by 13\\%. ",
    "url": "https://arxiv.org/abs/2403.07436",
    "authors": [
      "Hanyu Zhou",
      "Zhiwei Shi",
      "Hao Dong",
      "Shihan Peng",
      "Yi Chang",
      "Luxin Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07463",
    "title": "Backdoor Attack with Mode Mixture Latent Modification",
    "abstract": "Backdoor attacks become a significant security concern for deep neural networks in recent years. An image classification model can be compromised if malicious backdoors are injected into it. This corruption will cause the model to function normally on clean images but predict a specific target label when triggers are present. Previous research can be categorized into two genres: poisoning a portion of the dataset with triggered images for users to train the model from scratch, or training a backdoored model alongside a triggered image generator. Both approaches require significant amount of attackable parameters for optimization to establish a connection between the trigger and the target label, which may raise suspicions as more people become aware of the existence of backdoor attacks. In this paper, we propose a backdoor attack paradigm that only requires minimal alterations (specifically, the output layer) to a clean model in order to inject the backdoor under the guise of fine-tuning. To achieve this, we leverage mode mixture samples, which are located between different modes in latent space, and introduce a novel method for conducting backdoor attacks. We evaluate the effectiveness of our method on four popular benchmark datasets: MNIST, CIFAR-10, GTSRB, and TinyImageNet. ",
    "url": "https://arxiv.org/abs/2403.07463",
    "authors": [
      "Hongwei Zhang",
      "Xiaoyin Xu",
      "Dongsheng An",
      "Xianfeng Gu",
      "Min Zhang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07478",
    "title": "Towards Graph Foundation Models for Personalization",
    "abstract": "In the realm of personalization, integrating diverse information sources such as consumption signals and content-based representations is becoming increasingly critical to build state-of-the-art solutions. In this regard, two of the biggest trends in research around this subject are Graph Neural Networks (GNNs) and Foundation Models (FMs). While GNNs emerged as a popular solution in industry for powering personalization at scale, FMs have only recently caught attention for their promising performance in personalization tasks like ranking and retrieval. In this paper, we present a graph-based foundation modeling approach tailored to personalization. Central to this approach is a Heterogeneous GNN (HGNN) designed to capture multi-hop content and consumption relationships across a range of recommendable item types. To ensure the generality required from a Foundation Model, we employ a Large Language Model (LLM) text-based featurization of nodes that accommodates all item types, and construct the graph using co-interaction signals, which inherently transcend content specificity. To facilitate practical generalization, we further couple the HGNN with an adaptation mechanism based on a two-tower (2T) architecture, which also operates agnostically to content type. This multi-stage approach ensures high scalability; while the HGNN produces general purpose embeddings, the 2T component models in a continuous space the sheer size of user-item interaction data. Our comprehensive approach has been rigorously tested and proven effective in delivering recommendations across a diverse array of products within a real-world, industrial audio streaming platform. ",
    "url": "https://arxiv.org/abs/2403.07478",
    "authors": [
      "Andreas Damianou",
      "Francesco Fabbri",
      "Paul Gigioli",
      "Marco De Nadai",
      "Alice Wang",
      "Enrico Palumbo",
      "Mounia Lalmas"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07481",
    "title": "Generalised Graph Grammars for Natural Language Processing",
    "abstract": "This seminal paper proposes a new query language for graph matching and rewriting overcoming {the declarative} limitation of Cypher while outperforming {Neo4j} on graph matching and rewriting by at least one order of magnitude. We exploited columnar databases (KnoBAB) to represent graphs using the Generalised Semistructured Model. ",
    "url": "https://arxiv.org/abs/2403.07481",
    "authors": [
      "Oliver Robert Fox",
      "Giacomo Bergami"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2403.07506",
    "title": "Robustness, Security, Privacy, Explainability, Efficiency, and Usability  of Large Language Models for Code",
    "abstract": "Large language models for code (LLM4Code), which demonstrate strong performance (e.g., high accuracy) in processing source code, have significantly transformed software engineering. Many studies separately investigate the non-functional properties of LM4Code, but there is no systematic review of how these properties are evaluated and enhanced. This paper fills this gap by thoroughly examining 146 relevant studies, thereby presenting the first systematic literature review to identify seven important properties beyond accuracy, including robustness, security, privacy, explainability, efficiency, and usability. We discuss the current state-of-the-art methods and trends, identify gaps in existing research, and present promising directions for future study. ",
    "url": "https://arxiv.org/abs/2403.07506",
    "authors": [
      "Zhou Yang",
      "Zhensu Sun",
      "Terry Zhuo Yue",
      "Premkumar Devanbu",
      "David Lo"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.07513",
    "title": "Spatiotemporal Representation Learning for Short and Long Medical Image  Time Series",
    "abstract": "Analyzing temporal developments is crucial for the accurate prognosis of many medical conditions. Temporal changes that occur over short time scales are key to assessing the health of physiological functions, such as the cardiac cycle. Moreover, tracking longer term developments that occur over months or years in evolving processes, such as age-related macular degeneration (AMD), is essential for accurate prognosis. Despite the importance of both short and long term analysis to clinical decision making, they remain understudied in medical deep learning. State of the art methods for spatiotemporal representation learning, developed for short natural videos, prioritize the detection of temporal constants rather than temporal developments. Moreover, they do not account for varying time intervals between acquisitions, which are essential for contextualizing observed changes. To address these issues, we propose two approaches. First, we combine clip-level contrastive learning with a novel temporal embedding to adapt to irregular time series. Second, we propose masking and predicting latent frame representations of the temporal sequence. Our two approaches outperform all prior methods on temporally-dependent tasks including cardiac output estimation and three prognostic AMD tasks. Overall, this enables the automated analysis of temporal patterns which are typically overlooked in applications of deep learning to medicine. ",
    "url": "https://arxiv.org/abs/2403.07513",
    "authors": [
      "Chengzhi Shen",
      "Martin J. Menten",
      "Hrvoje Bogunović",
      "Ursula Schmidt-Erfurth",
      "Hendrik Scholl",
      "Sobha Sivaprasad",
      "Andrew Lotery",
      "Daniel Rueckert",
      "Paul Hager",
      "Robbie Holland"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07524",
    "title": "Shining Light on Periodic Dominating Sets in Bounded-Treewidth Graphs",
    "abstract": "For the vertex selection problem $(\\sigma,\\rho)$-DomSet one is given two fixed sets $\\sigma$ and $\\rho$ of integers and the task is to decide whether we can select vertices of the input graph, such that, for every selected vertex, the number of selected neighbors is in $\\sigma$ and, for every unselected vertex, the number of selected neighbors is in $\\rho$. This framework covers Independent Set and Dominating Set for example. We investigate the case when $\\sigma$ and $\\rho$ are periodic sets with the same period $m\\ge 2$, that is, the sets are two (potentially different) residue classes modulo $m$. We study the problem parameterized by treewidth and present an algorithm that solves in time $m^{tw} \\cdot n^{O(1)}$ the decision, minimization and maximization version of the problem. This significantly improves upon the known algorithms where for the case $m \\ge 3$ not even an explicit running time is known. We complement our algorithm by providing matching lower bounds which state that there is no $(m-\\epsilon)^{pw} \\cdot n^{O(1)}$ unless SETH fails. For $m = 2$, we extend these bound to the minimization version as the decision version is efficiently solvable. ",
    "url": "https://arxiv.org/abs/2403.07524",
    "authors": [
      "Jakob Greilhuber",
      "Philipp Schepper",
      "Philip Wellnitz"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2403.07557",
    "title": "SIFiD: Reassess Summary Factual Inconsistency Detection with LLM",
    "abstract": "Ensuring factual consistency between the summary and the original document is paramount in summarization tasks. Consequently, considerable effort has been dedicated to detecting inconsistencies. With the advent of Large Language Models (LLMs), recent studies have begun to leverage their advanced language understanding capabilities for inconsistency detection. However, early attempts have shown that LLMs underperform traditional models due to their limited ability to follow instructions and the absence of an effective detection methodology. In this study, we reassess summary inconsistency detection with LLMs, comparing the performances of GPT-3.5 and GPT-4. To advance research in LLM-based inconsistency detection, we propose SIFiD (Summary Inconsistency Detection with Filtered Document) that identify key sentences within documents by either employing natural language inference or measuring semantic similarity between summaries and documents. ",
    "url": "https://arxiv.org/abs/2403.07557",
    "authors": [
      "Jiuding Yang",
      "Hui Liu",
      "Weidong Guo",
      "Zhuwei Rao",
      "Yu Xu",
      "Di Niu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07560",
    "title": "Unleashing Network Potentials for Semantic Scene Completion",
    "abstract": "Semantic scene completion (SSC) aims to predict complete 3D voxel occupancy and semantics from a single-view RGB-D image, and recent SSC methods commonly adopt multi-modal inputs. However, our investigation reveals two limitations: ineffective feature learning from single modalities and overfitting to limited datasets. To address these issues, this paper proposes a novel SSC framework - Adversarial Modality Modulation Network (AMMNet) - with a fresh perspective of optimizing gradient updates. The proposed AMMNet introduces two core modules: a cross-modal modulation enabling the interdependence of gradient flows between modalities, and a customized adversarial training scheme leveraging dynamic gradient competition. Specifically, the cross-modal modulation adaptively re-calibrates the features to better excite representation potentials from each single modality. The adversarial training employs a minimax game of evolving gradients, with customized guidance to strengthen the generator's perception of visual fidelity from both geometric completeness and semantic correctness. Extensive experimental results demonstrate that AMMNet outperforms state-of-the-art SSC methods by a large margin, providing a promising direction for improving the effectiveness and generalization of SSC methods. ",
    "url": "https://arxiv.org/abs/2403.07560",
    "authors": [
      "Fengyun Wang",
      "Qianru Sun",
      "Dong Zhang",
      "Jinhui Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07564",
    "title": "RSBuilding: Towards General Remote Sensing Image Building Extraction and  Change Detection with Foundation Model",
    "abstract": "The intelligent interpretation of buildings plays a significant role in urban planning and management, macroeconomic analysis, population dynamics, etc. Remote sensing image building interpretation primarily encompasses building extraction and change detection. However, current methodologies often treat these two tasks as separate entities, thereby failing to leverage shared knowledge. Moreover, the complexity and diversity of remote sensing image scenes pose additional challenges, as most algorithms are designed to model individual small datasets, thus lacking cross-scene generalization. In this paper, we propose a comprehensive remote sensing image building understanding model, termed RSBuilding, developed from the perspective of the foundation model. RSBuilding is designed to enhance cross-scene generalization and task universality. Specifically, we extract image features based on the prior knowledge of the foundation model and devise a multi-level feature sampler to augment scale information. To unify task representation and integrate image spatiotemporal clues, we introduce a cross-attention decoder with task prompts. Addressing the current shortage of datasets that incorporate annotations for both tasks, we have developed a federated training strategy to facilitate smooth model convergence even when supervision for some tasks is missing, thereby bolstering the complementarity of different tasks. Our model was trained on a dataset comprising up to 245,000 images and validated on multiple building extraction and change detection datasets. The experimental results substantiate that RSBuilding can concurrently handle two structurally distinct tasks and exhibits robust zero-shot generalization capabilities. ",
    "url": "https://arxiv.org/abs/2403.07564",
    "authors": [
      "Mingze Wang",
      "Keyan Chen",
      "Lili Su",
      "Cilin Yan",
      "Sheng Xu",
      "Haotian Zhang",
      "Pengcheng Yuan",
      "Xiaolong Jiang",
      "Baochang Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07573",
    "title": "Towards a Dynamic Future with Adaptable Computing and Network  Convergence (ACNC)",
    "abstract": "In the context of advancing 6G, a substantial paradigm shift is anticipated, highlighting comprehensive everything-to-everything interactions characterized by numerous connections and stringent adherence to Quality of Service/Experience (QoS/E) prerequisites. The imminent challenge stems from resource scarcity, prompting a deliberate transition to Computing-Network Convergence (CNC) as an auspicious approach for joint resource orchestration. While CNC-based mechanisms have garnered attention, their effectiveness in realizing future services, particularly in use cases like the Metaverse, may encounter limitations due to the continually changing nature of users, services, and resources. Hence, this paper presents the concept of Adaptable CNC (ACNC) as an autonomous Machine Learning (ML)-aided mechanism crafted for the joint orchestration of computing and network resources, catering to dynamic and voluminous user requests with stringent requirements. ACNC encompasses two primary functionalities: state recognition and context detection. Given the intricate nature of the user-service-computing-network space, the paper employs dimension reduction to generate live, holistic, abstract system states in a hierarchical structure. To address the challenges posed by dynamic changes, Continual Learning (CL) is employed, classifying the system state into contexts controlled by dedicated ML agents, enabling them to operate efficiently. These two functionalities are intricately linked within a closed loop overseen by the End-to-End (E2E) orchestrator to allocate resources. The paper introduces the components of ACNC, proposes a Metaverse scenario to exemplify ACNC's role in resource provisioning with Segment Routing v6 (SRv6), outlines ACNC's workflow, details a numerical analysis for efficiency assessment, and concludes with discussions on relevant challenges and potential avenues for future research. ",
    "url": "https://arxiv.org/abs/2403.07573",
    "authors": [
      "Masoud Shokrnezhad",
      "Hao Yu",
      "Tarik Taleb",
      "Richard Li",
      "Kyunghan Lee",
      "Jaeseung Song",
      "Cedric Westphal"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07578",
    "title": "AACP: Aesthetics assessment of children's paintings based on  self-supervised learning",
    "abstract": "The Aesthetics Assessment of Children's Paintings (AACP) is an important branch of the image aesthetics assessment (IAA), playing a significant role in children's education. This task presents unique challenges, such as limited available data and the requirement for evaluation metrics from multiple perspectives. However, previous approaches have relied on training large datasets and subsequently providing an aesthetics score to the image, which is not applicable to AACP. To solve this problem, we construct an aesthetics assessment dataset of children's paintings and a model based on self-supervised learning. 1) We build a novel dataset composed of two parts: the first part contains more than 20k unlabeled images of children's paintings; the second part contains 1.2k images of children's paintings, and each image contains eight attributes labeled by multiple design experts. 2) We design a pipeline that includes a feature extraction module, perception modules and a disentangled evaluation module. 3) We conduct both qualitative and quantitative experiments to compare our model's performance with five other methods using the AACP dataset. Our experiments reveal that our method can accurately capture aesthetic features and achieve state-of-the-art performance. ",
    "url": "https://arxiv.org/abs/2403.07578",
    "authors": [
      "Shiqi Jiang",
      "Ning Li",
      "Chen Shi",
      "Liping Guo",
      "Changbo Wang",
      "Chenhui Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07581",
    "title": "LLMvsSmall Model? Large Language Model Based Text Augmentation Enhanced  Personality Detection Model",
    "abstract": "Personality detection aims to detect one's personality traits underlying in social media posts. One challenge of this task is the scarcity of ground-truth personality traits which are collected from self-report questionnaires. Most existing methods learn post features directly by fine-tuning the pre-trained language models under the supervision of limited personality labels. This leads to inferior quality of post features and consequently affects the performance. In addition, they treat personality traits as one-hot classification labels, overlooking the semantic information within them. In this paper, we propose a large language model (LLM) based text augmentation enhanced personality detection model, which distills the LLM's knowledge to enhance the small model for personality detection, even when the LLM fails in this task. Specifically, we enable LLM to generate post analyses (augmentations) from the aspects of semantic, sentiment, and linguistic, which are critical for personality detection. By using contrastive learning to pull them together in the embedding space, the post encoder can better capture the psycho-linguistic information within the post representations, thus improving personality detection. Furthermore, we utilize the LLM to enrich the information of personality labels for enhancing the detection performance. Experimental results on the benchmark datasets demonstrate that our model outperforms the state-of-the-art methods on personality detection. ",
    "url": "https://arxiv.org/abs/2403.07581",
    "authors": [
      "Linmei Hu",
      "Hongyu He",
      "Duokang Wang",
      "Ziwang Zhao",
      "Yingxia Shao",
      "Liqiang Nie"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2403.07588",
    "title": "Visual Privacy Auditing with Diffusion Models",
    "abstract": "Image reconstruction attacks on machine learning models pose a significant risk to privacy by potentially leaking sensitive information. Although defending against such attacks using differential privacy (DP) has proven effective, determining appropriate DP parameters remains challenging. Current formal guarantees on data reconstruction success suffer from overly theoretical assumptions regarding adversary knowledge about the target data, particularly in the image domain. In this work, we empirically investigate this discrepancy and find that the practicality of these assumptions strongly depends on the domain shift between the data prior and the reconstruction target. We propose a reconstruction attack based on diffusion models (DMs) that assumes adversary access to real-world image priors and assess its implications on privacy leakage under DP-SGD. We show that (1) real-world data priors significantly influence reconstruction success, (2) current reconstruction bounds do not model the risk posed by data priors well, and (3) DMs can serve as effective auditing tools for visualizing privacy leakage. ",
    "url": "https://arxiv.org/abs/2403.07588",
    "authors": [
      "Kristian Schwethelm",
      "Johannes Kaiser",
      "Moritz Knolle",
      "Daniel Rueckert",
      "Georgios Kaissis",
      "Alexander Ziller"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.07591",
    "title": "Robustifying and Boosting Training-Free Neural Architecture Search",
    "abstract": "Neural architecture search (NAS) has become a key component of AutoML and a standard tool to automate the design of deep neural networks. Recently, training-free NAS as an emerging paradigm has successfully reduced the search costs of standard training-based NAS by estimating the true architecture performance with only training-free metrics. Nevertheless, the estimation ability of these metrics typically varies across different tasks, making it challenging to achieve robust and consistently good search performance on diverse tasks with only a single training-free metric. Meanwhile, the estimation gap between training-free metrics and the true architecture performances limits training-free NAS to achieve superior performance. To address these challenges, we propose the robustifying and boosting training-free NAS (RoBoT) algorithm which (a) employs the optimized combination of existing training-free metrics explored from Bayesian optimization to develop a robust and consistently better-performing metric on diverse tasks, and (b) applies greedy search, i.e., the exploitation, on the newly developed metric to bridge the aforementioned gap and consequently to boost the search performance of standard training-free NAS further. Remarkably, the expected performance of our RoBoT can be theoretically guaranteed, which improves over the existing training-free NAS under mild conditions with additional interesting insights. Our extensive experiments on various NAS benchmark tasks yield substantial empirical evidence to support our theoretical results. ",
    "url": "https://arxiv.org/abs/2403.07591",
    "authors": [
      "Zhenfeng He",
      "Yao Shu",
      "Zhongxiang Dai",
      "Bryan Kian Hsiang Low"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07592",
    "title": "Accurate Spatial Gene Expression Prediction by integrating  Multi-resolution features",
    "abstract": "Recent advancements in Spatial Transcriptomics (ST) technology have facilitated detailed gene expression analysis within tissue contexts. However, the high costs and methodological limitations of ST necessitate a more robust predictive model. In response, this paper introduces TRIPLEX, a novel deep learning framework designed to predict spatial gene expression from Whole Slide Images (WSIs). TRIPLEX uniquely harnesses multi-resolution features, capturing cellular morphology at individual spots, the local context around these spots, and the global tissue organization. By integrating these features through an effective fusion strategy, TRIPLEX achieves accurate gene expression prediction. Our comprehensive benchmark study, conducted on three public ST datasets and supplemented with Visium data from 10X Genomics, demonstrates that TRIPLEX outperforms current state-of-the-art models in Mean Squared Error (MSE), Mean Absolute Error (MAE), and Pearson Correlation Coefficient (PCC). The model's predictions align closely with ground truth gene expression profiles and tumor annotations, underscoring TRIPLEX's potential in advancing cancer diagnosis and treatment. ",
    "url": "https://arxiv.org/abs/2403.07592",
    "authors": [
      "Youngmin Chung",
      "Ji Hun Ha",
      "Kyeong Chan Im",
      "Joo Sang Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07607",
    "title": "On Graph Grammars and Games",
    "abstract": "Graph grammars form an interesting area of research because of their versatility in modelling diverse situations with graphs as the structures which are to be manipulated. A new class of graph grammars, nc-eNCE Graph Grammars has been introduced recently with an aim of restricting the order of application of graph production rules, thereby generating different graph classes using the same set of rules. On the other hand 2D game design using an algorithmic approach known as procedural content generation has been of interest recently. In this paper we modify the structure of nc-eNCE graph grammars with the aim of generating directed graphs. We show that employing these graph grammars simplifies the design of 2D games. We have also developed an algorithm which makes use of these graph grammars for generating random game level layouts ensuring that the players will get a different gaming experience each time they play. ",
    "url": "https://arxiv.org/abs/2403.07607",
    "authors": [
      "Jayakrishna Vijayakumar",
      "Lisa Mathew"
    ],
    "subjectives": [
      "Formal Languages and Automata Theory (cs.FL)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2403.07640",
    "title": "Asynchronous Approximate Byzantine Consensus: A Multi-hop Relay Method  and Tight Graph Conditions",
    "abstract": "We study a multi-agent resilient consensus problem, where some agents are of the Byzantine type and try to prevent the normal ones from reaching consensus. In our setting, normal agents communicate with each other asynchronously over multi-hop relay channels with delays. To solve this asynchronous Byzantine consensus problem, we develop the multi-hop weighted mean subsequence reduced (MW-MSR) algorithm. The main contribution is that we characterize a tight graph condition for our algorithm to achieve Byzantine consensus, which is expressed in the novel notion of strictly robust graphs. We show that the multi-hop communication is effective for enhancing the network's resilience against Byzantine agents. As a result, we also obtain novel conditions for resilient consensus under the malicious attack model, which are tighter than those known in the literature. Furthermore, the proposed algorithm can be viewed as a generalization of the conventional flooding-based algorithms, with less computational complexity. Lastly, we provide numerical examples to show the effectiveness of the proposed algorithm. ",
    "url": "https://arxiv.org/abs/2403.07640",
    "authors": [
      "Liwei Yuan",
      "Hideaki Ishii"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.07653",
    "title": "OmniMatch: Effective Self-Supervised Any-Join Discovery in Tabular Data  Repositories",
    "abstract": "How can we discover join relationships among columns of tabular data in a data repository? Can this be done effectively when metadata is missing? Traditional column matching works mainly rely on similarity measures based on exact value overlaps, hence missing important semantics or failing to handle noise in the data. At the same time, recent dataset discovery methods focusing on deep table representation learning techniques, do not take into consideration the rich set of column similarity signals found in prior matching and discovery methods. Finally, existing methods heavily depend on user-provided similarity thresholds, hindering their deployability in real-world settings. In this paper, we propose OmniMatch, a novel join discovery technique that detects equi-joins and fuzzy-joins betwen columns by combining column-pair similarity measures with Graph Neural Networks (GNNs). OmniMatch's GNN can capture column relatedness leveraging graph transitivity, significantly improving the recall of join discovery tasks. At the same time, OmniMatch also increases the precision by augmenting its training data with negative column join examples through an automated negative example generation process. Most importantly, compared to the state-of-the-art matching and discovery methods, OmniMatch exhibits up to 14% higher effectiveness in F1 score and AUC without relying on metadata or user-provided thresholds for each similarity metric. ",
    "url": "https://arxiv.org/abs/2403.07653",
    "authors": [
      "Christos Koutras",
      "Jiani Zhang",
      "Xiao Qin",
      "Chuan Lei",
      "Vasileios Ioannidis",
      "Christos Faloutsos",
      "George Karypis",
      "Asterios Katsifodimos"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2403.07654",
    "title": "Analyzing Adversarial Attacks on Sequence-to-Sequence Relevance Models",
    "abstract": "Modern sequence-to-sequence relevance models like monoT5 can effectively capture complex textual interactions between queries and documents through cross-encoding. However, the use of natural language tokens in prompts, such as Query, Document, and Relevant for monoT5, opens an attack vector for malicious documents to manipulate their relevance score through prompt injection, e.g., by adding target words such as true. Since such possibilities have not yet been considered in retrieval evaluation, we analyze the impact of query-independent prompt injection via manually constructed templates and LLM-based rewriting of documents on several existing relevance models. Our experiments on the TREC Deep Learning track show that adversarial documents can easily manipulate different sequence-to-sequence relevance models, while BM25 (as a typical lexical model) is not affected. Remarkably, the attacks also affect encoder-only relevance models (which do not rely on natural language prompt tokens), albeit to a lesser extent. ",
    "url": "https://arxiv.org/abs/2403.07654",
    "authors": [
      "Andrew Parry",
      "Maik Fröbe",
      "Sean MacAvaney",
      "Martin Potthast",
      "Matthias Hagen"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2403.07657",
    "title": "Scalable Spatiotemporal Prediction with Bayesian Neural Fields",
    "abstract": "Spatiotemporal datasets, which consist of spatially-referenced time series, are ubiquitous in many scientific and business-intelligence applications, such as air pollution monitoring, disease tracking, and cloud-demand forecasting. As modern datasets continue to increase in size and complexity, there is a growing need for new statistical methods that are flexible enough to capture complex spatiotemporal dynamics and scalable enough to handle large prediction problems. This work presents the Bayesian Neural Field (BayesNF), a domain-general statistical model for inferring rich probability distributions over a spatiotemporal domain, which can be used for data-analysis tasks including forecasting, interpolation, and variography. BayesNF integrates a novel deep neural network architecture for high-capacity function estimation with hierarchical Bayesian inference for robust uncertainty quantification. By defining the prior through a sequence of smooth differentiable transforms, posterior inference is conducted on large-scale data using variationally learned surrogates trained via stochastic gradient descent. We evaluate BayesNF against prominent statistical and machine-learning baselines, showing considerable improvements on diverse prediction problems from climate and public health datasets that contain tens to hundreds of thousands of measurements. The paper is accompanied with an open-source software package (https://github.com/google/bayesnf) that is easy-to-use and compatible with modern GPU and TPU accelerators on the JAX machine learning platform. ",
    "url": "https://arxiv.org/abs/2403.07657",
    "authors": [
      "Feras Saad",
      "Jacob Burnim",
      "Colin Carroll",
      "Brian Patton",
      "Urs Köster",
      "Rif A. Saurous",
      "Matthew Hoffman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Applications (stat.AP)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2403.07669",
    "title": "Machine Learning for Soccer Match Result Prediction",
    "abstract": "Machine learning has become a common approach to predicting the outcomes of soccer matches, and the body of literature in this domain has grown substantially in the past decade and a half. This chapter discusses available datasets, the types of models and features, and ways of evaluating model performance in this application domain. The aim of this chapter is to give a broad overview of the current state and potential future developments in machine learning for soccer match results prediction, as a resource for those interested in conducting future studies in the area. Our main findings are that while gradient-boosted tree models such as CatBoost, applied to soccer-specific ratings such as pi-ratings, are currently the best-performing models on datasets containing only goals as the match features, there needs to be a more thorough comparison of the performance of deep learning models and Random Forest on a range of datasets with different types of features. Furthermore, new rating systems using both player- and team-level information and incorporating additional information from, e.g., spatiotemporal tracking and event data, could be investigated further. Finally, the interpretability of match result prediction models needs to be enhanced for them to be more useful for team management. ",
    "url": "https://arxiv.org/abs/2403.07669",
    "authors": [
      "Rory Bunker",
      "Calvin Yeung",
      "Keisuke Fujii"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07673",
    "title": "Towards Model Extraction Attacks in GAN-Based Image Translation via  Domain Shift Mitigation",
    "abstract": "Model extraction attacks (MEAs) enable an attacker to replicate the functionality of a victim deep neural network (DNN) model by only querying its API service remotely, posing a severe threat to the security and integrity of pay-per-query DNN-based services. Although the majority of current research on MEAs has primarily concentrated on neural classifiers, there is a growing prevalence of image-to-image translation (I2IT) tasks in our everyday activities. However, techniques developed for MEA of DNN classifiers cannot be directly transferred to the case of I2IT, rendering the vulnerability of I2IT models to MEA attacks often underestimated. This paper unveils the threat of MEA in I2IT tasks from a new perspective. Diverging from the traditional approach of bridging the distribution gap between attacker queries and victim training samples, we opt to mitigate the effect caused by the different distributions, known as the domain shift. This is achieved by introducing a new regularization term that penalizes high-frequency noise, and seeking a flatter minimum to avoid overfitting to the shifted distribution. Extensive experiments on different image translation tasks, including image super-resolution and style transfer, are performed on different backbone victim models, and the new design consistently outperforms the baseline by a large margin across all metrics. A few real-life I2IT APIs are also verified to be extremely vulnerable to our attack, emphasizing the need for enhanced defenses and potentially revised API publishing policies. ",
    "url": "https://arxiv.org/abs/2403.07673",
    "authors": [
      "Di Mi",
      "Yanjun Zhang",
      "Leo Yu Zhang",
      "Shengshan Hu",
      "Qi Zhong",
      "Haizhuan Yuan",
      "Shirui Pan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.07675",
    "title": "Multichannel Long-Term Streaming Neural Speech Enhancement for Static  and Moving Speakers",
    "abstract": "In this work, we extend our previously proposed offline SpatialNet for long-term streaming multichannel speech enhancement in both static and moving speaker scenarios. SpatialNet exploits spatial information, such as the spatial/steering direction of speech, for discriminating between target speech and interferences, and achieved outstanding performance. The core of SpatialNet is a narrow-band self-attention module used for learning the temporal dynamic of spatial vectors. Towards long-term streaming speech enhancement, we propose to replace the offline self-attention network with online networks that have linear inference complexity w.r.t signal length and meanwhile maintain the capability of learning long-term information. Three variants are developed based on (i) masked self-attention, (ii) Retention, a self-attention variant with linear inference complexity, and (iii) Mamba, a structured-state-space-based RNN-like network. Moreover, we investigate the length extrapolation ability of different networks, namely test on signals that are much longer than training signals, and propose a short-signal training plus long-signal fine-tuning strategy, which largely improves the length extrapolation ability of the networks within limited training time. Overall, the proposed online SpatialNet achieves outstanding speech enhancement performance for long audio streams, and for both static and moving speakers. The proposed method will be open-sourced in https://github.com/Audio-WestlakeU/NBSS. ",
    "url": "https://arxiv.org/abs/2403.07675",
    "authors": [
      "Changsheng Quan",
      "Xiaofei Li"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2403.07678",
    "title": "MoralBERT: Detecting Moral Values in Social Discourse",
    "abstract": "Morality plays a fundamental role in how we perceive information while greatly influencing our decisions and judgements. Controversial topics, including vaccination, abortion, racism, and sexuality, often elicit opinions and attitudes that are not solely based on evidence but rather reflect moral worldviews. Recent advances in natural language processing have demonstrated that moral values can be gauged in human-generated textual content. Here, we design a range of language representation models fine-tuned to capture exactly the moral nuances in text, called MoralBERT. We leverage annotated moral data from three distinct sources: Twitter, Reddit, and Facebook user-generated content covering various socially relevant topics. This approach broadens linguistic diversity and potentially enhances the models' ability to comprehend morality in various contexts. We also explore a domain adaptation technique and compare it to the standard fine-tuned BERT model, using two different frameworks for moral prediction: single-label and multi-label. We compare in-domain approaches with conventional models relying on lexicon-based techniques, as well as a Machine Learning classifier with Word2Vec representation. Our results showed that in-domain prediction models significantly outperformed traditional models. While the single-label setting reaches a higher accuracy than previously achieved for the task when using BERT pretrained models. Experiments in an out-of-domain setting, instead, suggest that further work is needed for existing domain adaptation techniques to generalise between different social media platforms, especially for the multi-label task. The investigations and outcomes from this study pave the way for further exploration, enabling a more profound comprehension of moral narratives about controversial social issues. ",
    "url": "https://arxiv.org/abs/2403.07678",
    "authors": [
      "Vjosa Preniqi",
      "Iacopo Ghinassi",
      "Kyriaki Kalimeri",
      "Charalampos Saitis"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2403.07693",
    "title": "Large, Small or Both: A Novel Data Augmentation Framework Based on  Language Models for Debiasing Opinion Summarization",
    "abstract": "As more than 70$\\%$ of reviews in the existing opinion summary data set are positive, current opinion summarization approaches are reluctant to generate negative summaries given the input of negative texts. To address such sentiment bias, a direct approach without the over-reliance on a specific framework is to generate additional data based on large language models to balance the emotional distribution of the dataset. However, data augmentation based on large language models faces two disadvantages: 1) the potential issues or toxicity in the augmented data; 2) the expensive costs. Therefore, in this paper, we propose a novel data augmentation framework based on both large and small language models for debiasing opinion summarization. In specific, a small size of synthesized negative reviews is obtained by rewriting the positive text via a large language model. Then, a disentangle reconstruction model is trained based on the generated data. After training, a large amount of synthetic data can be obtained by decoding the new representation obtained from the combination of different sample representations and filtering based on confusion degree and sentiment classification. Experiments have proved that our framework can effectively alleviate emotional bias same as using only large models, but more economically. ",
    "url": "https://arxiv.org/abs/2403.07693",
    "authors": [
      "Yanyue Zhang",
      "Pengfei Li",
      "Yilong Lai",
      "Deyu Zhou"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.07700",
    "title": "CuVLER: Enhanced Unsupervised Object Discoveries through Exhaustive  Self-Supervised Transformers",
    "abstract": "In this paper, we introduce VoteCut, an innovative method for unsupervised object discovery that leverages feature representations from multiple self-supervised models. VoteCut employs normalized-cut based graph partitioning, clustering and a pixel voting approach. Additionally, We present CuVLER (Cut-Vote-and-LEaRn), a zero-shot model, trained using pseudo-labels, generated by VoteCut, and a novel soft target loss to refine segmentation accuracy. Through rigorous evaluations across multiple datasets and several unsupervised setups, our methods demonstrate significant improvements in comparison to previous state-of-the-art models. Our ablation studies further highlight the contributions of each component, revealing the robustness and efficacy of our approach. Collectively, VoteCut and CuVLER pave the way for future advancements in image segmentation. ",
    "url": "https://arxiv.org/abs/2403.07700",
    "authors": [
      "Shahaf Arica",
      "Or Rubin",
      "Sapir Gershov",
      "Shlomi Laufer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07705",
    "title": "Robust Synthetic-to-Real Transfer for Stereo Matching",
    "abstract": "With advancements in domain generalized stereo matching networks, models pre-trained on synthetic data demonstrate strong robustness to unseen domains. However, few studies have investigated the robustness after fine-tuning them in real-world scenarios, during which the domain generalization ability can be seriously degraded. In this paper, we explore fine-tuning stereo matching networks without compromising their robustness to unseen domains. Our motivation stems from comparing Ground Truth (GT) versus Pseudo Label (PL) for fine-tuning: GT degrades, but PL preserves the domain generalization ability. Empirically, we find the difference between GT and PL implies valuable information that can regularize networks during fine-tuning. We also propose a framework to utilize this difference for fine-tuning, consisting of a frozen Teacher, an exponential moving average (EMA) Teacher, and a Student network. The core idea is to utilize the EMA Teacher to measure what the Student has learned and dynamically improve GT and PL for fine-tuning. We integrate our framework with state-of-the-art networks and evaluate its effectiveness on several real-world datasets. Extensive experiments show that our method effectively preserves the domain generalization ability during fine-tuning. ",
    "url": "https://arxiv.org/abs/2403.07705",
    "authors": [
      "Jiawei Zhang",
      "Jiahe Li",
      "Lei Huang",
      "Xiaohan Yu",
      "Lin Gu",
      "Jin Zheng",
      "Xiao Bai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07706",
    "title": "Fast and Simple Explainability for Point Cloud Networks",
    "abstract": "We propose a fast and simple explainable AI (XAI) method for point cloud data. It computes pointwise importance with respect to a trained network downstream task. This allows better understanding of the network properties, which is imperative for safety-critical applications. In addition to debugging and visualization, our low computational complexity facilitates online feedback to the network at inference. This can be used to reduce uncertainty and to increase robustness. In this work, we introduce \\emph{Feature Based Interpretability} (FBI), where we compute the features' norm, per point, before the bottleneck. We analyze the use of gradients and post- and pre-bottleneck strategies, showing pre-bottleneck is preferred, in terms of smoothness and ranking. We obtain at least three orders of magnitude speedup, compared to current XAI methods, thus, scalable for big point clouds or large-scale architectures. Our approach achieves SOTA results, in terms of classification explainability. We demonstrate how the proposed measure is helpful in analyzing and characterizing various aspects of 3D learning, such as rotation invariance, robustness to out-of-distribution (OOD) outliers or domain shift and dataset bias. ",
    "url": "https://arxiv.org/abs/2403.07706",
    "authors": [
      "Meir Yossef Levi",
      "Guy Gilboa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07719",
    "title": "Dynamic Graph Representation with Knowledge-aware Attention for  Histopathology Whole Slide Image Analysis",
    "abstract": "Histopathological whole slide images (WSIs) classification has become a foundation task in medical microscopic imaging processing. Prevailing approaches involve learning WSIs as instance-bag representations, emphasizing significant instances but struggling to capture the interactions between instances. Additionally, conventional graph representation methods utilize explicit spatial positions to construct topological structures but restrict the flexible interaction capabilities between instances at arbitrary locations, particularly when spatially distant. In response, we propose a novel dynamic graph representation algorithm that conceptualizes WSIs as a form of the knowledge graph structure. Specifically, we dynamically construct neighbors and directed edge embeddings based on the head and tail relationships between instances. Then, we devise a knowledge-aware attention mechanism that can update the head node features by learning the joint attention score of each neighbor and edge. Finally, we obtain a graph-level embedding through the global pooling process of the updated head, serving as an implicit representation for the WSI classification. Our end-to-end graph representation learning approach has outperformed the state-of-the-art WSI analysis methods on three TCGA benchmark datasets and in-house test sets. Our code is available at https://github.com/WonderLandxD/WiKG. ",
    "url": "https://arxiv.org/abs/2403.07719",
    "authors": [
      "Jiawen Li",
      "Yuxuan Chen",
      "Hongbo Chu",
      "Qiehe Sun",
      "Tian Guan",
      "Anjia Han",
      "Yonghong He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07748",
    "title": "Ariadne and Theseus: Exploration and Rendezvous with Two Mobile Agents  in an Unknown Graph",
    "abstract": "We investigate two fundamental problems in mobile computing: exploration and rendezvous, with two distinct mobile agents in an unknown graph. The agents can read and write information on whiteboards that are located at all nodes. They both move along one adjacent edge at every time-step. In the exploration problem, both agents start from the same node of the graph and must traverse all of its edges. We show that a simple variant of depth-first search achieves collective exploration in $m$ synchronous time-steps, where $m$ is the number of edges of the graph. This improves the competitive ratio of collective graph exploration. In the rendezvous problem, the agents start from different nodes of the graph and must meet as fast as possible. We introduce an algorithm guaranteeing rendezvous in at most $\\frac{3}{2}m$ time-steps. This improves over the so-called `wait for Mommy' algorithm which requires $2m$ time-steps. All our guarantees are derived from a more general asynchronous setting in which the speeds of the agents are controlled by an adversary at all times. Our guarantees also generalize to weighted graphs, if the number of edges $m$ is replaced by the sum of all edge lengths. ",
    "url": "https://arxiv.org/abs/2403.07748",
    "authors": [
      "Romain Cosson"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.07817",
    "title": "UniHand: Privacy-preserving Universal Handover for Small-Cell Networks  in 5G-enabled Mobile Communication with KCI Resilience",
    "abstract": "Introducing Small Cell Networks (SCN) has significantly improved wireless link quality, spectrum efficiency and network capacity, which has been viewed as one of the key technologies in the fifth-generation (5G) mobile network. However, this technology increases the frequency of handover (HO) procedures caused by the dense deployment of cells in the network with reduced cell coverage, bringing new security and privacy issues. The current 5G-AKA and HO protocols are vulnerable to security weaknesses, such as the lack of forward secrecy and identity confusion attacks. The high HO frequency of HOs might magnify these security and privacy concerns in the 5G mobile network. This work addresses these issues by proposing a secure privacy-preserving universal HO scheme ($\\UniHand$) for SCNs in 5G mobile communication. $\\UniHand$ can achieve mutual authentication, strong anonymity, perfect forward secrecy, key-escrow-free and key compromise impersonation (KCI) resilience. To the best of our knowledge, this is the \\textit{first} scheme to achieve secure, privacy-preserving universal HO with \\textit{KCI} resilience for roaming users in 5G environment. We demonstrate that our proposed scheme is resilient against all the essential security threats by performing a comprehensive formal security analysis and conducting relevant experiments to show the cost-effectiveness of the proposed scheme. ",
    "url": "https://arxiv.org/abs/2403.07817",
    "authors": [
      "Rabiah Alnashwan",
      "Prosanta Gope",
      "Benjamin Dowling"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.07838",
    "title": "MPCPA: Multi-Center Privacy Computing with Predictions Aggregation based  on Denoising Diffusion Probabilistic Model",
    "abstract": "Privacy-preserving computing is crucial for multi-center machine learning in many applications such as healthcare and finance. In this paper a Multi-center Privacy Computing framework with Predictions Aggregation (MPCPA) based on denoising diffusion probabilistic model (DDPM) is proposed, in which conditional diffusion model training, DDPM data generation, a classifier, and strategy of prediction aggregation are included. Compared to federated learning, this framework necessitates fewer communications and leverages high-quality generated data to support robust privacy computing. Experimental validation across multiple datasets demonstrates that the proposed framework outperforms classic federated learning and approaches the performance of centralized learning with original data. Moreover, our approach demonstrates robust security, effectively addressing challenges such as image memorization and membership inference attacks. Our experiments underscore the efficacy of the proposed framework in the realm of privacy computing, with the code set to be released soon. ",
    "url": "https://arxiv.org/abs/2403.07838",
    "authors": [
      "Guibo Luo",
      "Hanwen Zhang",
      "Xiuling Wang",
      "Mingzhi Chen",
      "Yuesheng Zhu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2403.07842",
    "title": "Quantifying and Mitigating Privacy Risks for Tabular Generative Models",
    "abstract": "Synthetic data from generative models emerges as the privacy-preserving data-sharing solution. Such a synthetic data set shall resemble the original data without revealing identifiable private information. The backbone technology of tabular synthesizers is rooted in image generative models, ranging from Generative Adversarial Networks (GANs) to recent diffusion models. Recent prior work sheds light on the utility-privacy tradeoff on tabular data, revealing and quantifying privacy risks on synthetic data. We first conduct an exhaustive empirical analysis, highlighting the utility-privacy tradeoff of five state-of-the-art tabular synthesizers, against eight privacy attacks, with a special focus on membership inference attacks. Motivated by the observation of high data quality but also high privacy risk in tabular diffusion, we propose DP-TLDM, Differentially Private Tabular Latent Diffusion Model, which is composed of an autoencoder network to encode the tabular data and a latent diffusion model to synthesize the latent tables. Following the emerging f-DP framework, we apply DP-SGD to train the auto-encoder in combination with batch clipping and use the separation value as the privacy metric to better capture the privacy gain from DP algorithms. Our empirical evaluation demonstrates that DP-TLDM is capable of achieving a meaningful theoretical privacy guarantee while also significantly enhancing the utility of synthetic data. Specifically, compared to other DP-protected tabular generative models, DP-TLDM improves the synthetic quality by an average of 35% in data resemblance, 15% in the utility for downstream tasks, and 50% in data discriminability, all while preserving a comparable level of privacy risk. ",
    "url": "https://arxiv.org/abs/2403.07842",
    "authors": [
      "Chaoyi Zhu",
      "Jiayi Tang",
      "Hans Brouwer",
      "Juan F. Pérez",
      "Marten van Dijk",
      "Lydia Y. Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2403.07849",
    "title": "Iterative Graph Neural Network Enhancement via Frequent Subgraph Mining  of Explanations",
    "abstract": "We formulate an XAI-based model improvement approach for Graph Neural Networks (GNNs) for node classification, called Explanation Enhanced Graph Learning (EEGL). The goal is to improve predictive performance of GNN using explanations. EEGL is an iterative self-improving algorithm, which starts with a learned \"vanilla\" GNN, and repeatedly uses frequent subgraph mining to find relevant patterns in explanation subgraphs. These patterns are then filtered further to obtain application-dependent features corresponding to the presence of certain subgraphs in the node neighborhoods. Giving an application-dependent algorithm for such a subgraph-based extension of the Weisfeiler-Leman (1-WL) algorithm has previously been posed as an open problem. We present experimental evidence, with synthetic and real-world data, which show that EEGL outperforms related approaches in predictive performance and that it has a node-distinguishing power beyond that of vanilla GNNs. We also analyze EEGL's training dynamics. ",
    "url": "https://arxiv.org/abs/2403.07849",
    "authors": [
      "Harish G. Naik",
      "Jan Polster",
      "Raj Shekhar",
      "Tamás Horváth",
      "György Turán"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07853",
    "title": "Improving Fairness in Photovoltaic Curtailments via Daily Topology  Reconfiguration for Voltage Control in Power Distribution Networks",
    "abstract": "In PV-rich power distribution systems, over-voltage issues are often addressed by curtailing excess generation from PV plants (in addition to reactive power control), raising fairness concerns. Existing fairness-aware control schemes tackle this problem by incorporating fairness objectives into the cost function. However, such schemes result in increased overall curtailments. This paper proposes a solution through daily topology reconfiguration, ensuring that different PV plants face varying grid conditions each day, leading to different curtailment levels and enhancing fairness. We illustrate that implementing this approach enhances overall fairness without significantly increasing overall curtailments. The optimization problem involves two stages. The day-ahead stage optimizes the network topology using day-ahead forecasts of PV generation and demand, minimizing net curtailment and accounting for fairness based on curtailments from prior days. The real-time stage implements the optimized topology and computes active and reactive power setpoints for the PV plants. Day-ahead grid constraints are modeled using LinDistFlow, and real-time control employs a linearized model with a first-order Taylor approximation. The proposed scheme is numerically validated on several benchmark test cases. Results are compared using the Jain Fairness Index, considering fairness and reconfiguration scenarios. ",
    "url": "https://arxiv.org/abs/2403.07853",
    "authors": [
      "Rahul K. Gupta",
      "Daniel K. Molzahn"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.07865",
    "title": "Exploring Safety Generalization Challenges of Large Language Models via  Code",
    "abstract": "The rapid advancement of Large Language Models (LLMs) has brought about remarkable capabilities in natural language processing but also raised concerns about their potential misuse. While strategies like supervised fine-tuning and reinforcement learning from human feedback have enhanced their safety, these methods primarily focus on natural languages, which may not generalize to other domains. This paper introduces CodeAttack, a framework that transforms natural language inputs into code inputs, presenting a novel environment for testing the safety generalization of LLMs. Our comprehensive studies on state-of-the-art LLMs including GPT-4, Claude-2, and Llama-2 series reveal a common safety vulnerability of these models against code input: CodeAttack consistently bypasses the safety guardrails of all models more than 80\\% of the time. Furthermore, we find that a larger distribution gap between CodeAttack and natural language leads to weaker safety generalization, such as encoding natural language input with data structures or using less popular programming languages. These findings highlight new safety risks in the code domain and the need for more robust safety alignment algorithms to match the code capabilities of LLMs. ",
    "url": "https://arxiv.org/abs/2403.07865",
    "authors": [
      "Qibing Ren",
      "Chang Gao",
      "Jing Shao",
      "Junchi Yan",
      "Xin Tan",
      "Wai Lam",
      "Lizhuang Ma"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.07868",
    "title": "Online Digital Twin-Empowered Content Resale Mechanism in Age of  Information-Aware Edge Caching Networks",
    "abstract": "For users requesting popular contents from content providers, edge caching can alleviate backhaul pressure and enhance the quality of experience of users. Recently there is also a growing concern about content freshness that is quantified by age of information (AoI). Therefore, AoI-aware online caching algorithms are required, which is challenging because the content popularity is usually unknown in advance and may vary over time. In this paper, we propose an online digital twin (DT) empowered content resale mechanism in AoI-aware edge caching networks. We aim to design an optimal two-timescale caching strategy to maximize the utility of an edge network service provider (ENSP). The formulated optimization problem is non-convex and NP-hard. To tackle this intractable problem, we propose a DT-assisted Online Caching Algorithm (DT-OCA). In specific, we first decompose our formulated problem into a series of subproblems, each handling a cache period. For each cache period, we use a DT-based prediction method to effectively capture future content popularity, and develop online caching strategy. Competitive ratio analysis and extensive experimental results demonstrate that our algorithm has promising performance, and outperforms other benchmark algorithms. Insightful observations are also found and discussed. ",
    "url": "https://arxiv.org/abs/2403.07868",
    "authors": [
      "Yuhan Yi",
      "Guanglin Zhang",
      "Hai Jiang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2402.19389",
    "title": "Fault-tolerance of the [[8,1,4]] non-CSS code",
    "abstract": "We show the fault-tolerance of the not-so-well known [[8,1,4]] non-CSS code and study the logical error rates of the code. To do so, we adopt the procedure of the bare ancilla method presented by Brown \\emph{et al.} We choose the encoding procedure for stabilizer codes given by Gottesman and modify it to suit the setting of a class of non-CSS codes. We consider two types of noise models for this study, namely the depolarizing noise and anisotropic noise to depict the logical error rates obtained in decoding. ",
    "url": "https://arxiv.org/abs/2402.19389",
    "authors": [
      "Pranav Maheshwari",
      "Ankur Raina"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2403.06994",
    "title": "Physics Sensor Based Deep Learning Fall Detection System",
    "abstract": "Fall detection based on embedded sensor is a practical and popular research direction in recent years. In terms of a specific application: fall detection methods based upon physics sensors such as [gyroscope and accelerator] have been exploited using traditional hand crafted features and feed them in machine learning models like Markov chain or just threshold based classification methods. In this paper, we build a complete system named TSFallDetect including data receiving device based on embedded sensor, mobile deep-learning model deploying platform, and a simple server, which will be used to gather models and data for future expansion. On the other hand, we exploit the sequential deep-learning methods to address this falling motion prediction problem based on data collected by inertial and film pressure sensors. We make a empirical study based on existing datasets and our datasets collected from our system separately, which shows that the deep-learning model has more potential advantage than other traditional methods, and we proposed a new deep-learning model based on the time series data to predict the fall, and it may be superior to other sequential models in this particular field. ",
    "url": "https://arxiv.org/abs/2403.06994",
    "authors": [
      "Zeyuan Qu",
      "Tiange Huang",
      "Yuxin Ji",
      "Yongjun Li"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07025",
    "title": "Enhancing Quantum Variational Algorithms with Zero Noise Extrapolation  via Neural Networks",
    "abstract": "In the emergent realm of quantum computing, the Variational Quantum Eigensolver (VQE) stands out as a promising algorithm for solving complex quantum problems, especially in the noisy intermediate-scale quantum (NISQ) era. However, the ubiquitous presence of noise in quantum devices often limits the accuracy and reliability of VQE outcomes. This research introduces a novel approach to ameliorate this challenge by utilizing neural networks for zero noise extrapolation (ZNE) in VQE computations. By employing the Qiskit framework, we crafted parameterized quantum circuits using the RY-RZ ansatz and examined their behavior under varying levels of depolarizing noise. Our investigations spanned from determining the expectation values of a Hamiltonian, defined as a tensor product of Z operators, under different noise intensities to extracting the ground state energy. To bridge the observed outcomes under noise with the ideal noise-free scenario, we trained a Feed Forward Neural Network on the error probabilities and their associated expectation values. Remarkably, our model proficiently predicted the VQE outcome under hypothetical noise-free conditions. By juxtaposing the simulation results with real quantum device executions, we unveiled the discrepancies induced by noise and showcased the efficacy of our neural network-based ZNE technique in rectifying them. This integrative approach not only paves the way for enhanced accuracy in VQE computations on NISQ devices but also underlines the immense potential of hybrid quantum-classical paradigms in circumventing the challenges posed by quantum noise. Through this research, we envision a future where quantum algorithms can be reliably executed on noisy devices, bringing us one step closer to realizing the full potential of quantum computing. ",
    "url": "https://arxiv.org/abs/2403.07025",
    "authors": [
      "Subhasree Bhattacharjee",
      "Soumyadip Sarkar",
      "Kunal Das",
      "Bikramjit Sarkar"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07066",
    "title": "Re-Simulation-based Self-Supervised Learning for Pre-Training Foundation  Models",
    "abstract": "Self-Supervised Learning (SSL) is at the core of training modern large machine learning models, providing a scheme for learning powerful representations that can be used in a variety of downstream tasks. However, SSL strategies must be adapted to the type of training data and downstream tasks required. We propose RS3L, a novel simulation-based SSL strategy that employs a method of re-simulation to drive data augmentation for contrastive learning. By intervening in the middle of the simulation process and re-running simulation components downstream of the intervention, we generate multiple realizations of an event, thus producing a set of augmentations covering all physics-driven variations available in the simulator. Using experiments from high-energy physics, we explore how this strategy may enable the development of a foundation model; we show how R3SL pre-training enables powerful performance in downstream tasks such as discrimination of a variety of objects and uncertainty mitigation. In addition to our results, we make the RS3L dataset publicly available for further studies on how to improve SSL strategies. ",
    "url": "https://arxiv.org/abs/2403.07066",
    "authors": [
      "Philip Harris",
      "Michael Kagan",
      "Jeffrey Krupa",
      "Benedikt Maier",
      "Nathaniel Woodward"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)"
    ]
  },
  {
    "id": "arXiv:2403.07092",
    "title": "A cascaded deep network for automated tumor detection and segmentation  in clinical PET imaging of diffuse large B-cell lymphoma",
    "abstract": "Accurate detection and segmentation of diffuse large B-cell lymphoma (DLBCL) from PET images has important implications for estimation of total metabolic tumor volume, radiomics analysis, surgical intervention and radiotherapy. Manual segmentation of tumors in whole-body PET images is time-consuming, labor-intensive and operator-dependent. In this work, we develop and validate a fast and efficient three-step cascaded deep learning model for automated detection and segmentation of DLBCL tumors from PET images. As compared to a single end-to-end network for segmentation of tumors in whole-body PET images, our three-step model is more effective (improves 3D Dice score from 58.9% to 78.1%) since each of its specialized modules, namely the slice classifier, the tumor detector and the tumor segmentor, can be trained independently to a high degree of skill to carry out a specific task, rather than a single network with suboptimal performance on overall segmentation. ",
    "url": "https://arxiv.org/abs/2403.07092",
    "authors": [
      "Shadab Ahamed",
      "Natalia Dubljevic",
      "Ingrid Bloise",
      "Claire Gowdy",
      "Patrick Martineau",
      "Don Wilson",
      "Carlos F. Uribe",
      "Arman Rahmim",
      "Fereshteh Yousefirizi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2403.07105",
    "title": "A slice classification neural network for automated classification of  axial PET/CT slices from a multi-centric lymphoma dataset",
    "abstract": "Automated slice classification is clinically relevant since it can be incorporated into medical image segmentation workflows as a preprocessing step that would flag slices with a higher probability of containing tumors, thereby directing physicians attention to the important slices. In this work, we train a ResNet-18 network to classify axial slices of lymphoma PET/CT images (collected from two institutions) depending on whether the slice intercepted a tumor (positive slice) in the 3D image or if the slice did not (negative slice). Various instances of the network were trained on 2D axial datasets created in different ways: (i) slice-level split and (ii) patient-level split; inputs of different types were used: (i) only PET slices and (ii) concatenated PET and CT slices; and different training strategies were employed: (i) center-aware (CAW) and (ii) center-agnostic (CAG). Model performances were compared using the area under the receiver operating characteristic curve (AUROC) and the area under the precision-recall curve (AUPRC), and various binary classification metrics. We observe and describe a performance overestimation in the case of slice-level split as compared to the patient-level split training. The model trained using patient-level split data with the network input containing only PET slices in the CAG training regime was the best performing/generalizing model on a majority of metrics. Our models were additionally more closely compared using the sensitivity metric on the positive slices from their respective test sets. ",
    "url": "https://arxiv.org/abs/2403.07105",
    "authors": [
      "Shadab Ahamed",
      "Yixi Xu",
      "Ingrid Bloise",
      "Joo H. O",
      "Carlos F. Uribe",
      "Rahul Dodhia",
      "Juan L. Ferres",
      "Arman Rahmim"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2403.07124",
    "title": "Stochastic gradient descent-based inference for dynamic network models  with attractors",
    "abstract": "In Coevolving Latent Space Networks with Attractors (CLSNA) models, nodes in a latent space represent social actors, and edges indicate their dynamic interactions. Attractors are added at the latent level to capture the notion of attractive and repulsive forces between nodes, borrowing from dynamical systems theory. However, CLSNA reliance on MCMC estimation makes scaling difficult, and the requirement for nodes to be present throughout the study period limit practical applications. We address these issues by (i) introducing a Stochastic gradient descent (SGD) parameter estimation method, (ii) developing a novel approach for uncertainty quantification using SGD, and (iii) extending the model to allow nodes to join and leave over time. Simulation results show that our extensions result in little loss of accuracy compared to MCMC, but can scale to much larger networks. We apply our approach to the longitudinal social networks of members of US Congress on the social media platform X. Accounting for node dynamics overcomes selection bias in the network and uncovers uniquely and increasingly repulsive forces within the Republican Party. ",
    "url": "https://arxiv.org/abs/2403.07124",
    "authors": [
      "Hancong Pan",
      "Xiaojing Zhu",
      "Cantay Caliskan",
      "Dino P. Christenson",
      "Konstantinos Spiliopoulos",
      "Dylan Walker",
      "Eric D. Kolaczyk"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.07126",
    "title": "Heterogeneous Image-based Classification Using Distributional Data  Analysis",
    "abstract": "Diagnostic imaging has gained prominence as potential biomarkers for early detection and diagnosis in a diverse array of disorders including cancer. However, existing methods routinely face challenges arising from various factors such as image heterogeneity. We develop a novel imaging-based distributional data analysis (DDA) approach that incorporates the probability (quantile) distribution of the pixel-level features as covariates. The proposed approach uses a smoothed quantile distribution (via a suitable basis representation) as functional predictors in a scalar-on-functional quantile regression model. Some distinctive features of the proposed approach include the ability to: (i) account for heterogeneity within the image; (ii) incorporate granular information spanning the entire distribution; and (iii) tackle variability in image sizes for unregistered images in cancer applications. Our primary goal is risk prediction in Hepatocellular carcinoma that is achieved via predicting the change in tumor grades at post-diagnostic visits using pre-diagnostic enhancement pattern mapping (EPM) images of the liver. Along the way, the proposed DDA approach is also used for case versus control diagnosis and risk stratification objectives. Our analysis reveals that when coupled with global structural radiomics features derived from the corresponding T1-MRI scans, the proposed smoothed quantile distributions derived from EPM images showed considerable improvements in sensitivity and comparable specificity in contrast to classification based on routinely used summary measures that do not account for image heterogeneity. Given that there are limited predictive modeling approaches based on heterogeneous images in cancer, the proposed method is expected to provide considerable advantages in image-based early detection and risk prediction. ",
    "url": "https://arxiv.org/abs/2403.07126",
    "authors": [
      "Alec Reinhardt",
      "Newsha Nikzad",
      "Raven J. Hollis",
      "Galia Jacobson",
      "Millicent A. Roach",
      "Mohamed Badawy",
      "Peter Chul Park",
      "Laura Beretta",
      "Prasun K Jalal",
      "David T. Fuentes",
      "Eugene J. Koay",
      "Suprateek Kundu"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07310",
    "title": "How does promoting the minority fraction affect generalization? A  theoretical study of the one-hidden-layer neural network on group imbalance",
    "abstract": "Group imbalance has been a known problem in empirical risk minimization (ERM), where the achieved high average accuracy is accompanied by low accuracy in a minority group. Despite algorithmic efforts to improve the minority group accuracy, a theoretical generalization analysis of ERM on individual groups remains elusive. By formulating the group imbalance problem with the Gaussian Mixture Model, this paper quantifies the impact of individual groups on the sample complexity, the convergence rate, and the average and group-level testing performance. Although our theoretical framework is centered on binary classification using a one-hidden-layer neural network, to the best of our knowledge, we provide the first theoretical analysis of the group-level generalization of ERM in addition to the commonly studied average generalization performance. Sample insights of our theoretical results include that when all group-level co-variance is in the medium regime and all mean are close to zero, the learning performance is most desirable in the sense of a small sample complexity, a fast training rate, and a high average and group-level testing accuracy. Moreover, we show that increasing the fraction of the minority group in the training data does not necessarily improve the generalization performance of the minority group. Our theoretical results are validated on both synthetic and empirical datasets, such as CelebA and CIFAR-10 in image classification. ",
    "url": "https://arxiv.org/abs/2403.07310",
    "authors": [
      "Hongkang Li",
      "Shuai Zhang",
      "Yihua Zhang",
      "Meng Wang",
      "Sijia Liu",
      "Pin-Yu Chen"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07323",
    "title": "Discrete-Time Modeling and Handover Analysis of Intelligent Reflecting  Surface-Assisted Networks",
    "abstract": "Owning to the reflection gain and double path loss featured by intelligent reflecting surface (IRS) channels, handover (HO) locations become irregular and the signal strength fluctuates sharply with variations in IRS connections during HO, the risk of HO failures (HOFs) is exacerbated and thus HO parameters require reconfiguration. However, existing HO models only assume monotonic negative exponential path loss and cannot obtain sound HO parameters. This paper proposes a discrete-time model to explicitly track the HO process with variations in IRS connections, where IRS connections and HO process are discretized as finite states by measurement intervals, and transitions between states are modeled as stochastic processes. Specifically, to capture signal fluctuations during HO, IRS connection state-dependent distributions of the user-IRS distance are modified by the correlation between measurement intervals. In addition, states of the HO process are formed with Time-to-Trigger and HO margin whose transition probabilities are integrated concerning all IRS connection states. Trigger location distributions and probabilities of HO, HOF, and ping-pong (PP) are obtained by tracing user HO states. Results show IRSs mitigate PPs by 48% but exacerbate HOFs by 90% under regular parameters. Optimal parameters are mined ensuring probabilities of HOF and PP are both less than 0.1%. ",
    "url": "https://arxiv.org/abs/2403.07323",
    "authors": [
      "Hongtao Zhang",
      "Haoyan Wei"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2403.07493",
    "title": "Signed graphs in data sciences via communicability geometry",
    "abstract": "Signed graphs are an emergent way of representing data in a variety of contexts were conflicting interactions exist. These include data from biological, ecological, and social systems. Here we propose the concept of communicability geometry for signed graphs, proving that metrics in this space, such as the communicability distance and angles, are Euclidean and spherical. We then apply these metrics to solve several problems in data analysis of signed graphs in a unified way. They include the partitioning of signed graphs, dimensionality reduction, finding hierarchies of alliances in signed networks as well as the quantification of the degree of polarization between the existing factions in systems represented by this type of graphs. ",
    "url": "https://arxiv.org/abs/2403.07493",
    "authors": [
      "Fernando Diaz-Diaz",
      "Ernesto Estrada"
    ],
    "subjectives": [
      "Metric Geometry (math.MG)",
      "Discrete Mathematics (cs.DM)",
      "Machine Learning (cs.LG)",
      "Combinatorics (math.CO)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2403.07507",
    "title": "Reconstructions of Jupiter's magnetic field using physics informed  neural networks",
    "abstract": "Magnetic sounding using data collected from the Juno mission can be used to provide constraints on Jupiter's interior. However, inwards continuation of reconstructions assuming zero electrical conductivity and a representation in spherical harmonics are limited by the enhancement of noise at small scales. In this paper we describe new reconstructions of Jupiter's internal magnetic field based on physics-informed neural networks and either the first 33 (PINN33) or the first 50 (PINN50) of Juno's orbits. The method can resolve local structures, and allows for weak ambient electrical currents. Compared with other methods, our reconstructions of Jupiter's magnetic field both on and above the surface are similar, and we achieve a similar fit to the Juno data. However, our models are not hampered by noise at depth, and so offer a much clearer picture of the interior structure. We estimate that the dynamo boundary is at a fractional radius of 0.8. At this depth, the magnetic field is arranged into longitudinal bands, and the great blue spot appears to be rooted in neighbouring structures of oppositely signed flux. ",
    "url": "https://arxiv.org/abs/2403.07507",
    "authors": [
      "Philip W. Livermore",
      "Leyuan Wu",
      "Longwei Chen",
      "Sjoerd A.L. de Ridder"
    ],
    "subjectives": [
      "Earth and Planetary Astrophysics (astro-ph.EP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.07715",
    "title": "Intra-video Positive Pairs in Self-Supervised Learning for Ultrasound",
    "abstract": "Self-supervised learning (SSL) is one strategy for addressing the paucity of labelled data in medical imaging by learning representations from unlabelled images. Contrastive and non-contrastive SSL methods produce learned representations that are similar for pairs of related images. Such pairs are commonly constructed by randomly distorting the same image twice. The videographic nature of ultrasound offers flexibility for defining the similarity relationship between pairs of images. In this study, we investigated the effect of utilizing proximal, distinct images from the same B-mode ultrasound video as pairs for SSL. Additionally, we introduced a sample weighting scheme that increases the weight of closer image pairs and demonstrated how it can be integrated into SSL objectives. Named Intra-Video Positive Pairs (IVPP), the method surpassed previous ultrasound-specific contrastive learning methods' average test accuracy on COVID-19 classification with the POCUS dataset by $\\ge 1.3\\%$. Detailed investigations of IVPP's hyperparameters revealed that some combinations of IVPP hyperparameters can lead to improved or worsened performance, depending on the downstream task. Guidelines for practitioners were synthesized based on the results, such as the merit of IVPP with task-specific hyperparameters, and the improved performance of contrastive methods for ultrasound compared to non-contrastive counterparts. ",
    "url": "https://arxiv.org/abs/2403.07715",
    "authors": [
      "Blake VanBerlo",
      "Alexander Wong",
      "Jesse Hoey",
      "Robert Arntfield"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.07728",
    "title": "CAS: A General Algorithm for Online Selective Conformal Prediction with  FCR Control",
    "abstract": "We study the problem of post-selection predictive inference in an online fashion. To avoid devoting resources to unimportant units, a preliminary selection of the current individual before reporting its prediction interval is common and meaningful in online predictive tasks. Since the online selection causes a temporal multiplicity in the selected prediction intervals, it is important to control the real-time false coverage-statement rate (FCR) to measure the averaged miscoverage error. We develop a general framework named CAS (Calibration after Adaptive Selection) that can wrap around any prediction model and online selection rule to output post-selection prediction intervals. If the current individual is selected, we first perform an adaptive selection on historical data to construct a calibration set, then output a conformal prediction interval for the unobserved label. We provide tractable constructions for the calibration set for popular online selection rules. We proved that CAS can achieve an exact selection-conditional coverage guarantee in the finite-sample and distribution-free regimes. For the decision-driven selection rule, including most online multiple-testing procedures, CAS can exactly control the real-time FCR below the target level without any distributional assumptions. For the online selection with symmetric thresholds, we establish the error bound for the control gap of FCR under mild distributional assumptions. To account for the distribution shift in online data, we also embed CAS into some recent dynamic conformal prediction methods and examine the long-run FCR control. Numerical results on both synthetic and real data corroborate that CAS can effectively control FCR around the target level and yield more narrowed prediction intervals over existing baselines across various settings. ",
    "url": "https://arxiv.org/abs/2403.07728",
    "authors": [
      "Yajie Bao",
      "Yuyang Huo",
      "Haojie Ren",
      "Changliang Zou"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2403.07745",
    "title": "Probabilistic Easy Variational Causal Effect",
    "abstract": "Let $X$ and $Z$ be random vectors, and $Y=g(X,Z)$. In this paper, on the one hand, for the case that $X$ and $Z$ are continuous, by using the ideas from the total variation and the flux of $g$, we develop a point of view in causal inference capable of dealing with a broad domain of causal problems. Indeed, we focus on a function, called Probabilistic Easy Variational Causal Effect (PEACE), which can measure the direct causal effect of $X$ on $Y$ with respect to continuously and interventionally changing the values of $X$ while keeping the value of $Z$ constant. PEACE is a function of $d\\ge 0$, which is a degree managing the strengths of probability density values $f(x|z)$. On the other hand, we generalize the above idea for the discrete case and show its compatibility with the continuous case. Further, we investigate some properties of PEACE using measure theoretical concepts. Furthermore, we provide some identifiability criteria and several examples showing the generic capability of PEACE. We note that PEACE can deal with the causal problems for which micro-level or just macro-level changes in the value of the input variables are important. Finally, PEACE is stable under small changes in $\\partial g_{in}/\\partial x$ and the joint distribution of $X$ and $Z$, where $g_{in}$ is obtained from $g$ by removing all functional relationships defining $X$ and $Z$. ",
    "url": "https://arxiv.org/abs/2403.07745",
    "authors": [
      "Usef Faghihi",
      "Amir Saki"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2012.08347",
    "title": "Beyond Privacy Trade-offs with Structured Transparency",
    "abstract": " Title: Beyond Privacy Trade-offs with Structured Transparency ",
    "url": "https://arxiv.org/abs/2012.08347",
    "authors": [
      "Andrew Trask",
      "Emma Bluemke",
      "Teddy Collins",
      "Ben Garfinkel Eric Drexler",
      "Claudia Ghezzou Cuervas-Mons",
      "Iason Gabriel",
      "Allan Dafoe",
      "William Isaac"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2101.09193",
    "title": "Dense outlier detection and open-set recognition based on training with  noisy negative images",
    "abstract": " Comments: Published in Image and Vision Computing ",
    "url": "https://arxiv.org/abs/2101.09193",
    "authors": [
      "Petra Bevandić",
      "Ivan Krešo",
      "Marin Oršić",
      "Siniša Šegvić"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2102.00665",
    "title": "Attributed Graph Alignment",
    "abstract": " Title: Attributed Graph Alignment ",
    "url": "https://arxiv.org/abs/2102.00665",
    "authors": [
      "Ning Zhang",
      "Ziao Wang",
      "Weina Wang",
      "Lele Wang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2106.10866",
    "title": "Customizing Graph Neural Networks using Path Reweighting",
    "abstract": " Comments: 25 pages with 14 figures ",
    "url": "https://arxiv.org/abs/2106.10866",
    "authors": [
      "Jianpeng Chen",
      "Yujing Wang",
      "Ming Zeng",
      "Zongyi Xiang",
      "Bitan Hou",
      "Yunhai Tong",
      "Ole J. Mengshoel",
      "Yazhou Ren"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.00408",
    "title": "CSC-Unet: A Novel Convolutional Sparse Coding Strategy Based Neural  Network for Semantic Segmentation",
    "abstract": " Title: CSC-Unet: A Novel Convolutional Sparse Coding Strategy Based Neural  Network for Semantic Segmentation ",
    "url": "https://arxiv.org/abs/2108.00408",
    "authors": [
      "Haitong Tang",
      "Shuang He",
      "Mengduo Yang",
      "Xia Lu",
      "Qin Yu",
      "Kaiyue Liu",
      "Hongjie Yan",
      "Nizhuan Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.00031",
    "title": "Deep DNA Storage: Scalable and Robust DNA Storage via Coding Theory and  Deep Learning",
    "abstract": " Title: Deep DNA Storage: Scalable and Robust DNA Storage via Coding Theory and  Deep Learning ",
    "url": "https://arxiv.org/abs/2109.00031",
    "authors": [
      "Daniella Bar-Lev",
      "Itai Orr",
      "Omer Sabary",
      "Tuvi Etzion",
      "Eitan Yaakobi"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.13800",
    "title": "A Two-Stage Feature Selection Approach for Robust Evaluation of  Treatment Effects in High-Dimensional Observational Data",
    "abstract": " Title: A Two-Stage Feature Selection Approach for Robust Evaluation of  Treatment Effects in High-Dimensional Observational Data ",
    "url": "https://arxiv.org/abs/2111.13800",
    "authors": [
      "Md Saiful Islam",
      "Sahil Shikalgar",
      "Md. Noor-E-Alam"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2201.10106",
    "title": "On the Feasible Region of Efficient Algorithms for Attributed Graph  Alignment",
    "abstract": " Title: On the Feasible Region of Efficient Algorithms for Attributed Graph  Alignment ",
    "url": "https://arxiv.org/abs/2201.10106",
    "authors": [
      "Ziao Wang",
      "Ning Zhang",
      "Weina Wang",
      "Lele Wang"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2202.03580",
    "title": "Convolutional Neural Networks on Graphs with Chebyshev Approximation,  Revisited",
    "abstract": " Comments: NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2202.03580",
    "authors": [
      "Mingguo He",
      "Zhewei Wei",
      "Ji-Rong Wen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.08876",
    "title": "An alternative approach to train neural networks using monotone  variational inequality",
    "abstract": " Title: An alternative approach to train neural networks using monotone  variational inequality ",
    "url": "https://arxiv.org/abs/2202.08876",
    "authors": [
      "Chen Xu",
      "Xiuyuan Cheng",
      "Yao Xie"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.14100",
    "title": "Adversarial Distortion Learning for Medical Image Denoising",
    "abstract": " Title: Adversarial Distortion Learning for Medical Image Denoising ",
    "url": "https://arxiv.org/abs/2204.14100",
    "authors": [
      "Morteza Ghahremani",
      "Mohammad Khateri",
      "Alejandra Sierra",
      "Jussi Tohka"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.10766",
    "title": "Recent Advances in Embedding Methods for Multi-Object Tracking: A Survey",
    "abstract": " Title: Recent Advances in Embedding Methods for Multi-Object Tracking: A Survey ",
    "url": "https://arxiv.org/abs/2205.10766",
    "authors": [
      "Gaoang Wang",
      "Mingli Song",
      "Jenq-Neng Hwang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.03467",
    "title": "Real-time Neural Dense Elevation Mapping for Urban Terrain with  Uncertainty Estimations",
    "abstract": " Comments: 8 pages, 7 figures, accepted by IEEE Robotics and Automation Letters ",
    "url": "https://arxiv.org/abs/2208.03467",
    "authors": [
      "Bowen Yang",
      "Qingwen Zhang",
      "Ruoyu Geng",
      "Lujia Wang",
      "Ming Liu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2210.10969",
    "title": "SSiT: Saliency-guided Self-supervised Image Transformer for Diabetic  Retinopathy Grading",
    "abstract": " Title: SSiT: Saliency-guided Self-supervised Image Transformer for Diabetic  Retinopathy Grading ",
    "url": "https://arxiv.org/abs/2210.10969",
    "authors": [
      "Yijin Huang",
      "Junyan Lyu",
      "Pujin Cheng",
      "Roger Tam",
      "Xiaoying Tang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.02695",
    "title": "WaveNets: Wavelet Channel Attention Networks",
    "abstract": " Comments: IEEE BigData2022 conference ",
    "url": "https://arxiv.org/abs/2211.02695",
    "authors": [
      "Hadi Salman",
      "Caleb Parks",
      "Shi Yin Hong",
      "Justin Zhan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.14302",
    "title": "Neural DAEs: Constrained neural networks",
    "abstract": " Comments: Extended the paper to PDEs, added a third experiment denoising a vector field and updated the introduction to make the distinction between this work and physics informed neural networks more clear ",
    "url": "https://arxiv.org/abs/2211.14302",
    "authors": [
      "Tue Boesen",
      "Eldad Haber",
      "Uri Michael Ascher"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2301.01060",
    "title": "Knowledge-guided Causal Intervention for Weakly-supervised Object  Localization",
    "abstract": " Comments: 13 pages, 7 figures, 7 tables ",
    "url": "https://arxiv.org/abs/2301.01060",
    "authors": [
      "Feifei Shao",
      "Yawei Luo",
      "Fei Gao",
      "Yi Yang",
      "Jun Xiao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.09582",
    "title": "Language-Specific Representation of Emotion-Concept Knowledge Causally  Supports Emotion Inference",
    "abstract": " Comments: 44 pages, 14 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2302.09582",
    "authors": [
      "Ming Li",
      "Yusheng Su",
      "Hsiu-Yuan Huang",
      "Jiali Cheng",
      "Xin Hu",
      "Xinmiao Zhang",
      "Huadong Wang",
      "Yujia Qin",
      "Xiaozhi Wang",
      "Kristen A. Lindquist",
      "Zhiyuan Liu",
      "Dan Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2303.17823",
    "title": "An interpretable neural network-based non-proportional odds model for  ordinal regression",
    "abstract": " Comments: 35 pages, 18 figures, accepted to Journal of Computational and Graphical Statistics ",
    "url": "https://arxiv.org/abs/2303.17823",
    "authors": [
      "Akifumi Okuno",
      "Kazuharu Harada"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.12522",
    "title": "P-NOC: adversarial training of CAM generating networks for robust weakly  supervised semantic segmentation priors",
    "abstract": " Comments: 19 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2305.12522",
    "authors": [
      "Lucas David",
      "Helio Pedrini",
      "Zanoni Dias"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.13931",
    "title": "Position Bias Estimation with Item Embedding for Sparse Dataset",
    "abstract": " Title: Position Bias Estimation with Item Embedding for Sparse Dataset ",
    "url": "https://arxiv.org/abs/2305.13931",
    "authors": [
      "Shion Ishikawa",
      "Yun Ching Liu",
      "Young-Joo Chung",
      "Yu Hirate"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2305.14585",
    "title": "Faithful and Efficient Explanations for Neural Networks via Neural  Tangent Kernel Surrogate Models",
    "abstract": " Comments: 9 pages, 2 figures, 3 tables Updated 3/11/2024 various additions/clarifications after ICLR review. Accepted as a Spotlight paper at ICLR 2024 ",
    "url": "https://arxiv.org/abs/2305.14585",
    "authors": [
      "Andrew Engel",
      "Zhichao Wang",
      "Natalie S. Frank",
      "Ioana Dumitriu",
      "Sutanay Choudhury",
      "Anand Sarwate",
      "Tony Chiang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.14114",
    "title": "TNPAR: Topological Neural Poisson Auto-Regressive Model for Learning  Granger Causal Structure from Event Sequences",
    "abstract": " Title: TNPAR: Topological Neural Poisson Auto-Regressive Model for Learning  Granger Causal Structure from Event Sequences ",
    "url": "https://arxiv.org/abs/2306.14114",
    "authors": [
      "Yuequn Liu",
      "Ruichu Cai",
      "Wei Chen",
      "Jie Qiao",
      "Yuguang Yan",
      "Zijian Li",
      "Keli Zhang",
      "Zhifeng Hao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.00543",
    "title": "Defending Against Poisoning Attacks in Federated Learning with  Blockchain",
    "abstract": " Comments: Accepted by IEEE Transactions on Artificial Intelligence ",
    "url": "https://arxiv.org/abs/2307.00543",
    "authors": [
      "Nanqing Dong",
      "Zhipeng Wang",
      "Jiahao Sun",
      "Michael Kampffmeyer",
      "William Knottenbelt",
      "Eric Xing"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computer Science and Game Theory (cs.GT)"
    ]
  },
  {
    "id": "arXiv:2307.05881",
    "title": "tdCoxSNN: Time-Dependent Cox Survival Neural Network for Continuous-time  Dynamic Prediction",
    "abstract": " Title: tdCoxSNN: Time-Dependent Cox Survival Neural Network for Continuous-time  Dynamic Prediction ",
    "url": "https://arxiv.org/abs/2307.05881",
    "authors": [
      "Lang Zeng",
      "Jipeng Zhang",
      "Wei Chen",
      "Ying Ding"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.16140",
    "title": "Fully $1\\times1$ Convolutional Network for Lightweight Image  Super-Resolution",
    "abstract": " Comments: Accepted by Machine Intelligence Research, DOI: 10.1007/s11633-024-1401-z ",
    "url": "https://arxiv.org/abs/2307.16140",
    "authors": [
      "Gang Wu",
      "Junjun Jiang",
      "Kui Jiang",
      "Xianming Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.05525",
    "title": "Robustifying Point Cloud Networks by Refocusing",
    "abstract": " Title: Robustifying Point Cloud Networks by Refocusing ",
    "url": "https://arxiv.org/abs/2308.05525",
    "authors": [
      "Meir Yossef Levi",
      "Guy Gilboa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.13212",
    "title": "SEGNO: Generalizing Equivariant Graph Neural Networks with Physical  Inductive Biases",
    "abstract": " Title: SEGNO: Generalizing Equivariant Graph Neural Networks with Physical  Inductive Biases ",
    "url": "https://arxiv.org/abs/2308.13212",
    "authors": [
      "Yang Liu",
      "Jiashun Cheng",
      "Haihong Zhao",
      "Tingyang Xu",
      "Peilin Zhao",
      "Fugee Tsung",
      "Jia Li",
      "Yu Rong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2308.14286",
    "title": "Bridging Cross-task Protocol Inconsistency for Distillation in Dense  Object Detection",
    "abstract": " Comments: Accepted by ICCV 2023 ",
    "url": "https://arxiv.org/abs/2308.14286",
    "authors": [
      "Longrong Yang",
      "Xianpan Zhou",
      "Xuewei Li",
      "Liang Qiao",
      "Zheyang Li",
      "Ziwei Yang",
      "Gaoang Wang",
      "Xi Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.01786",
    "title": "Safe and Robust Watermark Injection with a Single OoD Image",
    "abstract": " Title: Safe and Robust Watermark Injection with a Single OoD Image ",
    "url": "https://arxiv.org/abs/2309.01786",
    "authors": [
      "Shuyang Yu",
      "Junyuan Hong",
      "Haobo Zhang",
      "Haotao Wang",
      "Zhangyang Wang",
      "Jiayu Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.05436",
    "title": "Quantized Fourier and Polynomial Features for more Expressive Tensor  Network Models",
    "abstract": " Comments: 9 pages, 4 figures. Reviewed version after peer-review. To be published in the proceedings of the 27th International Conference on Artificial Intelligence and Statistics (AISTATS) ",
    "url": "https://arxiv.org/abs/2309.05436",
    "authors": [
      "Frederiek Wesel",
      "Kim Batselier"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2309.06030",
    "title": "Federated Learning for Large-Scale Scene Modeling with Neural Radiance  Fields",
    "abstract": " Title: Federated Learning for Large-Scale Scene Modeling with Neural Radiance  Fields ",
    "url": "https://arxiv.org/abs/2309.06030",
    "authors": [
      "Teppei Suzuki"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.06067",
    "title": "Implicit Neural Representation for MRI Parallel Imaging Reconstruction",
    "abstract": " Title: Implicit Neural Representation for MRI Parallel Imaging Reconstruction ",
    "url": "https://arxiv.org/abs/2309.06067",
    "authors": [
      "Hao Li",
      "Yusheng Zhou",
      "Jianan Liu",
      "Xiling Liu",
      "Tao Huang",
      "Zhihan Lv"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2309.12190",
    "title": "Regret and Conservatism of Distributionally Robust Constrained  Stochastic Model Predictive Control",
    "abstract": " Comments: Extended version of a manuscript accepted for ACC (revised version) ",
    "url": "https://arxiv.org/abs/2309.12190",
    "authors": [
      "Maik Pfefferkorn",
      "Venkatraman Renganathan",
      "Rolf Findeisen"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2309.17336",
    "title": "Robust 3D Object Detection from LiDAR-Radar Point Clouds via Cross-Modal  Feature Augmentation",
    "abstract": " Comments: Accepted to ICRA 2024. 8 pages, 4 figures. Equal contribution for Gabriel Chan and Hantao Zhong, listed randomly ",
    "url": "https://arxiv.org/abs/2309.17336",
    "authors": [
      "Jianning Deng",
      "Gabriel Chan",
      "Hantao Zhong",
      "Chris Xiaoxuan Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2310.02832",
    "title": "Out-of-Distribution Detection by Leveraging Between-Layer Transformation  Smoothness",
    "abstract": " Comments: International Conference on Learning Representations: ICLR 2024 ",
    "url": "https://arxiv.org/abs/2310.02832",
    "authors": [
      "Fran Jelenić",
      "Josip Jukić",
      "Martin Tutek",
      "Mate Puljiz",
      "Jan Šnajder"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.08359",
    "title": "Rotation-Agnostic Image Representation Learning for Digital Pathology",
    "abstract": " Comments: CVPR 2024 - 23 pages, 10 figures, and 18 tables ",
    "url": "https://arxiv.org/abs/2311.08359",
    "authors": [
      "Saghir Alfasly",
      "Abubakr Shafique",
      "Peyman Nejat",
      "Jibran Khan",
      "Areej Alsaafin",
      "Ghazal Alabtah",
      "H.R. Tizhoosh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.09618",
    "title": "Simulating Opinion Dynamics with Networks of LLM-based Agents",
    "abstract": " Title: Simulating Opinion Dynamics with Networks of LLM-based Agents ",
    "url": "https://arxiv.org/abs/2311.09618",
    "authors": [
      "Yun-Shiuan Chuang",
      "Agam Goyal",
      "Nikunj Harlalka",
      "Siddharth Suresh",
      "Robert Hawkins",
      "Sijia Yang",
      "Dhavan Shah",
      "Junjie Hu",
      "Timothy T. Rogers"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2311.11227",
    "title": "FedRA: A Random Allocation Strategy for Federated Tuning to Unleash the  Power of Heterogeneous Clients",
    "abstract": " Title: FedRA: A Random Allocation Strategy for Federated Tuning to Unleash the  Power of Heterogeneous Clients ",
    "url": "https://arxiv.org/abs/2311.11227",
    "authors": [
      "Shangchao Su",
      "Bin Li",
      "Xiangyang Xue"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2311.11845",
    "title": "Entangled View-Epipolar Information Aggregation for Generalizable Neural  Radiance Fields",
    "abstract": " Comments: Accepted by CVPR-2024 ",
    "url": "https://arxiv.org/abs/2311.11845",
    "authors": [
      "Zhiyuan Min",
      "Yawei Luo",
      "Wei Yang",
      "Yuesong Wang",
      "Yi Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.13310",
    "title": "On the parallel solution of hydro-mechanical problems with fracture  networks and contact conditions",
    "abstract": " Title: On the parallel solution of hydro-mechanical problems with fracture  networks and contact conditions ",
    "url": "https://arxiv.org/abs/2311.13310",
    "authors": [
      "Jan Stebel",
      "Jakub Kružík",
      "David Horák",
      "Jan Březina",
      "Michal Béreš"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2311.15637",
    "title": "Neural 3D Strokes: Creating Stylized 3D Scenes with Vectorized 3D  Strokes",
    "abstract": " Comments: Accepted to CVPR 2024 ",
    "url": "https://arxiv.org/abs/2311.15637",
    "authors": [
      "Hao-Bin Duan",
      "Miao Wang",
      "Yan-Xun Li",
      "Yong-Liang Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2312.01639",
    "title": "On the Effectiveness of Large Language Models in Domain-Specific Code  Generation",
    "abstract": " Comments: Preprint submitted to ACM Transactions on Software Engineering and Methodology ",
    "url": "https://arxiv.org/abs/2312.01639",
    "authors": [
      "Meng Chen",
      "Hongyu Zhang",
      "Chengcheng Wan",
      "Zhao Wei",
      "Yong Xu",
      "Juhong Wang",
      "Xiaodong Gu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2312.02142",
    "title": "Object Recognition as Next Token Prediction",
    "abstract": " Comments: CVPR 2024 ",
    "url": "https://arxiv.org/abs/2312.02142",
    "authors": [
      "Kaiyu Yue",
      "Bor-Chun Chen",
      "Jonas Geiping",
      "Hengduo Li",
      "Tom Goldstein",
      "Ser-Nam Lim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.03779",
    "title": "Public emotional dynamics toward AIGC content generation across social  media platform",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2312.03779",
    "authors": [
      "Qinglan Wei",
      "Jiayi Li",
      "Yuan Zhang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2312.03781",
    "title": "Lite-Mind: Towards Efficient and Robust Brain Representation Network",
    "abstract": " Comments: 17 pages ",
    "url": "https://arxiv.org/abs/2312.03781",
    "authors": [
      "Zixuan Gong",
      "Qi Zhang",
      "Duoqian Miao",
      "Guangyin Bao",
      "Liang Hu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.13936",
    "title": "GVE-Leiden: Fast Leiden Algorithm for Community Detection in Shared  Memory Setting",
    "abstract": " Comments: 12 pages, 10 figures, 1 table. arXiv admin note: substantial text overlap with arXiv:2312.04876 ",
    "url": "https://arxiv.org/abs/2312.13936",
    "authors": [
      "Subhajit Sahu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2312.14973",
    "title": "Interactive Visualization of Time-Varying Flow Fields Using Particle  Tracing Neural Networks",
    "abstract": " Title: Interactive Visualization of Time-Varying Flow Fields Using Particle  Tracing Neural Networks ",
    "url": "https://arxiv.org/abs/2312.14973",
    "authors": [
      "Mengjiao Han",
      "Jixian Li",
      "Sudhanshu Sane",
      "Shubham Gupta",
      "Bei Wang",
      "Steve Petruzza",
      "Chris R. Johnson"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2401.06187",
    "title": "Scissorhands: Scrub Data Influence via Connection Sensitivity in  Networks",
    "abstract": " Comments: Machine Unlearning, Deep Learning ",
    "url": "https://arxiv.org/abs/2401.06187",
    "authors": [
      "Jing Wu",
      "Mehrtash Harandi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.07629",
    "title": "Fine-Grained Prototypes Distillation for Few-Shot Object Detection",
    "abstract": " Comments: Accepted by AAAI2024 ",
    "url": "https://arxiv.org/abs/2401.07629",
    "authors": [
      "Zichen Wang",
      "Bo Yang",
      "Haonan Yue",
      "Zhenghao Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.15459",
    "title": "Multi-LLM Collaboration + Data-Centric Innovation = 2x Better  Vulnerability Repair",
    "abstract": " Comments: Accepted in the ICSE 2024 Research Track with a different title \"Out of Sight, Out of Mind: Better Automatic Vulnerability Repair by Broadening Input Ranges and Sources\" ",
    "url": "https://arxiv.org/abs/2401.15459",
    "authors": [
      "Xin Zhou",
      "Kisub Kim",
      "Bowen Xu",
      "DongGyun Han",
      "David Lo"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2401.15479",
    "title": "Navigating the Post-API Dilemma Search Engine Results Pages Present a  Biased View of Social Media Data",
    "abstract": " Comments: Proceedings of the ACM Web Conference 2024 (WWW '24) ",
    "url": "https://arxiv.org/abs/2401.15479",
    "authors": [
      "Amrit Poudel",
      "Tim Weninger"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2402.00746",
    "title": "Health-LLM: Personalized Retrieval-Augmented Disease Prediction System",
    "abstract": " Title: Health-LLM: Personalized Retrieval-Augmented Disease Prediction System ",
    "url": "https://arxiv.org/abs/2402.00746",
    "authors": [
      "Mingyu Jin",
      "Qinkai Yu",
      "Dong Shu",
      "Chong Zhang",
      "Suiyuan Zhu",
      "Mengnan Du",
      "Yanda Meng",
      "Yongfeng Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.01313",
    "title": "AutoGCN -- Towards Generic Human Activity Recognition with Neural  Architecture Search",
    "abstract": " Title: AutoGCN -- Towards Generic Human Activity Recognition with Neural  Architecture Search ",
    "url": "https://arxiv.org/abs/2402.01313",
    "authors": [
      "Felix Tempel",
      "Inga Strümke",
      "Espen Alexander F. Ihlen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.03634",
    "title": "Ray Denoising: Depth-aware Hard Negative Sampling for Multi-view 3D  Object Detection",
    "abstract": " Title: Ray Denoising: Depth-aware Hard Negative Sampling for Multi-view 3D  Object Detection ",
    "url": "https://arxiv.org/abs/2402.03634",
    "authors": [
      "Feng Liu",
      "Tengteng Huang",
      "Qianjing Zhang",
      "Haotian Yao",
      "Chi Zhang",
      "Fang Wan",
      "Qixiang Ye",
      "Yanzhao Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.05482",
    "title": "A Non-Intrusive Neural Quality Assessment Model for Surface  Electromyography Signals",
    "abstract": " Comments: 5 pages, 4 figures ",
    "url": "https://arxiv.org/abs/2402.05482",
    "authors": [
      "Cho-Yuan Lee",
      "Kuan-Chen Wang",
      "Kai-Chun Liu",
      "Xugang Lu",
      "Ping-Cheng Yeh",
      "Yu Tsao"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.07999",
    "title": "NetInfoF Framework: Measuring and Exploiting Network Usable Information",
    "abstract": " Comments: Accepted to ICLR 2024 (Spotlight) ",
    "url": "https://arxiv.org/abs/2402.07999",
    "authors": [
      "Meng-Chieh Lee",
      "Haiyang Yu",
      "Jian Zhang",
      "Vassilis N. Ioannidis",
      "Xiang Song",
      "Soji Adeshina",
      "Da Zheng",
      "Christos Faloutsos"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2402.09786",
    "title": "Examining Pathological Bias in a Generative Adversarial Network  Discriminator: A Case Study on a StyleGAN3 Model",
    "abstract": " Title: Examining Pathological Bias in a Generative Adversarial Network  Discriminator: A Case Study on a StyleGAN3 Model ",
    "url": "https://arxiv.org/abs/2402.09786",
    "authors": [
      "Alvin Grissom II",
      "Ryan F. Lei",
      "Matt Gusdorff",
      "Jeova Farias Sales Rocha Neto",
      "Bailey Lin",
      "Ryan Trotter"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.10011",
    "title": "Clifford Group Equivariant Simplicial Message Passing Networks",
    "abstract": " Title: Clifford Group Equivariant Simplicial Message Passing Networks ",
    "url": "https://arxiv.org/abs/2402.10011",
    "authors": [
      "Cong Liu",
      "David Ruhe",
      "Floor Eijkelboom",
      "Patrick Forré"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.10433",
    "title": "Fusing Neural and Physical: Augment Protein Conformation Sampling with  Tractable Simulations",
    "abstract": " Comments: Published at the GEM workshop, ICLR 2024 ",
    "url": "https://arxiv.org/abs/2402.10433",
    "authors": [
      "Jiarui Lu",
      "Zuobai Zhang",
      "Bozitao Zhong",
      "Chence Shi",
      "Jian Tang"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2402.11333",
    "title": "A Cross-Cultural Analysis of Social Norms in Bollywood and Hollywood  Movies",
    "abstract": " Title: A Cross-Cultural Analysis of Social Norms in Bollywood and Hollywood  Movies ",
    "url": "https://arxiv.org/abs/2402.11333",
    "authors": [
      "Sunny Rai",
      "Khushang Jilesh Zaveri",
      "Shreya Havaldar",
      "Soumna Nema",
      "Lyle Ungar",
      "Sharath Chandra Guntuku"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2402.14892",
    "title": "Novelty Detection on Radio Astronomy Data using Signatures",
    "abstract": " Title: Novelty Detection on Radio Astronomy Data using Signatures ",
    "url": "https://arxiv.org/abs/2402.14892",
    "authors": [
      "Paola Arrubarrena",
      "Maud Lemercier",
      "Bojan Nikolic",
      "Terry Lyons",
      "Thomas Cass"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.17257",
    "title": "RIME: Robust Preference-based Reinforcement Learning with Noisy  Preferences",
    "abstract": " Title: RIME: Robust Preference-based Reinforcement Learning with Noisy  Preferences ",
    "url": "https://arxiv.org/abs/2402.17257",
    "authors": [
      "Jie Cheng",
      "Gang Xiong",
      "Xingyuan Dai",
      "Qinghai Miao",
      "Yisheng Lv",
      "Fei-Yue Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.00012",
    "title": "PreRoutGNN for Timing Prediction with Order Preserving Partition: Global  Circuit Pre-training, Local Delay Learning and Attentional Cell Modeling",
    "abstract": " Comments: 13 pages, 5 figures, The 38th Annual AAAI Conference on Artificial Intelligence (AAAI 2024) ",
    "url": "https://arxiv.org/abs/2403.00012",
    "authors": [
      "Ruizhe Zhong",
      "Junjie Ye",
      "Zhentao Tang",
      "Shixiong Kai",
      "Mingxuan Yuan",
      "Jianye Hao",
      "Junchi Yan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2403.00892",
    "title": "PowerFlowMultiNet: Multigraph Neural Networks for Unbalanced Three-Phase  Distribution Systems",
    "abstract": " Title: PowerFlowMultiNet: Multigraph Neural Networks for Unbalanced Three-Phase  Distribution Systems ",
    "url": "https://arxiv.org/abs/2403.00892",
    "authors": [
      "Salah Ghamizi",
      "Jun Cao",
      "Aoxiang Ma",
      "Pedro Rodriguez"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.01491",
    "title": "Ultimate linear block and convolutional codes",
    "abstract": " Title: Ultimate linear block and convolutional codes ",
    "url": "https://arxiv.org/abs/2403.01491",
    "authors": [
      "Ted Hurley"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Rings and Algebras (math.RA)"
    ]
  },
  {
    "id": "arXiv:2403.01548",
    "title": "In-Context Sharpness as Alerts: An Inner Representation Perspective for  Hallucination Mitigation",
    "abstract": " Comments: code repo is available at: this https URL ",
    "url": "https://arxiv.org/abs/2403.01548",
    "authors": [
      "Shiqi Chen",
      "Miao Xiong",
      "Junteng Liu",
      "Zhengxuan Wu",
      "Teng Xiao",
      "Siyang Gao",
      "Junxian He"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.01841",
    "title": "Making Pre-trained Language Models Great on Tabular Prediction",
    "abstract": " Comments: Accepted to ICLR 2024 as spotlight presentation (Notable Top 5%). OpenReview link is this https URL, codes will be available at this https URL ",
    "url": "https://arxiv.org/abs/2403.01841",
    "authors": [
      "Jiahuan Yan",
      "Bo Zheng",
      "Hongxia Xu",
      "Yiheng Zhu",
      "Danny Z. Chen",
      "Jimeng Sun",
      "Jian Wu",
      "Jintai Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2403.03229",
    "title": "Embracing Uncertainty Flexibility: Harnessing a Supervised Tree Kernel  to Empower Ensemble Modelling for 2D Echocardiography-Based Prediction of  Right Ventricular Volume",
    "abstract": " Comments: In the Proceedings of the 16th International Conference of Machine Vision (ICMV 2023), November 15-18, Yerevan, Armenia ",
    "url": "https://arxiv.org/abs/2403.03229",
    "authors": [
      "Tuan A. Bohoran",
      "Polydoros N. Kampaktsis",
      "Laura McLaughlin",
      "Jay Leb",
      "Gerry P. McCann",
      "Archontis Giannakidis"
    ],
    "subjectives": [
      "Tissues and Organs (q-bio.TO)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)",
      "Analysis of PDEs (math.AP)"
    ]
  },
  {
    "id": "arXiv:2403.03576",
    "title": "Unsupervised Incremental Learning with Dual Concept Drift Detection for  Identifying Anomalous Sequences",
    "abstract": " Comments: submitted to IJCNN2024,under review ",
    "url": "https://arxiv.org/abs/2403.03576",
    "authors": [
      "Jin Li",
      "Kleanthis Malialis",
      "Christos G. Panayiotou",
      "Marios M. Polycarpou"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2403.04298",
    "title": "Understanding how social discussion platforms like Reddit are  influencing financial behavior",
    "abstract": " Comments: 8 pages, 8 figures, 3 tables, and 1 algorithm; Published in WI-IAT 2022 (The 21st IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology) ",
    "url": "https://arxiv.org/abs/2403.04298",
    "authors": [
      "Sachin Thukral",
      "Suyash Sangwan",
      "Arnab Chatterjee",
      "Lipika Dey",
      "Aaditya Agrawal",
      "Pramit Kumar Chandra",
      "Animesh Mukherjee"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2403.04558",
    "title": "Reducing self-supervised learning complexity improves weakly-supervised  classification performance in computational pathology",
    "abstract": " Comments: Submitted to MICCAI 2024 ",
    "url": "https://arxiv.org/abs/2403.04558",
    "authors": [
      "Tim Lenz",
      "Omar S. M. El Nahhas",
      "Marta Ligero",
      "Jakob Nikolas Kather"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.04778",
    "title": "An Efficient Difference-of-Convex Solver for Privacy Funnel",
    "abstract": " Title: An Efficient Difference-of-Convex Solver for Privacy Funnel ",
    "url": "https://arxiv.org/abs/2403.04778",
    "authors": [
      "Teng-Hui Huang",
      "Hesham El Gamal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2403.04990",
    "title": "Jet Discrimination with Quantum Complete Graph Neural Network",
    "abstract": " Title: Jet Discrimination with Quantum Complete Graph Neural Network ",
    "url": "https://arxiv.org/abs/2403.04990",
    "authors": [
      "Yi-An Chen",
      "Kai-Feng Chen"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Machine Learning (cs.LG)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2403.05538",
    "title": "Explaining Code Examples in Introductory Programming Courses: LLM vs  Humans",
    "abstract": " Comments: 3 tables; 1 figure ",
    "url": "https://arxiv.org/abs/2403.05538",
    "authors": [
      "Arun-Balajiee Lekshmi-Narayanan",
      "Priti Oli",
      "Jeevan Chapagain",
      "Mohammad Hassany",
      "Rabin Banjade",
      "Peter Brusilovsky",
      "Vasile Rus"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2403.05818",
    "title": "PR-NET: Leveraging Pathway Refined Network Structures for Prostate  Cancer Patient Condition Prediction",
    "abstract": " Title: PR-NET: Leveraging Pathway Refined Network Structures for Prostate  Cancer Patient Condition Prediction ",
    "url": "https://arxiv.org/abs/2403.05818",
    "authors": [
      "R. Li",
      "J. Liu",
      "X.L. Deng",
      "X. Liu",
      "J.C. Guo",
      "W.Y. Wu",
      "L. Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2403.05918",
    "title": "SEMRes-DDPM: Residual Network Based Diffusion Modelling Applied to  Imbalanced Data",
    "abstract": " Comments: None ",
    "url": "https://arxiv.org/abs/2403.05918",
    "authors": [
      "Ming Zheng",
      "Yang Yang",
      "Zhi-Hang Zhao",
      "Shan-Chao Gan",
      "Yang Chen",
      "Si-Kai Ni",
      "Yang Lu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2403.05925",
    "title": "BEACON: A Bayesian Evolutionary Approach for Counterexample Generation  of Control Systems",
    "abstract": " Title: BEACON: A Bayesian Evolutionary Approach for Counterexample Generation  of Control Systems ",
    "url": "https://arxiv.org/abs/2403.05925",
    "authors": [
      "Joshua Yancosek",
      "Ali Baheri"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2403.06154",
    "title": "GlanceVAD: Exploring Glance Supervision for Label-efficient Video  Anomaly Detection",
    "abstract": " Comments: 21 pages ",
    "url": "https://arxiv.org/abs/2403.06154",
    "authors": [
      "Huaxin Zhang",
      "Xiang Wang",
      "Xiaohao Xu",
      "Xiaonan Huang",
      "Chuchu Han",
      "Yuehuan Wang",
      "Changxin Gao",
      "Shanjun Zhang",
      "Nong Sang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.06495",
    "title": "Toward Generalist Anomaly Detection via In-context Residual Learning  with Few-shot Sample Prompts",
    "abstract": " Comments: Accepted to CVPR 2024; 17 pages; 5 figures ",
    "url": "https://arxiv.org/abs/2403.06495",
    "authors": [
      "Jiawen Zhu",
      "Guansong Pang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2403.06569",
    "title": "Enhancing Joint Motion Prediction for Individuals with Limb Loss Through  Model Reprogramming",
    "abstract": " Title: Enhancing Joint Motion Prediction for Individuals with Limb Loss Through  Model Reprogramming ",
    "url": "https://arxiv.org/abs/2403.06569",
    "authors": [
      "Sharmita Dey",
      "Sarath R. Nair"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2403.06747",
    "title": "MetaSplit: Meta-Split Network for Limited-Stock Product Recommendation",
    "abstract": " Comments: WWW'24 Industry Track ",
    "url": "https://arxiv.org/abs/2403.06747",
    "authors": [
      "Wenhao Wu",
      "Jialiang Zhou",
      "Ailong He",
      "Shuguang Han",
      "Jufeng Chen",
      "Bo Zheng"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  }
]