[
  {
    "id": "arXiv:2305.08879",
    "title": "Spiking Network Initialisation and Firing Rate Collapse",
    "abstract": "In recent years, newly developed methods to train spiking neural networks (SNNs) have rendered them as a plausible alternative to Artificial Neural Networks (ANNs) in terms of accuracy, while at the same time being much more energy efficient at inference and potentially at training time. However, it is still unclear what constitutes a good initialisation for an SNN. We often use initialisation schemes developed for ANN training which are often inadequate and require manual tuning. In this paper, we attempt to tackle this issue by using techniques from the ANN initialisation literature as well as computational neuroscience results. We show that the problem of weight initialisation for ANNs is a more nuanced problem than it is for ANNs due to the spike-and-reset non-linearity of SNNs and the firing rate collapse problem. We firstly identify and propose several solutions to the firing rate collapse problem under different sets of assumptions which successfully solve the issue by leveraging classical random walk and Wiener processes results. Secondly, we devise a general strategy for SNN initialisation which combines variance propagation techniques from ANNs and different methods to obtain the expected firing rate and membrane potential distribution based on diffusion and shot-noise approximations. Altogether, we obtain theoretical results to solve the SNN initialisation which consider the membrane potential distribution in the presence of a threshold. Yet, to what extent can these methods be successfully applied to SNNs on real datasets remains an open question. ",
    "url": "https://arxiv.org/abs/2305.08879",
    "authors": [
      "Nicolas Perez-Nieves",
      "Dan F.M Goodman"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.08886",
    "title": "Identification of the Factors Affecting the Reduction of Energy  Consumption and Cost in Buildings Using Data Mining Techniques",
    "abstract": "Optimizing energy consumption and coordination of utility systems have long been a concern of the building industry. Buildings are one of the largest energy consumers in the world, making their energy efficiency crucial for preventing waste and reducing costs. Additionally, buildings generate substantial amounts of raw data, which can be used to understand energy consumption patterns and assist in developing optimization strategies. Using a real-world dataset, this research aims to identify the factors that influence building cost reduction and energy consumption. To achieve this, we utilize three regression models (Lasso Regression, Decision Tree, and Random Forest) to predict primary fuel usage, electrical energy consumption, and cost savings in buildings. An analysis of the factors influencing energy consumption and cost reduction is conducted, and the decision tree algorithm is optimized using metaheuristics. By employing metaheuristic techniques, we fine-tune the decision tree algorithm's parameters and improve its accuracy. Finally, we review the most practical features of potential and nonpotential buildings that can reduce primary fuel usage, electrical energy consumption, and costs ",
    "url": "https://arxiv.org/abs/2305.08886",
    "authors": [
      "Hamed Khosravi",
      "Hadi Sahebi",
      "Rahim khanizad",
      "Imtiaz Ahmed"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.08890",
    "title": "Differential Convolutional Fuzzy Time Series Forecasting",
    "abstract": "Fuzzy time series forecasting (FTSF) is a typical forecasting method with wide application. Traditional FTSF is regarded as an expert system which leads to lose the ability to recognize undefined feature. The mentioned is main reason of poor forecasting with FTSF. To solve the problem, the proposed model Differential Fuzzy Convolutional Neural Network (DFCNN) utilizes convolution neural network to re-implement FTSF with learnable ability. DFCNN is capable of recognizing the potential information and improve the forecasting accuracy. Thanks to learnable ability of neural network, length of fuzzy rules established in FTSF is expended to arbitrary length which expert is not able to be handle by expert system. At the same time, FTSF usually cannot achieve satisfactory performance of non-stationary time series due to trend of non-stationary time series. The trend of non-stationary time series causes the fuzzy set established by FTSF to invalid and cause the forecasting to fail. DFCNN utilizes the Difference algorithm to weaken the non-stationarity of time series, so that DFCNN can forecast the non-stationary time series with low error that FTSF cannot forecast in satisfactory performance. After mass of experiments, DFCNN has excellent prediction effect, which is ahead of the existing FTSF and common time series forecasting algorithms. Finally, DFCNN provides further ideas for improving FTSF and holds continued research value. ",
    "url": "https://arxiv.org/abs/2305.08890",
    "authors": [
      "Tianxiang Zhan",
      "Yuanpeng He",
      "Yong Deng",
      "Zhen Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.08949",
    "title": "Influential Billboard Slot Selection using Spatial Clustering and Pruned  Submodularity Graph",
    "abstract": "Billboard advertising is a popular out-of-home advertising technique adopted by commercial houses. Companies own billboards and offer them to commercial houses on a payment basis. Given a database of billboards with slot information, we want to determine which k slots to choose to maximize influence. We call this the INFLUENTIAL BILLBOARD SLOT SELECTION (IBSS) Problem and pose it as a combinatorial optimization problem. We show that the influence function considered in this paper is non-negative, monotone, and submodular. The incremental greedy approach based on the marginal gain computation leads to a constant factor approximation guarantee. However, this method scales very poorly when the size of the problem instance is very large. To address this, we propose a spatial partitioning and pruned submodularity graph-based approach that is divided into the following three steps: preprocessing, pruning, and selection. We analyze the proposed solution approaches to understand their time, space requirement, and performance guarantee. We conduct extensive set of experiments with real-world datasets and compare the performance of the proposed solution approaches with the available baseline methods. We observe that the proposed approaches lead to more influence than all the baseline methods within reasonable computational time. ",
    "url": "https://arxiv.org/abs/2305.08949",
    "authors": [
      "Dildar Ali",
      "Suman Banerjee",
      "Yamuna Prasad"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2305.08950",
    "title": "Causal Analysis for Robust Interpretability of Neural Networks",
    "abstract": "Interpreting the inner function of neural networks is crucial for the trustworthy development and deployment of these black-box models. Prior interpretability methods focus on correlation-based measures to attribute model decisions to individual examples. However, these measures are susceptible to noise and spurious correlations encoded in the model during the training phase (e.g., biased inputs, model overfitting, or misspecification). Moreover, this process has proven to result in noisy and unstable attributions that prevent any transparent understanding of the model's behavior. In this paper, we develop a robust interventional-based method grounded by causal analysis to capture cause-effect mechanisms in pre-trained neural networks and their relation to the prediction. Our novel approach relies on path interventions to infer the causal mechanisms within hidden layers and isolate relevant and necessary information (to model prediction), avoiding noisy ones. The result is task-specific causal explanatory graphs that can audit model behavior and express the actual causes underlying its performance. We apply our method to vision models trained on classification tasks. On image classification tasks, we provide extensive quantitative experiments to show that our approach can capture more stable and faithful explanations than standard attribution-based methods. Furthermore, the underlying causal graphs reveal the neural interactions in the model, making it a valuable tool in other applications (e.g., model repair). ",
    "url": "https://arxiv.org/abs/2305.08950",
    "authors": [
      "Ola Ahmad",
      "Nicolas Bereux",
      "Vahid Hashemi",
      "Freddy Lecue"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2305.08960",
    "title": "Training Neural Networks without Backpropagation: A Deeper Dive into the  Likelihood Ratio Method",
    "abstract": "Backpropagation (BP) is the most important gradient estimation method for training neural networks in deep learning. However, the literature shows that neural networks trained by BP are vulnerable to adversarial attacks. We develop the likelihood ratio (LR) method, a new gradient estimation method, for training a broad range of neural network architectures, including convolutional neural networks, recurrent neural networks, graph neural networks, and spiking neural networks, without recursive gradient computation. We propose three methods to efficiently reduce the variance of the gradient estimation in the neural network training process. Our experiments yield numerical results for training different neural networks on several datasets. All results demonstrate that the LR method is effective for training various neural networks and significantly improves the robustness of the neural networks under adversarial attacks relative to the BP method. ",
    "url": "https://arxiv.org/abs/2305.08960",
    "authors": [
      "Jinyang Jiang",
      "Zeliang Zhang",
      "Chenliang Xu",
      "Zhaofei Yu",
      "Yijie Peng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2305.08977",
    "title": "Autoencoder-based Anomaly Detection in Streaming Data with Incremental  Learning and Concept Drift Adaptation",
    "abstract": "In our digital universe nowadays, enormous amount of data are produced in a streaming manner in a variety of application areas. These data are often unlabelled. In this case, identifying infrequent events, such as anomalies, poses a great challenge. This problem becomes even more difficult in non-stationary environments, which can cause deterioration of the predictive performance of a model. To address the above challenges, the paper proposes an autoencoder-based incremental learning method with drift detection (strAEm++DD). Our proposed method strAEm++DD leverages on the advantages of both incremental learning and drift detection. We conduct an experimental study using real-world and synthetic datasets with severe or extreme class imbalance, and provide an empirical analysis of strAEm++DD. We further conduct a comparative study, showing that the proposed method significantly outperforms existing baseline and advanced methods. ",
    "url": "https://arxiv.org/abs/2305.08977",
    "authors": [
      "Jin Li",
      "Kleanthis Malialis",
      "Marios M. Polycarpou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.08978",
    "title": "An assessment of measuring local levels of homelessness through proxy  social media signals",
    "abstract": "Recent studies suggest social media activity can function as a proxy for measures of state-level public health, detectable through natural language processing. We present results of our efforts to apply this approach to estimate homelessness at the state level throughout the US during the period 2010-2019 and 2022 using a dataset of roughly 1 million geotagged tweets containing the substring ``homeless.'' Correlations between homelessness-related tweet counts and ranked per capita homelessness volume, but not general-population densities, suggest a relationship between the likelihood of Twitter users to personally encounter or observe homelessness in their everyday lives and their likelihood to communicate about it online. An increase to the log-odds of ``homeless'' appearing in an English-language tweet, as well as an acceleration in the increase in average tweet sentiment, suggest that tweets about homelessness are also affected by trends at the nation-scale. Additionally, changes to the lexical content of tweets over time suggest that reversals to the polarity of national or state-level trends may be detectable through an increase in political or service-sector language over the semantics of charity or direct appeals. An analysis of user account type also revealed changes to Twitter-use patterns by accounts authored by individuals versus entities that may provide an additional signal to confirm changes to homelessness density in a given jurisdiction. While a computational approach to social media analysis may provide a low-cost, real-time dataset rich with information about nationwide and localized impacts of homelessness and homelessness policy, we find that practical issues abound, limiting the potential of social media as a proxy to complement other measures of homelessness. ",
    "url": "https://arxiv.org/abs/2305.08978",
    "authors": [
      "Yoshi Meke Bird",
      "Sarah E. Grobe",
      "Michael V. Arnold",
      "Sean P. Rogers",
      "Mikaela I. Fudolig",
      "Julia Witte Zimmerman",
      "Christopher M. Danforth",
      "Peter Sheridan Dodds"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2305.08993",
    "title": "Survey of Malware Analysis through Control Flow Graph using Machine  Learning",
    "abstract": "Malware is a significant threat to the security of computer systems and networks which requires sophisticated techniques to analyze the behavior and functionality for detection. Traditional signature-based malware detection methods have become ineffective in detecting new and unknown malware due to their rapid evolution. One of the most promising techniques that can overcome the limitations of signature-based detection is to use control flow graphs (CFGs). CFGs leverage the structural information of a program to represent the possible paths of execution as a graph, where nodes represent instructions and edges represent control flow dependencies. Machine learning (ML) algorithms are being used to extract these features from CFGs and classify them as malicious or benign. In this survey, we aim to review some state-of-the-art methods for malware detection through CFGs using ML, focusing on the different ways of extracting, representing, and classifying. Specifically, we present a comprehensive overview of different types of CFG features that have been used as well as different ML algorithms that have been applied to CFG-based malware detection. We provide an in-depth analysis of the challenges and limitations of these approaches, as well as suggest potential solutions to address some open problems and promising future directions for research in this field. ",
    "url": "https://arxiv.org/abs/2305.08993",
    "authors": [
      "Shaswata Mitra",
      "Stephen A. Torri",
      "Sudip Mittal"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09024",
    "title": "Scalable Adaptive Traffic Light Control Over a Traffic Network Including  Transit Delays",
    "abstract": "We study the Traffic Light Control (TLC) problem for a traffic network with multiple intersections in an artery, including the effect of transit delays for vehicles moving from one intersection to the next. The goal is to minimize the overall mean waiting time and improve the ``green wave'' properties in such systems. Using a stochastic hybrid system model with parametric traffic light controllers, we use Infinitesimal Perturbation Analysis (IPA) to derive a data-driven cost gradient estimator with respect to these parameters. We then iteratively adjust them through an online gradient-based algorithm. We show that the event-driven nature of the IPA estimators driving the controllers leads to scalable computationally efficient controllers as the dimensionality of the traffic network increases. ",
    "url": "https://arxiv.org/abs/2305.09024",
    "authors": [
      "Yingqing Chen",
      "Christos G. Cassandras"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.09042",
    "title": "Adaptive Federated Pruning in Hierarchical Wireless Networks",
    "abstract": "Federated Learning (FL) is a promising privacy-preserving distributed learning framework where a server aggregates models updated by multiple devices without accessing their private datasets. Hierarchical FL (HFL), as a device-edge-cloud aggregation hierarchy, can enjoy both the cloud server's access to more datasets and the edge servers' efficient communications with devices. However, the learning latency increases with the HFL network scale due to the increasing number of edge servers and devices with limited local computation capability and communication bandwidth. To address this issue, in this paper, we introduce model pruning for HFL in wireless networks to reduce the neural network scale. We present the convergence analysis of an upper on the l2 norm of gradients for HFL with model pruning, analyze the computation and communication latency of the proposed model pruning scheme, and formulate an optimization problem to maximize the convergence rate under a given latency threshold by jointly optimizing the pruning ratio and wireless resource allocation. By decoupling the optimization problem and using Karush Kuhn Tucker (KKT) conditions, closed-form solutions of pruning ratio and wireless resource allocation are derived. Simulation results show that our proposed HFL with model pruning achieves similar learning accuracy compared with the HFL without model pruning and reduces about 50 percent communication cost. ",
    "url": "https://arxiv.org/abs/2305.09042",
    "authors": [
      "Xiaonan Liu",
      "Shiqiang Wang",
      "Yansha Deng",
      "Arumugam Nallanathan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09044",
    "title": "Scalable and Robust Tensor Ring Decomposition for Large-scale Data",
    "abstract": "Tensor ring (TR) decomposition has recently received increased attention due to its superior expressive performance for high-order tensors. However, the applicability of traditional TR decomposition algorithms to real-world applications is hindered by prevalent large data sizes, missing entries, and corruption with outliers. In this work, we propose a scalable and robust TR decomposition algorithm capable of handling large-scale tensor data with missing entries and gross corruptions. We first develop a novel auto-weighted steepest descent method that can adaptively fill the missing entries and identify the outliers during the decomposition process. Further, taking advantage of the tensor ring model, we develop a novel fast Gram matrix computation (FGMC) approach and a randomized subtensor sketching (RStS) strategy which yield significant reduction in storage and computational complexity. Experimental results demonstrate that the proposed method outperforms existing TR decomposition methods in the presence of outliers, and runs significantly faster than existing robust tensor completion algorithms. ",
    "url": "https://arxiv.org/abs/2305.09044",
    "authors": [
      "Yicong He",
      "George K. Atia"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.09056",
    "title": "Physics-informed Convolutional Recurrent Surrogate Model for Reservoir  Simulation with Well Controls",
    "abstract": "This paper presents a novel surrogate model for modeling subsurface fluid flow with well controls using a physics-informed convolutional recurrent neural network (PICRNN). The model uses a convolutional long-short term memory (ConvLSTM) to capture the spatiotemporal dependencies of the state evolution dynamics in the porous flow. The ConvLSTM is linked to the state space equations, enabling the incorporation of a discrete-time sequence of well control. The model requires initial state condition and a sequence of well controls as inputs, and predicts the state variables of the system, such as pressure, as output. By minimizing the residuals of reservoir flow state-space equations, the network is trained without the need for labeled data. The model is designed to serve as a surrogate model for predicting future reservoir states based on the initial reservoir state and input engineering controls. Boundary conditions are enforced into the state-space equations so no additional loss term is needed. Three numerical cases are studied, demonstrating the model's effectiveness in predicting reservoir dynamics based on future well/system controls. The proposed model provides a new approach for efficient and accurate prediction of subsurface fluid flow, with potential applications in optimal control design for reservoir engineering. ",
    "url": "https://arxiv.org/abs/2305.09056",
    "authors": [
      "Jungang Chen",
      "Eduardo Gildin",
      "John E. Killough"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09057",
    "title": "Self-Supervised Pretraining on Paired Sequences of fMRI Data for  Transfer Learning to Brain Decoding Tasks",
    "abstract": "In this work we introduce a self-supervised pretraining framework for transformers on functional Magnetic Resonance Imaging (fMRI) data. First, we pretrain our architecture on two self-supervised tasks simultaneously to teach the model a general understanding of the temporal and spatial dynamics of human auditory cortex during music listening. Our pretraining results are the first to suggest a synergistic effect of multitask training on fMRI data. Second, we finetune the pretrained models and train additional fresh models on a supervised fMRI classification task. We observe significantly improved accuracy on held-out runs with the finetuned models, which demonstrates the ability of our pretraining tasks to facilitate transfer learning. This work contributes to the growing body of literature on transformer architectures for pretraining and transfer learning with fMRI data, and serves as a proof of concept for our pretraining tasks and multitask pretraining on fMRI data. ",
    "url": "https://arxiv.org/abs/2305.09057",
    "authors": [
      "Sean Paulsen",
      "Michael Casey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2305.09060",
    "title": "Learning Linear Embeddings for Non-Linear Network Dynamics with Koopman  Message Passing",
    "abstract": "Recently, Koopman operator theory has become a powerful tool for developing linear representations of non-linear dynamical systems. However, existing data-driven applications of Koopman operator theory, including both traditional and deep learning approaches, perform poorly on non-linear network dynamics problems as they do not address the underlying geometric structure. In this paper we present a novel approach based on Koopman operator theory and message passing networks that finds a linear representation for the dynamical system which is globally valid at any time step. The linearisations found by our method produce predictions on a suite of network dynamics problems that are several orders of magnitude better than current state-of-the-art techniques. We also apply our approach to the highly non-linear training dynamics of neural network architectures, and obtain linear representations which can generate network parameters with comparable performance to networks trained by classical optimisers. ",
    "url": "https://arxiv.org/abs/2305.09060",
    "authors": [
      "King Fai Yeh",
      "Paris Flood",
      "William Redman",
      "Pietro Liò"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09078",
    "title": "PanelNet: Understanding 360 Indoor Environment via Panel Representation",
    "abstract": "Indoor 360 panoramas have two essential properties. (1) The panoramas are continuous and seamless in the horizontal direction. (2) Gravity plays an important role in indoor environment design. By leveraging these properties, we present PanelNet, a framework that understands indoor environments using a novel panel representation of 360 images. We represent an equirectangular projection (ERP) as consecutive vertical panels with corresponding 3D panel geometry. To reduce the negative impact of panoramic distortion, we incorporate a panel geometry embedding network that encodes both the local and global geometric features of a panel. To capture the geometric context in room design, we introduce Local2Global Transformer, which aggregates local information within a panel and panel-wise global context. It greatly improves the model performance with low training overhead. Our method outperforms existing methods on indoor 360 depth estimation and shows competitive results against state-of-the-art approaches on the task of indoor layout estimation and semantic segmentation. ",
    "url": "https://arxiv.org/abs/2305.09078",
    "authors": [
      "Haozheng Yu",
      "Lu He",
      "Bing Jian",
      "Weiwei Feng",
      "Shan Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.09082",
    "title": "The Good, the Bad, and the Missing: Neural Code Generation for Machine  Learning Tasks",
    "abstract": "Machine learning (ML) has been increasingly used in a variety of domains, while solving ML programming tasks poses unique challenges because of the fundamentally different nature and construction from general programming tasks, especially for developers who do not have ML backgrounds. Automatic code generation that produces a code snippet from a natural language description can be a promising technique to accelerate ML programming tasks. In recent years, although many deep learning-based neural code generation models have been proposed with high accuracy, the fact that most of them are mainly evaluated on general programming tasks calls into question their effectiveness and usefulness in ML programming tasks. In this paper, we set out to investigate the effectiveness of existing neural code generation models on ML programming tasks. For our analysis, we select six state-of-the-art neural code generation models, and evaluate their performance on four widely used ML libraries, with newly-created 83K pairs of natural-language described ML programming tasks. Our empirical study reveals some good, bad, and missing aspects of neural code generation models on ML tasks, with a few major ones listed below. (Good) Neural code generation models perform significantly better on ML tasks than on non-ML tasks. (Bad) Most of the generated code is semantically incorrect. (Bad) Code generation models cannot significantly improve developers' completion time. (Good) The generated code can help developers write more correct code by providing developers with clues for using correct APIs. (Missing) The observation from our user study reveals the missing aspects of code generation for ML tasks, e.g., decomposing code generation for divide-and-conquer into two tasks: API sequence identification and API usage generation. ",
    "url": "https://arxiv.org/abs/2305.09082",
    "authors": [
      "Jiho Shin",
      "Moshi Wei",
      "Junjie Wang",
      "Lin Shi",
      "Song Wang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2305.09084",
    "title": "A Review of Data-driven Approaches for Malicious Website Detection",
    "abstract": "The detection of malicious websites has become a critical issue in cybersecurity. Therefore, this paper offers a comprehensive review of data-driven methods for detecting malicious websites. Traditional approaches and their limitations are discussed, followed by an overview of data-driven approaches. The paper establishes the data-feature-model-extension pipeline and the latest research developments of data-driven approaches, including data preprocessing, feature extraction, model construction and technology extension. Specifically, this paper compares methods using deep learning models proposed in recent years. Furthermore, the paper follows the data-feature-model-extension pipeline to discuss the challenges together with some future directions of data-driven methods in malicious website detection. ",
    "url": "https://arxiv.org/abs/2305.09084",
    "authors": [
      "Zeyuan Hu",
      "Ziang Yuan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09088",
    "title": "The Hessian perspective into the Nature of Convolutional Neural Networks",
    "abstract": "While Convolutional Neural Networks (CNNs) have long been investigated and applied, as well as theorized, we aim to provide a slightly different perspective into their nature -- through the perspective of their Hessian maps. The reason is that the loss Hessian captures the pairwise interaction of parameters and therefore forms a natural ground to probe how the architectural aspects of CNN get manifested in its structure and properties. We develop a framework relying on Toeplitz representation of CNNs, and then utilize it to reveal the Hessian structure and, in particular, its rank. We prove tight upper bounds (with linear activations), which closely follow the empirical trend of the Hessian rank and hold in practice in more general settings. Overall, our work generalizes and establishes the key insight that, even in CNNs, the Hessian rank grows as the square root of the number of parameters. ",
    "url": "https://arxiv.org/abs/2305.09088",
    "authors": [
      "Sidak Pal Singh",
      "Thomas Hofmann",
      "Bernhard Schölkopf"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.09089",
    "title": "Adaptive Network Embedding with Arbitrary Multiple Information Sources  in Attributed Graphs",
    "abstract": "Graph representation learning (a.k.a. network embedding) is a significant topic of network analysis, due to its effectiveness to support various graph inference tasks. In this paper, we study the representation learning with multiple information sources in attributed graphs. Recent studies usually focus on several specific sources (e.g., high-order proximity and node attributes) but few of them can be extended to incorporate other available sources not specified. In addition, most existing methods assume that all the integrated sources share consistent latent features but may ignore the possible inconsistency among them, lacking the required robustness. To address these issues, we propose a novel adaptive hybrid graph representation (AHGR) method from a view of graph reweighting, where each information source is formulated as a corresponding auxiliary graph, enabling AHGR to integrate arbitrary available information sources. Moreover, a new transition relation among the reweighted graphs is then introduced to perceive and resist the possible inconsistency among multiple sources, enhancing the robustness of AHGR. We verify the effectiveness of AHGR on a series of synthetic and real attributed graphs, where it presents superior performance over other baselines. ",
    "url": "https://arxiv.org/abs/2305.09089",
    "authors": [
      "Meng Qin"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.09092",
    "title": "ProtoVAE: Prototypical Networks for Unsupervised Disentanglement",
    "abstract": "Generative modeling and self-supervised learning have in recent years made great strides towards learning from data in a completely unsupervised way. There is still however an open area of investigation into guiding a neural network to encode the data into representations that are interpretable or explainable. The problem of unsupervised disentanglement is of particular importance as it proposes to discover the different latent factors of variation or semantic concepts from the data alone, without labeled examples, and encode them into structurally disjoint latent representations. Without additional constraints or inductive biases placed in the network, a generative model may learn the data distribution and encode the factors, but not necessarily in a disentangled way. Here, we introduce a novel deep generative VAE-based model, ProtoVAE, that leverages a deep metric learning Prototypical network trained using self-supervision to impose these constraints. The prototypical network constrains the mapping of the representation space to data space to ensure that controlled changes in the representation space are mapped to changes in the factors of variations in the data space. Our model is completely unsupervised and requires no a priori knowledge of the dataset, including the number of factors. We evaluate our proposed model on the benchmark dSprites, 3DShapes, and MPI3D disentanglement datasets, showing state of the art results against previous methods via qualitative traversals in the latent space, as well as quantitative disentanglement metrics. We further qualitatively demonstrate the effectiveness of our model on the real-world CelebA dataset. ",
    "url": "https://arxiv.org/abs/2305.09092",
    "authors": [
      "Vaishnavi Patil",
      "Matthew Evanusa",
      "Joseph JaJa"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.09101",
    "title": "Automatic learning algorithm selection for classification via  convolutional neural networks",
    "abstract": "As in any other task, the process of building machine learning models can benefit from prior experience. Meta-learning for classifier selection gains knowledge from characteristics of different datasets and/or previous performance of machine learning techniques to make better decisions for the current modeling process. Meta-learning approaches first collect meta-data that describe this prior experience and then use it as input for an algorithm selection model. In this paper, however, we propose an automatic learning scheme in which we train convolutional networks directly with the information of tabular datasets for binary classification. The goal of this study is to learn the inherent structure of the data without identifying meta-features. Experiments with simulated datasets show that the proposed approach achieves nearly perfect performance in identifying linear and nonlinear patterns, outperforming the traditional two-step method based on meta-features. The proposed method is then applied to real-world datasets, making suggestions about the best classifiers that can be considered based on the structure of the data. ",
    "url": "https://arxiv.org/abs/2305.09101",
    "authors": [
      "Sebastian Maldonado",
      "Carla Vairetti",
      "Ignacio Figueroa"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09116",
    "title": "Smooth Robustness Measures for Symbolic Control Via Signal Temporal  Logic",
    "abstract": "Symbolic control problems aim to synthesize control policies for dynamical systems under complex temporal specifications. For such problems, Signal Temporal Logic (STL) is increasingly used as the formal specification language due to its rich expressiveness. Moreover, the degree of satisfaction of STL specifications can be evaluated using ``STL robust semantics'' as a scalar robustness measure. This capability of STL enables transforming a symbolic control problem into an optimization problem that optimizes the corresponding robustness measure. However, since these robustness measures are non-smooth and non-convex, exact solutions can only be computed using computationally inefficient mixed-integer programming techniques that do not scale well. Therefore, recent literature has focused on using smooth approximations of these robustness measures to apply scalable and computationally efficient gradient-based methods to find local optima solutions. In this paper, we first generalize two recently established smooth robustness measures (SRMs) and two new ones and discuss their strengths and weaknesses. Next, we propose ``STL error semantics'' to characterize the approximation errors associated with different SRMs under different parameter configurations. This allows one to sensibly select an SRM (to optimize) along with its parameter values. We then propose ``STL gradient semantics'' to derive explicit gradients of SRMs leading to improve computational efficiency as well as accuracy compared to when using numerically estimated gradients. Finally, these contributions are highlighted using extensive simulation results. ",
    "url": "https://arxiv.org/abs/2305.09116",
    "authors": [
      "Shirantha Welikala",
      "Hai Lin",
      "Panos J. Antsaklis"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.09125",
    "title": "A deep learning method for multi-material diffusion problems based on  physics-informed neural networks",
    "abstract": "Given the facts of the extensiveness of multi-material diffusion problems and the inability of the standard PINN(Physics-Informed Neural Networks) method for such problems, in this paper we present a novel PINN method that can accurately solve the multi-material diffusion equation. The new method applies continuity conditions at the material interface derived from the property of the diffusion equation, and combines the distinctive spatial separation strategy and the loss term normalization strategy to solve the problem that the residual points cannot be arranged at the material interface, the problem that it is difficult to express non-smooth functions with a single neural network, and the problem that the neural network is difficult to optimize the loss function with different magnitudes of loss terms, which finally provides the available prediction function for a class of multi-material diffusion problems. Numerical experiments verify the robustness and effectiveness of the new method. ",
    "url": "https://arxiv.org/abs/2305.09125",
    "authors": [
      "Yanzhong Yao",
      "Jiawei Guo",
      "Tongxiang Gu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2305.09126",
    "title": "Transfer Causal Learning: Causal Effect Estimation with Knowledge  Transfer",
    "abstract": "A novel problem of improving causal effect estimation accuracy with the help of knowledge transfer under the same covariate (or feature) space setting, i.e., homogeneous transfer learning (TL), is studied, referred to as the Transfer Causal Learning (TCL) problem. While most recent efforts in adapting TL techniques to estimate average causal effect (ACE) have been focused on the heterogeneous covariate space setting, those methods are inadequate for tackling the TCL problem since their algorithm designs are based on the decomposition into shared and domain-specific covariate spaces. To address this issue, we propose a generic framework called \\texttt{$\\ell_1$-TCL}, which incorporates $\\ell_1$ regularized TL for nuisance parameter estimation and downstream plug-in ACE estimators, including outcome regression, inverse probability weighted, and doubly robust estimators. Most importantly, with the help of Lasso for high-dimensional regression, we establish non-asymptotic recovery guarantees for the generalized linear model (GLM) under the sparsity assumption for the proposed \\texttt{$\\ell_1$-TCL}. Moreover, the success of \\texttt{$\\ell_1$-TCL} could inspire the adaptations of many recently proposed principled approaches in statistics literature to be adapted to this novel TCL problem. From an empirical perspective, \\texttt{$\\ell_1$-TCL} is a generic learning framework that can incorporate not only GLM but also many recently developed non-parametric methods, which can enhance robustness to model mis-specification. We demonstrate this empirical benefit through extensive experiments using GLM and recent neural network based \\texttt{$\\ell_1$-TCL} on both benchmark semi-synthetic and real datasets, which shows improved performance compared with existing TL approaches for ACE estimation. ",
    "url": "https://arxiv.org/abs/2305.09126",
    "authors": [
      "Song Wei",
      "Ronald Moore",
      "Hanyu Zhang",
      "Yao Xie",
      "Rishikesan Kamaleswaran"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)",
      "Methodology (stat.ME)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.09129",
    "title": "Graph Reinforcement Learning for Network Control via Bi-Level  Optimization",
    "abstract": "Optimization problems over dynamic networks have been extensively studied and widely used in the past decades to formulate numerous real-world problems. However, (1) traditional optimization-based approaches do not scale to large networks, and (2) the design of good heuristics or approximation algorithms often requires significant manual trial-and-error. In this work, we argue that data-driven strategies can automate this process and learn efficient algorithms without compromising optimality. To do so, we present network control problems through the lens of reinforcement learning and propose a graph network-based framework to handle a broad class of problems. Instead of naively computing actions over high-dimensional graph elements, e.g., edges, we propose a bi-level formulation where we (1) specify a desired next state via RL, and (2) solve a convex program to best achieve it, leading to drastically improved scalability and performance. We further highlight a collection of desirable features to system designers, investigate design decisions, and present experiments on real-world control problems showing the utility, scalability, and flexibility of our framework. ",
    "url": "https://arxiv.org/abs/2305.09129",
    "authors": [
      "Daniele Gammelli",
      "James Harrison",
      "Kaidi Yang",
      "Marco Pavone",
      "Filipe Rodrigues",
      "Francisco C. Pereira"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2305.09132",
    "title": "DualGenerator: Information Interaction-based Generative Network for  Point Cloud Completion",
    "abstract": "Point cloud completion estimates complete shapes from incomplete point clouds to obtain higher-quality point cloud data. Most existing methods only consider global object features, ignoring spatial and semantic information of adjacent points. They cannot distinguish structural information well between different object parts, and the robustness of models is poor. To tackle these challenges, we propose an information interaction-based generative network for point cloud completion ($\\mathbf{DualGenerator}$). It contains an adversarial generation path and a variational generation path, which interact with each other and share weights. DualGenerator introduces a local refinement module in generation paths, which captures general structures from partial inputs, and then refines shape details of the point cloud. It promotes completion in the unknown region and makes a distinction between different parts more obvious. Moreover, we design DGStyleGAN to improve the generation quality further. It promotes the robustness of this network combined with fusion analysis of dual-path completion results. Qualitative and quantitative evaluations demonstrate that our method is superior on MVP and Completion3D datasets. The performance will not degrade significantly after adding noise interference or sparse sampling. ",
    "url": "https://arxiv.org/abs/2305.09132",
    "authors": [
      "Pengcheng Shi",
      "Haozhe Cheng",
      "Xu Han",
      "Yiyang Zhou",
      "Jihua Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.09145",
    "title": "Deep ReLU Networks Have Surprisingly Simple Polytopes",
    "abstract": "A ReLU network is a piecewise linear function over polytopes. Figuring out the properties of such polytopes is of fundamental importance for the research and development of neural networks. So far, either theoretical or empirical studies on polytopes only stay at the level of counting their number, which is far from a complete characterization of polytopes. To upgrade the characterization to a new level, here we propose to study the shapes of polytopes via the number of simplices obtained by triangulating the polytope. Then, by computing and analyzing the histogram of simplices across polytopes, we find that a ReLU network has relatively simple polytopes under both initialization and gradient descent, although these polytopes theoretically can be rather diverse and complicated. This finding can be appreciated as a novel implicit bias. Next, we use nontrivial combinatorial derivation to theoretically explain why adding depth does not create a more complicated polytope by bounding the average number of faces of polytopes with a function of the dimensionality. Our results concretely reveal what kind of simple functions a network learns and its space partition property. Also, by characterizing the shape of polytopes, the number of simplices be a leverage for other problems, \\textit{e.g.}, serving as a generic functional complexity measure to explain the power of popular shortcut networks such as ResNet and analyzing the impact of different regularization strategies on a network's space partition. ",
    "url": "https://arxiv.org/abs/2305.09145",
    "authors": [
      "Feng-Lei Fan",
      "Wei Huang",
      "Xiangru Zhong",
      "Lecheng Ruan",
      "Tieyong Zeng",
      "Huan Xiong",
      "Fei Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2305.09147",
    "title": "Self-Aware Trajectory Prediction for Safe Autonomous Driving",
    "abstract": "Trajectory prediction is one of the key components of the autonomous driving software stack. Accurate prediction for the future movement of surrounding traffic participants is an important prerequisite for ensuring the driving efficiency and safety of intelligent vehicles. Trajectory prediction algorithms based on artificial intelligence have been widely studied and applied in recent years and have achieved remarkable results. However, complex artificial intelligence models are uncertain and difficult to explain, so they may face unintended failures when applied in the real world. In this paper, a self-aware trajectory prediction method is proposed. By introducing a self-awareness module and a two-stage training process, the original trajectory prediction module's performance is estimated online, to facilitate the system to deal with the possible scenario of insufficient prediction function in time, and create conditions for the realization of safe and reliable autonomous driving. Comprehensive experiments and analysis are performed, and the proposed method performed well in terms of self-awareness, memory footprint, and real-time performance, showing that it may serve as a promising paradigm for safe autonomous driving. ",
    "url": "https://arxiv.org/abs/2305.09147",
    "authors": [
      "Wenbo Shao",
      "Jun Li",
      "Hong Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.09148",
    "title": "Dual-Alignment Pre-training for Cross-lingual Sentence Embedding",
    "abstract": "Recent studies have shown that dual encoder models trained with the sentence-level translation ranking task are effective methods for cross-lingual sentence embedding. However, our research indicates that token-level alignment is also crucial in multilingual scenarios, which has not been fully explored previously. Based on our findings, we propose a dual-alignment pre-training (DAP) framework for cross-lingual sentence embedding that incorporates both sentence-level and token-level alignment. To achieve this, we introduce a novel representation translation learning (RTL) task, where the model learns to use one-side contextualized token representation to reconstruct its translation counterpart. This reconstruction objective encourages the model to embed translation information into the token representation. Compared to other token-level alignment methods such as translation language modeling, RTL is more suitable for dual encoder architectures and is computationally efficient. Extensive experiments on three sentence-level cross-lingual benchmarks demonstrate that our approach can significantly improve sentence embedding. Our code is available at https://github.com/ChillingDream/DAP. ",
    "url": "https://arxiv.org/abs/2305.09148",
    "authors": [
      "Ziheng Li",
      "Shaohan Huang",
      "Zihan Zhang",
      "Zhi-Hong Deng",
      "Qiang Lou",
      "Haizhen Huang",
      "Jian Jiao",
      "Furu Wei",
      "Weiwei Deng",
      "Qi Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.09154",
    "title": "Progressive Translation: Improving Domain Robustness of Neural Machine  Translation with Intermediate Sequences",
    "abstract": "Previous studies show that intermediate supervision signals benefit various Natural Language Processing tasks. However, it is not clear whether there exist intermediate signals that benefit Neural Machine Translation (NMT). Borrowing techniques from Statistical Machine Translation, we propose intermediate signals which are intermediate sequences from the \"source-like\" structure to the \"target-like\" structure. Such intermediate sequences introduce an inductive bias that reflects a domain-agnostic principle of translation, which reduces spurious correlations that are harmful to out-of-domain generalisation. Furthermore, we introduce a full-permutation multi-task learning to alleviate the spurious causal relations from intermediate sequences to the target, which results from exposure bias. The Minimum Bayes Risk decoding algorithm is used to pick the best candidate translation from all permutations to further improve the performance. Experiments show that the introduced intermediate signals can effectively improve the domain robustness of NMT and reduces the amount of hallucinations on out-of-domain translation. Further analysis shows that our methods are especially promising in low-resource scenarios. ",
    "url": "https://arxiv.org/abs/2305.09154",
    "authors": [
      "Chaojun Wang",
      "Yang Liu",
      "Wai Lam"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.09156",
    "title": "Modelling Human Visual Motion Processing with Trainable Motion Energy  Sensing and a Self-attention Network for Adaptive Motion Integration",
    "abstract": "Visual motion processing is essential for organisms to perceive and interact with dynamic environments. Despite extensive research in cognitive neuroscience, image-computable models that can extract informative motion flow from natural scenes in a manner consistent with human visual processing have yet to be established. Meanwhile, recent advancements in computer vision (CV), propelled by deep learning, have led to significant progress in optical flow estimation, a task closely related to motion perception. Here we propose an image-computable model of human motion perception by bridging the gap between human and CV models. Specifically, we introduce a novel two-stage approach that combines trainable motion energy sensing with a recurrent self-attention network for adaptive motion integration and segregation. This model architecture aims to capture the computations in V1-MT, the core structure for motion perception in the biological visual system. In silico neurophysiology reveals that our model's unit responses are similar to mammalian neural recordings regarding motion pooling and speed tuning. The proposed model can also replicate human responses to a range of stimuli examined in past psychophysical studies. The experimental results on the Sintel benchmark demonstrate that our model predicts human responses better than the ground truth, whereas the CV models show the opposite. Further partial correlation analysis indicates our model outperforms several state-of-the-art CV models in explaining the human responses that deviate from the ground truth. Our study provides a computational architecture consistent with human visual motion processing, although the physiological correspondence may not be exact. ",
    "url": "https://arxiv.org/abs/2305.09156",
    "authors": [
      "Zitang Sun",
      "Yen-Ju Chen",
      "Yung-hao Yang",
      "Shin'ya Nishida"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2305.09167",
    "title": "Adversarial Speaker Disentanglement Using Unannotated External Data for  Self-supervised Representation Based Voice Conversion",
    "abstract": "Nowadays, recognition-synthesis-based methods have been quite popular with voice conversion (VC). By introducing linguistics features with good disentangling characters extracted from an automatic speech recognition (ASR) model, the VC performance achieved considerable breakthroughs. Recently, self-supervised learning (SSL) methods trained with a large-scale unannotated speech corpus have been applied to downstream tasks focusing on the content information, which is suitable for VC tasks. However, a huge amount of speaker information in SSL representations degrades timbre similarity and the quality of converted speech significantly. To address this problem, we proposed a high-similarity any-to-one voice conversion method with the input of SSL representations. We incorporated adversarial training mechanisms in the synthesis module using external unannotated corpora. Two auxiliary discriminators were trained to distinguish whether a sequence of mel-spectrograms has been converted by the acoustic model and whether a sequence of content embeddings contains speaker information from external corpora. Experimental results show that our proposed method achieves comparable similarity and higher naturalness than the supervised method, which needs a huge amount of annotated corpora for training and is applicable to improve similarity for VC methods with other SSL representations as input. ",
    "url": "https://arxiv.org/abs/2305.09167",
    "authors": [
      "Xintao Zhao",
      "Shuai Wang",
      "Yang Chao",
      "Zhiyong Wu",
      "Helen Meng"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2305.09178",
    "title": "Empirical Analysis of the Inductive Bias of Recurrent Neural Networks by  Discrete Fourier Transform of Output Sequences",
    "abstract": "A unique feature of Recurrent Neural Networks (RNNs) is that it incrementally processes input sequences. In this research, we aim to uncover the inherent generalization properties, i.e., inductive bias, of RNNs with respect to how frequently RNNs switch the outputs through time steps in the sequence classification task, which we call output sequence frequency. Previous work analyzed inductive bias by training models with a few synthetic data and comparing the model's generalization with candidate generalization patterns. However, when examining the output sequence frequency, previous methods cannot be directly applied since enumerating candidate patterns is computationally difficult for longer sequences. To this end, we propose to directly calculate the output sequence frequency for each model by regarding the outputs of the model as discrete-time signals and applying frequency domain analysis. Experimental results showed that Long Short-Term Memory (LSTM) and Gated Recurrent Unit (GRU) have an inductive bias towards lower-frequency patterns, while Elman RNN tends to learn patterns in which the output changes at high frequencies. We also found that the inductive bias of LSTM and GRU varies with the number of layers and the size of hidden layers. ",
    "url": "https://arxiv.org/abs/2305.09178",
    "authors": [
      "Taiga Ishii",
      "Ryo Ueda",
      "Yusuke Miyao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09179",
    "title": "Ortho-ODE: Enhancing Robustness and of Neural ODEs against Adversarial  Attacks",
    "abstract": "Neural Ordinary Differential Equations (NODEs) probed the usage of numerical solvers to solve the differential equation characterized by a Neural Network (NN), therefore initiating a new paradigm of deep learning models with infinite depth. NODEs were designed to tackle the irregular time series problem. However, NODEs have demonstrated robustness against various noises and adversarial attacks. This paper is about the natural robustness of NODEs and examines the cause behind such surprising behaviour. We show that by controlling the Lipschitz constant of the ODE dynamics the robustness can be significantly improved. We derive our approach from Grownwall's inequality. Further, we draw parallels between contractivity theory and Grownwall's inequality. Experimentally we corroborate the enhanced robustness on numerous datasets - MNIST, CIFAR-10, and CIFAR 100. We also present the impact of adaptive and non-adaptive solvers on the robustness of NODEs. ",
    "url": "https://arxiv.org/abs/2305.09179",
    "authors": [
      "Vishal Purohit"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.09195",
    "title": "Correlation Pyramid Network for 3D Single Object Tracking",
    "abstract": "3D LiDAR-based single object tracking (SOT) has gained increasing attention as it plays a crucial role in 3D applications such as autonomous driving. The central problem is how to learn a target-aware representation from the sparse and incomplete point clouds. In this paper, we propose a novel Correlation Pyramid Network (CorpNet) with a unified encoder and a motion-factorized decoder. Specifically, the encoder introduces multi-level self attentions and cross attentions in its main branch to enrich the template and search region features and realize their fusion and interaction, respectively. Additionally, considering the sparsity characteristics of the point clouds, we design a lateral correlation pyramid structure for the encoder to keep as many points as possible by integrating hierarchical correlated features. The output features of the search region from the encoder can be directly fed into the decoder for predicting target locations without any extra matcher. Moreover, in the decoder of CorpNet, we design a motion-factorized head to explicitly learn the different movement patterns of the up axis and the x-y plane together. Extensive experiments on two commonly-used datasets show our CorpNet achieves state-of-the-art results while running in real-time. ",
    "url": "https://arxiv.org/abs/2305.09195",
    "authors": [
      "Mengmeng Wang",
      "Teli Ma",
      "Xingxing Zuo",
      "Jiajun Lv",
      "Yong Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.09199",
    "title": "Machine learning enhanced real-time aerodynamic forces prediction based  on sparse pressure sensor inputs",
    "abstract": "Accurate prediction of aerodynamic forces in real-time is crucial for autonomous navigation of unmanned aerial vehicles (UAVs). This paper presents a data-driven aerodynamic force prediction model based on a small number of pressure sensors located on the surface of UAV. The model is built on a linear term that can make a reasonably accurate prediction and a nonlinear correction for accuracy improvement. The linear term is based on a reduced basis reconstruction of the surface pressure distribution, where the basis is extracted from numerical simulation data and the basis coefficients are determined by solving linear pressure reconstruction equations at a set of sensor locations. Sensor placement is optimized using the discrete empirical interpolation method (DEIM). Aerodynamic forces are computed by integrating the reconstructed surface pressure distribution. The nonlinear term is an artificial neural network (NN) that is trained to bridge the gap between the ground truth and the DEIM prediction, especially in the scenario where the DEIM model is constructed from simulation data with limited fidelity. A large network is not necessary for accurate correction as the linear model already captures the main dynamics of the surface pressure field, thus yielding an efficient DEIM+NN aerodynamic force prediction model. The model is tested on numerical and experimental dynamic stall data of a 2D NACA0015 airfoil, and numerical simulation data of dynamic stall of a 3D drone. Numerical results demonstrate that the machine learning enhanced model can make fast and accurate predictions of aerodynamic forces using only a few pressure sensors, even for the NACA0015 case in which the simulations do not agree well with the wind tunnel experiments. Furthermore, the model is robust to noise. ",
    "url": "https://arxiv.org/abs/2305.09199",
    "authors": [
      "Junming Duan",
      "Qian Wang",
      "Jan S. Hesthaven"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2305.09207",
    "title": "Counterfactual Outcome Prediction using Structured State Space Model",
    "abstract": "Counterfactual outcome prediction in longitudinal data has recently gained attention due to its potential applications in healthcare and social sciences. In this paper, we explore the use of the state space model, a popular sequence model, for this task. Specifically, we compare the performance of two models: Treatment Effect Neural Controlled Differential Equation (TE-CDE) and structured state space model (S4Model). While TE-CDE uses controlled differential equations to address time-dependent confounding, it suffers from optimization issues and slow training. In contrast, S4Model is more efficient at modeling long-range dependencies and easier to train. We evaluate the models on a simulated lung tumor growth dataset and find that S4Model outperforms TE-CDE with 1.63x reduction in per epoch training time and 10x better normalized mean squared error. Additionally, S4Model is more stable during training and less sensitive to weight initialization than TE-CDE. Our results suggest that the state space model may be a promising approach for counterfactual outcome prediction in longitudinal data, with S4Model offering a more efficient and effective alternative to TE-CDE. ",
    "url": "https://arxiv.org/abs/2305.09207",
    "authors": [
      "Vishal Purohit"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2305.09224",
    "title": "Privacy-Preserving Ensemble Infused Enhanced Deep Neural Network  Framework for Edge Cloud Convergence",
    "abstract": "We propose a privacy-preserving ensemble infused enhanced Deep Neural Network (DNN) based learning framework in this paper for Internet-of-Things (IoT), edge, and cloud convergence in the context of healthcare. In the convergence, edge server is used for both storing IoT produced bioimage and hosting DNN algorithm for local model training. The cloud is used for ensembling local models. The DNN-based training process of a model with a local dataset suffers from low accuracy, which can be improved by the aforementioned convergence and Ensemble Learning. The ensemble learning allows multiple participants to outsource their local model for producing a generalized final model with high accuracy. Nevertheless, Ensemble Learning elevates the risk of leaking sensitive private data from the final model. The proposed framework presents a Differential Privacy-based privacy-preserving DNN with Transfer Learning for a local model generation to ensure minimal loss and higher efficiency at edge server. We conduct several experiments to evaluate the performance of our proposed framework. ",
    "url": "https://arxiv.org/abs/2305.09224",
    "authors": [
      "Veronika Stephanie",
      "Ibrahim Khalil",
      "Mohammad Saidur Rahman",
      "Mohammed Atiquzzaman"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.09236",
    "title": "One-shot neural band selection for spectral recovery",
    "abstract": "Band selection has a great impact on the spectral recovery quality. To solve this ill-posed inverse problem, most band selection methods adopt hand-crafted priors or exploit clustering or sparse regularization constraints to find most prominent bands. These methods are either very slow due to the computational cost of repeatedly training with respect to different selection frequencies or different band combinations. Many traditional methods rely on the scene prior and thus are not applicable to other scenarios. In this paper, we present a novel one-shot Neural Band Selection (NBS) framework for spectral recovery. Unlike conventional searching approaches with a discrete search space and a non-differentiable search strategy, our NBS is based on the continuous relaxation of the band selection process, thus allowing efficient band search using gradient descent. To enable the compatibility for se- lecting any number of bands in one-shot, we further exploit the band-wise correlation matrices to progressively suppress similar adjacent bands. Extensive evaluations on the NTIRE 2022 Spectral Reconstruction Challenge demonstrate that our NBS achieves consistent performance gains over competitive baselines when examined with four different spectral recov- ery methods. Our code will be publicly available. ",
    "url": "https://arxiv.org/abs/2305.09236",
    "authors": [
      "Hai-Miao Hu",
      "Zhenbo Xu",
      "Wenshuai Xu",
      "You Song",
      "YiTao Zhang",
      "Liu Liu",
      "Zhilin Han",
      "Ajin Meng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2305.09251",
    "title": "A SKG Security Challenge: Indoor SKG Under an On-The-Shoulder  Eavesdropping Attack",
    "abstract": "Physical layer security (PLS) is seen as the means to enhance physical layer trustworthiness in 6G. This work provides a proof-of-concept for one of the most mature PLS technologies, i.e., secret key generation (SKG) from wireless fading coefficients during the channel's coherence time. As opposed to other works, where only specific parts of the protocol are typically investigated, here, we implement the full SKG chain in four indoor experimental campaigns. In detail, we consider two legitimate nodes, who use the wireless channel to extract secret keys and a malicious node placed in the immediate vicinity of one of them, who acts as a passive eavesdropper. To estimate the final SKG rate we evaluate the conditional min-entropy by taking into account all information available to the eavesdropper. Finally, we use this paper to announce the first ever physical layer security challenge, mirroring practices in cryptography. We call the community to scrutinize the presented results and try to ``break'' our SKG implementation. To this end, we provide, i) the full dataset observed by the eavesdroppers and all algorithms used, ii) $20$ blocks of $16-$byte long ciphertexts, encrypted using AES-256 with $20$ distilled secret keys, and, iii) all codes and software used in our SKG implementation. An attack will be considered successful if any part(s) of the plaintext are successfully retrieved. ",
    "url": "https://arxiv.org/abs/2305.09251",
    "authors": [
      "Amitha Mayya",
      "Miroslav Mitev",
      "Arsenia Chorti",
      "Gerhard Fettweis"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.09252",
    "title": "Social Wormholes: Exploring Preferences and Opportunities for  Distributed and Physically-Grounded Social Connections",
    "abstract": "Ubiquitous computing encapsulates the idea for technology to be interwoven into the fabric of everyday life. As computing blends into everyday physical artifacts, powerful opportunities open up for social connection. Prior connected media objects span a broad spectrum of design combinations. Such diversity suggests that people have varying needs and preferences for staying connected to one another. However, since these designs have largely been studied in isolation, we do not have a holistic understanding around how people would configure and behave within a ubiquitous social ecosystem of physically-grounded artifacts. In this paper, we create a technology probe called Social Wormholes, that lets people configure their own home ecosystem of connected artifacts. Through a field study with 24 participants, we report on patterns of behaviors that emerged naturally in the context of their daily lives and shine a light on how ubiquitous computing could be leveraged for social computing. ",
    "url": "https://arxiv.org/abs/2305.09252",
    "authors": [
      "Joanne Leong",
      "Yuanyang Teng",
      "Xingyu \"Bruce\" Liu",
      "Hanseul Jun",
      "Sven Kratz",
      "Yu Jiang Tham",
      "Andrés Monroy-Hernández",
      "Brian A. Smith",
      "Rajan Vaish"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2305.09257",
    "title": "A new node-shift encoding representation for the travelling salesman  problem",
    "abstract": "This paper presents a new genetic algorithm encoding representation to solve the travelling salesman problem. To assess the performance of the proposed chromosome structure, we compare it with state-of-the-art encoding representations. For that purpose, we use 14 benchmarks of different sizes taken from TSPLIB. Finally, after conducting the experimental study, we report the obtained results and draw our conclusion. ",
    "url": "https://arxiv.org/abs/2305.09257",
    "authors": [
      "Menouar Boulif",
      "Aghiles Gharbi"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2305.09276",
    "title": "Noise robust neural network architecture",
    "abstract": "In which we propose neural network architecture (dune neural network) for recognizing general noisy image without adding any artificial noise in the training data. By representing each free parameter of the network as an uncertainty interval, and applying a linear transformation to each input element, we show that the resulting architecture achieves decent noise robustness when faced with input data with white noise. We apply simple dune neural networks for MNIST dataset and demonstrate that even for very noisy input images which are hard for human to recognize, our approach achieved better test set accuracy than human without dataset augmentation. We also find that our method is robust for many other examples with various background patterns added. ",
    "url": "https://arxiv.org/abs/2305.09276",
    "authors": [
      "Xiong Yunuo",
      "Xiong Hongwei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09281",
    "title": "On the Origins of Bias in NLP through the Lens of the Jim Code",
    "abstract": "In this paper, we trace the biases in current natural language processing (NLP) models back to their origins in racism, sexism, and homophobia over the last 500 years. We review literature from critical race theory, gender studies, data ethics, and digital humanities studies, and summarize the origins of bias in NLP models from these social science perspective. We show how the causes of the biases in the NLP pipeline are rooted in social issues. Finally, we argue that the only way to fix the bias and unfairness in NLP is by addressing the social problems that caused them in the first place and by incorporating social sciences and social scientists in efforts to mitigate bias in NLP models. We provide actionable recommendations for the NLP research community to do so. ",
    "url": "https://arxiv.org/abs/2305.09281",
    "authors": [
      "Fatma Elsafoury",
      "Gavin Abercrombie"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.09287",
    "title": "AdversarialWord Dilution as Text Data Augmentation in Low-Resource  Regime",
    "abstract": "Data augmentation is widely used in text classification, especially in the low-resource regime where a few examples for each class are available during training. Despite the success, generating data augmentations as hard positive examples that may increase their effectiveness is under-explored. This paper proposes an Adversarial Word Dilution (AWD) method that can generate hard positive examples as text data augmentations to train the low-resource text classification model efficiently. Our idea of augmenting the text data is to dilute the embedding of strong positive words by weighted mixing with unknown-word embedding, making the augmented inputs hard to be recognized as positive by the classification model. We adversarially learn the dilution weights through a constrained min-max optimization process with the guidance of the labels. Empirical studies on three benchmark datasets show that AWD can generate more effective data augmentations and outperform the state-of-the-art text data augmentation methods. The additional analysis demonstrates that the data augmentations generated by AWD are interpretable and can flexibly extend to new examples without further training. ",
    "url": "https://arxiv.org/abs/2305.09287",
    "authors": [
      "Junfan Chen",
      "Richong Zhang",
      "Zheyan Luo",
      "Chunming Hu",
      "Yongyi Mao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.09293",
    "title": "Out-of-Distribution Detection for Adaptive Computer Vision",
    "abstract": "It is well known that computer vision can be unreliable when faced with previously unseen imaging conditions. This paper proposes a method to adapt camera parameters according to a normalizing flow-based out-of-distibution detector. A small-scale study is conducted which shows that adapting camera parameters according to this out-of-distibution detector leads to an average increase of 3 to 4 percentage points in mAP, mAR and F1 performance metrics of a YOLOv4 object detector. As a secondary result, this paper also shows that it is possible to train a normalizing flow model for out-of-distribution detection on the COCO dataset, which is larger and more diverse than most benchmarks for out-of-distibution detectors. ",
    "url": "https://arxiv.org/abs/2305.09293",
    "authors": [
      "Simon Kristoffersson Lind",
      "Rudolph Triebel",
      "Luigi Nardi",
      "Volker Krueger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09296",
    "title": "On CSI-Free Multi-Antenna Schemes for Massive Wireless-Powered  Underground Sensor Networks",
    "abstract": "Radio-frequency wireless energy transfer (WET) is a promising technology to realize wireless-powered underground sensor networks (WPUSNs) and enable sustainable underground monitoring. However, due to the severe attenuation in harsh underground soil and the tight energy budget of the underground sensors, traditional WPUSNs relying on the channel state information (CSI) are highly inefficient, especially in massive WET scenarios. To address this challenge, we comparatively assess the feasibility of several state-of-the-art CSI-free multi-antenna WET schemes for WPUSNs, under a given power budget. Moreover, to overcome the extremely low WET efficiency in underground channels, we propose a distributed CSI-free system, where multiple power beacons (PBs) simultaneously charge a large set of underground sensors without any CSI. We consider the position-aware K-Means and the position-agnostic equally-far-from-center (EFFC) approaches for the optimal deployment of the PBs. Our results evince that the performance of the proposed distributed CSI-free system can approach or even surpass that of a traditional full-CSI WET strategy, especially when adopting an appropriate CSI-free scheme, applying the advisable PBs deployment approach, and equipping the PBs with an appropriate number of antennas. Finally, we discuss the impact of underground parameters, i.e., the burial depth of devices and the volumetric water content of soil, on the system's performance, and identify potential challenges and research opportunities for practical distributed CSI-free WPUSNs deployment. ",
    "url": "https://arxiv.org/abs/2305.09296",
    "authors": [
      "Kaiqiang Lin",
      "Onel Luis Alcaraz López",
      "Hirley Alves",
      "Tong Hao"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2305.09312",
    "title": "Exploring the Impact of Layer Normalization for Zero-shot Neural Machine  Translation",
    "abstract": "This paper studies the impact of layer normalization (LayerNorm) on zero-shot translation (ZST). Recent efforts for ZST often utilize the Transformer architecture as the backbone, with LayerNorm at the input of layers (PreNorm) set as the default. However, Xu et al. (2019) has revealed that PreNorm carries the risk of overfitting the training data. Based on this, we hypothesize that PreNorm may overfit supervised directions and thus have low generalizability for ZST. Through experiments on OPUS, IWSLT, and Europarl datasets for 54 ZST directions, we demonstrate that the original Transformer setting of LayerNorm after residual connections (PostNorm) consistently outperforms PreNorm by up to 12.3 BLEU points. We then study the performance disparities by analyzing the differences in off-target rates and structural variations between PreNorm and PostNorm. This study highlights the need for careful consideration of the LayerNorm setting for ZST. ",
    "url": "https://arxiv.org/abs/2305.09312",
    "authors": [
      "Zhuoyuan Mao",
      "Raj Dabre",
      "Qianying Liu",
      "Haiyue Song",
      "Chenhui Chu",
      "Sadao Kurohashi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.09315",
    "title": "Neural Program Repair with Program Dependence Analysis and Effective  Filter Mechanism",
    "abstract": "Automated program repair is a crucial task for improving the efficiency of software developers. Recently, neural-based techniques have demonstrated significant promise in generating correct patches for buggy code snippets. However, most existing approaches arbitrarily treat the buggy context without any analysis to capture the semantic relationship between the buggy statement and its context. Additionally, we observe that existing neural models may output an unaltered patch consistent with the input buggy code snippet, which fails to be the correct human-written one for fixing the given bug. To address the aforementioned limitations, we present in this paper a novel neural program repair framework called \\approach, which adapts the general pre-trained language model for fixing single-line Java bugs. We make the first attempt to use program slicing to extract contextual information directly related to the given buggy statement as repair ingredients from the corresponding program dependence graph and eliminate unaltered patches using an intuitive but effective filter mechanism. We demonstrate the effectiveness of \\approach on five benchmarks when compared with state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2305.09315",
    "authors": [
      "Yuwei Zhang",
      "Ge Li",
      "Zhi Jin",
      "Ying Xing"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2305.09316",
    "title": "Enhancing Keyphrase Extraction from Long Scientific Documents using  Graph Embeddings",
    "abstract": "In this study, we investigate using graph neural network (GNN) representations to enhance contextualized representations of pre-trained language models (PLMs) for keyphrase extraction from lengthy documents. We show that augmenting a PLM with graph embeddings provides a more comprehensive semantic understanding of words in a document, particularly for long documents. We construct a co-occurrence graph of the text and embed it using a graph convolutional network (GCN) trained on the task of edge prediction. We propose a graph-enhanced sequence tagging architecture that augments contextualized PLM embeddings with graph representations. Evaluating on benchmark datasets, we demonstrate that enhancing PLMs with graph embeddings outperforms state-of-the-art models on long documents, showing significant improvements in F1 scores across all the datasets. Our study highlights the potential of GNN representations as a complementary approach to improve PLM performance for keyphrase extraction from long documents. ",
    "url": "https://arxiv.org/abs/2305.09316",
    "authors": [
      "Roberto Martínez-Cruz",
      "Debanjan Mahata",
      "Alvaro J.López-López",
      "José Portela"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.09328",
    "title": "Performance Analysis of NOMA-RIS aided Integrated Navigation and  Communication (INAC) Networks",
    "abstract": "Satellite communication constitutes a promising solution for the sixth generation (6G) wireless networks in terms of providing global communication services. In order to provide a cost-effective satellite network, we propose a novel medium-earth-orbit (MEO) satellite aided integrated-navigation-and-communication (INAC) network. To overcome the severe path loss of MEO satellites, we conceive a network for simultaneous serving navigation and communication for ground users by adopting the non-orthogonal multiple access (NOMA) technique and the reconfigurable intelligent surface technique. Based on the power allocation strategies, communication-oriented (CO-) and navigation-oriented (NO-) INAC scenarios are proposed. We first derive the closed-form expressions for the new channel statistics, outage probability and channel capacity of the INAC-user. For gleaning further insights, the diversity orders and navigation accuracy are evaluated for illustrating the performance of the INAC networks. According to our analysis, when RIS elements are sufficient, the proposed INAC network can perform better than conventional terrestrial communication networks in terms of channel capacity. Numerical results are provided for confirming that the NO-INAC and CO-INAC scenarios have superior performance for communication in the low signal-to-noise-ratio (SNR) regimes and high SNR regimes, respectively, which indicates a hybrid CO/NO-INAC network is preferable. ",
    "url": "https://arxiv.org/abs/2305.09328",
    "authors": [
      "Tianwei Hou",
      "Anna Li"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.09329",
    "title": "BERTTM: Leveraging Contextualized Word Embeddings from Pre-trained  Language Models for Neural Topic Modeling",
    "abstract": "With the development of neural topic models in recent years, topic modelling is playing an increasingly important role in natural language understanding. However, most existing topic models still rely on bag-of-words (BoW) information, either as training input or training target. This limits their ability to capture word order information in documents and causes them to suffer from the out-of-vocabulary (OOV) issue, i.e. they cannot handle unobserved words in new documents. Contextualized word embeddings from pre-trained language models show superiority in the ability of word sense disambiguation and prove to be effective in dealing with OOV words. In this work, we developed a novel neural topic model combining contextualized word embeddings from the pre-trained language model BERT. The model can infer the topic distribution of a document without using any BoW information. In addition, the model can infer the topic distribution of each word in a document directly from the contextualized word embeddings. Experiments on several datasets show that our model outperforms existing topic models in terms of both document classification and topic coherence metrics and can accommodate unseen words from newly arrived documents. Experiments on the NER dataset also show that our model can produce high-quality word topic representations. ",
    "url": "https://arxiv.org/abs/2305.09329",
    "authors": [
      "Zheng Fang",
      "Yulan He",
      "Rob Procter"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.09335",
    "title": "MsPrompt: Multi-step Prompt Learning for Debiasing Few-shot Event  Detection",
    "abstract": "Event detection (ED) is aimed to identify the key trigger words in unstructured text and predict the event types accordingly. Traditional ED models are too data-hungry to accommodate real applications with scarce labeled data. Besides, typical ED models are facing the context-bypassing and disabled generalization issues caused by the trigger bias stemming from ED datasets. Therefore, we focus on the true few-shot paradigm to satisfy the low-resource scenarios. In particular, we propose a multi-step prompt learning model (MsPrompt) for debiasing few-shot event detection, that consists of the following three components: an under-sampling module targeting to construct a novel training set that accommodates the true few-shot setting, a multi-step prompt module equipped with a knowledge-enhanced ontology to leverage the event semantics and latent prior knowledge in the PLMs sufficiently for tackling the context-bypassing problem, and a prototypical module compensating for the weakness of classifying events with sparse data and boost the generalization performance. Experiments on two public datasets ACE-2005 and FewEvent show that MsPrompt can outperform the state-of-the-art models, especially in the strict low-resource scenarios reporting 11.43% improvement in terms of weighted F1-score against the best-performing baseline and achieving an outstanding debiasing performance. ",
    "url": "https://arxiv.org/abs/2305.09335",
    "authors": [
      "Siyuan Wang",
      "Jianming Zheng",
      "Xuejun Hu",
      "Fei Cai",
      "Chengyu Song",
      "Xueshan Luo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.09348",
    "title": "One-Shot Online Testing of Deep Neural Networks Based on Distribution  Shift Detection",
    "abstract": "Neural networks (NNs) are capable of learning complex patterns and relationships in data to make predictions with high accuracy, making them useful for various tasks. However, NNs are both computation-intensive and memory-intensive methods, making them challenging for edge applications. To accelerate the most common operations (matrix-vector multiplication) in NNs, hardware accelerator architectures such as computation-in-memory (CiM) with non-volatile memristive crossbars are utilized. Although they offer benefits such as power efficiency, parallelism, and nonvolatility, they suffer from various faults and variations, both during manufacturing and lifetime operations. This can lead to faulty computations and, in turn, degradation of post-mapping inference accuracy, which is unacceptable for many applications, including safety-critical applications. Therefore, proper testing of NN hardware accelerators is required. In this paper, we propose a \\emph{one-shot} testing approach that can test NNs accelerated on memristive crossbars with only one test vector, making it very suitable for online testing applications. Our approach can consistently achieve $100\\%$ fault coverage across several large topologies with up to $201$ layers and challenging tasks like semantic segmentation. Nevertheless, compared to existing methods, the fault coverage is improved by up to $24\\%$, the memory overhead is only $0.0123$ MB, a reduction of up to $19980\\times$ and the number of test vectors is reduced by $10000\\times$. ",
    "url": "https://arxiv.org/abs/2305.09348",
    "authors": [
      "Soyed Tuhin Ahmed",
      "Mehdi B. Tahoori"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2305.09356",
    "title": "A Dynamically Similar Lab-Scale District Heating Network via Dimensional  Analysis",
    "abstract": "Strict user demands and large variability in external disturbances, along with limited richness in the data collected on the daily operating conditions of district heating networks makes the design and testing of novel energy-reducing control algorithms for district heating networks challenging. This paper presents the development of a dynamically similar lab-scale district heating network that can be used as a test bench for such control algorithms. This test bench is developed using the Buckingham pi theorem to the match the lab-scale components to the full-scale. By retaining the relative thermodynamics and fluid dynamics of a full-scale network in the lab-scale system, the experimental setup allows for repeatability of the experiments being performed and flexibility in the testing conditions. Moreover, the down-scaling of the experiment is leveraged to accelerate testing, allowing for the recreation of operating periods of weeks and months in hours and days. A PID controller is implemented on the lab-scale test bench to validate its response against literature data. Results show 63% efficiency during heating operations compared to 70% efficiency for a similar full-scale system, with comparable pressure losses across the system. ",
    "url": "https://arxiv.org/abs/2305.09356",
    "authors": [
      "Audrey Blizard",
      "Stephanie Stockar"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.09359",
    "title": "Constructing and Interpreting Causal Knowledge Graphs from News",
    "abstract": "Many jobs rely on news to learn about causal events in the past and present, to make informed decisions and predictions about the future. With the ever-increasing amount of news and text available on the internet, there is a need to automate the extraction of causal events from unstructured texts. In this work, we propose a methodology to construct causal knowledge graphs (KGs) from news using two steps: (1) Extraction of Causal Relations, and (2) Argument Clustering and Representation into KG. We aim to build graphs that emphasize on recall, precision and interpretability. For extraction, although many earlier works already construct causal KGs from text, most adopt rudimentary pattern-based methods. We close this gap by using the latest BERT-based extraction models alongside pattern-based ones. As a result, we achieved a high recall, while still maintaining a high precision. For clustering, we utilized a topic modelling approach to cluster our arguments, so as to increase the connectivity of our graph. As a result, instead of 15,686 disconnected subgraphs, we were able to obtain 1 connected graph that enables users to infer more causal relationships from. Our final KG effectively captures and conveys causal relationships, validated through multiple use cases and user feedback. ",
    "url": "https://arxiv.org/abs/2305.09359",
    "authors": [
      "Fiona Anting Tan",
      "Debdeep Paul",
      "Sahim Yamaura",
      "Miura Koji",
      "See-Kiong Ng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.09366",
    "title": "Evaluation of self-supervised pre-training for automatic infant movement  classification using wearable movement sensors",
    "abstract": "The recently-developed infant wearable MAIJU provides a means to automatically evaluate infants' motor performance in an objective and scalable manner in out-of-hospital settings. This information could be used for developmental research and to support clinical decision-making, such as detection of developmental problems and guiding of their therapeutic interventions. MAIJU-based analyses rely fully on the classification of infant's posture and movement; it is hence essential to study ways to increase the accuracy of such classifications, aiming to increase the reliability and robustness of the automated analysis. Here, we investigated how self-supervised pre-training improves performance of the classifiers used for analyzing MAIJU recordings, and we studied whether performance of the classifier models is affected by context-selective quality-screening of pre-training data to exclude periods of little infant movement or with missing sensors. Our experiments show that i) pre-training the classifier with unlabeled data leads to a robust accuracy increase of subsequent classification models, and ii) selecting context-relevant pre-training data leads to substantial further improvements in the classifier performance. ",
    "url": "https://arxiv.org/abs/2305.09366",
    "authors": [
      "Einari Vaaras",
      "Manu Airaksinen",
      "Sampsa Vanhatalo",
      "Okko Räsänen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.09373",
    "title": "Multi-task convolutional neural network for image aesthetic assessment",
    "abstract": "As people's aesthetic preferences for images are far from understood, image aesthetic assessment is a challenging artificial intelligence task. The range of factors underlying this task is almost unlimited, but we know that some aesthetic attributes affect those preferences. In this study, we present a multi-task convolutional neural network that takes into account these attributes. The proposed neural network jointly learns the attributes along with the overall aesthetic scores of images. This multi-task learning framework allows for effective generalization through the utilization of shared representations. Our experiments demonstrate that the proposed method outperforms the state-of-the-art approaches in predicting overall aesthetic scores for images in one benchmark of image aesthetics. We achieve near-human performance in terms of overall aesthetic scores when considering the Spearman's rank correlations. Moreover, our model pioneers the application of multi-tasking in another benchmark, serving as a new baseline for future research. Notably, our approach achieves this performance while using fewer parameters compared to existing multi-task neural networks in the literature, and consequently makes our method more efficient in terms of computational complexity. ",
    "url": "https://arxiv.org/abs/2305.09373",
    "authors": [
      "Derya Soydaner",
      "Johan Wagemans"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09397",
    "title": "EXPRESSNET: An Explainable Residual Slim Network for Fingerprint  Presentation Attack Detection",
    "abstract": "Presentation attack is a challenging issue that persists in the security of automatic fingerprint recognition systems. This paper proposes a novel explainable residual slim network that detects the presentation attack by representing the visual features in the input fingerprint sample. The encoder-decoder of this network along with the channel attention block converts the input sample into its heatmap representation while the modified residual convolutional neural network classifier discriminates between live and spoof fingerprints. The entire architecture of the heatmap generator block and modified ResNet classifier works together in an end-to-end manner. The performance of the proposed model is validated on benchmark liveness detection competition databases i.e. Livdet 2011, 2013, 2015, 2017, and 2019 and the classification accuracy of 96.86\\%, 99.84\\%, 96.45\\%, 96.07\\%, 96.27\\% are achieved on them, respectively. The performance of the proposed model is compared with the state-of-the-art techniques, and the proposed method outperforms state-of-the-art methods in benchmark protocols of presentation attack detection in terms of classification accuracy. ",
    "url": "https://arxiv.org/abs/2305.09397",
    "authors": [
      "Anuj Rai",
      "Somnath Dey",
      "Pradeep Patidar",
      "Prakhar Rai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.09401",
    "title": "Diffusion Dataset Generation: Towards Closing the Sim2Real Gap for  Pedestrian Detection",
    "abstract": "We propose a method that augments a simulated dataset using diffusion models to improve the performance of pedestrian detection in real-world data. The high cost of collecting and annotating data in the real-world has motivated the use of simulation platforms to create training datasets. While simulated data is inexpensive to collect and annotate, it unfortunately does not always closely match the distribution of real-world data, which is known as the sim2real gap. In this paper we propose a novel method of synthetic data creation meant to close the sim2real gap for the challenging pedestrian detection task. Our method uses a diffusion-based architecture to learn a real-world distribution which, once trained, is used to generate datasets. We mix this generated data with simulated data as a form of augmentation and show that training on a combination of generated and simulated data increases average precision by as much as 27.3% for pedestrian detection models in real-world data, compared against training on purely simulated data. ",
    "url": "https://arxiv.org/abs/2305.09401",
    "authors": [
      "Andrew Farley",
      "Mohsen Zand",
      "Michael Greenspan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.09402",
    "title": "A Preliminary Analysis on the Code Generation Capabilities of GPT-3.5  and Bard AI Models for Java Functions",
    "abstract": "This paper evaluates the capability of two state-of-the-art artificial intelligence (AI) models, GPT-3.5 and Bard, in generating Java code given a function description. We sourced the descriptions from CodingBat.com, a popular online platform that provides practice problems to learn programming. We compared the Java code generated by both models based on correctness, verified through the platform's own test cases. The results indicate clear differences in the capabilities of the two models. GPT-3.5 demonstrated superior performance, generating correct code for approximately 90.6% of the function descriptions, whereas Bard produced correct code for 53.1% of the functions. While both models exhibited strengths and weaknesses, these findings suggest potential avenues for the development and refinement of more advanced AI-assisted code generation tools. The study underlines the potential of AI in automating and supporting aspects of software development, although further research is required to fully realize this potential. ",
    "url": "https://arxiv.org/abs/2305.09402",
    "authors": [
      "Giuseppe Destefanis",
      "Silvia Bartolucci",
      "Marco Ortu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.09407",
    "title": "A Novel Strategy for Improving Robustness in Computer Vision  Manufacturing Defect Detection",
    "abstract": "Visual quality inspection in high performance manufacturing can benefit from automation, due to cost savings and improved rigor. Deep learning techniques are the current state of the art for generic computer vision tasks like classification and object detection. Manufacturing data can pose a challenge for deep learning because data is highly repetitive and there are few images of defects or deviations to learn from. Deep learning models trained with such data can be fragile and sensitive to context, and can under-detect new defects not found in the training data. In this work, we explore training defect detection models to learn specific defects out of context, so that they are more likely to be detected in new situations. We demonstrate how models trained on diverse images containing a common defect type can pick defects out in new circumstances. Such generic models could be more robust to new defects not found data collected for training, and can reduce data collection impediments to implementing visual inspection on production lines. Additionally, we demonstrate that object detection models trained to predict a label and bounding box outperform classifiers that predict a label only on held out test data typical of manufacturing inspection tasks. Finally, we studied the factors that affect generalization in order to train models that work under a wider range of conditions. ",
    "url": "https://arxiv.org/abs/2305.09407",
    "authors": [
      "Ahmad Mohamad Mezher",
      "Andrew E. Marble"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.09408",
    "title": "Numerical solution of Poisson partial differential equations in high  dimension using deep neural networks",
    "abstract": "The aim of this article is to analyze numerical schemes using two-layer neural networks with infinite width for the resolution of the high-dimensional Poisson-Neumann partial differential equations (PDEs) with Neumann boundary conditions. Using Barron's representation of the solution with a measure of probability, the energy is minimized thanks to a gradient curve dynamic on the $2$ Wasserstein space of parameters defining the neural network. Inspired by the work from Bach and Chizat, we prove that if the gradient curve converges, then the represented function is the solution of the elliptic equation considered. Numerical experiments are given to show the potential of the method. ",
    "url": "https://arxiv.org/abs/2305.09408",
    "authors": [
      "Mathias Dus",
      "Virginie Ehrlacher"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Analysis of PDEs (math.AP)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2305.09424",
    "title": "Unwrapping All ReLU Networks",
    "abstract": "Deep ReLU Networks can be decomposed into a collection of linear models, each defined in a region of a partition of the input space. This paper provides three results extending this theory. First, we extend this linear decompositions to Graph Neural networks and tensor convolutional networks, as well as networks with multiplicative interactions. Second, we provide proofs that neural networks can be understood as interpretable models such as Multivariate Decision trees and logical theories. Finally, we show how this model leads to computing cheap and exact SHAP values. We validate the theory through experiments with on Graph Neural Networks. ",
    "url": "https://arxiv.org/abs/2305.09424",
    "authors": [
      "Mattia Jacopo Villani",
      "Peter McBurney"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09446",
    "title": "Probabilistic Distance-Based Outlier Detection",
    "abstract": "The scores of distance-based outlier detection methods are difficult to interpret, making it challenging to determine a cut-off threshold between normal and outlier data points without additional context. We describe a generic transformation of distance-based outlier scores into interpretable, probabilistic estimates. The transformation is ranking-stable and increases the contrast between normal and outlier data points. Determining distance relationships between data points is necessary to identify the nearest-neighbor relationships in the data, yet, most of the computed distances are typically discarded. We show that the distances to other data points can be used to model distance probability distributions and, subsequently, use the distributions to turn distance-based outlier scores into outlier probabilities. Our experiments show that the probabilistic transformation does not impact detection performance over numerous tabular and image benchmark datasets but results in interpretable outlier scores with increased contrast between normal and outlier samples. Our work generalizes to a wide range of distance-based outlier detection methods, and because existing distance computations are used, it adds no significant computational overhead. ",
    "url": "https://arxiv.org/abs/2305.09446",
    "authors": [
      "David Muhr",
      "Michael Affenzeller",
      "Josef Küng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2305.09452",
    "title": "A sequential transit network design algorithm with optimal learning  under correlated beliefs",
    "abstract": "Mobility service route design requires potential demand information to well accommodate travel demand within the service region. Transit planners and operators can access various data sources including household travel survey data and mobile device location logs. However, when implementing a mobility system with emerging technologies, estimating demand level becomes harder because of more uncertainties with user behaviors. Therefore, this study proposes an artificial intelligence-driven algorithm that combines sequential transit network design with optimal learning. An operator gradually expands its route system to avoid risks from inconsistency between designed routes and actual travel demand. At the same time, observed information is archived to update the knowledge that the operator currently uses. Three learning policies are compared within the algorithm: multi-armed bandit, knowledge gradient, and knowledge gradient with correlated beliefs. For validation, a new route system is designed on an artificial network based on public use microdata areas in New York City. Prior knowledge is reproduced from the regional household travel survey data. The results suggest that exploration considering correlations can achieve better performance compared to greedy choices in general. In future work, the problem may incorporate more complexities such as demand elasticity to travel time, no limitations to the number of transfers, and costs for expansion. ",
    "url": "https://arxiv.org/abs/2305.09452",
    "authors": [
      "Gyugeun Yoon",
      "Joseph Y. J. Chow"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2305.09454",
    "title": "Rethinking the editing of generative adversarial networks: a method to  estimate editing vectors based on dimension reduction",
    "abstract": "While Generative Adversarial Networks (GANs) have recently found applications in image editing, most previous GAN-based image editing methods require largescale datasets with semantic segmentation annotations for training, only provide high level control, or merely interpolate between different images. Previous researchers have proposed EditGAN for high-quality, high-precision semantic image editing with limited semantic annotations by finding `editing vectors'. However, it is noticed that there are many features that are not highly associated with semantics, and EditGAN may fail on them. Based on the orthogonality of latent space observed by EditGAN, we propose a method to estimate editing vectors that do not rely on semantic segmentation nor differentiable feature estimation network. Our method assumes that there is a correlation between the intensity distribution of features and the distribution of hidden vectors, and estimates the relationship between the above distributions by sampling the feature intensity of the image corresponding to several hidden vectors. We modified Linear Discriminant Analysis (LDA) to deal with both binary feature editing and continuous feature editing. We then found that this method has a good effect in processing features such as clothing type and texture, skin color and hair. ",
    "url": "https://arxiv.org/abs/2305.09454",
    "authors": [
      "Yuhan Cao",
      "Haoran Jiang",
      "Zhenghong Yu",
      "Qi Li",
      "Xuyang Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09464",
    "title": "Growing and Serving Large Open-domain Knowledge Graphs",
    "abstract": "Applications of large open-domain knowledge graphs (KGs) to real-world problems pose many unique challenges. In this paper, we present extensions to Saga our platform for continuous construction and serving of knowledge at scale. In particular, we describe a pipeline for training knowledge graph embeddings that powers key capabilities such as fact ranking, fact verification, a related entities service, and support for entity linking. We then describe how our platform, including graph embeddings, can be leveraged to create a Semantic Annotation service that links unstructured Web documents to entities in our KG. Semantic annotation of the Web effectively expands our knowledge graph with edges to open-domain Web content which can be used in various search and ranking problems. Finally, we leverage annotated Web documents to drive Open-domain Knowledge Extraction. This targeted extraction framework identifies important coverage issues in the KG, then finds relevant data sources for target entities on the Web and extracts missing information to enrich the KG. Finally, we describe adaptations to our knowledge platform needed to construct and serve private personal knowledge on-device. This includes private incremental KG construction, cross-device knowledge sync, and global knowledge enrichment. ",
    "url": "https://arxiv.org/abs/2305.09464",
    "authors": [
      "Ihab F. Ilyas",
      "JP Lacerda",
      "Yunyao Li",
      "Umar Farooq Minhas",
      "Ali Mousavi",
      "Jeffrey Pound",
      "Theodoros Rekatsinas",
      "Chiraag Sumanth"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2305.09475",
    "title": "Reconstruction-based LSTM-Autoencoder for Anomaly-based DDoS Attack  Detection over Multivariate Time-Series Data",
    "abstract": "A Distributed Denial-of-service (DDoS) attack is a malicious attempt to disrupt the regular traffic of a targeted server, service, or network by sending a flood of traffic to overwhelm the target or its surrounding infrastructure. As technology improves, new attacks have been developed by hackers. Traditional statistical and shallow machine learning techniques can detect superficial anomalies based on shallow data and feature selection, however, these approaches cannot detect unseen DDoS attacks. In this context, we propose a reconstruction-based anomaly detection model named LSTM-Autoencoder (LSTM-AE) which combines two deep learning-based models for detecting DDoS attack anomalies. The proposed structure of long short-term memory (LSTM) networks provides units that work with each other to learn the long short-term correlation of data within a time series sequence. Autoencoders are used to identify the optimal threshold based on the reconstruction error rates evaluated on each sample across all time-series sequences. As such, a combination model LSTM-AE can not only learn delicate sub-pattern differences in attacks and benign traffic flows, but also minimize reconstructed benign traffic to obtain a lower range reconstruction error, with attacks presenting a larger reconstruction error. In this research, we trained and evaluated our proposed LSTM-AE model on reflection-based DDoS attacks (DNS, LDAP, and SNMP). The results of our experiments demonstrate that our method performs better than other state-of-the-art methods, especially for LDAP attacks, with an accuracy of over 99. ",
    "url": "https://arxiv.org/abs/2305.09475",
    "authors": [
      "Yuanyuan Wei",
      "Julian Jang-Jaccard",
      "Fariza Sabrina",
      "Wen Xu",
      "Seyit Camtepe",
      "Aeryn Dunmore"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09476",
    "title": "ANALYSE -- Learning to Attack Cyber-Physical Energy Systems With  Intelligent Agents",
    "abstract": "The ongoing penetration of energy systems with information and communications technology (ICT) and the introduction of new markets increase the potential for malicious or profit-driven attacks that endanger system stability. To ensure security-of-supply, it is necessary to analyze such attacks and their underlying vulnerabilities, to develop countermeasures and improve system design. We propose ANALYSE, a machine-learning-based software suite to let learning agents autonomously find attacks in cyber-physical energy systems, consisting of the power system, ICT, and energy markets. ANALYSE is a modular, configurable, and self-documenting framework designed to find yet unknown attack types and to reproduce many known attack strategies in cyber-physical energy systems from the scientific literature. ",
    "url": "https://arxiv.org/abs/2305.09476",
    "authors": [
      "Thomas Wolgast",
      "Nils Wenninghoff",
      "Stephan Balduin",
      "Eric Veith",
      "Bastian Fraune",
      "Torben Woltjen",
      "Astrid Nieße"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.09493",
    "title": "Experiences in Building a Composable and Functional API for Runtime  SPIR-V Code Generation",
    "abstract": "This paper presents the Beehive SPIR-V Toolkit; a framework that can automatically generate a Java composable and functional library for dynamically building SPIR-V binary modules. The Beehive SPIR-V Toolkit can be used by optimizing compilers and runtime systems to generate and validate SPIR-V binary modules from managed runtime systems, such as the Java Virtual Machine (JVM). Furthermore, our framework is architected to accommodate new SPIR-V releases in an easy-to-maintain manner, and it facilitates the automatic generation of Java libraries for other standards, besides SPIR-V. The Beehive SPIR-V Toolkit also includes an assembler that emits SPIR-V binary modules from disassembled SPIR-V text files, and a disassembler that converts the SPIR-V binary code into a text file, and a console client application. To the best of our knowledge, the Beehive SPIR-V Toolkit is the first Java programming framework that can dynamically generate SPIR-V binary modules. To demonstrate the use of our framework, we showcase the integration of the SPIR-V Beehive Toolkit in the context of the TornadoVM, a Java framework for automatically offloading and running Java programs on heterogeneous hardware. We show that, via the SPIR-V Beehive Toolkit, the TornadoVM is able to compile code 3x faster than its existing OpenCL C JIT compiler, and it performs up to 1.52x faster than the existing OpenCL C backend in TornadoVM. ",
    "url": "https://arxiv.org/abs/2305.09493",
    "authors": [
      "Juan Fumero",
      "György Rethy",
      "Athanasios Stratikopoulos",
      "Nikos Foutris",
      "Christos Kotselidis"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2305.09504",
    "title": "Content-Adaptive Downsampling in Convolutional Neural Networks",
    "abstract": "Many convolutional neural networks (CNNs) rely on progressive downsampling of their feature maps to increase the network's receptive field and decrease computational cost. However, this comes at the price of losing granularity in the feature maps, limiting the ability to correctly understand images or recover fine detail in dense prediction tasks. To address this, common practice is to replace the last few downsampling operations in a CNN with dilated convolutions, allowing to retain the feature map resolution without reducing the receptive field, albeit increasing the computational cost. This allows to trade off predictive performance against cost, depending on the output feature resolution. By either regularly downsampling or not downsampling the entire feature map, existing work implicitly treats all regions of the input image and subsequent feature maps as equally important, which generally does not hold. We propose an adaptive downsampling scheme that generalizes the above idea by allowing to process informative regions at a higher resolution than less informative ones. In a variety of experiments, we demonstrate the versatility of our adaptive downsampling strategy and empirically show that it improves the cost-accuracy trade-off of various established CNNs. ",
    "url": "https://arxiv.org/abs/2305.09504",
    "authors": [
      "Robin Hesse",
      "Simone Schaub-Meyer",
      "Stefan Roth"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09508",
    "title": "The Hardness of Reasoning about Probabilities and Causality",
    "abstract": "We study formal languages which are capable of fully expressing quantitative probabilistic reasoning and do-calculus reasoning for causal effects, from a computational complexity perspective. We focus on satisfiability problems whose instance formulas allow expressing many tasks in probabilistic and causal inference. The main contribution of this work is establishing the exact computational complexity of these satisfiability problems. We introduce a new natural complexity class, named succ$\\exists$R, which can be viewed as a succinct variant of the well-studied class $\\exists$R, and show that the problems we consider are complete for succ$\\exists$R. Our results imply even stronger algorithmic limitations than were proven by Fagin, Halpern, and Megiddo (1990) and Moss\\'{e}, Ibeling, and Icard (2022) for some variants of the standard languages used commonly in probabilistic and causal inference. ",
    "url": "https://arxiv.org/abs/2305.09508",
    "authors": [
      "Benito van der Zander",
      "Markus Bläser",
      "Maciej Liśkiewicz"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2305.09510",
    "title": "Real-time Simultaneous Multi-Object 3D Shape Reconstruction, 6DoF Pose  Estimation and Dense Grasp Prediction",
    "abstract": "Robotic manipulation systems operating in complex environments rely on perception systems that provide information about the geometry (pose and 3D shape) of the objects in the scene along with other semantic information such as object labels. This information is then used for choosing the feasible grasps on relevant objects. In this paper, we present a novel method to provide this geometric and semantic information of all objects in the scene as well as feasible grasps on those objects simultaneously. The main advantage of our method is its speed as it avoids sequential perception and grasp planning steps. With detailed quantitative analysis, we show that our method delivers competitive performance compared to the state-of-the-art dedicated methods for object shape, pose, and grasp predictions while providing fast inference at 30 frames per second speed. ",
    "url": "https://arxiv.org/abs/2305.09510",
    "authors": [
      "Shubham Agrawal",
      "Nikhil Chavan-Dafle",
      "Isaac Kasahara",
      "Selim Engin",
      "Jinwook Huh",
      "Volkan Isler"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09511",
    "title": "Limit-behavior of a hybrid evolutionary algorithm for the Hasofer-Lind  reliability index problem",
    "abstract": "In probabilistic structural mechanics, the Hasofer-Lind reliability index problem is a paradigmatic equality constrained problem of searching for the minimum distance from a point to a surface. In practical engineering problems, such surface is defined implicitly, requiring the solution of a boundary-value problem. Recently, it was proposed in the literature a hybrid micro-genetic algorithm (HmGA), with mixed real-binary genotype and novel deterministic operators for equality-constraint handling, namely the Genetic Repair and Region Zooming mechanisms (G. das Neves Carneiro and C. Concei\\c{c}\\~ao Ant\\'onio, \"Global optimal reliability index of implicit composite laminate structures by evolutionary algorithms\", Struct Saf, vol. 79, pp. 54-65, 2019). We investigate the limit-behavior of the HmGA and present the convergence theorems for the algorithm. It is proven that Genetic Repair is a conditionally stable mechanism, and its modes of convergence are discussed. Based on a Markov chain analysis, the conditions for the convergence with probability 1 of the HmGA are given and discussed. ",
    "url": "https://arxiv.org/abs/2305.09511",
    "authors": [
      "Gonçalo das Neves Carneiro",
      "Carlos Conceição António"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2305.09519",
    "title": "Community Notes vs. Snoping: How the Crowd Selects Fact-Checking Targets  on Social Media",
    "abstract": "Deploying links to fact-checking websites (so-called \"snoping\") is a common intervention that can be used by social media users to refute misleading claims. However, its real-world effect may be limited as it suffers from low visibility and distrust towards professional fact-checkers. As a remedy, Twitter launched its community-based fact-checking system Community Notes on which fact-checks are carried out by actual Twitter users and directly shown on the fact-checked tweets. Yet, an understanding of how fact-checking via Community Notes differs from snoping is absent. In this study, we analyze differences in how contributors to Community Notes and Snopers select their targets when fact-checking social media posts. For this purpose, we analyze two unique datasets from Twitter: (a) 25,917 community-created fact-checks from Twitter's Community Notes platform; and (b) 52,505 \"snopes\" that debunk tweets via fact-checking replies linking to professional fact-checking websites. We find that Notes contributors and Snopers focus on different targets when fact-checking social media content. For instance, Notes contributors tend to fact-check posts from larger accounts with higher social influence and are relatively less likely to endorse/emphasize the accuracy of not misleading posts. Fact-checking targets of Notes contributors and Snopers rarely overlap; however, those overlapping exhibit a high level of agreement in the fact-checking assessment. Moreover, we demonstrate that Snopers fact-check social media posts at a higher speed. Altogether, our findings imply that different fact-checking approaches -- carried out on the same social media platform -- can result in vastly different social media posts getting fact-checked. This has important implications for future research on misinformation, which should not rely on a single fact-checking approach when compiling misinformation datasets. ",
    "url": "https://arxiv.org/abs/2305.09519",
    "authors": [
      "Moritz Pilarski",
      "Kirill Solovev",
      "Nicolas Pröllochs"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.09542",
    "title": "Increasing Melanoma Diagnostic Confidence: Forcing the Convolutional  Network to Learn from the Lesion",
    "abstract": "Deep learning implemented with convolutional network architectures can exceed specialists' diagnostic accuracy. However, whole-image deep learning trained on a given dataset may not generalize to other datasets. The problem arises because extra-lesional features - ruler marks, ink marks, and other melanoma correlates - may serve as information leaks. These extra-lesional features, discoverable by heat maps, degrade melanoma diagnostic performance and cause techniques learned on one data set to fail to generalize. We propose a novel technique to improve melanoma recognition by an EfficientNet model. The model trains the network to detect the lesion and learn features from the detected lesion. A generalizable elliptical segmentation model for lesions was developed, with an ellipse enclosing a lesion and the ellipse enclosed by an extended rectangle (bounding box). The minimal bounding box was extended by 20% to allow some background around the lesion. The publicly available International Skin Imaging Collaboration (ISIC) 2020 skin lesion image dataset was used to evaluate the effectiveness of the proposed method. Our test results show that the proposed method improved diagnostic accuracy by increasing the mean area under receiver operating characteristic curve (mean AUC) score from 0.9 to 0.922. Additionally, correctly diagnosed scores are also improved, providing better separation of scores, thereby increasing melanoma diagnostic confidence. The proposed lesion-focused convolutional technique warrants further study. ",
    "url": "https://arxiv.org/abs/2305.09542",
    "authors": [
      "Norsang Lama",
      "R. Joe Stanley",
      "Anand Nambisan",
      "Akanksha Maurya",
      "Jason Hagerty",
      "William V. Stoecker"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.09559",
    "title": "Robust and lightweight audio fingerprint for Automatic Content  Recognition",
    "abstract": "This research paper presents a novel audio fingerprinting system for Automatic Content Recognition (ACR). By using signal processing techniques and statistical transformations, our proposed method generates compact fingerprints of audio segments that are robust to noise degradations present in real-world audio. The system is designed to be highly scalable, with the ability to identify thousands of hours of content using fingerprints generated from millions of TVs. The fingerprint's high temporal correlation and utilization of existing GPU-compatible Approximate Nearest Neighbour (ANN) search algorithms make this possible. Furthermore, the fingerprint generation can run on low-power devices with limited compute, making it accessible to a wide range of applications. Experimental results show improvements in our proposed system compared to a min-hash based audio fingerprint on all evaluated metrics, including accuracy on proprietary ACR datasets, retrieval speed, memory usage, and robustness to various noises. For similar retrieval accuracy, our system is 30x faster and uses 6x fewer fingerprints than the min-hash method. ",
    "url": "https://arxiv.org/abs/2305.09559",
    "authors": [
      "Anoubhav Agarwaal",
      "Prabhat Kanaujia",
      "Sartaki Sinha Roy",
      "Susmita Ghose"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Information Retrieval (cs.IR)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2305.09574",
    "title": "UOR: Universal Backdoor Attacks on Pre-trained Language Models",
    "abstract": "Backdoors implanted in pre-trained language models (PLMs) can be transferred to various downstream tasks, which exposes a severe security threat. However, most existing backdoor attacks against PLMs are un-targeted and task-specific. Few targeted and task-agnostic methods use manually pre-defined triggers and output representations, which prevent the attacks from being more effective and general. In this paper, we first summarize the requirements that a more threatening backdoor attack against PLMs should satisfy, and then propose a new backdoor attack method called UOR, which breaks the bottleneck of the previous approach by turning manual selection into automatic optimization. Specifically, we define poisoned supervised contrastive learning which can automatically learn the more uniform and universal output representations of triggers for various PLMs. Moreover, we use gradient search to select appropriate trigger words which can be adaptive to different PLMs and vocabularies. Experiments show that our method can achieve better attack performance on various text classification tasks compared to manual methods. Further, we tested our method on PLMs with different architectures, different usage paradigms, and more difficult tasks, which demonstrated the universality of our method. ",
    "url": "https://arxiv.org/abs/2305.09574",
    "authors": [
      "Wei Du",
      "Peixuan Li",
      "Boqun Li",
      "Haodong Zhao",
      "Gongshen Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2305.09579",
    "title": "Private Everlasting Prediction",
    "abstract": "A private learner is trained on a sample of labeled points and generates a hypothesis that can be used for predicting the labels of newly sampled points while protecting the privacy of the training set [Kasiviswannathan et al., FOCS 2008]. Research uncovered that private learners may need to exhibit significantly higher sample complexity than non-private learners as is the case with, e.g., learning of one-dimensional threshold functions [Bun et al., FOCS 2015, Alon et al., STOC 2019]. We explore prediction as an alternative to learning. Instead of putting forward a hypothesis, a predictor answers a stream of classification queries. Earlier work has considered a private prediction model with just a single classification query [Dwork and Feldman, COLT 2018]. We observe that when answering a stream of queries, a predictor must modify the hypothesis it uses over time, and, furthermore, that it must use the queries for this modification, hence introducing potential privacy risks with respect to the queries themselves. We introduce private everlasting prediction taking into account the privacy of both the training set and the (adaptively chosen) queries made to the predictor. We then present a generic construction of private everlasting predictors in the PAC model. The sample complexity of the initial training sample in our construction is quadratic (up to polylog factors) in the VC dimension of the concept class. Our construction allows prediction for all concept classes with finite VC dimension, and in particular threshold functions with constant size initial training sample, even when considered over infinite domains, whereas it is known that the sample complexity of privately learning threshold functions must grow as a function of the domain size and hence is impossible for infinite domains. ",
    "url": "https://arxiv.org/abs/2305.09579",
    "authors": [
      "Moni Naor",
      "Kobbi Nissim",
      "Uri Stemmer",
      "Chao Yan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2305.09585",
    "title": "Inductive Graph Neural Networks for Moving Object Segmentation",
    "abstract": "Moving Object Segmentation (MOS) is a challenging problem in computer vision, particularly in scenarios with dynamic backgrounds, abrupt lighting changes, shadows, camouflage, and moving cameras. While graph-based methods have shown promising results in MOS, they have mainly relied on transductive learning which assumes access to the entire training and testing data for evaluation. However, this assumption is not realistic in real-world applications where the system needs to handle new data during deployment. In this paper, we propose a novel Graph Inductive Moving Object Segmentation (GraphIMOS) algorithm based on a Graph Neural Network (GNN) architecture. Our approach builds a generic model capable of performing prediction on newly added data frames using the already trained model. GraphIMOS outperforms previous inductive learning methods and is more generic than previous transductive techniques. Our proposed algorithm enables the deployment of graph-based MOS models in real-world applications. ",
    "url": "https://arxiv.org/abs/2305.09585",
    "authors": [
      "Wieke Prummel",
      "Jhony H. Giraldo",
      "Anastasia Zakharova",
      "Thierry Bouwmans"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09592",
    "title": "Trojan Playground: A Reinforcement Learning Framework for Hardware  Trojan Insertion and Detection",
    "abstract": "Current Hardware Trojan (HT) detection techniques are mostly developed based on a limited set of HT benchmarks. Existing HT benchmarks circuits are generated with multiple shortcomings, i.e., i) they are heavily biased by the designers' mindset when they are created, and ii) they are created through a one-dimensional lens, mainly the signal activity of nets. To address these shortcomings, we introduce the first automated reinforcement learning (RL) HT insertion and detection framework. In the insertion phase, an RL agent explores the circuits and finds different locations that are best for keeping inserted HTs hidden. On the defense side, we introduce a multi-criteria RL-based detector that generates test vectors to discover the existence of HTs. Using the proposed framework, one can explore the HT insertion and detection design spaces to break the human mindset limitations as well as the benchmark issues, ultimately leading toward the next-generation of innovative detectors. Our HT toolset is open-source to accelerate research in this field and reduce the initial setup time for newcomers. We demonstrate the efficacy of our framework on ISCAS-85 benchmarks and provide the attack and detection success rates and define a methodology for comparing our techniques. ",
    "url": "https://arxiv.org/abs/2305.09592",
    "authors": [
      "Amin Sarihi",
      "Ahmad Patooghy",
      "Peter Jamieson",
      "Abdel-Hameed A. Badawy"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2305.09594",
    "title": "HiNoVa: A Novel Open-Set Detection Method for Automating RF Device  Authentication",
    "abstract": "New capabilities in wireless network security have been enabled by deep learning, which leverages patterns in radio frequency (RF) data to identify and authenticate devices. Open-set detection is an area of deep learning that identifies samples captured from new devices during deployment that were not part of the training set. Past work in open-set detection has mostly been applied to independent and identically distributed data such as images. In contrast, RF signal data present a unique set of challenges as the data forms a time series with non-linear time dependencies among the samples. We introduce a novel open-set detection approach based on the patterns of the hidden state values within a Convolutional Neural Network (CNN) Long Short-Term Memory (LSTM) model. Our approach greatly improves the Area Under the Precision-Recall Curve on LoRa, Wireless-WiFi, and Wired-WiFi datasets, and hence, can be used successfully to monitor and control unauthorized network access of wireless devices. ",
    "url": "https://arxiv.org/abs/2305.09594",
    "authors": [
      "Luke Puppo",
      "Weng-Keen Wong",
      "Bechir Hamdaoui",
      "Abdurrahman Elmaghbub"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.09598",
    "title": "Boosting Event Extraction with Denoised Structure-to-Text Augmentation",
    "abstract": "Event extraction aims to recognize pre-defined event triggers and arguments from texts, which suffer from the lack of high-quality annotations. In most NLP applications, involving a large scale of synthetic training data is a practical and effective approach to alleviate the problem of data scarcity. However, when applying to the task of event extraction, recent data augmentation methods often neglect the problem of grammatical incorrectness, structure misalignment, and semantic drifting, leading to unsatisfactory performances. In order to solve these problems, we propose a denoised structure-to-text augmentation framework for event extraction DAEE, which generates additional training data through the knowledge-based structure-to-text generation model and selects the effective subset from the generated data iteratively with a deep reinforcement learning agent. Experimental results on several datasets demonstrate that the proposed method generates more diverse text representations for event extraction and achieves comparable results with the state-of-the-art. ",
    "url": "https://arxiv.org/abs/2305.09598",
    "authors": [
      "bo wang",
      "Heyan Huang",
      "Xiaochi Wei",
      "Ge Shi",
      "Xiao Liu",
      "Chong Feng",
      "Tong Zhou",
      "Shuaiqiang Wang",
      "Dawei Yin"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.09608",
    "title": "Data Augmentation for Conflict and Duplicate Detection in Software  Engineering Sentence Pairs",
    "abstract": "This paper explores the use of text data augmentation techniques to enhance conflict and duplicate detection in software engineering tasks through sentence pair classification. The study adapts generic augmentation techniques such as shuffling, back translation, and paraphrasing and proposes new data augmentation techniques such as Noun-Verb Substitution, target-lemma replacement and Actor-Action Substitution for software requirement texts. A comprehensive empirical analysis is conducted on six software text datasets to identify conflicts and duplicates among sentence pairs. The results demonstrate that data augmentation techniques have a significant impact on the performance of all software pair text datasets. On the other hand, in cases where the datasets are relatively balanced, the use of augmentation techniques may result in a negative effect on the classification performance. ",
    "url": "https://arxiv.org/abs/2305.09608",
    "authors": [
      "Garima Malik",
      "Mucahit Cevik",
      "Ayşe Başar"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09610",
    "title": "Concurrent Misclassification and Out-of-Distribution Detection for  Semantic Segmentation via Energy-Based Normalizing Flow",
    "abstract": "Recent semantic segmentation models accurately classify test-time examples that are similar to a training dataset distribution. However, their discriminative closed-set approach is not robust in practical data setups with distributional shifts and out-of-distribution (OOD) classes. As a result, the predicted probabilities can be very imprecise when used as confidence scores at test time. To address this, we propose a generative model for concurrent in-distribution misclassification (IDM) and OOD detection that relies on a normalizing flow framework. The proposed flow-based detector with an energy-based inputs (FlowEneDet) can extend previously deployed segmentation models without their time-consuming retraining. Our FlowEneDet results in a low-complexity architecture with marginal increase in the memory footprint. FlowEneDet achieves promising results on Cityscapes, Cityscapes-C, FishyScapes and SegmentMeIfYouCan benchmarks in IDM/OOD detection when applied to pretrained DeepLabV3+ and SegFormer semantic segmentation models. ",
    "url": "https://arxiv.org/abs/2305.09610",
    "authors": [
      "Denis Gudovskiy",
      "Tomoyuki Okuno",
      "Yohei Nakata"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09620",
    "title": "AI-Augmented Surveys: Leveraging Large Language Models for Opinion  Prediction in Nationally Representative Surveys",
    "abstract": "How can we use large language models (LLMs) to augment surveys? This paper investigates three distinct applications of LLMs fine-tuned by nationally representative surveys for opinion prediction -- missing data imputation, retrodiction, and zero-shot prediction. We present a new methodological framework that incorporates neural embeddings of survey questions, individual beliefs, and temporal contexts to personalize LLMs in opinion prediction. Among 3,110 binarized opinions from 68,846 Americans in the General Social Survey from 1972 to 2021, our best models based on Alpaca-7b excels in missing data imputation (AUC = 0.87 for personal opinion prediction and $\\rho$ = 0.99 for public opinion prediction) and retrodiction (AUC = 0.86, $\\rho$ = 0.98). These remarkable prediction capabilities allow us to fill in missing trends with high confidence and pinpoint when public attitudes changed, such as the rising support for same-sex marriage. However, the models show limited performance in a zero-shot prediction task (AUC = 0.73, $\\rho$ = 0.67), highlighting challenges presented by LLMs without human responses. Further, we find that the best models' accuracy is lower for individuals with low socioeconomic status, racial minorities, and non-partisan affiliations but higher for ideologically sorted opinions in contemporary periods. We discuss practical constraints, socio-demographic representation, and ethical concerns regarding individual autonomy and privacy when using LLMs for opinion prediction. This paper showcases a new approach for leveraging LLMs to enhance nationally representative surveys by predicting missing responses and trends. ",
    "url": "https://arxiv.org/abs/2305.09620",
    "authors": [
      "Junsol Kim",
      "Byungkyu Lee"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09659",
    "title": "Double Pessimism is Provably Efficient for Distributionally Robust  Offline Reinforcement Learning: Generic Algorithm and Robust Partial Coverage",
    "abstract": "We study distributionally robust offline reinforcement learning (robust offline RL), which seeks to find an optimal robust policy purely from an offline dataset that can perform well in perturbed environments. We propose a generic algorithm framework \\underline{D}oubly \\underline{P}essimistic \\underline{M}odel-based \\underline{P}olicy \\underline{O}ptimization ($\\texttt{P}^2\\texttt{MPO}$) for robust offline RL, which features a novel combination of a flexible model estimation subroutine and a doubly pessimistic policy optimization step. The \\emph{double pessimism} principle is crucial to overcome the distributional shift incurred by i) the mismatch between behavior policy and the family of target policies; and ii) the perturbation of the nominal model. Under certain accuracy assumptions on the model estimation subroutine, we show that $\\texttt{P}^2\\texttt{MPO}$ is provably efficient with \\emph{robust partial coverage data}, which means that the offline dataset has good coverage of the distributions induced by the optimal robust policy and perturbed models around the nominal model. By tailoring specific model estimation subroutines for concrete examples including tabular Robust Markov Decision Process (RMDP), factored RMDP, and RMDP with kernel and neural function approximations, we show that $\\texttt{P}^2\\texttt{MPO}$ enjoys a $\\tilde{\\mathcal{O}}(n^{-1/2})$ convergence rate, where $n$ is the number of trajectories in the offline dataset. Notably, these models, except for the tabular case, are first identified and proven tractable by this paper. To the best of our knowledge, we first propose a general learning principle -- double pessimism -- for robust offline RL and show that it is provably efficient in the context of general function approximations. ",
    "url": "https://arxiv.org/abs/2305.09659",
    "authors": [
      "Jose Blanchet",
      "Miao Lu",
      "Tong Zhang",
      "Han Zhong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1906.03381",
    "title": "S-ConvNet: A Shallow Convolutional Neural Network Architecture for  Neuromuscular Activity Recognition Using Instantaneous High-Density Surface  EMG Images",
    "abstract": "The concept of neuromuscular activity recognition using instantaneous high-density surface electromyography (HD-sEMG) images opens up new avenues for the development of more fluid and natural muscle-computer interfaces. However, the existing approaches employed a very large deep convolutional neural network (ConvNet) architecture and complex training schemes for HD-sEMG image recognition, which requires the network architecture to be pre-trained on a very large-scale labeled training dataset, as a result, it makes computationally very expensive. To overcome this problem, we propose S-ConvNet and All-ConvNet models, a simple yet efficient framework for learning instantaneous HD-sEMG images from scratch for neuromuscular activity recognition. Without using any pre-trained models, our proposed S-ConvNet and All-ConvNet demonstrate very competitive recognition accuracy to the more complex state of the art for neuromuscular activity recognition based on instantaneous HD-sEMG images, while using a ~ 12 x smaller dataset and reducing learning parameters to a large extent. The experimental results proved that the S-ConvNet and All-ConvNet are highly effective for learning discriminative features for instantaneous HD-sEMG image recognition especially in the data and high-end resource constrained scenarios. ",
    "url": "https://arxiv.org/abs/1906.03381",
    "authors": [
      "Md. Rabiul Islam",
      "Daniel Massicotte",
      "Francois Nougarou",
      "Philippe Massicotte",
      "Wei-Ping Zhu"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2305.08929",
    "title": "AF2-Mutation: Adversarial Sequence Mutations against AlphaFold2 on  Protein Tertiary Structure Prediction",
    "abstract": "Deep learning-based approaches, such as AlphaFold2 (AF2), have significantly advanced protein tertiary structure prediction, achieving results comparable to real biological experimental methods. While AF2 has shown limitations in predicting the effects of mutations, its robustness against sequence mutations remains to be determined. Starting with the wild-type (WT) sequence, we investigate adversarial sequences generated via an evolutionary approach, which AF2 predicts to be substantially different from WT. Our experiments on CASP14 reveal that by modifying merely three residues in the protein sequence using a combination of replacement, deletion, and insertion strategies, the alteration in AF2's predictions, as measured by the Local Distance Difference Test (lDDT), reaches 46.61. Moreover, when applied to a specific protein, SPNS2, our proposed algorithm successfully identifies biologically meaningful residues critical to protein structure determination and potentially indicates alternative conformations, thus significantly expediting the experimental process. ",
    "url": "https://arxiv.org/abs/2305.08929",
    "authors": [
      "Zhongju Yuan",
      "Tao Shen",
      "Sheng Xu",
      "Leiye Yu",
      "Ruobing Ren",
      "Siqi Sun"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09028",
    "title": "SKI to go Faster: Accelerating Toeplitz Neural Networks via Asymmetric  Kernels",
    "abstract": "Toeplitz Neural Networks (TNNs) (Qin et. al. 2023) are a recent sequence model with impressive results. They require O(n log n) computational complexity and O(n) relative positional encoder (RPE) multi-layer perceptron (MLP) and decay bias calls. We aim to reduce both. We first note that the RPE is a non-SPD (symmetric positive definite) kernel and the Toeplitz matrices are pseudo-Gram matrices. Further 1) the learned kernels display spiky behavior near the main diagonals with otherwise smooth behavior; 2) the RPE MLP is slow. For bidirectional models, this motivates a sparse plus low-rank Toeplitz matrix decomposition. For the sparse component's action, we do a small 1D convolution. For the low rank component, we replace the RPE MLP with linear interpolation and use asymmetric Structured Kernel Interpolation (SKI) (Wilson et. al. 2015) for O(n) complexity: we provide rigorous error analysis. For causal models, \"fast\" causal masking (Katharopoulos et. al. 2020) negates SKI's benefits. Working in the frequency domain, we avoid an explicit decay bias. To enforce causality, we represent the kernel via the real part of its frequency response using the RPE and compute the imaginary part via a Hilbert transform. This maintains O(n log n) complexity but achieves an absolute speedup. Modeling the frequency response directly is also competitive for bidirectional training, using one fewer FFT. We set a speed state of the art on Long Range Arena (Tay et. al. 2020) with minimal score degradation. ",
    "url": "https://arxiv.org/abs/2305.09028",
    "authors": [
      "Alexander Moreno",
      "Jonathan Mei",
      "Luke Walters"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09065",
    "title": "Robust Auction Design with Support Information",
    "abstract": "A seller wants to sell an item to $n$ buyers. The buyer valuations are drawn i.i.d. from a distribution, but the seller does not know this distribution; the seller only knows the support $[a,b]$. To be robust against the lack of knowledge of the environment and buyers' behavior, the seller optimizes over DSIC mechanisms, and measures the worst-case performance relative to an oracle with complete knowledge of buyers' valuations. Our analysis encompasses both the regret and the ratio objectives. For these objectives, we derive an optimal mechanism in closed form as a function of the support and the number of buyers $n$. Our analysis reveals three regimes of support information and a new class of robust mechanisms. i.) With \"low\" support information, the optimal mechanism is a second-price auction (SPA) with a random reserve, a focal class in the earlier literature. ii.) With \"high\" support information, we show that second-price auctions are strictly suboptimal, and an optimal mechanism belongs to a novel class of mechanisms we introduce, which we call $\\textbf{pooling auctions}$ (POOL); whenever the highest value is above a threshold, the mechanism still allocates to the highest bidder, but otherwise the mechanism allocates to a uniformly random buyer, i.e., pools low types. iii.) With \"moderate\" support information, a randomization between SPA and POOL is optimal. We also characterize optimal mechanisms within nested central subclasses of mechanisms: standard mechanisms (only allocate to the highest bidder), SPA with random reserve, and SPA with no reserve. We show strict separations across classes, implying that deviating from standard mechanisms is necessary for robustness. Lastly, we show that the same results hold under other distribution classes that capture \"positive dependence\" (mixture of i.i.d., exchangeable and affiliated), as well as i.i.d. regular distributions. ",
    "url": "https://arxiv.org/abs/2305.09065",
    "authors": [
      "Jerry Anunrojwong",
      "Santiago R. Balseiro",
      "Omar Besbes"
    ],
    "subjectives": [
      "Theoretical Economics (econ.TH)",
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2305.09181",
    "title": "Push-LSVRG-UP: Distributed Stochastic Optimization over Unbalanced  Directed Networks with Uncoordinated Triggered Probabilities",
    "abstract": "Distributed stochastic optimization, arising in the crossing and integration of traditional stochastic optimization, distributed computing and storage, and network science, has advantages of high efficiency and a low per-iteration computational complexity in resolving large-scale optimization problems. This paper concentrates on resolving a large-scale convex finite-sum optimization problem in a multi-agent system over unbalanced directed networks. To tackle this problem in an efficient way, a distributed consensus optimization algorithm, adopting the push-sum technique and a distributed loopless stochastic variance-reduced gradient (LSVRG) method with uncoordinated triggered probabilities, is developed and named Push-LSVRG-UP. Each agent under this algorithmic framework performs only local computation and communicates only with its neighbors without leaking their private information. The convergence analysis of Push-LSVRG-UP is relied on analyzing the contraction relationships between four error terms associated with the multi-agent system. Theoretical results provide an explicit feasible range of the constant step-size, a linear convergence rate, and an iteration complexity of Push-LSVRG-UP when achieving the globally optimal solution. It is shown that Push-LSVRG-UP achieves the superior characteristics of accelerated linear convergence, fewer storage costs, and a lower per-iteration computational complexity than most existing works. Meanwhile, the introduction of an uncoordinated probabilistic triggered mechanism allows Push-LSVRG-UP to facilitate the independence and flexibility of agents in computing local batch gradients. In simulations, the practicability and improved performance of Push-LSVRG-UP are manifested via resolving two distributed learning problems based on real-world datasets. ",
    "url": "https://arxiv.org/abs/2305.09181",
    "authors": [
      "Jinhui Hu",
      "Guo Chen",
      "Huaqing Li",
      "Zixiang Shen",
      "Weidong Zhang"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2305.09186",
    "title": "Abnormal Functional Brain Network Connectivity Associated with  Alzheimer's Disease",
    "abstract": "The study's objective is to explore the distinctions in the functional brain network connectivity between Alzheimer's Disease (AD) patients and normal controls using Functional Magnetic Resonance Imaging (fMRI). The study included 590 individuals, with 175 having AD dementia and 415 age-, gender-, and handedness-matched normal controls. The connectivity of functional brain networks was measured using ROI-to-ROI and ROI-to-Voxel connectivity analyses. The findings reveal a general decrease in functional connectivity among the AD group in comparison to the normal control group. These results advance our comprehension of AD pathophysiology and could assist in identifying AD biomarkers. ",
    "url": "https://arxiv.org/abs/2305.09186",
    "authors": [
      "Yongcheng Yao"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.09194",
    "title": "Characterizing the Directness of Accessibility Among Heterogeneous Urban  Amenities with Network First Passage Distances",
    "abstract": "The spatial configuration of urban amenities and the streets connecting them collectively provide the structural backbone of a city, influencing its accessibility, vitality, and ultimately the emotional and physical well-being of its residents. Measures aiming to capture urban accessibility or vitality through structural factors must account for heterogeneity that is both spatial -- the density and diversity of amenities across space -- and topological -- the connectivity among different types of amenities along the street network. Given that existing measures often only focus on these factors individually, here we develop a simple, principled, and flexible framework to characterize the directness of accessibility among heterogeneous amenities in a city, which we call the Class First Passage Difference (CFPD). The CFPD quantifies the excess travel distance incurred when using the street network to route between different pairs of amenity types, summarizing both the spatial and topological correlations among amenities in a city. Our method exhibits significant statistical associations with a variety of urban prosperity and accessibility indicators when compared to an appropriate null model that scrambles the correlations among the amenities. We also find a clear separation in the CFPD characteristics of cities according to their level of development and geographic region. Our framework provides a principled, interpretable, complementary perspective to existing indices of urban accessibility and vitality. ",
    "url": "https://arxiv.org/abs/2305.09194",
    "authors": [
      "Bibandhan Poudyal",
      "Gourab Ghoshal",
      "Alec Kirkley"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2305.09211",
    "title": "CB-HVTNet: A channel-boosted hybrid vision transformer network for  lymphocyte assessment in histopathological images",
    "abstract": "Transformers, due to their ability to learn long range dependencies, have overcome the shortcomings of convolutional neural networks (CNNs) for global perspective learning. Therefore, they have gained the focus of researchers for several vision related tasks including medical diagnosis. However, their multi-head attention module only captures global level feature representations, which is insufficient for medical images. To address this issue, we propose a Channel Boosted Hybrid Vision Transformer (CB HVT) that uses transfer learning to generate boosted channels and employs both transformers and CNNs to analyse lymphocytes in histopathological images. The proposed CB HVT comprises five modules, including a channel generation module, channel exploitation module, channel merging module, region-aware module, and a detection and segmentation head, which work together to effectively identify lymphocytes. The channel generation module uses the idea of channel boosting through transfer learning to extract diverse channels from different auxiliary learners. In the CB HVT, these boosted channels are first concatenated and ranked using an attention mechanism in the channel exploitation module. A fusion block is then utilized in the channel merging module for a gradual and systematic merging of the diverse boosted channels to improve the network's learning representations. The CB HVT also employs a proposal network in its region aware module and a head to effectively identify objects, even in overlapping regions and with artifacts. We evaluated the proposed CB HVT on two publicly available datasets for lymphocyte assessment in histopathological images. The results show that CB HVT outperformed other state of the art detection models, and has good generalization ability, demonstrating its value as a tool for pathologists. ",
    "url": "https://arxiv.org/abs/2305.09211",
    "authors": [
      "Momina Liaqat Ali",
      "Zunaira Rauf",
      "Asifullah Khan",
      "Anabia Sohail",
      "Rafi Ullah",
      "Jeonghwan Gwak"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09327",
    "title": "Improved Type III solar radio burst detection using congruent deep  learning models",
    "abstract": "Solar flares are energetic events in the solar atmosphere that are often linked with solar radio bursts (SRBs). SRBs are observed at metric to decametric wavelengths and are classified into five spectral classes (Type I--V) based on their signature in dynamic spectra. The automatic detection and classification of SRBs is a challenge due to their heterogeneous form. Near-realtime detection and classification of SRBs has become a necessity in recent years due to large data rates generated by advanced radio telescopes such as the LOw Frequency ARray (LOFAR). In this study, we implement congruent deep learning models to automatically detect and classify Type III SRBs. We generated simulated Type III SRBs, which were comparable to Type IIIs seen in real observations, using a deep learning method known as Generative Adversarial Network (GAN). This simulated data was combined with observations from LOFAR to produce a training set that was used to train an object detection model known as YOLOv2 (You Only Look Once). Using this congruent deep learning model system, we can accurately detect Type III SRBs at a mean Average Precision (mAP) value of 77.71%. ",
    "url": "https://arxiv.org/abs/2305.09327",
    "authors": [
      "Jeremiah Scully",
      "Ronan Flynn",
      "Peter Gallagher",
      "Eoin Carley",
      "Mark Daly"
    ],
    "subjectives": [
      "Solar and Stellar Astrophysics (astro-ph.SR)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.09480",
    "title": "Protein Complex Invariant Embedding with Cross-Gate MLP is A One-Shot  Antibody Designer",
    "abstract": "Antibodies are crucial proteins produced by the immune system in response to foreign substances or antigens. The specificity of an antibody is determined by its complementarity-determining regions (CDRs), which are located in the variable domains of the antibody chains and form the antigen-binding site. Previous studies have utilized complex techniques to generate CDRs, but they suffer from inadequate geometric modeling. Moreover, the common iterative refinement strategies lead to an inefficient inference. In this paper, we propose a deep generative model that can co-design 1D sequences and 3D structures of CDRs in a one-shot manner. To achieve this, we decouple the antibody CDR design into two stages: (i) geometric modeling of protein structures and (ii) sequence-structure co-learning. We develop a protein complex invariant embedding that captures both intra- and inter-component interactions among the backbone atoms including C$\\alpha$, N, C, and O atoms to achieve comprehensive geometric modeling. Then, we introduce a cross-gate MLP for sequence-structure co-learning, which allows sequence and structure representations to implicitly refine each other. This enables our model to design desired sequences and structures in a one-shot manner. Extensive experiments are conducted to evaluate our results at both the sequence and structure level, which demonstrate that our model achieves superior performance compared to the state-of-the-art antibody CDR design methods. ",
    "url": "https://arxiv.org/abs/2305.09480",
    "authors": [
      "Cheng Tan",
      "Zhangyang Gao",
      "Stan Z. Li"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09485",
    "title": "Executive Voiced Laughter and Social Approval: An Explorative Machine  Learning Study",
    "abstract": "We study voiced laughter in executive communication and its effect on social approval. Integrating research on laughter, affect-as-information, and infomediaries' social evaluations of firms, we hypothesize that voiced laughter in executive communication positively affects social approval, defined as audience perceptions of affinity towards an organization. We surmise that the effect of laughter is especially strong for joint laughter, i.e., the number of instances in a given communication venue for which the focal executive and the audience laugh simultaneously. Finally, combining the notions of affect-as-information and negativity bias in human cognition, we hypothesize that the positive effect of laughter on social approval increases with bad organizational performance. We find partial support for our ideas when testing them on panel data comprising 902 German Bundesliga soccer press conferences and media tenor, applying state-of-the-art machine learning approaches for laughter detection as well as sentiment analysis. Our findings contribute to research at the nexus of executive communication, strategic leadership, and social evaluations, especially by introducing laughter as a highly consequential potential, but understudied social lubricant at the executive-infomediary interface. Our research is unique by focusing on reflexive microprocesses of social evaluations, rather than the infomediary-routines perspectives in infomediaries' evaluations. We also make methodological contributions. ",
    "url": "https://arxiv.org/abs/2305.09485",
    "authors": [
      "Niklas Mueller",
      "Steffen Klug",
      "Andreas Koenig",
      "Alexander Kathan",
      "Lukas Christ",
      "Bjoern Schuller",
      "Shahin Amiriparian"
    ],
    "subjectives": [
      "General Economics (econ.GN)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09565",
    "title": "Toward Falsifying Causal Graphs Using a Permutation-Based Test",
    "abstract": "Understanding the causal relationships among the variables of a system is paramount to explain and control its behaviour. Inferring the causal graph from observational data without interventions, however, requires a lot of strong assumptions that are not always realistic. Even for domain experts it can be challenging to express the causal graph. Therefore, metrics that quantitatively assess the goodness of a causal graph provide helpful checks before using it in downstream tasks. Existing metrics provide an absolute number of inconsistencies between the graph and the observed data, and without a baseline, practitioners are left to answer the hard question of how many such inconsistencies are acceptable or expected. Here, we propose a novel consistency metric by constructing a surrogate baseline through node permutations. By comparing the number of inconsistencies with those on the surrogate baseline, we derive an interpretable metric that captures whether the DAG fits significantly better than random. Evaluating on both simulated and real data sets from various domains, including biology and cloud monitoring, we demonstrate that the true DAG is not falsified by our metric, whereas the wrong graphs given by a hypothetical user are likely to be falsified. ",
    "url": "https://arxiv.org/abs/2305.09565",
    "authors": [
      "Elias Eulig",
      "Atalanti A. Mastakouri",
      "Patrick Blöbaum",
      "Michaela Hardt",
      "Dominik Janzing"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.09660",
    "title": "Osteosarcoma Tumor Detection using Transfer Learning Models",
    "abstract": "The field of clinical image analysis has been applying transfer learning models increasingly due to their less computational complexity, better accuracy etc. These are pre-trained models that don't require to be trained from scratch which eliminates the necessity of large datasets. Transfer learning models are mostly used for the analysis of brain, breast, or lung images but other sectors such as bone marrow cell detection or bone cancer detection can also benefit from using transfer learning models, especially considering the lack of available large datasets for these tasks. This paper studies the performance of several transfer learning models for osteosarcoma tumour detection. Osteosarcoma is a type of bone cancer mostly found in the cells of the long bones of the body. The dataset consists of H&E stained images divided into 4 categories- Viable Tumor, Non-viable Tumor, Non-Tumor and Viable Non-viable. Both datasets were randomly divided into train and test sets following an 80-20 ratio. 80% was used for training and 20\\% for test. 4 models are considered for comparison- EfficientNetB7, InceptionResNetV2, NasNetLarge and ResNet50. All these models are pre-trained on ImageNet. According to the result, InceptionResNetV2 achieved the highest accuracy (93.29%), followed by NasNetLarge (90.91%), ResNet50 (89.83%) and EfficientNetB7 (62.77%). It also had the highest precision (0.8658) and recall (0.8658) values among the 4 models. ",
    "url": "https://arxiv.org/abs/2305.09660",
    "authors": [
      "Raisa Fairooz Meem",
      "Khandaker Tabin Hasan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2009.03836",
    "title": "Graph neural networks-based Scheduler for Production planning problems  using Reinforcement Learning",
    "abstract": " Comments: 31 pages, pre-print ",
    "url": "https://arxiv.org/abs/2009.03836",
    "authors": [
      "Mohammed Sharafath Abdul Hameed",
      "Andreas Schwung"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2109.12894",
    "title": "Training Spiking Neural Networks Using Lessons From Deep Learning",
    "abstract": " Title: Training Spiking Neural Networks Using Lessons From Deep Learning ",
    "url": "https://arxiv.org/abs/2109.12894",
    "authors": [
      "Jason K. Eshraghian",
      "Max Ward",
      "Emre Neftci",
      "Xinxin Wang",
      "Gregor Lenz",
      "Girish Dwivedi",
      "Mohammed Bennamoun",
      "Doo Seok Jeong",
      "Wei D. Lu"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.12650",
    "title": "New results on the robust coloring problem",
    "abstract": " Title: New results on the robust coloring problem ",
    "url": "https://arxiv.org/abs/2201.12650",
    "authors": [
      "Delia Garijo",
      "Alberto Márquez",
      "Rafael Robles"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2203.02901",
    "title": "A Robust Framework of Chromosome Straightening with ViT-Patch GAN",
    "abstract": " Comments: Camera-ready version for IEEE ISBI2023 ",
    "url": "https://arxiv.org/abs/2203.02901",
    "authors": [
      "Sifan Song",
      "Jinfeng Wang",
      "Fengrui Cheng",
      "Qirui Cao",
      "Yihan Zuo",
      "Yongteng Lei",
      "Ruomai Yang",
      "Chunxiao Yang",
      "Frans Coenen",
      "Jia Meng",
      "Kang Dang",
      "Jionglong Su"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2208.01291",
    "title": "Control theoretically explainable application of autoencoder methods to  fault detection in nonlinear dynamic systems",
    "abstract": " Title: Control theoretically explainable application of autoencoder methods to  fault detection in nonlinear dynamic systems ",
    "url": "https://arxiv.org/abs/2208.01291",
    "authors": [
      "Linlin Li",
      "Steven X. Ding",
      "Ketian Liang",
      "Zhiwen Chen",
      "Ting Xue"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2208.02474",
    "title": "CFARnet: deep learning for target detection with constant false alarm  rate",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2206.05747 ",
    "url": "https://arxiv.org/abs/2208.02474",
    "authors": [
      "Tzvi Diskin",
      "Yiftach Beer",
      "Uri Okun",
      "Ami Wiesel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.05706",
    "title": "Non-Parametric Temporal Adaptation for Social Media Topic Classification",
    "abstract": " Title: Non-Parametric Temporal Adaptation for Social Media Topic Classification ",
    "url": "https://arxiv.org/abs/2209.05706",
    "authors": [
      "Fatemehsadat Mireshghallah",
      "Nikolai Vogler",
      "Junxian He",
      "Omar Florez",
      "Ahmed El-Kishky",
      "Taylor Berg-Kirkpatrick"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.03064",
    "title": "A Toolkit for Robust Thresholds",
    "abstract": " Comments: 41 pages. Corrected an error in the proof of Theorem 1.5 and improved exposition ",
    "url": "https://arxiv.org/abs/2210.03064",
    "authors": [
      "Huy Tuan Pham",
      "Ashwin Sah",
      "Mehtaab Sawhney",
      "Michael Simkin"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2211.00266",
    "title": "Two Low-complexity Efficient Beamformers for IRS-and-UAV-aided  Directional Modulation Networks",
    "abstract": " Title: Two Low-complexity Efficient Beamformers for IRS-and-UAV-aided  Directional Modulation Networks ",
    "url": "https://arxiv.org/abs/2211.00266",
    "authors": [
      "Yeqing Lin",
      "Feng Shu",
      "Yuxiang Zheng",
      "Jing Liu",
      "Rongen Dong",
      "Xun Chen",
      "Yue Wu",
      "Feng Shu",
      "Jiangzhou Wang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2211.00610",
    "title": "Fast Staircase Detection and Estimation using 3D Point Clouds with  Multi-detection Merging for Heterogeneous Robots",
    "abstract": " Comments: This paper has been accepted and will be published in the 2023 IEEE International Conference on Robotics and Automation (ICRA) ",
    "url": "https://arxiv.org/abs/2211.00610",
    "authors": [
      "Prasanna Sriganesh",
      "Namya Bagree",
      "Bhaskar Vundurthy",
      "Matthew Travers"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2211.05777",
    "title": "Hybrid quantum neural network for drug response prediction",
    "abstract": " Comments: 11 pages, 4 figures, 1 table ",
    "url": "https://arxiv.org/abs/2211.05777",
    "authors": [
      "Asel Sagingalieva",
      "Mohammad Kordzanganeh",
      "Nurbolat Kenbayev",
      "Daria Kosichkina",
      "Tatiana Tomashuk",
      "Alexey Melnikov"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.08804",
    "title": "Analysis and Detectability of Offline Data Poisoning Attacks on Linear  Dynamical Systems",
    "abstract": " Comments: To be published in Learning for Dynamics and Control 2023 (L4DC23) ",
    "url": "https://arxiv.org/abs/2211.08804",
    "authors": [
      "Alessio Russo"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.12670",
    "title": "Expressibility-Enhancing Strategies for Quantum Neural Networks",
    "abstract": " Comments: 26 pages, 10 figures, an updated version ",
    "url": "https://arxiv.org/abs/2211.12670",
    "authors": [
      "Yalin Liao",
      "Junpeng Zhan"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.13829",
    "title": "Learning-enhanced Nonlinear Model Predictive Control using  Knowledge-based Neural Ordinary Differential Equations and Deep Ensembles",
    "abstract": " Comments: 16 pages, 4 figures, includes Appendix. Accepted at Learning for Dynamics and Control Conference (L4DC) 2023 ",
    "url": "https://arxiv.org/abs/2211.13829",
    "authors": [
      "Kong Yao Chee",
      "M. Ani Hsieh",
      "Nikolai Matni"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2212.07553",
    "title": "Automated Reachability Analysis of Neural Network-Controlled Systems via  Adaptive Polytopes",
    "abstract": " Title: Automated Reachability Analysis of Neural Network-Controlled Systems via  Adaptive Polytopes ",
    "url": "https://arxiv.org/abs/2212.07553",
    "authors": [
      "Taha Entesari",
      "Mahyar Fazlyab"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2301.04746",
    "title": "Switchable Lightweight Anti-symmetric Processing (SLAP) with CNN  Outspeeds Data Augmentation by Smaller Sample -- Application in Gomoku  Reinforcement Learning",
    "abstract": " Comments: In Berndt M\\\"uller (Ed.), Proceedings of AISB Convention 2023 (pp. 69-75). AISB ",
    "url": "https://arxiv.org/abs/2301.04746",
    "authors": [
      "Chi-Hang Suen",
      "Eduardo Alonso"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.07382",
    "title": "ViT-AE++: Improving Vision Transformer Autoencoder for Self-supervised  Medical Image Representations",
    "abstract": " Comments: Accepted in MIDL 2023. C. Prabhakar and H. B. Li contribute equally. Codes here: this https URL ",
    "url": "https://arxiv.org/abs/2301.07382",
    "authors": [
      "Chinmay Prabhakar",
      "Hongwei Bran Li",
      "Jiancheng Yang",
      "Suprosana Shit",
      "Benedikt Wiestler",
      "Bjoern Menze"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.08491",
    "title": "Modeling Moral Choices in Social Dilemmas with Multi-Agent Reinforcement  Learning",
    "abstract": " Comments: Accepted at IJCAI 2023 (32nd International Joint Conference on Artificial Intelligence - Macao, S.A.R.) ",
    "url": "https://arxiv.org/abs/2301.08491",
    "authors": [
      "Elizaveta Tennant",
      "Stephen Hailes",
      "Mirco Musolesi"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.11113",
    "title": "Finding Regions of Counterfactual Explanations via Robust Optimization",
    "abstract": " Title: Finding Regions of Counterfactual Explanations via Robust Optimization ",
    "url": "https://arxiv.org/abs/2301.11113",
    "authors": [
      "Donato Maragno",
      "Jannis Kurtz",
      "Tabea E. Röber",
      "Rob Goedhart",
      "Ş. Ilker Birbil",
      "Dick den Hertog"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.00370",
    "title": "How to select predictive models for causal inference?",
    "abstract": " Comments: 35 pages ",
    "url": "https://arxiv.org/abs/2302.00370",
    "authors": [
      "Matthieu Doutreligne",
      "Gaël Varoquaux"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.02300",
    "title": "Run-Off Election: Improved Provable Defense against Data Poisoning  Attacks",
    "abstract": " Comments: Accepted to ICML 2023 ",
    "url": "https://arxiv.org/abs/2302.02300",
    "authors": [
      "Keivan Rezaei",
      "Kiarash Banihashem",
      "Atoosa Chegini",
      "Soheil Feizi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.10391",
    "title": "Low-Complexity Three-Dimensional AOA-Cross Geometric Center Localization  Methods via Multi-UAV network",
    "abstract": " Comments: 7 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2302.10391",
    "authors": [
      "Baihua Shi",
      "Yifan Li",
      "Guilu Wu",
      "Shihao Yan",
      "Feng Shu"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2302.10911",
    "title": "Revisiting Weighted Aggregation in Federated Learning with Neural  Networks",
    "abstract": " Comments: Accepted by ICML2023 ",
    "url": "https://arxiv.org/abs/2302.10911",
    "authors": [
      "Zexi Li",
      "Tao Lin",
      "Xinyi Shang",
      "Chao Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.14859",
    "title": "BakedSDF: Meshing Neural SDFs for Real-Time View Synthesis",
    "abstract": " Comments: Video and interactive web demo available at this https URL ",
    "url": "https://arxiv.org/abs/2302.14859",
    "authors": [
      "Lior Yariv",
      "Peter Hedman",
      "Christian Reiser",
      "Dor Verbin",
      "Pratul P. Srinivasan",
      "Richard Szeliski",
      "Jonathan T. Barron",
      "Ben Mildenhall"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.03544",
    "title": "Expressivity of Shallow and Deep Neural Networks for Polynomial  Approximation",
    "abstract": " Comments: This paper contains 14 pages and no figures. This is a revised version with significant changes in sections 4 to clarify the proof of the main result ",
    "url": "https://arxiv.org/abs/2303.03544",
    "authors": [
      "Itai Shapira"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2303.04178",
    "title": "SALSA PICANTE: a machine learning attack on LWE with binary secrets",
    "abstract": " Comments: 15 pages, 6 figures, 17 tables ",
    "url": "https://arxiv.org/abs/2303.04178",
    "authors": [
      "Cathy Li",
      "Jana Sotáková",
      "Emily Wenger",
      "Mohamed Malhou",
      "Evrard Garcelon",
      "Francois Charton",
      "Kristin Lauter"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.05772",
    "title": "Sufficient Control of Complex Networks",
    "abstract": " Title: Sufficient Control of Complex Networks ",
    "url": "https://arxiv.org/abs/2303.05772",
    "authors": [
      "Xiang Li",
      "Guoqi Li",
      "Leitao Gao",
      "Beibei Li",
      "Gaoxi Xiao"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2303.06024",
    "title": "A hybrid deep-learning-metaheuristic framework for discrete road network  design problems",
    "abstract": " Comments: Typos fixed, title revised, abstract extended, reference added ",
    "url": "https://arxiv.org/abs/2303.06024",
    "authors": [
      "Bahman Madadi",
      "Goncalo Homem de Almeida Correia"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Science and Game Theory (cs.GT)",
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2303.10096",
    "title": "Efficient Neural Generation of 4K Masks for Homogeneous Diffusion  Inpainting",
    "abstract": " Title: Efficient Neural Generation of 4K Masks for Homogeneous Diffusion  Inpainting ",
    "url": "https://arxiv.org/abs/2303.10096",
    "authors": [
      "Karl Schrader",
      "Pascal Peter",
      "Niklas Kämper",
      "Joachim Weickert"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.12095",
    "title": "Interpretable histopathology-based prediction of disease relevant  features in Inflammatory Bowel Disease biopsies using weakly-supervised deep  learning",
    "abstract": " Comments: Accepted to the Medical Imaging with Deep Learning (MIDL'23) ",
    "url": "https://arxiv.org/abs/2303.12095",
    "authors": [
      "Ricardo Mokhtari",
      "Azam Hamidinekoo",
      "Daniel Sutton",
      "Arthur Lewis",
      "Bastian Angermann",
      "Ulf Gehrmann",
      "Pal Lundin",
      "Hibret Adissu",
      "Junmei Cairns",
      "Jessica Neisen",
      "Emon Khan",
      "Daniel Marks",
      "Nia Khachapuridze",
      "Talha Qaiser",
      "Nikolay Burlutskiy"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.14744",
    "title": "Mind the Backbone: Minimizing Backbone Distortion for Robust Object  Detection",
    "abstract": " Comments: Project page: this http URL ",
    "url": "https://arxiv.org/abs/2303.14744",
    "authors": [
      "Kuniaki Saito",
      "Donghyun Kim",
      "Piotr Teterwak",
      "Rogerio Feris",
      "Kate Saenko"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.15771",
    "title": "TerrainNet: Visual Modeling of Complex Terrain for High-speed, Off-road  Navigation",
    "abstract": " Title: TerrainNet: Visual Modeling of Complex Terrain for High-speed, Off-road  Navigation ",
    "url": "https://arxiv.org/abs/2303.15771",
    "authors": [
      "Xiangyun Meng",
      "Nathan Hatch",
      "Alexander Lambert",
      "Anqi Li",
      "Nolan Wagener",
      "Matthew Schmittle",
      "JoonHo Lee",
      "Wentao Yuan",
      "Zoey Chen",
      "Samuel Deng",
      "Greg Okopal",
      "Dieter Fox",
      "Byron Boots",
      "Amirreza Shaban"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.04033",
    "title": "Exploring the Connection between Robust and Generative Models",
    "abstract": " Comments: technical report, 6 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2304.04033",
    "authors": [
      "Senad Beadini",
      "Iacopo Masi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.04163",
    "title": "Energy-Efficient URLLC Service Provision via a Near-Space Information  Network",
    "abstract": " Title: Energy-Efficient URLLC Service Provision via a Near-Space Information  Network ",
    "url": "https://arxiv.org/abs/2304.04163",
    "authors": [
      "Puguang An",
      "Peng Yang",
      "Xianbin Cao",
      "Kun Guo",
      "Yue Gao",
      "Tony Q. S. Quek"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.04327",
    "title": "Online Networks of Support in Distressed Environments: Solidarity and  Mobilization during the Russian Invasion of Ukraine",
    "abstract": " Comments: Accepted at ICWSM2023 Workshop: Data for the Wellbeing of Most Vulnerable ",
    "url": "https://arxiv.org/abs/2304.04327",
    "authors": [
      "Jinyi Ye",
      "Nikhil Jindal",
      "Francesco Pierri",
      "Luca Luceri"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.05071",
    "title": "Fracture Detection in Pediatric Wrist Trauma X-ray Images Using YOLOv8  Algorithm",
    "abstract": " Title: Fracture Detection in Pediatric Wrist Trauma X-ray Images Using YOLOv8  Algorithm ",
    "url": "https://arxiv.org/abs/2304.05071",
    "authors": [
      "Rui-Yang Ju",
      "Weiming Cai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.08106",
    "title": "Towards Tumour Graph Learning for Survival Prediction in Head & Neck  Cancer Patients",
    "abstract": " Comments: Published by Springer as part of the HECKTOR 2022 challenge proccedings this https URL ",
    "url": "https://arxiv.org/abs/2304.08106",
    "authors": [
      "Angel Victor Juanco Muller",
      "Joao F. C. Mota",
      "Keith A. Goatman",
      "Corne Hoogendoorn"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.01213",
    "title": "Integrated Sensing and Communication in Coordinated Cellular Networks",
    "abstract": " Comments: 6 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2305.01213",
    "authors": [
      "Dongfang Xu",
      "Chang Liu",
      "Shenghui Song",
      "Derrick Wing Kwan Ng"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2305.02783",
    "title": "Automated Code generation for Information Technology Tasks in YAML  through Large Language Models",
    "abstract": " Title: Automated Code generation for Information Technology Tasks in YAML  through Large Language Models ",
    "url": "https://arxiv.org/abs/2305.02783",
    "authors": [
      "Saurabh Pujar",
      "Luca Buratti",
      "Xiaojie Guo",
      "Nicolas Dupuis",
      "Burn Lewis",
      "Sahil Suneja",
      "Atin Sood",
      "Ganesh Nalawade",
      "Matthew Jones",
      "Alessandro Morari",
      "Ruchir Puri"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2305.03292",
    "title": "FedNC: A Secure and Efficient Federated Learning Method Inspired by  Network Coding",
    "abstract": " Title: FedNC: A Secure and Efficient Federated Learning Method Inspired by  Network Coding ",
    "url": "https://arxiv.org/abs/2305.03292",
    "authors": [
      "Yuchen Shi",
      "Zheqi Zhu",
      "Pingyi Fan",
      "Khaled B. Letaief",
      "Chenghui Peng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2305.03971",
    "title": "Adaptive loose optimization for robust question answering",
    "abstract": " Comments: 23 pages, 8 figures, 8 tables TOIS (Under Review) ",
    "url": "https://arxiv.org/abs/2305.03971",
    "authors": [
      "Jie Ma",
      "Pinghui Wang",
      "Zewei Wang",
      "Dechen Kong",
      "Min Hu",
      "Ting Han",
      "Jun Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.04379",
    "title": "Data Efficient Training with Imbalanced Label Sample Distribution for  Fashion Detection",
    "abstract": " Title: Data Efficient Training with Imbalanced Label Sample Distribution for  Fashion Detection ",
    "url": "https://arxiv.org/abs/2305.04379",
    "authors": [
      "Xin Shen",
      "Praful Agrawal",
      "Zhongwei Cheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.05228",
    "title": "Semantic Embedded Deep Neural Network: A Generic Approach to Boost  Multi-Label Image Classification Performance",
    "abstract": " Title: Semantic Embedded Deep Neural Network: A Generic Approach to Boost  Multi-Label Image Classification Performance ",
    "url": "https://arxiv.org/abs/2305.05228",
    "authors": [
      "Xin Shen",
      "Xiaonan Zhao",
      "Rui Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.05282",
    "title": "Fooling State-of-the-Art Deepfake Detection with High-Quality Deepfakes",
    "abstract": " Comments: Accepted at IH&MMSec '23 ",
    "url": "https://arxiv.org/abs/2305.05282",
    "authors": [
      "Arian Beckmann",
      "Anna Hilsmann",
      "Peter Eisert"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.05954",
    "title": "Enhancing the Performance of Transformer-based Spiking Neural Networks  by SNN-optimized Downsampling with Precise Gradient Backpropagation",
    "abstract": " Comments: 12 pages ",
    "url": "https://arxiv.org/abs/2305.05954",
    "authors": [
      "Chenlin Zhou",
      "Han Zhang",
      "Zhaokun Zhou",
      "Liutao Yu",
      "Zhengyu Ma",
      "Huihui Zhou",
      "Xiaopeng Fan",
      "Yonghong Tian"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.06141",
    "title": "Active Semantic Localization with Graph Neural Embedding",
    "abstract": " Comments: 7 pages, 5 figures, 1 table ",
    "url": "https://arxiv.org/abs/2305.06141",
    "authors": [
      "Mitsuki Yoshida",
      "Kanji Tanaka",
      "Ryogo Yamamoto",
      "Daiki Iwata"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.06310",
    "title": "SoGAR: Self-supervised Spatiotemporal Attention-based Social Group  Activity Recognition",
    "abstract": " Comments: Under review for PR journal; 32 pages, 7 figures. arXiv admin note: text overlap with arXiv:2303.12149 ",
    "url": "https://arxiv.org/abs/2305.06310",
    "authors": [
      "Naga VS Raviteja Chappa",
      "Pha Nguyen",
      "Alexander H Nelson",
      "Han-Seok Seo",
      "Xin Li",
      "Page Daniel Dobbs",
      "Khoa Luu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.07039",
    "title": "Value Iteration Networks with Gated Summarization Module",
    "abstract": " Comments: 13 pages,6 figures,submitted to IEEE ACCESS ",
    "url": "https://arxiv.org/abs/2305.07039",
    "authors": [
      "Jinyu Cai",
      "Jialong Li",
      "Mingyue Zhang",
      "Kenji Tei"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.07437",
    "title": "Continual Vision-Language Representation Learning with Off-Diagonal  Information",
    "abstract": " Title: Continual Vision-Language Representation Learning with Off-Diagonal  Information ",
    "url": "https://arxiv.org/abs/2305.07437",
    "authors": [
      "Zixuan Ni",
      "Longhui Wei",
      "Siliang Tang",
      "Yueting Zhuang",
      "Qi Tian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.07774",
    "title": "PanFlowNet: A Flow-Based Deep Network for Pan-sharpening",
    "abstract": " Title: PanFlowNet: A Flow-Based Deep Network for Pan-sharpening ",
    "url": "https://arxiv.org/abs/2305.07774",
    "authors": [
      "Gang Yang",
      "Xiangyong Cao",
      "Wenzhe Xiao",
      "Man Zhou",
      "Aiping Liu",
      "Xun chen",
      "Deyu Meng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2305.08159",
    "title": "Altered Topological Properties of Functional Brain Network Associated  with Alzheimer's Disease",
    "abstract": " Comments: 32 pages,17 figures, 5 tables, ",
    "url": "https://arxiv.org/abs/2305.08159",
    "authors": [
      "Yongcheng Yao"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.08459",
    "title": "Introduction to dynamical mean-field theory of generic random neural  networks",
    "abstract": " Comments: 25 pages, 3 figures, 32 references, two typos in the appendix are corrected ",
    "url": "https://arxiv.org/abs/2305.08459",
    "authors": [
      "Wenxuan Zou",
      "Haiping Huang"
    ],
    "subjectives": [
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (cs.LG)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2305.08747",
    "title": "Automating privacy decisions -- where to draw the line?",
    "abstract": " Comments: 9 pages, 2 figures, accepted for publication at IWPE2023 ",
    "url": "https://arxiv.org/abs/2305.08747",
    "authors": [
      "Victor Morel",
      "Simone Fischer-Hübner"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)"
    ]
  }
]