[
  {
    "id": "arXiv:2307.11100",
    "title": "CSSL-RHA: Contrastive Self-Supervised Learning for Robust Handwriting  Authentication",
    "abstract": "Handwriting authentication is a valuable tool used in various fields, such as fraud prevention and cultural heritage protection. However, it remains a challenging task due to the complex features, severe damage, and lack of supervision. In this paper, we propose a novel Contrastive Self-Supervised Learning framework for Robust Handwriting Authentication (CSSL-RHA) to address these issues. It can dynamically learn complex yet important features and accurately predict writer identities. Specifically, to remove the negative effects of imperfections and redundancy, we design an information-theoretic filter for pre-processing and propose a novel adaptive matching scheme to represent images as patches of local regions dominated by more important features. Through online optimization at inference time, the most informative patch embeddings are identified as the \"most important\" elements. Furthermore, we employ contrastive self-supervised training with a momentum-based paradigm to learn more general statistical structures of handwritten data without supervision. We conduct extensive experiments on five benchmark datasets and our manually annotated dataset EN-HA, which demonstrate the superiority of our CSSL-RHA compared to baselines. Additionally, we show that our proposed model can still effectively achieve authentication even under abnormal circumstances, such as data falsification and corruption. ",
    "url": "https://arxiv.org/abs/2307.11100",
    "authors": [
      "Jingyao Wang",
      "Luntian Mou",
      "Changwen Zheng",
      "Wen Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2307.11112",
    "title": "Comparison between transformers and convolutional models for  fine-grained classification of insects",
    "abstract": "Fine-grained classification is challenging due to the difficulty of finding discriminatory features. This problem is exacerbated when applied to identifying species within the same taxonomical class. This is because species are often sharing morphological characteristics that make them difficult to differentiate. We consider the taxonomical class of Insecta. The identification of insects is essential in biodiversity monitoring as they are one of the inhabitants at the base of many ecosystems. Citizen science is doing brilliant work of collecting images of insects in the wild giving the possibility to experts to create improved distribution maps in all countries. We have billions of images that need to be automatically classified and deep neural network algorithms are one of the main techniques explored for fine-grained tasks. At the SOTA, the field of deep learning algorithms is extremely fruitful, so how to identify the algorithm to use? We focus on Odonata and Coleoptera orders, and we propose an initial comparative study to analyse the two best-known layer structures for computer vision: transformer and convolutional layers. We compare the performance of T2TViT, a fully transformer-base, EfficientNet, a fully convolutional-base, and ViTAE, a hybrid. We analyse the performance of the three models in identical conditions evaluating the performance per species, per morph together with sex, the inference time, and the overall performance with unbalanced datasets of images from smartphones. Although we observe high performances with all three families of models, our analysis shows that the hybrid model outperforms the fully convolutional-base and fully transformer-base models on accuracy performance and the fully transformer-base model outperforms the others on inference speed and, these prove the transformer to be robust to the shortage of samples and to be faster at inference time. ",
    "url": "https://arxiv.org/abs/2307.11112",
    "authors": [
      "Rita Pucci",
      "Vincent J. Kalkman",
      "Dan Stowell"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.11196",
    "title": "Exact Community Recovery in the Geometric SBM",
    "abstract": "We study the problem of exact community recovery in the Geometric Stochastic Block Model (GSBM), where each vertex has an unknown community label as well as a known position, generated according to a Poisson point process in $\\mathbb{R}^d$. Edges are formed independently conditioned on the community labels and positions, where vertices may only be connected by an edge if they are within a prescribed distance of each other. The GSBM thus favors the formation of dense local subgraphs, which commonly occur in real-world networks, a property that makes the GSBM qualitatively very different from the standard Stochastic Block Model (SBM). We propose a linear-time algorithm for exact community recovery, which succeeds down to the information-theoretic threshold, confirming a conjecture of Abbe, Baccelli, and Sankararaman. The algorithm involves two phases. The first phase exploits the density of local subgraphs to propagate estimated community labels among sufficiently occupied subregions, and produces an almost-exact vertex labeling. The second phase then refines the initial labels using a Poisson testing procedure. Thus, the GSBM enjoys local to global amplification just as the SBM, with the advantage of admitting an information-theoretically optimal, linear-time algorithm. ",
    "url": "https://arxiv.org/abs/2307.11196",
    "authors": [
      "Julia Gaudio",
      "Xiaochun Niu",
      "Ermin Wei"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Probability (math.PR)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2307.11197",
    "title": "Heuristic Hyperparameter Choice for Image Anomaly Detection",
    "abstract": "Anomaly detection (AD) in images is a fundamental computer vision problem by deep learning neural network to identify images deviating significantly from normality. The deep features extracted from pretrained models have been proved to be essential for AD based on multivariate Gaussian distribution analysis. However, since models are usually pretrained on a large dataset for classification tasks such as ImageNet, they might produce lots of redundant features for AD, which increases computational cost and degrades the performance. We aim to do the dimension reduction of Negated Principal Component Analysis (NPCA) for these features. So we proposed some heuristic to choose hyperparameter of NPCA algorithm for getting as fewer components of features as possible while ensuring a good performance. ",
    "url": "https://arxiv.org/abs/2307.11197",
    "authors": [
      "Zeyu Jiang",
      "João P. C. Bertoldo",
      "Etienne Decencière"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.11206",
    "title": "Towards Ontologically Grounded and Language-Agnostic Knowledge Graphs",
    "abstract": "Knowledge graphs (KGs) have become the standard technology for the representation of factual information in applications such as recommendation engines, search, and question-answering systems. However, the continual updating of KGs, as well as the integration of KGs from different domains and KGs in different languages, remains to be a major challenge. What we suggest here is that by a reification of abstract objects and by acknowledging the ontological distinction between concepts and types, we arrive at an ontologically grounded and language-agnostic representation that can alleviate the difficulties in KG integration. ",
    "url": "https://arxiv.org/abs/2307.11206",
    "authors": [
      "Walid S. Saba"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.11211",
    "title": "The Effect of Epidemiological Cohort Creation on the Machine Learning  Prediction of Homelessness and Police Interaction Outcomes Using  Administrative Health Care Data",
    "abstract": "Background: Mental illness can lead to adverse outcomes such as homelessness and police interaction and understanding of the events leading up to these adverse outcomes is important. Predictive models may help identify individuals at risk of such adverse outcomes. Using a fixed observation window cohort with logistic regression (LR) or machine learning (ML) models can result in lower performance when compared with adaptive and parcellated windows. Method: An administrative healthcare dataset was used, comprising of 240,219 individuals in Calgary, Alberta, Canada who were diagnosed with addiction or mental health (AMH) between April 1, 2013, and March 31, 2018. The cohort was followed for 2 years to identify factors associated with homelessness and police interactions. To understand the benefit of flexible windows to predictive models, an alternative cohort was created. Then LR and ML models, including random forests (RF), and extreme gradient boosting (XGBoost) were compared in the two cohorts. Results: Among 237,602 individuals, 0.8% (1,800) experienced first homelessness, while 0.32% (759) reported initial police interaction among 237,141 individuals. Male sex (AORs: H=1.51, P=2.52), substance disorder (AORs: H=3.70, P=2.83), psychiatrist visits (AORs: H=1.44, P=1.49), and drug abuse (AORs: H=2.67, P=1.83) were associated with initial homelessness (H) and police interaction (P). XGBoost showed superior performance using the flexible method (sensitivity =91%, AUC =90% for initial homelessness, and sensitivity =90%, AUC=89% for initial police interaction) Conclusion: This study identified key features associated with initial homelessness and police interaction and demonstrated that flexible windows can improve predictive modeling. ",
    "url": "https://arxiv.org/abs/2307.11211",
    "authors": [
      "Faezehsadat Shahidi",
      "M. Ethan MacDonald",
      "Dallas Seitz",
      "Geoffrey Messier"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2307.11224",
    "title": "Jina Embeddings: A Novel Set of High-Performance Sentence Embedding  Models",
    "abstract": "Jina Embeddings constitutes a set of high-performance sentence embedding models adept at translating various textual inputs into numerical representations, thereby capturing the semantic essence of the text. While these models are not exclusively designed for text generation, they excel in applications such as dense retrieval and semantic textual similarity. This paper details the development of Jina Embeddings, starting with the creation of a high-quality pairwise and triplet dataset. It underlines the crucial role of data cleaning in dataset preparation, gives in-depth insights into the model training process, and concludes with a comprehensive performance evaluation using the Massive Textual Embedding Benchmark (MTEB). ",
    "url": "https://arxiv.org/abs/2307.11224",
    "authors": [
      "Michael Günther",
      "Louis Milliken",
      "Jonathan Geuter",
      "Georgios Mastrapas",
      "Bo Wang",
      "Han Xiao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.11234",
    "title": "QDC: Quantum Diffusion Convolution Kernels on Graphs",
    "abstract": "Graph convolutional neural networks (GCNs) operate by aggregating messages over local neighborhoods given the prediction task under interest. Many GCNs can be understood as a form of generalized diffusion of input features on the graph, and significant work has been dedicated to improving predictive accuracy by altering the ways of message passing. In this work, we propose a new convolution kernel that effectively rewires the graph according to the occupation correlations of the vertices by trading on the generalized diffusion paradigm for the propagation of a quantum particle over the graph. We term this new convolution kernel the Quantum Diffusion Convolution (QDC) operator. In addition, we introduce a multiscale variant that combines messages from the QDC operator and the traditional combinatorial Laplacian. To understand our method, we explore the spectral dependence of homophily and the importance of quantum dynamics in the construction of a bandpass filter. Through these studies, as well as experiments on a range of datasets, we observe that QDC improves predictive performance on the widely used benchmark datasets when compared to similar methods. ",
    "url": "https://arxiv.org/abs/2307.11234",
    "authors": [
      "Thomas Markovich"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Quantum Physics (quant-ph)"
    ]
  },
  {
    "id": "arXiv:2307.11259",
    "title": "Towards Non-Parametric Models for Confidence Aware Image Prediction from  Low Data using Gaussian Processes",
    "abstract": "The ability to envision future states is crucial to informed decision making while interacting with dynamic environments. With cameras providing a prevalent and information rich sensing modality, the problem of predicting future states from image sequences has garnered a lot of attention. Current state of the art methods typically train large parametric models for their predictions. Though often able to predict with accuracy, these models rely on the availability of large training datasets to converge to useful solutions. In this paper we focus on the problem of predicting future images of an image sequence from very little training data. To approach this problem, we use non-parametric models to take a probabilistic approach to image prediction. We generate probability distributions over sequentially predicted images and propagate uncertainty through time to generate a confidence metric for our predictions. Gaussian Processes are used for their data efficiency and ability to readily incorporate new training data online. We showcase our method by successfully predicting future frames of a smooth fluid simulation environment. ",
    "url": "https://arxiv.org/abs/2307.11259",
    "authors": [
      "Nikhil U. Shinde",
      "Florian Richter",
      "Michael C. Yip"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11280",
    "title": "Epsilon*: Privacy Metric for Machine Learning Models",
    "abstract": "We introduce Epsilon*, a new privacy metric for measuring the privacy risk of a single model instance prior to, during, or after deployment of privacy mitigation strategies. The metric does not require access to the training data sampling or model training algorithm. Epsilon* is a function of true positive and false positive rates in a hypothesis test used by an adversary in a membership inference attack. We distinguish between quantifying the privacy loss of a trained model instance and quantifying the privacy loss of the training mechanism which produces this model instance. Existing approaches in the privacy auditing literature provide lower bounds for the latter, while our metric provides a lower bound for the former by relying on an (${\\epsilon}$,${\\delta}$)-type of quantification of the privacy of the trained model instance. We establish a relationship between these lower bounds and show how to implement Epsilon* to avoid numerical and noise amplification instability. We further show in experiments on benchmark public data sets that Epsilon* is sensitive to privacy risk mitigation by training with differential privacy (DP), where the value of Epsilon* is reduced by up to 800% compared to the Epsilon* values of non-DP trained baseline models. This metric allows privacy auditors to be independent of model owners, and enables all decision-makers to visualize the privacy-utility landscape to make informed decisions regarding the trade-offs between model privacy and utility. ",
    "url": "https://arxiv.org/abs/2307.11280",
    "authors": [
      "Diana M. Negoescu",
      "Humberto Gonzalez",
      "Saad Eddin Al Orjany",
      "Jilei Yang",
      "Yuliia Lut",
      "Rahul Tandra",
      "Xiaowen Zhang",
      "Xinyi Zheng",
      "Zach Douglas",
      "Vidita Nolkha",
      "Parvez Ahammad",
      "Gennady Samorodnitsky"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2307.11289",
    "title": "PI-VEGAN: Physics Informed Variational Embedding Generative Adversarial  Networks for Stochastic Differential Equations",
    "abstract": "We present a new category of physics-informed neural networks called physics informed variational embedding generative adversarial network (PI-VEGAN), that effectively tackles the forward, inverse, and mixed problems of stochastic differential equations. In these scenarios, the governing equations are known, but only a limited number of sensor measurements of the system parameters are available. We integrate the governing physical laws into PI-VEGAN with automatic differentiation, while introducing a variational encoder for approximating the latent variables of the actual distribution of the measurements. These latent variables are integrated into the generator to facilitate accurate learning of the characteristics of the stochastic partial equations. Our model consists of three components, namely the encoder, generator, and discriminator, each of which is updated alternatively employing the stochastic gradient descent algorithm. We evaluate the effectiveness of PI-VEGAN in addressing forward, inverse, and mixed problems that require the concurrent calculation of system parameters and solutions. Numerical results demonstrate that the proposed method achieves satisfactory stability and accuracy in comparison with the previous physics-informed generative adversarial network (PI-WGAN). ",
    "url": "https://arxiv.org/abs/2307.11289",
    "authors": [
      "Ruisong Gao",
      "Yufeng Wang",
      "Min Yang",
      "Chuanjun Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.11298",
    "title": "A First Look at Fairness of Machine Learning Based Code Reviewer  Recommendation",
    "abstract": "The fairness of machine learning (ML) approaches is critical to the reliability of modern artificial intelligence systems. Despite extensive study on this topic, the fairness of ML models in the software engineering (SE) domain has not been well explored yet. As a result, many ML-powered software systems, particularly those utilized in the software engineering community, continue to be prone to fairness issues. Taking one of the typical SE tasks, i.e., code reviewer recommendation, as a subject, this paper conducts the first study toward investigating the issue of fairness of ML applications in the SE domain. Our empirical study demonstrates that current state-of-the-art ML-based code reviewer recommendation techniques exhibit unfairness and discriminating behaviors. Specifically, male reviewers get on average 7.25% more recommendations than female code reviewers compared to their distribution in the reviewer set. This paper also discusses the reasons why the studied ML-based code reviewer recommendation systems are unfair and provides solutions to mitigate the unfairness. Our study further indicates that the existing mitigation methods can enhance fairness by 100% in projects with a similar distribution of protected and privileged groups, but their effectiveness in improving fairness on imbalanced or skewed data is limited. Eventually, we suggest a solution to overcome the drawbacks of existing mitigation techniques and tackle bias in datasets that are imbalanced or skewed. ",
    "url": "https://arxiv.org/abs/2307.11298",
    "authors": [
      "Mohammad Mahdi Mohajer",
      "Alvine Boaye Belle",
      "Nima Shiri harzevili",
      "Junjie Wang",
      "Hadi Hemmati",
      "Song Wang",
      "Zhen Ming",
      "Jiang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2307.11307",
    "title": "EndoSurf: Neural Surface Reconstruction of Deformable Tissues with  Stereo Endoscope Videos",
    "abstract": "Reconstructing soft tissues from stereo endoscope videos is an essential prerequisite for many medical applications. Previous methods struggle to produce high-quality geometry and appearance due to their inadequate representations of 3D scenes. To address this issue, we propose a novel neural-field-based method, called EndoSurf, which effectively learns to represent a deforming surface from an RGBD sequence. In EndoSurf, we model surface dynamics, shape, and texture with three neural fields. First, 3D points are transformed from the observed space to the canonical space using the deformation field. The signed distance function (SDF) field and radiance field then predict their SDFs and colors, respectively, with which RGBD images can be synthesized via differentiable volume rendering. We constrain the learned shape by tailoring multiple regularization strategies and disentangling geometry and appearance. Experiments on public endoscope datasets demonstrate that EndoSurf significantly outperforms existing solutions, particularly in reconstructing high-fidelity shapes. Code is available at https://github.com/Ruyi-Zha/endosurf.git. ",
    "url": "https://arxiv.org/abs/2307.11307",
    "authors": [
      "Ruyi Zha",
      "Xuelian Cheng",
      "Hongdong Li",
      "Mehrtash Harandi",
      "Zongyuan Ge"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11323",
    "title": "HVDetFusion: A Simple and Robust Camera-Radar Fusion Framework",
    "abstract": "In the field of autonomous driving, 3D object detection is a very important perception module. Although the current SOTA algorithm combines Camera and Lidar sensors, limited by the high price of Lidar, the current mainstream landing schemes are pure Camera sensors or Camera+Radar sensors. In this study, we propose a new detection algorithm called HVDetFusion, which is a multi-modal detection algorithm that not only supports pure camera data as input for detection, but also can perform fusion input of radar data and camera data. The camera stream does not depend on the input of Radar data, thus addressing the downside of previous methods. In the pure camera stream, we modify the framework of Bevdet4D for better perception and more efficient inference, and this stream has the whole 3D detection output. Further, to incorporate the benefits of Radar signals, we use the prior information of different object positions to filter the false positive information of the original radar data, according to the positioning information and radial velocity information recorded by the radar sensors to supplement and fuse the BEV features generated by the original camera data, and the effect is further improved in the process of fusion training. Finally, HVDetFusion achieves the new state-of-the-art 67.4\\% NDS on the challenging nuScenes test set among all camera-radar 3D object detectors. The code is available at https://github.com/HVXLab/HVDetFusion ",
    "url": "https://arxiv.org/abs/2307.11323",
    "authors": [
      "Kai Lei",
      "Zhan Chen",
      "Shuman Jia",
      "Xiaoteng Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.11334",
    "title": "Improving Transferability of Adversarial Examples via Bayesian Attacks",
    "abstract": "This paper presents a substantial extension of our work published at ICLR. Our ICLR work advocated for enhancing transferability in adversarial examples by incorporating a Bayesian formulation into model parameters, which effectively emulates the ensemble of infinitely many deep neural networks, while, in this paper, we introduce a novel extension by incorporating the Bayesian formulation into the model input as well, enabling the joint diversification of both the model input and model parameters. Our empirical findings demonstrate that: 1) the combination of Bayesian formulations for both the model input and model parameters yields significant improvements in transferability; 2) by introducing advanced approximations of the posterior distribution over the model input, adversarial transferability achieves further enhancement, surpassing all state-of-the-arts when attacking without model fine-tuning. Moreover, we propose a principled approach to fine-tune model parameters in such an extended Bayesian formulation. The derived optimization objective inherently encourages flat minima in the parameter space and input space. Extensive experiments demonstrate that our method achieves a new state-of-the-art on transfer-based attacks, improving the average success rate on ImageNet and CIFAR-10 by 19.14% and 2.08%, respectively, when comparing with our ICLR basic Bayesian method. We will make our code publicly available. ",
    "url": "https://arxiv.org/abs/2307.11334",
    "authors": [
      "Qizhang Li",
      "Yiwen Guo",
      "Xiaochen Yang",
      "Wangmeng Zuo",
      "Hao Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11335",
    "title": "Tri-MipRF: Tri-Mip Representation for Efficient Anti-Aliasing Neural  Radiance Fields",
    "abstract": "Despite the tremendous progress in neural radiance fields (NeRF), we still face a dilemma of the trade-off between quality and efficiency, e.g., MipNeRF presents fine-detailed and anti-aliased renderings but takes days for training, while Instant-ngp can accomplish the reconstruction in a few minutes but suffers from blurring or aliasing when rendering at various distances or resolutions due to ignoring the sampling area. To this end, we propose a novel Tri-Mip encoding that enables both instant reconstruction and anti-aliased high-fidelity rendering for neural radiance fields. The key is to factorize the pre-filtered 3D feature spaces in three orthogonal mipmaps. In this way, we can efficiently perform 3D area sampling by taking advantage of 2D pre-filtered feature maps, which significantly elevates the rendering quality without sacrificing efficiency. To cope with the novel Tri-Mip representation, we propose a cone-casting rendering technique to efficiently sample anti-aliased 3D features with the Tri-Mip encoding considering both pixel imaging and observing distance. Extensive experiments on both synthetic and real-world datasets demonstrate our method achieves state-of-the-art rendering quality and reconstruction speed while maintaining a compact representation that reduces 25% model size compared against Instant-ngp. ",
    "url": "https://arxiv.org/abs/2307.11335",
    "authors": [
      "Wenbo Hu",
      "Yuling Wang",
      "Lin Ma",
      "Bangbang Yang",
      "Lin Gao",
      "Xiao Liu",
      "Yuewen Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2307.11336",
    "title": "Character Time-series Matching For Robust License Plate Recognition",
    "abstract": "Automatic License Plate Recognition (ALPR) is becoming a popular study area and is applied in many fields such as transportation or smart city. However, there are still several limitations when applying many current methods to practical problems due to the variation in real-world situations such as light changes, unclear License Plate (LP) characters, and image quality. Almost recent ALPR algorithms process on a single frame, which reduces accuracy in case of worse image quality. This paper presents methods to improve license plate recognition accuracy by tracking the license plate in multiple frames. First, the Adaptive License Plate Rotation algorithm is applied to correctly align the detected license plate. Second, we propose a method called Character Time-series Matching to recognize license plate characters from many consequence frames. The proposed method archives high performance in the UFPR-ALPR dataset which is \\boldmath$96.7\\%$ accuracy in real-time on RTX A5000 GPU card. We also deploy the algorithm for the Vietnamese ALPR system. The accuracy for license plate detection and character recognition are 0.881 and 0.979 $mAP^{test}$@.5 respectively. The source code is available at https://github.com/chequanghuy/Character-Time-series-Matching.git ",
    "url": "https://arxiv.org/abs/2307.11336",
    "authors": [
      "Quang Huy Che",
      "Tung Do Thanh",
      "Cuong Truong Van"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11339",
    "title": "Chrion: Optimizing Recurrent Neural Network Inference by Collaboratively  Utilizing CPUs and GPUs",
    "abstract": "Deploying deep learning models in cloud clusters provides efficient and prompt inference services to accommodate the widespread application of deep learning. These clusters are usually equipped with host CPUs and accelerators with distinct responsibilities to handle serving requests, i.e. generalpurpose CPUs for input preprocessing and domain-specific GPUs for forward computation. Recurrent neural networks play an essential role in handling temporal inputs and display distinctive computation characteristics because of their high inter-operator parallelism. Hence, we propose Chrion to optimize recurrent neural network inference by collaboratively utilizing CPUs and GPUs. We formulate the model deployment in the CPU-GPU cluster as an NP-hard scheduling problem of directed acyclic graphs on heterogeneous devices. Given an input model in the ONNX format and user-defined SLO requirement, Chrion firstly preprocesses the model by model parsing and profiling, and then partitions the graph to select execution devices for each operator. When an online request arrives, Chrion performs forward computation according to the graph partition by executing the operators on the CPU and GPU in parallel. Our experimental results show that the execution time can be reduced by 19.4% at most in the latency-optimal pattern and GPU memory footprint by 67.5% in the memory-optimal pattern compared with the execution on the GPU. ",
    "url": "https://arxiv.org/abs/2307.11339",
    "authors": [
      "Zinuo Cai",
      "Hao Wang",
      "Tao Song",
      "Yang Hua",
      "Ruhui Ma",
      "Haibing Guan"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2307.11341",
    "title": "OpenGDA: Graph Domain Adaptation Benchmark for Cross-network Learning",
    "abstract": "Graph domain adaptation models are widely adopted in cross-network learning tasks, with the aim of transferring labeling or structural knowledge. Currently, there mainly exist two limitations in evaluating graph domain adaptation models. On one side, they are primarily tested for the specific cross-network node classification task, leaving tasks at edge-level and graph-level largely under-explored. Moreover, they are primarily tested in limited scenarios, such as social networks or citation networks, lacking validation of model's capability in richer scenarios. As comprehensively assessing models could enhance model practicality in real-world applications, we propose a benchmark, known as OpenGDA. It provides abundant pre-processed and unified datasets for different types of tasks (node, edge, graph). They originate from diverse scenarios, covering web information systems, urban systems and natural systems. Furthermore, it integrates state-of-the-art models with standardized and end-to-end pipelines. Overall, OpenGDA provides a user-friendly, scalable and reproducible benchmark for evaluating graph domain adaptation models. The benchmark experiments highlight the challenges of applying GDA models to real-world applications with consistent good performance, and potentially provide insights to future research. As an emerging project, OpenGDA will be regularly updated with new datasets and models. It could be accessed from https://github.com/Skyorca/OpenGDA. ",
    "url": "https://arxiv.org/abs/2307.11341",
    "authors": [
      "Boshen Shi",
      "Yongqing Wang",
      "Fangda Guo",
      "Jiangli Shao",
      "Huawei Shen",
      "Xueqi Cheng"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Digital Libraries (cs.DL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2307.11344",
    "title": "DEFTri: A Few-Shot Label Fused Contextual Representation Learning For  Product Defect Triage in e-Commerce",
    "abstract": "Defect Triage is a time-sensitive and critical process in a large-scale agile software development lifecycle for e-commerce. Inefficiencies arising from human and process dependencies in this domain have motivated research in automated approaches using machine learning to accurately assign defects to qualified teams. This work proposes a novel framework for automated defect triage (DEFTri) using fine-tuned state-of-the-art pre-trained BERT on labels fused text embeddings to improve contextual representations from human-generated product defects. For our multi-label text classification defect triage task, we also introduce a Walmart proprietary dataset of product defects using weak supervision and adversarial learning, in a few-shot setting. ",
    "url": "https://arxiv.org/abs/2307.11344",
    "authors": [
      "Ipsita Mohanty"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.11359",
    "title": "ClickINC: In-network Computing as a Service in Heterogeneous  Programmable Data-center Networks",
    "abstract": "In-Network Computing (INC) has found many applications for performance boosts or cost reduction. However, given heterogeneous devices, diverse applications, and multi-path network typologies, it is cumbersome and error-prone for application developers to effectively utilize the available network resources and gain predictable benefits without impeding normal network functions. Previous work is oriented to network operators more than application developers. We develop ClickINC to streamline the INC programming and deployment using a unified and automated workflow. ClickINC provides INC developers a modular programming abstractions, without concerning to the states of the devices and the network topology. We describe the ClickINC framework, model, language, workflow, and corresponding algorithms. Experiments on both an emulator and a prototype system demonstrate its feasibility and benefits. ",
    "url": "https://arxiv.org/abs/2307.11359",
    "authors": [
      "Wenquan Xu",
      "Zijian Zhang",
      "Yong Feng",
      "Haoyu Song",
      "Zhikang Chen",
      "Wenfei Wu",
      "Guyue Liu",
      "Yinchao Zhang",
      "Shuxin Liu",
      "Zerui Tian",
      "Bin Liu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.11360",
    "title": "ParGANDA: Making Synthetic Pedestrians A Reality For Object Detection",
    "abstract": "Object detection is the key technique to a number of Computer Vision applications, but it often requires large amounts of annotated data to achieve decent results. Moreover, for pedestrian detection specifically, the collected data might contain some personally identifiable information (PII), which is highly restricted in many countries. This label intensive and privacy concerning task has recently led to an increasing interest in training the detection models using synthetically generated pedestrian datasets collected with a photo-realistic video game engine. The engine is able to generate unlimited amounts of data with precise and consistent annotations, which gives potential for significant gains in the real-world applications. However, the use of synthetic data for training introduces a synthetic-to-real domain shift aggravating the final performance. To close the gap between the real and synthetic data, we propose to use a Generative Adversarial Network (GAN), which performsparameterized unpaired image-to-image translation to generate more realistic images. The key benefit of using the GAN is its intrinsic preference of low-level changes to geometric ones, which means annotations of a given synthetic image remain accurate even after domain translation is performed thus eliminating the need for labeling real data. We extensively experimented with the proposed method using MOTSynth dataset to train and MOT17 and MOT20 detection datasets to test, with experimental results demonstrating the effectiveness of this method. Our approach not only produces visually plausible samples but also does not require any labels of the real domain thus making it applicable to the variety of downstream tasks. ",
    "url": "https://arxiv.org/abs/2307.11360",
    "authors": [
      "Daria Reshetova",
      "Guanhang Wu",
      "Marcel Puyat",
      "Chunhui Gu",
      "Huizhong Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11375",
    "title": "LatentAugment: Data Augmentation via Guided Manipulation of GAN's Latent  Space",
    "abstract": "Data Augmentation (DA) is a technique to increase the quantity and diversity of the training data, and by that alleviate overfitting and improve generalisation. However, standard DA produces synthetic data for augmentation with limited diversity. Generative Adversarial Networks (GANs) may unlock additional information in a dataset by generating synthetic samples having the appearance of real images. However, these models struggle to simultaneously address three key requirements: fidelity and high-quality samples; diversity and mode coverage; and fast sampling. Indeed, GANs generate high-quality samples rapidly, but have poor mode coverage, limiting their adoption in DA applications. We propose LatentAugment, a DA strategy that overcomes the low diversity of GANs, opening up for use in DA applications. Without external supervision, LatentAugment modifies latent vectors and moves them into latent space regions to maximise the synthetic images' diversity and fidelity. It is also agnostic to the dataset and the downstream task. A wide set of experiments shows that LatentAugment improves the generalisation of a deep model translating from MRI-to-CT beating both standard DA as well GAN-based sampling. Moreover, still in comparison with GAN-based sampling, LatentAugment synthetic samples show superior mode coverage and diversity. Code is available at: https://github.com/ltronchin/LatentAugment. ",
    "url": "https://arxiv.org/abs/2307.11375",
    "authors": [
      "Lorenzo Tronchin",
      "Minh H. Vu",
      "Paolo Soda",
      "Tommy Löfstedt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2307.11411",
    "title": "Deep Directly-Trained Spiking Neural Networks for Object Detection",
    "abstract": "Spiking neural networks (SNNs) are brain-inspired energy-efficient models that encode information in spatiotemporal dynamics. Recently, deep SNNs trained directly have shown great success in achieving high performance on classification tasks with very few time steps. However, how to design a directly-trained SNN for the regression task of object detection still remains a challenging problem. To address this problem, we propose EMS-YOLO, a novel directly-trained SNN framework for object detection, which is the first trial to train a deep SNN with surrogate gradients for object detection rather than ANN-SNN conversion strategies. Specifically, we design a full-spike residual block, EMS-ResNet, which can effectively extend the depth of the directly-trained SNN with low power consumption. Furthermore, we theoretically analyze and prove the EMS-ResNet could avoid gradient vanishing or exploding. The results demonstrate that our approach outperforms the state-of-the-art ANN-SNN conversion methods (at least 500 time steps) in extremely fewer time steps (only 4 time steps). It is shown that our model could achieve comparable performance to the ANN with the same architecture while consuming 5.83 times less energy on the frame-based COCO Dataset and the event-based Gen1 Dataset. ",
    "url": "https://arxiv.org/abs/2307.11411",
    "authors": [
      "Qiaoyi Su",
      "Yuhong Chou",
      "Yifan Hu",
      "Jianing Li",
      "Shijie Mei",
      "Ziyang Zhang",
      "Guoqi Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.11418",
    "title": "FaceCLIPNeRF: Text-driven 3D Face Manipulation using Deformable Neural  Radiance Fields",
    "abstract": "As recent advances in Neural Radiance Fields (NeRF) have enabled high-fidelity 3D face reconstruction and novel view synthesis, its manipulation also became an essential task in 3D vision. However, existing manipulation methods require extensive human labor, such as a user-provided semantic mask and manual attribute search unsuitable for non-expert users. Instead, our approach is designed to require a single text to manipulate a face reconstructed with NeRF. To do so, we first train a scene manipulator, a latent code-conditional deformable NeRF, over a dynamic scene to control a face deformation using the latent code. However, representing a scene deformation with a single latent code is unfavorable for compositing local deformations observed in different instances. As so, our proposed Position-conditional Anchor Compositor (PAC) learns to represent a manipulated scene with spatially varying latent codes. Their renderings with the scene manipulator are then optimized to yield high cosine similarity to a target text in CLIP embedding space for text-driven manipulation. To the best of our knowledge, our approach is the first to address the text-driven manipulation of a face reconstructed with NeRF. Extensive results, comparisons, and ablation studies demonstrate the effectiveness of our approach. ",
    "url": "https://arxiv.org/abs/2307.11418",
    "authors": [
      "Sungwon Hwang",
      "Junha Hyung",
      "Daejin Kim",
      "Min-Jung Kim",
      "Jaegul Choo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11438",
    "title": "Attention Consistency Refined Masked Frequency Forgery Representation  for Generalizing Face Forgery Detection",
    "abstract": "Due to the successful development of deep image generation technology, visual data forgery detection would play a more important role in social and economic security. Existing forgery detection methods suffer from unsatisfactory generalization ability to determine the authenticity in the unseen domain. In this paper, we propose a novel Attention Consistency Refined masked frequency forgery representation model toward generalizing face forgery detection algorithm (ACMF). Most forgery technologies always bring in high-frequency aware cues, which make it easy to distinguish source authenticity but difficult to generalize to unseen artifact types. The masked frequency forgery representation module is designed to explore robust forgery cues by randomly discarding high-frequency information. In addition, we find that the forgery attention map inconsistency through the detection network could affect the generalizability. Thus, the forgery attention consistency is introduced to force detectors to focus on similar attention regions for better generalization ability. Experiment results on several public face forgery datasets (FaceForensic++, DFD, Celeb-DF, and WDF datasets) demonstrate the superior performance of the proposed method compared with the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2307.11438",
    "authors": [
      "Decheng Liu",
      "Tao Chen",
      "Chunlei Peng",
      "Nannan Wang",
      "Ruimin Hu",
      "Xinbo Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11454",
    "title": "Dissecting Code Vulnerabilities: Insights from C++ and Java  Vulnerability Analysis with ReVeal Model",
    "abstract": "This study presents an analysis conducted on a real-world dataset of Java vulnerability-fixing commits. The dataset consists of commits with varying numbers of modified methods, leading to a natural partitioning based on the number of changed functions. The research aims to address several key questions. Firstly, the study investigates the optimal parameter selection for ReVeal, a state-of-the-art model, in order to achieve its best performance. Secondly, it explores the contributions of different parts of the Java dataset towards vulnerability detection. Lastly, the study evaluates the model's performance in separating close-to-vulnerable methods (vulnerable methods and their fixed versions) from randomly selected safe code, as well as the finer separation of vulnerable methods from their fixed versions within the set of close-to-vulnerable methods. The research employs a series of experiments to answer these questions and derive meaningful insights. ",
    "url": "https://arxiv.org/abs/2307.11454",
    "authors": [
      "Ravil Mussabayev"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.11464",
    "title": "Supporting Post-disaster Recovery with Agent-based Modeling in  Multilayer Socio-physical Networks",
    "abstract": "The examination of post-disaster recovery (PDR) in a socio-physical system enables us to elucidate the complex relationships between humans and infrastructures. Although existing studies have identified many patterns in the PDR process, they fall short of describing how individual recoveries contribute to the overall recovery of the system. To enhance the understanding of individual return behavior and the recovery of point-of-interests (POIs), we propose an agent-based model (ABM), called PostDisasterSim. We apply the model to analyze the recovery of five counties in Texas following Hurricane Harvey in 2017. Specifically, we construct a three-layer network comprising the human layer, the social infrastructure layer, and the physical infrastructure layer, using mobile phone location data and POI data. Based on prior studies and a household survey, we develop the ABM to simulate how evacuated individuals return to their homes, and social and physical infrastructures recover. By implementing the ABM, we unveil the heterogeneity in recovery dynamics in terms of agent types, housing types, household income levels, and geographical locations. Moreover, simulation results across nine scenarios quantitatively demonstrate the positive effects of social and physical infrastructure improvement plans. This study can assist disaster scientists in uncovering nuanced recovery patterns and policymakers in translating policies like resource allocation into practice. ",
    "url": "https://arxiv.org/abs/2307.11464",
    "authors": [
      "Jiawei Xue",
      "Sangung Park",
      "Washim Uddin Mondal",
      "Sandro Martinelli Reia",
      "Tong Yao",
      "Satish V. Ukkusuri"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2307.11466",
    "title": "MatSpectNet: Material Segmentation Network with Domain-Aware and  Physically-Constrained Hyperspectral Reconstruction",
    "abstract": "Achieving accurate material segmentation for 3-channel RGB images is challenging due to the considerable variation in a material's appearance. Hyperspectral images, which are sets of spectral measurements sampled at multiple wavelengths, theoretically offer distinct information for material identification, as variations in intensity of electromagnetic radiation reflected by a surface depend on the material composition of a scene. However, existing hyperspectral datasets are impoverished regarding the number of images and material categories for the dense material segmentation task, and collecting and annotating hyperspectral images with a spectral camera is prohibitively expensive. To address this, we propose a new model, the MatSpectNet to segment materials with recovered hyperspectral images from RGB images. The network leverages the principles of colour perception in modern cameras to constrain the reconstructed hyperspectral images and employs the domain adaptation method to generalise the hyperspectral reconstruction capability from a spectral recovery dataset to material segmentation datasets. The reconstructed hyperspectral images are further filtered using learned response curves and enhanced with human perception. The performance of MatSpectNet is evaluated on the LMD dataset as well as the OpenSurfaces dataset. Our experiments demonstrate that MatSpectNet attains a 1.60% increase in average pixel accuracy and a 3.42% improvement in mean class accuracy compared with the most recent publication. The project code is attached to the supplementary material and will be published on GitHub. ",
    "url": "https://arxiv.org/abs/2307.11466",
    "authors": [
      "Yuwen Heng",
      "Yihong Wu",
      "Jiawen Chen",
      "Srinandan Dasmahapatra",
      "Hansung Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2307.11468",
    "title": "Zero-touch realization of Pervasive Artificial Intelligence-as-a-service  in 6G networks",
    "abstract": "The vision of the upcoming 6G technologies, characterized by ultra-dense network, low latency, and fast data rate is to support Pervasive AI (PAI) using zero-touch solutions enabling self-X (e.g., self-configuration, self-monitoring, and self-healing) services. However, the research on 6G is still in its infancy, and only the first steps have been taken to conceptualize its design, investigate its implementation, and plan for use cases. Toward this end, academia and industry communities have gradually shifted from theoretical studies of AI distribution to real-world deployment and standardization. Still, designing an end-to-end framework that systematizes the AI distribution by allowing easier access to the service using a third-party application assisted by a zero-touch service provisioning has not been well explored. In this context, we introduce a novel platform architecture to deploy a zero-touch PAI-as-a-Service (PAIaaS) in 6G networks supported by a blockchain-based smart system. This platform aims to standardize the pervasive AI at all levels of the architecture and unify the interfaces in order to facilitate the service deployment across application and infrastructure domains, relieve the users worries about cost, security, and resource allocation, and at the same time, respect the 6G stringent performance requirements. As a proof of concept, we present a Federated Learning-as-a-service use case where we evaluate the ability of our proposed system to self-optimize and self-adapt to the dynamics of 6G networks in addition to minimizing the users' perceived costs. ",
    "url": "https://arxiv.org/abs/2307.11468",
    "authors": [
      "Emna Baccour",
      "Mhd Saria Allahham",
      "Aiman Erbad",
      "Amr Mohamed",
      "Ahmed Refaey Hussein",
      "Mounir Hamdi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.11471",
    "title": "Robust Visual Question Answering: Datasets, Methods, and Future  Challenges",
    "abstract": "Visual question answering requires a system to provide an accurate natural language answer given an image and a natural language question. However, it is widely recognized that previous generic VQA methods often exhibit a tendency to memorize biases present in the training data rather than learning proper behaviors, such as grounding images before predicting answers. Therefore, these methods usually achieve high in-distribution but poor out-of-distribution performance. In recent years, various datasets and debiasing methods have been proposed to evaluate and enhance the VQA robustness, respectively. This paper provides the first comprehensive survey focused on this emerging fashion. Specifically, we first provide an overview of the development process of datasets from in-distribution and out-of-distribution perspectives. Then, we examine the evaluation metrics employed by these datasets. Thirdly, we propose a typology that presents the development process, similarities and differences, robustness comparison, and technical features of existing debiasing methods. Furthermore, we analyze and discuss the robustness of representative vision-and-language pre-training models on VQA. Finally, through a thorough review of the available literature and experimental analysis, we discuss the key areas for future research from various viewpoints. ",
    "url": "https://arxiv.org/abs/2307.11471",
    "authors": [
      "Jie Ma",
      "Pinghui Wang",
      "Dechen Kong",
      "Zewei Wang",
      "Jun Liu",
      "Hongbin Pei",
      "Junzhou Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.11477",
    "title": "SA-BEV: Generating Semantic-Aware Bird's-Eye-View Feature for Multi-view  3D Object Detection",
    "abstract": "Recently, the pure camera-based Bird's-Eye-View (BEV) perception provides a feasible solution for economical autonomous driving. However, the existing BEV-based multi-view 3D detectors generally transform all image features into BEV features, without considering the problem that the large proportion of background information may submerge the object information. In this paper, we propose Semantic-Aware BEV Pooling (SA-BEVPool), which can filter out background information according to the semantic segmentation of image features and transform image features into semantic-aware BEV features. Accordingly, we propose BEV-Paste, an effective data augmentation strategy that closely matches with semantic-aware BEV feature. In addition, we design a Multi-Scale Cross-Task (MSCT) head, which combines task-specific and cross-task information to predict depth distribution and semantic segmentation more accurately, further improving the quality of semantic-aware BEV feature. Finally, we integrate the above modules into a novel multi-view 3D object detection framework, namely SA-BEV. Experiments on nuScenes show that SA-BEV achieves state-of-the-art performance. Code has been available at https://github.com/mengtan00/SA-BEV.git. ",
    "url": "https://arxiv.org/abs/2307.11477",
    "authors": [
      "Jinqing Zhang",
      "Yanan Zhang",
      "Qingjie Liu",
      "Yunhong Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11482",
    "title": "Redemption from Range-view for Accurate 3D Object Detection",
    "abstract": "Most recent approaches for 3D object detection predominantly rely on point-view or bird's-eye view representations, with limited exploration of range-view-based methods. The range-view representation suffers from scale variation and surface texture deficiency, both of which pose significant limitations for developing corresponding methods. Notably, the surface texture loss problem has been largely ignored by all existing methods, despite its significant impact on the accuracy of range-view-based 3D object detection. In this study, we propose Redemption from Range-view R-CNN (R2 R-CNN), a novel and accurate approach that comprehensively explores the range-view representation. Our proposed method addresses scale variation through the HD Meta Kernel, which captures range-view geometry information in multiple scales. Additionally, we introduce Feature Points Redemption (FPR) to recover the lost 3D surface texture information from the range view, and Synchronous-Grid RoI Pooling (S-Grid RoI Pooling), a multi-scaled approach with multiple receptive fields for accurate box refinement. Our R2 R-CNN outperforms existing range-view-based methods, achieving state-of-the-art performance on both the KITTI benchmark and the Waymo Open Dataset. Our study highlights the critical importance of addressing the surface texture loss problem for accurate 3D object detection in range-view-based methods. Codes will be made publicly available. ",
    "url": "https://arxiv.org/abs/2307.11482",
    "authors": [
      "Yihan Wang",
      "Qiao Yan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11498",
    "title": "Friction Interventions to Curb the Spread of Misinformation on Social  Media",
    "abstract": "Social media has enabled the spread of information at unprecedented speeds and scales, and with it the proliferation of high-engagement, low-quality content. *Friction* -- behavioral design measures that make the sharing of content more cumbersome -- might be a way to raise the quality of what is spread online. Here, we study the effects of friction with and without quality-recognition learning. Experiments from an agent-based model suggest that friction alone decreases the number of posts without improving their quality. A small amount of friction combined with learning, however, increases the average quality of posts significantly. Based on this preliminary evidence, we propose a friction intervention with a learning component about the platform's community standards, to be tested via a field experiment. The proposed intervention would have minimal effects on engagement and may easily be deployed at scale. ",
    "url": "https://arxiv.org/abs/2307.11498",
    "authors": [
      "Laura Jahn",
      "Rasmus K. Rendsvig",
      "Alessandro Flammini",
      "Filippo Menczer",
      "Vincent F. Hendricks"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2307.11519",
    "title": "Multi-modal Hate Speech Detection using Machine Learning",
    "abstract": "With the continuous growth of internet users and media content, it is very hard to track down hateful speech in audio and video. Converting video or audio into text does not detect hate speech accurately as human sometimes uses hateful words as humorous or pleasant in sense and also uses different voice tones or show different action in the video. The state-ofthe-art hate speech detection models were mostly developed on a single modality. In this research, a combined approach of multimodal system has been proposed to detect hate speech from video contents by extracting feature images, feature values extracted from the audio, text and used machine learning and Natural language processing. ",
    "url": "https://arxiv.org/abs/2307.11519",
    "authors": [
      "Fariha Tahosin Boishakhi",
      "Ponkoj Chandra Shill",
      "Md. Golam Rabiul Alam"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2307.11522",
    "title": "Semantically-enhanced Deep Collision Prediction for Autonomous  Navigation using Aerial Robots",
    "abstract": "This paper contributes a novel and modularized learning-based method for aerial robots navigating cluttered environments containing hard-to-perceive thin obstacles without assuming access to a map or the full pose estimation of the robot. The proposed solution builds upon a semantically-enhanced Variational Autoencoder that is trained with both real-world and simulated depth images to compress the input data, while preserving semantically-labeled thin obstacles and handling invalid pixels in the depth sensor's output. This compressed representation, in addition to the robot's partial state involving its linear/angular velocities and its attitude are then utilized to train an uncertainty-aware 3D Collision Prediction Network in simulation to predict collision scores for candidate action sequences in a predefined motion primitives library. A set of simulation and experimental studies in cluttered environments with various sizes and types of obstacles, including multiple hard-to-perceive thin objects, were conducted to evaluate the performance of the proposed method and compare against an end-to-end trained baseline. The results demonstrate the benefits of the proposed semantically-enhanced deep collision prediction for learning-based autonomous navigation. ",
    "url": "https://arxiv.org/abs/2307.11522",
    "authors": [
      "Mihir Kulkarni",
      "Huan Nguyen",
      "Kostas Alexis"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2307.11526",
    "title": "CopyRNeRF: Protecting the CopyRight of Neural Radiance Fields",
    "abstract": "Neural Radiance Fields (NeRF) have the potential to be a major representation of media. Since training a NeRF has never been an easy task, the protection of its model copyright should be a priority. In this paper, by analyzing the pros and cons of possible copyright protection solutions, we propose to protect the copyright of NeRF models by replacing the original color representation in NeRF with a watermarked color representation. Then, a distortion-resistant rendering scheme is designed to guarantee robust message extraction in 2D renderings of NeRF. Our proposed method can directly protect the copyright of NeRF models while maintaining high rendering quality and bit accuracy when compared among optional solutions. ",
    "url": "https://arxiv.org/abs/2307.11526",
    "authors": [
      "Ziyuan Luo",
      "Qing Guo",
      "Ka Chun Cheung",
      "Simon See",
      "Renjie Wan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11528",
    "title": "Improving Viewpoint Robustness for Visual Recognition via Adversarial  Training",
    "abstract": "Viewpoint invariance remains challenging for visual recognition in the 3D world, as altering the viewing directions can significantly impact predictions for the same object. While substantial efforts have been dedicated to making neural networks invariant to 2D image translations and rotations, viewpoint invariance is rarely investigated. Motivated by the success of adversarial training in enhancing model robustness, we propose Viewpoint-Invariant Adversarial Training (VIAT) to improve the viewpoint robustness of image classifiers. Regarding viewpoint transformation as an attack, we formulate VIAT as a minimax optimization problem, where the inner maximization characterizes diverse adversarial viewpoints by learning a Gaussian mixture distribution based on the proposed attack method GMVFool. The outer minimization obtains a viewpoint-invariant classifier by minimizing the expected loss over the worst-case viewpoint distributions that can share the same one for different objects within the same category. Based on GMVFool, we contribute a large-scale dataset called ImageNet-V+ to benchmark viewpoint robustness. Experimental results show that VIAT significantly improves the viewpoint robustness of various image classifiers based on the diversity of adversarial viewpoints generated by GMVFool. Furthermore, we propose ViewRS, a certified viewpoint robustness method that provides a certified radius and accuracy to demonstrate the effectiveness of VIAT from the theoretical perspective. ",
    "url": "https://arxiv.org/abs/2307.11528",
    "authors": [
      "Shouwei Ruan",
      "Yinpeng Dong",
      "Hang Su",
      "Jianteng Peng",
      "Ning Chen",
      "Xingxing Wei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11543",
    "title": "KVN: Keypoints Voting Network with Differentiable RANSAC for Stereo Pose  Estimation",
    "abstract": "Object pose estimation is a fundamental computer vision task exploited in several robotics and augmented reality applications. Many established approaches rely on predicting 2D-3D keypoint correspondences using RANSAC (Random sample consensus) and estimating the object pose using the PnP (Perspective-n-Point) algorithm. Being RANSAC non-differentiable, correspondences cannot be directly learned in an end-to-end fashion. In this paper, we address the stereo image-based object pose estimation problem by (i) introducing a differentiable RANSAC layer into a well-known monocular pose estimation network; (ii) exploiting an uncertainty-driven multi-view PnP solver which can fuse information from multiple views. We evaluate our approach on a challenging public stereo object pose estimation dataset, yielding state-of-the-art results against other recent approaches. Furthermore, in our ablation study, we show that the differentiable RANSAC layer plays a significant role in the accuracy of the proposed method. We release with this paper the open-source implementation of our method. ",
    "url": "https://arxiv.org/abs/2307.11543",
    "authors": [
      "Ivano Donadi",
      "Alberto Pretto"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2307.11544",
    "title": "Identifying Relevant Features of CSE-CIC-IDS2018 Dataset for the  Development of an Intrusion Detection System",
    "abstract": "Intrusion detection systems (IDSs) are essential elements of IT systems. Their key component is a classification module that continuously evaluates some features of the network traffic and identifies possible threats. Its efficiency is greatly affected by the right selection of the features to be monitored. Therefore, the identification of a minimal set of features that are necessary to safely distinguish malicious traffic from benign traffic is indispensable in the course of the development of an IDS. This paper presents the preprocessing and feature selection workflow as well as its results in the case of the CSE-CIC-IDS2018 on AWS dataset, focusing on five attack types. To identify the relevant features, six feature selection methods were applied, and the final ranking of the features was elaborated based on their average score. Next, several subsets of the features were formed based on different ranking threshold values, and each subset was tried with five classification algorithms to determine the optimal feature set for each attack type. During the evaluation, four widely used metrics were taken into consideration. ",
    "url": "https://arxiv.org/abs/2307.11544",
    "authors": [
      "László Göcs",
      "Zsolt Csaba Johanyák"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.11563",
    "title": "Feature Map Testing for Deep Neural Networks",
    "abstract": "Due to the widespread application of deep neural networks~(DNNs) in safety-critical tasks, deep learning testing has drawn increasing attention. During the testing process, test cases that have been fuzzed or selected using test metrics are fed into the model to find fault-inducing test units (e.g., neurons and feature maps, activating which will almost certainly result in a model error) and report them to the DNN developer, who subsequently repair them~(e.g., retraining the model with test cases). Current test metrics, however, are primarily concerned with the neurons, which means that test cases that are discovered either by guided fuzzing or selection with these metrics focus on detecting fault-inducing neurons while failing to detect fault-inducing feature maps. In this work, we propose DeepFeature, which tests DNNs from the feature map level. When testing is conducted, DeepFeature will scrutinize every internal feature map in the model and identify vulnerabilities that can be enhanced through repairing to increase the model's overall performance. Exhaustive experiments are conducted to demonstrate that (1) DeepFeature is a strong tool for detecting the model's vulnerable feature maps; (2) DeepFeature's test case selection has a high fault detection rate and can detect more types of faults~(comparing DeepFeature to coverage-guided selection techniques, the fault detection rate is increased by 49.32\\%). (3) DeepFeature's fuzzer also outperforms current fuzzing techniques and generates valuable test cases more efficiently. ",
    "url": "https://arxiv.org/abs/2307.11563",
    "authors": [
      "Dong Huang",
      "Qingwen Bu",
      "Yahao Qing",
      "Yichao Fu",
      "Heming Cui"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.11565",
    "title": "FMT: Removing Backdoor Feature Maps via Feature Map Testing in Deep  Neural Networks",
    "abstract": "Deep neural networks have been widely used in many critical applications, such as autonomous vehicles and medical diagnosis. However, their security is threatened by backdoor attack, which is achieved by adding artificial patterns to specific training data. Existing defense strategies primarily focus on using reverse engineering to reproduce the backdoor trigger generated by attackers and subsequently repair the DNN model by adding the trigger into inputs and fine-tuning the model with ground-truth labels. However, once the trigger generated by the attackers is complex and invisible, the defender can not successfully reproduce the trigger. Consequently, the DNN model will not be repaired since the trigger is not effectively removed. In this work, we propose Feature Map Testing~(FMT). Different from existing defense strategies, which focus on reproducing backdoor triggers, FMT tries to detect the backdoor feature maps, which are trained to extract backdoor information from the inputs. After detecting these backdoor feature maps, FMT will erase them and then fine-tune the model with a secure subset of training data. Our experiments demonstrate that, compared to existing defense strategies, FMT can effectively reduce the Attack Success Rate (ASR) even against the most complex and invisible attack triggers. Second, unlike conventional defense methods that tend to exhibit low Robust Accuracy (i.e., the model's accuracy on the poisoned data), FMT achieves higher RA, indicating its superiority in maintaining model performance while mitigating the effects of backdoor attacks~(e.g., FMT obtains 87.40\\% RA in CIFAR10). Third, compared to existing feature map pruning techniques, FMT can cover more backdoor feature maps~(e.g., FMT removes 83.33\\% of backdoor feature maps from the model in the CIFAR10 \\& BadNet scenario). ",
    "url": "https://arxiv.org/abs/2307.11565",
    "authors": [
      "Dong Huang",
      "Qingwen Bu",
      "Yahao Qing",
      "Yichao Fu",
      "Heming Cui"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2307.11588",
    "title": "Transferability of Convolutional Neural Networks in Stationary Learning  Tasks",
    "abstract": "Recent advances in hardware and big data acquisition have accelerated the development of deep learning techniques. For an extended period of time, increasing the model complexity has led to performance improvements for various tasks. However, this trend is becoming unsustainable and there is a need for alternative, computationally lighter methods. In this paper, we introduce a novel framework for efficient training of convolutional neural networks (CNNs) for large-scale spatial problems. To accomplish this we investigate the properties of CNNs for tasks where the underlying signals are stationary. We show that a CNN trained on small windows of such signals achieves a nearly performance on much larger windows without retraining. This claim is supported by our theoretical analysis, which provides a bound on the performance degradation. Additionally, we conduct thorough experimental analysis on two tasks: multi-target tracking and mobile infrastructure on demand. Our results show that the CNN is able to tackle problems with many hundreds of agents after being trained with fewer than ten. Thus, CNN architectures provide solutions to these problems at previously computationally intractable scales. ",
    "url": "https://arxiv.org/abs/2307.11588",
    "authors": [
      "Damian Owerko",
      "Charilaos I. Kanatsoulis",
      "Jennifer Bondarchuk",
      "Donald J. Bucci Jr",
      "Alejandro Ribeiro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2307.11594",
    "title": "Mixbiotic society measures: Assessment of community well-going as living  system",
    "abstract": "Social isolation is caused by the impoverishment of community (atomism) and fragmentation is caused by the enlargement of in-group (mobism), both of which can be viewed as social problems related to communication. To solve these problems, the philosophical world has proposed the concept of \"mixbiotic society,\" in which individuals with freedom and diverse values mix and mingle to recognize their respective \"fundamental incapability\" each other and sublimate into solidarity. Based on this concept, this study proposes new mixbiotic society measures to evaluate dynamic communication patterns with reference to classification in cellular automata and particle reaction diffusion that simulate living phenomena. Specifically, the hypothesis of measures corresponding to the four classes was formulated, and the hypothesis was validated by simulating the generation and disappearance of communication. As a result, considering communication patterns as multidimensional vectors, it found that the mean of Euclidean distance for \"mobism,\" the variance of the relative change in distance for \"atomism,\" the composite measure that multiplies the mean and variance of cosine similarity for \"mixism,\" which corresponds to the well-going of mixbiotic society, and the almost zero measures for \"nihilism,\" are suitable. Then, evaluating seven real-society datasets using these measures, we showed that the mixism measure is useful for assessing the livingness of communication, and that it is possible to typify communities based on plural measures. The measures established in this study are superior to conventional analysis in that they can evaluate dynamic patterns, they are simple to calculate, and their meanings are easy to interpret. As a future development, the mixbiotic society measures will be used in the fields of digital democracy and platform cooperativism toward a desirable society. ",
    "url": "https://arxiv.org/abs/2307.11594",
    "authors": [
      "Takeshi Kato",
      "Jyunichi Miyakoshi",
      "Tadayuki Matsumura",
      "Ryuji Mine",
      "Hiroyuki Mizuno",
      "Yasuo Deguchi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2307.11610",
    "title": "CausE: Towards Causal Knowledge Graph Embedding",
    "abstract": "Knowledge graph embedding (KGE) focuses on representing the entities and relations of a knowledge graph (KG) into the continuous vector spaces, which can be employed to predict the missing triples to achieve knowledge graph completion (KGC). However, KGE models often only briefly learn structural correlations of triple data and embeddings would be misled by the trivial patterns and noisy links in real-world KGs. To address this issue, we build the new paradigm of KGE in the context of causality and embedding disentanglement. We further propose a Causality-enhanced knowledge graph Embedding (CausE) framework. CausE employs causal intervention to estimate the causal effect of the confounder embeddings and design new training objectives to make stable predictions. Experimental results demonstrate that CausE could outperform the baseline models and achieve state-of-the-art KGC performance. We release our code in https://github.com/zjukg/CausE. ",
    "url": "https://arxiv.org/abs/2307.11610",
    "authors": [
      "Yichi Zhang",
      "Wen Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.11617",
    "title": "Robust Fully-Asynchronous Methods for Distributed Training over General  Architecture",
    "abstract": "Perfect synchronization in distributed machine learning problems is inefficient and even impossible due to the existence of latency, package losses and stragglers. We propose a Robust Fully-Asynchronous Stochastic Gradient Tracking method (R-FAST), where each device performs local computation and communication at its own pace without any form of synchronization. Different from existing asynchronous distributed algorithms, R-FAST can eliminate the impact of data heterogeneity across devices and allow for packet losses by employing a robust gradient tracking strategy that relies on properly designed auxiliary variables for tracking and buffering the overall gradient vector. More importantly, the proposed method utilizes two spanning-tree graphs for communication so long as both share at least one common root, enabling flexible designs in communication architectures. We show that R-FAST converges in expectation to a neighborhood of the optimum with a geometric rate for smooth and strongly convex objectives; and to a stationary point with a sublinear rate for general non-convex settings. Extensive experiments demonstrate that R-FAST runs 1.5-2 times faster than synchronous benchmark algorithms, such as Ring-AllReduce and D-PSGD, while still achieving comparable accuracy, and outperforms existing asynchronous SOTA algorithms, such as AD-PSGD and OSGP, especially in the presence of stragglers. ",
    "url": "https://arxiv.org/abs/2307.11617",
    "authors": [
      "Zehan Zhu",
      "Ye Tian",
      "Yan Huang",
      "Jinming Xu",
      "Shibo He"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.11628",
    "title": "WM-NET: Robust Deep 3D Watermarking with Limited Data",
    "abstract": "The goal of 3D mesh watermarking is to embed the message in 3D meshes that can withstand various attacks imperceptibly and reconstruct the message accurately from watermarked meshes. Traditional methods are less robust against attacks. Recent DNN-based methods either introduce excessive distortions or fail to embed the watermark without the help of texture information. However, embedding the watermark in textures is insecure because replacing the texture image can completely remove the watermark. In this paper, we propose a robust deep 3D mesh watermarking WM-NET, which leverages attention-based convolutions in watermarking tasks to embed binary messages in vertex distributions without texture assistance. Furthermore, our WM-NET exploits the property that simplified meshes inherit similar relations from the original ones, where the relation is the offset vector directed from one vertex to its neighbor. By doing so, our method can be trained on simplified meshes(limited data) but remains effective on large-sized meshes (size adaptable) and unseen categories of meshes (geometry adaptable). Extensive experiments demonstrate our method brings 50% fewer distortions and 10% higher bit accuracy compared to previous work. Our watermark WM-NET is robust against various mesh attacks, e.g. Gauss, rotation, translation, scaling, and cropping. ",
    "url": "https://arxiv.org/abs/2307.11628",
    "authors": [
      "Xingyu Zhu",
      "Guanhui Ye",
      "Xuetao Wei",
      "Xiapu Luo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.11629",
    "title": "Scalable Multi-agent Skill Discovery based on Kronecker Graphs",
    "abstract": "Covering skill (a.k.a., option) discovery has been developed to improve the exploration of RL in single-agent scenarios with sparse reward signals, through connecting the most distant states in the embedding space provided by the Fiedler vector of the state transition graph. Given that joint state space grows exponentially with the number of agents in multi-agent systems, existing researches still relying on single-agent option discovery either become prohibitive or fail to directly discover joint options that improve the connectivity of the joint state space. In this paper, we show how to directly compute multi-agent options with collaborative exploratory behaviors while still enjoying the ease of decomposition. Our key idea is to approximate the joint state space as a Kronecker graph, based on which we can directly estimate its Fiedler vector using the Laplacian spectrum of individual agents' transition graphs. Further, considering that directly computing the Laplacian spectrum is intractable for tasks with infinite-scale state spaces, we further propose a deep learning extension of our method by estimating eigenfunctions through NN-based representation learning techniques. The evaluation on multi-agent tasks built with simulators like Mujoco, shows that the proposed algorithm can successfully identify multi-agent options, and significantly outperforms the state-of-the-art. Codes are available at: https://github.itap.purdue.edu/Clan-labs/Scalable_MAOD_via_KP. ",
    "url": "https://arxiv.org/abs/2307.11629",
    "authors": [
      "Jiayu Chen",
      "Jingdi Chen",
      "Tian Lan",
      "Vaneet Aggarwal"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2307.11643",
    "title": "Morphological Image Analysis and Feature Extraction for Reasoning with  AI-based Defect Detection and Classification Models",
    "abstract": "As the use of artificial intelligent (AI) models becomes more prevalent in industries such as engineering and manufacturing, it is essential that these models provide transparent reasoning behind their predictions. This paper proposes the AI-Reasoner, which extracts the morphological characteristics of defects (DefChars) from images and utilises decision trees to reason with the DefChar values. Thereafter, the AI-Reasoner exports visualisations (i.e. charts) and textual explanations to provide insights into outputs made by masked-based defect detection and classification models. It also provides effective mitigation strategies to enhance data pre-processing and overall model performance. The AI-Reasoner was tested on explaining the outputs of an IE Mask R-CNN model using a set of 366 images containing defects. The results demonstrated its effectiveness in explaining the IE Mask R-CNN model's predictions. Overall, the proposed AI-Reasoner provides a solution for improving the performance of AI models in industrial applications that require defect analysis. ",
    "url": "https://arxiv.org/abs/2307.11643",
    "authors": [
      "Jiajun Zhang",
      "Georgina Cosma",
      "Sarah Bugby",
      "Axel Finke",
      "Jason Watkins"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.11662",
    "title": "BlockCampus: A Blockchain-Based DApp for enhancing Student Engagement  and Reward Mechanisms in an Academic Community for E-JUST University",
    "abstract": "In today's digital age, online communities have become an integral part of our lives, fostering collaboration, knowledge sharing, and community engagement. Higher education institutions, in particular, can greatly benefit from dedicated platforms that facilitate academic discussions and provide incentives for active participation. This research paper presents a comprehensive study and implementation of a decentralized application (DApp) leveraging the blockchain technology to address these needs specifically for E-JUST (Egypt-Japan University of Science and Technology) students and academic staff. ",
    "url": "https://arxiv.org/abs/2307.11662",
    "authors": [
      "Mariam Ayman",
      "Youssef El-harty",
      "Ahmed Rashed",
      "Ahmed Fathy",
      "Ahmed Abdullah",
      "Omar Wassim",
      "Walid Gomaa"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2307.11672",
    "title": "Fast Adaptive Test-Time Defense with Robust Features",
    "abstract": "Adaptive test-time defenses are used to improve the robustness of deep neural networks to adversarial examples. However, existing methods significantly increase the inference time due to additional optimization on the model parameters or the input at test time. In this work, we propose a novel adaptive test-time defense strategy that is easy to integrate with any existing (robust) training procedure without additional test-time computation. Based on the notion of robustness of features that we present, the key idea is to project the trained models to the most robust feature space, thereby reducing the vulnerability to adversarial attacks in non-robust directions. We theoretically show that the top eigenspace of the feature matrix are more robust for a generalized additive model and support our argument for a large width neural network with the Neural Tangent Kernel (NTK) equivalence. We conduct extensive experiments on CIFAR-10 and CIFAR-100 datasets for several robustness benchmarks, including the state-of-the-art methods in RobustBench, and observe that the proposed method outperforms existing adaptive test-time defenses at much lower computation costs. ",
    "url": "https://arxiv.org/abs/2307.11672",
    "authors": [
      "Anurag Singh",
      "Mahalakshmi Sabanayagam",
      "Krikamol Muandet",
      "Debarghya Ghoshdastidar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.11677",
    "title": "Improved Approximate Distance Oracles: Bypassing the Thorup-Zwick Bound  in Dense Graphs",
    "abstract": "Despite extensive research on distance oracles, there are still large gaps between the best constructions for spanners and distance oracles. Notably, there exist sparse spanners with a multiplicative stretch of $1+\\varepsilon$ plus some additive stretch. A fundamental open problem is whether such a bound is achievable for distance oracles as well. Specifically, can we construct a distance oracle with multiplicative stretch better than 2, along with some additive stretch, while maintaining subquadratic space complexity? This question remains a crucial area of investigation, and finding a positive answer would be a significant step forward for distance oracles. Indeed, such oracles have been constructed for sparse graphs. However, in the more general case of dense graphs, it is currently unknown whether such oracles exist. In this paper, we contribute to the field by presenting the first distance oracles that achieve a multiplicative stretch of $1+\\varepsilon$ along with a small additive stretch while maintaining subquadratic space complexity. Our results represent an advancement particularly for constructing efficient distance oracles for dense graphs. In addition, we present a whole family of oracles that, for any positive integer $k$, achieve a multiplicative stretch of $2k-1+\\varepsilon$ using $o(n^{1+1/k})$ space. ",
    "url": "https://arxiv.org/abs/2307.11677",
    "authors": [
      "Davide Bilò",
      "Shiri Chechik",
      "Keerti Choudhary",
      "Sarel Cohen",
      "Tobias Friedrich",
      "Martin Schirneck"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2307.11688",
    "title": "Interpretable Graph Networks Formulate Universal Algebra Conjectures",
    "abstract": "The rise of Artificial Intelligence (AI) recently empowered researchers to investigate hard mathematical problems which eluded traditional approaches for decades. Yet, the use of AI in Universal Algebra (UA) -- one of the fields laying the foundations of modern mathematics -- is still completely unexplored. This work proposes the first use of AI to investigate UA's conjectures with an equivalent equational and topological characterization. While topological representations would enable the analysis of such properties using graph neural networks, the limited transparency and brittle explainability of these models hinder their straightforward use to empirically validate existing conjectures or to formulate new ones. To bridge these gaps, we propose a general algorithm generating AI-ready datasets based on UA's conjectures, and introduce a novel neural layer to build fully interpretable graph networks. The results of our experiments demonstrate that interpretable graph networks: (i) enhance interpretability without sacrificing task accuracy, (ii) strongly generalize when predicting universal algebra's properties, (iii) generate simple explanations that empirically validate existing conjectures, and (iv) identify subgraphs suggesting the formulation of novel conjectures. ",
    "url": "https://arxiv.org/abs/2307.11688",
    "authors": [
      "Francesco Giannini",
      "Stefano Fioravanti",
      "Oguzhan Keskin",
      "Alisia Maria Lupidi",
      "Lucie Charlotte Magister",
      "Pietro Lio",
      "Pietro Barbiero"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.11694",
    "title": "SynerGPT: In-Context Learning for Personalized Drug Synergy Prediction  and Drug Design",
    "abstract": "Predicting synergistic drug combinations can help accelerate discovery of cancer treatments, particularly therapies personalized to a patient's specific tumor via biopsied cells. In this paper, we propose a novel setting and models for in-context drug synergy learning. We are given a small \"personalized dataset\" of 10-20 drug synergy relationships in the context of specific cancer cell targets. Our goal is to predict additional drug synergy relationships in that context. Inspired by recent work that pre-trains a GPT language model (LM) to \"in-context learn\" common function classes, we devise novel pre-training schemes that enable a GPT model to in-context learn \"drug synergy functions\". Our model -- which does not use any textual corpora, molecular fingerprints, protein interaction or any other domain-specific knowledge -- is able to achieve competitive results. We further integrate our in-context approach with a genetic algorithm to optimize model prompts and select synergy candidates to test after conducting a patient biopsy. Finally, we explore a novel task of inverse drug design which can potentially enable the design of drugs that synergize specifically to target a given patient's \"personalized dataset\". Our findings can potentially have an important impact on precision cancer medicine, and also raise intriguing questions on non-textual pre-training for LMs. ",
    "url": "https://arxiv.org/abs/2307.11694",
    "authors": [
      "Carl Edwards",
      "Aakanksha Naik",
      "Tushar Khot",
      "Martin Burke",
      "Heng Ji",
      "Tom Hope"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)",
      "Molecular Networks (q-bio.MN)"
    ]
  },
  {
    "id": "arXiv:2307.11706",
    "title": "3D Skeletonization of Complex Grapevines for Robotic Pruning",
    "abstract": "Robotic pruning of dormant grapevines is an area of active research in order to promote vine balance and grape quality, but so far robotic efforts have largely focused on planar, simplified vines not representative of commercial vineyards. This paper aims to advance the robotic perception capabilities necessary for pruning in denser and more complex vine structures by extending plant skeletonization techniques. The proposed pipeline generates skeletal grapevine models that have lower reprojection error and higher connectivity than baseline algorithms. We also show how 3D and skeletal information enables prediction accuracy of pruning weight for dense vines surpassing prior work, where pruning weight is an important vine metric influencing pruning site selection. ",
    "url": "https://arxiv.org/abs/2307.11706",
    "authors": [
      "Eric Schneider",
      "Sushanth Jayanth",
      "Abhisesh Silwal",
      "George Kantor"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11709",
    "title": "Statement-based Memory for Neural Source Code Summarization",
    "abstract": "Source code summarization is the task of writing natural language descriptions of source code behavior. Code summarization underpins software documentation for programmers. Short descriptions of code help programmers understand the program quickly without having to read the code itself. Lately, neural source code summarization has emerged as the frontier of research into automated code summarization techniques. By far the most popular targets for summarization are program subroutines. The idea, in a nutshell, is to train an encoder-decoder neural architecture using large sets of examples of subroutines extracted from code repositories. The encoder represents the code and the decoder represents the summary. However, most current approaches attempt to treat the subroutine as a single unit. For example, by taking the entire subroutine as input to a Transformer or RNN-based encoder. But code behavior tends to depend on the flow from statement to statement. Normally dynamic analysis may shed light on this flow, but dynamic analysis on hundreds of thousands of examples in large datasets is not practical. In this paper, we present a statement-based memory encoder that learns the important elements of flow during training, leading to a statement-based subroutine representation without the need for dynamic analysis. We implement our encoder for code summarization and demonstrate a significant improvement over the state-of-the-art. ",
    "url": "https://arxiv.org/abs/2307.11709",
    "authors": [
      "Aakash Bansal",
      "Siyuan Jiang",
      "Sakib Haque",
      "Collin McMillan"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.11714",
    "title": "Convergence of SGD for Training Neural Networks with Sliced Wasserstein  Losses",
    "abstract": "Optimal Transport has sparked vivid interest in recent years, in particular thanks to the Wasserstein distance, which provides a geometrically sensible and intuitive way of comparing probability measures. For computational reasons, the Sliced Wasserstein (SW) distance was introduced as an alternative to the Wasserstein distance, and has seen uses for training generative Neural Networks (NNs). While convergence of Stochastic Gradient Descent (SGD) has been observed practically in such a setting, there is to our knowledge no theoretical guarantee for this observation. Leveraging recent works on convergence of SGD on non-smooth and non-convex functions by Bianchi et al. (2022), we aim to bridge that knowledge gap, and provide a realistic context under which fixed-step SGD trajectories for the SW loss on NN parameters converge. More precisely, we show that the trajectories approach the set of (sub)-gradient flow equations as the step decreases. Under stricter assumptions, we show a much stronger convergence result for noised and projected SGD schemes, namely that the long-run limits of the trajectories approach a set of generalised critical points of the loss function. ",
    "url": "https://arxiv.org/abs/2307.11714",
    "authors": [
      "Eloi Tanguy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2307.11719",
    "title": "Benchmark datasets for biomedical knowledge graphs with negative  statements",
    "abstract": "Knowledge graphs represent facts about real-world entities. Most of these facts are defined as positive statements. The negative statements are scarce but highly relevant under the open-world assumption. Furthermore, they have been demonstrated to improve the performance of several applications, namely in the biomedical domain. However, no benchmark dataset supports the evaluation of the methods that consider these negative statements. We present a collection of datasets for three relation prediction tasks - protein-protein interaction prediction, gene-disease association prediction and disease prediction - that aim at circumventing the difficulties in building benchmarks for knowledge graphs with negative statements. These datasets include data from two successful biomedical ontologies, Gene Ontology and Human Phenotype Ontology, enriched with negative statements. We also generate knowledge graph embeddings for each dataset with two popular path-based methods and evaluate the performance in each task. The results show that the negative statements can improve the performance of knowledge graph embeddings. ",
    "url": "https://arxiv.org/abs/2307.11719",
    "authors": [
      "Rita T. Sousa",
      "Sara Silva",
      "Catia Pesquita"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2307.11729",
    "title": "OUTFOX: LLM-generated Essay Detection through In-context Learning with  Adversarially Generated Examples",
    "abstract": "Large Language Models (LLMs) have achieved human-level fluency in text generation, making it difficult to distinguish between human-written and LLM-generated texts. This poses a growing risk of misuse of LLMs and demands the development of detectors to identify LLM-generated texts. However, existing detectors degrade detection accuracy by simply paraphrasing LLM-generated texts. Furthermore, the effectiveness of these detectors in real-life situations, such as when students use LLMs for writing homework assignments (e.g., essays) and quickly learn how to evade these detectors, has not been explored. In this paper, we propose OUTFOX, a novel framework that improves the robustness of LLM-generated-text detectors by allowing both the detector and the attacker to consider each other's output and apply this to the domain of student essays. In our framework, the attacker uses the detector's prediction labels as examples for in-context learning and adversarially generates essays that are harder to detect. While the detector uses the adversarially generated essays as examples for in-context learning to learn to detect essays from a strong attacker. Our experiments show that our proposed detector learned in-context from the attacker improves the detection performance on the attacked dataset by up to +41.3 point F1-score. While our proposed attacker can drastically degrade the performance of the detector by up to -57.0 point F1-score compared to the paraphrasing method. ",
    "url": "https://arxiv.org/abs/2307.11729",
    "authors": [
      "Ryuto Koike",
      "Masahiro Kaneko",
      "Naoaki Okazaki"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.11730",
    "title": "Mitigating Communications Threats in Decentralized Federated Learning  through Moving Target Defense",
    "abstract": "The rise of Decentralized Federated Learning (DFL) has enabled the training of machine learning models across federated participants, fostering decentralized model aggregation and reducing dependence on a server. However, this approach introduces unique communication security challenges that have yet to be thoroughly addressed in the literature. These challenges primarily originate from the decentralized nature of the aggregation process, the varied roles and responsibilities of the participants, and the absence of a central authority to oversee and mitigate threats. Addressing these challenges, this paper first delineates a comprehensive threat model, highlighting the potential risks of DFL communications. In response to these identified risks, this work introduces a security module designed for DFL platforms to counter communication-based attacks. The module combines security techniques such as symmetric and asymmetric encryption with Moving Target Defense (MTD) techniques, including random neighbor selection and IP/port switching. The security module is implemented in a DFL platform called Fedstellar, allowing the deployment and monitoring of the federation. A DFL scenario has been deployed, involving eight physical devices implementing three security configurations: (i) a baseline with no security, (ii) an encrypted configuration, and (iii) a configuration integrating both encryption and MTD techniques. The effectiveness of the security module is validated through experiments with the MNIST dataset and eclipse attacks. The results indicated an average F1 score of 95%, with moderate increases in CPU usage (up to 63.2% +-3.5%) and network traffic (230 MB +-15 MB) under the most secure configuration, mitigating the risks posed by eavesdropping or eclipse attacks. ",
    "url": "https://arxiv.org/abs/2307.11730",
    "authors": [
      "Enrique Tomás Martínez Beltrán",
      "Pedro Miguel Sánchez Sánchez",
      "Sergio López Bernal",
      "Gérôme Bovet",
      "Manuel Gil Pérez",
      "Gregorio Martínez Pérez",
      "Alberto Huertas Celdrán"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.11748",
    "title": "BandRe: Rethinking Band-Pass Filters for Scale-Wise Object Detection  Evaluation",
    "abstract": "Scale-wise evaluation of object detectors is important for real-world applications. However, existing metrics are either coarse or not sufficiently reliable. In this paper, we propose novel scale-wise metrics that strike a balance between fineness and reliability, using a filter bank consisting of triangular and trapezoidal band-pass filters. We conduct experiments with two methods on two datasets and show that the proposed metrics can highlight the differences between the methods and between the datasets. Code is available at https://github.com/shinya7y/UniverseNet . ",
    "url": "https://arxiv.org/abs/2307.11748",
    "authors": [
      "Yosuke Shinya"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.11749",
    "title": "Differentially Private Heavy Hitter Detection using Federated Analytics",
    "abstract": "In this work, we study practical heuristics to improve the performance of prefix-tree based algorithms for differentially private heavy hitter detection. Our model assumes each user has multiple data points and the goal is to learn as many of the most frequent data points as possible across all users' data with aggregate and local differential privacy. We propose an adaptive hyperparameter tuning algorithm that improves the performance of the algorithm while satisfying computational, communication and privacy constraints. We explore the impact of different data-selection schemes as well as the impact of introducing deny lists during multiple runs of the algorithm. We test these improvements using extensive experimentation on the Reddit dataset~\\cite{caldas2018leaf} on the task of learning the most frequent words. ",
    "url": "https://arxiv.org/abs/2307.11749",
    "authors": [
      "Karan Chadha",
      "Junye Chen",
      "John Duchi",
      "Vitaly Feldman",
      "Hanieh Hashemi",
      "Omid Javidbakht",
      "Audra McMillan",
      "Kunal Talwar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2307.11130",
    "title": "Frequency-aware optical coherence tomography image super-resolution via  conditional generative adversarial neural network",
    "abstract": "Optical coherence tomography (OCT) has stimulated a wide range of medical image-based diagnosis and treatment in fields such as cardiology and ophthalmology. Such applications can be further facilitated by deep learning-based super-resolution technology, which improves the capability of resolving morphological structures. However, existing deep learning-based method only focuses on spatial distribution and disregard frequency fidelity in image reconstruction, leading to a frequency bias. To overcome this limitation, we propose a frequency-aware super-resolution framework that integrates three critical frequency-based modules (i.e., frequency transformation, frequency skip connection, and frequency alignment) and frequency-based loss function into a conditional generative adversarial network (cGAN). We conducted a large-scale quantitative study from an existing coronary OCT dataset to demonstrate the superiority of our proposed framework over existing deep learning frameworks. In addition, we confirmed the generalizability of our framework by applying it to fish corneal images and rat retinal images, demonstrating its capability to super-resolve morphological details in eye imaging. ",
    "url": "https://arxiv.org/abs/2307.11130",
    "authors": [
      "Xueshen Li",
      "Zhenxing Dong",
      "Hongshan Liu",
      "Jennifer J. Kang-Mieler",
      "Yuye Ling",
      "Yu Gan"
    ],
    "subjectives": [
      "Medical Physics (physics.med-ph)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2307.11133",
    "title": "Contrastive Graph Pooling for Explainable Classification of Brain  Networks",
    "abstract": "Functional magnetic resonance imaging (fMRI) is a commonly used technique to measure neural activation. Its application has been particularly important in identifying underlying neurodegenerative conditions such as Parkinson's, Alzheimer's, and Autism. Recent analysis of fMRI data models the brain as a graph and extracts features by graph neural networks (GNNs). However, the unique characteristics of fMRI data require a special design of GNN. Tailoring GNN to generate effective and domain-explainable features remains challenging. In this paper, we propose a contrastive dual-attention block and a differentiable graph pooling method called ContrastPool to better utilize GNN for brain networks, meeting fMRI-specific requirements. We apply our method to 5 resting-state fMRI brain network datasets of 3 diseases and demonstrate its superiority over state-of-the-art baselines. Our case study confirms that the patterns extracted by our method match the domain knowledge in neuroscience literature, and disclose direct and interesting insights. Our contributions underscore the potential of ContrastPool for advancing the understanding of brain networks and neurodegenerative conditions. ",
    "url": "https://arxiv.org/abs/2307.11133",
    "authors": [
      "Jiaxing Xu",
      "Qingtian Bian",
      "Xinhang Li",
      "Aihu Zhang",
      "Yiping Ke",
      "Miao Qiao",
      "Wei Zhang",
      "Wei Khang Jeremy Sim",
      "Balázs Gulyás"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.11238",
    "title": "The clique graphs of the hexagonal lattice -- an explicit construction  and a short proof of divergence",
    "abstract": "We present a new, explicit and very geometric construction for the iterated clique graphs of the hexagonal lattice $\\mathrm{Hex}$ which makes apparent its clique-divergence and sheds light on some previous observations, such as the boundedness of the degrees and clique sizes of $k^n \\mathrm{Hex}$ as $n\\to\\infty$. ",
    "url": "https://arxiv.org/abs/2307.11238",
    "authors": [
      "Martin Winter"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2307.11239",
    "title": "Edgewise outliers of network indexed signals",
    "abstract": "We consider models for network indexed multivariate data involving a dependence between variables as well as across graph nodes. In the framework of these models, we focus on outliers detection and introduce the concept of edgewise outliers. For this purpose, we first derive the distribution of some sums of squares, in particular squared Mahalanobis distances that can be used to fix detection rules and thresholds for outlier detection. We then propose a robust version of the deterministic MCD algorithm that we call edgewise MCD. An application on simulated data shows the interest of taking the dependence structure into account. We also illustrate the utility of the proposed method with a real data set. ",
    "url": "https://arxiv.org/abs/2307.11239",
    "authors": [
      "Christopher Rieser",
      "Anne Ruiz-Gazen",
      "Christine Thomas-Agnan"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Other Statistics (stat.OT)"
    ]
  },
  {
    "id": "arXiv:2307.11274",
    "title": "Screening Mammography Breast Cancer Detection",
    "abstract": "Breast cancer is a leading cause of cancer-related deaths, but current programs are expensive and prone to false positives, leading to unnecessary follow-up and patient anxiety. This paper proposes a solution to automated breast cancer detection, to improve the efficiency and accuracy of screening programs. Different methodologies were tested against the RSNA dataset of radiographic breast images of roughly 20,000 female patients and yielded an average validation case pF1 score of 0.56 across methods. ",
    "url": "https://arxiv.org/abs/2307.11274",
    "authors": [
      "Debajyoti Chakraborty"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.11424",
    "title": "Robust stabilization of $2 \\times 2$ first-order hyperbolic PDEs with  uncertain input delay",
    "abstract": "A backstepping-based compensator design is developed for a system of $2\\times2$ first-order linear hyperbolic partial differential equations (PDE) in the presence of an uncertain long input delay at boundary. We introduce a transport PDE to represent the delayed input, which leads to three coupled first-order hyperbolic PDEs. A novel backstepping transformation, composed of two Volterra transformations and an affine Volterra transformation, is introduced for the predictive control design. The resulting kernel equations from the affine Volterra transformation are two coupled first-order PDEs and each with two boundary conditions, which brings challenges to the well-posedness analysis. We solve the challenge by using the method of characteristics and the successive approximation. To analyze the sensitivity of the closed-loop system to uncertain input delay, we introduce a neutral system which captures the control effect resulted from the delay uncertainty. It is proved that the proposed control is robust to small delay variations. Numerical examples illustrate the performance of the proposed compensator. ",
    "url": "https://arxiv.org/abs/2307.11424",
    "authors": [
      "Jing Zhang",
      "Jie Qi"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)",
      "Analysis of PDEs (math.AP)",
      "Classical Physics (physics.class-ph)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2307.11436",
    "title": "Neural Operators for Delay-Compensating Control of Hyperbolic PIDEs",
    "abstract": "The recently introduced DeepONet operator-learning framework for PDE control is extended from the results for basic hyperbolic and parabolic PDEs to an advanced hyperbolic class that involves delays on both the state and the system output or input. The PDE backstepping design produces gain functions that are outputs of a nonlinear operator, mapping functions on a spatial domain into functions on a spatial domain, and where this gain-generating operator's inputs are the PDE's coefficients. The operator is approximated with a DeepONet neural network to a degree of accuracy that is provably arbitrarily tight. Once we produce this approximation-theoretic result in infinite dimension, with it we establish stability in closed loop under feedback that employs approximate gains. In addition to supplying such results under full-state feedback, we also develop DeepONet-approximated observers and output-feedback laws and prove their own stabilizing properties under neural operator approximations. With numerical simulations we illustrate the theoretical results and quantify the numerical effort savings, which are of two orders of magnitude, thanks to replacing the numerical PDE solving with the DeepONet. ",
    "url": "https://arxiv.org/abs/2307.11436",
    "authors": [
      "Jie Qi",
      "Jing Zhang",
      "Miroslav Krstic"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Analysis of PDEs (math.AP)"
    ]
  },
  {
    "id": "arXiv:2307.11552",
    "title": "A multi-modal representation of El Niño Southern Oscillation Diversity",
    "abstract": "The El Ni\\~no-Southern Oscillation (ENSO) is characterized by alternating periods of warm (El Ni\\~no) and cold (La Ni\\~na) sea surface temperature anomalies (SSTA) in the equatorial Pacific. Although El Ni\\~no and La Ni\\~na are well-defined climate patterns, no two events are alike. To date, ENSO diversity has been described primarily in terms of the longitudinal location of peak SSTA, used to define a bimodal classification of events in Eastern Pacific (EP) and Central Pacific (CP) types. Here, we use low-dimensional representations of Pacific SSTAs to argue that binary categorical memberships are unsuitable to describe ENSO events. Using fuzzy unsupervised clustering, we recover the four known ENSO categories, along with a fifth category: an Extreme El Ni\\~no. We show that Extreme El Ni\\~nos differ both in their intensity and temporal evolution from canonical EP El Ni\\~nos. We also find that CP La Ni\\~nas, EP El Ni\\~nos, and Extreme El Ni\\~nos contribute the most to interdecadal ENSO variability. ",
    "url": "https://arxiv.org/abs/2307.11552",
    "authors": [
      "Jakob Schlör",
      "Felix Strnad",
      "Antonietta Capotondi",
      "Bedartha Goswami"
    ],
    "subjectives": [
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.04900",
    "title": "Forecasting consumer confidence through semantic network analysis of  online news",
    "abstract": " Title: Forecasting consumer confidence through semantic network analysis of  online news ",
    "url": "https://arxiv.org/abs/2105.04900",
    "authors": [
      "A. Fronzetti Colladon",
      "F. Grippa",
      "B. Guardabascio",
      "G. Costante",
      "F. Ravazzolo"
    ],
    "subjectives": [
      "General Economics (econ.GN)",
      "Computation and Language (cs.CL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2106.06134",
    "title": "Is Homophily a Necessity for Graph Neural Networks?",
    "abstract": " Title: Is Homophily a Necessity for Graph Neural Networks? ",
    "url": "https://arxiv.org/abs/2106.06134",
    "authors": [
      "Yao Ma",
      "Xiaorui Liu",
      "Neil Shah",
      "Jiliang Tang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.00841",
    "title": "ClueReader: Heterogeneous Graph Attention Network for Multi-hop Machine  Reading Comprehension",
    "abstract": " Title: ClueReader: Heterogeneous Graph Attention Network for Multi-hop Machine  Reading Comprehension ",
    "url": "https://arxiv.org/abs/2107.00841",
    "authors": [
      "Peng Gao",
      "Feng Gao",
      "Peng Wang",
      "Jian-Cheng Ni",
      "Fei Wang",
      "Hamido Fujita"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2109.14778",
    "title": "CALDA: Improving Multi-Source Time Series Domain Adaptation with  Contrastive Adversarial Learning",
    "abstract": " Comments: Accepted at IEEE Transactions on Pattern Analysis and Machine Intelligence ",
    "url": "https://arxiv.org/abs/2109.14778",
    "authors": [
      "Garrett Wilson",
      "Janardhan Rao Doppa",
      "Diane J. Cook"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.08227",
    "title": "Learning Multi-agent Skills for Tabular Reinforcement Learning using  Factor Graphs",
    "abstract": " Title: Learning Multi-agent Skills for Tabular Reinforcement Learning using  Factor Graphs ",
    "url": "https://arxiv.org/abs/2201.08227",
    "authors": [
      "Jiayu Chen",
      "Jingdi Chen",
      "Tian Lan",
      "Vaneet Aggarwal"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.08314",
    "title": "Causal Process Mining from Relational Databases with Domain Knowledge",
    "abstract": " Comments: 46 pages, 5 tabels, 17 figures ",
    "url": "https://arxiv.org/abs/2202.08314",
    "authors": [
      "Philipp Waibel",
      "Lukas Pfahlsberger",
      "Kate Revoredo",
      "Jan Mendling"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2203.09046",
    "title": "A memristive deep belief neural network based on silicon synapses",
    "abstract": " Title: A memristive deep belief neural network based on silicon synapses ",
    "url": "https://arxiv.org/abs/2203.09046",
    "authors": [
      "Wei Wang",
      "Loai Danial",
      "Yang Li",
      "Eric Herbelin",
      "Evgeny Pikhay",
      "Yakov Roizin",
      "Barak Hoffer",
      "Zhongrui Wang",
      "Shahar Kvatinsky"
    ],
    "subjectives": [
      "Applied Physics (physics.app-ph)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Materials Science (cond-mat.mtrl-sci)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2203.10736",
    "title": "The activity-weight duality in feed forward neural networks: The  geometric determinants of generalization",
    "abstract": " Title: The activity-weight duality in feed forward neural networks: The  geometric determinants of generalization ",
    "url": "https://arxiv.org/abs/2203.10736",
    "authors": [
      "Yu Feng",
      "Yuhai Tu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.09702",
    "title": "Parallel and Distributed Graph Neural Networks: An In-Depth Concurrency  Analysis",
    "abstract": " Title: Parallel and Distributed Graph Neural Networks: An In-Depth Concurrency  Analysis ",
    "url": "https://arxiv.org/abs/2205.09702",
    "authors": [
      "Maciej Besta",
      "Torsten Hoefler"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2207.02754",
    "title": "Tensor Neural Network and Its Numerical Integration",
    "abstract": " Comments: 30 pages, 30 figures ",
    "url": "https://arxiv.org/abs/2207.02754",
    "authors": [
      "Yifan Wang",
      "Pengzhan Jin",
      "Hehu Xie"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2208.00657",
    "title": "SiamixFormer: a fully-transformer Siamese network with temporal Fusion  for accurate building detection and change detection in bi-temporal remote  sensing images",
    "abstract": " Title: SiamixFormer: a fully-transformer Siamese network with temporal Fusion  for accurate building detection and change detection in bi-temporal remote  sensing images ",
    "url": "https://arxiv.org/abs/2208.00657",
    "authors": [
      "Amir Mohammadian",
      "Foad Ghaderi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.11400",
    "title": "Worst-case Delay Analysis of Time-Sensitive Networks with Deficit  Round-Robin",
    "abstract": " Title: Worst-case Delay Analysis of Time-Sensitive Networks with Deficit  Round-Robin ",
    "url": "https://arxiv.org/abs/2208.11400",
    "authors": [
      "Seyed Mohammadhossein Tabatabaee",
      "Anne Bouillard",
      "Jean-Yves Le Boudec"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2209.11489",
    "title": "Social Robot Scenarios for Real-World Child and Family Care Settings  through Participatory Design",
    "abstract": " Comments: Accepted to workshop on participatory design (PD) in human-robot interaction in RO-MAN 2022 ",
    "url": "https://arxiv.org/abs/2209.11489",
    "authors": [
      "Anouk Neerincx"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2210.03297",
    "title": "Preprocessors Matter! Realistic Decision-Based Attacks on Machine  Learning Systems",
    "abstract": " Comments: ICML 2023. Code can be found at this https URL ",
    "url": "https://arxiv.org/abs/2210.03297",
    "authors": [
      "Chawin Sitawarin",
      "Florian Tramèr",
      "Nicholas Carlini"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.09563",
    "title": "FedForgery: Generalized Face Forgery Detection with Residual Federated  Learning",
    "abstract": " Comments: The code is available at this https URL The paper has been accepted in the IEEE Transactions on Information Forensics & Security ",
    "url": "https://arxiv.org/abs/2210.09563",
    "authors": [
      "Decheng Liu",
      "Zhan Dang",
      "Chunlei Peng",
      "Yu Zheng",
      "Shuang Li",
      "Nannan Wang",
      "Xinbo Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.10495",
    "title": "ADPS: Asymmetric Distillation Post-Segmentation Method for Image Anomaly  Detection",
    "abstract": " Comments: 11pages,9 figures ",
    "url": "https://arxiv.org/abs/2210.10495",
    "authors": [
      "Peng Xing",
      "Hao Tang",
      "Jinhui Tang",
      "Zechao Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.11723",
    "title": "Evidence of Vocal Tract Articulation in Self-Supervised Learning of  Speech",
    "abstract": " Title: Evidence of Vocal Tract Articulation in Self-Supervised Learning of  Speech ",
    "url": "https://arxiv.org/abs/2210.11723",
    "authors": [
      "Cheol Jun Cho",
      "Peter Wu",
      "Abdelrahman Mohamed",
      "Gopala K. Anumanchipalli"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2211.05566",
    "title": "Secure State Estimation against Sparse Attacks on a Time-varying Set of  Sensors",
    "abstract": " Title: Secure State Estimation against Sparse Attacks on a Time-varying Set of  Sensors ",
    "url": "https://arxiv.org/abs/2211.05566",
    "authors": [
      "Zishuo Li",
      "Muhammad Umar B. Niazi",
      "Changxin Liu",
      "Yilin Mo",
      "Karl H. Johansson"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2212.08736",
    "title": "A Neural Network Warm-Start Approach for the Inverse Acoustic Obstacle  Scattering Problem",
    "abstract": " Title: A Neural Network Warm-Start Approach for the Inverse Acoustic Obstacle  Scattering Problem ",
    "url": "https://arxiv.org/abs/2212.08736",
    "authors": [
      "Mo Zhou",
      "Jiequn Han",
      "Manas Rachh",
      "Carlos Borges"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2212.12606",
    "title": "A Convergence Rate for Manifold Neural Networks",
    "abstract": " Title: A Convergence Rate for Manifold Neural Networks ",
    "url": "https://arxiv.org/abs/2212.12606",
    "authors": [
      "Joyce Chew",
      "Deanna Needell",
      "Michael Perlmutter"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Numerical Analysis (math.NA)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2301.09559",
    "title": "SpArX: Sparse Argumentative Explanations for Neural Networks",
    "abstract": " Comments: Accepted at the European Conference on Artificial Intelligence (ECAI) 2023 Conference ",
    "url": "https://arxiv.org/abs/2301.09559",
    "authors": [
      "Hamed Ayoobi",
      "Nico Potyka",
      "Francesca Toni"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2302.00742",
    "title": "Distributed CONGEST Algorithm for Finding Hamiltonian Paths in Dirac  Graphs and Generalizations",
    "abstract": " Title: Distributed CONGEST Algorithm for Finding Hamiltonian Paths in Dirac  Graphs and Generalizations ",
    "url": "https://arxiv.org/abs/2302.00742",
    "authors": [
      "Noy Biton",
      "Reut Levi",
      "Moti Medina"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2302.04031",
    "title": "FR-LIO: Fast and Robust Lidar-Inertial Odometry by Tightly-Coupled  Iterated Kalman Smoother and Robocentric Voxels",
    "abstract": " Title: FR-LIO: Fast and Robust Lidar-Inertial Odometry by Tightly-Coupled  Iterated Kalman Smoother and Robocentric Voxels ",
    "url": "https://arxiv.org/abs/2302.04031",
    "authors": [
      "Jun Liu",
      "Yunzhou Zhang",
      "Xiaoyu Zhao",
      "Zhengnan He"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2302.04246",
    "title": "Shortcut Detection with Variational Autoencoders",
    "abstract": " Comments: Accepted at the ICML 2023 Workshop on Spurious Correlations, Invariance and Stability ",
    "url": "https://arxiv.org/abs/2302.04246",
    "authors": [
      "Nicolas M. Müller",
      "Simon Roschmann",
      "Shahbaz Khan",
      "Philip Sperl",
      "Konstantin Böttinger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.06664",
    "title": "Generalizations of the Muller-Schupp theorem and tree-like inverse  graphs",
    "abstract": " Title: Generalizations of the Muller-Schupp theorem and tree-like inverse  graphs ",
    "url": "https://arxiv.org/abs/2302.06664",
    "authors": [
      "Emanuele Rodaro"
    ],
    "subjectives": [
      "Group Theory (math.GR)",
      "Formal Languages and Automata Theory (cs.FL)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2302.08647",
    "title": "Multiresolution Graph Transformers and Wavelet Positional Encoding for  Learning Hierarchical Structures",
    "abstract": " Title: Multiresolution Graph Transformers and Wavelet Positional Encoding for  Learning Hierarchical Structures ",
    "url": "https://arxiv.org/abs/2302.08647",
    "authors": [
      "Nhat Khang Ngo",
      "Truong Son Hy",
      "Risi Kondor"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.08988",
    "title": "Connectivity-Aware Semi-Decentralized Federated Learning over  Time-Varying D2D Networks",
    "abstract": " Comments: 10 pages, 5 figures. This paper has been accepted to ACM-MobiHoc 2023 ",
    "url": "https://arxiv.org/abs/2303.08988",
    "authors": [
      "Rohit Parasnis",
      "Seyyedali Hosseinalipour",
      "Yun-Wei Chu",
      "Mung Chiang",
      "Christopher G. Brinton"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2303.10656",
    "title": "More From Less: Self-Supervised Knowledge Distillation for Routine  Histopathology Data",
    "abstract": " Title: More From Less: Self-Supervised Knowledge Distillation for Routine  Histopathology Data ",
    "url": "https://arxiv.org/abs/2303.10656",
    "authors": [
      "Lucas Farndale",
      "Robert Insall",
      "Ke Yuan"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.15471",
    "title": "Embedding Contextual Information through Reward Shaping in Multi-Agent  Learning: A Case Study from Google Football",
    "abstract": " Title: Embedding Contextual Information through Reward Shaping in Multi-Agent  Learning: A Case Study from Google Football ",
    "url": "https://arxiv.org/abs/2303.15471",
    "authors": [
      "Chaoyi Gu",
      "Varuna De Silva",
      "Corentin Artaud",
      "Rafael Pina"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.14118",
    "title": "Learning Neural PDE Solvers with Parameter-Guided Channel Attention",
    "abstract": " Comments: accepted for publication in ICML2023 ",
    "url": "https://arxiv.org/abs/2304.14118",
    "authors": [
      "Makoto Takamoto",
      "Francesco Alesiani",
      "Mathias Niepert"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Computational Physics (physics.comp-ph)",
      "Fluid Dynamics (physics.flu-dyn)",
      "Geophysics (physics.geo-ph)"
    ]
  },
  {
    "id": "arXiv:2304.14133",
    "title": "VERITE: A Robust Benchmark for Multimodal Misinformation Detection  Accounting for Unimodal Bias",
    "abstract": " Title: VERITE: A Robust Benchmark for Multimodal Misinformation Detection  Accounting for Unimodal Bias ",
    "url": "https://arxiv.org/abs/2304.14133",
    "authors": [
      "Stefanos-Iordanis Papadopoulos",
      "Christos Koutlis",
      "Symeon Papadopoulos",
      "Panagiotis C. Petrantonakis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2305.16649",
    "title": "FSD: Fully-Specialized Detector via Neural Architecture Search",
    "abstract": " Title: FSD: Fully-Specialized Detector via Neural Architecture Search ",
    "url": "https://arxiv.org/abs/2305.16649",
    "authors": [
      "Zhe Huang",
      "Yudian Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2305.16652",
    "title": "Faster Ray Tracing through Hierarchy Cut Code",
    "abstract": " Title: Faster Ray Tracing through Hierarchy Cut Code ",
    "url": "https://arxiv.org/abs/2305.16652",
    "authors": [
      "WeiLai Xiang",
      "FengQi Liu",
      "Dan Li",
      "ZhaoNan Tan",
      "PengZhan Xu",
      "MeiZhi Liu",
      "QiLong Kou"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2305.18451",
    "title": "Shift-Robust Molecular Relational Learning with Causal Substructure",
    "abstract": " Comments: KDD 2023 ",
    "url": "https://arxiv.org/abs/2305.18451",
    "authors": [
      "Namkyeong Lee",
      "Kanghoon Yoon",
      "Gyoung S. Na",
      "Sein Kim",
      "Chanyoung Park"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Biomolecules (q-bio.BM)",
      "Molecular Networks (q-bio.MN)"
    ]
  },
  {
    "id": "arXiv:2306.01639",
    "title": "Reduction of finite sampling noise in quantum neural networks",
    "abstract": " Comments: 11 pages, 10 figures; refined section 5 ",
    "url": "https://arxiv.org/abs/2306.01639",
    "authors": [
      "David A. Kreplin",
      "Marco Roth"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.02270",
    "title": "Crypto-ransomware Detection through Quantitative API-based Behavioral  Profiling",
    "abstract": " Title: Crypto-ransomware Detection through Quantitative API-based Behavioral  Profiling ",
    "url": "https://arxiv.org/abs/2306.02270",
    "authors": [
      "Wenjia Song",
      "Sanjula Karanam",
      "Ya Xiao",
      "Jingyuan Qi",
      "Nathan Dautenhahn",
      "Na Meng",
      "Elena Ferrari",
      "Danfeng"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2306.03933",
    "title": "High-dimensional and Permutation Invariant Anomaly Detection",
    "abstract": " Comments: 7 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2306.03933",
    "authors": [
      "Vinicius Mikuni",
      "Benjamin Nachman"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)"
    ]
  },
  {
    "id": "arXiv:2306.07308",
    "title": "Self-Supervised Hyperspectral Inpainting with the Optimisation inspired  Deep Neural Network Prior",
    "abstract": " Comments: Presented in ISCS23 ",
    "url": "https://arxiv.org/abs/2306.07308",
    "authors": [
      "Shuo Li",
      "Mehrdad Yaghoobi"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.11585",
    "title": "FAIR: A Causal Framework for Accurately Inferring Judgments Reversals",
    "abstract": " Title: FAIR: A Causal Framework for Accurately Inferring Judgments Reversals ",
    "url": "https://arxiv.org/abs/2306.11585",
    "authors": [
      "Minghua He",
      "Nanfei Gu",
      "Yuntao Shi",
      "Qionghui Zhang",
      "Yaying Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2306.13971",
    "title": "Towards Robust Aspect-based Sentiment Analysis through  Non-counterfactual Augmentations",
    "abstract": " Comments: 10pages,1 figure,10 tables ",
    "url": "https://arxiv.org/abs/2306.13971",
    "authors": [
      "Xinyu Liu",
      "Yan Ding",
      "Kaikai An",
      "Chunyang Xiao",
      "Pranava Madhyastha",
      "Tong Xiao",
      "Jingbo Zhu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2307.02953",
    "title": "SegNetr: Rethinking the local-global interactions and skip connections  in U-shaped networks",
    "abstract": " Title: SegNetr: Rethinking the local-global interactions and skip connections  in U-shaped networks ",
    "url": "https://arxiv.org/abs/2307.02953",
    "authors": [
      "Junlong Cheng",
      "Chengrui Gao",
      "Fengjie Wang",
      "Min Zhu"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.03371",
    "title": "What makes a successful rebuttal in computer science conferences? : A  perspective on social interaction",
    "abstract": " Title: What makes a successful rebuttal in computer science conferences? : A  perspective on social interaction ",
    "url": "https://arxiv.org/abs/2307.03371",
    "authors": [
      "Junjie Huang",
      "Win-bin Huang",
      "Yi Bu",
      "Qi Cao",
      "Huawei Shen",
      "Xueqi Cheng"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Digital Libraries (cs.DL)"
    ]
  },
  {
    "id": "arXiv:2307.06092",
    "title": "Quantitative CLTs in Deep Neural Networks",
    "abstract": " Title: Quantitative CLTs in Deep Neural Networks ",
    "url": "https://arxiv.org/abs/2307.06092",
    "authors": [
      "Stefano Favaro",
      "Boris Hanin",
      "Domenico Marinucci",
      "Ivan Nourdin",
      "Giovanni Peccati"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Probability (math.PR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2307.08092",
    "title": "Gait Data Augmentation using Physics-Based Biomechanical Simulation",
    "abstract": " Comments: 30 pages including references, 5 Figures submitted to ESWA ",
    "url": "https://arxiv.org/abs/2307.08092",
    "authors": [
      "Mritula Chandrasekaran",
      "Jarek Francik",
      "Dimitrios Makris"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.08167",
    "title": "Computing the gradients with respect to all parameters of a quantum  neural network using a single circuit",
    "abstract": " Comments: Added a suggestion on improving real quantum computers ",
    "url": "https://arxiv.org/abs/2307.08167",
    "authors": [
      "Guang Ping He"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.08296",
    "title": "JCAS-Enabled Sensing as a Service in 6th-Generation Mobile Communication  Networks",
    "abstract": " Title: JCAS-Enabled Sensing as a Service in 6th-Generation Mobile Communication  Networks ",
    "url": "https://arxiv.org/abs/2307.08296",
    "authors": [
      "Christof A. O. Rauber",
      "Lukas Brechtel",
      "Hans D. Schotten"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2307.08652",
    "title": "Search Me Knot, Render Me Knot: Embedding Search and Differentiable  Rendering of Knots in 3D",
    "abstract": " Comments: Work in progress ",
    "url": "https://arxiv.org/abs/2307.08652",
    "authors": [
      "Aalok Gangopadhyay",
      "Paras Gupta",
      "Tarun Sharma",
      "Prajwal Singh",
      "Shanmuganathan Raman"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2307.09004",
    "title": "Ord2Seq: Regarding Ordinal Regression as Label Sequence Prediction",
    "abstract": " Comments: Accepted by ICCV2023 ",
    "url": "https://arxiv.org/abs/2307.09004",
    "authors": [
      "Jinhong Wang",
      "Yi Cheng",
      "Jintai Chen",
      "Tingting Chen",
      "Danny Chen",
      "Jian Wu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.09815",
    "title": "LDP: Language-driven Dual-Pixel Image Defocus Deblurring Network",
    "abstract": " Title: LDP: Language-driven Dual-Pixel Image Defocus Deblurring Network ",
    "url": "https://arxiv.org/abs/2307.09815",
    "authors": [
      "Hao Yang",
      "Liyuan Pan",
      "Yan Yang",
      "Miaomiao Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.10201",
    "title": "On the Mechanics of NFT Valuation: AI Ethics and Social Media",
    "abstract": " Comments: Presented at ChainScience Conference, 2003 (arXiv:2307.03277v2 [cs.DC] 11 Jul 2023) ",
    "url": "https://arxiv.org/abs/2307.10201",
    "authors": [
      "Luyao Zhang",
      "Yutong Sun",
      "Yutong Quan",
      "Jiaxun Cao",
      "Xin Tong"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2307.10496",
    "title": "A Competitive Learning Approach for Specialized Models: A Solution for  Complex Physical Systems with Distinct Functional Regimes",
    "abstract": " Title: A Competitive Learning Approach for Specialized Models: A Solution for  Complex Physical Systems with Distinct Functional Regimes ",
    "url": "https://arxiv.org/abs/2307.10496",
    "authors": [
      "Okezzi F. Ukorigho",
      "Opeoluwa Owoyele"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)"
    ]
  }
]