[
  {
    "id": "arXiv:2110.10287",
    "title": "Multi-concept adversarial attacks",
    "abstract": "As machine learning (ML) techniques are being increasingly used in many applications, their vulnerability to adversarial attacks becomes well-known. Test time attacks, usually launched by adding adversarial noise to test instances, have been shown effective against the deployed ML models. In practice, one test input may be leveraged by different ML models. Test time attacks targeting a single ML model often neglect their impact on other ML models. In this work, we empirically demonstrate that naively attacking the classifier learning one concept may negatively impact classifiers trained to learn other concepts. For example, for the online image classification scenario, when the Gender classifier is under attack, the (wearing) Glasses classifier is simultaneously attacked with the accuracy dropped from 98.69 to 88.42. This raises an interesting question: is it possible to attack one set of classifiers without impacting the other set that uses the same test instance? Answers to the above research question have interesting implications for protecting privacy against ML model misuse. Attacking ML models that pose unnecessary risks of privacy invasion can be an important tool for protecting individuals from harmful privacy exploitation. In this paper, we address the above research question by developing novel attack techniques that can simultaneously attack one set of ML models while preserving the accuracy of the other. In the case of linear classifiers, we provide a theoretical framework for finding an optimal solution to generate such adversarial examples. Using this theoretical framework, we develop a multi-concept attack strategy in the context of deep learning. Our results demonstrate that our techniques can successfully attack the target classes while protecting the protected classes in many different settings, which is not possible with the existing test-time attack-single strategies. ",
    "url": "https://arxiv.org/abs/2110.10287",
    "authors": [
      "Vibha Belavadi",
      "Yan Zhou",
      "Murat Kantarcioglu",
      "Bhavani M. Thuraisingham"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2110.10567",
    "title": "Fingerprint recognition with embedded presentation attacks detection:  are we ready?",
    "abstract": "The diffusion of fingerprint verification systems for security applications makes it urgent to investigate the embedding of software-based presentation attack detection algorithms (PAD) into such systems. Companies and institutions need to know whether such integration would make the system more \"secure\" and whether the technology available is ready, and, if so, at what operational working conditions. Despite significant improvements, especially by adopting deep learning approaches to fingerprint PAD, current research did not state much about their effectiveness when embedded in fingerprint verification systems. We believe that the lack of works is explained by the lack of instruments to investigate the problem, that is, modeling the cause-effect relationships when two non-zero error-free systems work together. Accordingly, this paper explores the fusion of PAD into verification systems by proposing a novel investigation instrument: a performance simulator based on the probabilistic modeling of the relationships among the Receiver Operating Characteristics (ROC) of the two individual systems when PAD and verification stages are implemented sequentially. As a matter of fact, this is the most straightforward, flexible, and widespread approach. We carry out simulations on the PAD algorithms' ROCs submitted to the most recent editions of LivDet (2017-2019), the state-of-the-art NIST Bozorth3, and the top-level Veryfinger 12 matchers. Reported experiments explore significant scenarios to get the conditions under which fingerprint matching with embedded PAD can improve, rather than degrade, the overall personal verification performance. ",
    "url": "https://arxiv.org/abs/2110.10567",
    "authors": [
      "Marco Micheletto",
      "Gian Luca Marcialis",
      "Giulia Orrù",
      "Fabio Roli"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.10628",
    "title": "PyPSA meets Africa: Developing an open source electricity network model  of the African continent",
    "abstract": "Electricity network modelling and grid simulations form a key enabling element for the integration of newer and cleaner technologies such as renewable energy generation and electric vehicles into the existing grid and energy system infrastructure. This paper reviews the models of the African electricity systems and highlights the gaps in the open model landscape. Using PyPSA (an open Power System Analysis package), the paper outlines the pathway to a fully open model and data to increase the transparency in the African electricity system planning. Optimisation and modelling can reveal viable pathways to a sustainable energy system, aiding strategic planning for upgrades and policy-making for accelerated integration of renewable energy generation and smart grid technologies such as battery storage in Africa. ",
    "url": "https://arxiv.org/abs/2110.10628",
    "authors": [
      "Desen Kirli",
      "Johannes Hampp",
      "Koen van Greevenboek",
      "Rebecca Grant",
      "Matin Mahmood",
      "Maximilian Parzen",
      "Aristides Kiprakis"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2110.10833",
    "title": "High-resolution rainfall-runoff modeling using graph neural network",
    "abstract": "Time-series modeling has shown great promise in recent studies using the latest deep learning algorithms such as LSTM (Long Short-Term Memory). These studies primarily focused on watershed-scale rainfall-runoff modeling or streamflow forecasting, but the majority of them only considered a single watershed as a unit. Although this simplification is very effective, it does not take into account spatial information, which could result in significant errors in large watersheds. Several studies investigated the use of GNN (Graph Neural Networks) for data integration by decomposing a large watershed into multiple sub-watersheds, but each sub-watershed is still treated as a whole, and the geoinformation contained within the watershed is not fully utilized. In this paper, we propose the GNRRM (Graph Neural Rainfall-Runoff Model), a novel deep learning model that makes full use of spatial information from high-resolution precipitation data, including flow direction and geographic information. When compared to baseline models, GNRRM has less over-fitting and significantly improves model performance. Our findings support the importance of hydrological data in deep learning-based rainfall-runoff modeling, and we encourage researchers to include more domain knowledge in their models. ",
    "url": "https://arxiv.org/abs/2110.10833",
    "authors": [
      "Zhongrun Xiang",
      "Ibrahim Demir"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2110.10869",
    "title": "LC3Net: Ladder context correlation complementary network for salient  object detection",
    "abstract": "Currently, existing salient object detection methods based on convolutional neural networks commonly resort to constructing discriminative networks to aggregate high level and low level features. However, contextual information is always not fully and reasonably utilized, which usually causes either the absence of useful features or contamination of redundant features. To address these issues, we propose a novel ladder context correlation complementary network (LC3Net) in this paper, which is equipped with three crucial components. At the beginning, we propose a filterable convolution block (FCB) to assist the automatic collection of information on the diversity of initial features, and it is simple yet practical. Besides, we propose a dense cross module (DCM) to facilitate the intimate aggregation of different levels of features by validly integrating semantic information and detailed information of both adjacent and non-adjacent layers. Furthermore, we propose a bidirectional compression decoder (BCD) to help the progressive shrinkage of multi-scale features from coarse to fine by leveraging multiple pairs of alternating top-down and bottom-up feature interaction flows. Extensive experiments demonstrate the superiority of our method against 16 state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2110.10869",
    "authors": [
      "Xian Fang",
      "Jinchao Zhu",
      "Xiuli Shao",
      "Hongpeng Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2110.10939",
    "title": "A channel attention based MLP-Mixer network for motor imagery decoding  with EEG",
    "abstract": "Convolutional neural networks (CNNs) and their variants have been successfully applied to the electroencephalogram (EEG) based motor imagery (MI) decoding task. However, these CNN-based algorithms generally have limitations in perceiving global temporal dependencies of EEG signals. Besides, they also ignore the diverse contributions of different EEG channels to the classification task. To address such issues, a novel channel attention based MLP-Mixer network (CAMLP-Net) is proposed for EEG-based MI decoding. Specifically, the MLP-based architecture is applied in this network to capture the temporal and spatial information. The attention mechanism is further embedded into MLP-Mixer to adaptively exploit the importance of different EEG channels. Therefore, the proposed CAMLP-Net can effectively learn more global temporal and spatial information. The experimental results on the newly built MI-2 dataset indicate that our proposed CAMLP-Net achieves superior classification performance over all the compared algorithms. ",
    "url": "https://arxiv.org/abs/2110.10939",
    "authors": [
      "Yanbin He",
      "Zhiyang Lu",
      "Jun Wang",
      "Jun Shi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2110.11048",
    "title": "Mixer-based lidar lane detection network and dataset for urban roads",
    "abstract": "Accurate lane detection under various road conditions is a critical function for autonomous driving. Generally, when detected lane lines from a front camera image are projected into a birds-eye view (BEV) for motion planning, the resulting lane lines are often distorted. And convolutional neural network (CNN)-based feature extractors often lose resolution when increasing the receptive field to detect global features such as lane lines. However, Lidar point cloud has little image distortion in the BEV-projection. Since lane lines are thin and stretch over entire BEV image while occupying only a small portion, lane lines should be detected as a global feature with high resolution. In this paper, we propose Lane Mixer Network (LMN) that extracts local features from Lidar point cloud, recognizes global features, and detects lane lines using a BEV encoder, a Mixer-based global feature extractor, and a detection head, respectively. In addition, we provide a world-first large urban lane dataset for Lidar, K-Lane, which has maximum 6 lanes under various urban road conditions. We demonstrate that the proposed LMN achieves the state-of-the-art performance, an F1 score of 91.67%, with K-Lane. The K-Lane, LMN training code, pre-trained models, and total dataset development platform are available at github. ",
    "url": "https://arxiv.org/abs/2110.11048",
    "authors": [
      "Donghee Paek",
      "Seung-Hyun Kong",
      "Kevin Tirta Wijaya"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2110.11064",
    "title": "Robust Edge-Direct Visual Odometry based on CNN edge detection and  Shi-Tomasi corner optimization",
    "abstract": "In this paper, we propose a robust edge-direct visual odometry (VO) based on CNN edge detection and Shi-Tomasi corner optimization. Four layers of pyramids were extracted from the image in the proposed method to reduce the motion error between frames. This solution used CNN edge detection and Shi-Tomasi corner optimization to extract information from the image. Then, the pose estimation is performed using the Levenberg-Marquardt (LM) algorithm and updating the keyframes. Our method was compared with the dense direct method, the improved direct method of Canny edge detection, and ORB-SLAM2 system on the RGB-D TUM benchmark. The experimental results indicate that our method achieves better robustness and accuracy. ",
    "url": "https://arxiv.org/abs/2110.11064",
    "authors": [
      "Kengdong Lu",
      "Jintao Cheng",
      "Yubin Zhou",
      "Juncan Deng",
      "Rui Fan",
      "Kaiqing Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2110.11281",
    "title": "Super-resolution of multiphase materials by combining complementary 2D  and 3D image data using generative adversarial networks",
    "abstract": "Modelling the impact of a material's mesostructure on device level performance typically requires access to 3D image data containing all the relevant information to define the geometry of the simulation domain. This image data must include sufficient contrast between phases to distinguish each material, be of high enough resolution to capture the key details, but also have a large enough field-of-view to be representative of the material in general. It is rarely possible to obtain data with all of these properties from a single imaging technique. In this paper, we present a method for combining information from pairs of distinct but complementary imaging techniques in order to accurately reconstruct the desired multi-phase, high resolution, representative, 3D images. Specifically, we use deep convolutional generative adversarial networks to implement super-resolution, style transfer and dimensionality expansion. To demonstrate the widespread applicability of this tool, two pairs of datasets are used to validate the quality of the volumes generated by fusing the information from paired imaging techniques. Three key mesostructural metrics are calculated in each case to show the accuracy of this method. Having confidence in the accuracy of our method, we then demonstrate its power by applying to a real data pair from a lithium ion battery electrode, where the required 3D high resolution image data is not available anywhere in the literature. We believe this approach is superior to previously reported statistical material reconstruction methods both in terms of its fidelity and ease of use. Furthermore, much of the data required to train this algorithm already exists in the literature, waiting to be combined. As such, our open-access code could precipitate a step change by generating the hard to obtain high quality image volumes necessary to simulate behaviour at the mesoscale. ",
    "url": "https://arxiv.org/abs/2110.11281",
    "authors": [
      "Amir Dahari",
      "Steve Kench",
      "Isaac Squires",
      "Samuel J. Cooper"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.11303",
    "title": "Survival-oriented embeddings for improving accessibility to complex data  structures",
    "abstract": "Deep learning excels in the analysis of unstructured data and recent advancements allow to extend these techniques to survival analysis. In the context of clinical radiology, this enables, e.g., to relate unstructured volumetric images to a risk score or a prognosis of life expectancy and support clinical decision making. Medical applications are, however, associated with high criticality and consequently, neither medical personnel nor patients do usually accept black box models as reason or basis for decisions. Apart from averseness to new technologies, this is due to missing interpretability, transparency and accountability of many machine learning methods. We propose a hazard-regularized variational autoencoder that supports straightforward interpretation of deep neural architectures in the context of survival analysis, a field highly relevant in healthcare. We apply the proposed approach to abdominal CT scans of patients with liver tumors and their corresponding survival times. ",
    "url": "https://arxiv.org/abs/2110.11303",
    "authors": [
      "Tobias Weber",
      "Michael Ingrisch",
      "Matthias Fabritius",
      "Bernd Bischl",
      "David Rügamer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.10489",
    "title": "Evaluation of augmentation methods in classifying autism spectrum  disorders from fMRI data with 3D convolutional neural networks",
    "abstract": "Classifying subjects as healthy or diseased using neuroimaging data has gained a lot of attention during the last 10 years. Here we apply deep learning to derivatives from resting state fMRI data, and investigate how different 3D augmentation techniques affect the test accuracy. Specifically, we use resting state derivatives from 1,112 subjects in ABIDE preprocessed to train a 3D convolutional neural network (CNN) to perform the classification. Our results show that augmentation only provide minor improvements to the test accuracy. ",
    "url": "https://arxiv.org/abs/2110.10489",
    "authors": [
      "Johan Jönemo",
      "David Abramian",
      "Anders Eklund"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2110.10518",
    "title": "Online non-parametric change-point detection for heterogeneous data  streams observed over graph nodes",
    "abstract": "Consider a heterogeneous data stream being generated by the nodes of a graph. The data stream is in essence composed by multiple streams, possibly of different nature that depends on each node. At a given moment $\\tau$, a change-point occurs for a subset of nodes $C$, signifying the change in the probability distribution of their associated streams. In this paper we propose an online non-parametric method to infer $\\tau$ based on the direct estimation of the likelihood-ratio between the post-change and the pre-change distribution associated with the data stream of each node. We propose a kernel-based method, under the hypothesis that connected nodes of the graph are expected to have similar likelihood-ratio estimates when there is no change-point. We demonstrate the quality of our method on synthetic experiments and real-world applications. ",
    "url": "https://arxiv.org/abs/2110.10518",
    "authors": [
      "Alejandro de la Concha",
      "Argyris Kalogeratos",
      "Nicolas Vayatis"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.10530",
    "title": "Improved pyrotechnics : Closer to the burning graph conjecture",
    "abstract": "Can every connected graph burn in $\\lceil \\sqrt{n} \\rceil $ steps? While this conjecture remains open, we prove that it is asymptotically true when the graph is much larger than its \\emph{growth}, which is the maximal distance of a vertex to a well-chosen path in the graph. In fact, we prove that the conjecture for graphs of bounded growth boils down to a finite number of cases. Through an improved (but still weaker) bound for all trees, we argue that the conjecture almost holds for all graphs with minimum degree at least $3$ and holds for all large enough graphs with minimum degree at least $4$. The previous best lower bound was $23$. ",
    "url": "https://arxiv.org/abs/2110.10530",
    "authors": [
      "Paul Bastide",
      "Marthe Bonamy",
      "Pierre Charbit",
      "Théo Pierron",
      "Mikaël Rabie"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2110.10587",
    "title": "Quantum networks theory",
    "abstract": "The formalism of quantum theory over discrete systems is extended in two significant ways. First, tensors and traceouts are generalized, so that systems can be partitioned according to almost arbitrary logical predicates. Second, quantum evolutions are generalized to act over network configurations, in such a way that nodes be allowed to merge, split and reconnect coherently in a superposition. The hereby presented mathematical framework is anchored on solid grounds through numerous lemmas. Indeed, one might have feared that the familiar interrelations between the notions of unitarity, complete positivity, trace-preservation, non-signalling causality, locality and localizability that are standard in quantum theory be jeopardized as the partitioning of systems becomes both logical and dynamical. Such interrelations in fact carry through, albeit two new notions become instrumental: consistency and comprehension. ",
    "url": "https://arxiv.org/abs/2110.10587",
    "authors": [
      "Pablo Arrighi",
      "Amélia Durbec",
      "Matt Wilson"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)",
      "General Relativity and Quantum Cosmology (gr-qc)",
      "Mathematical Physics (math-ph)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2110.10721",
    "title": "Learning quantum dynamics with latent neural ODEs",
    "abstract": "The core objective of machine-assisted scientific discovery is to learn physical laws from experimental data without prior knowledge of the systems in question. In the area of quantum physics, making progress towards these goals is significantly more challenging due to the curse of dimensionality as well as the counter-intuitive nature of quantum mechanics. Here, we present the QNODE, a latent neural ODE trained on dynamics from closed and open quantum systems. The QNODE can learn to generate quantum dynamics and extrapolate outside of its training region that satisfy the von Neumann and time-local Lindblad master equations for closed and open quantum systems. Furthermore the QNODE rediscovers quantum mechanical laws such as Heisenberg's uncertainty principle in a totally data-driven way, without constraints or guidance. Additionally, we show that trajectories that are generated from the QNODE and are close in its latent space have similar quantum dynamics while preserving the physics of the training system. ",
    "url": "https://arxiv.org/abs/2110.10721",
    "authors": [
      "Matthew Choi",
      "Daniel Flam-Shepherd",
      "Thi Ha Kyaw",
      "Alán Aspuru-Guzik"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.10783",
    "title": "Adversarial attacks against Bayesian forecasting dynamic models",
    "abstract": "The last decade has seen the rise of Adversarial Machine Learning (AML). This discipline studies how to manipulate data to fool inference engines, and how to protect those systems against such manipulation attacks. Extensive work on attacks against regression and classification systems is available, while little attention has been paid to attacks against time series forecasting systems. In this paper, we propose a decision analysis based attacking strategy that could be utilized against Bayesian forecasting dynamic models. ",
    "url": "https://arxiv.org/abs/2110.10783",
    "authors": [
      "Roi Naveiro"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.11144",
    "title": "rct: random consistency training for semi-supervised sound event  detection",
    "abstract": "Sound event detection (SED), as a core module of acoustic environmental analysis, suffers from the problem of data deficiency. The integration of semi-supervised learning (SSL) largely mitigates such problem while bringing no extra annotation budget. This paper researches on several core modules of SSL, and introduces a random consistency training (RCT) strategy. First, a self-consistency loss is proposed to fuse with the teacher-student model to stabilize the training. Second, a hard mixup data augmentation is proposed to account for the additive property of sounds. Third, a random augmentation scheme is applied to flexibly combine different types of data augmentations. Experiments show that the proposed strategy outperform other widely-used strategies. ",
    "url": "https://arxiv.org/abs/2110.11144",
    "authors": [
      "Nian Shao",
      "Erfan Loweimi",
      "Xiaofei Li"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:1908.09881",
    "title": "Consistently estimating graph statistics using Aggregated Relational  Data",
    "abstract": " Title: Consistently estimating graph statistics using Aggregated Relational  Data ",
    "url": "https://arxiv.org/abs/1908.09881",
    "authors": [
      "Emily Breza",
      "Arun G. Chandrasekhar",
      "Shane Lubold",
      "Tyler H. McCormick",
      "Mengjie Pan"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2005.14681",
    "title": "Improved torsion point attacks on SIDH variants",
    "abstract": " Comments: 37 pages including 3 appendices ",
    "url": "https://arxiv.org/abs/2005.14681",
    "authors": [
      "Victoria de Quehen",
      "Péter Kutas",
      "Chris Leonardi",
      "Chloe Martindale",
      "Lorenz Panny",
      "Christophe Petit",
      "Katherine E. Stange"
    ],
    "subjectives": [
      "Number Theory (math.NT)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2007.06679",
    "title": "Lipschitz regularity of graph Laplacians on random data clouds",
    "abstract": " Title: Lipschitz regularity of graph Laplacians on random data clouds ",
    "url": "https://arxiv.org/abs/2007.06679",
    "authors": [
      "Jeff Calder",
      "Nicolas Garcia Trillos",
      "Marta Lewicka"
    ],
    "subjectives": [
      "Analysis of PDEs (math.AP)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2008.00745",
    "title": "Community membership consistency applied to corporate board interlock  networks",
    "abstract": " Comments: This manuscript has been accepted for publication in the Journal of Computational Social Science ",
    "url": "https://arxiv.org/abs/2008.00745",
    "authors": [
      "Dafne E. van Kuppevelt",
      "Rena Bakhshi",
      "Eelke M. Heemskerk",
      "Frank W. Takes"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2011.10725",
    "title": "Impact of signal-to-noise ratio and bandwidth on graph Laplacian  spectrum from high-dimensional noisy point cloud",
    "abstract": " Title: Impact of signal-to-noise ratio and bandwidth on graph Laplacian  spectrum from high-dimensional noisy point cloud ",
    "url": "https://arxiv.org/abs/2011.10725",
    "authors": [
      "Xiucai Ding",
      "Hau-Tieng Wu"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Machine Learning (cs.LG)",
      "Spectral Theory (math.SP)"
    ]
  },
  {
    "id": "arXiv:2012.06774",
    "title": "A network analysis on cloud gaming: Stadia, GeForce Now and PSNow",
    "abstract": " Title: A network analysis on cloud gaming: Stadia, GeForce Now and PSNow ",
    "url": "https://arxiv.org/abs/2012.06774",
    "authors": [
      "Andrea Di Domenico",
      "Gianluca Perna",
      "Martino Trevisan",
      "Luca Vassio",
      "Danilo Giordano"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2102.04373",
    "title": "Partition-based formulations for mixed-integer optimization of trained  ReLU neural networks",
    "abstract": " Comments: Conference on Neural Information Processing Systems (NeurIPS) 2021 ",
    "url": "https://arxiv.org/abs/2102.04373",
    "authors": [
      "Calvin Tsay",
      "Jan Kronqvist",
      "Alexander Thebelt",
      "Ruth Misener"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2105.00287",
    "title": "The complexity of approximating the complex-valued Ising model on  bounded degree graphs",
    "abstract": " Comments: 49 pages, 9 figures On last update: minor changes, references have been updated and some definitions have been moved from the appendix to the main text ",
    "url": "https://arxiv.org/abs/2105.00287",
    "authors": [
      "Andreas Galanis",
      "Leslie Ann Goldberg",
      "Andrés Herrera-Poyatos"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2105.04040",
    "title": "Truly shift-equivariant convolutional neural networks with adaptive  polyphase upsampling",
    "abstract": " Title: Truly shift-equivariant convolutional neural networks with adaptive  polyphase upsampling ",
    "url": "https://arxiv.org/abs/2105.04040",
    "authors": [
      "Anadi Chaman",
      "Ivan Dokmanić"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2105.09513",
    "title": "Deep Kronecker neural networks: A general framework for neural networks  with adaptive activation functions",
    "abstract": " Comments: 24 pages, 16 figures ",
    "url": "https://arxiv.org/abs/2105.09513",
    "authors": [
      "Ameya D. Jagtap",
      "Yeonjong Shin",
      "Kenji Kawaguchi",
      "George Em Karniadakis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.00090",
    "title": "Mesh-based graph convolutional neural networks for modeling materials  with microstructure",
    "abstract": " Comments: 45 pages, 19 figures ",
    "url": "https://arxiv.org/abs/2107.00090",
    "authors": [
      "Ari Frankel",
      "Cosmin Safta",
      "Coleman Alleman",
      "Reese Jones"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.04614",
    "title": "White blood cell subtype detection and classification",
    "abstract": " Title: White blood cell subtype detection and classification ",
    "url": "https://arxiv.org/abs/2108.04614",
    "authors": [
      "Nalla Praveen",
      "Narinder Singh Punn",
      "Sanjay Kumar Sonbhadra",
      "Sonali Agarwal",
      "M. Syafrullah",
      "Krisna Adiyarta"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.09948",
    "title": "Neural networks with trainable matrix activation functions",
    "abstract": " Title: Neural networks with trainable matrix activation functions ",
    "url": "https://arxiv.org/abs/2109.09948",
    "authors": [
      "Yuwen Li",
      "Zhengqi Liu",
      "Ludmil Zikatanov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2109.14950",
    "title": "A useful criterion on studying consistent estimation in community  detection",
    "abstract": " Title: A useful criterion on studying consistent estimation in community  detection ",
    "url": "https://arxiv.org/abs/2109.14950",
    "authors": [
      "Huan Qing"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.04402",
    "title": "Walking into the complex plane to 'order' better time integrators",
    "abstract": " Comments: 30 pages, 15 figures ",
    "url": "https://arxiv.org/abs/2110.04402",
    "authors": [
      "Jithin D. George",
      "Samuel Y. Jung",
      "Niall M. Mangan"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Complex Variables (math.CV)"
    ]
  },
  {
    "id": "arXiv:2110.07421",
    "title": "On some batch code properties of the simplex code",
    "abstract": " Title: On some batch code properties of the simplex code ",
    "url": "https://arxiv.org/abs/2110.07421",
    "authors": [
      "Henk D.L. Hollmann",
      "Karan Khathuria",
      "Ago-Erik Riet",
      "Vitaly Skachek"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2110.08424",
    "title": "Deep learning-based detection of intravenous contrast in computed  tomography scans",
    "abstract": " Title: Deep learning-based detection of intravenous contrast in computed  tomography scans ",
    "url": "https://arxiv.org/abs/2110.08424",
    "authors": [
      "Zezhong Ye",
      "Jack M. Qian",
      "Ahmed Hosny",
      "Roman Zeleznik",
      "Deborah Plana",
      "Jirapat Likitlersuang",
      "Zhongyi Zhang",
      "Raymond H. Mak",
      "Hugo J. W. L. Aerts",
      "Benjamin H. Kann"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2110.09702",
    "title": "A non-hierarchical attention network with modality dropout for textual  response generation in multimodal dialogue systems",
    "abstract": " Comments: Submitted to ICASSP2022 (currently under review) ",
    "url": "https://arxiv.org/abs/2110.09702",
    "authors": [
      "Rongyi Sun",
      "Borun Chen",
      "Qingyu Zhou",
      "Yinghui Li",
      "YunBo Cao",
      "Hai-Tao Zheng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  }
]