[
  {
    "id": "arXiv:2402.04284",
    "title": "PRES: Toward Scalable Memory-Based Dynamic Graph Neural Networks",
    "abstract": "Memory-based Dynamic Graph Neural Networks (MDGNNs) are a family of dynamic graph neural networks that leverage a memory module to extract, distill, and memorize long-term temporal dependencies, leading to superior performance compared to memory-less counterparts. However, training MDGNNs faces the challenge of handling entangled temporal and structural dependencies, requiring sequential and chronological processing of data sequences to capture accurate temporal patterns. During the batch training, the temporal data points within the same batch will be processed in parallel, while their temporal dependencies are neglected. This issue is referred to as temporal discontinuity and restricts the effective temporal batch size, limiting data parallelism and reducing MDGNNs' flexibility in industrial applications. This paper studies the efficient training of MDGNNs at scale, focusing on the temporal discontinuity in training MDGNNs with large temporal batch sizes. We first conduct a theoretical study on the impact of temporal batch size on the convergence of MDGNN training. Based on the analysis, we propose PRES, an iterative prediction-correction scheme combined with a memory coherence learning objective to mitigate the effect of temporal discontinuity, enabling MDGNNs to be trained with significantly larger temporal batches without sacrificing generalization performance. Experimental results demonstrate that our approach enables up to a 4x larger temporal batch (3.4x speed-up) during MDGNN training. ",
    "url": "https://arxiv.org/abs/2402.04284",
    "authors": [
      "Junwei Su",
      "Difan Zou",
      "Chuan Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04296",
    "title": "LightHGNN: Distilling Hypergraph Neural Networks into MLPs for  $100\\times$ Faster Inference",
    "abstract": "Hypergraph Neural Networks (HGNNs) have recently attracted much attention and exhibited satisfactory performance due to their superiority in high-order correlation modeling. However, it is noticed that the high-order modeling capability of hypergraph also brings increased computation complexity, which hinders its practical industrial deployment. In practice, we find that one key barrier to the efficient deployment of HGNNs is the high-order structural dependencies during inference. In this paper, we propose to bridge the gap between the HGNNs and inference-efficient Multi-Layer Perceptron (MLPs) to eliminate the hypergraph dependency of HGNNs and thus reduce computational complexity as well as improve inference speed. Specifically, we introduce LightHGNN and LightHGNN$^+$ for fast inference with low complexity. LightHGNN directly distills the knowledge from teacher HGNNs to student MLPs via soft labels, and LightHGNN$^+$ further explicitly injects reliable high-order correlations into the student MLPs to achieve topology-aware distillation and resistance to over-smoothing. Experiments on eight hypergraph datasets demonstrate that even without hypergraph dependency, the proposed LightHGNNs can still achieve competitive or even better performance than HGNNs and outperform vanilla MLPs by $16.3$ on average. Extensive experiments on three graph datasets further show the average best performance of our LightHGNNs compared with all other methods. Experiments on synthetic hypergraphs with 5.5w vertices indicate LightHGNNs can run $100\\times$ faster than HGNNs, showcasing their ability for latency-sensitive deployments. ",
    "url": "https://arxiv.org/abs/2402.04296",
    "authors": [
      "Yifan Feng",
      "Yihe Luo",
      "Shihui Ying",
      "Yue Gao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04297",
    "title": "Road Surface Defect Detection -- From Image-based to Non-image-based: A  Survey",
    "abstract": "Ensuring traffic safety is crucial, which necessitates the detection and prevention of road surface defects. As a result, there has been a growing interest in the literature on the subject, leading to the development of various road surface defect detection methods. The methods for detecting road defects can be categorised in various ways depending on the input data types or training methodologies. The predominant approach involves image-based methods, which analyse pixel intensities and surface textures to identify defects. Despite their popularity, image-based methods share the distinct limitation of vulnerability to weather and lighting changes. To address this issue, researchers have explored the use of additional sensors, such as laser scanners or LiDARs, providing explicit depth information to enable the detection of defects in terms of scale and volume. However, the exploration of data beyond images has not been sufficiently investigated. In this survey paper, we provide a comprehensive review of road surface defect detection studies, categorising them based on input data types and methodologies used. Additionally, we review recently proposed non-image-based methods and discuss several challenges and open problems associated with these techniques. ",
    "url": "https://arxiv.org/abs/2402.04297",
    "authors": [
      "Jongmin Yu",
      "Jiaqi Jiang",
      "Sebastiano Fichera",
      "Paolo Paoletti",
      "Lisa Layzell",
      "Devansh Mehta",
      "Shan Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04318",
    "title": "Human Observation-Inspired Trajectory Prediction for Autonomous Driving  in Mixed-Autonomy Traffic Environments",
    "abstract": "In the burgeoning field of autonomous vehicles (AVs), trajectory prediction remains a formidable challenge, especially in mixed autonomy environments. Traditional approaches often rely on computational methods such as time-series analysis. Our research diverges significantly by adopting an interdisciplinary approach that integrates principles of human cognition and observational behavior into trajectory prediction models for AVs. We introduce a novel \"adaptive visual sector\" mechanism that mimics the dynamic allocation of attention human drivers exhibit based on factors like spatial orientation, proximity, and driving speed. Additionally, we develop a \"dynamic traffic graph\" using Convolutional Neural Networks (CNN) and Graph Attention Networks (GAT) to capture spatio-temporal dependencies among agents. Benchmark tests on the NGSIM, HighD, and MoCAD datasets reveal that our model (GAVA) outperforms state-of-the-art baselines by at least 15.2%, 19.4%, and 12.0%, respectively. Our findings underscore the potential of leveraging human cognition principles to enhance the proficiency and adaptability of trajectory prediction algorithms in AVs. The code for the proposed model is available at our Github. ",
    "url": "https://arxiv.org/abs/2402.04318",
    "authors": [
      "Haicheng Liao",
      "Shangqian Liu",
      "Yongkang Li",
      "Zhenning Li",
      "Chengyue Wang",
      "Bonan Wang",
      "Yanchen Guan",
      "Chengzhong Xu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2402.04325",
    "title": "Enhance DNN Adversarial Robustness and Efficiency via Injecting Noise to  Non-Essential Neurons",
    "abstract": "Deep Neural Networks (DNNs) have revolutionized a wide range of industries, from healthcare and finance to automotive, by offering unparalleled capabilities in data analysis and decision-making. Despite their transforming impact, DNNs face two critical challenges: the vulnerability to adversarial attacks and the increasing computational costs associated with more complex and larger models. In this paper, we introduce an effective method designed to simultaneously enhance adversarial robustness and execution efficiency. Unlike prior studies that enhance robustness via uniformly injecting noise, we introduce a non-uniform noise injection algorithm, strategically applied at each DNN layer to disrupt adversarial perturbations introduced in attacks. By employing approximation techniques, our approach identifies and protects essential neurons while strategically introducing noise into non-essential neurons. Our experimental results demonstrate that our method successfully enhances both robustness and efficiency across several attack scenarios, model architectures, and datasets. ",
    "url": "https://arxiv.org/abs/2402.04325",
    "authors": [
      "Zhenyu Liu",
      "Garrett Gagnon",
      "Swagath Venkataramani",
      "Liu Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.04362",
    "title": "Neural Networks Learn Statistics of Increasing Complexity",
    "abstract": "The distributional simplicity bias (DSB) posits that neural networks learn low-order moments of the data distribution first, before moving on to higher-order correlations. In this work, we present compelling new evidence for the DSB by showing that networks automatically learn to perform well on maximum-entropy distributions whose low-order statistics match those of the training set early in training, then lose this ability later. We also extend the DSB to discrete domains by proving an equivalence between token $n$-gram frequencies and the moments of embedding vectors, and by finding empirical evidence for the bias in LLMs. Finally we use optimal transport methods to surgically edit the low-order statistics of one class to match those of another, and show that early-training networks treat the edited samples as if they were drawn from the target class. Code is available at https://github.com/EleutherAI/features-across-time. ",
    "url": "https://arxiv.org/abs/2402.04362",
    "authors": [
      "Nora Belrose",
      "Quintin Pope",
      "Lucia Quirke",
      "Alex Mallen",
      "Xiaoli Fern"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04377",
    "title": "$\\texttt{NeRCC}$: Nested-Regression Coded Computing for Resilient  Distributed Prediction Serving Systems",
    "abstract": "Resilience against stragglers is a critical element of prediction serving systems, tasked with executing inferences on input data for a pre-trained machine-learning model. In this paper, we propose NeRCC, as a general straggler-resistant framework for approximate coded computing. NeRCC includes three layers: (1) encoding regression and sampling, which generates coded data points, as a combination of original data points, (2) computing, in which a cluster of workers run inference on the coded data points, (3) decoding regression and sampling, which approximately recovers the predictions of the original data points from the available predictions on the coded data points. We argue that the overall objective of the framework reveals an underlying interconnection between two regression models in the encoding and decoding layers. We propose a solution to the nested regressions problem by summarizing their dependence on two regularization terms that are jointly optimized. Our extensive experiments on different datasets and various machine learning models, including LeNet5, RepVGG, and Vision Transformer (ViT), demonstrate that NeRCC accurately approximates the original predictions in a wide range of stragglers, outperforming the state-of-the-art by up to 23%. ",
    "url": "https://arxiv.org/abs/2402.04377",
    "authors": [
      "Parsa Moradi",
      "Mohammad Ali Maddah-Ali"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2402.04383",
    "title": "FairWire: Fair Graph Generation",
    "abstract": "Machine learning over graphs has recently attracted growing attention due to its ability to analyze and learn complex relations within critical interconnected systems. However, the disparate impact that is amplified by the use of biased graph structures in these algorithms has raised significant concerns for the deployment of them in real-world decision systems. In addition, while synthetic graph generation has become pivotal for privacy and scalability considerations, the impact of generative learning algorithms on the structural bias has not yet been investigated. Motivated by this, this work focuses on the analysis and mitigation of structural bias for both real and synthetic graphs. Specifically, we first theoretically analyze the sources of structural bias that result in disparity for the predictions of dyadic relations. To alleviate the identified bias factors, we design a novel fairness regularizer that offers a versatile use. Faced with the bias amplification in graph generation models that is brought to light in this work, we further propose a fair graph generation framework, FairWire, by leveraging our fair regularizer design in a generative model. Experimental results on real-world networks validate that the proposed tools herein deliver effective structural bias mitigation for both real and synthetic graphs. ",
    "url": "https://arxiv.org/abs/2402.04383",
    "authors": [
      "O. Deniz Kose",
      "Yanning Shen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2402.04385",
    "title": "Locating the roots of a quadratic equation in one variable through a  Line-Circumference (LC) geometric construction in the plane of complex  numbers",
    "abstract": "This paper describes a geometrical method for finding the roots $r_1$, $r_2$ of a quadratic equation in one complex variable of the form $x^2+c_1 x+c_2=0$, by means of a Line $L$ and a Circumference $C$ in the complex plane, constructed from known coefficients $c_1$, $c_2$. This Line-Circumference (LC) geometric structure contains the sought roots $r_1$, $r_2$ at the intersections of its component elements $L$ and $C$. Line $L$ in the LC structure is mapped onto Circumference $C$ by a Mobius transformation. The location and inclination angle of Line $L$ can be computed directly from coefficients $c_1$, $c_2$, while Circumference $C$ is constructed by dividing the constant term $c_2$ by each point from Line $L$. This paper describes and develops the technical details for the LC Method, and then shows how the LC Method works through a numerical example. The quadratic LC method described here can be extended to polynomials in one variable of degree greater than two, in order to find initial approximations to their roots. As an additional feature, this paper also studies an interesting property of the rectilinear segments connecting key points in a quadratic LC structure. ",
    "url": "https://arxiv.org/abs/2402.04385",
    "authors": [
      "Daniel Alba-Cuellar"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Complex Variables (math.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04386",
    "title": "Novel Methods for Load Estimation in Cell Switching in HAPS-Assisted  Sustainable 6G Networks",
    "abstract": "In the evolving landscape of vertical heterogeneous networks, the practice of cell switching particularly for small base stations faces a significant challenge due to the lack of accurate data on the traffic load of sleeping SBSs. This information gap is crucial as it hinders the feasibility and applicability of existing power consumption optimization methods; however, the studies in the literature predominantly assume perfect knowledge about the traffic load of sleeping SBSs. Addressing this critical issue, our study introduces innovative methodologies for estimating the traffic load of sleeping SBSs in a vHetNet including the integration of a high altitude platform as a super macro base station into the terrestrial network. We propose three distinct spatial interpolation-based estimation schemes: clustering-based, distance based, and random neighboring selection. Employing a real data set for empirical validations, we compare the estimation performance of the developed traffic load estimation schemes and assess the impact of estimation errors. Our findings demonstrate that accurate estimation of sleeping SBSs' traffic loads is essential for making network power consumption optimization methods both feasible and applicable in vHetNets. ",
    "url": "https://arxiv.org/abs/2402.04386",
    "authors": [
      "Maryam Salamatmoghadasi",
      "Metin Ozturk",
      "Halim Yanikomeroglu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2402.04390",
    "title": "Densely Multiplied Physics Informed Neural Network",
    "abstract": "Although physics-informed neural networks (PINNs) have shown great potential in dealing with nonlinear partial differential equations (PDEs), it is common that PINNs will suffer from the problem of insufficient precision or obtaining incorrect outcomes. Unlike most of the existing solutions trying to enhance the ability of PINN by optimizing the training process, this paper improved the neural network architecture to improve the performance of PINN. We propose a densely multiply PINN (DM-PINN) architecture, which multiplies the output of a hidden layer with the outputs of all the behind hidden layers. Without introducing more trainable parameters, this effective mechanism can significantly improve the accuracy of PINNs. The proposed architecture is evaluated on four benchmark examples (Allan-Cahn equation, Helmholtz equation, Burgers equation and 1D convection equation). Comparisons between the proposed architecture and different PINN structures demonstrate the superior performance of the DM-PINN in both accuracy and efficiency. ",
    "url": "https://arxiv.org/abs/2402.04390",
    "authors": [
      "Feilong Jiang",
      "Xiaonan Hou",
      "Min Xia"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.04403",
    "title": "Edge-Parallel Graph Encoder Embedding",
    "abstract": "New algorithms for embedding graphs have reduced the asymptotic complexity of finding low-dimensional representations. One-Hot Graph Encoder Embedding (GEE) uses a single, linear pass over edges and produces an embedding that converges asymptotically to the spectral embedding. The scaling and performance benefits of this approach have been limited by a serial implementation in an interpreted language. We refactor GEE into a parallel program in the Ligra graph engine that maps functions over the edges of the graph and uses lock-free atomic instrutions to prevent data races. On a graph with 1.8B edges, this results in a 500 times speedup over the original implementation and a 17 times speedup over a just-in-time compiled version. ",
    "url": "https://arxiv.org/abs/2402.04403",
    "authors": [
      "Ariel Lubonja",
      "Cencheng Shen",
      "Carey Priebe",
      "Randal Burns"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04405",
    "title": "Interpretable domain knowledge enhanced machine learning framework on  axial capacity prediction of circular CFST columns",
    "abstract": "This study introduces a novel machine learning framework, integrating domain knowledge, to accurately predict the bearing capacity of CFSTs, bridging the gap between traditional engineering and machine learning techniques. Utilizing a comprehensive database of 2621 experimental data points on CFSTs, we developed a Domain Knowledge Enhanced Neural Network (DKNN) model. This model incorporates advanced feature engineering techniques, including Pearson correlation, XGBoost, and Random tree algorithms. The DKNN model demonstrated a marked improvement in prediction accuracy, with a Mean Absolute Percentage Error (MAPE) reduction of over 50% compared to existing models. Its robustness was confirmed through extensive performance assessments, maintaining high accuracy even in noisy environments. Furthermore, sensitivity and SHAP analysis were conducted to assess the contribution of each effective parameter to axial load capacity and propose design recommendations for the diameter of cross-section, material strength range and material combination. This research advances CFST predictive modelling, showcasing the potential of integrating machine learning with domain expertise in structural engineering. The DKNN model sets a new benchmark for accuracy and reliability in the field. ",
    "url": "https://arxiv.org/abs/2402.04405",
    "authors": [
      "Dian Wang",
      "Zhigang Ren",
      "Gen Kondo",
      "Peipeng Li"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2402.04408",
    "title": "Detection Transformer for Teeth Detection, Segmentation, and Numbering  in Oral Rare Diseases: Focus on Data Augmentation and Inpainting Techniques",
    "abstract": "In this work, we focused on deep learning image processing in the context of oral rare diseases, which pose challenges due to limited data availability. A crucial step involves teeth detection, segmentation and numbering in panoramic radiographs. To this end, we used a dataset consisting of 156 panoramic radiographs from individuals with rare oral diseases and labeled by experts. We trained the Detection Transformer (DETR) neural network for teeth detection, segmentation, and numbering the 52 teeth classes. In addition, we used data augmentation techniques, including geometric transformations. Finally, we generated new panoramic images using inpainting techniques with stable diffusion, by removing teeth from a panoramic radiograph and integrating teeth into it. The results showed a mAP exceeding 0,69 for DETR without data augmentation. The mAP was improved to 0,82 when data augmentation techniques are used. Furthermore, we observed promising performances when using new panoramic radiographs generated with inpainting technique, with mAP of 0,76. ",
    "url": "https://arxiv.org/abs/2402.04408",
    "authors": [
      "Hocine Kadi",
      "Théo Sourget",
      "Marzena Kawczynski",
      "Sara Bendjama",
      "Bruno Grollemund",
      "Agnès Bloch-Zupan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04409",
    "title": "Towards Fair, Robust and Efficient Client Contribution Evaluation in  Federated Learning",
    "abstract": "The performance of clients in Federated Learning (FL) can vary due to various reasons. Assessing the contributions of each client is crucial for client selection and compensation. It is challenging because clients often have non-independent and identically distributed (non-iid) data, leading to potentially noisy or divergent updates. The risk of malicious clients amplifies the challenge especially when there's no access to clients' local data or a benchmark root dataset. In this paper, we introduce a novel method called Fair, Robust, and Efficient Client Assessment (FRECA) for quantifying client contributions in FL. FRECA employs a framework called FedTruth to estimate the global model's ground truth update, balancing contributions from all clients while filtering out impacts from malicious ones. This approach is robust against Byzantine attacks and incorporates a Byzantine-resilient aggregation algorithm. FRECA is also efficient, as it operates solely on local model updates and requires no validation operations or datasets. Our experimental results show that FRECA can accurately and efficiently quantify client contributions in a robust manner. ",
    "url": "https://arxiv.org/abs/2402.04409",
    "authors": [
      "Meiying Zhang",
      "Huan Zhao",
      "Sheldon Ebron",
      "Kan Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2402.04417",
    "title": "Decentralized Blockchain-based Robust Multi-agent Multi-armed Bandit",
    "abstract": "We study a robust multi-agent multi-armed bandit problem where multiple clients or participants are distributed on a fully decentralized blockchain, with the possibility of some being malicious. The rewards of arms are homogeneous among the clients, following time-invariant stochastic distributions that are revealed to the participants only when the system is secure enough. The system's objective is to efficiently ensure the cumulative rewards gained by the honest participants. To this end and to the best of our knowledge, we are the first to incorporate advanced techniques from blockchains, as well as novel mechanisms, into the system to design optimal strategies for honest participants. This allows various malicious behaviors and the maintenance of participant privacy. More specifically, we randomly select a pool of validators who have access to all participants, design a brand-new consensus mechanism based on digital signatures for these validators, invent a UCB-based strategy that requires less information from participants through secure multi-party computation, and design the chain-participant interaction and an incentive mechanism to encourage participants' participation. Notably, we are the first to prove the theoretical guarantee of the proposed algorithms by regret analyses in the context of optimality in blockchains. Unlike existing work that integrates blockchains with learning problems such as federated learning which mainly focuses on numerical optimality, we demonstrate that the regret of honest participants is upper bounded by $log{T}$. This is consistent with the multi-agent multi-armed bandit problem without malicious participants and the robust multi-agent multi-armed bandit problem with purely Byzantine attacks. ",
    "url": "https://arxiv.org/abs/2402.04417",
    "authors": [
      "Mengfan Xu",
      "Diego Klabjan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2402.04421",
    "title": "Studying Vulnerable Code Entities in R",
    "abstract": "Pre-trained Code Language Models (Code-PLMs) have shown many advancements and achieved state-of-the-art results for many software engineering tasks in the past few years. These models are mainly targeted for popular programming languages such as Java and Python, leaving out many other ones like R. Though R has a wide community of developers and users, there is little known about the applicability of Code-PLMs for R. In this preliminary study, we aim to investigate the vulnerability of Code-PLMs for code entities in R. For this purpose, we use an R dataset of code and comment pairs and then apply CodeAttack, a black-box attack model that uses the structure of code to generate adversarial code samples. We investigate how the model can attack different entities in R. This is the first step towards understanding the importance of R token types, compared to popular programming languages (e.g., Java). We limit our study to code summarization. Our results show that the most vulnerable code entity is the identifier, followed by some syntax tokens specific to R. The results can shed light on the importance of token types and help in developing models for code summarization and method name prediction for the R language. ",
    "url": "https://arxiv.org/abs/2402.04421",
    "authors": [
      "Zixiao Zhao",
      "Millon Madhur Das",
      "Fatemeh H. Fard"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.04424",
    "title": "Optimal Binary Signaling for a Two Sensor Gaussian MAC Network",
    "abstract": "We consider a two sensor distributed detection system transmitting a binary non-uniform source over a Gaussian multiple access channel (MAC). We model the network via binary sensors whose outputs are generated by binary symmetric channels of different noise levels. We prove an optimal one dimensional constellation design under individual sensor power constraints which minimizes the error probability of detecting the source. Three distinct cases arise for this optimization based on the parameters in the problem setup. In the most notable case (Case III), the optimal signaling design is to not necessarily use all of the power allocated to the more noisy sensor (with less correlation to the source). We compare the error performance of the optimal one dimensional constellation to orthogonal signaling. The results show that the optimal one dimensional constellation achieves lower error probability than using orthogonal channels. ",
    "url": "https://arxiv.org/abs/2402.04424",
    "authors": [
      "Luca Sardellitti",
      "Glen Takahara",
      "Fady Alajaji"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2402.04431",
    "title": "ARMAN: A Reconfigurable Monolithic 3D Accelerator Architecture for  Convolutional Neural Networks",
    "abstract": "The Convolutional Neural Network (CNN) has emerged as a powerful and versatile tool for artificial intelligence (AI) applications. Conventional computing architectures face challenges in meeting the demanding processing requirements of compute-intensive CNN applications, as they suffer from limited throughput and low utilization. To this end, specialized accelerators have been developed to speed up CNN computations. However, as we demonstrate in this paper via extensive design space exploration, different neural network models have different characteristics, which calls for different accelerator architectures and configurations to match their computing demand. We show that a one-size-fits-all fixed architecture does not guarantee optimal power/energy/performance trade-off. To overcome this challenge, this paper proposes ARMAN, a novel reconfigurable systolic-array-based accelerator architecture based on Monolithic 3D (M3D) technology for CNN inference. The proposed accelerator offers the flexibility to reconfigure among different scale-up or scale-out arrangements depending on the neural network structure, providing the optimal trade-off across power, energy, and performance for various neural network models. We demonstrate the effectiveness of our approach through evaluations of multiple benchmarks. The results demonstrate that the proposed accelerator exhibits up to 2x, 2.24x, 1.48x, and 2x improvements in terms of execution cycles, power, energy, and EDP respectively, over the non-configurable architecture. ",
    "url": "https://arxiv.org/abs/2402.04431",
    "authors": [
      "Ali Sedaghatgoo",
      "Amir M. Hajisadeghi",
      "Mahmoud Momtazpour",
      "Nader Bagherzadeh"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Emerging Technologies (cs.ET)"
    ]
  },
  {
    "id": "arXiv:2402.04435",
    "title": "PreGIP: Watermarking the Pretraining of Graph Neural Networks for Deep  Intellectual Property Protection",
    "abstract": "Pretraining on Graph Neural Networks (GNNs) has shown great power in facilitating various downstream tasks. As pretraining generally requires huge amount of data and computational resources, the pretrained GNNs are high-value Intellectual Properties (IP) of the legitimate owner. However, adversaries may illegally copy and deploy the pretrained GNN models for their downstream tasks. Though initial efforts have been made to watermark GNN classifiers for IP protection, these methods require the target classification task for watermarking, and thus are not applicable to self-supervised pretraining of GNN models. Hence, in this work, we propose a novel framework named PreGIP to watermark the pretraining of GNN encoder for IP protection while maintain the high-quality of the embedding space. PreGIP incorporates a task-free watermarking loss to watermark the embedding space of pretrained GNN encoder. A finetuning-resistant watermark injection is further deployed. Theoretical analysis and extensive experiments show the effectiveness of {\\method} in IP protection and maintaining high-performance for downstream tasks. ",
    "url": "https://arxiv.org/abs/2402.04435",
    "authors": [
      "Enyan Dai",
      "Minhua Lin",
      "Suhang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.04438",
    "title": "The domino problem is decidable for robust tilesets",
    "abstract": "One of the most fundamental problems in tiling theory is the domino problem: given a set of tiles and tiling rules, decide if there exists a way to tile the plane using copies of tiles and following their rules. The problem is known to be undecidable in general and even for sets of Wang tiles, which are unit square tiles wearing colours on their edges which can be assembled provided they share the same colour on their common edge, as proven by Berger in the 1960s. In this paper, we focus on Wang tilesets. We prove that the domino problem is decidable for robust tilesets, i.e. tilesets that either cannot tile the plane or can but, if so, satisfy some particular invariant provably. We establish that several famous tilesets considered in the literature are robust. We give arguments that this is true for all tilesets unless they are produced from non-robust Turing machines: a Turing machine is said to be non-robust if it does not halt and furthermore does so non-provably. As a side effect of our work, we provide a sound and relatively complete method for proving that a tileset can tile the plane. Our analysis also provides explanations for the observed similarities between proofs in the literature for various tilesets, as well as of phenomena that have been observed experimentally in the systematic study of tilesets using computer methods. ",
    "url": "https://arxiv.org/abs/2402.04438",
    "authors": [
      "Nathalie Aubrun",
      "Manon Blanc",
      "Olivier Bournez"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Logic in Computer Science (cs.LO)",
      "Combinatorics (math.CO)",
      "Dynamical Systems (math.DS)",
      "Logic (math.LO)"
    ]
  },
  {
    "id": "arXiv:2402.04440",
    "title": "Exploring higher-order neural network node interactions with total  correlation",
    "abstract": "In domains such as ecological systems, collaborations, and the human brain the variables interact in complex ways. Yet accurately characterizing higher-order variable interactions (HOIs) is a difficult problem that is further exacerbated when the HOIs change across the data. To solve this problem we propose a new method called Local Correlation Explanation (CorEx) to capture HOIs at a local scale by first clustering data points based on their proximity on the data manifold. We then use a multivariate version of the mutual information called the total correlation, to construct a latent factor representation of the data within each cluster to learn the local HOIs. We use Local CorEx to explore HOIs in synthetic and real world data to extract hidden insights about the data structure. Lastly, we demonstrate Local CorEx's suitability to explore and interpret the inner workings of trained neural networks. ",
    "url": "https://arxiv.org/abs/2402.04440",
    "authors": [
      "Thomas Kerby",
      "Teresa White",
      "Kevin Moon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.04447",
    "title": "Context-Aware Spectrum Coexistence of Terrestrial Beyond 5G Networks in  Satellite Bands",
    "abstract": "Spectrum sharing between terrestrial 5G and incumbent networks in the satellite bands presents a promising avenue to satisfy the ever-increasing bandwidth demand of the next-generation wireless networks. However, protecting incumbent operations from harmful interference poses a fundamental challenge in accommodating terrestrial broadband cellular networks in the satellite bands. State-of-the-art spectrum-sharing policies usually consider several worst-case assumptions and ignore site-specific contextual factors in making spectrum-sharing decisions, and thus, often results in under-utilization of the shared band for the secondary licensees. To address such limitations, this paper introduces CAT3S (Context-Aware Terrestrial-Satellite Spectrum Sharing) framework that empowers the coexisting terrestrial 5G network to maximize utilization of the shared satellite band without creating harmful interference to the incumbent links by exploiting the contextual factors. CAT3S consists of the following two components: (i) context-acquisition unit to collect and process essential contextual information for spectrum sharing and (ii) context-aware base station (BS) control unit to optimize the set of operational BSs and their operation parameters (i.e., transmit power and active beams per sector). To evaluate the performance of the CAT3S, a realistic spectrum coexistence case study over the 12 GHz band is considered. Experiment results demonstrate that the proposed CAT3S achieves notably higher spectrum utilization than state-of-the-art spectrum-sharing policies in different weather contexts. ",
    "url": "https://arxiv.org/abs/2402.04447",
    "authors": [
      "Ta Seen Reaz Niloy",
      "Zoheb Hasan",
      "Rob Smith",
      "Vikram R. Anapana",
      "Vijay K. Shah"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.04454",
    "title": "Evolving Mobile Cloud Gaming with 5G Standalone Network Telemetry",
    "abstract": "Mobile cloud gaming places the simultaneous demands of high capacity and low latency on the wireless network, demands that Private and Metropolitan-Area Standalone 5G networks are poised to meet. However, lacking introspection into the 5G Radio Access Network (RAN), cloud gaming servers are ill-poised to cope with the vagaries of the wireless last hop to a mobile client, while 5G network operators run mostly closed networks, limiting their potential for co-design with the wider internet and user applications. This paper presents Telesa, a passive, incrementally-deployable, and independently-deployable Standalone 5G network telemetry system that streams fine-grained RAN capacity, latency, and retransmission information to application servers to enable better millisecond scale, application-level decisions on offered load and bit rate adaptation than end-to-end latency measurements or end-to-end packet losses currently permit. We design, implement, and evaluate a Telesa telemetry-enhanced game streaming platform, demonstrating exact congestion-control that can better adapt game video bitrate while simultaneously controlling end-to-end latency, thus maximizing game quality of experience. Our experimental evaluation on a production 5G Standalone network demonstrates a 178-249% Quality of Experience improvement versus two state-of-the-art cloud gaming applications. ",
    "url": "https://arxiv.org/abs/2402.04454",
    "authors": [
      "Haoran Wan",
      "Kyle Jamieson"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2402.04469",
    "title": "IoT Network Traffic Analysis with Deep Learning",
    "abstract": "As IoT networks become more complex and generate massive amounts of dynamic data, it is difficult to monitor and detect anomalies using traditional statistical methods and machine learning methods. Deep learning algorithms can process and learn from large amounts of data and can also be trained using unsupervised learning techniques, meaning they don't require labelled data to detect anomalies. This makes it possible to detect new and unknown anomalies that may not have been detected before. Also, deep learning algorithms can be automated and highly scalable; thereby, they can run continuously in the backend and make it achievable to monitor large IoT networks instantly. In this work, we conduct a literature review on the most recent works using deep learning techniques and implement a model using ensemble techniques on the KDD Cup 99 dataset. The experimental results showcase the impressive performance of our deep anomaly detection model, achieving an accuracy of over 98\\%. ",
    "url": "https://arxiv.org/abs/2402.04469",
    "authors": [
      "Mei Liu",
      "Leon Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2402.04486",
    "title": "Outer Code Designs for Augmented and Local-Global Polar Code  Architectures",
    "abstract": "In this paper, we introduce two novel methods to design outer polar codes for two previously proposed concatenated polar code architectures: augmented polar codes and local-global polar codes. These methods include a stopping set (SS) construction and a nonstationary density evolution (NDE) construction. Simulation results demonstrate the advantage of these methods over previously proposed constructions based on density evolution (DE) and LLR evolution. ",
    "url": "https://arxiv.org/abs/2402.04486",
    "authors": [
      "Ziyuan Zhu",
      "Paul H. Siegel"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2402.04489",
    "title": "De-amplifying Bias from Differential Privacy in Language Model  Fine-tuning",
    "abstract": "Fairness and privacy are two important values machine learning (ML) practitioners often seek to operationalize in models. Fairness aims to reduce model bias for social/demographic sub-groups. Privacy via differential privacy (DP) mechanisms, on the other hand, limits the impact of any individual's training data on the resulting model. The trade-offs between privacy and fairness goals of trustworthy ML pose a challenge to those wishing to address both. We show that DP amplifies gender, racial, and religious bias when fine-tuning large language models (LLMs), producing models more biased than ones fine-tuned without DP. We find the cause of the amplification to be a disparity in convergence of gradients across sub-groups. Through the case of binary gender bias, we demonstrate that Counterfactual Data Augmentation (CDA), a known method for addressing bias, also mitigates bias amplification by DP. As a consequence, DP and CDA together can be used to fine-tune models while maintaining both fairness and privacy. ",
    "url": "https://arxiv.org/abs/2402.04489",
    "authors": [
      "Sanjari Srivastava",
      "Piotr Mardziel",
      "Zhikhun Zhang",
      "Archana Ahlawat",
      "Anupam Datta",
      "John C Mitchell"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2402.04515",
    "title": "A Deep Reinforcement Learning Approach for Adaptive Traffic Routing in  Next-gen Networks",
    "abstract": "Next-gen networks require significant evolution of management to enable automation and adaptively adjust network configuration based on traffic dynamics. The advent of software-defined networking (SDN) and programmable switches enables flexibility and programmability. However, traditional techniques that decide traffic policies are usually based on hand-crafted programming optimization and heuristic algorithms. These techniques make non-realistic assumptions, e.g., considering static network load and topology, to obtain tractable solutions, which are inadequate for next-gen networks. In this paper, we design and develop a deep reinforcement learning (DRL) approach for adaptive traffic routing. We design a deep graph convolutional neural network (DGCNN) integrated into the DRL framework to learn the traffic behavior from not only the network topology but also link and node attributes. We adopt the Deep Q-Learning technique to train the DGCNN model in the DRL framework without the need for a labeled training dataset, enabling the framework to quickly adapt to traffic dynamics. The model leverages q-value estimates to select the routing path for every traffic flow request, balancing exploration and exploitation. We perform extensive experiments with various traffic patterns and compare the performance of the proposed approach with the Open Shortest Path First (OSPF) protocol. The experimental results show the effectiveness and adaptiveness of the proposed framework by increasing the network throughput by up to 7.8% and reducing the traffic delay by up to 16.1% compared to OSPF. ",
    "url": "https://arxiv.org/abs/2402.04515",
    "authors": [
      "Akshita Abrol",
      "Purnima Murali Mohan",
      "Tram Truong-Huu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.04519",
    "title": "BioDrone: A Bionic Drone-based Single Object Tracking Benchmark for  Robust Vision",
    "abstract": "Single object tracking (SOT) is a fundamental problem in computer vision, with a wide range of applications, including autonomous driving, augmented reality, and robot navigation. The robustness of SOT faces two main challenges: tiny target and fast motion. These challenges are especially manifested in videos captured by unmanned aerial vehicles (UAV), where the target is usually far away from the camera and often with significant motion relative to the camera. To evaluate the robustness of SOT methods, we propose BioDrone -- the first bionic drone-based visual benchmark for SOT. Unlike existing UAV datasets, BioDrone features videos captured from a flapping-wing UAV system with a major camera shake due to its aerodynamics. BioDrone hence highlights the tracking of tiny targets with drastic changes between consecutive frames, providing a new robust vision benchmark for SOT. To date, BioDrone offers the largest UAV-based SOT benchmark with high-quality fine-grained manual annotations and automatically generates frame-level labels, designed for robust vision analyses. Leveraging our proposed BioDrone, we conduct a systematic evaluation of existing SOT methods, comparing the performance of 20 representative models and studying novel means of optimizing a SOTA method (KeepTrack KeepTrack) for robust SOT. Our evaluation leads to new baselines and insights for robust SOT. Moving forward, we hope that BioDrone will not only serve as a high-quality benchmark for robust SOT, but also invite future research into robust computer vision. The database, toolkits, evaluation server, and baseline results are available at this http URL ",
    "url": "https://arxiv.org/abs/2402.04519",
    "authors": [
      "Xin Zhao",
      "Shiyu Hu",
      "Yipei Wang",
      "Jing Zhang",
      "Yimin Hu",
      "Rongshuai Liu",
      "Haibin Ling",
      "Yin Li",
      "Renshu Li",
      "Kun Liu",
      "Jiadong Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04527",
    "title": "RA-Rec: An Efficient ID Representation Alignment Framework for LLM-based  Recommendation",
    "abstract": "Large language models (LLM) have recently emerged as a powerful tool for a variety of natural language processing tasks, bringing a new surge of combining LLM with recommendation systems, termed as LLM-based RS. Current approaches generally fall into two main paradigms, the ID direct usage paradigm and the ID translation paradigm, noting their core weakness stems from lacking recommendation knowledge and uniqueness. To address this limitation, we propose a new paradigm, ID representation, which incorporates pre-trained ID embeddings into LLMs in a complementary manner. In this work, we present RA-Rec, an efficient ID representation alignment framework for LLM-based recommendation, which is compatible with multiple ID-based methods and LLM architectures. Specifically, we treat ID embeddings as soft prompts and design an innovative alignment module and an efficient tuning method with tailored data construction for alignment. Extensive experiments demonstrate RA-Rec substantially outperforms current state-of-the-art methods, achieving up to 3.0% absolute HitRate@100 improvements while utilizing less than 10x training data. ",
    "url": "https://arxiv.org/abs/2402.04527",
    "authors": [
      "Xiaohan Yu",
      "Li Zhang",
      "Xin Zhao",
      "Yue Wang",
      "Zhongrui Ma"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.04534",
    "title": "M2fNet: Multi-modal Forest Monitoring Network on Large-scale Virtual  Dataset",
    "abstract": "Forest monitoring and education are key to forest protection, education and management, which is an effective way to measure the progress of a country's forest and climate commitments. Due to the lack of a large-scale wild forest monitoring benchmark, the common practice is to train the model on a common outdoor benchmark (e.g., KITTI) and evaluate it on real forest datasets (e.g., CanaTree100). However, there is a large domain gap in this setting, which makes the evaluation and deployment difficult. In this paper, we propose a new photorealistic virtual forest dataset and a multimodal transformer-based algorithm for tree detection and instance segmentation. To the best of our knowledge, it is the first time that a multimodal detection and segmentation algorithm is applied to large-scale forest scenes. We believe that the proposed dataset and method will inspire the simulation, computer vision, education, and forestry communities towards a more comprehensive multi-modal understanding. ",
    "url": "https://arxiv.org/abs/2402.04534",
    "authors": [
      "Yawen Lu",
      "Yunhan Huang",
      "Su Sun",
      "Tansi Zhang",
      "Xuewen Zhang",
      "Songlin Fei",
      "Victor Chen"
    ],
    "subjectives": [
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2402.04538",
    "title": "Triplet Interaction Improves Graph Transformers: Accurate Molecular  Graph Learning with Triplet Graph Transformers",
    "abstract": "Graph transformers typically lack direct pair-to-pair communication, instead forcing neighboring pairs to exchange information via a common node. We propose the Triplet Graph Transformer (TGT) that enables direct communication between two neighboring pairs in a graph via novel triplet attention and aggregation mechanisms. TGT is applied to molecular property prediction by first predicting interatomic distances from 2D graphs and then using these distances for downstream tasks. A novel three-stage training procedure and stochastic inference further improve training efficiency and model performance. Our model achieves new state-of-the-art (SOTA) results on open challenge benchmarks PCQM4Mv2 and OC20 IS2RE. We also obtain SOTA results on QM9, MOLPCBA, and LIT-PCBA molecular property prediction benchmarks via transfer learning. We also demonstrate the generality of TGT with SOTA results on the traveling salesman problem (TSP). ",
    "url": "https://arxiv.org/abs/2402.04538",
    "authors": [
      "Md Shamim Hussain",
      "Mohammed J. Zaki",
      "Dharmashankar Subramanian"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04542",
    "title": "Share What You Already Know: Cross-Language-Script Transfer and  Alignment for Sentiment Detection in Code-Mixed Data",
    "abstract": "Code-switching entails mixing multiple languages. It is an increasingly occurring phenomenon in social media texts. Usually, code-mixed texts are written in a single script, even though the languages involved have different scripts. Pre-trained multilingual models primarily utilize the data in the native script of the language. In existing studies, the code-switched texts are utilized as they are. However, using the native script for each language can generate better representations of the text owing to the pre-trained knowledge. Therefore, a cross-language-script knowledge sharing architecture utilizing the cross attention and alignment of the representations of text in individual language scripts was proposed in this study. Experimental results on two different datasets containing Nepali-English and Hindi-English code-switched texts, demonstrate the effectiveness of the proposed method. The interpretation of the model using model explainability technique illustrates the sharing of language-specific knowledge between language-specific representations. ",
    "url": "https://arxiv.org/abs/2402.04542",
    "authors": [
      "Niraj Pahari",
      "Kazutaka Shimada"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.04554",
    "title": "BirdNeRF: Fast Neural Reconstruction of Large-Scale Scenes From Aerial  Imagery",
    "abstract": "In this study, we introduce BirdNeRF, an adaptation of Neural Radiance Fields (NeRF) designed specifically for reconstructing large-scale scenes using aerial imagery. Unlike previous research focused on small-scale and object-centric NeRF reconstruction, our approach addresses multiple challenges, including (1) Addressing the issue of slow training and rendering associated with large models. (2) Meeting the computational demands necessitated by modeling a substantial number of images, requiring extensive resources such as high-performance GPUs. (3) Overcoming significant artifacts and low visual fidelity commonly observed in large-scale reconstruction tasks due to limited model capacity. Specifically, we present a novel bird-view pose-based spatial decomposition algorithm that decomposes a large aerial image set into multiple small sets with appropriately sized overlaps, allowing us to train individual NeRFs of sub-scene. This decomposition approach not only decouples rendering time from the scene size but also enables rendering to scale seamlessly to arbitrarily large environments. Moreover, it allows for per-block updates of the environment, enhancing the flexibility and adaptability of the reconstruction process. Additionally, we propose a projection-guided novel view re-rendering strategy, which aids in effectively utilizing the independently trained sub-scenes to generate superior rendering results. We evaluate our approach on existing datasets as well as against our own drone footage, improving reconstruction speed by 10x over classical photogrammetry software and 50x over state-of-the-art large-scale NeRF solution, on a single GPU with similar rendering quality. ",
    "url": "https://arxiv.org/abs/2402.04554",
    "authors": [
      "Huiqing Zhang",
      "Yifei Xue",
      "Ming Liao",
      "Yizhen Lao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04567",
    "title": "OIL-AD: An Anomaly Detection Framework for Sequential Decision Sequences",
    "abstract": "Anomaly detection in decision-making sequences is a challenging problem due to the complexity of normality representation learning and the sequential nature of the task. Most existing methods based on Reinforcement Learning (RL) are difficult to implement in the real world due to unrealistic assumptions, such as having access to environment dynamics, reward signals, and online interactions with the environment. To address these limitations, we propose an unsupervised method named Offline Imitation Learning based Anomaly Detection (OIL-AD), which detects anomalies in decision-making sequences using two extracted behaviour features: action optimality and sequential association. Our offline learning model is an adaptation of behavioural cloning with a transformer policy network, where we modify the training process to learn a Q function and a state value function from normal trajectories. We propose that the Q function and the state value function can provide sufficient information about agents' behavioural data, from which we derive two features for anomaly detection. The intuition behind our method is that the action optimality feature derived from the Q function can differentiate the optimal action from others at each local state, and the sequential association feature derived from the state value function has the potential to maintain the temporal correlations between decisions (state-action pairs). Our experiments show that OIL-AD can achieve outstanding online anomaly detection performance with up to 34.8% improvement in F1 score over comparable baselines. ",
    "url": "https://arxiv.org/abs/2402.04567",
    "authors": [
      "Chen Wang",
      "Sarah Erfani",
      "Tansu Alpcan",
      "Christopher Leckie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.04575",
    "title": "Can We Identify Stack Overflow Questions Requiring Code Snippets?  Investigating the Cause & Effect of Missing Code Snippets",
    "abstract": "On the Stack Overflow (SO) Q&A site, users often request solutions to their code-related problems (e.g., errors, unexpected behavior). Unfortunately, they often miss required code snippets during their question submission, which could prevent their questions from getting prompt and appropriate answers. In this study, we conduct an empirical study investigating the cause & effect of missing code snippets in SO questions whenever required. Here, our contributions are threefold. First, we analyze how the presence or absence of required code snippets affects the correlation between question types (missed code, included code after requests & had code snippets during submission) and corresponding answer meta-data (e.g., presence of an accepted answer). According to our analysis, the chance of getting accepted answers is three times higher for questions that include required code snippets during their question submission than those that missed the code. We also investigate whether the confounding factors (e.g., user reputation) affect questions receiving answers besides the presence or absence of required code snippets. We found that such factors do not hurt the correlation between the presence or absence of required code snippets and answer meta-data. Second, we surveyed 64 practitioners to understand why users miss necessary code snippets. About 60% of them agree that users are unaware of whether their questions require any code snippets. Third, we thus extract four text-based features (e.g., keywords) and build six ML models to identify the questions that need code snippets. Our models can predict the target questions with 86.5% precision, 90.8% recall, 85.3% F1-score, and 85.2% overall accuracy. Our work has the potential to save significant time in programming question-answering and improve the quality of the valuable knowledge base by decreasing unanswered and unresolved questions. ",
    "url": "https://arxiv.org/abs/2402.04575",
    "authors": [
      "Saikat Mondal",
      "Mohammad Masudur Rahman",
      "Chanchal K. Roy"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2402.04594",
    "title": "Ransomware Detection Dynamics: Insights and Implications",
    "abstract": "The rise of ransomware attacks has necessitated the development of effective strategies for identifying and mitigating these threats. This research investigates the utilization of a feature selection algorithm for distinguishing ransomware-related and benign transactions in both Bitcoin (BTC) and United States Dollar (USD). Leveraging the UGRansome dataset, a comprehensive repository of ransomware related BTC and USD transactions, we propose a set of novel features designed to capture the distinct characteristics of ransomware activity within the cryptocurrency ecosystem. These features encompass transaction metadata, ransom analysis, and behavioral patterns, offering a multifaceted view of ransomware-related financial transactions. Through rigorous experimentation and evaluation, we demonstrate the effectiveness of our feature set in accurately extracting BTC and USD transactions, thereby aiding in the early detection and prevention of ransomware-related financial flows. We introduce a Ransomware Feature Selection Algorithm (RFSA) based on Gini Impurity and Mutual Information (MI) for selecting crucial ransomware features from the UGRansome dataset. Insights from the visualization highlight the potential of Gini Impurity and MI-based feature selection to enhance ransomware detection systems by effectively discriminating between ransomware classes. The analysis reveals that approximately 68% of ransomware incidents involve BTC transactions within the range of 1.46 to 2.56, with an average of 2.01 BTC transactions per attack. The findings emphasize the dynamic and adaptable nature of ransomware demands, suggesting that there is no fixed amount for specific cyberattacks, highlighting the evolving landscape of ransomware threats. ",
    "url": "https://arxiv.org/abs/2402.04594",
    "authors": [
      "Mike Nkongolo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2402.04596",
    "title": "Towards Improved Imbalance Robustness in Continual Multi-Label Learning  with Dual Output Spiking Architecture (DOSA)",
    "abstract": "Algorithms designed for addressing typical supervised classification problems can only learn from a fixed set of samples and labels, making them unsuitable for the real world, where data arrives as a stream of samples often associated with multiple labels over time. This motivates the study of task-agnostic continual multi-label learning problems. While algorithms using deep learning approaches for continual multi-label learning have been proposed in the recent literature, they tend to be computationally heavy. Although spiking neural networks (SNNs) offer a computationally efficient alternative to artificial neural networks, existing literature has not used SNNs for continual multi-label learning. Also, accurately determining multiple labels with SNNs is still an open research problem. This work proposes a dual output spiking architecture (DOSA) to bridge these research gaps. A novel imbalance-aware loss function is also proposed, improving the multi-label classification performance of the model by making it more robust to data imbalance. A modified F1 score is presented to evaluate the effectiveness of the proposed loss function in handling imbalance. Experiments on several benchmark multi-label datasets show that DOSA trained with the proposed loss function shows improved robustness to data imbalance and obtains better continual multi-label learning performance than CIFDM, a previous state-of-the-art algorithm. ",
    "url": "https://arxiv.org/abs/2402.04596",
    "authors": [
      "Sourav Mishra",
      "Shirin Dora",
      "Suresh Sundaram"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04610",
    "title": "Early Stopping of Untrained Convolutional Neural Networks",
    "abstract": "In recent years, new regularization methods based on (deep) neural networks have shown very promising empirical performance for the numerical solution of ill-posed problems, such as in medical imaging and imaging science. Due to the nonlinearity of neural networks, these methods often lack satisfactory theoretical justification. In this work, we rigorously discuss the convergence of a successful unsupervised approach that utilizes untrained convolutional neural networks to represent solutions to linear ill-posed problems. Untrained neural networks have particular appeal for many applications because they do not require paired training data. The regularization property of the approach relies solely on the architecture of the neural network instead. Due to the vast over-parameterization of the employed neural network, suitable early stopping is essential for the success of the method. We establish that the classical discrepancy principle is an adequate method for early stopping of two-layer untrained convolutional neural networks learned by gradient descent, and furthermore, it yields an approximation with minimax optimal convergence rates. Numerical results are also presented to illustrate the theoretical findings. ",
    "url": "https://arxiv.org/abs/2402.04610",
    "authors": [
      "Tim Jahn",
      "Bangti Jin"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2402.04621",
    "title": "Feature Distribution on Graph Topology Mediates the Effect of Graph  Convolution: Homophily Perspective",
    "abstract": "How would randomly shuffling feature vectors among nodes from the same class affect graph neural networks (GNNs)? The feature shuffle, intuitively, perturbs the dependence between graph topology and features (A-X dependence) for GNNs to learn from. Surprisingly, we observe a consistent and significant improvement in GNN performance following the feature shuffle. Having overlooked the impact of A-X dependence on GNNs, the prior literature does not provide a satisfactory understanding of the phenomenon. Thus, we raise two research questions. First, how should A-X dependence be measured, while controlling for potential confounds? Second, how does A-X dependence affect GNNs? In response, we (i) propose a principled measure for A-X dependence, (ii) design a random graph model that controls A-X dependence, (iii) establish a theory on how A-X dependence relates to graph convolution, and (iv) present empirical analysis on real-world graphs that aligns with the theory. We conclude that A-X dependence mediates the effect of graph convolution, such that smaller dependence improves GNN-based node classification. ",
    "url": "https://arxiv.org/abs/2402.04621",
    "authors": [
      "Soo Yong Lee",
      "Sunwoo Kim",
      "Fanchen Bu",
      "Jaemin Yoo",
      "Jiliang Tang",
      "Kijung Shin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04627",
    "title": "SPARQL Generation: an analysis on fine-tuning OpenLLaMA for Question  Answering over a Life Science Knowledge Graph",
    "abstract": "The recent success of Large Language Models (LLM) in a wide range of Natural Language Processing applications opens the path towards novel Question Answering Systems over Knowledge Graphs leveraging LLMs. However, one of the main obstacles preventing their implementation is the scarcity of training data for the task of translating questions into corresponding SPARQL queries, particularly in the case of domain-specific KGs. To overcome this challenge, in this study, we evaluate several strategies for fine-tuning the OpenLlama LLM for question answering over life science knowledge graphs. In particular, we propose an end-to-end data augmentation approach for extending a set of existing queries over a given knowledge graph towards a larger dataset of semantically enriched question-to-SPARQL query pairs, enabling fine-tuning even for datasets where these pairs are scarce. In this context, we also investigate the role of semantic \"clues\" in the queries, such as meaningful variable names and inline comments. Finally, we evaluate our approach over the real-world Bgee gene expression knowledge graph and we show that semantic clues can improve model performance by up to 33% compared to a baseline with random variable names and no comments included. ",
    "url": "https://arxiv.org/abs/2402.04627",
    "authors": [
      "Julio C. Rangel",
      "Tarcisio Mendes de Farias",
      "Ana Claudia Sima",
      "Norio Kobayashi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Databases (cs.DB)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2402.04630",
    "title": "LLMs Meet VLMs: Boost Open Vocabulary Object Detection with Fine-grained  Descriptors",
    "abstract": "Inspired by the outstanding zero-shot capability of vision language models (VLMs) in image classification tasks, open-vocabulary object detection has attracted increasing interest by distilling the broad VLM knowledge into detector training. However, most existing open-vocabulary detectors learn by aligning region embeddings with categorical labels (e.g., bicycle) only, disregarding the capability of VLMs on aligning visual embeddings with fine-grained text description of object parts (e.g., pedals and bells). This paper presents DVDet, a Descriptor-Enhanced Open Vocabulary Detector that introduces conditional context prompts and hierarchical textual descriptors that enable precise region-text alignment as well as open-vocabulary detection training in general. Specifically, the conditional context prompt transforms regional embeddings into image-like representations that can be directly integrated into general open vocabulary detection training. In addition, we introduce large language models as an interactive and implicit knowledge repository which enables iterative mining and refining visually oriented textual descriptors for precise region-text alignment. Extensive experiments over multiple large-scale benchmarks show that DVDet outperforms the state-of-the-art consistently by large margins. ",
    "url": "https://arxiv.org/abs/2402.04630",
    "authors": [
      "Sheng Jin",
      "Xueying Jiang",
      "Jiaxing Huang",
      "Lewei Lu",
      "Shijian Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04632",
    "title": "GSN: Generalisable Segmentation in Neural Radiance Field",
    "abstract": "Traditional Radiance Field (RF) representations capture details of a specific scene and must be trained afresh on each scene. Semantic feature fields have been added to RFs to facilitate several segmentation tasks. Generalised RF representations learn the principles of view interpolation. A generalised RF can render new views of an unknown and untrained scene, given a few views. We present a way to distil feature fields into the generalised GNT representation. Our GSN representation generates new views of unseen scenes on the fly along with consistent, per-pixel semantic features. This enables multi-view segmentation of arbitrary new scenes. We show different semantic features being distilled into generalised RFs. Our multi-view segmentation results are on par with methods that use traditional RFs. GSN closes the gap between standard and generalisable RF methods significantly. Project Page: https://vinayak-vg.github.io/GSN/ ",
    "url": "https://arxiv.org/abs/2402.04632",
    "authors": [
      "Vinayak Gupta",
      "Rahul Goel",
      "Sirikonda Dhawal",
      "P. J. Narayanan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2402.04648",
    "title": "OV-NeRF: Open-vocabulary Neural Radiance Fields with Vision and Language  Foundation Models for 3D Semantic Understanding",
    "abstract": "The development of Neural Radiance Fields (NeRFs) has provided a potent representation for encapsulating the geometric and appearance characteristics of 3D scenes. Enhancing the capabilities of NeRFs in open-vocabulary 3D semantic perception tasks has been a recent focus. However, current methods that extract semantics directly from Contrastive Language-Image Pretraining (CLIP) for semantic field learning encounter difficulties due to noisy and view-inconsistent semantics provided by CLIP. To tackle these limitations, we propose OV-NeRF, which exploits the potential of pre-trained vision and language foundation models to enhance semantic field learning through proposed single-view and cross-view strategies. First, from the single-view perspective, we introduce Region Semantic Ranking (RSR) regularization by leveraging 2D mask proposals derived from SAM to rectify the noisy semantics of each training view, facilitating accurate semantic field learning. Second, from the cross-view perspective, we propose a Cross-view Self-enhancement (CSE) strategy to address the challenge raised by view-inconsistent semantics. Rather than invariably utilizing the 2D inconsistent semantics from CLIP, CSE leverages the 3D consistent semantics generated from the well-trained semantic field itself for semantic field training, aiming to reduce ambiguity and enhance overall semantic consistency across different views. Extensive experiments validate our OV-NeRF outperforms current state-of-the-art methods, achieving a significant improvement of 20.31% and 18.42% in mIoU metric on Replica and Scannet, respectively. Furthermore, our approach exhibits consistent superior results across various CLIP configurations, further verifying its robustness. ",
    "url": "https://arxiv.org/abs/2402.04648",
    "authors": [
      "Guibiao Liao",
      "Kaichen Zhou",
      "Zhenyu Bao",
      "Kanglin Liu",
      "Qing Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04660",
    "title": "Adversarial Robustness Through Artifact Design",
    "abstract": "Adversarial examples arose as a challenge for machine learning. To hinder them, most defenses alter how models are trained (e.g., adversarial training) or inference is made (e.g., randomized smoothing). Still, while these approaches markedly improve models' adversarial robustness, models remain highly susceptible to adversarial examples. Identifying that, in certain domains such as traffic-sign recognition, objects are implemented per standards specifying how artifacts (e.g., signs) should be designed, we propose a novel approach for improving adversarial robustness. Specifically, we offer a method to redefine standards, making minor changes to existing ones, to defend against adversarial examples. We formulate the problem of artifact design as a robust optimization problem, and propose gradient-based and greedy search methods to solve it. We evaluated our approach in the domain of traffic-sign recognition, allowing it to alter traffic-sign pictograms (i.e., symbols within the signs) and their colors. We found that, combined with adversarial training, our approach led to up to 25.18\\% higher robust accuracy compared to state-of-the-art methods against two adversary types, while further increasing accuracy on benign inputs. ",
    "url": "https://arxiv.org/abs/2402.04660",
    "authors": [
      "Tsufit Shua",
      "Mahmood Sharif"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04663",
    "title": "CLIF: Complementary Leaky Integrate-and-Fire Neuron for Spiking Neural  Networks",
    "abstract": "Spiking neural networks (SNNs) are promising brain-inspired energy-efficient models. Compared to conventional deep Artificial Neural Networks (ANNs), SNNs exhibit superior efficiency and capability to process temporal information. However, it remains a challenge to train SNNs due to their undifferentiable spiking mechanism. The surrogate gradients method is commonly used to train SNNs, but often comes with an accuracy disadvantage over ANNs counterpart. We link the degraded accuracy to the vanishing of gradient on the temporal dimension through the analytical and experimental study of the training process of Leaky Integrate-and-Fire (LIF) Neuron-based SNNs. Moreover, we propose the Complementary Leaky Integrate-and-Fire (CLIF) Neuron. CLIF creates extra paths to facilitate the backpropagation in computing temporal gradient while keeping binary output. CLIF is hyperparameter-free and features broad applicability. Extensive experiments on a variety of datasets demonstrate CLIF's clear performance advantage over other neuron models. Moreover, the CLIF's performance even slightly surpasses superior ANNs with identical network structure and training conditions. ",
    "url": "https://arxiv.org/abs/2402.04663",
    "authors": [
      "Yulong Huang",
      "Xiaopeng Lin",
      "Hongwei Ren",
      "Yue Zhou",
      "Zunchang Liu",
      "Haotian Fu",
      "Biao Pan",
      "Bojun Cheng"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2402.04672",
    "title": "G-NAS: Generalizable Neural Architecture Search for Single Domain  Generalization Object Detection",
    "abstract": "In this paper, we focus on a realistic yet challenging task, Single Domain Generalization Object Detection (S-DGOD), where only one source domain's data can be used for training object detectors, but have to generalize multiple distinct target domains. In S-DGOD, both high-capacity fitting and generalization abilities are needed due to the task's complexity. Differentiable Neural Architecture Search (NAS) is known for its high capacity for complex data fitting and we propose to leverage Differentiable NAS to solve S-DGOD. However, it may confront severe over-fitting issues due to the feature imbalance phenomenon, where parameters optimized by gradient descent are biased to learn from the easy-to-learn features, which are usually non-causal and spuriously correlated to ground truth labels, such as the features of background in object detection data. Consequently, this leads to serious performance degradation, especially in generalizing to unseen target domains with huge domain gaps between the source domain and target domains. To address this issue, we propose the Generalizable loss (G-loss), which is an OoD-aware objective, preventing NAS from over-fitting by using gradient descent to optimize parameters not only on a subset of easy-to-learn features but also the remaining predictive features for generalization, and the overall framework is named G-NAS. Experimental results on the S-DGOD urban-scene datasets demonstrate that the proposed G-NAS achieves SOTA performance compared to baseline methods. Codes are available at https://github.com/wufan-cse/G-NAS. ",
    "url": "https://arxiv.org/abs/2402.04672",
    "authors": [
      "Fan Wu",
      "Jinling Gao",
      "Lanqing Hong",
      "Xinbing Wang",
      "Chenghu Zhou",
      "Nanyang Ye"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04676",
    "title": "Group Distributionally Robust Dataset Distillation with Risk  Minimization",
    "abstract": "Dataset distillation (DD) has emerged as a widely adopted technique for crafting a synthetic dataset that captures the essential information of a training dataset, facilitating the training of accurate neural models. Its applications span various domains, including transfer learning, federated learning, and neural architecture search. The most popular methods for constructing the synthetic data rely on matching the convergence properties of training the model with the synthetic dataset and the training dataset. However, targeting the training dataset must be thought of as auxiliary in the same sense that the training set is an approximate substitute for the population distribution, and the latter is the data of interest. Yet despite its popularity, an aspect that remains unexplored is the relationship of DD to its generalization, particularly across uncommon subgroups. That is, how can we ensure that a model trained on the synthetic dataset performs well when faced with samples from regions with low population density? Here, the representativeness and coverage of the dataset become salient over the guaranteed training error at inference. Drawing inspiration from distributionally robust optimization, we introduce an algorithm that combines clustering with the minimization of a risk measure on the loss to conduct DD. We provide a theoretical rationale for our approach and demonstrate its effective generalization and robustness across subgroups through numerical experiments. ",
    "url": "https://arxiv.org/abs/2402.04676",
    "authors": [
      "Saeed Vahidian",
      "Mingyu Wang",
      "Jianyang Gu",
      "Vyacheslav Kungurtsev",
      "Wei Jiang",
      "Yiran Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04699",
    "title": "EvoSeed: Unveiling the Threat on Deep Neural Networks with Real-World  Illusions",
    "abstract": "Deep neural networks are exploited using natural adversarial samples, which have no impact on human perception but are misclassified. Current approaches often rely on the white-box nature of deep neural networks to generate these adversarial samples or alter the distribution of adversarial samples compared to training distribution. To alleviate the limitations of current approaches, we propose EvoSeed, a novel evolutionary strategy-based search algorithmic framework to generate natural adversarial samples. Our EvoSeed framework uses auxiliary Diffusion and Classifier models to operate in a model-agnostic black-box setting. We employ CMA-ES to optimize the search for an adversarial seed vector, which, when processed by the Conditional Diffusion Model, results in an unrestricted natural adversarial sample misclassified by the Classifier Model. Experiments show that generated adversarial images are of high image quality and are transferable to different classifiers. Our approach demonstrates promise in enhancing the quality of adversarial samples using evolutionary algorithms. We hope our research opens new avenues to enhance the robustness of deep neural networks in real-world scenarios. Project Website can be accessed at \\url{https://shashankkotyan.github.io/EvoSeed}. ",
    "url": "https://arxiv.org/abs/2402.04699",
    "authors": [
      "Shashank Kotyan",
      "PoYuan Mao",
      "Danilo Vasconcellos Vargas"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2402.04710",
    "title": "Incorporating Retrieval-based Causal Learning with Information  Bottlenecks for Interpretable Graph Neural Networks",
    "abstract": "Graph Neural Networks (GNNs) have gained considerable traction for their capability to effectively process topological data, yet their interpretability remains a critical concern. Current interpretation methods are dominated by post-hoc explanations to provide a transparent and intuitive understanding of GNNs. However, they have limited performance in interpreting complicated subgraphs and can't utilize the explanation to advance GNN predictions. On the other hand, transparent GNN models are proposed to capture critical subgraphs. While such methods could improve GNN predictions, they usually don't perform well on explanations. Thus, it is desired for a new strategy to better couple GNN explanation and prediction. In this study, we have developed a novel interpretable causal GNN framework that incorporates retrieval-based causal learning with Graph Information Bottleneck (GIB) theory. The framework could semi-parametrically retrieve crucial subgraphs detected by GIB and compress the explanatory subgraphs via a causal module. The framework was demonstrated to consistently outperform state-of-the-art methods, and to achieve 32.71\\% higher precision on real-world explanation scenarios with diverse explanation types. More importantly, the learned explanations were shown able to also improve GNN prediction performance. ",
    "url": "https://arxiv.org/abs/2402.04710",
    "authors": [
      "Jiahua Rao",
      "Jiancong Xie",
      "Hanjing Lin",
      "Shuangjia Zheng",
      "Zhen Wang",
      "Yuedong Yang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04717",
    "title": "InstructScene: Instruction-Driven 3D Indoor Scene Synthesis with  Semantic Graph Prior",
    "abstract": "Comprehending natural language instructions is a charming property for 3D indoor scene synthesis systems. Existing methods directly model object joint distributions and express object relations implicitly within a scene, thereby hindering the controllability of generation. We introduce InstructScene, a novel generative framework that integrates a semantic graph prior and a layout decoder to improve controllability and fidelity for 3D scene synthesis. The proposed semantic graph prior jointly learns scene appearances and layout distributions, exhibiting versatility across various downstream tasks in a zero-shot manner. To facilitate the benchmarking for text-driven 3D scene synthesis, we curate a high-quality dataset of scene-instruction pairs with large language and multimodal models. Extensive experimental results reveal that the proposed method surpasses existing state-of-the-art approaches by a large margin. Thorough ablation studies confirm the efficacy of crucial design components. Project page: https://chenguolin.github.io/projects/InstructScene. ",
    "url": "https://arxiv.org/abs/2402.04717",
    "authors": [
      "Chenguo Lin",
      "Yadong Mu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04720",
    "title": "Investigating Driving Interactions: A Robust Multi-Agent Simulation  Framework for Autonomous Vehicles",
    "abstract": "Current validation methods often rely on recorded data and basic functional checks, which may not be sufficient to encompass the scenarios an autonomous vehicle might encounter. In addition, there is a growing need for complex scenarios with changing vehicle interactions for comprehensive validation. This work introduces a novel synchronous multi-agent simulation framework for autonomous vehicles in interactive scenarios. Our approach creates an interactive scenario and incorporates publicly available edge-case scenarios wherein simulated vehicles are replaced by agents navigating to predefined destinations. We provide a platform that enables the integration of different autonomous driving planning methodologies and includes a set of evaluation metrics to assess autonomous driving behavior. Our study explores different planning setups and adjusts simulation complexity to test the framework's adaptability and performance. Results highlight the critical role of simulating vehicle interactions to enhance autonomous driving systems. Our setup offers unique insights for developing advanced algorithms for complex driving tasks to accelerate future investigations and developments in this field. The multi-agent simulation framework is available as open-source software: https://github.com/TUM-AVS/Frenetix-Motion-Planner ",
    "url": "https://arxiv.org/abs/2402.04720",
    "authors": [
      "Marc Kaufeld",
      "Rainer Trauth",
      "Johannes Betz"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2402.04728",
    "title": "Detection Schemes with Low-Resolution ADCs and Spatial Oversampling for  Transmission with Higher-Order Constellations in the Terahertz Band",
    "abstract": "In this work, we consider Terahertz (THz) communications with low-resolution uniform quantization and spatial oversampling at the receiver side. We compare different analog-to-digital converter (ADC) parametrizations in a fair manner by keeping the ADC power consumption constant. Here, 1-, 2-, and 3-bit quantization is investigated with different oversampling factors. We analytically compute the statistics of the detection variable, and we propose the optimal as well as several suboptimal detection schemes for arbitrary quantization resolutions. Then, we evaluate the symbol error rate (SER) of the different detectors for a 16- and a 64-ary quadrature amplitude modulation (QAM) constellation. The results indicate that there is a noticeable performance degradation of the suboptimal detection schemes compared to the optimal scheme when the constellation size is larger than the number of quantization levels. Furthermore, at low signal-to-noise ratios (SNRs), 1-bit quantization outperforms 2- and 3-bit quantization, respectively, even when employing higher-order constellations. We confirm our analytical results by Monte Carlo simulations. Both a pure line-of-sight (LoS) and a more realistically modeled indoor THz channel are considered. Then, we optimize the input signal constellation with respect to SER for 1-bit quantization. The results show that the minimum SER can be lowered significantly for 16-QAM by increasing the distance between the inner and outer points of the input constellation. For larger constellations, however, the achievable reduction of the minimum SER is much smaller compared to 16-QAM. ",
    "url": "https://arxiv.org/abs/2402.04728",
    "authors": [
      "Christian Forsch",
      "Peter Zillmann",
      "Osama Alrabadi",
      "Stefan Brueck",
      "Wolfgang Gerstacker"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.04732",
    "title": "Graph Cuts with Arbitrary Size Constraints Through Optimal Transport",
    "abstract": "A common way of partitioning graphs is through minimum cuts. One drawback of classical minimum cut methods is that they tend to produce small groups, which is why more balanced variants such as normalized and ratio cuts have seen more success. However, we believe that with these variants, the balance constraints can be too restrictive for some applications like for clustering of imbalanced datasets, while not being restrictive enough for when searching for perfectly balanced partitions. Here, we propose a new graph cut algorithm for partitioning graphs under arbitrary size constraints. We formulate the graph cut problem as a regularized Gromov-Wasserstein problem. We then propose to solve it using accelerated proximal GD algorithm which has global convergence guarantees, results in sparse solutions and only incurs an additional ratio of $\\mathcal{O}(\\log(n))$ compared to the classical spectral clustering algorithm but was seen to be more efficient. ",
    "url": "https://arxiv.org/abs/2402.04732",
    "authors": [
      "Chakib Fettal",
      "Lazhar Labiod",
      "Mohamed Nadif"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04735",
    "title": "Review of Cetacean's click detection algorithms",
    "abstract": "The detection of echolocation clicks is key in understanding the intricate behaviors of cetaceans and monitoring their populations. Cetacean species relying on clicks for navigation, foraging and even communications are sperm whales (Physeter macrocephalus) and a variety of dolphin groups. Echolocation clicks are wideband signals of short duration that are often emitted in sequences of varying inter-click-intervals. While datasets and models for clicks exist, the detection and classification of clicks present a significant challenge, mostly due to the diversity of clicks' structures, overlapping signals from simultaneously emitting animals, and the abundance of noise transients from, for example, snapping shrimps and shipping cavitation noise. This paper provides a survey of the many detection and classification methodologies of clicks, ranging from 2002 to 2023. We divide the surveyed techniques into categories by their methodology. Specifically, feature analysis (e.g., phase, ICI and duration), frequency content, energy based detection, supervised and unsupervised machine learning, template matching and adaptive detection approaches. Also surveyed are open access platforms for click detections, and databases openly available for testing. Details of the method applied for each paper are given along with advantages and limitations, and for each category we analyze the remaining challenges. The paper also includes a performance comparison for several schemes over a shared database. Finally, we provide tables summarizing the existing detection schemes in terms of challenges address, methods, detection and classification tools applied, features used and applications. ",
    "url": "https://arxiv.org/abs/2402.04735",
    "authors": [
      "Mak Gracic",
      "Guy Gubnisky",
      "Roee Diamant"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2402.04744",
    "title": "Progressive Gradient Flow for Robust N:M Sparsity Training in  Transformers",
    "abstract": "N:M Structured sparsity has garnered significant interest as a result of relatively modest overhead and improved efficiency. Additionally, this form of sparsity holds considerable appeal for reducing the memory footprint owing to their modest representation overhead. There have been efforts to develop training recipes for N:M structured sparsity, they primarily focus on low-sparsity regions ($\\sim$50\\%). Nonetheless, performance of models trained using these approaches tends to decline when confronted with high-sparsity regions ($>$80\\%). In this work, we study the effectiveness of existing sparse training recipes at \\textit{high-sparsity regions} and argue that these methods fail to sustain the model quality on par with low-sparsity regions. We demonstrate that the significant factor contributing to this disparity is the presence of elevated levels of induced noise in the gradient magnitudes. To mitigate this undesirable effect, we employ decay mechanisms to progressively restrict the flow of gradients towards pruned elements. Our approach improves the model quality by up to 2$\\%$ and 5$\\%$ in vision and language models at high sparsity regime, respectively. We also evaluate the trade-off between model accuracy and training compute cost in terms of FLOPs. At iso-training FLOPs, our method yields better performance compared to conventional sparse training recipes, exhibiting an accuracy improvement of up to 2$\\%$. The source code is available at https://github.com/abhibambhaniya/progressive_gradient_flow_nm_sparsity. ",
    "url": "https://arxiv.org/abs/2402.04744",
    "authors": [
      "Abhimanyu Rajeshkumar Bambhaniya",
      "Amir Yazdanbakhsh",
      "Suvinay Subramanian",
      "Sheng-Chun Kao",
      "Shivani Agrawal",
      "Utku Evci",
      "Tushar Krishna"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2402.04763",
    "title": "Emergence of specialized Collective Behaviors in Evolving Heterogeneous  Swarms",
    "abstract": "Natural groups of animals, such as swarms of social insects, exhibit astonishing degrees of task specialization, useful to address complex tasks and to survive. This is supported by phenotypic plasticity: individuals sharing the same genotype that is expressed differently for different classes of individuals, each specializing in one task. In this work, we evolve a swarm of simulated robots with phenotypic plasticity to study the emergence of specialized collective behavior during an emergent perception task. Phenotypic plasticity is realized in the form of heterogeneity of behavior by dividing the genotype into two components, with one different neural network controller associated to each component. The whole genotype, expressing the behavior of the whole group through the two components, is subject to evolution with a single fitness function. We analyse the obtained behaviors and use the insights provided by these results to design an online regulatory mechanism. Our experiments show three main findings: 1) The sub-groups evolve distinct emergent behaviors. 2) The effectiveness of the whole swarm depends on the interaction between the two sub-groups, leading to a more robust performance than with singular sub-group behavior. 3) The online regulatory mechanism enhances overall performance and scalability. ",
    "url": "https://arxiv.org/abs/2402.04763",
    "authors": [
      "Fuda van Diggelen",
      "Matteo De Carlo",
      "Nicolas Cambier",
      "Eliseo Ferrante",
      "A.E. Eiben"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.04764",
    "title": "Code as Reward: Empowering Reinforcement Learning with VLMs",
    "abstract": "Pre-trained Vision-Language Models (VLMs) are able to understand visual concepts, describe and decompose complex tasks into sub-tasks, and provide feedback on task completion. In this paper, we aim to leverage these capabilities to support the training of reinforcement learning (RL) agents. In principle, VLMs are well suited for this purpose, as they can naturally analyze image-based observations and provide feedback (reward) on learning progress. However, inference in VLMs is computationally expensive, so querying them frequently to compute rewards would significantly slowdown the training of an RL agent. To address this challenge, we propose a framework named Code as Reward (VLM-CaR). VLM-CaR produces dense reward functions from VLMs through code generation, thereby significantly reducing the computational burden of querying the VLM directly. We show that the dense rewards generated through our approach are very accurate across a diverse set of discrete and continuous environments, and can be more effective in training RL policies than the original sparse environment rewards. ",
    "url": "https://arxiv.org/abs/2402.04764",
    "authors": [
      "David Venuto",
      "Sami Nur Islam",
      "Martin Klissarov",
      "Doina Precup",
      "Sherry Yang",
      "Ankit Anand"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04768",
    "title": "Robot Interaction Behavior Generation based on Social Motion Forecasting  for Human-Robot Interaction",
    "abstract": "Integrating robots into populated environments is a complex challenge that requires an understanding of human social dynamics. In this work, we propose to model social motion forecasting in a shared human-robot representation space, which facilitates us to synthesize robot motions that interact with humans in social scenarios despite not observing any robot in the motion training. We develop a transformer-based architecture called ECHO, which operates in the aforementioned shared space to predict the future motions of the agents encountered in social scenarios. Contrary to prior works, we reformulate the social motion problem as the refinement of the predicted individual motions based on the surrounding agents, which facilitates the training while allowing for single-motion forecasting when only one human is in the scene. We evaluate our model in multi-person and human-robot motion forecasting tasks and obtain state-of-the-art performance by a large margin while being efficient and performing in real-time. Additionally, our qualitative results showcase the effectiveness of our approach in generating human-robot interaction behaviors that can be controlled via text commands. ",
    "url": "https://arxiv.org/abs/2402.04768",
    "authors": [
      "Esteve Valls Mascaro",
      "Yashuai Yan",
      "Dongheui Lee"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2402.04769",
    "title": "Hierarchical Motion Planning and Offline Robust Model Predictive Control  for Autonomous Vehicles",
    "abstract": "Driving vehicles in complex scenarios under harsh conditions is the biggest challenge for autonomous vehicles (AVs). To address this issue, we propose hierarchical motion planning and robust control strategy using the front-active steering system in complex scenarios with various slippery road adhesion coefficients while considering vehicle uncertain parameters. Behaviors of human vehicles (HVs) are considered and modeled in the form of a car-following model via the Intelligent Driver Model (IDM). Then, in the upper layer, the motion planner first generates an optimal trajectory by using the artificial potential field (APF) algorithm to formulate any surrounding objects, e.g., road marks, boundaries, and static/dynamic obstacles. To track the generated optimal trajectory, in the lower layer, an offline-constrained output feedback robust model predictive control (RMPC) is employed for the linear parameter varying (LPV) system by applying linear matrix inequality (LMI) optimization method that ensures the robustness against the model parameter uncertainties. Furthermore, by augmenting the system model, our proposed approach, called offline RMPC, achieves outstanding efficiency compared to three existing RMPC approaches, e.g., offset-offline RMPC, online RMPC, and offline RMPC without an augmented model (offline RMPC w/o AM), in both improving computing time and reducing input vibrations. ",
    "url": "https://arxiv.org/abs/2402.04769",
    "authors": [
      "Hung Duy Nguyen",
      "Minh Nhat Vu",
      "Nguyen Ngoc Nam",
      "Kyoungseok Han"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2402.04779",
    "title": "StableMask: Refining Causal Masking in Decoder-only Transformer",
    "abstract": "The decoder-only Transformer architecture with causal masking and relative position encoding (RPE) has become the de facto choice in language modeling. Despite its exceptional performance across various tasks, we have identified two limitations: First, it requires all attention scores to be non-zero and sum up to 1, even if the current embedding has sufficient self-contained information. This compels the model to assign disproportional excessive attention to specific tokens. Second, RPE-based Transformers are not universal approximators due to their limited capacity at encoding absolute positional information, which limits their application in position-critical tasks. In this work, we propose StableMask: a parameter-free method to address both limitations by refining the causal mask. It introduces pseudo-attention values to balance attention distributions and encodes absolute positional information via a progressively decreasing mask ratio. StableMask's effectiveness is validated both theoretically and empirically, showing significant enhancements in language models with parameter sizes ranging from 71M to 1.4B across diverse datasets and encoding methods. We further show that it naturally supports (1) efficient extrapolation without special tricks such as StreamingLLM and (2) easy integration with existing attention optimization techniques. ",
    "url": "https://arxiv.org/abs/2402.04779",
    "authors": [
      "Qingyu Yin",
      "Xuzheng He",
      "Xiang Zhuang",
      "Yu Zhao",
      "Jianhua Yao",
      "Xiaoyu Shen",
      "Qiang Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.04783",
    "title": "Analyzing the Neural Tangent Kernel of Periodically Activated Coordinate  Networks",
    "abstract": "Recently, neural networks utilizing periodic activation functions have been proven to demonstrate superior performance in vision tasks compared to traditional ReLU-activated networks. However, there is still a limited understanding of the underlying reasons for this improved performance. In this paper, we aim to address this gap by providing a theoretical understanding of periodically activated networks through an analysis of their Neural Tangent Kernel (NTK). We derive bounds on the minimum eigenvalue of their NTK in the finite width setting, using a fairly general network architecture which requires only one wide layer that grows at least linearly with the number of data samples. Our findings indicate that periodically activated networks are \\textit{notably more well-behaved}, from the NTK perspective, than ReLU activated networks. Additionally, we give an application to the memorization capacity of such networks and verify our theoretical predictions empirically. Our study offers a deeper understanding of the properties of periodically activated neural networks and their potential in the field of deep learning. ",
    "url": "https://arxiv.org/abs/2402.04783",
    "authors": [
      "Hemanth Saratchandran",
      "Shin-Fang Chng",
      "Simon Lucey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04786",
    "title": "Multiple bipolar fuzzy measures: an application to community detection  problems for networks with additional information",
    "abstract": "In this paper we introduce the concept of multiple bipolar fuzzy measures as a generalization of a bipolar fuzzy measure. We also propose a new definition of a group, which is based on the multidimensional bipolar fuzzy relations of its elements. Taking into account this information, we provide a novel procedure (based on the well-known Louvain algorithm) to deal with community detection problems. This new method considers the multidimensional bipolar information provided by multiple bipolar fuzzy measures, as well as the information provided by a graph. We also give some detailed computational tests, obtained from the application of this algorithm in several benchmark models. ",
    "url": "https://arxiv.org/abs/2402.04786",
    "authors": [
      "Inmaculada Gutiérrez",
      "Daniel Gómez",
      "Javier Castro",
      "Rosa Espínola"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Statistics Theory (math.ST)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2402.04818",
    "title": "An advanced scheme for queue management inTCP/IP networks",
    "abstract": "Active Queue Management (AQM) is a key congestion control scheme that aims to find a balance between keeping high link utilization, minimizing queuing delays, and ensuring a fair share of the bandwidth between the competing flows. Traditional AQM mechanisms use only information that is present at the intermediate nodes (routers). They do not take into account the particularities of the flows composing the traffic. In this paper, we make use of a mechanism, called Explicit RTT Notification (ERN), that shares with routers information about the Round Trip Times (RTTs) of the flows. We propose a new fuzzy logic based AQM controller that relies on the RTTs of the flows to improve fairness between them. The performances of the new proposed method, FuzzyRTT, is examined and compared to existing schemes via simulation experiments. ",
    "url": "https://arxiv.org/abs/2402.04818",
    "authors": [
      "Abderrahmane Boudi",
      "Malik Loudini"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2402.04821",
    "title": "E(3)-Equivariant Mesh Neural Networks",
    "abstract": "Triangular meshes are widely used to represent three-dimensional objects. As a result, many recent works have address the need for geometric deep learning on 3D mesh. However, we observe that the complexities in many of these architectures does not translate to practical performance, and simple deep models for geometric graphs are competitive in practice. Motivated by this observation, we minimally extend the update equations of E(n)-Equivariant Graph Neural Networks (EGNNs) (Satorras et al., 2021) to incorporate mesh face information, and further improve it to account for long-range interactions through hierarchy. The resulting architecture, Equivariant Mesh Neural Network (EMNN), outperforms other, more complicated equivariant methods on mesh tasks, with a fast run-time and no expensive pre-processing. ",
    "url": "https://arxiv.org/abs/2402.04821",
    "authors": [
      "Thuan Trang",
      "Nhat Khang Ngo",
      "Daniel Levy",
      "Thieu N. Vo",
      "Siamak Ravanbakhsh",
      "Truong Son Hy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04835",
    "title": "SARI: Simplistic Average and Robust Identification based Noisy Partial  Label Learning",
    "abstract": "Partial label learning (PLL) is a weakly-supervised learning paradigm where each training instance is paired with a set of candidate labels (partial label), one of which is the true label. Noisy PLL (NPLL) relaxes this constraint by allowing some partial labels to not contain the true label, enhancing the practicality of the problem. Our work centers on NPLL and presents a minimalistic framework called SARI that initially assigns pseudo-labels to images by exploiting the noisy partial labels through a weighted nearest neighbour algorithm. These pseudo-label and image pairs are then used to train a deep neural network classifier with label smoothing and standard regularization techniques. The classifier's features and predictions are subsequently employed to refine and enhance the accuracy of pseudo-labels. SARI combines the strengths of Average Based Strategies (in pseudo labelling) and Identification Based Strategies (in classifier training) from the literature. We perform thorough experiments on seven datasets and compare SARI against nine NPLL and PLL methods from the prior art. SARI achieves state-of-the-art results in almost all studied settings, obtaining substantial gains in fine-grained classification and extreme noise settings. ",
    "url": "https://arxiv.org/abs/2402.04835",
    "authors": [
      "Darshana Saravanan",
      "Naresh Manwani",
      "Vineet Gandhi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04852",
    "title": "Multi-Patch Prediction: Adapting LLMs for Time Series Representation  Learning",
    "abstract": "In this study, we present aLLM4TS, an innovative framework that adapts Large Language Models (LLMs) for time-series representation learning. Central to our approach is that we reconceive time-series forecasting as a self-supervised, multi-patch prediction task, which, compared to traditional mask-and-reconstruction methods, captures temporal dynamics in patch representations more effectively. Our strategy encompasses two-stage training: (i). a causal continual pre-training phase on various time-series datasets, anchored on next patch prediction, effectively syncing LLM capabilities with the intricacies of time-series data; (ii). fine-tuning for multi-patch prediction in the targeted time-series context. A distinctive element of our framework is the patch-wise decoding layer, which departs from previous methods reliant on sequence-level decoding. Such a design directly transposes individual patches into temporal sequences, thereby significantly bolstering the model's proficiency in mastering temporal patch-based representations. aLLM4TS demonstrates superior performance in several downstream tasks, proving its effectiveness in deriving temporal representations with enhanced transferability and marking a pivotal advancement in the adaptation of LLMs for time-series analysis. ",
    "url": "https://arxiv.org/abs/2402.04852",
    "authors": [
      "Yuxuan Bian",
      "Xuan Ju",
      "Jiangtong Li",
      "Zhijian Xu",
      "Dawei Cheng",
      "Qiang Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04854",
    "title": "Hierarchical Tree-structured Knowledge Graph For Academic Insight Survey",
    "abstract": "Research surveys have always posed a challenge for beginner researchers who lack of research training. These researchers struggle to understand the directions within their research topic, and the discovery of new research findings within a short time. One way to provide intuitive assistance to beginner researchers is by offering relevant knowledge graphs(KG) and recommending related academic papers. However, existing navigation knowledge graphs primarily rely on keywords in the research field and often fail to present the logical hierarchy among multiple related papers clearly. Moreover, most recommendation systems for academic papers simply rely on high text similarity, which can leave researchers confused as to why a particular article is being recommended. They may lack of grasp important information about the insight connection between \"Issue resolved\" and \"Issue finding\" that they hope to obtain. To address these issues, this study aims to support research insight surveys for beginner researchers by establishing a hierarchical tree-structured knowledge graph that reflects the inheritance insight of research topics and the relevance insight among the academic papers. ",
    "url": "https://arxiv.org/abs/2402.04854",
    "authors": [
      "Jinghong Li",
      "Huy Phan",
      "Wen Gu",
      "Koichi Ota",
      "Shinobu Hasegawa"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04855",
    "title": "Dual-Path Coupled Image Deraining Network via Spatial-Frequency  Interaction",
    "abstract": "Transformers have recently emerged as a significant force in the field of image deraining. Existing image deraining methods utilize extensive research on self-attention. Though showcasing impressive results, they tend to neglect critical frequency information, as self-attention is generally less adept at capturing high-frequency details. To overcome this shortcoming, we have developed an innovative Dual-Path Coupled Deraining Network (DPCNet) that integrates information from both spatial and frequency domains through Spatial Feature Extraction Block (SFEBlock) and Frequency Feature Extraction Block (FFEBlock). We have further introduced an effective Adaptive Fusion Module (AFM) for the dual-path feature aggregation. Extensive experiments on six public deraining benchmarks and downstream vision tasks have demonstrated that our proposed method not only outperforms the existing state-of-the-art deraining method but also achieves visually pleasuring results with excellent robustness on downstream vision tasks. ",
    "url": "https://arxiv.org/abs/2402.04855",
    "authors": [
      "Yuhong He",
      "Aiwen Jiang",
      "Lingfang Jiang",
      "Zhifeng Wang",
      "Lu Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04869",
    "title": "Learning by Doing: An Online Causal Reinforcement Learning Framework  with Causal-Aware Policy",
    "abstract": "As a key component to intuitive cognition and reasoning solutions in human intelligence, causal knowledge provides great potential for reinforcement learning (RL) agents' interpretability towards decision-making by helping reduce the searching space. However, there is still a considerable gap in discovering and incorporating causality into RL, which hinders the rapid development of causal RL. In this paper, we consider explicitly modeling the generation process of states with the causal graphical model, based on which we augment the policy. We formulate the causal structure updating into the RL interaction process with active intervention learning of the environment. To optimize the derived objective, we propose a framework with theoretical performance guarantees that alternates between two steps: using interventions for causal structure learning during exploration and using the learned causal structure for policy guidance during exploitation. Due to the lack of public benchmarks that allow direct intervention in the state space, we design the root cause localization task in our simulated fault alarm environment and then empirically show the effectiveness and robustness of the proposed method against state-of-the-art baselines. Theoretical analysis shows that our performance improvement attributes to the virtuous cycle of causal-guided policy learning and causal structure learning, which aligns with our experimental results. ",
    "url": "https://arxiv.org/abs/2402.04869",
    "authors": [
      "Ruichu Cai",
      "Siyang Huang",
      "Jie Qiao",
      "Wei Chen",
      "Yan Zeng",
      "Keli Zhang",
      "Fuchun Sun",
      "Yang Yu",
      "Zhifeng Hao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.04870",
    "title": "Embedding Knowledge Graphs in Degenerate Clifford Algebras",
    "abstract": "Clifford algebras are a natural generalization of the real numbers, the complex numbers, and the quaternions. So far, solely Clifford algebras of the form $Cl_{p,q}$ (i.e., algebras without nilpotent base vectors) have been studied in the context of knowledge graph embeddings. We propose to consider nilpotent base vectors with a nilpotency index of two. In these spaces, denoted $Cl_{p,q,r}$, allows generalizing over approaches based on dual numbers (which cannot be modelled using $Cl_{p,q}$) and capturing patterns that emanate from the absence of higher-order interactions between real and complex parts of entity embeddings. We design two new models for the discovery of the parameters $p$, $q$, and $r$. The first model uses a greedy search to optimize $p$, $q$, and $r$. The second predicts $(p, q,r)$ based on an embedding of the input knowledge graph computed using neural networks. The results of our evaluation on seven benchmark datasets suggest that nilpotent vectors can help capture embeddings better. Our comparison against the state of the art suggests that our approach generalizes better than other approaches on all datasets w.r.t. the MRR it achieves on validation data. We also show that a greedy search suffices to discover values of $p$, $q$ and $r$ that are close to optimal. ",
    "url": "https://arxiv.org/abs/2402.04870",
    "authors": [
      "Louis Mozart Kamdem",
      "Caglar Demir",
      "Axel-Cyrille Ngonga"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04874",
    "title": "Choosing a Classical Planner with Graph Neural Networks",
    "abstract": "Online planner selection is the task of choosing a solver out of a predefined set for a given planning problem. As planning is computationally hard, the performance of solvers varies greatly on planning problems. Thus, the ability to predict their performance on a given problem is of great importance. While a variety of learning methods have been employed, for classical cost-optimal planning the prevailing approach uses Graph Neural Networks (GNNs). In this work, we continue the line of work on using GNNs for online planner selection. We perform a thorough investigation of the impact of the chosen GNN model, graph representation and node features, as well as prediction task. Going further, we propose using the graph representation obtained by a GNN as an input to the Extreme Gradient Boosting (XGBoost) model, resulting in a more resource-efficient yet accurate approach. We show the effectiveness of a variety of GNN-based online planner selection methods, opening up new exciting avenues for research on online planner selection. ",
    "url": "https://arxiv.org/abs/2402.04874",
    "authors": [
      "Jana Vatter",
      "Ruben Mayer",
      "Hans-Arno Jacobsen",
      "Horst Samulowitz",
      "Michael Katz"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04878",
    "title": "STAR: Shape-focused Texture Agnostic Representations for Improved Object  Detection and 6D Pose Estimation",
    "abstract": "Recent advances in machine learning have greatly benefited object detection and 6D pose estimation for robotic grasping. However, textureless and metallic objects still pose a significant challenge due to fewer visual cues and the texture bias of CNNs. To address this issue, we propose a texture-agnostic approach that focuses on learning from CAD models and emphasizes object shape features. To achieve a focus on learning shape features, the textures are randomized during the rendering of the training data. By treating the texture as noise, the need for real-world object instances or their final appearance during training data generation is eliminated. The TLESS and ITODD datasets, specifically created for industrial settings in robotics and featuring textureless and metallic objects, were used for evaluation. Texture agnosticity also increases the robustness against image perturbations such as imaging noise, motion blur, and brightness changes, which are common in robotics applications. Code and datasets are publicly available at github.com/hoenigpeter/randomized_texturing. ",
    "url": "https://arxiv.org/abs/2402.04878",
    "authors": [
      "Peter Hönig",
      "Stefan Thalhammer",
      "Jean-Baptiste Weibel",
      "Matthias Hirschmanner",
      "Markus Vincze"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04883",
    "title": "Toward Accurate Camera-based 3D Object Detection via Cascade Depth  Estimation and Calibration",
    "abstract": "Recent camera-based 3D object detection is limited by the precision of transforming from image to 3D feature spaces, as well as the accuracy of object localization within the 3D space. This paper aims to address such a fundamental problem of camera-based 3D object detection: How to effectively learn depth information for accurate feature lifting and object localization. Different from previous methods which directly predict depth distributions by using a supervised estimation model, we propose a cascade framework consisting of two depth-aware learning paradigms. First, a depth estimation (DE) scheme leverages relative depth information to realize the effective feature lifting from 2D to 3D spaces. Furthermore, a depth calibration (DC) scheme introduces depth reconstruction to further adjust the 3D object localization perturbation along the depth axis. In practice, the DE is explicitly realized by using both the absolute and relative depth optimization loss to promote the precision of depth prediction, while the capability of DC is implicitly embedded into the detection Transformer through a depth denoising mechanism in the training phase. The entire model training is accomplished through an end-to-end manner. We propose a baseline detector and evaluate the effectiveness of our proposal with +2.2%/+2.7% NDS/mAP improvements on NuScenes benchmark, and gain a comparable performance with 55.9%/45.7% NDS/mAP. Furthermore, we conduct extensive experiments to demonstrate its generality based on various detectors with about +2% NDS improvements. ",
    "url": "https://arxiv.org/abs/2402.04883",
    "authors": [
      "Chaoqun Wang",
      "Yiran Qin",
      "Zijian Kang",
      "Ningning Ma",
      "Ruimao Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04894",
    "title": "Deep Reinforcement Learning with Dynamic Graphs for Adaptive Informative  Path Planning",
    "abstract": "Autonomous robots are often employed for data collection due to their efficiency and low labour costs. A key task in robotic data acquisition is planning paths through an initially unknown environment to collect observations given platform-specific resource constraints, such as limited battery life. Adaptive online path planning in 3D environments is challenging due to the large set of valid actions and the presence of unknown occlusions. To address these issues, we propose a novel deep reinforcement learning approach for adaptively replanning robot paths to map targets of interest in unknown 3D environments. A key aspect of our approach is a dynamically constructed graph that restricts planning actions local to the robot, allowing us to quickly react to newly discovered obstacles and targets of interest. For replanning, we propose a new reward function that balances between exploring the unknown environment and exploiting online-collected data about the targets of interest. Our experiments show that our method enables more efficient target detection compared to state-of-the-art learning and non-learning baselines. We also show the applicability of our approach for orchard monitoring using an unmanned aerial vehicle in a photorealistic simulator. ",
    "url": "https://arxiv.org/abs/2402.04894",
    "authors": [
      "Apoorva Vashisth",
      "Julius Rückin",
      "Federico Magistri",
      "Cyrill Stachniss",
      "Marija Popović"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04901",
    "title": "Research on Mobile Network High-precision Absolute Time Synchronization  based on TAP",
    "abstract": "With the development of mobile communication and industrial internet technologies, the demand for robust absolute time synchronization based on network for diverse scenarios is significantly growing. TAP is a novel network timing method that aims to achieve sub-microsecond synchronization over air interface. This paper investigates the improvement and end-to-end realization of TAP. This paper first analyzes the effectiveness and deficiencies of TAP by establishing an equivalent clock model which evaluates TAP from timing error composition and allan variance. Second, this paper proposes a detailed base station and terminal design and the corresponding improvement of TAP. Both hardware compensation and protocol software design are taken into account so as to minimize timing error and system cost while maximizing compatibility with 3GPP. Finally, this paper presents a TAP end-to-end 5G prototype system developed based on software defined radio base station and COTS baseband module. The field test results show that the proposed scheme effectively solves the problems of TAP in application and robustly achieves 200ns level timing accuracy in various situations. The average accuracy with long observations can reach 1 nanosecond. It is 2$\\sim$3 orders of magnitude better than common network timing methods, including NTP, PTP and the original TAP. ",
    "url": "https://arxiv.org/abs/2402.04901",
    "authors": [
      "Chenyu Zhang",
      "Xiangming Wen",
      "Wei Zheng",
      "Longdan Yu",
      "Zhaoming Lu",
      "Zhengying Wang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2402.04916",
    "title": "Simple inexpensive vertex and edge invariants distinguishing dataset  strongly regular graphs",
    "abstract": "While standard Weisfeiler-Leman vertex labels are not able to distinguish even vertices of regular graphs, there is proposed and tested family of inexpensive polynomial time vertex and edge invariants, distinguishing much more difficult SRGs (strongly regular graphs), also often their vertices. Among 43717 SRGs from dataset by Edward Spence, proposed vertex invariants alone were able to distinguish all but 4 pairs of graphs, which were easily distinguished by further application of proposed edge invariants. Specifically, proposed vertex invariants are traces or sorted diagonals of $(A|_{N_a})^p$ adjacency matrix $A$ restricted to $N_a$ neighborhood of vertex $a$, already for $p=3$ distinguishing all SRGs from 6 out of 13 sets in this dataset, 8 if adding $p=4$. Proposed edge invariants are analogously traces or diagonals of powers of $\\bar{A}_{ab,cd}=A_{ab} A_{ac} A_{bd}$, nonzero for $(a,b)$ being edges. As SRGs are considered the most difficult cases for graph isomorphism problem, such algebraic-combinatorial invariants bring hope that this problem is polynomial time. ",
    "url": "https://arxiv.org/abs/2402.04916",
    "authors": [
      "Jarek Duda"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)"
    ]
  },
  {
    "id": "arXiv:2402.04924",
    "title": "Two Trades is not Baffled: Condense Graph via Crafting Rational Gradient  Matching",
    "abstract": "Training on large-scale graphs has achieved remarkable results in graph representation learning, but its cost and storage have raised growing concerns. As one of the most promising directions, graph condensation methods address these issues by employing gradient matching, aiming to condense the full graph into a more concise yet information-rich synthetic set. Though encouraging, these strategies primarily emphasize matching directions of the gradients, which leads to deviations in the training trajectories. Such deviations are further magnified by the differences between the condensation and evaluation phases, culminating in accumulated errors, which detrimentally affect the performance of the condensed graphs. In light of this, we propose a novel graph condensation method named \\textbf{C}raf\\textbf{T}ing \\textbf{R}ationa\\textbf{L} trajectory (\\textbf{CTRL}), which offers an optimized starting point closer to the original dataset's feature distribution and a more refined strategy for gradient matching. Theoretically, CTRL can effectively neutralize the impact of accumulated errors on the performance of condensed graphs. We provide extensive experiments on various graph datasets and downstream tasks to support the effectiveness of CTRL. Code is released at https://github.com/NUS-HPC-AI-Lab/CTRL. ",
    "url": "https://arxiv.org/abs/2402.04924",
    "authors": [
      "Tianle Zhang",
      "Yuchen Zhang",
      "Kun Wang",
      "Kai Wang",
      "Beining Yang",
      "Kaipeng Zhang",
      "Wenqi Shao",
      "Ping Liu",
      "Joey Tianyi Zhou",
      "Yang You"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04931",
    "title": "Complexity of the (Connected) Cluster Vertex Deletion problem on  $H$-free graphs",
    "abstract": "The well-known Cluster Vertex Deletion problem (CVD) asks for a given graph $G$ and an integer $k$ whether it is possible to delete a set $S$ of at most $k$ vertices of $G$ such that the resulting graph $G-S$ is a cluster graph (a disjoint union of cliques). We give a complete characterization of graphs $H$ for which CVD on $H$-free graphs is polynomially solvable and for which it is NP-complete. Moreover, in the NP-completeness cases, CVD cannot be solved in sub-exponential time in the vertex number of the $H$-free input graphs unless the Exponential-Time Hypothesis fails. We also consider the connected variant of CVD, the Connected Cluster Vertex Deletion problem (CCVD), in which the set $S$ has to induce a connected subgraph of $G$. It turns out that CCVD admits the same complexity dichotomy for $H$-free graphs. Our results enlarge a list of rare dichotomy theorems for well-studied problems on $H$-free graphs. ",
    "url": "https://arxiv.org/abs/2402.04931",
    "authors": [
      "Hoang-Oanh Le",
      "Van Bang Le"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Computational Complexity (cs.CC)",
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2402.04958",
    "title": "Channel-Selective Normalization for Label-Shift Robust Test-Time  Adaptation",
    "abstract": "Deep neural networks have useful applications in many different tasks, however their performance can be severely affected by changes in the data distribution. For example, in the biomedical field, their performance can be affected by changes in the data (different machines, populations) between training and test datasets. To ensure robustness and generalization to real-world scenarios, test-time adaptation has been recently studied as an approach to adjust models to a new data distribution during inference. Test-time batch normalization is a simple and popular method that achieved compelling performance on domain shift benchmarks. It is implemented by recalculating batch normalization statistics on test batches. Prior work has focused on analysis with test data that has the same label distribution as the training data. However, in many practical applications this technique is vulnerable to label distribution shifts, sometimes producing catastrophic failure. This presents a risk in applying test time adaptation methods in deployment. We propose to tackle this challenge by only selectively adapting channels in a deep network, minimizing drastic adaptation that is sensitive to label shifts. Our selection scheme is based on two principles that we empirically motivate: (1) later layers of networks are more sensitive to label shift (2) individual features can be sensitive to specific classes. We apply the proposed technique to three classification tasks, including CIFAR10-C, Imagenet-C, and diagnosis of fatty liver, where we explore both covariate and label distribution shifts. We find that our method allows to bring the benefits of TTA while significantly reducing the risk of failure common in other methods, while being robust to choice in hyperparameters. ",
    "url": "https://arxiv.org/abs/2402.04958",
    "authors": [
      "Pedro Vianna",
      "Muawiz Chaudhary",
      "Paria Mehrbod",
      "An Tang",
      "Guy Cloutier",
      "Guy Wolf",
      "Michael Eickenberg",
      "Eugene Belilovsky"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04967",
    "title": "Text or Image? What is More Important in Cross-Domain Generalization  Capabilities of Hate Meme Detection Models?",
    "abstract": "This paper delves into the formidable challenge of cross-domain generalization in multimodal hate meme detection, presenting compelling findings. We provide enough pieces of evidence supporting the hypothesis that only the textual component of hateful memes enables the existing multimodal classifier to generalize across different domains, while the image component proves highly sensitive to a specific training dataset. The evidence includes demonstrations showing that hate-text classifiers perform similarly to hate-meme classifiers in a zero-shot setting. Simultaneously, the introduction of captions generated from images of memes to the hate-meme classifier worsens performance by an average F1 of 0.02. Through blackbox explanations, we identify a substantial contribution of the text modality (average of 83%), which diminishes with the introduction of meme's image captions (52%). Additionally, our evaluation on a newly created confounder dataset reveals higher performance on text confounders as compared to image confounders with an average $\\Delta$F1 of 0.18. ",
    "url": "https://arxiv.org/abs/2402.04967",
    "authors": [
      "Piush Aggarwal",
      "Jawar Mehrabanian",
      "Weigang Huang",
      "Özge Alacam",
      "Torsten Zesch"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04979",
    "title": "Detection and Pose Estimation of flat, Texture-less Industry Objects on  HoloLens using synthetic Training",
    "abstract": "Current state-of-the-art 6d pose estimation is too compute intensive to be deployed on edge devices, such as Microsoft HoloLens (2) or Apple iPad, both used for an increasing number of augmented reality applications. The quality of AR is greatly dependent on its capabilities to detect and overlay geometry within the scene. We propose a synthetically trained client-server-based augmented reality application, demonstrating state-of-the-art object pose estimation of metallic and texture-less industry objects on edge devices. Synthetic data enables training without real photographs, i.e. for yet-to-be-manufactured objects. Our qualitative evaluation on an AR-assisted sorting task, and quantitative evaluation on both renderings, as well as real-world data recorded on HoloLens 2, sheds light on its real-world applicability. ",
    "url": "https://arxiv.org/abs/2402.04979",
    "authors": [
      "Thomas Pöllabauer",
      "Fabian Rücker",
      "Andreas Franek",
      "Felix Gorschlüter"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.04982",
    "title": "Beyond explaining: XAI-based Adaptive Learning with SHAP Clustering for  Energy Consumption Prediction",
    "abstract": "This paper presents an approach integrating explainable artificial intelligence (XAI) techniques with adaptive learning to enhance energy consumption prediction models, with a focus on handling data distribution shifts. Leveraging SHAP clustering, our method provides interpretable explanations for model predictions and uses these insights to adaptively refine the model, balancing model complexity with predictive performance. We introduce a three-stage process: (1) obtaining SHAP values to explain model predictions, (2) clustering SHAP values to identify distinct patterns and outliers, and (3) refining the model based on the derived SHAP clustering characteristics. Our approach mitigates overfitting and ensures robustness in handling data distribution shifts. We evaluate our method on a comprehensive dataset comprising energy consumption records of buildings, as well as two additional datasets to assess the transferability of our approach to other domains, regression, and classification problems. Our experiments demonstrate the effectiveness of our approach in both task types, resulting in improved predictive performance and interpretable model explanations. ",
    "url": "https://arxiv.org/abs/2402.04982",
    "authors": [
      "Tobias Clement",
      "Hung Truong Thanh Nguyen",
      "Nils Kemmerzell",
      "Mohamed Abdelaal",
      "Davor Stjelja"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2402.05006",
    "title": "Scalable Algorithm for Finding Balanced Subgraphs with Tolerance in  Signed Networks",
    "abstract": "Signed networks, characterized by edges labeled as either positive or negative, offer nuanced insights into interaction dynamics beyond the capabilities of unsigned graphs. Central to this is the task of identifying the maximum balanced subgraph, crucial for applications like polarized community detection in social networks and portfolio analysis in finance. Traditional models, however, are limited by an assumption of perfect partitioning, which fails to mirror the complexities of real-world data. Addressing this gap, we introduce an innovative generalized balanced subgraph model that incorporates tolerance for irregularities. Our proposed region-based heuristic algorithm, tailored for this NP-hard problem, strikes a balance between low time complexity and high-quality outcomes. Comparative experiments validate its superior performance against leading solutions, delivering enhanced effectiveness (notably larger subgraph sizes) and efficiency (achieving up to 100x speedup) in both traditional and generalized contexts. ",
    "url": "https://arxiv.org/abs/2402.05006",
    "authors": [
      "Jingbang Chen",
      "Qiuyang Mang",
      "Hangrui Zhou",
      "Richard Peng",
      "Yu Gao",
      "Chenhao Ma"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2402.05011",
    "title": "Navigating Complexity: Toward Lossless Graph Condensation via Expanding  Window Matching",
    "abstract": "Graph condensation aims to reduce the size of a large-scale graph dataset by synthesizing a compact counterpart without sacrificing the performance of Graph Neural Networks (GNNs) trained on it, which has shed light on reducing the computational cost for training GNNs. Nevertheless, existing methods often fall short of accurately replicating the original graph for certain datasets, thereby failing to achieve the objective of lossless condensation. To understand this phenomenon, we investigate the potential reasons and reveal that the previous state-of-the-art trajectory matching method provides biased and restricted supervision signals from the original graph when optimizing the condensed one. This significantly limits both the scale and efficacy of the condensed graph. In this paper, we make the first attempt toward \\textit{lossless graph condensation} by bridging the previously neglected supervision signals. Specifically, we employ a curriculum learning strategy to train expert trajectories with more diverse supervision signals from the original graph, and then effectively transfer the information into the condensed graph with expanding window matching. Moreover, we design a loss function to further extract knowledge from the expert trajectories. Theoretical analysis justifies the design of our method and extensive experiments verify its superiority across different datasets. Code is released at https://github.com/NUS-HPC-AI-Lab/GEOM. ",
    "url": "https://arxiv.org/abs/2402.05011",
    "authors": [
      "Yuchen Zhang",
      "Tianle Zhang",
      "Kai Wang",
      "Ziyao Guo",
      "Yuxuan Liang",
      "Xavier Bresson",
      "Wei Jin",
      "Yang You"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.05012",
    "title": "Information Theoretically Secure Encryption Key Generation over Wireless  Networks by Exploiting Packet Errors",
    "abstract": "This article presents a novel method for establishing an information theoretically secure encryption key over wireless channels. It exploits the fact that data transmission over wireless links is accompanied by packet error, while noise terms, and thereby the error events observed by two separate receivers are independent of each other. A number of data packets, with random data, are transmitted from a first legitimate node, say Alice, to a second legitimate node, say Bob. Bob identifies all packets that are received error-free in the first transmission attempt and sends their indices to Alice over a public channel. Then, both Alice and Bob mix the contents of identified packets, e.g., using a hash function, and thereby derive an identical encryption key. Since error events from Alice to Bob is independent of error events from Alice to Eve, the chances that Eve has successfully received all packets used in key generation error-free diminishes as the number of packet increases. In many wireless standards, the first stage in error detection and Automatic Repeat Request (ARQ) is deployed at the PHY/MAC (Physical Layer/Medium Access Control) layer. In such setups, the first re-transmission is manged by the PHY/MAC layer without informing higher layers. This makes it impossible to directly access the information related to packet errors through high-level programming interfaces available to an end-user. A method is presented for determining packets received error-free in first transmission attempts through high-level programming. Examples are presented in conjunction with an LTE cellular network. ",
    "url": "https://arxiv.org/abs/2402.05012",
    "authors": [
      "Amir K. Khandani"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.05027",
    "title": "Towards Generalizability of Multi-Agent Reinforcement Learning in Graphs  with Recurrent Message Passing",
    "abstract": "Graph-based environments pose unique challenges to multi-agent reinforcement learning. In decentralized approaches, agents operate within a given graph and make decisions based on partial or outdated observations. The size of the observed neighborhood limits the generalizability to different graphs and affects the reactivity of agents, the quality of the selected actions, and the communication overhead. This work focuses on generalizability and resolves the trade-off in observed neighborhood size with a continuous information flow in the whole graph. We propose a recurrent message-passing model that iterates with the environment's steps and allows nodes to create a global representation of the graph by exchanging messages with their neighbors. Agents receive the resulting learned graph observations based on their location in the graph. Our approach can be used in a decentralized manner at runtime and in combination with a reinforcement learning algorithm of choice. We evaluate our method across 1000 diverse graphs in the context of routing in communication networks and find that it enables agents to generalize and adapt to changes in the graph. ",
    "url": "https://arxiv.org/abs/2402.05027",
    "authors": [
      "Jannis Weil",
      "Zhenghua Bao",
      "Osama Abboud",
      "Tobias Meuser"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.05028",
    "title": "Community detection problem based on polarization measures:an  application to Twitter: the COVID-19 case in Spain",
    "abstract": "In this paper, we address one of the most important topics in the field of Social Networks Analysis: the community detection problem with additional information. That additional information is modeled by a fuzzy measure that represents the risk of polarization. Particularly, we are interested in dealing with the problem of taking into account the polarization of nodes in the community detection problem. Adding this type of information to the community detection problem makes it more realistic, as a community is more likely to be defined if the corresponding elements are willing to maintain a peaceful dialogue. The polarization capacity is modeled by a fuzzy measure based on the JDJpol measure of polarization related to two poles. We also present an efficient algorithm for finding groups whose elements are no polarized. Hereafter, we work in a real case. It is a network obtained from Twitter, concerning the political position against the Spanish government taken by several influential users. We analyze how the partitions obtained change when some additional information related to how polarized that society is, is added to the problem. ",
    "url": "https://arxiv.org/abs/2402.05028",
    "authors": [
      "Inmaculada Gutiérrez",
      "Juan Antonio Guevara",
      "Daniel Gómez",
      "Javier Castro",
      "Rosa Espínola"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Statistics Theory (math.ST)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2402.05039",
    "title": "PAC Learnability under Explanation-Preserving Graph Perturbations",
    "abstract": "Graphical models capture relations between entities in a wide range of applications including social networks, biology, and natural language processing, among others. Graph neural networks (GNN) are neural models that operate over graphs, enabling the model to leverage the complex relationships and dependencies in graph-structured data. A graph explanation is a subgraph which is an `almost sufficient' statistic of the input graph with respect to its classification label. Consequently, the classification label is invariant, with high probability, to perturbations of graph edges not belonging to its explanation subgraph. This work considers two methods for leveraging such perturbation invariances in the design and training of GNNs. First, explanation-assisted learning rules are considered. It is shown that the sample complexity of explanation-assisted learning can be arbitrarily smaller than explanation-agnostic learning. Next, explanation-assisted data augmentation is considered, where the training set is enlarged by artificially producing new training samples via perturbation of the non-explanation edges in the original training set. It is shown that such data augmentation methods may improve performance if the augmented data is in-distribution, however, it may also lead to worse sample complexity compared to explanation-agnostic learning rules if the augmented data is out-of-distribution. Extensive empirical evaluations are provided to verify the theoretical analysis. ",
    "url": "https://arxiv.org/abs/2402.05039",
    "authors": [
      "Xu Zheng",
      "Farhad Shirani",
      "Tianchun Wang",
      "Shouwei Gao",
      "Wenqian Dong",
      "Wei Cheng",
      "Dongsheng Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.05042",
    "title": "Sticky Fingers: Resilience of Satellite Fingerprinting against Jamming  Attacks",
    "abstract": "In the wake of increasing numbers of attacks on radio communication systems, a range of techniques are being deployed to increase the security of these systems. One such technique is radio fingerprinting, in which the transmitter can be identified and authenticated by observing small hardware differences expressed in the signal. Fingerprinting has been explored in particular in the defense of satellite systems, many of which are insecure and cannot be retrofitted with cryptographic security. In this paper, we evaluate the effectiveness of radio fingerprinting techniques under interference and jamming attacks, usually intended to deny service. By taking a pre-trained fingerprinting model and gathering a new dataset in which different levels of Gaussian noise and tone jamming have been added to the legitimate signal, we assess the attacker power required in order to disrupt the transmitter fingerprint such that it can no longer be recognized. We compare this to Gaussian jamming on the data portion of the signal, obtaining the remarkable result that transmitter fingerprints are still recognizable even in the presence of moderate levels of noise. Through deeper analysis of the results, we conclude that it takes a similar amount of jamming power in order to disrupt the fingerprint as it does to jam the message contents itself, so it is safe to include a fingerprinting system to authenticate satellite communication without opening up the system to easier denial-of-service attacks. ",
    "url": "https://arxiv.org/abs/2402.05042",
    "authors": [
      "Joshua Smailes",
      "Edd Salkield",
      "Sebastian Köhler",
      "Simon Birnbach",
      "Martin Strohmeier",
      "Ivan Martinovic"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2402.05052",
    "title": "Causal Representation Learning from Multiple Distributions: A General  Setting",
    "abstract": "In many problems, the measured variables (e.g., image pixels) are just mathematical functions of the hidden causal variables (e.g., the underlying concepts or objects). For the purpose of making predictions in changing environments or making proper changes to the system, it is helpful to recover the hidden causal variables $Z_i$ and their causal relations represented by graph $\\mathcal{G}_Z$. This problem has recently been known as causal representation learning. This paper is concerned with a general, completely nonparametric setting of causal representation learning from multiple distributions (arising from heterogeneous data or nonstationary time series), without assuming hard interventions behind distribution changes. We aim to develop general solutions in this fundamental case; as a by product, this helps see the unique benefit offered by other assumptions such as parametric causal models or hard interventions. We show that under the sparsity constraint on the recovered graph over the latent variables and suitable sufficient change conditions on the causal influences, interestingly, one can recover the moralized graph of the underlying directed acyclic graph, and the recovered latent variables and their relations are related to the underlying causal model in a specific, nontrivial way. In some cases, each latent variable can even be recovered up to component-wise transformations. Experimental results verify our theoretical claims. ",
    "url": "https://arxiv.org/abs/2402.05052",
    "authors": [
      "Kun Zhang",
      "Shaoan Xie",
      "Ignavier Ng",
      "Yujia Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.05073",
    "title": "NITO: Neural Implicit Fields for Resolution-free Topology Optimization",
    "abstract": "Topology optimization is a critical task in engineering design, where the goal is to optimally distribute material in a given space for maximum performance. We introduce Neural Implicit Topology Optimization (NITO), a novel approach to accelerate topology optimization problems using deep learning. NITO stands out as one of the first frameworks to offer a resolution-free and domain-agnostic solution in deep learning-based topology optimization. NITO synthesizes structures with up to seven times better structural efficiency compared to SOTA diffusion models and does so in a tenth of the time. In the NITO framework, we introduce a novel method, the Boundary Point Order-Invariant MLP (BPOM), to represent boundary conditions in a sparse and domain-agnostic manner, moving away from expensive simulation-based approaches. Crucially, NITO circumvents the domain and resolution limitations that restrict Convolutional Neural Network (CNN) models to a structured domain of fixed size -- limitations that hinder the widespread adoption of CNNs in engineering applications. This generalizability allows a single NITO model to train and generate solutions in countless domains, eliminating the need for numerous domain-specific CNNs and their extensive datasets. Despite its generalizability, NITO outperforms SOTA models even in specialized tasks, is an order of magnitude smaller, and is practically trainable at high resolutions that would be restrictive for CNNs. This combination of versatility, efficiency, and performance underlines NITO's potential to transform the landscape of engineering design optimization problems through implicit fields. ",
    "url": "https://arxiv.org/abs/2402.05073",
    "authors": [
      "Amin Heyrani Nobari",
      "Giorgio Giannone",
      "Lyle Regenwetter",
      "Faez Ahmed"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2402.05090",
    "title": "Language-Based Augmentation to Address Shortcut Learning in Object Goal  Navigation",
    "abstract": "Deep Reinforcement Learning (DRL) has shown great potential in enabling robots to find certain objects (e.g., `find a fridge') in environments like homes or schools. This task is known as Object-Goal Navigation (ObjectNav). DRL methods are predominantly trained and evaluated using environment simulators. Although DRL has shown impressive results, the simulators may be biased or limited. This creates a risk of shortcut learning, i.e., learning a policy tailored to specific visual details of training environments. We aim to deepen our understanding of shortcut learning in ObjectNav, its implications and propose a solution. We design an experiment for inserting a shortcut bias in the appearance of training environments. As a proof-of-concept, we associate room types to specific wall colors (e.g., bedrooms with green walls), and observe poor generalization of a state-of-the-art (SOTA) ObjectNav method to environments where this is not the case (e.g., bedrooms with blue walls). We find that shortcut learning is the root cause: the agent learns to navigate to target objects, by simply searching for the associated wall color of the target object's room. To solve this, we propose Language-Based (L-B) augmentation. Our key insight is that we can leverage the multimodal feature space of a Vision-Language Model (VLM) to augment visual representations directly at the feature-level, requiring no changes to the simulator, and only an addition of one layer to the model. Where the SOTA ObjectNav method's success rate drops 69%, our proposal has only a drop of 23%. ",
    "url": "https://arxiv.org/abs/2402.05090",
    "authors": [
      "Dennis Hoftijzer",
      "Gertjan Burghouts",
      "Luuk Spreeuwers"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04278",
    "title": "Gaussian Plane-Wave Neural Operator for Electron Density Estimation",
    "abstract": "This work studies machine learning for electron density prediction, which is fundamental for understanding chemical systems and density functional theory (DFT) simulations. To this end, we introduce the Gaussian plane-wave neural operator (GPWNO), which operates in the infinite-dimensional functional space using the plane-wave and Gaussian-type orbital bases, widely recognized in the context of DFT. In particular, both high- and low-frequency components of the density can be effectively represented due to the complementary nature of the two bases. Extensive experiments on QM9, MD, and material project datasets demonstrate GPWNO's superior performance over ten baselines. ",
    "url": "https://arxiv.org/abs/2402.04278",
    "authors": [
      "Seongsu Kim",
      "Sungsoo Ahn"
    ],
    "subjectives": [
      "Chemical Physics (physics.chem-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04516",
    "title": "Generalized Sobolev Transport for Probability Measures on a Graph",
    "abstract": "We study the optimal transport (OT) problem for measures supported on a graph metric space. Recently, Le et al. (2022) leverage the graph structure and propose a variant of OT, namely Sobolev transport (ST), which yields a closed-form expression for a fast computation. However, ST is essentially coupled with the $L^p$ geometric structure within its definition which makes it nontrivial to utilize ST for other prior structures. In contrast, the classic OT has the flexibility to adapt to various geometric structures by modifying the underlying cost function. An important instance is the Orlicz-Wasserstein (OW) which moves beyond the $L^p$ structure by leveraging the \\emph{Orlicz geometric structure}. Comparing to the usage of standard $p$-order Wasserstein, OW remarkably helps to advance certain machine learning approaches. Nevertheless, OW brings up a new challenge on its computation due to its two-level optimization formulation. In this work, we leverage a specific class of convex functions for Orlicz structure to propose the generalized Sobolev transport (GST). GST encompasses the ST as its special case, and can be utilized for prior structures beyond the $L^p$ geometry. In connection with the OW, we show that one only needs to simply solve a univariate optimization problem to compute the GST, unlike the complex two-level optimization problem in OW. We empirically illustrate that GST is several-order faster than the OW. Moreover, we provide preliminary evidences on the advantages of GST for document classification and for several tasks in topological data analysis. ",
    "url": "https://arxiv.org/abs/2402.04516",
    "authors": [
      "Tam Le",
      "Truyen Nguyen",
      "Kenji Fukumizu"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.04566",
    "title": "Triplet-constraint Transformer with Multi-scale Refinement for Dose  Prediction in Radiotherapy",
    "abstract": "Radiotherapy is a primary treatment for cancers with the aim of applying sufficient radiation dose to the planning target volume (PTV) while minimizing dose hazards to the organs at risk (OARs). Convolutional neural networks (CNNs) have automated the radiotherapy plan-making by predicting the dose maps. However, current CNN-based methods ignore the remarkable dose difference in the dose map, i.e., high dose value in the interior PTV while low value in the exterior PTV, leading to a suboptimal prediction. In this paper, we propose a triplet-constraint transformer (TCtrans) with multi-scale refinement to predict the high-quality dose distribution. Concretely, a novel PTV-guided triplet constraint is designed to refine dose feature representations in the interior and exterior PTV by utilizing the explicit geometry of PTV. Furthermore, we introduce a multi-scale refinement (MSR) module to effectively fulfill the triplet constraint in different decoding layers with multiple scales. Besides, a transformer encoder is devised to learn the important global dosimetric knowledge. Experiments on a clinical cervical cancer dataset demonstrate the superiority of our method. ",
    "url": "https://arxiv.org/abs/2402.04566",
    "authors": [
      "Lu Wen",
      "Qihun Zhang",
      "Zhenghao Feng",
      "Yuanyuan Xu",
      "Xiao Chen",
      "Jiliu Zhou",
      "Yan Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.04777",
    "title": "A fast score-based search algorithm for maximal ancestral graphs using  entropy",
    "abstract": "\\emph{Maximal ancestral graph} (MAGs) is a class of graphical model that extend the famous \\emph{directed acyclic graph} in the presence of latent confounders. Most score-based approaches to learn the unknown MAG from empirical data rely on BIC score which suffers from instability and heavy computations. We propose to use the framework of imsets \\citep{studeny2006probabilistic} to score MAGs using empirical entropy estimation and the newly proposed \\emph{refined Markov property} \\citep{hu2023towards}. Our graphical search procedure is similar to \\citet{claassen2022greedy} but improved from our theoretical results. We show that our search algorithm is polynomial in number of nodes by restricting degree, maximal head size and number of discriminating paths. In simulated experiment, our algorithm shows superior performance compared to other state of art MAG learning algorithms. ",
    "url": "https://arxiv.org/abs/2402.04777",
    "authors": [
      "Zhongyi Hu",
      "Robin Evans"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2402.04782",
    "title": "From fuzzy information to community detection: an approach to social  networks analysis with soft information",
    "abstract": "On the basis of network analysis, and within the context of modeling imprecision or vague information with fuzzy sets, we propose an innovative way to analyze, aggregate and apply this uncertain knowledge into community detection of real-life problems. This work is set on the existence of one (or multiple) soft information sources, independent of the network considered, assuming this extra knowledge is modeled by a vector of fuzzy sets (or a family of vectors). This information may represent, for example, how much some people agree with a specific law, or their position against several politicians. We emphasize the importance of being able to manage the vagueness which usually appears in real life because of the common use of linguistic terms. Then, we propose a constructive method to build fuzzy measures from fuzzy sets. These measures are the basis of a new representation model which combines the information of a network with that of fuzzy sets, specifically when it comes to linguistic terms. We propose a specific application of that model in terms of finding communities in a network with additional soft information. To do so, we propose an efficient algorithm and measure its performance by means of a benchmarking process, obtaining high-quality results. ",
    "url": "https://arxiv.org/abs/2402.04782",
    "authors": [
      "Inmaculada Gutiérrez",
      "Daniel Gómez",
      "Javier Castro",
      "Rosa Espínola"
    ],
    "subjectives": [
      "Statistics Theory (math.ST)",
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2402.04834",
    "title": "A blockBP decoder for the surface code",
    "abstract": "We present a new decoder for the surface code, which combines the accuracy of the tensor-network decoders with the efficiency and parallelism of the belief-propagation algorithm. Our main idea is to replace the expensive tensor-network contraction step in the tensor-network decoders with the blockBP algorithm - a recent approximate contraction algorithm, based on belief propagation. Our decoder is therefore a belief-propagation decoder that works in the degenerate maximal likelihood decoding framework. Unlike conventional tensor-network decoders, our algorithm can run efficiently in parallel, and may therefore be suitable for real-time decoding. We numerically test our decoder and show that for a large range of lattice sizes and noise levels it delivers a logical error probability that outperforms the Minimal-Weight-Perfect-Matching (MWPM) decoder, sometimes by more than an order of magnitude. ",
    "url": "https://arxiv.org/abs/2402.04834",
    "authors": [
      "Aviad Kaufmann",
      "Itai Arad"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2402.04866",
    "title": "Room transfer function reconstruction using complex-valued neural  networks and irregularly distributed microphones",
    "abstract": "Reconstructing the room transfer functions needed to calculate the complex sound field in a room has several important real-world applications. However, an unpractical number of microphones is often required. Recently, in addition to classical signal processing methods, deep learning techniques have been applied to reconstruct the room transfer function starting from a very limited set of room transfer functions measured at scattered points in the room. In this study, we employ complex-valued neural networks to estimate room transfer functions in the frequency range of the first room resonances, using a few irregularly distributed microphones. To the best of our knowledge, this is the first time complex-valued neural networks are used to estimate room transfer functions. To analyze the benefits of applying complex-valued optimization to the considered task, we compare the proposed technique with a state-of-the-art real-valued neural network method and a state-of-the-art kernel-based signal processing approach for sound field reconstruction, showing that the proposed technique exhibits relevant advantages in terms of phase accuracy and overall quality of the reconstructed sound field. ",
    "url": "https://arxiv.org/abs/2402.04866",
    "authors": [
      "Francesca Ronchini",
      "Luca Comanducci",
      "Mirco Pezzoli",
      "Fabio Antonacci",
      "Augusto Sarti"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.04980",
    "title": "Asymptotics of feature learning in two-layer networks after one  gradient-step",
    "abstract": "In this manuscript we investigate the problem of how two-layer neural networks learn features from data, and improve over the kernel regime, after being trained with a single gradient descent step. Leveraging a connection from (Ba et al., 2022) with a non-linear spiked matrix model and recent progress on Gaussian universality (Dandi et al., 2023), we provide an exact asymptotic description of the generalization error in the high-dimensional limit where the number of samples $n$, the width $p$ and the input dimension $d$ grow at a proportional rate. We characterize exactly how adapting to the data is crucial for the network to efficiently learn non-linear functions in the direction of the gradient -- where at initialization it can only express linear functions in this regime. To our knowledge, our results provides the first tight description of the impact of feature learning in the generalization of two-layer neural networks in the large learning rate regime $\\eta=\\Theta_{d}(d)$, beyond perturbative finite width corrections of the conjugate and neural tangent kernels. ",
    "url": "https://arxiv.org/abs/2402.04980",
    "authors": [
      "Hugo Cui",
      "Luca Pesce",
      "Yatin Dandi",
      "Florent Krzakala",
      "Yue M. Lu",
      "Lenka Zdeborová",
      "Bruno Loureiro"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Disordered Systems and Neural Networks (cond-mat.dis-nn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.05067",
    "title": "Multiscale Modelling with Physics-informed Neural Network: from  Large-scale Dynamics to Small-scale Predictions in Complex Systems",
    "abstract": "Multiscale phenomena manifest across various scientific domains, presenting a ubiquitous challenge in accurately and effectively predicting multiscale dynamics in complex systems. In this paper, a novel solving mode is proposed for characterizing multiscale dynamics through a decoupling method. By modelling large-scale dynamics independently and treating small-scale dynamics as a slaved system, a Spectral PINN is developed to approach the small-scale system in an orthogonal basis functional space. The effectiveness of the method is demonstrated through extensive numerical experiments, including one-dimensional Kuramot-Sivashinsky (KS) equation, two- and three-dimensional Navier-Stokes (NS) equations, showcasing its versatility in addressing problems of fluid dynamics. Furthermore, we also delve into the application of the proposed approach to more complex problems, including non-uniform meshes, complex geometries, large-scale data with noise, and high-dimensional small-scale dynamics. The discussions about these scenarios contribute to a comprehensive understanding of the method's capabilities and limitations. This novel decoupling approach simplifies the analysis and prediction of spatiotemporal systems, where large-scale data can be obtained with low computational demands, followed by Spectral PINNs for capturing small-scale dynamics with improved efficiency and accuracy. ",
    "url": "https://arxiv.org/abs/2402.05067",
    "authors": [
      "Jing Wang",
      "Zheng Li",
      "Pengyu Lai",
      "Rui Wang",
      "Di Yang",
      "Hui Xu"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2402.05088",
    "title": "Domination and packing in graphs",
    "abstract": "Given a graph~$G$, the domination number, denoted by~$\\gamma(G)$, is the minimum cardinality of a dominating set in~$G$. Dual to the notion of domination number is the packing number of a graph. A packing of~$G$ is a set of vertices whose pairwise distance is at least three. The packing number~$\\rho(G)$ of~$G$ is the maximum cardinality of one such set. Furthermore, the inequality~$\\rho(G) \\leq \\gamma(G)$ is well-known. Henning et al.\\ conjectured that~$\\gamma(G) \\leq 2\\rho(G)+1$ if~$G$ is subcubic. In this paper we progress towards this conjecture by showing that~${\\gamma(G) \\leq \\frac{120}{49}\\rho(G)}$ if~$G$ is a bipartite cubic graph. We also show that $\\gamma(G) \\leq 3\\rho(G)$ if~$G$ is a maximal outerplanar graph, and that~$\\gamma(G) \\leq 2\\rho(G)$ if~$G$ is a biconvex graph. Moreover, in the last case, we show that this upper bound is tight. ",
    "url": "https://arxiv.org/abs/2402.05088",
    "authors": [
      "Renzo Gómez Juan Gutiérrez"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2105.00582",
    "title": "Semi-supervised learning for generalizable intracranial hemorrhage  detection and segmentation",
    "abstract": " Title: Semi-supervised learning for generalizable intracranial hemorrhage  detection and segmentation ",
    "url": "https://arxiv.org/abs/2105.00582",
    "authors": [
      "Emily Lin",
      "Esther Yuh"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.12581",
    "title": "Medium Access Control protocol for Collaborative Spectrum Learning in  Wireless Networks",
    "abstract": " Title: Medium Access Control protocol for Collaborative Spectrum Learning in  Wireless Networks ",
    "url": "https://arxiv.org/abs/2111.12581",
    "authors": [
      "Tomer Boyarski",
      "Wenbo Wang",
      "Amir Leshem"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2205.14839",
    "title": "Adversarial Bandits against Arbitrary Strategies",
    "abstract": " Title: Adversarial Bandits against Arbitrary Strategies ",
    "url": "https://arxiv.org/abs/2205.14839",
    "authors": [
      "Jung-hun Kim",
      "Se-Young Yun"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2208.01908",
    "title": "Mass Exit Attacks on the Lightning Network",
    "abstract": " Title: Mass Exit Attacks on the Lightning Network ",
    "url": "https://arxiv.org/abs/2208.01908",
    "authors": [
      "Cosimo Sguanci",
      "Anastasios Sidiropoulos"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2209.08996",
    "title": "EDO-Net: Learning Elastic Properties of Deformable Objects from Graph  Dynamics",
    "abstract": " Title: EDO-Net: Learning Elastic Properties of Deformable Objects from Graph  Dynamics ",
    "url": "https://arxiv.org/abs/2209.08996",
    "authors": [
      "Alberta Longhini",
      "Marco Moletta",
      "Alfredo Reichlin",
      "Michael C. Welle",
      "David Held",
      "Zackory Erickson",
      "Danica Kragic"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2210.01426",
    "title": "Continuous Monte Carlo Graph Search",
    "abstract": " Comments: Accepted at AAMAS 2024 (full paper & oral) ",
    "url": "https://arxiv.org/abs/2210.01426",
    "authors": [
      "Kalle Kujanpää",
      "Amin Babadi",
      "Yi Zhao",
      "Juho Kannala",
      "Alexander Ilin",
      "Joni Pajarinen"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2211.04085",
    "title": "Detection and depth estimation for domestic waste in outdoor  environments by sensors fusion",
    "abstract": " Comments: This work has been published in IFAC WC 2023 ",
    "url": "https://arxiv.org/abs/2211.04085",
    "authors": [
      "Ignacio de L. Páez-Ubieta",
      "Edison Velasco-Sánchez",
      "Santiago T. Puente",
      "Francisco A. Candelas"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2211.10743",
    "title": "Monitoring the edges of product networks using distances",
    "abstract": " Comments: v2, 21 pages ",
    "url": "https://arxiv.org/abs/2211.10743",
    "authors": [
      "Wen Li",
      "Ralf Klasing",
      "Yaping Mao",
      "Bo Ning"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Networking and Internet Architecture (cs.NI)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2211.10805",
    "title": "On the Pointwise Behavior of Recursive Partitioning and Its Implications  for Heterogeneous Causal Effect Estimation",
    "abstract": " Title: On the Pointwise Behavior of Recursive Partitioning and Its Implications  for Heterogeneous Causal Effect Estimation ",
    "url": "https://arxiv.org/abs/2211.10805",
    "authors": [
      "Matias D. Cattaneo",
      "Jason M. Klusowski",
      "Peter M. Tian"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2211.13692",
    "title": "To be or not to be stable, that is the question: understanding neural  networks for inverse problems",
    "abstract": " Comments: 21 pages, 6 figure. Paper will be sent for publication on a journal soon. This is a preliminary version, updated versions will be uploaded on ArXiv ",
    "url": "https://arxiv.org/abs/2211.13692",
    "authors": [
      "Davide Evangelista",
      "James Nagy",
      "Elena Morotti",
      "Elena Loli Piccolomini"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.00720",
    "title": "A Stable, Fast, and Fully Automatic Learning Algorithm for Predictive  Coding Networks",
    "abstract": " Comments: Change of title and abstract, that now reflect the version accepted for publication. One co-author also added, that performed the additional experiments ",
    "url": "https://arxiv.org/abs/2212.00720",
    "authors": [
      "Tommaso Salvatori",
      "Yuhang Song",
      "Yordan Yordanov",
      "Beren Millidge",
      "Zhenghua Xu",
      "Lei Sha",
      "Cornelius Emde",
      "Rafal Bogacz",
      "Thomas Lukasiewicz"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.08918",
    "title": "Revisiting Signed Propagation for Multi-Class Graph Neural Networks",
    "abstract": " Title: Revisiting Signed Propagation for Multi-Class Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2301.08918",
    "authors": [
      "Yoonhyuk Choi",
      "Jiho Choi",
      "Taewook Ko",
      "Chong-Kwon Kim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2303.02949",
    "title": "Angle-Constrained Formation Control under Directed Non-Triangulated  Sensing Graphs (Extended Version)",
    "abstract": " Comments: This paper is the extended version of our paper published in Automatica ",
    "url": "https://arxiv.org/abs/2303.02949",
    "authors": [
      "Kun Li",
      "Zhixi Shen",
      "Gangshan Jing",
      "Yongduan Song"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2303.15919",
    "title": "Fully Hyperbolic Convolutional Neural Networks for Computer Vision",
    "abstract": " Title: Fully Hyperbolic Convolutional Neural Networks for Computer Vision ",
    "url": "https://arxiv.org/abs/2303.15919",
    "authors": [
      "Ahmad Bdeir",
      "Kristian Schwethelm",
      "Niels Landwehr"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.17152",
    "title": "Mixed Autoencoder for Self-supervised Visual Representation Learning",
    "abstract": " Comments: Accepted by CVPR 2023 ",
    "url": "https://arxiv.org/abs/2303.17152",
    "authors": [
      "Kai Chen",
      "Zhili Liu",
      "Lanqing Hong",
      "Hang Xu",
      "Zhenguo Li",
      "Dit-Yan Yeung"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.17235",
    "title": "Kaizen: Practical Self-supervised Continual Learning with Continual  Fine-tuning",
    "abstract": " Comments: Presented at IEEE/CVF Winter Conference on Applications of Computer Vision (WACV) 2024. The code for this work is available at this https URL ",
    "url": "https://arxiv.org/abs/2303.17235",
    "authors": [
      "Chi Ian Tang",
      "Lorena Qendro",
      "Dimitris Spathis",
      "Fahim Kawsar",
      "Cecilia Mascolo",
      "Akhil Mathur"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.03462",
    "title": "General Neural Gauge Fields",
    "abstract": " Comments: ICLR 2023 ",
    "url": "https://arxiv.org/abs/2305.03462",
    "authors": [
      "Fangneng Zhan",
      "Lingjie Liu",
      "Adam Kortylewski",
      "Christian Theobalt"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2305.08809",
    "title": "Interpretability at Scale: Identifying Causal Mechanisms in Alpaca",
    "abstract": " Comments: NeurIPS 2023 with Author Corrections ",
    "url": "https://arxiv.org/abs/2305.08809",
    "authors": [
      "Zhengxuan Wu",
      "Atticus Geiger",
      "Thomas Icard",
      "Christopher Potts",
      "Noah D. Goodman"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2305.12138",
    "title": "LMs: Understanding Code Syntax and Semantics for Code Analysis",
    "abstract": " Title: LMs: Understanding Code Syntax and Semantics for Code Analysis ",
    "url": "https://arxiv.org/abs/2305.12138",
    "authors": [
      "Wei Ma",
      "Shangqing Liu",
      "Zhihao Lin",
      "Wenhan Wang",
      "Qiang Hu",
      "Ye Liu",
      "Cen Zhang",
      "Liming Nie",
      "Li Li",
      "Yang Liu"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.15611",
    "title": "Size Generalization of Graph Neural Networks on Biological Data:  Insights and Practices from the Spectral Perspective",
    "abstract": " Comments: 21 pages, including appendix ",
    "url": "https://arxiv.org/abs/2305.15611",
    "authors": [
      "Gaotang Li",
      "Danai Koutra",
      "Yujun Yan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.19235",
    "title": "Input State Stability of Gated Graph Neural Networks",
    "abstract": " Title: Input State Stability of Gated Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2305.19235",
    "authors": [
      "Antonio Marino",
      "Claudio Pacchierotti",
      "Paolo Robuffo Giordano"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2305.19510",
    "title": "Mildly Overparameterized ReLU Networks Have a Favorable Loss Landscape",
    "abstract": " Comments: 40 pages ",
    "url": "https://arxiv.org/abs/2305.19510",
    "authors": [
      "Kedar Karhadkar",
      "Michael Murray",
      "Hanna Tseran",
      "Guido Montúfar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Combinatorics (math.CO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2306.00107",
    "title": "MERT: Acoustic Music Understanding Model with Large-Scale  Self-supervised Training",
    "abstract": " Comments: accepted by ICLR 2024 ",
    "url": "https://arxiv.org/abs/2306.00107",
    "authors": [
      "Yizhi Li",
      "Ruibin Yuan",
      "Ge Zhang",
      "Yinghao Ma",
      "Xingran Chen",
      "Hanzhi Yin",
      "Chenghao Xiao",
      "Chenghua Lin",
      "Anton Ragni",
      "Emmanouil Benetos",
      "Norbert Gyenge",
      "Roger Dannenberg",
      "Ruibo Liu",
      "Wenhu Chen",
      "Gus Xia",
      "Yemin Shi",
      "Wenhao Huang",
      "Zili Wang",
      "Yike Guo",
      "Jie Fu"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2306.01731",
    "title": "PAGAR: Taming Reward Misalignment in Inverse Reinforcement  Learning-Based Imitation Learning with Protagonist Antagonist Guided  Adversarial Reward",
    "abstract": " Title: PAGAR: Taming Reward Misalignment in Inverse Reinforcement  Learning-Based Imitation Learning with Protagonist Antagonist Guided  Adversarial Reward ",
    "url": "https://arxiv.org/abs/2306.01731",
    "authors": [
      "Weichao Zhou",
      "Wenchao Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.03933",
    "title": "High-dimensional and Permutation Invariant Anomaly Detection",
    "abstract": " Comments: 7 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2306.03933",
    "authors": [
      "Vinicius Mikuni",
      "Benjamin Nachman"
    ],
    "subjectives": [
      "High Energy Physics - Phenomenology (hep-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "High Energy Physics - Experiment (hep-ex)"
    ]
  },
  {
    "id": "arXiv:2306.08191",
    "title": "Solving Large-scale Spatial Problems with Convolutional Neural Networks",
    "abstract": " Comments: 6 pages, 2 figures, submitted to Asilomar Conference on Signals, Systems, and Computers 2023 ",
    "url": "https://arxiv.org/abs/2306.08191",
    "authors": [
      "Damian Owerko",
      "Charilaos I. Kanatsoulis",
      "Alejandro Ribeiro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2306.11305",
    "title": "Progressive Fourier Neural Representation for Sequential Video  Compilation",
    "abstract": " Title: Progressive Fourier Neural Representation for Sequential Video  Compilation ",
    "url": "https://arxiv.org/abs/2306.11305",
    "authors": [
      "Haeyong Kang",
      "Jaehong Yoon",
      "DaHyun Kim",
      "Sung Ju Hwang",
      "Chang D Yoo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.11903",
    "title": "Deep Fusion: Efficient Network Training via Pre-trained Initializations",
    "abstract": " Title: Deep Fusion: Efficient Network Training via Pre-trained Initializations ",
    "url": "https://arxiv.org/abs/2306.11903",
    "authors": [
      "Hanna Mazzawi",
      "Xavi Gonzalvo",
      "Michael Wunder",
      "Sammy Jerome",
      "Benoit Dherin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.06985",
    "title": "Engineering Design Knowledge Graphs from Patented Artefact Descriptions  for Retrieval-Augmented Generation in the Design Process",
    "abstract": " Title: Engineering Design Knowledge Graphs from Patented Artefact Descriptions  for Retrieval-Augmented Generation in the Design Process ",
    "url": "https://arxiv.org/abs/2307.06985",
    "authors": [
      "L Siddharth",
      "Jianxi Luo"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Databases (cs.DB)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2307.13492",
    "title": "NormAUG: Normalization-guided Augmentation for Domain Generalization",
    "abstract": " Comments: Accepted by IEEE Transactions on Image Processing (TIP) ",
    "url": "https://arxiv.org/abs/2307.13492",
    "authors": [
      "Lei Qi",
      "Hongpeng Yang",
      "Yinghuan Shi",
      "Xin Geng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2307.16120",
    "title": "Deep Unrolling Networks with Recurrent Momentum Acceleration for  Nonlinear Inverse Problems",
    "abstract": " Title: Deep Unrolling Networks with Recurrent Momentum Acceleration for  Nonlinear Inverse Problems ",
    "url": "https://arxiv.org/abs/2307.16120",
    "authors": [
      "Qingping Zhou",
      "Jiayu Qian",
      "Junqi Tang",
      "Jinglai Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2307.16545",
    "title": "Towards General Visual-Linguistic Face Forgery Detection",
    "abstract": " Title: Towards General Visual-Linguistic Face Forgery Detection ",
    "url": "https://arxiv.org/abs/2307.16545",
    "authors": [
      "Ke Sun",
      "Shen Chen",
      "Taiping Yao",
      "Haozhe Yang",
      "Xiaoshuai Sun",
      "Shouhong Ding",
      "Rongrong Ji"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2308.01070",
    "title": "When Analytic Calculus Cracks AdaBoost Code",
    "abstract": " Comments: 9 pages, 1 figure ",
    "url": "https://arxiv.org/abs/2308.01070",
    "authors": [
      "Jean-Marc Brossier",
      "Olivier Lafitte",
      "Lenny Réthoré"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.05869",
    "title": "Shared Memory-contention-aware Concurrent DNN Execution for Diversely  Heterogeneous System-on-Chips",
    "abstract": " Title: Shared Memory-contention-aware Concurrent DNN Execution for Diversely  Heterogeneous System-on-Chips ",
    "url": "https://arxiv.org/abs/2308.05869",
    "authors": [
      "Ismet Dagli",
      "Mehmet Belviranli"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Artificial Intelligence (cs.AI)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2309.01775",
    "title": "Gated recurrent neural networks discover attention",
    "abstract": " Title: Gated recurrent neural networks discover attention ",
    "url": "https://arxiv.org/abs/2309.01775",
    "authors": [
      "Nicolas Zucchet",
      "Seijin Kobayashi",
      "Yassir Akram",
      "Johannes von Oswald",
      "Maxime Larcher",
      "Angelika Steger",
      "João Sacramento"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2309.08030",
    "title": "AV2Wav: Diffusion-Based Re-synthesis from Continuous Self-supervised  Features for Audio-Visual Speech Enhancement",
    "abstract": " Comments: ICASSP 2024 ",
    "url": "https://arxiv.org/abs/2309.08030",
    "authors": [
      "Ju-Chieh Chou",
      "Chung-Ming Chien",
      "Karen Livescu"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2309.09668",
    "title": "DFormer: Rethinking RGBD Representation Learning for Semantic  Segmentation",
    "abstract": " Comments: Accepted by ICLR 2024 ",
    "url": "https://arxiv.org/abs/2309.09668",
    "authors": [
      "Bowen Yin",
      "Xuying Zhang",
      "Zhongyu Li",
      "Li Liu",
      "Ming-Ming Cheng",
      "Qibin Hou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2309.16825",
    "title": "FENDA-FL: Personalized Federated Learning on Heterogeneous Clinical  Datasets",
    "abstract": " Comments: 23 pages, 5 figures, 11 tables, 1 algorithm Update includes a significant number of new experiments, a new format, and additional results ",
    "url": "https://arxiv.org/abs/2309.16825",
    "authors": [
      "Fatemeh Tavakoli",
      "D.B. Emerson",
      "Sana Ayromlou",
      "John Jewell",
      "Amrit Krishnan",
      "Yuchong Zhang",
      "Amol Verma",
      "Fahad Razak"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.03272",
    "title": "Network Alignment with Transferable Graph Autoencoders",
    "abstract": " Title: Network Alignment with Transferable Graph Autoencoders ",
    "url": "https://arxiv.org/abs/2310.03272",
    "authors": [
      "Jiashu He",
      "Charilaos I. Kanatsoulis",
      "Alejandro Ribeiro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.08320",
    "title": "Defending Our Privacy With Backdoors",
    "abstract": " Comments: 18 pages, 11 figures ",
    "url": "https://arxiv.org/abs/2310.08320",
    "authors": [
      "Dominik Hintersdorf",
      "Lukas Struppek",
      "Daniel Neider",
      "Kristian Kersting"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.09943",
    "title": "Evaluating Robustness of Visual Representations for Object Assembly Task  Requiring Spatio-Geometrical Reasoning",
    "abstract": " Title: Evaluating Robustness of Visual Representations for Object Assembly Task  Requiring Spatio-Geometrical Reasoning ",
    "url": "https://arxiv.org/abs/2310.09943",
    "authors": [
      "Chahyon Ku",
      "Carl Winge",
      "Ryan Diaz",
      "Wentao Yuan",
      "Karthik Desingh"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2311.01222",
    "title": "Image Reflection on Process Graphs -- A Novel Approach for the  Completeness of an Axiomatization of 1-Free Regular Expressions Modulo  Bisimilarity",
    "abstract": " Comments: Minor typos and further polishing from the reviewers' comments of the conference that rejected us ",
    "url": "https://arxiv.org/abs/2311.01222",
    "authors": [
      "Yuanrui Zhang",
      "Xinxin Liu"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)",
      "Formal Languages and Automata Theory (cs.FL)"
    ]
  },
  {
    "id": "arXiv:2311.06650",
    "title": "Heuristic Optimal Transport in Branching Networks",
    "abstract": " Comments: Accepted in Int. J. Mod. Phys. C, 11 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2311.06650",
    "authors": [
      "M. Andrecut"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.06918",
    "title": "Resource-Aware Hierarchical Federated Learning for Video Caching in  Wireless Networks",
    "abstract": " Comments: Accepted for publication in IEEE ICC 2024. \\c{opyright} 2024 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses ",
    "url": "https://arxiv.org/abs/2311.06918",
    "authors": [
      "Md Ferdous Pervej",
      "Andreas F Molisch"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.06973",
    "title": "Analytical Verification of Deep Neural Network Performance for  Time-Synchronized Distribution System State Estimation",
    "abstract": " Comments: 8 pages, in Journal of Modern Power Systems and Clean Energy, 2023 ",
    "url": "https://arxiv.org/abs/2311.06973",
    "authors": [
      "Behrouz Azimian",
      "Shiva Moshtagh",
      "Anamitra Pal",
      "Shanshan Ma"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.12568",
    "title": "The $β$ Maps: Strong Clustering and Distribution Results on the  Complex Unit Circle",
    "abstract": " Title: The $β$ Maps: Strong Clustering and Distribution Results on the  Complex Unit Circle ",
    "url": "https://arxiv.org/abs/2311.12568",
    "authors": [
      "Alec Schiavoni Piazza",
      "David Meadon",
      "Stefano Serra-Capizzano"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2312.01538",
    "title": "Recurrent Distance Filtering for Graph Representation Learning",
    "abstract": " Title: Recurrent Distance Filtering for Graph Representation Learning ",
    "url": "https://arxiv.org/abs/2312.01538",
    "authors": [
      "Yuhui Ding",
      "Antonio Orvieto",
      "Bobby He",
      "Thomas Hofmann"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2312.05596",
    "title": "Factorized Explainer for Graph Neural Networks",
    "abstract": " Comments: AAAI 24 ",
    "url": "https://arxiv.org/abs/2312.05596",
    "authors": [
      "Rundong Huang",
      "Farhad Shirani",
      "Dongsheng Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.07266",
    "title": "ProxyDet: Synthesizing Proxy Novel Classes via Classwise Mixup for  Open-Vocabulary Object Detection",
    "abstract": " Comments: Accepted in AAAI24 ",
    "url": "https://arxiv.org/abs/2312.07266",
    "authors": [
      "Joonhyun Jeong",
      "Geondo Park",
      "Jayeon Yoo",
      "Hyungsik Jung",
      "Heesu Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.11549",
    "title": "Label-Free Multivariate Time Series Anomaly Detection",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2208.02108 ",
    "url": "https://arxiv.org/abs/2312.11549",
    "authors": [
      "Qihang Zhou",
      "Shibo He",
      "Haoyu Liu",
      "Jiming Chen",
      "Wenchao Meng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.13768",
    "title": "Modeling Interference from Millimeter Wave and Terahertz Bands  Cross-links in Low Earth Orbit Satellite Networks for 6G and Beyond",
    "abstract": " Comments: 16 pages, 10 Figures, 2 Tables. The work has been accepted for publication in IEEE Journal on Selected Areas in Communications (JSAC), 2024. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2312.13768",
    "authors": [
      "Sergi Aliaga",
      "Vitaly Petrov",
      "Josep M. Jornet"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2312.17552",
    "title": "Exploring Deep Reinforcement Learning for Robust Target Tracking using  Micro Aerial Vehicles",
    "abstract": " Title: Exploring Deep Reinforcement Learning for Robust Target Tracking using  Micro Aerial Vehicles ",
    "url": "https://arxiv.org/abs/2312.17552",
    "authors": [
      "Alberto Dionigi",
      "Mirko Leomanni",
      "Alessandro Saviolo",
      "Giuseppe Loianno",
      "Gabriele Costante"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2401.06704",
    "title": "Scalable 3D Panoptic Segmentation As Superpoint Graph Clustering",
    "abstract": " Comments: Accepted at 3DV 2024, Oral presentation ",
    "url": "https://arxiv.org/abs/2401.06704",
    "authors": [
      "Damien Robert",
      "Hugo Raguet",
      "Loic Landrieu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2401.10034",
    "title": "Evolutionary Computation in the Era of Large Language Model: Survey and  Roadmap",
    "abstract": " Comments: evolutionary algorithm (EA), large language model (LLM), optimization problem, prompt optimization, architecture search, code generation ",
    "url": "https://arxiv.org/abs/2401.10034",
    "authors": [
      "Xingyu Wu",
      "Sheng-hao Wu",
      "Jibin Wu",
      "Liang Feng",
      "Kay Chen Tan"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2401.10664",
    "title": "PTPsec: Securing the Precision Time Protocol Against Time Delay Attacks  Using Cyclic Path Asymmetry Analysis",
    "abstract": " Comments: Accepted at INFOCOM24 ",
    "url": "https://arxiv.org/abs/2401.10664",
    "authors": [
      "Andreas Finkenzeller",
      "Oliver Butowski",
      "Emanuel Regnath",
      "Mohammad Hamad",
      "Sebastian Steinhorst"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2401.14694",
    "title": "TA-RNN: an Attention-based Time-aware Recurrent Neural Network  Architecture for Electronic Health Records",
    "abstract": " Title: TA-RNN: an Attention-based Time-aware Recurrent Neural Network  Architecture for Electronic Health Records ",
    "url": "https://arxiv.org/abs/2401.14694",
    "authors": [
      "Mohammad Al Olaimat",
      "Serdar Bozdag"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2401.15604",
    "title": "Neural Network-Based Score Estimation in Diffusion Models: Optimization  and Generalization",
    "abstract": " Comments: 38 pages ",
    "url": "https://arxiv.org/abs/2401.15604",
    "authors": [
      "Yinbin Han",
      "Meisam Razaviyayn",
      "Renyuan Xu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.01697",
    "title": "APT-Pipe: An Automatic Prompt-Tuning Tool for Social Computing Data  Annotation",
    "abstract": " Comments: Just accepted by WWW 2024 ",
    "url": "https://arxiv.org/abs/2402.01697",
    "authors": [
      "Yiming Zhu",
      "Zhizhuo Yin",
      "Ehsan-Ul Haq",
      "Lik-Hang Lee",
      "Gareth Tyson",
      "Pan Hui"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2402.01729",
    "title": "Contextualization Distillation from Large Language Model for Knowledge  Graph Completion",
    "abstract": " Comments: Accepted by EACL 2024 findings v2: revise the citation problem ",
    "url": "https://arxiv.org/abs/2402.01729",
    "authors": [
      "Dawei Li",
      "Zhen Tan",
      "Tianlong Chen",
      "Huan Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2402.01995",
    "title": "Online Uniform Risk Times Sampling: First Approximation Algorithms,  Learning Augmentation with Full Confidence Interval Integration",
    "abstract": " Title: Online Uniform Risk Times Sampling: First Approximation Algorithms,  Learning Augmentation with Full Confidence Interval Integration ",
    "url": "https://arxiv.org/abs/2402.01995",
    "authors": [
      "Xueqing Liu",
      "Kyra Gan",
      "Esmaeil Keyvanshokooh",
      "Susan Murphy"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2402.02205",
    "title": "GPT-4V as Traffic Assistant: An In-depth Look at Vision Language Model  on Complex Traffic Events",
    "abstract": " Title: GPT-4V as Traffic Assistant: An In-depth Look at Vision Language Model  on Complex Traffic Events ",
    "url": "https://arxiv.org/abs/2402.02205",
    "authors": [
      "Xingcheng Zhou",
      "Alois C. Knoll"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.02216",
    "title": "Graph Foundation Models",
    "abstract": " Comments: 18 pages, 2 figures ",
    "url": "https://arxiv.org/abs/2402.02216",
    "authors": [
      "Haitao Mao",
      "Zhikai Chen",
      "Wenzhuo Tang",
      "Jianan Zhao",
      "Yao Ma",
      "Tong Zhao",
      "Neil Shah",
      "Mikhail Galkin",
      "Jiliang Tang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.02692",
    "title": "Statistical Guarantees for Link Prediction using Graph Neural Networks",
    "abstract": " Title: Statistical Guarantees for Link Prediction using Graph Neural Networks ",
    "url": "https://arxiv.org/abs/2402.02692",
    "authors": [
      "Alan Chung",
      "Amin Saberi",
      "Morgane Austern"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)",
      "Statistics Theory (math.ST)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2402.02910",
    "title": "DS-MS-TCN: Otago Exercises Recognition with a Dual-Scale Multi-Stage  Temporal Convolutional Network",
    "abstract": " Title: DS-MS-TCN: Otago Exercises Recognition with a Dual-Scale Multi-Stage  Temporal Convolutional Network ",
    "url": "https://arxiv.org/abs/2402.02910",
    "authors": [
      "Meng Shang",
      "Lenore Dedeyne",
      "Jolan Dupont",
      "Laura Vercauteren",
      "Nadjia Amini",
      "Laurence Lapauw",
      "Evelien Gielen",
      "Sabine Verschueren",
      "Carolina Varon",
      "Walter De Raedt",
      "Bart Vanrumste"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2402.03292",
    "title": "Zero-shot Object-Level OOD Detection with Context-Aware Inpainting",
    "abstract": " Title: Zero-shot Object-Level OOD Detection with Context-Aware Inpainting ",
    "url": "https://arxiv.org/abs/2402.03292",
    "authors": [
      "Quang-Huy Nguyen",
      "Jin Peng Zhou",
      "Zhenzhen Liu",
      "Khanh-Huyen Bui",
      "Kilian Q. Weinberger",
      "Dung D. Le"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.03358",
    "title": "A Comprehensive Survey on Graph Reduction: Sparsification, Coarsening,  and Condensation",
    "abstract": " Comments: 16 pages, 3 tables, 2 figures ",
    "url": "https://arxiv.org/abs/2402.03358",
    "authors": [
      "Mohammad Hashemi",
      "Shengbo Gong",
      "Juntong Ni",
      "Wenqi Fan",
      "B. Aditya Prakash",
      "Wei Jin"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Data Structures and Algorithms (cs.DS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.03583",
    "title": "MQuinE: a cure for \"Z-paradox\" in knowledge graph embedding models",
    "abstract": " Comments: 18pages, 1 figure ",
    "url": "https://arxiv.org/abs/2402.03583",
    "authors": [
      "Yang Liu",
      "Huang Fang",
      "Yunfeng Cai",
      "Mingming Sun"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2402.03697",
    "title": "SHMC-Net: A Mask-guided Feature Fusion Network for Sperm Head Morphology  Classification",
    "abstract": " Comments: A shorter version is published on ISBI 2024 ",
    "url": "https://arxiv.org/abs/2402.03697",
    "authors": [
      "Nishchal Sapkota",
      "Yejia Zhang",
      "Sirui Li",
      "Peixian Liang",
      "Zhuo Zhao",
      "Danny Z Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2402.03760",
    "title": "DeMarking: A Defense for Network Flow Watermarking in Real-Time",
    "abstract": " Title: DeMarking: A Defense for Network Flow Watermarking in Real-Time ",
    "url": "https://arxiv.org/abs/2402.03760",
    "authors": [
      "Yali Yuan",
      "Jian Ge",
      "Guang Cheng"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2402.03784",
    "title": "AirPhyNet: Harnessing Physics-Guided Neural Networks for Air Quality  Prediction",
    "abstract": " Comments: Accepted by the 12th International Conference on Learning Representations (ICLR 2024) ",
    "url": "https://arxiv.org/abs/2402.03784",
    "authors": [
      "Kethmi Hirushini Hettige",
      "Jiahao Ji",
      "Shili Xiang",
      "Cheng Long",
      "Gao Cong",
      "Jingyuan Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Applied Physics (physics.app-ph)"
    ]
  },
  {
    "id": "arXiv:2402.03979",
    "title": "Cross Entropy versus Label Smoothing: A Neural Collapse Perspective",
    "abstract": " Title: Cross Entropy versus Label Smoothing: A Neural Collapse Perspective ",
    "url": "https://arxiv.org/abs/2402.03979",
    "authors": [
      "Li Guo",
      "Keith Ross",
      "Zifan Zhao",
      "George Andriopoulos",
      "Shuyang Ling",
      "Yufeng Xu",
      "Zixuan Dong"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  }
]