[
  {
    "id": "arXiv:2304.01205",
    "title": "When Evolutionary Computation Meets Privacy",
    "abstract": "Recently, evolutionary computation (EC) has been promoted by machine learning, distributed computing, and big data technologies, resulting in new research directions of EC like distributed EC and surrogate-assisted EC. These advances have significantly improved the performance and the application scope of EC, but also trigger privacy leakages, such as the leakage of optimal results and surrogate model. Accordingly, evolutionary computation combined with privacy protection is becoming an emerging topic. However, privacy concerns in evolutionary computation lack a systematic exploration, especially for the object, motivation, position, and method of privacy protection. To this end, in this paper, we discuss three typical optimization paradigms (i.e., \\textit{centralized optimization, distributed optimization, and data-driven optimization}) to characterize optimization modes of evolutionary computation and propose BOOM to sort out privacy concerns in evolutionary computation. Specifically, the centralized optimization paradigm allows clients to outsource optimization problems to the centralized server and obtain optimization solutions from the server. While the distributed optimization paradigm exploits the storage and computational power of distributed devices to solve optimization problems. Also, the data-driven optimization paradigm utilizes data collected in history to tackle optimization problems lacking explicit objective functions. Particularly, this paper adopts BOOM to characterize the object and motivation of privacy protection in three typical optimization paradigms and discusses potential privacy-preserving technologies balancing optimization performance and privacy guarantees in three typical optimization paradigms. Furthermore, this paper attempts to foresee some new research directions of privacy-preserving evolutionary computation. ",
    "url": "https://arxiv.org/abs/2304.01205",
    "authors": [
      "Bowen Zhao",
      "Wei-Neng Chen",
      "Xiaoguo Li",
      "Ximeng Liu",
      "Qingqi Pei",
      "Jun Zhang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.01212",
    "title": "Robustness of Complex Networks Considering Load and Cascading Failure  under Edge-removal Attack",
    "abstract": "In the understanding of important edges in complex networks, the edges with larger degree are naturally considered more important, and they will cause greater destructiveness when attacked. However, through simulation analysis, we conclude that this understanding needs to be based on certain preconditions. In this article, the robustness of BA scale-free network and WS small-world network is studied based on the edge-removal attack strategy considering the edge load and cascading failure. Specific attack methods include: High Load Edge-removal Attacks (HLEA) and Low Load Edge-removal Attacks (LLEA). The simulation results show that the importance of edges is closely related to the load parameter {\\delta}. When 0<{\\delta}<1, attacking the edge with smaller degree will cause greater cascading failure. For this condition, the edge with smaller degree is more important. When {\\delta}=1, cascading failure is basically independent of the edge degree. When {\\delta}>1, attacking the edge with larger degree will cause greater cascading failure. Therefore, the edge with larger degree is more important for this condition. ",
    "url": "https://arxiv.org/abs/2304.01212",
    "authors": [
      "Peng Geng",
      "Huizhen Hao",
      "Annan Yang",
      "Yan Liu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.01214",
    "title": "Parkinsons Disease Detection via Resting-State Electroencephalography  Using Signal Processing and Machine Learning Techniques",
    "abstract": "Parkinsons Disease (PD) is a neurodegenerative disorder resulting in motor deficits due to advancing degeneration of dopaminergic neurons. PD patients report experiencing tremor, rigidity, visual impairment, bradykinesia, and several cognitive deficits. Although Electroencephalography (EEG) indicates abnormalities in PD patients, one major challenge is the lack of a consistent, accurate, and systemic biomarker for PD in order to closely monitor the disease with therapeutic treatments and medication. In this study, we collected Electroencephalographic data from 15 PD patients and 16 Healthy Controls (HC). We first preprocessed every EEG signal using several techniques and extracted relevant features using many feature extraction algorithms. Afterwards, we applied several machine learning algorithms to classify PD versus HC. We found the most significant metrics to be achieved by the Random Forest ensemble learning approach, with an accuracy, precision, recall, F1 score, and AUC of 97.5%, 100%, 95%, 0.967, and 0.975, respectively. The results of this study show promise for exposing PD abnormalities using EEG during clinical diagnosis, and automating this process using signal processing techniques and ML algorithms to evaluate the difference between healthy individuals and PD patients. ",
    "url": "https://arxiv.org/abs/2304.01214",
    "authors": [
      "Krish Desai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2304.01222",
    "title": "NeuroDAVIS: A neural network model for data visualization",
    "abstract": "The task of dimensionality reduction and visualization of high-dimensional datasets remains a challenging problem since long. Modern high-throughput technologies produce newer high-dimensional datasets having multiple views with relatively new data types. Visualization of these datasets require proper methodology that can uncover hidden patterns in the data without affecting the local and global structures within the data. To this end, however, very few such methodology exist, which can realise this task. In this work, we have introduced a novel unsupervised deep neural network model, called NeuroDAVIS, for data visualization. NeuroDAVIS is capable of extracting important features from the data, without assuming any data distribution, and visualize effectively in lower dimension. It has been shown theoritically that neighbourhood relationship of the data in high dimension remains preserved in lower dimension. The performance of NeuroDAVIS has been evaluated on a wide variety of synthetic and real high-dimensional datasets including numeric, textual, image and biological data. NeuroDAVIS has been highly competitive against both t-Distributed Stochastic Neighbor Embedding (t-SNE) and Uniform Manifold Approximation and Projection (UMAP) with respect to visualization quality, and preservation of data size, shape, and both local and global structure. It has outperformed Fast interpolation-based t-SNE (Fit-SNE), a variant of t-SNE, for most of the high-dimensional datasets as well. For the biological datasets, besides t-SNE, UMAP and Fit-SNE, NeuroDAVIS has also performed well compared to other state-of-the-art algorithms, like Potential of Heat-diffusion for Affinity-based Trajectory Embedding (PHATE) and the siamese neural network-based method, called IVIS. Downstream classification and clustering analyses have also revealed favourable results for NeuroDAVIS-generated embeddings. ",
    "url": "https://arxiv.org/abs/2304.01222",
    "authors": [
      "Chayan Maitra",
      "Dibyendu B. Seal",
      "Rajat K. De"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01225",
    "title": "A greedy approach for increased vehicle utilization in ridesharing  networks",
    "abstract": "In recent years, ridesharing platforms have become a prominent mode of transportation for the residents of urban areas. As a fundamental problem, route recommendation for these platforms is vital for their sustenance. The works done in this direction have recommended routes with higher passenger demand. Despite the existing works, statistics have suggested that these services cause increased greenhouse emissions compared to private vehicles as they roam around in search of riders. This analysis provides finer details regarding the functionality of ridesharing systems and it reveals that in the face of their boom, they have not utilized the vehicle capacity efficiently. We propose to overcome the above limitations and recommend routes that will fetch multiple passengers simultaneously which will result in increased vehicle utilization and thereby decrease the effect of these systems on the environment. As route recommendation is NP-hard, we propose a k-hop-based sliding window approximation algorithm that reduces the search space from entire road network to a window. We further demonstrate that maximizing expected demand is submodular and greedy algorithms can be used to optimize our objective function within a window. We evaluate our proposed model on real-world datasets and experimental results demonstrate superior performance by our proposed model. ",
    "url": "https://arxiv.org/abs/2304.01225",
    "authors": [
      "Aqsa Ashraf Makhdomi",
      "Iqra Altaf Gillani"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Computers and Society (cs.CY)",
      "Information Retrieval (cs.IR)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.01226",
    "title": "Abnormal Event Detection via Hypergraph Contrastive Learning",
    "abstract": "Abnormal event detection, which refers to mining unusual interactions among involved entities, plays an important role in many real applications. Previous works mostly over-simplify this task as detecting abnormal pair-wise interactions. However, real-world events may contain multi-typed attributed entities and complex interactions among them, which forms an Attributed Heterogeneous Information Network (AHIN). With the boom of social networks, abnormal event detection in AHIN has become an important, but seldom explored task. In this paper, we firstly study the unsupervised abnormal event detection problem in AHIN. The events are considered as star-schema instances of AHIN and are further modeled by hypergraphs. A novel hypergraph contrastive learning method, named AEHCL, is proposed to fully capture abnormal event patterns. AEHCL designs the intra-event and inter-event contrastive modules to exploit self-supervised AHIN information. The intra-event contrastive module captures the pair-wise and multivariate interaction anomalies within an event, and the inter-event module captures the contextual anomalies among events. These two modules collaboratively boost the performance of each other and improve the detection results. During the testing phase, a contrastive learning-based abnormal event score function is further proposed to measure the abnormality degree of events. Extensive experiments on three datasets in different scenarios demonstrate the effectiveness of AEHCL, and the results improve state-of-the-art baselines up to 12.0% in Average Precision (AP) and 4.6% in Area Under Curve (AUC) respectively. ",
    "url": "https://arxiv.org/abs/2304.01226",
    "authors": [
      "Bo Yan",
      "Cheng Yang",
      "Chuan Shi",
      "Jiawei Liu",
      "Xiaochen Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01227",
    "title": "Resolution-Invariant Image Classification based on Fourier Neural  Operators",
    "abstract": "In this paper we investigate the use of Fourier Neural Operators (FNOs) for image classification in comparison to standard Convolutional Neural Networks (CNNs). Neural operators are a discretization-invariant generalization of neural networks to approximate operators between infinite dimensional function spaces. FNOs - which are neural operators with a specific parametrization - have been applied successfully in the context of parametric PDEs. We derive the FNO architecture as an example for continuous and Fr\\'echet-differentiable neural operators on Lebesgue spaces. We further show how CNNs can be converted into FNOs and vice versa and propose an interpolation-equivariant adaptation of the architecture. ",
    "url": "https://arxiv.org/abs/2304.01227",
    "authors": [
      "Samira Kabri",
      "Tim Roith",
      "Daniel Tenbrinck",
      "Martin Burger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2304.01228",
    "title": "Better Language Models of Code through Self-Improvement",
    "abstract": "Pre-trained language models for code (PLMCs) have gained attention in recent research. These models are pre-trained on large-scale datasets using multi-modal objectives. However, fine-tuning them requires extensive supervision and is limited by the size of the dataset provided. We aim to improve this issue by proposing a simple data augmentation framework. Our framework utilizes knowledge gained during the pre-training and fine-tuning stage to generate pseudo data, which is then used as training data for the next step. We incorporate this framework into the state-of-the-art language models, such as CodeT5, CodeBERT, and UnixCoder. The results show that our framework significantly improves PLMCs' performance in code-related sequence generation tasks, such as code summarization and code generation in the CodeXGLUE benchmark. ",
    "url": "https://arxiv.org/abs/2304.01228",
    "authors": [
      "Hung Quoc To",
      "Nghi D. Q. Bui",
      "Jin Guo",
      "Tien N. Nguyen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01230",
    "title": "SEENN: Towards Temporal Spiking Early-Exit Neural Networks",
    "abstract": "Spiking Neural Networks (SNNs) have recently become more popular as a biologically plausible substitute for traditional Artificial Neural Networks (ANNs). SNNs are cost-efficient and deployment-friendly because they process input in both spatial and temporal manners using binary spikes. However, we observe that the information capacity in SNNs is affected by the number of timesteps, leading to an accuracy-efficiency tradeoff. In this work, we study a fine-grained adjustment of the number of timesteps in SNNs. Specifically, we treat the number of timesteps as a variable conditioned on different input samples to reduce redundant timesteps for certain data. We call our method Spiking Early-Exit Neural Networks (SEENNs). To determine the appropriate number of timesteps, we propose SEENN-I which uses a confidence score thresholding to filter out the uncertain predictions, and SEENN-II which determines the number of timesteps by reinforcement learning. Moreover, we demonstrate that SEENN is compatible with both the directly trained SNN and the ANN-SNN conversion. By dynamically adjusting the number of timesteps, our SEENN achieves a remarkable reduction in the average number of timesteps during inference. For example, our SEENN-II ResNet-19 can achieve 96.1% accuracy with an average of 1.08 timesteps on the CIFAR-10 test dataset. ",
    "url": "https://arxiv.org/abs/2304.01230",
    "authors": [
      "Yuhang Li",
      "Tamar Geller",
      "Youngeun Kim",
      "Priyadarshini Panda"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01233",
    "title": "Multi-Modal Perceiver Language Model for Outcome Prediction in Emergency  Department",
    "abstract": "Language modeling have shown impressive progress in generating compelling text with good accuracy and high semantic coherence. An interesting research direction is to augment these powerful models for specific applications using contextual information. In this work, we explore multi-modal language modeling for healthcare applications. We are interested in outcome prediction and patient triage in hospital emergency department based on text information in chief complaints and vital signs recorded at triage. We adapt Perceiver - a modality-agnostic transformer-based model that has shown promising results in several applications. Since vital-sign modality is represented in tabular format, we modified Perceiver position encoding to ensure permutation invariance. We evaluated the multi-modal language model for the task of diagnosis code prediction using MIMIC-IV ED dataset on 120K visits. In the experimental analysis, we show that mutli-modality improves the prediction performance compared with models trained solely on text or vital signs. We identified disease categories for which multi-modality leads to performance improvement and show that for these categories, vital signs have added predictive power. By analyzing the cross-attention layer, we show how multi-modality contributes to model predictions. This work gives interesting insights on the development of multi-modal language models for healthcare applications. ",
    "url": "https://arxiv.org/abs/2304.01233",
    "authors": [
      "Sabri Boughorbel",
      "Fethi Jarray",
      "Abdulaziz Al Homaid",
      "Rashid Niaz",
      "Khalid Alyafei"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01235",
    "title": "Fair Evaluation of Graph Markov Neural Networks",
    "abstract": "Graph Markov Neural Networks (GMNN) have recently been proposed to improve regular graph neural networks (GNN) by including label dependencies into the semi-supervised node classification task. GMNNs do this in a theoretically principled way and use three kinds of information to predict labels. Just like ordinary GNNs, they use the node features and the graph structure but they moreover leverage information from the labels of neighboring nodes to improve the accuracy of their predictions. In this paper, we introduce a new dataset named WikiVitals which contains a graph of 48k mutually referred Wikipedia articles classified into 32 categories and connected by 2.3M edges. Our aim is to rigorously evaluate the contributions of three distinct sources of information to the prediction accuracy of GMNN for this dataset: the content of the articles, their connections with each other and the correlations among their labels. For this purpose we adapt a method which was recently proposed for performing fair comparisons of GNN performance using an appropriate randomization over partitions and a clear separation of model selection and model assessment. ",
    "url": "https://arxiv.org/abs/2304.01235",
    "authors": [
      "Pirmin Lemberger",
      "Antoine Saillenfest"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2304.01237",
    "title": "A Guide for Practical Use of ADMG Causal Data Augmentation",
    "abstract": "Data augmentation is essential when applying Machine Learning in small-data regimes. It generates new samples following the observed data distribution while increasing their diversity and variability to help researchers and practitioners improve their models' robustness and, thus, deploy them in the real world. Nevertheless, its usage in tabular data still needs to be improved, as prior knowledge about the underlying data mechanism is seldom considered, limiting the fidelity and diversity of the generated data. Causal data augmentation strategies have been pointed out as a solution to handle these challenges by relying on conditional independence encoded in a causal graph. In this context, this paper experimentally analyzed the ADMG causal augmentation method considering different settings to support researchers and practitioners in understanding under which conditions prior knowledge helps generate new data points and, consequently, enhances the robustness of their models. The results highlighted that the studied method (a) is independent of the underlying model mechanism, (b) requires a minimal number of observations that may be challenging in a small-data regime to improve an ML model's accuracy, (c) propagates outliers to the augmented set degrading the performance of the model, and (d) is sensitive to its hyperparameter's value. ",
    "url": "https://arxiv.org/abs/2304.01237",
    "authors": [
      "Poinsot Audrey",
      "Leite Alessandro"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2304.01238",
    "title": "Spam-T5: Benchmarking Large Language Models for Few-Shot Email Spam  Detection",
    "abstract": "This paper investigates the effectiveness of large language models (LLMs) in email spam detection by comparing prominent models from three distinct families: BERT-like, Sentence Transformers, and Seq2Seq. Additionally, we examine well-established machine learning techniques for spam detection, such as Na\\\"ive Bayes and LightGBM, as baseline methods. We assess the performance of these models across four public datasets, utilizing different numbers of training samples (full training set and few-shot settings). Our findings reveal that, in the majority of cases, LLMs surpass the performance of the popular baseline techniques, particularly in few-shot scenarios. This adaptability renders LLMs uniquely suited to spam detection tasks, where labeled samples are limited in number and models require frequent updates. Additionally, we introduce Spam-T5, a Flan-T5 model that has been specifically adapted and fine-tuned for the purpose of detecting email spam. Our results demonstrate that Spam-T5 surpasses baseline models and other LLMs in the majority of scenarios, particularly when there are a limited number of training samples available. Our code is publicly available at https://github.com/jpmorganchase/emailspamdetection. ",
    "url": "https://arxiv.org/abs/2304.01238",
    "authors": [
      "Maxime Labonne",
      "Sean Moran"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01241",
    "title": "Detection of Homophobia & Transphobia in Dravidian Languages: Exploring  Deep Learning Methods",
    "abstract": "The increase in abusive content on online social media platforms is impacting the social life of online users. Use of offensive and hate speech has been making so-cial media toxic. Homophobia and transphobia constitute offensive comments against LGBT+ community. It becomes imperative to detect and handle these comments, to timely flag or issue a warning to users indulging in such behaviour. However, automated detection of such content is a challenging task, more so in Dravidian languages which are identified as low resource languages. Motivated by this, the paper attempts to explore applicability of different deep learning mod-els for classification of the social media comments in Malayalam and Tamil lan-guages as homophobic, transphobic and non-anti-LGBT+content. The popularly used deep learning models- Convolutional Neural Network (CNN), Long Short Term Memory (LSTM) using GloVe embedding and transformer-based learning models (Multilingual BERT and IndicBERT) are applied to the classification problem. Results obtained show that IndicBERT outperforms the other imple-mented models, with obtained weighted average F1-score of 0.86 and 0.77 for Malayalam and Tamil, respectively. Therefore, the present work confirms higher performance of IndicBERT on the given task in selected Dravidian languages. ",
    "url": "https://arxiv.org/abs/2304.01241",
    "authors": [
      "Deepawali Sharma",
      "Vedika Gupta",
      "Vivek Kumar Singh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01242",
    "title": "Enhancing Clinical Evidence Recommendation with Multi-Channel  Heterogeneous Learning on Evidence Graphs",
    "abstract": "Clinical evidence encompasses the associations and impacts between patients, interventions (such as drugs or physiotherapy), problems, and outcomes. The goal of recommending clinical evidence is to provide medical practitioners with relevant information to support their decision-making processes and to generate new evidence. Our specific task focuses on recommending evidence based on clinical problems. However, the direct connections between certain clinical problems and related evidence are often sparse, creating a challenge of link sparsity. Additionally, to recommend appropriate evidence, it is essential to jointly exploit both topological relationships among evidence and textual information describing them. To address these challenges, we define two knowledge graphs: an Evidence Co-reference Graph and an Evidence Text Graph, to represent the topological and linguistic relations among evidential elements, respectively. We also introduce a multi-channel heterogeneous learning model and a fusional attention mechanism to handle the co-reference-text heterogeneity in evidence recommendation. Our experiments demonstrate that our model outperforms state-of-the-art methods on open data. ",
    "url": "https://arxiv.org/abs/2304.01242",
    "authors": [
      "Maolin Luo",
      "Xiang Zhang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01289",
    "title": "Monocular 3D Object Detection with Bounding Box Denoising in 3D by  Perceiver",
    "abstract": "The main challenge of monocular 3D object detection is the accurate localization of 3D center. Motivated by a new and strong observation that this challenge can be remedied by a 3D-space local-grid search scheme in an ideal case, we propose a stage-wise approach, which combines the information flow from 2D-to-3D (3D bounding box proposal generation with a single 2D image) and 3D-to-2D (proposal verification by denoising with 3D-to-2D contexts) in a top-down manner. Specifically, we first obtain initial proposals from off-the-shelf backbone monocular 3D detectors. Then, we generate a 3D anchor space by local-grid sampling from the initial proposals. Finally, we perform 3D bounding box denoising at the 3D-to-2D proposal verification stage. To effectively learn discriminative features for denoising highly overlapped proposals, this paper presents a method of using the Perceiver I/O model to fuse the 3D-to-2D geometric information and the 2D appearance information. With the encoded latent representation of a proposal, the verification head is implemented with a self-attention module. Our method, named as MonoXiver, is generic and can be easily adapted to any backbone monocular 3D detectors. Experimental results on the well-established KITTI dataset and the challenging large-scale Waymo dataset show that MonoXiver consistently achieves improvement with limited computation overhead. ",
    "url": "https://arxiv.org/abs/2304.01289",
    "authors": [
      "Xianpeng Liu",
      "Ce Zheng",
      "Kelvin Cheng",
      "Nan Xue",
      "Guo-Jun Qi",
      "Tianfu Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01293",
    "title": "Wearable Sensor-based Multimodal Physiological Responses of Socially  Anxious Individuals across Social Contexts",
    "abstract": "Correctly identifying an individual's social context from passively worn sensors holds promise for delivering just-in-time adaptive interventions (JITAIs) to treat social anxiety disorder. In this study, we present results using passively collected data from a within-subject experiment that assessed physiological response across different social contexts (i.e, alone vs. with others), social phases (i.e., pre- and post-interaction vs. during an interaction), social interaction sizes (i.e., dyadic vs. group interactions), and levels of social threat (i.e., implicit vs. explicit social evaluation). Participants in the study ($N=46$) reported moderate to severe social anxiety symptoms as assessed by the Social Interaction Anxiety Scale ($\\geq$34 out of 80). Univariate paired difference tests, multivariate random forest models, and follow-up cluster analyses were used to explore physiological response patterns across different social and non-social contexts. Our results suggest that social context is more reliably distinguishable than social phase, group size, or level of social threat, but that there is considerable variability in physiological response patterns even among these distinguishable contexts. Implications for real-world context detection and deployment of JITAIs are discussed. ",
    "url": "https://arxiv.org/abs/2304.01293",
    "authors": [
      "Emma R. Toner",
      "Mark Rucker",
      "Zhiyuan Wang",
      "Maria A. Larrazabal",
      "Lihua Cai",
      "Debajyoti Datta",
      "Elizabeth Thompson",
      "Haroon Lone",
      "Mehdi Boukhechba",
      "Bethany A. Teachman",
      "Laura E. Barnes"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.01311",
    "title": "Characterizing the Users, Challenges, and Visualization Needs of  Knowledge Graphs in Practice",
    "abstract": "This study presents insights from interviews with nineteen Knowledge Graph (KG) practitioners who work in both enterprise and academic settings on a wide variety of use cases. Through this study, we identify critical challenges experienced by KG practitioners when creating, exploring, and analyzing KGs that could be alleviated through visualization design. Our findings reveal three major personas among KG practitioners - KG Builders, Analysts, and Consumers - each of whom have their own distinct expertise and needs. We discover that KG Builders would benefit from schema enforcers, while KG Analysts need customizable query builders that provide interim query results. For KG Consumers, we identify a lack of efficacy for node-link diagrams, and the need for tailored domain-specific visualizations to promote KG adoption and comprehension. Lastly, we find that implementing KGs effectively in practice requires both technical and social solutions that are not addressed with current tools, technologies, and collaborative workflows. From the analysis of our interviews, we distill several visualization research directions to improve KG usability, including knowledge cards that balance digestibility and discoverability, timeline views to track temporal changes, interfaces that support organic discovery, and semantic explanations for AI and machine learning predictions. ",
    "url": "https://arxiv.org/abs/2304.01311",
    "authors": [
      "Harry Li",
      "Gabriel Appleby",
      "Camelia Daniela Brumar",
      "Remco Chang",
      "Ashley Suh"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Databases (cs.DB)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01334",
    "title": "Clustering Social Touch Gestures for Human-Robot Interaction",
    "abstract": "Social touch provides a rich non-verbal communication channel between humans and robots. Prior work has identified a set of touch gestures for human-robot interaction and described them with natural language labels (e.g., stroking, patting). Yet, no data exists on the semantic relationships between the touch gestures in users' minds. To endow robots with touch intelligence, we investigated how people perceive the similarities of social touch labels from the literature. In an online study, 45 participants grouped 36 social touch labels based on their perceived similarities and annotated their groupings with descriptive names. We derived quantitative similarities of the gestures from these groupings and analyzed the similarities using hierarchical clustering. The analysis resulted in 9 clusters of touch gestures formed around the social, emotional, and contact characteristics of the gestures. We discuss the implications of our results for designing and evaluating touch sensing and interactions with social robots. ",
    "url": "https://arxiv.org/abs/2304.01334",
    "authors": [
      "Ramzi Abou Chahine",
      "Steven Vasquez",
      "Pooyan Fazli",
      "Hasti Seifi"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.01351",
    "title": "Accelerated parallel MRI using memory efficient and robust monotone  operator learning (MOL)",
    "abstract": "Model-based deep learning methods that combine imaging physics with learned regularization priors have been emerging as powerful tools for parallel MRI acceleration. The main focus of this paper is to determine the utility of the monotone operator learning (MOL) framework in the parallel MRI setting. The MOL algorithm alternates between a gradient descent step using a monotone convolutional neural network (CNN) and a conjugate gradient algorithm to encourage data consistency. The benefits of this approach include similar guarantees as compressive sensing algorithms including uniqueness, convergence, and stability, while being significantly more memory efficient than unrolled methods. We validate the proposed scheme by comparing it with different unrolled algorithms in the context of accelerated parallel MRI for static and dynamic settings. ",
    "url": "https://arxiv.org/abs/2304.01351",
    "authors": [
      "Aniket Pramanik",
      "Mathews Jacob"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.01352",
    "title": "A Simple and Effective Method of Cross-Lingual Plagiarism Detection",
    "abstract": "We present a simple cross-lingual plagiarism detection method applicable to a large number of languages. The presented approach leverages open multilingual thesauri for candidate retrieval task and pre-trained multilingual BERT-based language models for detailed analysis. The method does not rely on machine translation and word sense disambiguation when in use, and therefore is suitable for a large number of languages, including under-resourced languages. The effectiveness of the proposed approach is demonstrated for several existing and new benchmarks, achieving state-of-the-art results for French, Russian, and Armenian languages. ",
    "url": "https://arxiv.org/abs/2304.01352",
    "authors": [
      "Karen Avetisyan",
      "Arthur Malajyan",
      "Tsolak Ghukasyan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2304.01354",
    "title": "Functional Knowledge Transfer with Self-supervised Representation  Learning",
    "abstract": "This work investigates the unexplored usability of self-supervised representation learning in the direction of functional knowledge transfer. In this work, functional knowledge transfer is achieved by joint optimization of self-supervised learning pseudo task and supervised learning task, improving supervised learning task performance. Recent progress in self-supervised learning uses a large volume of data, which becomes a constraint for its applications on small-scale datasets. This work shares a simple yet effective joint training framework that reinforces human-supervised task learning by learning self-supervised representations just-in-time and vice versa. Experiments on three public datasets from different visual domains, Intel Image, CIFAR, and APTOS, reveal a consistent track of performance improvements on classification tasks during joint optimization. Qualitative analysis also supports the robustness of learnt representations. Source code and trained models are available on GitHub. ",
    "url": "https://arxiv.org/abs/2304.01354",
    "authors": [
      "Prakash Chandra Chhipa",
      "Muskan Chopra",
      "Gopal Mengi",
      "Varun Gupta",
      "Richa Upadhyay",
      "Meenakshi Subhash Chippa",
      "Kanjar De",
      "Rajkumar Saini",
      "Seiichi Uchida",
      "Marcus Liwicki"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01366",
    "title": "Enabling A Network AI Gym for Autonomous Cyber Agents",
    "abstract": "This work aims to enable autonomous agents for network cyber operations (CyOps) by applying reinforcement and deep reinforcement learning (RL/DRL). The required RL training environment is particularly challenging, as it must balance the need for high-fidelity, best achieved through real network emulation, with the need for running large numbers of training episodes, best achieved using simulation. A unified training environment, namely the Cyber Gym for Intelligent Learning (CyGIL) is developed where an emulated CyGIL-E automatically generates a simulated CyGIL-S. From preliminary experimental results, CyGIL-S is capable to train agents in minutes compared with the days required in CyGIL-E. The agents trained in CyGIL-S are transferrable directly to CyGIL-E showing full decision proficiency in the emulated \"real\" network. Enabling offline RL, the CyGIL solution presents a promising direction towards sim-to-real for leveraging RL agents in real-world cyber networks. ",
    "url": "https://arxiv.org/abs/2304.01366",
    "authors": [
      "Li Li",
      "Jean-Pierre S. El Rami",
      "Adrian Taylor",
      "James Hailing Rao",
      "Thomas Kunz"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01376",
    "title": "Faulty Branch Identification in Passive Optical Networks using Machine  Learning",
    "abstract": "Passive optical networks (PONs) have become a promising broadband access network solution. To ensure a reliable transmission, and to meet service level agreements, PON systems have to be monitored constantly in order to quickly identify and localize networks faults. Typically, a service disruption in a PON system is mainly due to fiber cuts and optical network unit (ONU) transmitter/receiver failures. When the ONUs are located at different distances from the optical line terminal (OLT), the faulty ONU or branch can be identified by analyzing the recorded optical time domain reflectometry (OTDR) traces. However, faulty branch isolation becomes very challenging when the reflections originating from two or more branches with similar length overlap, which makes it very hard to discriminate the faulty branches given the global backscattered signal. Recently, machine learning (ML) based approaches have shown great potential for managing optical faults in PON systems. Such techniques perform well when trained and tested with data derived from the same PON system. But their performance may severely degrade, if the PON system (adopted for the generation of the training data) has changed, e.g. by adding more branches or varying the length difference between two neighboring branches. etc. A re-training of the ML models has to be conducted for each network change, which can be time consuming. In this paper, to overcome the aforementioned issues, we propose a generic ML approach trained independently of the network architecture for identifying the faulty branch in PON systems given OTDR signals for the cases of branches with close lengths. Such an approach can be applied to an arbitrary PON system without requiring to be re-trained for each change of the network. The proposed approach is validated using experimental data derived from PON system. ",
    "url": "https://arxiv.org/abs/2304.01376",
    "authors": [
      "Khouloud Abdelli",
      "Carsten Tropschug",
      "Helmut Griesser",
      "Stephan Pachnicke"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.01424",
    "title": "Polarity based Sarcasm Detection using Semigraph",
    "abstract": "Sarcasm is an advanced linguistic expression often found on various online platforms. Sarcasm detection is challenging in natural language processing tasks that affect sentiment analysis. This article presents the inventive method of the semigraph, including semigraph construction and sarcasm detection processes. A variation of the semigraph is suggested in the pattern-relatedness of the text document. The proposed method is to obtain the sarcastic and non-sarcastic polarity scores of a document using a semigraph. The sarcastic polarity score represents the possibility that a document will become sarcastic. Sarcasm is detected based on the polarity scoring model. The performance of the proposed model enhances the existing prior art approach to sarcasm detection. In the Amazon product review, the model achieved the accuracy, recall, and f-measure of 0.87, 0.79, and 0.83, respectively. ",
    "url": "https://arxiv.org/abs/2304.01424",
    "authors": [
      "Swapnil Mane",
      "Vaibhav Khatavkar"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.01428",
    "title": "Learned Tree Search for Long-Horizon Social Robot Navigation in Shared  Airspace",
    "abstract": "The fast-growing demand for fully autonomous aerial operations in shared spaces necessitates developing trustworthy agents that can safely and seamlessly navigate in crowded, dynamic spaces. In this work, we propose Social Robot Tree Search (SoRTS), an algorithm for the safe navigation of mobile robots in social domains. SoRTS aims to augment existing socially-aware trajectory prediction policies with a Monte Carlo Tree Search planner for improved downstream navigation of mobile robots. To evaluate the performance of our method, we choose the use case of social navigation for general aviation. To aid this evaluation, within this work, we also introduce X-PlaneROS, a high-fidelity aerial simulator, to enable more research in full-scale aerial autonomy. By conducting a user study based on the assessments of 26 FAA certified pilots, we show that SoRTS performs comparably to a competent human pilot, significantly outperforming our baseline algorithm. We further complement these results with self-play experiments in scenarios with increasing complexity. ",
    "url": "https://arxiv.org/abs/2304.01428",
    "authors": [
      "Ingrid Navarro",
      "Jay Patrikar",
      "Joao P. A. Dantas",
      "Rohan Baijal",
      "Ian Higgins",
      "Sebastian Scherer",
      "Jean Oh"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2304.01434",
    "title": "VNE: An Effective Method for Improving Deep Representation by  Manipulating Eigenvalue Distribution",
    "abstract": "Since the introduction of deep learning, a wide scope of representation properties, such as decorrelation, whitening, disentanglement, rank, isotropy, and mutual information, have been studied to improve the quality of representation. However, manipulating such properties can be challenging in terms of implementational effectiveness and general applicability. To address these limitations, we propose to regularize von Neumann entropy~(VNE) of representation. First, we demonstrate that the mathematical formulation of VNE is superior in effectively manipulating the eigenvalues of the representation autocorrelation matrix. Then, we demonstrate that it is widely applicable in improving state-of-the-art algorithms or popular benchmark algorithms by investigating domain-generalization, meta-learning, self-supervised learning, and generative models. In addition, we formally establish theoretical connections with rank, disentanglement, and isotropy of representation. Finally, we provide discussions on the dimension control of VNE and the relationship with Shannon entropy. Code is available at: https://github.com/jaeill/CVPR23-VNE. ",
    "url": "https://arxiv.org/abs/2304.01434",
    "authors": [
      "Jaeill Kim",
      "Suhyun Kang",
      "Duhun Hwang",
      "Jungwook Shin",
      "Wonjong Rhee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01440",
    "title": "A Deep Multi-Modal Cyber-Attack Detection in Industrial Control Systems",
    "abstract": "The growing number of cyber-attacks against Industrial Control Systems (ICS) in recent years has elevated security concerns due to the potential catastrophic impact. Considering the complex nature of ICS, detecting a cyber-attack in them is extremely challenging and requires advanced methods that can harness multiple data modalities. This research utilizes network and sensor modality data from ICS processed with a deep multi-modal cyber-attack detection model for ICS. Results using the Secure Water Treatment (SWaT) system show that the proposed model can outperform existing single modality models and recent works in the literature by achieving 0.99 precision, 0.98 recall, and 0.98 f-measure, which shows the effectiveness of using both modalities in a combined model for detecting cyber-attacks. ",
    "url": "https://arxiv.org/abs/2304.01440",
    "authors": [
      "Sepideh Bahadoripour",
      "Ethan MacDonald",
      "Hadis Karimipour"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01446",
    "title": "Integrating Commercial and Social Determinants of Health: A Unified  Ontology for Non-Clinical Determinants of Health",
    "abstract": "The objectives of this research are 1) to develop an ontology for CDoH by utilizing PubMed articles and ChatGPT; 2) to foster ontology reuse by integrating CDoH with an existing SDoH ontology into a unified structure; 3) to devise an overarching conception for all non-clinical determinants of health and to create an initial ontology, called N-CODH, for them; 4) and to validate the degree of correspondence between concepts provided by ChatGPT with the existing SDoH ontology ",
    "url": "https://arxiv.org/abs/2304.01446",
    "authors": [
      "Navya Martin Kollapally",
      "Vipina Kuttichi Keloth",
      "Julia Xu",
      "James Geller"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Digital Libraries (cs.DL)"
    ]
  },
  {
    "id": "arXiv:2304.01464",
    "title": "Hierarchical Supervision and Shuffle Data Augmentation for 3D  Semi-Supervised Object Detection",
    "abstract": "State-of-the-art 3D object detectors are usually trained on large-scale datasets with high-quality 3D annotations. However, such 3D annotations are often expensive and time-consuming, which may not be practical for real applications. A natural remedy is to adopt semi-supervised learning (SSL) by leveraging a limited amount of labeled samples and abundant unlabeled samples. Current pseudolabeling-based SSL object detection methods mainly adopt a teacher-student framework, with a single fixed threshold strategy to generate supervision signals, which inevitably brings confused supervision when guiding the student network training. Besides, the data augmentation of the point cloud in the typical teacher-student framework is too weak, and only contains basic down sampling and flip-and-shift (i.e., rotate and scaling), which hinders the effective learning of feature information. Hence, we address these issues by introducing a novel approach of Hierarchical Supervision and Shuffle Data Augmentation (HSSDA), which is a simple yet effective teacher-student framework. The teacher network generates more reasonable supervision for the student network by designing a dynamic dual-threshold strategy. Besides, the shuffle data augmentation strategy is designed to strengthen the feature representation ability of the student network. Extensive experiments show that HSSDA consistently outperforms the recent state-of-the-art methods on different datasets. The code will be released at https://github.com/azhuantou/HSSDA. ",
    "url": "https://arxiv.org/abs/2304.01464",
    "authors": [
      "Chuandong Liu",
      "Chenqiang Gao",
      "Fangcen Liu",
      "Pengcheng Li",
      "Deyu Meng",
      "Xinbo Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01480",
    "title": "FineRecon: Depth-aware Feed-forward Network for Detailed 3D  Reconstruction",
    "abstract": "Recent works on 3D reconstruction from posed images have demonstrated that direct inference of scene-level 3D geometry without iterative optimization is feasible using a deep neural network, showing remarkable promise and high efficiency. However, the reconstructed geometries, typically represented as a 3D truncated signed distance function (TSDF), are often coarse without fine geometric details. To address this problem, we propose three effective solutions for improving the fidelity of inference-based 3D reconstructions. We first present a resolution-agnostic TSDF supervision strategy to provide the network with a more accurate learning signal during training, avoiding the pitfalls of TSDF interpolation seen in previous work. We then introduce a depth guidance strategy using multi-view depth estimates to enhance the scene representation and recover more accurate surfaces. Finally, we develop a novel architecture for the final layers of the network, conditioning the output TSDF prediction on high-resolution image features in addition to coarse voxel features, enabling sharper reconstruction of fine details. Our method produces smooth and highly accurate reconstructions, showing significant improvements across multiple depth and 3D reconstruction metrics. ",
    "url": "https://arxiv.org/abs/2304.01480",
    "authors": [
      "Noah Stier",
      "Anurag Ranjan",
      "Alex Colburn",
      "Yajie Yan",
      "Liang Yang",
      "Fangchang Ma",
      "Baptiste Angles"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01482",
    "title": "Defending Against Patch-based Backdoor Attacks on Self-Supervised  Learning",
    "abstract": "Recently, self-supervised learning (SSL) was shown to be vulnerable to patch-based data poisoning backdoor attacks. It was shown that an adversary can poison a small part of the unlabeled data so that when a victim trains an SSL model on it, the final model will have a backdoor that the adversary can exploit. This work aims to defend self-supervised learning against such attacks. We use a three-step defense pipeline, where we first train a model on the poisoned data. In the second step, our proposed defense algorithm (PatchSearch) uses the trained model to search the training data for poisoned samples and removes them from the training set. In the third step, a final model is trained on the cleaned-up training set. Our results show that PatchSearch is an effective defense. As an example, it improves a model's accuracy on images containing the trigger from 38.2% to 63.7% which is very close to the clean model's accuracy, 64.6%. Moreover, we show that PatchSearch outperforms baselines and state-of-the-art defense approaches including those using additional clean, trusted data. Our code is available at https://github.com/UCDvision/PatchSearch ",
    "url": "https://arxiv.org/abs/2304.01482",
    "authors": [
      "Ajinkya Tejankar",
      "Maziar Sanjabi",
      "Qifan Wang",
      "Sinong Wang",
      "Hamed Firooz",
      "Hamed Pirsiavash",
      "Liang Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01484",
    "title": "Mapping Degeneration Meets Label Evolution: Learning Infrared Small  Target Detection with Single Point Supervision",
    "abstract": "Training a convolutional neural network (CNN) to detect infrared small targets in a fully supervised manner has gained remarkable research interests in recent years, but is highly labor expensive since a large number of per-pixel annotations are required. To handle this problem, in this paper, we make the first attempt to achieve infrared small target detection with point-level supervision. Interestingly, during the training phase supervised by point labels, we discover that CNNs first learn to segment a cluster of pixels near the targets, and then gradually converge to predict groundtruth point labels. Motivated by this \"mapping degeneration\" phenomenon, we propose a label evolution framework named label evolution with single point supervision (LESPS) to progressively expand the point label by leveraging the intermediate predictions of CNNs. In this way, the network predictions can finally approximate the updated pseudo labels, and a pixel-level target mask can be obtained to train CNNs in an end-to-end manner. We conduct extensive experiments with insightful visualizations to validate the effectiveness of our method. Experimental results show that CNNs equipped with LESPS can well recover the target masks from corresponding point labels, {and can achieve over 70% and 95% of their fully supervised performance in terms of pixel-level intersection over union (IoU) and object-level probability of detection (Pd), respectively. Code is available at https://github.com/XinyiYing/LESPS. ",
    "url": "https://arxiv.org/abs/2304.01484",
    "authors": [
      "Xinyi Ying",
      "Li Liu",
      "Yingqian Wang",
      "Ruojing Li",
      "Nuo Chen",
      "Zaiping Lin",
      "Weidong Sheng",
      "Shilin Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01492",
    "title": "A Unified Contrastive Transfer Framework with Propagation Structure for  Boosting Low-Resource Rumor Detection",
    "abstract": "The truth is significantly hampered by massive rumors that spread along with breaking news or popular topics. Since there is sufficient corpus gathered from the same domain for model training, existing rumor detection algorithms show promising performance on yesterday's news. However, due to a lack of training data and prior expert knowledge, they are poor at spotting rumors concerning unforeseen events, especially those propagated in different languages (i.e., low-resource regimes). In this paper, we propose a unified contrastive transfer framework to detect rumors by adapting the features learned from well-resourced rumor data to that of the low-resourced. More specifically, we first represent rumor circulated on social media as an undirected topology, and then train a Multi-scale Graph Convolutional Network via a unified contrastive paradigm. Our model explicitly breaks the barriers of the domain and/or language issues, via language alignment and a novel domain-adaptive contrastive learning mechanism. To enhance the representation learning from a small set of target events, we reveal that rumor-indicative signal is closely correlated with the uniformity of the distribution of these events. We design a target-wise contrastive training mechanism with three data augmentation strategies, capable of unifying the representations by distinguishing target events. Extensive experiments conducted on four low-resource datasets collected from real-world microblog platforms demonstrate that our framework achieves much better performance than state-of-the-art methods and exhibits a superior capacity for detecting rumors at early stages. ",
    "url": "https://arxiv.org/abs/2304.01492",
    "authors": [
      "Hongzhan Lin",
      "Jing Ma",
      "Ruichao Yang",
      "Zhiwei Yang",
      "Mingfei Cheng"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.01498",
    "title": "DCANet: Dual Convolutional Neural Network with Attention for Image Blind  Denoising",
    "abstract": "Noise removal of images is an essential preprocessing procedure for many computer vision tasks. Currently, many denoising models based on deep neural networks can perform well in removing the noise with known distributions (i.e. the additive Gaussian white noise). However eliminating real noise is still a very challenging task, since real-world noise often does not simply follow one single type of distribution, and the noise may spatially vary. In this paper, we present a new dual convolutional neural network (CNN) with attention for image blind denoising, named as the DCANet. To the best of our knowledge, the proposed DCANet is the first work that integrates both the dual CNN and attention mechanism for image denoising. The DCANet is composed of a noise estimation network, a spatial and channel attention module (SCAM), and a CNN with a dual structure. The noise estimation network is utilized to estimate the spatial distribution and the noise level in an image. The noisy image and its estimated noise are combined as the input of the SCAM, and a dual CNN contains two different branches is designed to learn the complementary features to obtain the denoised image. The experimental results have verified that the proposed DCANet can suppress both synthetic and real noise effectively. The code of DCANet is available at https://github.com/WenCongWu/DCANet. ",
    "url": "https://arxiv.org/abs/2304.01498",
    "authors": [
      "Wencong Wu",
      "Guannan Lv",
      "Yingying Duan",
      "Peng Liang",
      "Yungang Zhang",
      "Yuelong Xia"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.01500",
    "title": "Physics-aware Roughness Optimization for Diffractive Optical Neural  Networks",
    "abstract": "As a representative next-generation device/circuit technology beyond CMOS, diffractive optical neural networks (DONNs) have shown promising advantages over conventional deep neural networks due to extreme fast computation speed (light speed) and low energy consumption. However, there is a mismatch, i.e., significant prediction accuracy loss, between the DONN numerical modelling and physical optical device deployment, because of the interpixel interaction within the diffractive layers. In this work, we propose a physics-aware diffractive optical neural network training framework to reduce the performance difference between numerical modeling and practical deployment. Specifically, we propose the roughness modeling regularization in the training process and integrate the physics-aware sparsification method to introduce sparsity to the phase masks to reduce sharp phase changes between adjacent pixels in diffractive layers. We further develop $2\\pi$ periodic optimization to reduce the roughness of the phase masks to preserve the performance of DONN. Experiment results demonstrate that, compared to state-of-the-arts, our physics-aware optimization can provide $35.7\\%$, $34.2\\%$, $28.1\\%$, and $27.3\\%$ reduction in roughness with only accuracy loss on MNIST, FMNIST, KMNIST, and EMNIST, respectively. ",
    "url": "https://arxiv.org/abs/2304.01500",
    "authors": [
      "Shanglin Zhou",
      "Yingjie Li",
      "Minhan Lou",
      "Weilu Gao",
      "Zhijie Shi",
      "Cunxi Yu",
      "Caiwen Ding"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Emerging Technologies (cs.ET)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2304.01506",
    "title": "OneShotSTL: One-Shot Seasonal-Trend Decomposition For Online Time Series  Anomaly Detection And Forecasting",
    "abstract": "Seasonal-trend decomposition is one of the most fundamental concepts in time series analysis that supports various downstream tasks, including time series anomaly detection and forecasting. However, existing decomposition methods rely on batch processing with a time complexity of O(W), where W is the number of data points within a time window. Therefore, they cannot always efficiently support real-time analysis that demands low processing delay. To address this challenge, we propose OneShotSTL, an efficient and accurate algorithm that can decompose time series online with an update time complexity of O(1). OneShotSTL is more than $1,000$ times faster than the batch methods, with accuracy comparable to the best counterparts. Extensive experiments on real-world benchmark datasets for downstream time series anomaly detection and forecasting tasks demonstrate that OneShotSTL is from 10 to over 1,000 times faster than the state-of-the-art methods, while still providing comparable or even better accuracy. ",
    "url": "https://arxiv.org/abs/2304.01506",
    "authors": [
      "Xiao He",
      "Ye Li",
      "Jian Tan",
      "Bin Wu",
      "Feifei Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.01507",
    "title": "RARE: Robust Masked Graph Autoencoder",
    "abstract": "Masked graph autoencoder (MGAE) has emerged as a promising self-supervised graph pre-training (SGP) paradigm due to its simplicity and effectiveness. However, existing efforts perform the mask-then-reconstruct operation in the raw data space as is done in computer vision (CV) and natural language processing (NLP) areas, while neglecting the important non-Euclidean property of graph data. As a result, the highly unstable local connection structures largely increase the uncertainty in inferring masked data and decrease the reliability of the exploited self-supervision signals, leading to inferior representations for downstream evaluations. To address this issue, we propose a novel SGP method termed Robust mAsked gRaph autoEncoder (RARE) to improve the certainty in inferring masked data and the reliability of the self-supervision mechanism by further masking and reconstructing node samples in the high-order latent feature space. Through both theoretical and empirical analyses, we have discovered that performing a joint mask-then-reconstruct strategy in both latent feature and raw data spaces could yield improved stability and performance. To this end, we elaborately design a masked latent feature completion scheme, which predicts latent features of masked nodes under the guidance of high-order sample correlations that are hard to be observed from the raw data perspective. Specifically, we first adopt a latent feature predictor to predict the masked latent features from the visible ones. Next, we encode the raw data of masked samples with a momentum graph encoder and subsequently employ the resulting representations to improve predicted results through latent feature matching. Extensive experiments on seventeen datasets have demonstrated the effectiveness and robustness of RARE against state-of-the-art (SOTA) competitors across three downstream tasks. ",
    "url": "https://arxiv.org/abs/2304.01507",
    "authors": [
      "Wenxuan Tu",
      "Qing Liao",
      "Sihang Zhou",
      "Xin Peng",
      "Chuan Ma",
      "Zhe Liu",
      "Xinwang Liu",
      "Zhiping Cai"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01509",
    "title": "Sensing Performance of Cooperative Joint Sensing-Communication UAV  Network",
    "abstract": "We propose a novel cooperative joint sensing-communication (JSC) unmanned aerial vehicle (UAV) network that can achieve downward-looking detection and transmit detection data simultaneously using the same time and frequency resources by exploiting the beam sharing scheme. The UAV network consists of a UAV that works as a fusion center (FCUAV) and multiple subordinate UAVs (SU). All UAVs fly at the fixed height. FCUAV integrates the sensing data of network and carries out downward-looking detection. SUs carry out downward-looking detection and transmit the sensing data to FCUAV. To achieve the beam sharing scheme, each UAV is equipped with a novel JSC antenna array that is composed of both the sensing subarray (SenA) and the communication subarray (ComA) in order to generate the sensing beam (SenB) and the communication beam (ComB) for detection and communication, respectively. SenB and ComB of each UAV share a total amount of radio power. Because of the spatial orthogonality of communication and sensing, SenB and ComB can be easily formed orthogonally. The upper bound of average cooperative sensing area (UB-ACSA) is defined as the metric to measure the sensing performance, which is related to the mutual sensing interference and the communication capacity. Numerical simulations prove the validity of the theoretical expressions for UB-ACSA of the network. The optimal number of UAVs and the optimal SenB power are identified under the total power constraint. ",
    "url": "https://arxiv.org/abs/2304.01509",
    "authors": [
      "Xu Chen",
      "Zhiyong Feng",
      "Zhiqing Wei",
      "Feifei Gao",
      "Xin Yuan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.01510",
    "title": "Local Differential Privacy in Federated Optimization",
    "abstract": "Federated optimization, wherein several agents in a network collaborate with a central server to achieve optimal social cost over the network with no requirement for exchanging information among agents, has attracted significant interest from the research community. In this context, agents demand resources based on their local computation. Due to the exchange of optimization parameters such as states, constraints, or objective functions with a central server, an adversary may infer sensitive information of agents. We develop LDP-AIMD, a local differentially-private additive-increase and multiplicative-decrease (AIMD) algorithm, to allocate multiple divisible shared resources to agents in a network. The LDP-AIMD algorithm provides a differential privacy guarantee to agents in the network. No inter-agent communication is required; however, the central server keeps track of the aggregate consumption of resources. We present experimental results to check the efficacy of the algorithm. Moreover, we present empirical analyses for the trade-off between privacy and the efficiency of the algorithm. ",
    "url": "https://arxiv.org/abs/2304.01510",
    "authors": [
      "Syed Eqbal Alam",
      "Dhirendra Shukla",
      "Shrisha Rao"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)",
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.01514",
    "title": "Robust Outlier Rejection for 3D Registration with Variational Bayes",
    "abstract": "Learning-based outlier (mismatched correspondence) rejection for robust 3D registration generally formulates the outlier removal as an inlier/outlier classification problem. The core for this to be successful is to learn the discriminative inlier/outlier feature representations. In this paper, we develop a novel variational non-local network-based outlier rejection framework for robust alignment. By reformulating the non-local feature learning with variational Bayesian inference, the Bayesian-driven long-range dependencies can be modeled to aggregate discriminative geometric context information for inlier/outlier distinction. Specifically, to achieve such Bayesian-driven contextual dependencies, each query/key/value component in our non-local network predicts a prior feature distribution and a posterior one. Embedded with the inlier/outlier label, the posterior feature distribution is label-dependent and discriminative. Thus, pushing the prior to be close to the discriminative posterior in the training step enables the features sampled from this prior at test time to model high-quality long-range dependencies. Notably, to achieve effective posterior feature guidance, a specific probabilistic graphical model is designed over our non-local model, which lets us derive a variational low bound as our optimization objective for model training. Finally, we propose a voting-based inlier searching strategy to cluster the high-quality hypothetical inliers for transformation estimation. Extensive experiments on 3DMatch, 3DLoMatch, and KITTI datasets verify the effectiveness of our method. ",
    "url": "https://arxiv.org/abs/2304.01514",
    "authors": [
      "Haobo Jiang",
      "Zheng Dang",
      "Zhen Wei",
      "Jin Xie",
      "Jian Yang",
      "Mathieu Salzmann"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01518",
    "title": "Multimodal Neural Processes for Uncertainty Estimation",
    "abstract": "Neural processes (NPs) have brought the representation power of parametric deep neural networks and the reliable uncertainty estimation of non-parametric Gaussian processes together. Although recent development of NPs has shown success in both regression and classification, how to adapt NPs to multimodal data has not be carefully studied. For the first time, we propose a new model of NP family for multimodal uncertainty estimation, namely Multimodal Neural Processes. In a holistic and principled way, we develop a dynamic context memory updated by the classification error, a multimodal Bayesian aggregation mechanism to aggregate multimodal representations, and a new attention mechanism for calibrated predictions. In extensive empirical evaluation, our method achieves the state-of-the-art multimodal uncertainty estimation performance, showing its appealing ability of being robust against noisy samples and reliable in out-of-domain detection. ",
    "url": "https://arxiv.org/abs/2304.01518",
    "authors": [
      "Myong Chol Jung",
      "He Zhao",
      "Joanna Dipnall",
      "Belinda Gabbe",
      "Lan Du"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01519",
    "title": "LiDAR-Based 3D Object Detection via Hybrid 2D Semantic Scene Generation",
    "abstract": "Bird's-Eye View (BEV) features are popular intermediate scene representations shared by the 3D backbone and the detector head in LiDAR-based object detectors. However, little research has been done to investigate how to incorporate additional supervision on the BEV features to improve proposal generation in the detector head, while still balancing the number of powerful 3D layers and efficient 2D network operations. This paper proposes a novel scene representation that encodes both the semantics and geometry of the 3D environment in 2D, which serves as a dense supervision signal for better BEV feature learning. The key idea is to use auxiliary networks to predict a combination of explicit and implicit semantic probabilities by exploiting their complementary properties. Extensive experiments show that our simple yet effective design can be easily integrated into most state-of-the-art 3D object detectors and consistently improves upon baseline models. ",
    "url": "https://arxiv.org/abs/2304.01519",
    "authors": [
      "Haitao Yang",
      "Zaiwei Zhang",
      "Xiangru Huang",
      "Min Bai",
      "Chen Song",
      "Bo Sun",
      "Li Erran Li",
      "Qixing Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01563",
    "title": "Attribute-Consistent Knowledge Graph Representation Learning for  Multi-Modal Entity Alignment",
    "abstract": "The multi-modal entity alignment (MMEA) aims to find all equivalent entity pairs between multi-modal knowledge graphs (MMKGs). Rich attributes and neighboring entities are valuable for the alignment task, but existing works ignore contextual gap problems that the aligned entities have different numbers of attributes on specific modality when learning entity representations. In this paper, we propose a novel attribute-consistent knowledge graph representation learning framework for MMEA (ACK-MMEA) to compensate the contextual gaps through incorporating consistent alignment knowledge. Attribute-consistent KGs (ACKGs) are first constructed via multi-modal attribute uniformization with merge and generate operators so that each entity has one and only one uniform feature in each modality. The ACKGs are then fed into a relation-aware graph neural network with random dropouts, to obtain aggregated relation representations and robust entity representations. In order to evaluate the ACK-MMEA facilitated for entity alignment, we specially design a joint alignment loss for both entity and attribute evaluation. Extensive experiments conducted on two benchmark datasets show that our approach achieves excellent performance compared to its competitors. ",
    "url": "https://arxiv.org/abs/2304.01563",
    "authors": [
      "Qian Li",
      "Shu Guo",
      "Yangyifei Luo",
      "Cheng Ji",
      "Lihong Wang",
      "Jiawei Sheng",
      "Jianxin Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.01565",
    "title": "A Survey on Graph Diffusion Models: Generative AI in Science for  Molecule, Protein and Material",
    "abstract": "Diffusion models have become a new SOTA generative modeling method in various fields, for which there are multiple survey works that provide an overall survey. With the number of articles on diffusion models increasing exponentially in the past few years, there is an increasing need for surveys of diffusion models on specific fields. In this work, we are committed to conducting a survey on the graph diffusion models. Even though our focus is to cover the progress of diffusion models in graphs, we first briefly summarize how other generative modeling methods are used for graphs. After that, we introduce the mechanism of diffusion models in various forms, which facilitates the discussion on the graph diffusion models. The applications of graph diffusion models mainly fall into the category of AI-generated content (AIGC) in science, for which we mainly focus on how graph diffusion models are utilized for generating molecules and proteins but also cover other cases, including materials design. Moreover, we discuss the issue of evaluating diffusion models in the graph domain and the existing challenges. ",
    "url": "https://arxiv.org/abs/2304.01565",
    "authors": [
      "Mengchun Zhang",
      "Maryam Qamar",
      "Taegoo Kang",
      "Yuna Jung",
      "Chenshuang Zhang",
      "Sung-Ho Bae",
      "Chaoning Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01569",
    "title": "Spatiotemporal and Semantic Zero-inflated Urban Anomaly Prediction",
    "abstract": "Urban anomaly predictions, such as traffic accident prediction and crime prediction, are of vital importance to smart city security and maintenance. Existing methods typically use deep learning to capture the intra-dependencies in spatial and temporal dimensions. However, numerous key challenges remain unsolved, for instance, sparse zero-inflated data due to urban anomalies occurring with low frequency (which can lead to poor performance on real-world datasets), and both intra- and inter-dependencies of abnormal patterns across spatial, temporal, and semantic dimensions. Moreover, a unified approach to predict multiple kinds of anomaly is left to explore. In this paper, we propose STS to jointly capture the intra- and inter-dependencies between the patterns and the influential factors in three dimensions. Further, we use a multi-task prediction module with a customized loss function to solve the zero-inflated issue. To verify the effectiveness of the model, we apply it to two urban anomaly prediction tasks, crime prediction and traffic accident risk prediction, respectively. Experiments on two application scenarios with four real-world datasets demonstrate the superiority of STS, which outperforms state-of-the-art methods in the mean absolute error and the root mean square error by 37.88% and 18.10% on zero-inflated datasets, and, 60.32% and 37.28% on non-zero datasets, respectively. ",
    "url": "https://arxiv.org/abs/2304.01569",
    "authors": [
      "Yao Lu",
      "Pengyuan Zhou",
      "Yong Liao",
      "Haiyong Xie"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01575",
    "title": "The expressive power of pooling in Graph Neural Networks",
    "abstract": "In Graph Neural Networks (GNNs), hierarchical pooling operators generate a coarser representation of the input data by creating local summaries of the graph structure and its vertex features. Considerable attention has been devoted to studying the expressive power of message-passing (MP) layers in GNNs, while a study on how pooling operators affect the expressivity of a GNN is still lacking. Additionally, despite the recent advances in the design of effective pooling operators, there is not a principled criterion to compare them. Our work aims to fill this gap by providing sufficient conditions for a pooling operator to fully preserve the expressive power of the MP layers before it. These conditions serve as a universal and theoretically-grounded criterion for choosing among existing pooling operators or designing new ones. Based on our theoretical findings, we reviewed several existing pooling operators and identified those that fail to satisfy the expressiveness assumptions. Finally, we introduced an experimental setup to empirically measure the expressive power of a GNN equipped with pooling layers, in terms of its capability to perform a graph isomorphism test. ",
    "url": "https://arxiv.org/abs/2304.01575",
    "authors": [
      "Filippo Maria Bianchi",
      "Veronica Lachi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01580",
    "title": "Untargeted Near-collision Attacks in Biometric Recognition",
    "abstract": "A biometric recognition system can operate in two distinct modes, identification or verification. In the first mode, the system recognizes an individual by searching the enrolled templates of all the users for a match. In the second mode, the system validates a claimed identity by comparing the fresh template with the enrolled template for this identity. Both the experimentally determined false match rate and false non-match rate through recognition threshold adjustment define the recognition accuracy, and hence the security of the system. The biometric transformation schemes usually produce binary templates that are better handled by cryptographic schemes. One of the requirements for these transformation schemes is their irreversibility. In this work, we rely on probabilistic modelling to quantify the security strength of binary templates. We investigate the influence of template size, database size and threshold on the probability of having a near-collision, and we highlight two attacks on biometric systems. We discuss the choice of parameters through the generic presented attacks. ",
    "url": "https://arxiv.org/abs/2304.01580",
    "authors": [
      "Axel Durbet",
      "Paul-Marie Grollemund",
      "Kevin Thiry-Atighehchi"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01590",
    "title": "A method of combining traffic classification and traffic prediction  based on machine learning in wireless networks",
    "abstract": "With the increasing number of service types of wireless network and the increasingly obvious differentiation of quality of service (QoS) requirements, the traffic flow classification and traffic prediction technology are of great significance for wireless network to provide differentiated QoS guarantee. At present, the machine learning methods attract widespread attentions in the tuples based traffic flow classification as well as the time series based traffic flow prediction. However, most of the existing studies divide the traffic flow classification and traffic prediction into two independent processes, which leads to inaccurate classification and prediction results. Therefore, this paper proposes a method of joint wireless network traffic classification and traffic prediction based on machine learning. First, building different predictors based on traffic categories, so that different types of classified traffic can use more appropriate predictors for traffic prediction according to their categories. Secondly, the prediction results of different types of predictors, as a posteriori feature, are fed back to the classifiers as input features to improve the accuracy of the classifiers. The experimental results show that the proposed method has improves both the accuracy of traffic classification and traffic prediction in wireless networks. ",
    "url": "https://arxiv.org/abs/2304.01590",
    "authors": [
      "Luming Wang",
      "Mao Yang",
      "Bo Li",
      "Zhongjiang Yan"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.01592",
    "title": "PAC-Based Formal Verification for Out-of-Distribution Data Detection",
    "abstract": "Cyber-physical systems (CPS) like autonomous vehicles, that utilize learning components, are often sensitive to noise and out-of-distribution (OOD) instances encountered during runtime. As such, safety critical tasks depend upon OOD detection subsystems in order to restore the CPS to a known state or interrupt execution to prevent safety from being compromised. However, it is difficult to guarantee the performance of OOD detectors as it is difficult to characterize the OOD aspect of an instance, especially in high-dimensional unstructured data. To distinguish between OOD data and data known to the learning component through the training process, an emerging technique is to incorporate variational autoencoders (VAE) within systems and apply classification or anomaly detection techniques on their latent spaces. The rationale for doing so is the reduction of the data domain size through the encoding process, which benefits real-time systems through decreased processing requirements, facilitates feature analysis for unstructured data and allows more explainable techniques to be implemented. This study places probably approximately correct (PAC) based guarantees on OOD detection using the encoding process within VAEs to quantify image features and apply conformal constraints over them. This is used to bound the detection error on unfamiliar instances with user-defined confidence. The approach used in this study is to empirically establish these bounds by sampling the latent probability distribution and evaluating the error with respect to the constraint violations that are encountered. The guarantee is then verified using data generated from CARLA, an open-source driving simulator. ",
    "url": "https://arxiv.org/abs/2304.01592",
    "authors": [
      "Mohit Prashant",
      "Arvind Easwaran"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01598",
    "title": "MM-BSN: Self-Supervised Image Denoising for Real-World with Multi-Mask  based on Blind-Spot Network",
    "abstract": "Recent advances in deep learning have been pushing image denoising techniques to a new level. In self-supervised image denoising, blind-spot network (BSN) is one of the most common methods. However, most of the existing BSN algorithms use a dot-based central mask, which is recognized as inefficient for images with large-scale spatially correlated noise. In this paper, we give the definition of large-noise and propose a multi-mask strategy using multiple convolutional kernels masked in different shapes to further break the noise spatial correlation. Furthermore, we propose a novel self-supervised image denoising method that combines the multi-mask strategy with BSN (MM-BSN). We show that different masks can cause significant performance differences, and the proposed MM-BSN can efficiently fuse the features extracted by multi-masked layers, while recovering the texture structures destroyed by multi-masking and information transmission. Our MM-BSN can be used to address the problem of large-noise denoising, which cannot be efficiently handled by other BSN methods. Extensive experiments on public real-world datasets demonstrate that the proposed MM-BSN achieves state-of-the-art performance among self-supervised and even unpaired image denoising methods for sRGB images denoising, without any labelling effort or prior knowledge. Code can be found in https://github.com/dannie125/MM-BSN. ",
    "url": "https://arxiv.org/abs/2304.01598",
    "authors": [
      "Dan Zhang",
      "Fangfang Zhou",
      "Yuwen Jiang",
      "Zhengming Fu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01615",
    "title": "Tractable Identification of Electric Distribution Networks",
    "abstract": "The identification of distribution network topology and parameters is a critical problem that lays the foundation for improving network efficiency, enhancing reliability, and increasing its capacity to host distributed energy resources. Network identification problems often involve estimating a large number of parameters based on highly correlated measurements, resulting in an ill-conditioned and computationally demanding estimation process. We address these challenges by proposing two admittance matrix estimation methods. In the first method, we use the eigendecomposition of the admittance matrix to generalize the notion of stationarity to electrical signals and demonstrate how the stationarity property can be used to facilitate a maximum a posteriori estimation procedure. We relax the stationarity assumption in the second proposed method by employing Linear Minimum Mean Square Error (LMMSE) estimation. Since LMMSE estimation is often ill-conditioned, we introduce an approximate well-conditioned solution based on eigenvalue truncation. Our quantitative results demonstrate the improvement in computational efficiency compared to the state-of-the-art methods while preserving the estimation accuracy. ",
    "url": "https://arxiv.org/abs/2304.01615",
    "authors": [
      "Ognjen Stanojev",
      "Lucien Werner",
      "Steven Low",
      "Gabriela Hug"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.01617",
    "title": "Investigating Concerns of Security and Privacy Among Rohingya Refugees  in Malaysia",
    "abstract": "The security and privacy of refugee communities have emerged as pressing concerns in the context of increasing global migration. The Rohingya refugees are a stateless Muslim minority group in Myanmar who were forced to flee their homes after conflict broke out, with many fleeing to neighbouring countries and ending up in refugee camps, such as in Bangladesh. However, others migrated to Malaysia and those who arrive there live within the community as urban refugees. However, the Rohingya in Malaysia are not legally recognized and have limited and restricted access to public resources such as healthcare and education. This means they face security and privacy challenges, different to other refugee groups, which are often compounded by this lack of recognition, social isolation and lack of access to vital resources. This paper discusses the implications of security and privacy of the Rohingya refugees, focusing on available and accessible technological assistance, uncovering the heightened need for a human-centered approach to design and implementation of solutions that factor in these requirements. Overall, the discussions and findings presented in this paper on the security and privacy of the Rohingya provides a valuable resource for researchers, practitioners and policymakers in the wider HCI community. ",
    "url": "https://arxiv.org/abs/2304.01617",
    "authors": [
      "Theodoros Georgiou",
      "Lynne Baillie",
      "Ryan Shah"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Cryptography and Security (cs.CR)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2304.01620",
    "title": "Image Blind Denoising Using Dual Convolutional Neural Network with Skip  Connection",
    "abstract": "In recent years, deep convolutional neural networks have shown fascinating performance in the field of image denoising. However, deeper network architectures are often accompanied with large numbers of model parameters, leading to high training cost and long inference time, which limits their application in practical denoising tasks. In this paper, we propose a novel dual convolutional blind denoising network with skip connection (DCBDNet), which is able to achieve a desirable balance between the denoising effect and network complexity. The proposed DCBDNet consists of a noise estimation network and a dual convolutional neural network (CNN). The noise estimation network is used to estimate the noise level map, which improves the flexibility of the proposed model. The dual CNN contains two branches: a u-shaped sub-network is designed for the upper branch, and the lower branch is composed of the dilated convolution layers. Skip connections between layers are utilized in both the upper and lower branches. The proposed DCBDNet was evaluated on several synthetic and real-world image denoising benchmark datasets. Experimental results have demonstrated that the proposed DCBDNet can effectively remove gaussian noise in a wide range of levels, spatially variant noise and real noise. With a simple model structure, our proposed DCBDNet still can obtain competitive denoising performance compared to the state-of-the-art image denoising models containing complex architectures. Namely, a favorable trade-off between denoising performance and model complexity is achieved. Codes are available at https://github.com/WenCongWu/DCBDNet. ",
    "url": "https://arxiv.org/abs/2304.01620",
    "authors": [
      "Wencong Wu",
      "Shicheng Liao",
      "Guannan Lv",
      "Peng Liang",
      "Yungang Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.01627",
    "title": "Self-Supervised Image Denoising for Real-World Images with Context-aware  Transformer",
    "abstract": "In recent years, the development of deep learning has been pushing image denoising to a new level. Among them, self-supervised denoising is increasingly popular because it does not require any prior knowledge. Most of the existing self-supervised methods are based on convolutional neural networks (CNN), which are restricted by the locality of the receptive field and would cause color shifts or textures loss. In this paper, we propose a novel Denoise Transformer for real-world image denoising, which is mainly constructed with Context-aware Denoise Transformer (CADT) units and Secondary Noise Extractor (SNE) block. CADT is designed as a dual-branch structure, where the global branch uses a window-based Transformer encoder to extract the global information, while the local branch focuses on the extraction of local features with small receptive field. By incorporating CADT as basic components, we build a hierarchical network to directly learn the noise distribution information through residual learning and obtain the first stage denoised output. Then, we design SNE in low computation for secondary global noise extraction. Finally the blind spots are collected from the Denoise Transformer output and reconstructed, forming the final denoised image. Extensive experiments on the real-world SIDD benchmark achieve 50.62/0.990 for PSNR/SSIM, which is competitive with the current state-of-the-art method and only 0.17/0.001 lower. Visual comparisons on public sRGB, Raw-RGB and greyscale datasets prove that our proposed Denoise Transformer has a competitive performance, especially on blurred textures and low-light images, without using additional knowledge, e.g., noise level or noise type, regarding the underlying unknown noise. ",
    "url": "https://arxiv.org/abs/2304.01627",
    "authors": [
      "Dan Zhang",
      "Fangfang Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.01628",
    "title": "Equivariant Networks for Porous Crystalline Materials",
    "abstract": "Efficiently predicting properties of porous crystalline materials has great potential to accelerate the high throughput screening process for developing new materials, as simulations carried out using first principles model are often computationally expensive. To effectively make use of Deep Learning methods to model these materials, we need to utilize the symmetries present in the crystals, which are defined by their space group. Existing methods for crystal property prediction either have symmetry constraints that are too restrictive or only incorporate symmetries between unit cells. In addition, these models do not explicitly model the porous structure of the crystal. In this paper, we develop a model which incorporates the symmetries of the unit cell of a crystal in its architecture and explicitly models the porous structure. We evaluate our model by predicting the heat of adsorption of CO$_2$ for different configurations of the mordenite zeolite. Our results confirm that our method performs better than existing methods for crystal property prediction and that the inclusion of pores results in a more efficient model. ",
    "url": "https://arxiv.org/abs/2304.01628",
    "authors": [
      "Marko Petković",
      "Pablo Romero-Marimon",
      "Vlado Menkovski",
      "Sofia Calero"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Materials Science (cond-mat.mtrl-sci)"
    ]
  },
  {
    "id": "arXiv:2304.01647",
    "title": "SC-ML: Self-supervised Counterfactual Metric Learning for Debiased  Visual Question Answering",
    "abstract": "Visual question answering (VQA) is a critical multimodal task in which an agent must answer questions according to the visual cue. Unfortunately, language bias is a common problem in VQA, which refers to the model generating answers only by associating with the questions while ignoring the visual content, resulting in biased results. We tackle the language bias problem by proposing a self-supervised counterfactual metric learning (SC-ML) method to focus the image features better. SC-ML can adaptively select the question-relevant visual features to answer the question, reducing the negative influence of question-irrelevant visual features on inferring answers. In addition, question-irrelevant visual features can be seamlessly incorporated into counterfactual training schemes to further boost robustness. Extensive experiments have proved the effectiveness of our method with improved results on the VQA-CP dataset. Our code will be made publicly available. ",
    "url": "https://arxiv.org/abs/2304.01647",
    "authors": [
      "Xinyao Shu",
      "Shiyang Yan",
      "Xu Yang",
      "Ziheng Wu",
      "Zhongfeng Chen",
      "Zhenyu Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01649",
    "title": "Model Predictive Control for Multi-Agent Systems under Limited  Communication and Time-Varying Network Topology",
    "abstract": "In control system networks, reconfiguration of the controller when agents are leaving or joining the network is still an open challenge, in particular when operation constraints that depend on each agent's behavior must be met. Drawing our motivation from mobile robot swarms, in this paper, we address this problem by optimizing individual agent performance while guaranteeing persistent constraint satisfaction in presence of bounded communication range and time-varying network topology. The approach we propose is a model predictive control (MPC) formulation, building on multi-trajectory MPC (mt-MPC) concepts. To enable plug and play operations when the system is in closed-loop without the need of a request, the proposed MPC scheme predicts two different state trajectories in the same finite horizon optimal control problem. One trajectory drives the system to the desired target, assuming that the network topology will not change in the prediction horizon, while the second one ensures constraint satisfaction assuming a worst-case scenario in terms of new agents joining the network in the planning horizon. Recursive feasibility and stability of the closed-loop system during plug and play operations are shown. The approach effectiveness is illustrated with a numerical simulation. ",
    "url": "https://arxiv.org/abs/2304.01649",
    "authors": [
      "Danilo Saccani",
      "Lorenzo Fagiano",
      "Melanie N. Zeilinger",
      "Andrea Carron"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.01658",
    "title": "Fully Convolutional Networks for Dense Water Flow Intensity Prediction  in Swedish Catchment Areas",
    "abstract": "Intensifying climate change will lead to more extreme weather events, including heavy rainfall and drought. Accurate stream flow prediction models which are adaptable and robust to new circumstances in a changing climate will be an important source of information for decisions on climate adaptation efforts, especially regarding mitigation of the risks of and damages associated with flooding. In this work we propose a machine learning-based approach for predicting water flow intensities in inland watercourses based on the physical characteristics of the catchment areas, obtained from geospatial data (including elevation and soil maps, as well as satellite imagery), in addition to temporal information about past rainfall quantities and temperature variations. We target the one-day-ahead regime, where a fully convolutional neural network model receives spatio-temporal inputs and predicts the water flow intensity in every coordinate of the spatial input for the subsequent day. To the best of our knowledge, we are the first to tackle the task of dense water flow intensity prediction; earlier works have considered predicting flow intensities at a sparse set of locations at a time. An extensive set of model evaluations and ablations are performed, which empirically justify our various design choices. Code and preprocessed data have been made publicly available at https://github.com/aleksispi/fcn-water-flow. ",
    "url": "https://arxiv.org/abs/2304.01658",
    "authors": [
      "Aleksis Pirinen",
      "Olof Mogren",
      "Mårten Västerdal"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01665",
    "title": "Neural Comprehension: Language Models with Compiled Neural Networks",
    "abstract": "Language models have achieved impressive results in natural language processing tasks, but their ability to perform symbolic operations and arithmetic operations, remains limited, which attribute to their learn the rules implicitly from data. We explore how to incorporate compiled neural networks (CoNNs) which weight is specially designed, into the architecture of language models to enable the language model trained by gradient to obtain fully rule comprehension ability. The incorporation of compiled neural networks offers a promising direction for improving the performance of language models on compound tasks, particularly in areas that require a deeper comprehension of abstract rules beyond recognizing patterns in training data. Our method, which call \"Neural Comprehension\", helps language models achieve absolute accuracy in symbolic operations, thereby enhancing their ability for rule reasoning, symbolic reasoning, and arithmetic reasoning. Our code is publicly available at: \\url{https://github.com/WENGSYX/Neural-Comprehension}. ",
    "url": "https://arxiv.org/abs/2304.01665",
    "authors": [
      "Yixuan Weng",
      "Minjun Zhu",
      "Fei Xia",
      "Bin Li",
      "Shizhu He",
      "Kang Liu",
      "Jun Zhao"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.01666",
    "title": "A Survey on Contextualised Semantic Shift Detection",
    "abstract": "Semantic Shift Detection (SSD) is the task of identifying, interpreting, and assessing the possible change over time in the meanings of a target word. Traditionally, SSD has been addressed by linguists and social scientists through manual and time-consuming activities. In the recent years, computational approaches based on Natural Language Processing and word embeddings gained increasing attention to automate SSD as much as possible. In particular, over the past three years, significant advancements have been made almost exclusively based on word contextualised embedding models, which can handle the multiple usages/meanings of the words and better capture the related semantic shifts. In this paper, we survey the approaches based on contextualised embeddings for SSD (i.e., CSSDetection) and we propose a classification framework characterised by meaning representation, time-awareness, and learning modality dimensions. The framework is exploited i) to review the measures for shift assessment, ii) to compare the approaches on performance, and iii) to discuss the current issues in terms of scalability, interpretability, and robustness. Open challenges and future research directions about CSSDetection are finally outlined. ",
    "url": "https://arxiv.org/abs/2304.01666",
    "authors": [
      "Stefano Montanelli",
      "Francesco Periti"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.01669",
    "title": "Re-thinking Model Inversion Attacks Against Deep Neural Networks",
    "abstract": "Model inversion (MI) attacks aim to infer and reconstruct private training data by abusing access to a model. MI attacks have raised concerns about the leaking of sensitive information (e.g. private face images used in training a face recognition system). Recently, several algorithms for MI have been proposed to improve the attack performance. In this work, we revisit MI, study two fundamental issues pertaining to all state-of-the-art (SOTA) MI algorithms, and propose solutions to these issues which lead to a significant boost in attack performance for all SOTA MI. In particular, our contributions are two-fold: 1) We analyze the optimization objective of SOTA MI algorithms, argue that the objective is sub-optimal for achieving MI, and propose an improved optimization objective that boosts attack performance significantly. 2) We analyze \"MI overfitting\", show that it would prevent reconstructed images from learning semantics of training data, and propose a novel \"model augmentation\" idea to overcome this issue. Our proposed solutions are simple and improve all SOTA MI attack accuracy significantly. E.g., in the standard CelebA benchmark, our solutions improve accuracy by 11.8% and achieve for the first time over 90% attack accuracy. Our findings demonstrate that there is a clear risk of leaking sensitive information from deep learning models. We urge serious consideration to be given to the privacy implications. Our code, demo, and models are available at https://ngoc-nguyen-0.github.io/re-thinking_model_inversion_attacks/ ",
    "url": "https://arxiv.org/abs/2304.01669",
    "authors": [
      "Ngoc-Bao Nguyen",
      "Keshigeyan Chandrasegaran",
      "Milad Abdollahzadeh",
      "Ngai-Man Cheung"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01681",
    "title": "Low-overhead Joint Channel Estimation and Data Detection in ZP-OTFS  System",
    "abstract": "High pilot overhead and peak-to-average power ratio (PAPR) are challenging issues in channel estimation for orthogonal time frequency space (OTFS) systems. ZP-OTFS is a modified OTFS system where multiple rows along the delay axis are zero. We propose a two-step channel estimation method for the ZP-OTFS system. The proposed method inserts pilot sequences in the zero bins of the ZP-OTFS system, resulting in low overhead and PAPR. Our simulation results demonstrate the effectiveness of the proposed method and show that it outperforms embedded pilot estimation in terms of normalized mean square error (NMSE) at the same bit error rate (BER). ",
    "url": "https://arxiv.org/abs/2304.01681",
    "authors": [
      "Omid Abbassi Aghda",
      "Mohammad Javad Omidi",
      "Hamid Saeedi-Sourck"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.01689",
    "title": "Privacy-Preserving Federated Discovery of DNA Motifs with Differential  Privacy",
    "abstract": "DNA motif discovery is an important issue in gene research, which aims to identify transcription factor binding sites (i.e., motifs) in DNA sequences to reveal the mechanisms that regulate gene expression. However, the phenomenon of data silos and the problem of privacy leakage have seriously hindered the development of DNA motif discovery. On the one hand, the phenomenon of data silos makes data collection difficult. On the other hand, the collection and use of DNA data become complicated and difficult because DNA is sensitive private information. In this context, how discovering DNA motifs under the premise of ensuring privacy and security and alleviating data silos has become a very important issue. Therefore, this paper proposes a novel method, namely DP-FLMD, to address this problem. Note that this is the first application of federated learning to the field of genetics research. The federated learning technique is used to solve the problem of data silos. It has the advantage of enabling multiple participants to train models together and providing privacy protection services. To address the challenges of federated learning in terms of communication costs, this paper applies a sampling method and a strategy for reducing communication costs to DP-FLMD. In addition, differential privacy, a privacy protection technique with rigorous mathematical proof, is also applied to DP-FLMD. Experiments on the DNA datasets show that DP-FLMD has high mining accuracy and runtime efficiency, and the performance of the algorithm is affected by some parameters. ",
    "url": "https://arxiv.org/abs/2304.01689",
    "authors": [
      "Yao Chen",
      "Wensheng Gan",
      "Gengsen Huang",
      "Yongdong Wu",
      "Philip S. Yu"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.01712",
    "title": "Rumour Detection and Analysis on Twitter",
    "abstract": "In recent years people have become increasingly reliant on social media to read news and get information, and some social media users post unsubstantiated information to gain attention. Such information is known as rumours. Nowadays, rumour detection is receiving a growing amount of attention because of the pandemic of the New Coronavirus, which has led to a large number of rumours being spread. In this paper, a Natural Language Processing (NLP) system is built to predict rumours. The best model is applied to the COVID-19 tweets to conduct exploratory data analysis. The contribution of this study is twofold: (1) to compare rumours and facts using state-of-the-art natural language processing models in two dimensions: language structure and propagation route. (2) An analysis of how rumours differ from facts in terms of their lexical use and the emotions they imply. This study shows that linguistic structure is a better feature to distinguish rumours from facts compared to the propagation path. In addition, rumour tweets contain more vocabulary related to politics and negative emotions. ",
    "url": "https://arxiv.org/abs/2304.01712",
    "authors": [
      "Yaohou Fan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01747",
    "title": "Learning Invariant Representation via Contrastive Feature Alignment for  Clutter Robust SAR Target Recognition",
    "abstract": "The deep neural networks (DNNs) have freed the synthetic aperture radar automatic target recognition (SAR ATR) from expertise-based feature designing and demonstrated superiority over conventional solutions. There has been shown the unique deficiency of ground vehicle benchmarks in shapes of strong background correlation results in DNNs overfitting the clutter and being non-robust to unfamiliar surroundings. However, the gap between fixed background model training and varying background application remains underexplored. Inspired by contrastive learning, this letter proposes a solution called Contrastive Feature Alignment (CFA) aiming to learn invariant representation for robust recognition. The proposed method contributes a mixed clutter variants generation strategy and a new inference branch equipped with channel-weighted mean square error (CWMSE) loss for invariant representation learning. In specific, the generation strategy is delicately designed to better attract clutter-sensitive deviation in feature space. The CWMSE loss is further devised to better contrast this deviation and align the deep features activated by the original images and corresponding clutter variants. The proposed CFA combines both classification and CWMSE losses to train the model jointly, which allows for the progressive learning of invariant target representation. Extensive evaluations on the MSTAR dataset and six DNN models prove the effectiveness of our proposal. The results demonstrated that the CFA-trained models are capable of recognizing targets among unfamiliar surroundings that are not included in the dataset, and are robust to varying signal-to-clutter ratios. ",
    "url": "https://arxiv.org/abs/2304.01747",
    "authors": [
      "Bowen Peng",
      "Jianyue Xie",
      "Bo Peng",
      "Li Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01762",
    "title": "Incorporating Unlabelled Data into Bayesian Neural Networks",
    "abstract": "We develop a contrastive framework for learning better prior distributions for Bayesian Neural Networks (BNNs) using unlabelled data. With this framework, we propose a practical BNN algorithm that offers the label-efficiency of self-supervised learning and the principled uncertainty estimates of Bayesian methods. Finally, we demonstrate the advantages of our approach for data-efficient learning in semi-supervised and low-budget active learning problems. ",
    "url": "https://arxiv.org/abs/2304.01762",
    "authors": [
      "Mrinank Sharma",
      "Tom Rainforth",
      "Yee Whye Teh",
      "Vincent Fortuin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.01821",
    "title": "Data Aware Neural Architecture Search",
    "abstract": "Neural Architecture Search (NAS) is a popular tool for automatically generating Neural Network (NN) architectures. In early NAS works, these tools typically optimized NN architectures for a single metric, such as accuracy. However, in the case of resource constrained Machine Learning, one single metric is not enough to evaluate a NN architecture. For example, a NN model achieving a high accuracy is not useful if it does not fit inside the flash memory of a given system. Therefore, recent works on NAS for resource constrained systems have investigated various approaches to optimize for multiple metrics. In this paper, we propose that, on top of these approaches, it could be beneficial for NAS optimization of resource constrained systems to also consider input data granularity. We name such a system \"Data Aware NAS\", and we provide experimental evidence of its benefits by comparing it to traditional NAS. ",
    "url": "https://arxiv.org/abs/2304.01821",
    "authors": [
      "Emil Njor",
      "Jan Madsen",
      "Xenofon Fafoutis"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2304.01826",
    "title": "CGDTest: A Constrained Gradient Descent Algorithm for Testing Neural  Networks",
    "abstract": "In this paper, we propose a new Deep Neural Network (DNN) testing algorithm called the Constrained Gradient Descent (CGD) method, and an implementation we call CGDTest aimed at exposing security and robustness issues such as adversarial robustness and bias in DNNs. Our CGD algorithm is a gradient-descent (GD) method, with the twist that the user can also specify logical properties that characterize the kinds of inputs that the user may want. This functionality sets CGDTest apart from other similar DNN testing tools since it allows users to specify logical constraints to test DNNs not only for $\\ell_p$ ball-based adversarial robustness but, more importantly, includes richer properties such as disguised and flow adversarial constraints, as well as adversarial robustness in the NLP domain. We showcase the utility and power of CGDTest via extensive experimentation in the context of vision and NLP domains, comparing against 32 state-of-the-art methods over these diverse domains. Our results indicate that CGDTest outperforms state-of-the-art testing tools for $\\ell_p$ ball-based adversarial robustness, and is significantly superior in testing for other adversarial robustness, with improvements in PAR2 scores of over 1500% in some cases over the next best tool. Our evaluation shows that our CGD method outperforms competing methods we compared against in terms of expressibility (i.e., a rich constraint language and concomitant tool support to express a wide variety of properties), scalability (i.e., can be applied to very large real-world models with up to 138 million parameters), and generality (i.e., can be used to test a plethora of model architectures). ",
    "url": "https://arxiv.org/abs/2304.01826",
    "authors": [
      "Vineel Nagisetty",
      "Laura Graves",
      "Guanting Pan",
      "Piyush Jha",
      "Vijay Ganesh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2304.01828",
    "title": "Learning Stable and Robust Linear Parameter-Varying State-Space Models",
    "abstract": "This paper presents two direct parameterizations of stable and robust linear parameter-varying state-space (LPV-SS) models. The model parametrizations guarantee a priori that for all parameter values during training, the allowed models are stable in the contraction sense or have their Lipschitz constant bounded by a user-defined value $\\gamma$. Furthermore, since the parametrizations are direct, the models can be trained using unconstrained optimization. The fact that the trained models are of the LPV-SS class makes them useful for, e.g., further convex analysis or controller design. The effectiveness of the approach is demonstrated on an LPV identification problem. ",
    "url": "https://arxiv.org/abs/2304.01828",
    "authors": [
      "Chris Verhoek",
      "Ruigang Wang",
      "Roland Tóth"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01834",
    "title": "Neural Field Convolutions by Repeated Differentiation",
    "abstract": "Neural fields are evolving towards a general-purpose continuous representation for visual computing. Yet, despite their numerous appealing properties, they are hardly amenable to signal processing. As a remedy, we present a method to perform general continuous convolutions with general continuous signals such as neural fields. Observing that piecewise polynomial kernels reduce to a sparse set of Dirac deltas after repeated differentiation, we leverage convolution identities and train a repeated integral field to efficiently execute large-scale convolutions. We demonstrate our approach on a variety of data modalities and spatially-varying kernels. ",
    "url": "https://arxiv.org/abs/2304.01834",
    "authors": [
      "Ntumba Elie Nsampi",
      "Adarsh Djeacoumar",
      "Hans-Peter Seidel",
      "Tobias Ritschel",
      "Thomas Leimkühler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2304.01838",
    "title": "BugNIST -- A New Large Scale Volumetric 3D Image Dataset for  Classification and Detection",
    "abstract": "Progress in 3D volumetric image analysis research is limited by the lack of datasets and most advances in analysis methods for volumetric images are based on medical data. However, medical data do not necessarily resemble the characteristics of other volumetric images such as micro-CT. To promote research in 3D volumetric image analysis beyond medical data, we have created the BugNIST dataset and made it freely available. BugNIST is an extensive dataset of micro-CT scans of 12 types of bugs, such as insects and larvae. BugNIST contains 9437 volumes where 9087 are of individual bugs and 350 are mixtures of bugs and other material. The goal of BugNIST is to benchmark classification and detection methods, and we have designed the detection challenge such that detection models are trained on scans of individual bugs and tested on bug mixtures. Models capable of solving this task will be independent of the context, i.e., the surrounding material. This is a great advantage if the context is unknown or changing, as is often the case in micro-CT. Our initial baseline analysis shows that current state-of-the-art deep learning methods classify individual bugs very well, but has great difficulty with the detection challenge. Hereby, BugNIST enables research in image analysis areas that until now have missed relevant data - both classification, detection, and hopefully more. ",
    "url": "https://arxiv.org/abs/2304.01838",
    "authors": [
      "Anders Bjorholm Dahl",
      "Patrick Møller Jensen",
      "Carsten Gundlach",
      "Rebecca Engberg",
      "Hans Martin Kjer",
      "Vedrana Andersen Dahl"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01857",
    "title": "FAST: Fidelity-Adjustable Semantic Transmission over Heterogeneous  Wireless Networks",
    "abstract": "In this work, we investigate the challenging problem of on-demand semantic communication over heterogeneous wireless networks. We propose a fidelity-adjustable semantic transmission framework (FAST) that empowers wireless devices to send data efficiently under different application scenarios and resource conditions. To this end, we first design a dynamic sub-model training scheme to learn the flexible semantic model, which enables edge devices to customize the transmission fidelity with different widths of the semantic model. After that, we focus on the FAST optimization problem to minimize the system energy consumption with latency and fidelity constraints. Following that, the optimal transmission strategies including the scaling factor of the semantic model, computing frequency, and transmitting power are derived for the devices. Experiment results indicate that, when compared to the baseline transmission schemes, the proposed framework can reduce up to one order of magnitude of the system energy consumption and data size for maintaining reasonable data fidelity. ",
    "url": "https://arxiv.org/abs/2304.01857",
    "authors": [
      "Peichun Li",
      "Guoliang Cheng",
      "Jiawen Kang",
      "Rong Yu",
      "Liping Qian",
      "Yuan Wu",
      "Dusit Niyato"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.01874",
    "title": "Incremental Verification of Neural Networks",
    "abstract": "Complete verification of deep neural networks (DNNs) can exactly determine whether the DNN satisfies a desired trustworthy property (e.g., robustness, fairness) on an infinite set of inputs or not. Despite the tremendous progress to improve the scalability of complete verifiers over the years on individual DNNs, they are inherently inefficient when a deployed DNN is updated to improve its inference speed or accuracy. The inefficiency is because the expensive verifier needs to be run from scratch on the updated DNN. To improve efficiency, we propose a new, general framework for incremental and complete DNN verification based on the design of novel theory, data structure, and algorithms. Our contributions implemented in a tool named IVAN yield an overall geometric mean speedup of 2.4x for verifying challenging MNIST and CIFAR10 classifiers and a geometric mean speedup of 3.8x for the ACAS-XU classifiers over the state-of-the-art baselines. ",
    "url": "https://arxiv.org/abs/2304.01874",
    "authors": [
      "Shubham Ugare",
      "Debangshu Banerjee",
      "Sasa Misailovic",
      "Gagandeep Singh"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2304.01880",
    "title": "Measure theoretic results for approximation by neural networks with  limited weights",
    "abstract": "In this paper, we study approximation properties of single hidden layer neural networks with weights varying on finitely many directions and thresholds from an open interval. We obtain a necessary and at the same time sufficient measure theoretic condition for density of such networks in the space of continuous functions. Further, we prove a density result for neural networks with a specifically constructed activation function and a fixed number of neurons. ",
    "url": "https://arxiv.org/abs/2304.01880",
    "authors": [
      "Vugar Ismailov",
      "Ekrem Savas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Functional Analysis (math.FA)"
    ]
  },
  {
    "id": "arXiv:2304.01882",
    "title": "So, I Can Feel Normal: Participatory Design for Accessible Social Media  Sites for Individuals with Traumatic Brain Injury",
    "abstract": "Traumatic brain injury (TBI) can result in chronic sensorimotor, cognitive, psychosocial, and communication challenges that can limit social participation. Social media can be a useful outlet for social participation for individuals with TBI, but there are barriers to access. While research has drawn attention to the nature of access barriers, few studies have investigated technological solutions to address these barriers, particularly considering the perspectives of individuals with TBI. To address this gap in knowledge, we used a participatory approach to engage 10 adults with TBI in conceptualizing tools to address their challenges accessing Facebook. Participants described multifaceted challenges in using social media, including interface overload, social comparisons, and anxiety over self-presentation and communication after injury. They discussed their needs and preferences and generated ideas for design solutions. Our work contributes to designing assistive and accessibility technology to facilitate an equal access to the benefits of social media for individuals with TBI. ",
    "url": "https://arxiv.org/abs/2304.01882",
    "authors": [
      "Hajin Lim",
      "Lisa Kakonge",
      "Yaxin Hu",
      "Lyn S. Turkstra",
      "Melissa C. Duff",
      "Catalina L. Toma",
      "Bilge Mutlu"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2304.01884",
    "title": "Bearing-based distributed pose estimation for multi-agent networks",
    "abstract": "In this paper, we address the distributed pose estimation problem for multi-agent systems, where the agents have unknown static positions and time-varying orientations. The interaction graph is assumed to be directed and acyclic with two leaders that have access to their position and orientation. We propose a nonlinear distributed pose estimation scheme relying on individual angular velocity measurements and local relative (time-varying) bearing measurements. The proposed estimation scheme consists of two cascaded distributed observers, an almost globally asymptotically stable (AGAS) attitude observer and an input-to-state stable (ISS) position observer, leading to an overall AGAS distributed localization scheme. Numerical simulation results are presented to illustrate the performance of our proposed distributed pose estimation scheme. ",
    "url": "https://arxiv.org/abs/2304.01884",
    "authors": [
      "Mouaad Boughellaba",
      "Abdelhamid Tayebi"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.01890",
    "title": "Sociocultural knowledge is needed for selection of shots in hate speech  detection tasks",
    "abstract": "We introduce HATELEXICON, a lexicon of slurs and targets of hate speech for the countries of Brazil, Germany, India and Kenya, to aid training and interpretability of models. We demonstrate how our lexicon can be used to interpret model predictions, showing that models developed to classify extreme speech rely heavily on target words when making predictions. Further, we propose a method to aid shot selection for training in low-resource settings via HATELEXICON. In few-shot learning, the selection of shots is of paramount importance to model performance. In our work, we simulate a few-shot setting for German and Hindi, using HASOC data for training and the Multilingual HateCheck (MHC) as a benchmark. We show that selecting shots based on our lexicon leads to models performing better on MHC than models trained on shots sampled randomly. Thus, when given only a few training examples, using our lexicon to select shots containing more sociocultural information leads to better few-shot performance. ",
    "url": "https://arxiv.org/abs/2304.01890",
    "authors": [
      "Antonis Maronikolakis",
      "Abdullatif Köksal",
      "Hinrich Schütze"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01895",
    "title": "Robustness Benchmark of Road User Trajectory Prediction Models for  Automated Driving",
    "abstract": "Accurate and robust trajectory predictions of road users are needed to enable safe automated driving. To do this, machine learning models are often used, which can show erratic behavior when presented with previously unseen inputs. In this work, two environment-aware models (MotionCNN and MultiPath++) and two common baselines (Constant Velocity and an LSTM) are benchmarked for robustness against various perturbations that simulate functional insufficiencies observed during model deployment in a vehicle: unavailability of road information, late detections, and noise. Results show significant performance degradation under the presence of these perturbations, with errors increasing up to +1444.8\\% in commonly used trajectory prediction evaluation metrics. Training the models with similar perturbations effectively reduces performance degradation, with error increases of up to +87.5\\%. We argue that despite being an effective mitigation strategy, data augmentation through perturbations during training does not guarantee robustness towards unforeseen perturbations, since identification of all possible on-road complications is unfeasible. Furthermore, degrading the inputs sometimes leads to more accurate predictions, suggesting that the models are unable to learn the true relationships between the different elements in the data. ",
    "url": "https://arxiv.org/abs/2304.01895",
    "authors": [
      "Manuel Muñoz Sánchez",
      "Emilia Silvas",
      "Jos Elfring",
      "René van de Molengraft"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.01896",
    "title": "Topological Filtering for Visual Data Mining and Analysis of Complex  Networks",
    "abstract": "The discovery of small world and scale free properties of many real world networks has revolutionized the way we study, analyze, model and process networks. An important way to analyze these complex networks is to visualize them using graph layout algorithms. Due to their large size and complex connectivity, it is difficult to make deductions from the visual representation of these networks. In this paper, we present a method for interactive analysis of large graphs based on topological filtering, network metrics and visualization. We analyze a number of real world networks and draw interesting conclusions using the proposed method. ",
    "url": "https://arxiv.org/abs/2304.01896",
    "authors": [
      "Faraz Zaidi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2304.01897",
    "title": "InfluencerRank: Discovering Effective Influencers via Graph  Convolutional Attentive Recurrent Neural Networks",
    "abstract": "As influencers play considerable roles in social media marketing, companies increase the budget for influencer marketing. Hiring effective influencers is crucial in social influencer marketing, but it is challenging to find the right influencers among hundreds of millions of social media users. In this paper, we propose InfluencerRank that ranks influencers by their effectiveness based on their posting behaviors and social relations over time. To represent the posting behaviors and social relations, the graph convolutional neural networks are applied to model influencers with heterogeneous networks during different historical periods. By learning the network structure with the embedded node features, InfluencerRank can derive informative representations for influencers at each period. An attentive recurrent neural network finally distinguishes highly effective influencers from other influencers by capturing the knowledge of the dynamics of influencer representations over time. Extensive experiments have been conducted on an Instagram dataset that consists of 18,397 influencers with their 2,952,075 posts published within 12 months. The experimental results demonstrate that InfluencerRank outperforms existing baseline methods. An in-depth analysis further reveals that all of our proposed features and model components are beneficial to discover effective influencers. ",
    "url": "https://arxiv.org/abs/2304.01897",
    "authors": [
      "Seungbae Kim",
      "Jyun-Yu Jiang",
      "Jinyoung Han",
      "Wei Wang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01899",
    "title": "Cross-Class Feature Augmentation for Class Incremental Learning",
    "abstract": "We propose a novel class incremental learning approach by incorporating a feature augmentation technique motivated by adversarial attacks. We employ a classifier learned in the past to complement training examples rather than simply play a role as a teacher for knowledge distillation towards subsequent models. The proposed approach has a unique perspective to utilize the previous knowledge in class incremental learning since it augments features of arbitrary target classes using examples in other classes via adversarial attacks on a previously learned classifier. By allowing the cross-class feature augmentations, each class in the old tasks conveniently populates samples in the feature space, which alleviates the collapse of the decision boundaries caused by sample deficiency for the previous tasks, especially when the number of stored exemplars is small. This idea can be easily incorporated into existing class incremental learning algorithms without any architecture modification. Extensive experiments on the standard benchmarks show that our method consistently outperforms existing class incremental learning methods by significant margins in various scenarios, especially under an environment with an extremely limited memory budget. ",
    "url": "https://arxiv.org/abs/2304.01899",
    "authors": [
      "Taehoon Kim",
      "Jaeyoo Park",
      "Bohyung Han"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01905",
    "title": "Dual-Attention Neural Transducers for Efficient Wake Word Spotting in  Speech Recognition",
    "abstract": "We present dual-attention neural biasing, an architecture designed to boost Wake Words (WW) recognition and improve inference time latency on speech recognition tasks. This architecture enables a dynamic switch for its runtime compute paths by exploiting WW spotting to select which branch of its attention networks to execute for an input audio frame. With this approach, we effectively improve WW spotting accuracy while saving runtime compute cost as defined by floating point operations (FLOPs). Using an in-house de-identified dataset, we demonstrate that the proposed dual-attention network can reduce the compute cost by $90\\%$ for WW audio frames, with only $1\\%$ increase in the number of parameters. This architecture improves WW F1 score by $16\\%$ relative and improves generic rare word error rate by $3\\%$ relative compared to the baselines. ",
    "url": "https://arxiv.org/abs/2304.01905",
    "authors": [
      "Saumya Y. Sahai",
      "Jing Liu",
      "Thejaswi Muniyappa",
      "Kanthashree M. Sathyendra",
      "Anastasios Alexandridis",
      "Grant P. Strimel",
      "Ross McGowan",
      "Ariya Rastrow",
      "Feng-Ju Chang",
      "Athanasios Mouchtaris",
      "Siegfried Kunzmann"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2304.01910",
    "title": "Calibrated Chaos: Variance Between Runs of Neural Network Training is  Harmless and Inevitable",
    "abstract": "Typical neural network trainings have substantial variance in test-set performance between repeated runs, impeding hyperparameter comparison and training reproducibility. We present the following results towards understanding this variation. (1) Despite having significant variance on their test-sets, we demonstrate that standard CIFAR-10 and ImageNet trainings have very little variance in their performance on the test-distributions from which those test-sets are sampled, suggesting that variance is less of a practical issue than previously thought. (2) We present a simplifying statistical assumption which closely approximates the structure of the test-set accuracy distribution. (3) We argue that test-set variance is inevitable in the following two senses. First, we show that variance is largely caused by high sensitivity of the training process to initial conditions, rather than by specific sources of randomness like the data order and augmentations. Second, we prove that variance is unavoidable given the observation that ensembles of trained networks are well-calibrated. (4) We conduct preliminary studies of distribution-shift, fine-tuning, data augmentation and learning rate through the lens of variance between runs. ",
    "url": "https://arxiv.org/abs/2304.01910",
    "authors": [
      "Keller Jordan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01911",
    "title": "Inverting the SerDes Link Design Flow Process",
    "abstract": "The traditional SerDes link simulation process begins with the extraction of printed circuit board (PCB) physical stripline and via models, followed by channel modeling and link simulation. We invert this simulation flow by first creating link performance curves across an array of hypothetical channels defined with specially-developed, high level, equation-based models; limited physical extraction is later undertaken to relate PCB channel implementation to these performance curves. These curves allow us to determine the system-level SerDes channel requirements and to become better informed in choosing PCB technologies for lower cost and easier manufacturability. The inverted modeling process is very efficient, allowing for the rapid identification and avoidance of problematic channel topologies and the study of other potentially useful channel designs. ",
    "url": "https://arxiv.org/abs/2304.01911",
    "authors": [
      "Michael J. Degerstrom",
      "Chad M. Smutzer",
      "Patrick J. Zabinski",
      "Barry K. Gilbert"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.01914",
    "title": "Accelerating and Compressing Deep Neural Networks for Massive MIMO CSI  Feedback",
    "abstract": "The recent advances in machine learning and deep neural networks have made them attractive candidates for wireless communications functions such as channel estimation, decoding, and downlink channel state information (CSI) compression. However, most of these neural networks are large and inefficient making it a barrier for deployment in practical wireless systems that require low-latency and low memory footprints for individual network functions. To mitigate these limitations, we propose accelerated and compressed efficient neural networks for massive MIMO CSI feedback. Specifically, we have thoroughly investigated the adoption of network pruning, post-training dynamic range quantization, and weight clustering to optimize CSI feedback compression for massive MIMO systems. Furthermore, we have deployed the proposed model compression techniques on commodity hardware and demonstrated that in order to achieve inference gains, specialized libraries that accelerate computations for sparse neural networks are required. Our findings indicate that there is remarkable value in applying these model compression techniques and the proposed joint pruning and quantization approach reduced model size by 86.5% and inference time by 76.2% with minimal impact to model accuracy. These compression methods are crucial to pave the way for practical adoption and deployments of deep learning-based techniques in commercial wireless systems. ",
    "url": "https://arxiv.org/abs/2304.01914",
    "authors": [
      "Omar Erak",
      "Hatem Abou-Zeid"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.01926",
    "title": "High-Throughput Vector Similarity Search in Knowledge Graphs",
    "abstract": "There is an increasing adoption of machine learning for encoding data into vectors to serve online recommendation and search use cases. As a result, recent data management systems propose augmenting query processing with online vector similarity search. In this work, we explore vector similarity search in the context of Knowledge Graphs (KGs). Motivated by the tasks of finding related KG queries and entities for past KG query workloads, we focus on hybrid vector similarity search (hybrid queries for short) where part of the query corresponds to vector similarity search and part of the query corresponds to predicates over relational attributes associated with the underlying data vectors. For example, given past KG queries for a song entity, we want to construct new queries for new song entities whose vector representations are close to the vector representation of the entity in the past KG query. But entities in a KG also have non-vector attributes such as a song associated with an artist, a genre, and a release date. Therefore, suggested entities must also satisfy query predicates over non-vector attributes beyond a vector-based similarity predicate. While these tasks are central to KGs, our contributions are generally applicable to hybrid queries. In contrast to prior works that optimize online queries, we focus on enabling efficient batch processing of past hybrid query workloads. We present our system, HQI, for high-throughput batch processing of hybrid queries. We introduce a workload-aware vector data partitioning scheme to tailor the vector index layout to the given workload and describe a multi-query optimization technique to reduce the overhead of vector similarity computations. We evaluate our methods on industrial workloads and demonstrate that HQI yields a 31x improvement in throughput for finding related KG queries compared to existing hybrid query processing approaches. ",
    "url": "https://arxiv.org/abs/2304.01926",
    "authors": [
      "Jason Mohoney",
      "Anil Pacaci",
      "Shihabur Rahman Chowdhury",
      "Ali Mousavi",
      "Ihab F. Ilyas",
      "Umar Farooq Minhas",
      "Jeffrey Pound",
      "Theodoros Rekatsinas"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01948",
    "title": "Network Visualization of ChatGPT Research: a study based on term and  keyword co-occurrence network analysis",
    "abstract": "The main objective of this paper is to identify the major research areas of ChatGPT through term and keyword co-occurrence network mapping techniques. For conducting the present study, total of 577 publications were retrieved from the Lens database for the network visualization. The findings of the study showed that chatgpt occurrence in maximum number of times followed by its related terms such as artificial intelligence, large language model, gpt, study etc. This study will be helpful to library and information science as well as computer or information technology professionals. ",
    "url": "https://arxiv.org/abs/2304.01948",
    "authors": [
      "Deep Kumar Kirtania"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Digital Libraries (cs.DL)"
    ]
  },
  {
    "id": "arXiv:2304.01959",
    "title": "Randomized Adversarial Style Perturbations for Domain Generalization",
    "abstract": "We propose a novel domain generalization technique, referred to as Randomized Adversarial Style Perturbation (RASP), which is motivated by the observation that the characteristics of each domain are captured by the feature statistics corresponding to style. The proposed algorithm perturbs the style of a feature in an adversarial direction towards a randomly selected class, and makes the model learn against being misled by the unexpected styles observed in unseen target domains. While RASP is effective to handle domain shifts, its naive integration into the training procedure might degrade the capability of learning knowledge from source domains because it has no restriction on the perturbations of representations. This challenge is alleviated by Normalized Feature Mixup (NFM), which facilitates the learning of the original features while achieving robustness to perturbed representations via their mixup during training. We evaluate the proposed algorithm via extensive experiments on various benchmarks and show that our approach improves domain generalization performance, especially in large-scale benchmarks. ",
    "url": "https://arxiv.org/abs/2304.01959",
    "authors": [
      "Taehoon Kim",
      "Bohyung Han"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01962",
    "title": "Ethylene Leak Detection Based on Infrared Imaging: A Benchmark",
    "abstract": "Ethylene leakage detection has become one of the most important research directions in the field of target detection due to the fact that ethylene leakage in the petrochemical industry is closely related to production safety and environmental pollution. Under infrared conditions, there are many factors that affect the texture characteristics of ethylene, such as ethylene concentration, background, and so on. We find that the detection criteria used in infrared imaging ethylene leakage detection research cannot fully reflect real-world production conditions, which is not conducive to evaluate the performance of current image-based target detection methods. Therefore, we create a new infrared image dataset of ethylene leakage with different concentrations and backgrounds, including 54275 images. We use the proposed dataset benchmark to evaluate seven advanced image-based target detection algorithms. Experimental results demonstrate the performance and limitations of existing algorithms, and the dataset benchmark has good versatility and effectiveness. ",
    "url": "https://arxiv.org/abs/2304.01962",
    "authors": [
      "Xuanchao Ma",
      "Yuchen Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01988",
    "title": "SM/VIO: Robust Underwater State Estimation Switching Between Model-based  and Visual Inertial Odometry",
    "abstract": "This paper addresses the robustness problem of visual-inertial state estimation for underwater operations. Underwater robots operating in a challenging environment are required to know their pose at all times. All vision-based localization schemes are prone to failure due to poor visibility conditions, color loss, and lack of features. The proposed approach utilizes a model of the robot's kinematics together with proprioceptive sensors to maintain the pose estimate during visual-inertial odometry (VIO) failures. Furthermore, the trajectories from successful VIO and the ones from the model-driven odometry are integrated in a coherent set that maintains a consistent pose at all times. Health-monitoring tracks the VIO process ensuring timely switches between the two estimators. Finally, loop closure is implemented on the overall trajectory. The resulting framework is a robust estimator switching between model-based and visual-inertial odometry (SM/VIO). Experimental results from numerous deployments of the Aqua2 vehicle demonstrate the robustness of our approach over coral reefs and a shipwreck. ",
    "url": "https://arxiv.org/abs/2304.01988",
    "authors": [
      "Bharat Joshi",
      "Hunter Damron",
      "Sharmin Rahman",
      "Ioannis Rekleitis"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02001",
    "title": "MonoHuman: Animatable Human Neural Field from Monocular Video",
    "abstract": "Animating virtual avatars with free-view control is crucial for various applications like virtual reality and digital entertainment. Previous studies have attempted to utilize the representation power of the neural radiance field (NeRF) to reconstruct the human body from monocular videos. Recent works propose to graft a deformation network into the NeRF to further model the dynamics of the human neural field for animating vivid human motions. However, such pipelines either rely on pose-dependent representations or fall short of motion coherency due to frame-independent optimization, making it difficult to generalize to unseen pose sequences realistically. In this paper, we propose a novel framework MonoHuman, which robustly renders view-consistent and high-fidelity avatars under arbitrary novel poses. Our key insight is to model the deformation field with bi-directional constraints and explicitly leverage the off-the-peg keyframe information to reason the feature correlations for coherent results. Specifically, we first propose a Shared Bidirectional Deformation module, which creates a pose-independent generalizable deformation field by disentangling backward and forward deformation correspondences into shared skeletal motion weight and separate non-rigid motions. Then, we devise a Forward Correspondence Search module, which queries the correspondence feature of keyframes to guide the rendering network. The rendered results are thus multi-view consistent with high fidelity, even under challenging novel pose settings. Extensive experiments demonstrate the superiority of our proposed MonoHuman over state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2304.02001",
    "authors": [
      "Zhengming Yu",
      "Wei Cheng",
      "Xian Liu",
      "Wayne Wu",
      "Kwan-Yee Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2304.02008",
    "title": "GlueStick: Robust Image Matching by Sticking Points and Lines Together",
    "abstract": "Line segments are powerful features complementary to points. They offer structural cues, robust to drastic viewpoint and illumination changes, and can be present even in texture-less areas. However, describing and matching them is more challenging compared to points due to partial occlusions, lack of texture, or repetitiveness. This paper introduces a new matching paradigm, where points, lines, and their descriptors are unified into a single wireframe structure. We propose GlueStick, a deep matching Graph Neural Network (GNN) that takes two wireframes from different images and leverages the connectivity information between nodes to better glue them together. In addition to the increased efficiency brought by the joint matching, we also demonstrate a large boost of performance when leveraging the complementary nature of these two features in a single architecture. We show that our matching strategy outperforms the state-of-the-art approaches independently matching line segments and points for a wide variety of datasets and tasks. The code is available at https://github.com/cvg/GlueStick. ",
    "url": "https://arxiv.org/abs/2304.02008",
    "authors": [
      "Rémi Pautrat",
      "Iago Suárez",
      "Yifan Yu",
      "Marc Pollefeys",
      "Viktor Larsson"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02009",
    "title": "OrienterNet: Visual Localization in 2D Public Maps with Neural Matching",
    "abstract": "Humans can orient themselves in their 3D environments using simple 2D maps. Differently, algorithms for visual localization mostly rely on complex 3D point clouds that are expensive to build, store, and maintain over time. We bridge this gap by introducing OrienterNet, the first deep neural network that can localize an image with sub-meter accuracy using the same 2D semantic maps that humans use. OrienterNet estimates the location and orientation of a query image by matching a neural Bird's-Eye View with open and globally available maps from OpenStreetMap, enabling anyone to localize anywhere such maps are available. OrienterNet is supervised only by camera poses but learns to perform semantic matching with a wide range of map elements in an end-to-end manner. To enable this, we introduce a large crowd-sourced dataset of images captured across 12 cities from the diverse viewpoints of cars, bikes, and pedestrians. OrienterNet generalizes to new datasets and pushes the state of the art in both robotics and AR scenarios. The code and trained model will be released publicly. ",
    "url": "https://arxiv.org/abs/2304.02009",
    "authors": [
      "Paul-Edouard Sarlin",
      "Daniel DeTone",
      "Tsun-Yi Yang",
      "Armen Avetisyan",
      "Julian Straub",
      "Tomasz Malisiewicz",
      "Samuel Rota Bulo",
      "Richard Newcombe",
      "Peter Kontschieder",
      "Vasileios Balntas"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.02010",
    "title": "Multi-Level Contrastive Learning for Dense Prediction Task",
    "abstract": "In this work, we present Multi-Level Contrastive Learning for Dense Prediction Task (MCL), an efficient self-supervised method for learning region-level feature representation for dense prediction tasks. Our method is motivated by the three key factors in detection: localization, scale consistency and recognition. To explicitly encode absolute position and scale information, we propose a novel pretext task that assembles multi-scale images in a montage manner to mimic multi-object scenarios. Unlike the existing image-level self-supervised methods, our method constructs a multi-level contrastive loss that considers each sub-region of the montage image as a singleton. Our method enables the neural network to learn regional semantic representations for translation and scale consistency while reducing pre-training epochs to the same as supervised pre-training. Extensive experiments demonstrate that MCL consistently outperforms the recent state-of-the-art methods on various datasets with significant margins. In particular, MCL obtains 42.5 AP$^\\mathrm{bb}$ and 38.3 AP$^\\mathrm{mk}$ on COCO with the 1x schedule fintuning, when using Mask R-CNN with R50-FPN backbone pre-trained with 100 epochs. In comparison to MoCo, our method surpasses their performance by 4.0 AP$^\\mathrm{bb}$ and 3.1 AP$^\\mathrm{mk}$. Furthermore, we explore the alignment between pretext task and downstream tasks. We extend our pretext task to supervised pre-training, which achieves a similar performance to self-supervised learning. This result demonstrates the importance of the alignment between pretext task and downstream tasks, indicating the potential for wider applicability of our method beyond self-supervised settings. ",
    "url": "https://arxiv.org/abs/2304.02010",
    "authors": [
      "Qiushan Guo",
      "Yizhou Yu",
      "Yi Jiang",
      "Jiannan Wu",
      "Zehuan Yuan",
      "Ping Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.02011",
    "title": "FakET: Simulating Cryo-Electron Tomograms with Neural Style Transfer",
    "abstract": "Particle localization and -classification constitute two of the most fundamental problems in computational microscopy. In recent years, deep learning based approaches have been introduced for these tasks with great success. A key shortcoming of these supervised learning methods is their need for large training data sets, typically generated from particle models in conjunction with complex numerical forward models simulating the physics of transmission electron microscopes. Computer implementations of such forward models are computationally extremely demanding and limit the scope of their applicability. In this paper we propose a simple method for simulating the forward operator of an electron microscope based on additive noise and Neural Style Transfer techniques. We evaluate the method on localization and classification tasks using one of the established state-of-the-art architectures showing performance on par with the benchmark. In contrast to previous approaches, our method accelerates the data generation process by a factor of 750 while using 33 times less memory and scales well to typical transmission electron microscope detector sizes. It utilizes GPU acceleration and parallel processing. It can be used as a stand-alone method to adapt a training data set or as a data augmentation technique. The source code is available at https://gitlab.com/deepet/faket. ",
    "url": "https://arxiv.org/abs/2304.02011",
    "authors": [
      "Pavol Harar",
      "Lukas Herrmann",
      "Philipp Grohs",
      "David Haselbach"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2304.02013",
    "title": "NPC: Neural Point Characters from Video",
    "abstract": "High-fidelity human 3D models can now be learned directly from videos, typically by combining a template-based surface model with neural representations. However, obtaining a template surface requires expensive multi-view capture systems, laser scans, or strictly controlled conditions. Previous methods avoid using a template but rely on a costly or ill-posed mapping from observation to canonical space. We propose a hybrid point-based representation for reconstructing animatable characters that does not require an explicit surface model, while being generalizable to novel poses. For a given video, our method automatically produces an explicit set of 3D points representing approximate canonical geometry, and learns an articulated deformation model that produces pose-dependent point transformations. The points serve both as a scaffold for high-frequency neural features and an anchor for efficiently mapping between observation and canonical space. We demonstrate on established benchmarks that our representation overcomes limitations of prior work operating in either canonical or in observation space. Moreover, our automatic point extraction approach enables learning models of human and animal characters alike, matching the performance of the methods using rigged surface templates despite being more general. Project website: https://lemonatsu.github.io/npc/ ",
    "url": "https://arxiv.org/abs/2304.02013",
    "authors": [
      "Shih-Yang Su",
      "Timur Bagautdinov",
      "Helge Rhodin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01234",
    "title": "Prediction of solar wind speed by applying convolutional neural network  to potential field source surface (PFSS) magnetograms",
    "abstract": "An accurate solar wind speed model is important for space weather predictions, catastrophic event warnings, and other issues concerning solar wind - magnetosphere interaction. In this work, we construct a model based on convolutional neural network (CNN) and Potential Field Source Surface (PFSS) magnetograms, considering a solar wind source surface of $R_{\\rm SS}=2.5R_\\odot$, aiming to predict the solar wind speed at the Lagrange 1 (L1) point of the Sun-Earth system. The input of our model consists of four Potential Field Source Surface (PFSS) magnetograms at $R_{\\rm SS}$, which are 7, 6, 5, and 4 days before the target epoch. Reduced magnetograms are used to promote the model's efficiency. We use the Global Oscillation Network Group (GONG) photospheric magnetograms and the potential field extrapolation model to generate PFSS magnetograms at the source surface. The model provides predictions of the continuous test dataset with an averaged correlation coefficient (CC) of 0.52 and a root mean square error (RMSE) of 80.8 km/s in an eight-fold validation training scheme with the time resolution of the data as small as one hour. The model also has the potential to forecast high speed streams of the solar wind, which can be quantified with a general threat score of 0.39. ",
    "url": "https://arxiv.org/abs/2304.01234",
    "authors": [
      "Rong Lin",
      "Zhekai Luo",
      "Jiansen He",
      "Lun Xie",
      "Chuanpeng Hou",
      "Shuwei Chen"
    ],
    "subjectives": [
      "Solar and Stellar Astrophysics (astro-ph.SR)",
      "Earth and Planetary Astrophysics (astro-ph.EP)",
      "Machine Learning (cs.LG)",
      "Plasma Physics (physics.plasm-ph)",
      "Space Physics (physics.space-ph)"
    ]
  },
  {
    "id": "arXiv:2304.01236",
    "title": "Astronomical image time series classification using CONVolutional  attENTION (ConvEntion)",
    "abstract": "Aims. The treatment of astronomical image time series has won increasing attention in recent years. Indeed, numerous surveys following up on transient objects are in progress or under construction, such as the Vera Rubin Observatory Legacy Survey for Space and Time (LSST), which is poised to produce huge amounts of these time series. The associated scientific topics are extensive, ranging from the study of objects in our galaxy to the observation of the most distant supernovae for measuring the expansion of the universe. With such a large amount of data available, the need for robust automatic tools to detect and classify celestial objects is growing steadily. Methods. This study is based on the assumption that astronomical images contain more information than light curves. In this paper, we propose a novel approach based on deep learning for classifying different types of space objects directly using images. We named our approach ConvEntion, which stands for CONVolutional attENTION. It is based on convolutions and transformers, which are new approaches for the treatment of astronomical image time series. Our solution integrates spatio-temporal features and can be applied to various types of image datasets with any number of bands. Results. In this work, we solved various problems the datasets tend to suffer from and we present new results for classifications using astronomical image time series with an increase in accuracy of 13%, compared to state-of-the-art approaches that use image time series, and a 12% increase, compared to approaches that use light curves. ",
    "url": "https://arxiv.org/abs/2304.01236",
    "authors": [
      "Anass Bairouk",
      "Marc Chaumont",
      "Dominique Fouchez",
      "Jerome Paquet",
      "Frédéric Comby",
      "Julian Bautista"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01329",
    "title": "Learning the Delay Using Neural Delay Differential Equations",
    "abstract": "The intersection of machine learning and dynamical systems has generated considerable interest recently. Neural Ordinary Differential Equations (NODEs) represent a rich overlap between these fields. In this paper, we develop a continuous time neural network approach based on Delay Differential Equations (DDEs). Our model uses the adjoint sensitivity method to learn the model parameters and delay directly from data. Our approach is inspired by that of NODEs and extends earlier neural DDE models, which have assumed that the value of the delay is known a priori. We perform a sensitivity analysis on our proposed approach and demonstrate its ability to learn DDE parameters from benchmark systems. We conclude our discussion with potential future directions and applications. ",
    "url": "https://arxiv.org/abs/2304.01329",
    "authors": [
      "Maria Oprea",
      "Mark Walth",
      "Robert Stephany",
      "Gabriella Torres Nothaft",
      "Arnaldo Rodriguez-Gonzalez",
      "William Clark"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01335",
    "title": "Charting the Topography of the Neural Network Landscape with  Thermal-Like Noise",
    "abstract": "The training of neural networks is a complex, high-dimensional, non-convex and noisy optimization problem whose theoretical understanding is interesting both from an applicative perspective and for fundamental reasons. A core challenge is to understand the geometry and topography of the landscape that guides the optimization. In this work, we employ standard Statistical Mechanics methods, namely, phase-space exploration using Langevin dynamics, to study this landscape for an over-parameterized fully connected network performing a classification task on random data. Analyzing the fluctuation statistics, in analogy to thermal dynamics at a constant temperature, we infer a clear geometric description of the low-loss region. We find that it is a low-dimensional manifold whose dimension can be readily obtained from the fluctuations. Furthermore, this dimension is controlled by the number of data points that reside near the classification decision boundary. Importantly, we find that a quadratic approximation of the loss near the minimum is fundamentally inadequate due to the exponential nature of the decision boundary and the flatness of the low-loss region. This causes the dynamics to sample regions with higher curvature at higher temperatures, while producing quadratic-like statistics at any given temperature. We explain this behavior by a simplified loss model which is analytically tractable and reproduces the observed fluctuation statistics. ",
    "url": "https://arxiv.org/abs/2304.01335",
    "authors": [
      "Theo Jules",
      "Gal Brener",
      "Tal Kachman",
      "Noam Levi",
      "Yohai Bar-Sinai"
    ],
    "subjectives": [
      "Statistical Mechanics (cond-mat.stat-mech)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01343",
    "title": "Distributionally robust mixed-integer programming with Wasserstein  metric: on the value of uncertain data",
    "abstract": "This study addresses a class of linear mixed-integer programming (MIP) problems that involve uncertainty in the objective function coefficients. The coefficients are assumed to form a random vector, which probability distribution can only be observed through a finite training data set. Unlike most of the related studies in the literature, we also consider uncertainty in the underlying data set. The data uncertainty is described by a set of linear constraints for each random sample, and the uncertainty in the distribution (for a fixed realization of data) is defined using a type-1 Wasserstein ball centered at the empirical distribution of the data. The overall problem is formulated as a three-level distributionally robust optimization (DRO) problem. We prove that for a class of bi-affine loss functions the three-level problem admits a linear MIP reformulation. Furthermore, it turns out that in several important particular cases the three-level problem can be solved reasonably fast by leveraging the nominal MIP problem. Finally, we conduct a computational study, where the out-of-sample performance of our model and computational complexity of the proposed MIP reformulation are explored numerically for several application domains. ",
    "url": "https://arxiv.org/abs/2304.01343",
    "authors": [
      "Sergey S. Ketkov"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2304.01347",
    "title": "Temporal Dynamic Synchronous Functional Brain Network for Schizophrenia  Diagnosis and Lateralization Analysis",
    "abstract": "Available evidence suggests that dynamic functional connectivity (dFC) can capture time-varying abnormalities in brain activity in rs-fMRI data and has a natural advantage in uncovering mechanisms of abnormal brain activity in schizophrenia(SZ) patients. Hence, an advanced dynamic brain network analysis model called the temporal brain category graph convolutional network (temporal-BCGCN) was employed. Firstly, a unique dynamic brain network analysis module, DSF-BrainNet, was designed to construct dynamic synchronization features. Subsequently, a revolutionary graph convolution method, TemporalConv, was proposed, based on the synchronous temporal properties of feature. Finally, the first modular abnormal hemispherical lateralization test tool in deep learning based on rs-fMRI data, named CategoryPool, was proposed. This study was validated on COBRE and UCLA datasets and achieved 83.62% and 89.71% average accuracy, respectively, outperforming the baseline model and other State-of-the-Art methods. The ablation results also demonstrate the advantages of TemporalConv over the traditional edge feature convolution approach of graph convolutional neural network (GCN) and the improvement of CategoryPool over the classical graph pooling approach. Interestingly, this study showed that the lower order perceptual system and higher order network regions in the left hemisphere are more severely dysfunctional than in the right hemisphere of SZ, and reaffirms the importance of the left medial superior frontal gyrus in SZ. Our core code is available at: https://github.com/swfen/Temporal-BCGCN. ",
    "url": "https://arxiv.org/abs/2304.01347",
    "authors": [
      "Cheng Zhu",
      "Ying Tan",
      "Shuqi Yang",
      "Jiaqing Miao",
      "Jiayi Zhu",
      "Huan Huang",
      "Dezhong Yao",
      "Cheng Luo"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2304.01348",
    "title": "Methods for Estimating Neural Information",
    "abstract": "Estimating the Shannon information associated with individual neurons is a non-trivial problem. Three key methods used to estimate the mutual information between neuron inputs and outputs are described, and a list of further readings is provided. ",
    "url": "https://arxiv.org/abs/2304.01348",
    "authors": [
      "James V Stone"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2304.01349",
    "title": "Optimized EEG based mood detection with signal processing and deep  neural networks for brain-computer interface",
    "abstract": "Electroencephalogram (EEG) is a very promising and widely implemented procedure to study brain signals and activities by amplifying and measuring the post-synaptical potential arising from electrical impulses produced by neurons and detected by specialized electrodes attached to specific points in the scalp. It can be studied for detecting brain abnormalities, headaches, and other conditions. However, there are limited studies performed to establish a smart decision-making model to identify EEG's relation with the mood of the subject. In this experiment, EEG signals of 28 healthy human subjects have been observed with consent and attempts have been made to study and recognise moods. Savitzky-Golay band-pass filtering and Independent Component Analysis have been used for data filtration.Different neural network algorithms have been implemented to analyze and classify the EEG data based on the mood of the subject. The model is further optimised by the usage of Blackman window-based Fourier Transformation and extracting the most significant frequencies for each electrode. Using these techniques, up to 96.01% detection accuracy has been obtained. ",
    "url": "https://arxiv.org/abs/2304.01349",
    "authors": [
      "Subhrangshu Adhikary",
      "Kushal Jain",
      "Biswajit Saha",
      "Deepraj Chowdhury"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.01355",
    "title": "Adaptive SpikeDeep-Classifier: Self-organizing and self-supervised  machine learning algorithm for online spike sorting",
    "abstract": "Objective. Research on brain-computer interfaces (BCIs) is advancing towards rehabilitating severely disabled patients in the real world. Two key factors for successful decoding of user intentions are the size of implanted microelectrode arrays and a good online spike sorting algorithm. A small but dense microelectrode array with 3072 channels was recently developed for decoding user intentions. The process of spike sorting determines the spike activity (SA) of different sources (neurons) from recorded neural data. Unfortunately, current spike sorting algorithms are unable to handle the massively increasing amount of data from dense microelectrode arrays, making spike sorting a fragile component of the online BCI decoding framework. Approach. We proposed an adaptive and self-organized algorithm for online spike sorting, named Adaptive SpikeDeep-Classifier (Ada-SpikeDeepClassifier), which uses SpikeDeeptector for channel selection, an adaptive background activity rejector (Ada-BAR) for discarding background events, and an adaptive spike classifier (Ada-Spike classifier) for classifying the SA of different neural units. Results. Our algorithm outperformed our previously published SpikeDeep-Classifier and eight other spike sorting algorithms, as evaluated on a human dataset and a publicly available simulated dataset. Significance. The proposed algorithm is the first spike sorting algorithm that automatically learns the abrupt changes in the distribution of noise and SA. It is an artificial neural network-based algorithm that is well-suited for hardware implementation on neuromorphic chips that can be used for wearable invasive BCIs. ",
    "url": "https://arxiv.org/abs/2304.01355",
    "authors": [
      "Muhammad Saif-ur-Rehman",
      "Omair Ali",
      "Christian Klaes",
      "Ioannis Iossifidis"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Information Theory (cs.IT)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01441",
    "title": "NetFlick: Adversarial Flickering Attacks on Deep Learning Based Video  Compression",
    "abstract": "Video compression plays a significant role in IoT devices for the efficient transport of visual data while satisfying all underlying bandwidth constraints. Deep learning-based video compression methods are rapidly replacing traditional algorithms and providing state-of-the-art results on edge devices. However, recently developed adversarial attacks demonstrate that digitally crafted perturbations can break the Rate-Distortion relationship of video compression. In this work, we present a real-world LED attack to target video compression frameworks. Our physically realizable attack, dubbed NetFlick, can degrade the spatio-temporal correlation between successive frames by injecting flickering temporal perturbations. In addition, we propose universal perturbations that can downgrade performance of incoming video without prior knowledge of the contents. Experimental results demonstrate that NetFlick can successfully deteriorate the performance of video compression frameworks in both digital- and physical-settings and can be further extended to attack downstream video classification networks. ",
    "url": "https://arxiv.org/abs/2304.01441",
    "authors": [
      "Jung-Woo Chang",
      "Nojan Sheybani",
      "Shehzeen Samarah Hussain",
      "Mojan Javaheripi",
      "Seira Hidano",
      "Farinaz Koushanfar"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01541",
    "title": "Privacy Amplification via Compression: Achieving the Optimal  Privacy-Accuracy-Communication Trade-off in Distributed Mean Estimation",
    "abstract": "Privacy and communication constraints are two major bottlenecks in federated learning (FL) and analytics (FA). We study the optimal accuracy of mean and frequency estimation (canonical models for FL and FA respectively) under joint communication and $(\\varepsilon, \\delta)$-differential privacy (DP) constraints. We show that in order to achieve the optimal error under $(\\varepsilon, \\delta)$-DP, it is sufficient for each client to send $\\Theta\\left( n \\min\\left(\\varepsilon, \\varepsilon^2\\right)\\right)$ bits for FL and $\\Theta\\left(\\log\\left( n\\min\\left(\\varepsilon, \\varepsilon^2\\right) \\right)\\right)$ bits for FA to the server, where $n$ is the number of participating clients. Without compression, each client needs $O(d)$ bits and $\\log d$ bits for the mean and frequency estimation problems respectively (where $d$ corresponds to the number of trainable parameters in FL or the domain size in FA), which means that we can get significant savings in the regime $ n \\min\\left(\\varepsilon, \\varepsilon^2\\right) = o(d)$, which is often the relevant regime in practice. Our algorithms leverage compression for privacy amplification: when each client communicates only partial information about its sample, we show that privacy can be amplified by randomly selecting the part contributed by each client. ",
    "url": "https://arxiv.org/abs/2304.01541",
    "authors": [
      "Wei-Ning Chen",
      "Dan Song",
      "Ayfer Ozgur",
      "Peter Kairouz"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01561",
    "title": "Optimal rates of approximation by shallow ReLU$^k$ neural networks and  applications to nonparametric regression",
    "abstract": "We study the approximation capacity of some variation spaces corresponding to shallow ReLU$^k$ neural networks. It is shown that sufficiently smooth functions are contained in these spaces with finite variation norms. For functions with less smoothness, the approximation rates in terms of the variation norm are established. Using these results, we are able to prove the optimal approximation rates in terms of the number of neurons for shallow ReLU$^k$ neural networks. It is also shown how these results can be used to derive approximation bounds for deep neural networks and convolutional neural networks (CNNs). As applications, we study convergence rates for nonparametric regression using three ReLU neural network models: shallow neural network, over-parameterized neural network, and CNN. In particular, we show that shallow neural networks can achieve the minimax optimal rates for learning H\\\"older functions, which complements recent results for deep neural networks. It is also proven that over-parameterized (deep or shallow) neural networks can achieve nearly optimal rates for nonparametric regression. ",
    "url": "https://arxiv.org/abs/2304.01561",
    "authors": [
      "Yunfei Yang",
      "Ding-Xuan Zhou"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01568",
    "title": "Arrhythmia Classifier Based on Ultra-Lightweight Binary Neural Network",
    "abstract": "Reasonably and effectively monitoring arrhythmias through ECG signals has significant implications for human health. With the development of deep learning, numerous ECG classification algorithms based on deep learning have emerged. However, most existing algorithms trade off high accuracy for complex models, resulting in high storage usage and power consumption. This also inevitably increases the difficulty of implementation on wearable Artificial Intelligence-of-Things (AIoT) devices with limited resources. In this study, we proposed a universally applicable ultra-lightweight binary neural network(BNN) that is capable of 5-class and 17-class arrhythmia classification based on ECG signals. Our BNN achieves 96.90% (full precision 97.09%) and 97.50% (full precision 98.00%) accuracy for 5-class and 17-class classification, respectively, with state-of-the-art storage usage (3.76 KB and 4.45 KB). Compared to other binarization works, our approach excels in supporting two multi-classification modes while achieving the smallest known storage space. Moreover, our model achieves optimal accuracy in 17-class classification and boasts an elegantly simple network architecture. The algorithm we use is optimized specifically for hardware implementation. Our research showcases the potential of lightweight deep learning models in the healthcare industry, specifically in wearable medical devices, which hold great promise for improving patient outcomes and quality of life. Code is available on: https://github.com/xpww/ECG_BNN_Net ",
    "url": "https://arxiv.org/abs/2304.01568",
    "authors": [
      "Ninghao Pu",
      "Zhongxing Wu",
      "Ao Wang",
      "Hanshi Sun",
      "Zijin Liu",
      "Hao Liu"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01576",
    "title": "MESAHA-Net: Multi-Encoders based Self-Adaptive Hard Attention Network  with Maximum Intensity Projections for Lung Nodule Segmentation in CT Scan",
    "abstract": "Accurate lung nodule segmentation is crucial for early-stage lung cancer diagnosis, as it can substantially enhance patient survival rates. Computed tomography (CT) images are widely employed for early diagnosis in lung nodule analysis. However, the heterogeneity of lung nodules, size diversity, and the complexity of the surrounding environment pose challenges for developing robust nodule segmentation methods. In this study, we propose an efficient end-to-end framework, the multi-encoder-based self-adaptive hard attention network (MESAHA-Net), for precise lung nodule segmentation in CT scans. MESAHA-Net comprises three encoding paths, an attention block, and a decoder block, facilitating the integration of three types of inputs: CT slice patches, forward and backward maximum intensity projection (MIP) images, and region of interest (ROI) masks encompassing the nodule. By employing a novel adaptive hard attention mechanism, MESAHA-Net iteratively performs slice-by-slice 2D segmentation of lung nodules, focusing on the nodule region in each slice to generate 3D volumetric segmentation of lung nodules. The proposed framework has been comprehensively evaluated on the LIDC-IDRI dataset, the largest publicly available dataset for lung nodule segmentation. The results demonstrate that our approach is highly robust for various lung nodule types, outperforming previous state-of-the-art techniques in terms of segmentation accuracy and computational complexity, rendering it suitable for real-time clinical implementation. ",
    "url": "https://arxiv.org/abs/2304.01576",
    "authors": [
      "Muhammad Usman",
      "Azka Rehman",
      "Abdullah Shahid",
      "Siddique Latif",
      "Shi Sub Byon",
      "Sung Hyun Kim",
      "Tariq Mahmood Khan",
      "Yeong Gil Shin"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.01682",
    "title": "High-resolution tomographic reconstruction of optical absorbance through  scattering media using neural fields",
    "abstract": "Light scattering imposes a major obstacle for imaging objects seated deeply in turbid media, such as biological tissues and foggy air. Diffuse optical tomography (DOT) tackles scattering by volumetrically recovering the optical absorbance and has shown significance in medical imaging, remote sensing and autonomous driving. A conventional DOT reconstruction paradigm necessitates discretizing the object volume into voxels at a pre-determined resolution for modelling diffuse light propagation and the resulting spatial resolution of the reconstruction is generally limited. We propose NeuDOT, a novel DOT scheme based on neural fields (NF) to continuously encode the optical absorbance within the volume and subsequently bridge the gap between model accuracy and high resolution. Comprehensive experiments demonstrate that NeuDOT achieves submillimetre lateral resolution and resolves complex 3D objects at 14 mm-depth, outperforming the state-of-the-art methods. NeuDOT is a non-invasive, high-resolution and computationally efficient tomographic method, and unlocks further applications of NF involving light scattering. ",
    "url": "https://arxiv.org/abs/2304.01682",
    "authors": [
      "Wuwei Ren",
      "Siyuan Shen",
      "Linlin Li",
      "Shengyu Gao",
      "Yuehan Wang",
      "Liangtao Gu",
      "Shiying Li",
      "Xingjun Zhu",
      "Jiahua Jiang",
      "Jingyi Yu"
    ],
    "subjectives": [
      "Optics (physics.optics)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01705",
    "title": "Cross-modal tumor segmentation using generative blending augmentation  and self training",
    "abstract": "Deep learning for medical imaging is limited by data scarcity and domain shift, which lead to biased training sets that do not accurately represent deployment conditions. A related practical problem is cross-modal segmentation where the objective is to segment unlabelled domains using previously labelled images from other modalites, which is the context of the MICCAI CrossMoDA 2022 challenge on vestibular schwannoma (VS) segmentation. In this context, we propose a VS segmentation method that leverages conventional image-to-image translation and segmentation using iterative self training combined to a dedicated data augmentation technique called Generative Blending Augmentation (GBA). GBA is based on a one-shot 2D SinGAN generative model that allows to realistically diversify target tumor appearances in a downstream segmentation model, improving its generalization power at test time. Our solution ranked first on the VS segmentation task during the validation and test phase of the CrossModa 2022 challenge. ",
    "url": "https://arxiv.org/abs/2304.01705",
    "authors": [
      "Guillaume Sallé",
      "Pierre-Henri Conze",
      "Julien Bert",
      "Nicolas Boussion",
      "Dimitris Visvikis",
      "Vincent Jaouen"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.01729",
    "title": "Constructing extremal triangle-free graphs using integer programming",
    "abstract": "The maximum number of edges in a graph with matching number m and maximum degree d has been determined in [1] and [2], where some extremal graphs have also been provided. Then, a new question has emerged: how the maximum edge count is affected by forbidding some subgraphs occurring in these extremal graphs? In [3], the problem is solved in triangle-free graphs for $d \\geq m$, and for $d < m$ with either $Z(d) \\leq m < 2d$ or $d \\leq 6$, where $Z(d)$ is approximately $5d/4$. The authors derived structural properties of triangle-free extremal graphs, which allows us to focus on constructing small extremal components to form an extremal graph. Based on these findings, in this paper, we develop an integer programming formulation for constructing extremal graphs. Since our formulation is highly symmetric, we use our own implementation of Orbital Branching to reduce symmetry. We also implement our integer programming formulation so that the feasible region is restricted iteratively. Using a combination of the two approaches, we expand the solution into $d \\leq 10$ instead of $d \\leq 6$ for $m > d$. Our results endorse the formula for the number of edges in all extremal triangle-free graphs conjectured in [3]. ",
    "url": "https://arxiv.org/abs/2304.01729",
    "authors": [
      "Ali Erdem Banak",
      "Tınaz Ekim",
      "Z. Caner Taşkın"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2304.01732",
    "title": "Adaptive learning of effective dynamics: Adaptive real-time, online  modeling for complex systems",
    "abstract": "Predictive simulations are essential for applications ranging from weather forecasting to material design. The veracity of these simulations hinges on their capacity to capture the effective system dynamics. Massively parallel simulations predict the systems dynamics by resolving all spatiotemporal scales, often at a cost that prevents experimentation. On the other hand, reduced order models are fast but often limited by the linearization of the system dynamics and the adopted heuristic closures. We propose a novel systematic framework that bridges large scale simulations and reduced order models to extract and forecast adaptively the effective dynamics (AdaLED) of multiscale systems. AdaLED employs an autoencoder to identify reduced-order representations of the system dynamics and an ensemble of probabilistic recurrent neural networks (RNNs) as the latent time-stepper. The framework alternates between the computational solver and the surrogate, accelerating learned dynamics while leaving yet-to-be-learned dynamics regimes to the original solver. AdaLED continuously adapts the surrogate to the new dynamics through online training. The transitions between the surrogate and the computational solver are determined by monitoring the prediction accuracy and uncertainty of the surrogate. The effectiveness of AdaLED is demonstrated on three different systems - a Van der Pol oscillator, a 2D reaction-diffusion equation, and a 2D Navier-Stokes flow past a cylinder for varying Reynolds numbers (400 up to 1200), showcasing its ability to learn effective dynamics online, detect unseen dynamics regimes, and provide net speed-ups. To the best of our knowledge, AdaLED is the first framework that couples a surrogate model with a computational solver to achieve online adaptive learning of effective dynamics. It constitutes a potent tool for applications requiring many expensive simulations. ",
    "url": "https://arxiv.org/abs/2304.01732",
    "authors": [
      "Ivica Kičić",
      "Pantelis R. Vlachas",
      "Georgios Arampatzis",
      "Michail Chatzimanolakis",
      "Leonidas Guibas",
      "Petros Koumoutsakos"
    ],
    "subjectives": [
      "Computational Physics (physics.comp-ph)",
      "Machine Learning (cs.LG)",
      "Fluid Dynamics (physics.flu-dyn)"
    ]
  },
  {
    "id": "arXiv:2304.01786",
    "title": "Distributionally robust stability of payoff allocations in stochastic  coalitional games",
    "abstract": "We consider multi-agent coalitional games with uncertainty in the coalitional values. We provide a novel methodology to study the stability of the grand coalition in the case where each coalition constructs ambiguity sets for the (possibly) unknown probability distribution of the uncertainty. As a less conservative solution concept compared to worst-case approaches for coalitional stability, we consider a stochastic version of the so-called core set, i.e., the expected value core. Unfortunately, without exact knowledge of the probability distribution, the evaluation of the expected value core is an extremely challenging task. Hence, we propose the concept of distributionaly robust (DR) core. Leveraging tools from data-driven DR optimization under the Wasserstein distance, we provide finite-sample guarantees that any allocation which lies in the DR core is also stable with respect to the true probability distribution. Furthermore, we show that as the number of samples grows unbounded, the DR core converges almost surely to the true expected value core. We dedicate the last section to the computational tractability of finding an allocation in the DR core. ",
    "url": "https://arxiv.org/abs/2304.01786",
    "authors": [
      "George Pantazis",
      "Barbara Franci",
      "Sergio Grammatico",
      "Kostas Margellos"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.01823",
    "title": "The structure of quasi-transitive graphs avoiding a minor with  applications to the domino problem",
    "abstract": "An infinite graph is quasi-transitive if its vertex set has finitely many orbits under the action of its automorphism group. In this paper we obtain a structure theorem for locally finite quasi-transitive graphs avoiding a minor, which is reminiscent of the Robertson-Seymour Graph Minor Structure Theorem. We prove that every locally finite quasi-transitive graph $G$ avoiding a minor has a tree-decomposition whose torsos are finite or planar; moreover the tree-decomposition is canonical, i.e. invariant under the action of the automorphism group of $G$. As applications of this result, we prove the following. * Every locally finite quasi-transitive graph attains its Hadwiger number, that is, if such a graph contains arbitrarily large clique minors, then it contains an infinite clique minor. This extends a result of Thomassen (1992) who proved it in the 4-connected case and suggested that this assumption could be omitted. * Locally finite quasi-transitive graphs avoiding a minor are accessible (in the sense of Thomassen and Woess), which extends known results on planar graphs to any proper minor-closed family. * Minor-excluded finitely generated groups are accessible (in the group-theoretic sense) and finitely presented, which extends classical results on planar groups. * The domino problem is decidable in a minor-excluded finitely generated group if and only if the group is virtually free, which proves the minor-excluded case of a conjecture of Ballier and Stein (2018). ",
    "url": "https://arxiv.org/abs/2304.01823",
    "authors": [
      "Louis Esperet",
      "Ugo Giocanti",
      "Clément Legrand-Duchesne"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)",
      "Dynamical Systems (math.DS)",
      "Group Theory (math.GR)"
    ]
  },
  {
    "id": "arXiv:2304.01841",
    "title": "Portable Programming Model Exploration for LArTPC Simulation in a  Heterogeneous Computing Environment: OpenMP vs. SYCL",
    "abstract": "The evolution of the computing landscape has resulted in the proliferation of diverse hardware architectures, with different flavors of GPUs and other compute accelerators becoming more widely available. To facilitate the efficient use of these architectures in a heterogeneous computing environment, several programming models are available to enable portability and performance across different computing systems, such as Kokkos, SYCL, OpenMP and others. As part of the High Energy Physics Center for Computational Excellence (HEP-CCE) project, we investigate if and how these different programming models may be suitable for experimental HEP workflows through a few representative use cases. One of such use cases is the Liquid Argon Time Projection Chamber (LArTPC) simulation which is essential for LArTPC detector design, validation and data analysis. Following up on our previous investigations of using Kokkos to port LArTPC simulation in the Wire-Cell Toolkit (WCT) to GPUs, we have explored OpenMP and SYCL as potential portable programming models for WCT, with the goal to make diverse computing resources accessible to the LArTPC simulations. In this work, we describe how we utilize relevant features of OpenMP and SYCL for the LArTPC simulation module in WCT. We also show performance benchmark results on multi-core CPUs, NVIDIA and AMD GPUs for both the OpenMP and the SYCL implementations. Comparisons with different compilers will also be given where appropriate. ",
    "url": "https://arxiv.org/abs/2304.01841",
    "authors": [
      "Meifeng Lin",
      "Zhihua Dong",
      "Tianle Wang",
      "Mohammad Atif",
      "Meghna Battacharya",
      "Kyle Knoepfel",
      "Charles Leggett",
      "Brett Viren",
      "Haiwang Yu"
    ],
    "subjectives": [
      "High Energy Physics - Experiment (hep-ex)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2304.01996",
    "title": "Autoregressive Neural TensorNet: Bridging Neural Networks and Tensor  Networks for Quantum Many-Body Simulation",
    "abstract": "Quantum many-body physics simulation has important impacts on understanding fundamental science and has applications to quantum materials design and quantum technology. However, due to the exponentially growing size of the Hilbert space with respect to the particle number, a direct simulation is intractable. While representing quantum states with tensor networks and neural networks are the two state-of-the-art methods for approximate simulations, each has its own limitations in terms of expressivity and optimization. To address these challenges, we develop a novel architecture, Autoregressive Neural TensorNet (ANTN), which bridges tensor networks and autoregressive neural networks. We show that Autoregressive Neural TensorNet parameterizes normalized wavefunctions with exact sampling, generalizes the expressivity of tensor networks and autoregressive neural networks, and inherits a variety of symmetries from autoregressive neural networks. We demonstrate our approach on the 2D $J_1$-$J_2$ Heisenberg model with different systems sizes and coupling parameters, outperforming both tensor networks and autoregressive neural networks. Our work opens up new opportunities for both scientific simulations and machine learning applications. ",
    "url": "https://arxiv.org/abs/2304.01996",
    "authors": [
      "Zhuo Chen",
      "Laker Newhouse",
      "Eddie Chen",
      "Di Luo",
      "Marin Soljačić"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Strongly Correlated Electrons (cond-mat.str-el)",
      "Machine Learning (cs.LG)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2008.09269",
    "title": "Beyond Fixed Grid: Learning Geometric Image Representation with a  Deformable Grid",
    "abstract": " Comments: ECCV 2020 ",
    "url": "https://arxiv.org/abs/2008.09269",
    "authors": [
      "Jun Gao",
      "Zian Wang",
      "Jinchen Xuan",
      "Sanja Fidler"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2012.09163",
    "title": "ROPfuscator: Robust Obfuscation with ROP",
    "abstract": " Title: ROPfuscator: Robust Obfuscation with ROP ",
    "url": "https://arxiv.org/abs/2012.09163",
    "authors": [
      "Giulio De Pasquale",
      "Fukutomo Nakanishi",
      "Daniele Ferla",
      "Lorenzo Cavallaro"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2103.15949",
    "title": "Transformer visualization via dictionary learning: contextualized  embedding as a linear superposition of transformer factors",
    "abstract": " Comments: This paper is published at DeeLIO Workshop@NAACL 2021 ",
    "url": "https://arxiv.org/abs/2103.15949",
    "authors": [
      "Zeyu Yun",
      "Yubei Chen",
      "Bruno A Olshausen",
      "Yann LeCun"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2105.10759",
    "title": "Universal set of Observables for Forecasting Physical Systems through  Causal Embedding",
    "abstract": " Title: Universal set of Observables for Forecasting Physical Systems through  Causal Embedding ",
    "url": "https://arxiv.org/abs/2105.10759",
    "authors": [
      "G Manjunath",
      "A de Clercq",
      "MJ Steynberg"
    ],
    "subjectives": [
      "Dynamical Systems (math.DS)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2106.07217",
    "title": "Influential Rank: A New Perspective of Post-training for Robust Model  against Noisy Labels",
    "abstract": " Comments: 15 pages ",
    "url": "https://arxiv.org/abs/2106.07217",
    "authors": [
      "Seulki Park",
      "Hwanjun Song",
      "Daeho Um",
      "Dae Ung Jo",
      "Sangdoo Yun",
      "Jin Young Choi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2110.04391",
    "title": "Aura: Privacy-preserving Augmentation to Improve Test Set Diversity in  Speech Enhancement",
    "abstract": " Title: Aura: Privacy-preserving Augmentation to Improve Test Set Diversity in  Speech Enhancement ",
    "url": "https://arxiv.org/abs/2110.04391",
    "authors": [
      "Xavier Gitiaux",
      "Aditya Khant",
      "Ebrahim Beyrami",
      "Chandan Reddy",
      "Jayant Gupchup",
      "Ross Cutler"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Cryptography and Security (cs.CR)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2111.08954",
    "title": "Tracklet-Switch Adversarial Attack against Pedestrian Multi-Object  Tracking Trackers",
    "abstract": " Title: Tracklet-Switch Adversarial Attack against Pedestrian Multi-Object  Tracking Trackers ",
    "url": "https://arxiv.org/abs/2111.08954",
    "authors": [
      "Delv Lin",
      "Qi Chen",
      "Chengyu Zhou",
      "Kun He"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.11927",
    "title": "Hierarchical Graph Networks for 3D Human Pose Estimation",
    "abstract": " Comments: accepted by BMVC 2021 ",
    "url": "https://arxiv.org/abs/2111.11927",
    "authors": [
      "Han Li",
      "Bowen Shi",
      "Wenrui Dai",
      "Yabo Chen",
      "Botao Wang",
      "Yu Sun",
      "Min Guo",
      "Chenlin Li",
      "Junni Zou",
      "Hongkai Xiong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.07837",
    "title": "Central-Smoothing Hypergraph Neural Networks for Predicting Drug-Drug  Interactions",
    "abstract": " Title: Central-Smoothing Hypergraph Neural Networks for Predicting Drug-Drug  Interactions ",
    "url": "https://arxiv.org/abs/2112.07837",
    "authors": [
      "Duc Anh Nguyen",
      "Canh Hao Nguyen",
      "Hiroshi Mamitsuka"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Biomolecules (q-bio.BM)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2201.01014",
    "title": "Local Motion and Contrast Priors Driven Deep Network for Infrared Small  Target Super-Resolution",
    "abstract": " Title: Local Motion and Contrast Priors Driven Deep Network for Infrared Small  Target Super-Resolution ",
    "url": "https://arxiv.org/abs/2201.01014",
    "authors": [
      "Xinyi Ying",
      "Yingqian Wang",
      "Longguang Wang",
      "Weidong Sheng",
      "Li Liu",
      "Zaiping Lin",
      "Shilin Zhou"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.07606",
    "title": "FRA-LSTM: A Vessel Trajectory Prediction Method Based on Fusion of the  Forward and Reverse Sub-Network",
    "abstract": " Comments: The experimental results may contain some mistakes, the method in this article is not suitable for the scenario of ship trajectory prediction, and there are a few grammatical errors ",
    "url": "https://arxiv.org/abs/2201.07606",
    "authors": [
      "Jin Chen",
      "Xingchen Li",
      "Ye Xiao",
      "Hao Chen",
      "Yong Zhao"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2203.07941",
    "title": "Reachability In Simple Neural Networks",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2108.13179 ",
    "url": "https://arxiv.org/abs/2203.07941",
    "authors": [
      "Marco Sälzer",
      "Martin Lange"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2203.15927",
    "title": "The DESC Stellarator Code Suite Part II: Perturbation and continuation  methods",
    "abstract": " Title: The DESC Stellarator Code Suite Part II: Perturbation and continuation  methods ",
    "url": "https://arxiv.org/abs/2203.15927",
    "authors": [
      "Rory Conlin",
      "Daniel W. Dudt",
      "Dario Panici",
      "Egemen Kolemen"
    ],
    "subjectives": [
      "Plasma Physics (physics.plasm-ph)",
      "Numerical Analysis (math.NA)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2203.16732",
    "title": "Spatio-Temporal Graph Convolutional Neural Networks for Physics-Aware  Grid Learning Algorithms",
    "abstract": " Comments: This work has been submitted to the IEEE for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2203.16732",
    "authors": [
      "Tong Wu",
      "Ignacio Losada Carreno",
      "Anna Scaglione",
      "Daniel Arnold"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2205.12127",
    "title": "Privacy and correctness trade-offs for information-theoretically secure  quantum homomorphic encryption",
    "abstract": " Title: Privacy and correctness trade-offs for information-theoretically secure  quantum homomorphic encryption ",
    "url": "https://arxiv.org/abs/2205.12127",
    "authors": [
      "Yanglin Hu",
      "Yingkai Ouyang",
      "Marco Tomamichel"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2205.12649",
    "title": "Investigating Lexical Replacements for Arabic-English Code-Switched Data  Augmentation",
    "abstract": " Comments: Accepted to LoResMT 2023 ",
    "url": "https://arxiv.org/abs/2205.12649",
    "authors": [
      "Injy Hamed",
      "Nizar Habash",
      "Slim Abdennadher",
      "Ngoc Thang Vu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2206.05530",
    "title": "Memorization-Dilation: Modeling Neural Collapse Under Label Noise",
    "abstract": " Comments: to be published at ICLR 2023 ",
    "url": "https://arxiv.org/abs/2206.05530",
    "authors": [
      "Duc Anh Nguyen",
      "Ron Levie",
      "Julian Lienen",
      "Gitta Kutyniok",
      "Eyke Hüllermeier"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.09474",
    "title": "3D Object Detection for Autonomous Driving: A Comprehensive Survey",
    "abstract": " Comments: Accepted to International Journal of Computer Vision (IJCV). Project page is at this https URL ",
    "url": "https://arxiv.org/abs/2206.09474",
    "authors": [
      "Jiageng Mao",
      "Shaoshuai Shi",
      "Xiaogang Wang",
      "Hongsheng Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2207.00728",
    "title": "Multi-scale Attentive Image De-raining Networks via Neural Architecture  Search",
    "abstract": " Title: Multi-scale Attentive Image De-raining Networks via Neural Architecture  Search ",
    "url": "https://arxiv.org/abs/2207.00728",
    "authors": [
      "Lei Cai",
      "Yuli Fu",
      "Wanliang Huo",
      "Youjun Xiang",
      "Tao Zhu",
      "Ying Zhang",
      "Huanqiang Zeng",
      "Delu Zeng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2207.13799",
    "title": "Network polarization, filter bubbles, and echo chambers: An annotated  review of measures and reduction methods",
    "abstract": " Comments: Corrected a typo in Section 3.2; the rest remains unchanged ",
    "url": "https://arxiv.org/abs/2207.13799",
    "authors": [
      "Ruben Interian",
      "Ruslan G. Marzo",
      "Isela Mendoza",
      "Celso C. Ribeiro"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2208.01430",
    "title": "A Model for Multi-Agent Heterogeneous Interaction Problems",
    "abstract": " Comments: 8 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2208.01430",
    "authors": [
      "Christopher D. Hsu",
      "Mulugeta A. Haile",
      "Pratik Chaudhari"
    ],
    "subjectives": [
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2208.07316",
    "title": "MENLI: Robust Evaluation Metrics from Natural Language Inference",
    "abstract": " Comments: TACL 2023 Camera-ready github link fixed ",
    "url": "https://arxiv.org/abs/2208.07316",
    "authors": [
      "Yanran Chen",
      "Steffen Eger"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.11543",
    "title": "A methodology for identifying resiliency in renewable electrical  distribution system using complex network",
    "abstract": " Title: A methodology for identifying resiliency in renewable electrical  distribution system using complex network ",
    "url": "https://arxiv.org/abs/2208.11543",
    "authors": [
      "Divyanshi Dwivedi",
      "Pradeep Kumar Yemula",
      "Mayukha Pal"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Other Statistics (stat.OT)"
    ]
  },
  {
    "id": "arXiv:2208.14318",
    "title": "Convergence Rates of Training Deep Neural Networks via Alternating  Minimization Methods",
    "abstract": " Title: Convergence Rates of Training Deep Neural Networks via Alternating  Minimization Methods ",
    "url": "https://arxiv.org/abs/2208.14318",
    "authors": [
      "Jintao Xu",
      "Chenglong Bao",
      "Wenxun Xing"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2209.01194",
    "title": "CLONeR: Camera-Lidar Fusion for Occupancy Grid-aided Neural  Representations",
    "abstract": " Comments: first two authors equally contributed ",
    "url": "https://arxiv.org/abs/2209.01194",
    "authors": [
      "Alexandra Carlson",
      "Manikandasriram Srinivasan Ramanagopal",
      "Nathan Tseng",
      "Matthew Johnson-Roberson",
      "Ram Vasudevan",
      "Katherine A. Skinner"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.01962",
    "title": "Adversarial Detection: Attacking Object Detection in Real Time",
    "abstract": " Comments: Accepted by IEEE Intelligent Vehicle Symposium, 2023 ",
    "url": "https://arxiv.org/abs/2209.01962",
    "authors": [
      "Han Wu",
      "Syed Yunas",
      "Sareh Rowlands",
      "Wenjie Ruan",
      "Johan Wahlstrom"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2209.04821",
    "title": "Local-Aware Global Attention Network for Person Re-Identification",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2108.02234 ",
    "url": "https://arxiv.org/abs/2209.04821",
    "authors": [
      "Nathanael L. Baisa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2210.04260",
    "title": "Coresets for Wasserstein Distributionally Robust Optimization Problems",
    "abstract": " Title: Coresets for Wasserstein Distributionally Robust Optimization Problems ",
    "url": "https://arxiv.org/abs/2210.04260",
    "authors": [
      "Ruomin Huang",
      "Jiawei Huang",
      "Wenjie Liu",
      "Hu Ding"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.02811",
    "title": "From Cubes to Networks: Fast Generic Model for Synthetic Networks  Generation",
    "abstract": " Title: From Cubes to Networks: Fast Generic Model for Synthetic Networks  Generation ",
    "url": "https://arxiv.org/abs/2211.02811",
    "authors": [
      "Shaojie Min",
      "Ji Liu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.05658",
    "title": "Multi-objective optimization via evolutionary algorithm (MOVEA) for  high-definition transcranial electrical stimulation of the human brain",
    "abstract": " Title: Multi-objective optimization via evolutionary algorithm (MOVEA) for  high-definition transcranial electrical stimulation of the human brain ",
    "url": "https://arxiv.org/abs/2211.05658",
    "authors": [
      "Mo Wang",
      "Kexin Lou",
      "Zeming Liu",
      "Pengfei Wei",
      "Quanying Liu"
    ],
    "subjectives": [
      "Quantitative Methods (q-bio.QM)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2211.08156",
    "title": "Shared Network Effects in Time- versus Event-Triggered Consensus of a  Single-Integrator Multi-Agent System",
    "abstract": " Comments: 7 pages, 1 figure, accepted: 22nd IFAC World Congress 2023 ",
    "url": "https://arxiv.org/abs/2211.08156",
    "authors": [
      "David Meister",
      "Frank Dürr",
      "Frank Allgöwer"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2211.08604",
    "title": "PU GNN: Chargeback Fraud Detection in P2E MMORPGs via Graph Attention  Networks with Imbalanced PU Labels",
    "abstract": " Comments: Under Review, Industry Track (version 05) ",
    "url": "https://arxiv.org/abs/2211.08604",
    "authors": [
      "Jiho Choi",
      "Junghoon Park",
      "Woocheol Kim",
      "Jin-Hyeok Park",
      "Yumin Suh",
      "Minchang Sung"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2211.12501",
    "title": "AeDet: Azimuth-invariant Multi-view 3D Object Detection",
    "abstract": " Comments: CVPR2023 ",
    "url": "https://arxiv.org/abs/2211.12501",
    "authors": [
      "Chengjian Feng",
      "Zequn Jie",
      "Yujie Zhong",
      "Xiangxiang Chu",
      "Lin Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.00994",
    "title": "Knowledge Graph Quality Evaluation under Incomplete Information",
    "abstract": " Title: Knowledge Graph Quality Evaluation under Incomplete Information ",
    "url": "https://arxiv.org/abs/2212.00994",
    "authors": [
      "Xiaodong Li",
      "Chenxin Zou",
      "Yi Cai",
      "Yuelong Zhu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.01515",
    "title": "Orders Are Unwanted: Dynamic Deep Graph Convolutional Network for  Personality Detection",
    "abstract": " Comments: AAAI2023 Camera-ready ",
    "url": "https://arxiv.org/abs/2212.01515",
    "authors": [
      "Tao Yang",
      "Jinghao Deng",
      "Xiaojun Quan",
      "Qifan Wang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2212.04701",
    "title": "4K-NeRF: High Fidelity Neural Radiance Fields at Ultra High Resolutions",
    "abstract": " Title: 4K-NeRF: High Fidelity Neural Radiance Fields at Ultra High Resolutions ",
    "url": "https://arxiv.org/abs/2212.04701",
    "authors": [
      "Zhongshu Wang",
      "Lingzhi Li",
      "Zhen Shen",
      "Li Shen",
      "Liefeng Bo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.08490",
    "title": "LOANet: A Lightweight Network Using Object Attention for Extracting  Buildings and Roads from UAV Aerial Remote Sensing Images",
    "abstract": " Comments: 16 pages, 6 tables, 7 figures ",
    "url": "https://arxiv.org/abs/2212.08490",
    "authors": [
      "Xiaoxiang Han",
      "Yiman Liu",
      "Gang Liu",
      "Yuanjie Lin",
      "Qiaohong Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.12380",
    "title": "Towards Scalable Physically Consistent Neural Networks: an Application  to Data-driven Multi-zone Thermal Building Models",
    "abstract": " Comments: Accepted in Applied Energy ",
    "url": "https://arxiv.org/abs/2212.12380",
    "authors": [
      "Loris Di Natale",
      "Bratislav Svetozarevic",
      "Philipp Heer",
      "Colin Neil Jones"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2301.04341",
    "title": "A Meta Path-based Approach for Rumor Detection on Social Media",
    "abstract": " Comments: This paper has been accepted to 2023 28th International Computer Conference, Computer Society of Iran (CSICC) ",
    "url": "https://arxiv.org/abs/2301.04341",
    "authors": [
      "Bita Azarijoo",
      "Mostafa Salehi",
      "Shaghayegh Najari"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.06646",
    "title": "Async-HFL: Efficient and Robust Asynchronous Federated Learning in  Hierarchical IoT Networks",
    "abstract": " Comments: Accepted by IoTDI'23 ",
    "url": "https://arxiv.org/abs/2301.06646",
    "authors": [
      "Xiaofan Yu",
      "Ludmila Cherkasova",
      "Harsh Vardhan",
      "Quanling Zhao",
      "Emily Ekaireb",
      "Xiyuan Zhang",
      "Arya Mazumdar",
      "Tajana Rosing"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2301.07282",
    "title": "The Chance of Winning Election Impacts on Social Media Strategy",
    "abstract": " Comments: Accepted by ICWSM 2023 ",
    "url": "https://arxiv.org/abs/2301.07282",
    "authors": [
      "Taichi Murayama",
      "Akira Matsui",
      "Kunihiro Miyazaki",
      "Yasuko Matsubara",
      "Yasushi Sakurai"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.00873",
    "title": "Predicting the Silent Majority on Graphs: Knowledge Transferable Graph  Neural Network",
    "abstract": " Comments: Paper was accepted by WWW2023 ",
    "url": "https://arxiv.org/abs/2302.00873",
    "authors": [
      "Wendong Bi",
      "Bingbing Xu",
      "Xiaoqian Sun",
      "Li Xu",
      "Huawei Shen",
      "Xueqi Cheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2302.10331",
    "title": "Causal Razors",
    "abstract": " Comments: 29 pages for the main paper. 14 pages for the supplementary materials ",
    "url": "https://arxiv.org/abs/2302.10331",
    "authors": [
      "Wai-yin Lam"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Logic in Computer Science (cs.LO)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2303.00621",
    "title": "The (Computational) Social Choice Take on Indivisible Participatory  Budgeting",
    "abstract": " Title: The (Computational) Social Choice Take on Indivisible Participatory  Budgeting ",
    "url": "https://arxiv.org/abs/2303.00621",
    "authors": [
      "Simon Rey",
      "Jan Maly"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2303.03012",
    "title": "On the Feasibility of Specialized Ability Extracting for Large Language  Code Models",
    "abstract": " Comments: 11 pages ",
    "url": "https://arxiv.org/abs/2303.03012",
    "authors": [
      "Zongjie Li",
      "Chaozheng Wang",
      "Pingchuan Ma",
      "Chaowei Liu",
      "Shuai Wang",
      "Daoyuan Wu",
      "Cuiyun Gao"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2303.03667",
    "title": "Run, Don't Walk: Chasing Higher FLOPS for Faster Neural Networks",
    "abstract": " Comments: Accepted to CVPR 2023 ",
    "url": "https://arxiv.org/abs/2303.03667",
    "authors": [
      "Jierun Chen",
      "Shiu-hong Kao",
      "Hao He",
      "Weipeng Zhuo",
      "Song Wen",
      "Chul-Ho Lee",
      "S.-H. Gary Chan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.05323",
    "title": "Controllable Video Generation by Learning the Underlying Dynamical  System with Neural ODE",
    "abstract": " Title: Controllable Video Generation by Learning the Underlying Dynamical  System with Neural ODE ",
    "url": "https://arxiv.org/abs/2303.05323",
    "authors": [
      "Yucheng Xu",
      "Li Nanbo",
      "Arushi Goel",
      "Zijian Guo",
      "Zonghai Yao",
      "Hamidreza Kasaei",
      "Mohammadreze Kasaei",
      "Zhibin Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.07593",
    "title": "Improving Java Deserialization Gadget Chain Mining via Overriding-Guided  Object Generation",
    "abstract": " Comments: To appear in the Technical Track of ICSE 2023 ",
    "url": "https://arxiv.org/abs/2303.07593",
    "authors": [
      "Sicong Cao",
      "Xiaobing Sun",
      "Xiaoxue Wu",
      "Lili Bo",
      "Bin Li",
      "Rongxin Wu",
      "Wei Liu",
      "Biao He",
      "Yu Ouyang",
      "Jiajia Li"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2303.12149",
    "title": "SPARTAN: Self-supervised Spatiotemporal Transformers Approach to Group  Activity Recognition",
    "abstract": " Comments: Accepted to CVPRW 2023; 11 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2303.12149",
    "authors": [
      "Naga VS Raviteja Chappa",
      "Pha Nguyen",
      "Alexander H Nelson",
      "Han-Seok Seo",
      "Xin Li",
      "Page Daniel Dobbs",
      "Khoa Luu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.15161",
    "title": "Data Augmentation for Environmental Sound Classification Using Diffusion  Probabilistic Model with Top-k Selection Discriminator",
    "abstract": " Title: Data Augmentation for Environmental Sound Classification Using Diffusion  Probabilistic Model with Top-k Selection Discriminator ",
    "url": "https://arxiv.org/abs/2303.15161",
    "authors": [
      "Yunhao Chen",
      "Yunjie Zhu",
      "Zihui Yan",
      "Jianlu Shen",
      "Zhen Ren",
      "Yifan Huang"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2303.15263",
    "title": "Joint Person Identity, Gender and Age Estimation from Hand Images using  Deep Multi-Task Representation Learning",
    "abstract": " Comments: arXiv admin note: text overlap with arXiv:2209.04821 ",
    "url": "https://arxiv.org/abs/2303.15263",
    "authors": [
      "Nathanael L. Baisa"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.16191",
    "title": "Hard Nominal Example-aware Template Mutual Matching for Industrial  Anomaly Detection",
    "abstract": " Title: Hard Nominal Example-aware Template Mutual Matching for Industrial  Anomaly Detection ",
    "url": "https://arxiv.org/abs/2303.16191",
    "authors": [
      "Zixuan Chen",
      "Xiaohua Xie",
      "Lingxiao Yang",
      "Jianhuang Lai"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.18044",
    "title": "Long-Short Temporal Co-Teaching for Weakly Supervised Video Anomaly  Detection",
    "abstract": " Comments: Accepted by ICME 2023 ",
    "url": "https://arxiv.org/abs/2303.18044",
    "authors": [
      "Shengyang Sun",
      "Xiaojin Gong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.00252",
    "title": "Recover Triggered States: Protect Model Against Backdoor Attack in  Reinforcement Learning",
    "abstract": " Title: Recover Triggered States: Protect Model Against Backdoor Attack in  Reinforcement Learning ",
    "url": "https://arxiv.org/abs/2304.00252",
    "authors": [
      "Hao Chen",
      "Chen Gong",
      "Yizhe Wang",
      "Xinwen Hou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.00254",
    "title": "DOAD: Decoupled One Stage Action Detection Network",
    "abstract": " Comments: 11 pages ",
    "url": "https://arxiv.org/abs/2304.00254",
    "authors": [
      "Shuning Chang",
      "Pichao Wang",
      "Fan Wang",
      "Jiashi Feng",
      "Mike Zheng Show"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.00782",
    "title": "NeMF: Inverse Volume Rendering with Neural Microflake Field",
    "abstract": " Title: NeMF: Inverse Volume Rendering with Neural Microflake Field ",
    "url": "https://arxiv.org/abs/2304.00782",
    "authors": [
      "Youjia Zhang",
      "Teng Xu",
      "Junqing Yu",
      "Yuteng Ye",
      "Junle Wang",
      "Yanqing Jing",
      "Jingyi Yu",
      "Wei Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]