[
  {
    "id": "arXiv:2312.09265",
    "title": "Acoustic models of Brazilian Portuguese Speech based on Neural  Transformers",
    "abstract": "An acoustic model, trained on a significant amount of unlabeled data, consists of a self-supervised learned speech representation useful for solving downstream tasks, perhaps after a fine-tuning of the model in the respective downstream task. In this work, we build an acoustic model of Brazilian Portuguese Speech through a Transformer neural network. This model was pretrained on more than $800$ hours of Brazilian Portuguese Speech, using a combination of pretraining techniques. Using a labeled dataset collected for the detection of respiratory insufficiency in Brazilian Portuguese speakers, we fine-tune the pretrained Transformer neural network on the following tasks: respiratory insufficiency detection, gender recognition and age group classification. We compare the performance of pretrained Transformers on these tasks with that of Transformers without previous pretraining, noting a significant improvement. In particular, the performance of respiratory insufficiency detection obtains the best reported results so far, indicating this kind of acoustic model as a promising tool for speech-as-biomarker approach. Moreover, the performance of gender recognition is comparable to the state of the art models in English. ",
    "url": "https://arxiv.org/abs/2312.09265",
    "authors": [
      "Marcelo Matheus Gauy",
      "Marcelo Finger"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2312.09269",
    "title": "Efficient speech detection in environmental audio using acoustic  recognition and knowledge distillation",
    "abstract": "The ongoing biodiversity crisis, driven by factors such as land-use change and global warming, emphasizes the need for effective ecological monitoring methods. Acoustic monitoring of biodiversity has emerged as an important monitoring tool. Detecting human voices in soundscape monitoring projects is useful both for analysing human disturbance and for privacy filtering. Despite significant strides in deep learning in recent years, the deployment of large neural networks on compact devices poses challenges due to memory and latency constraints. Our approach focuses on leveraging knowledge distillation techniques to design efficient, lightweight student models for speech detection in bioacoustics. In particular, we employed the MobileNetV3-Small-Pi model to create compact yet effective student architectures to compare against the larger EcoVAD teacher model, a well-regarded voice detection architecture in eco-acoustic monitoring. The comparative analysis included examining various configurations of the MobileNetV3-Small-Pi derived student models to identify optimal performance. Additionally, a thorough evaluation of different distillation techniques was conducted to ascertain the most effective method for model selection. Our findings revealed that the distilled models exhibited comparable performance to the EcoVAD teacher model, indicating a promising approach to overcoming computational barriers for real-time ecological monitoring. ",
    "url": "https://arxiv.org/abs/2312.09269",
    "authors": [
      "Drew Priebe",
      "Burooj Ghani",
      "Dan Stowell"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2312.09321",
    "title": "OSTINATO: Cross-host Attack Correlation Through Attack Activity  Similarity Detection",
    "abstract": "Modern attacks against enterprises often have multiple targets inside the enterprise network. Due to the large size of these networks and increasingly stealthy attacks, attacker activities spanning multiple hosts are extremely difficult to correlate during a threat-hunting effort. In this paper, we present a method for an efficient cross-host attack correlation across multiple hosts. Unlike previous works, our approach does not require lateral movement detection techniques or host-level modifications. Instead, our approach relies on an observation that attackers have a few strategic mission objectives on every host that they infiltrate, and there exist only a handful of techniques for achieving those objectives. The central idea behind our approach involves comparing (OS agnostic) activities on different hosts and correlating the hosts that display the use of similar tactics, techniques, and procedures. We implement our approach in a tool called Ostinato and successfully evaluate it in threat hunting scenarios involving DARPA-led red team engagements spanning 500 hosts and in another multi-host attack scenario. Ostinato successfully detected 21 additional compromised hosts, which the underlying host-based detection system overlooked in activities spanning multiple days of the attack campaign. Additionally, Ostinato successfully reduced alarms generated from the underlying detection system by more than 90%, thus helping to mitigate the threat alert fatigue problem ",
    "url": "https://arxiv.org/abs/2312.09321",
    "authors": [
      "Sutanu Kumar Ghosh",
      "Kiavash Satvat",
      "Rigel Gjomemo",
      "V. N. Venkatakrishnan"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.09354",
    "title": "Older Adults' Experiences with Misinformation on Social Media",
    "abstract": "Older adults habitually encounter misinformation on social media, but there is little knowledge about their experiences with it. In this study, we combined a qualitative survey (n=119) with in-depth interviews (n=21) to investigate how older adults in America conceptualize, discern, and contextualize social media misinformation. As misinformation on social media in the past was driven towards influencing voting outcomes, we were particularly interested to approach our study from a voting intention perspective. We found that 62% of the participants intending to vote Democrat saw a manipulative political purpose behind the spread of misinformation while only 5% of those intending to vote Republican believed misinformation has a political dissent purpose. Regardless of the voting intentions, most participants relied on source heuristics combined with fact-checking to discern truth from misinformation on social media. The biggest concern about the misinformation, among all the participants, was that it increasingly leads to biased reasoning influenced by personal values and feelings instead of reasoning based on objective evidence. The participants intending to vote Democrat were in 74% of the cases concerned that misinformation will cause escalation of extremism in the future, while those intending to vote Republican, were undecided, or planned to abstain were concerned that misinformation will further erode the trust in democratic institutions, specifically in the context of public health and free and fair elections. During our interviews, we found that 63% of the participants who intended to vote Republican, were fully aware and acknowledged that Republican or conservative voices often time speak misinformation, even though they are closely aligned to their political ideology. ",
    "url": "https://arxiv.org/abs/2312.09354",
    "authors": [
      "Filipo Sharevski",
      "Jennifer Vander Loop"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2312.09359",
    "title": "Children, Parents, and Misinformation on Social Media",
    "abstract": "Children encounter misinformation on social media in a similar capacity as their parents. Unlike their parents, children are an exceptionally vulnerable population because their cognitive abilities and emotional regulation are still maturing, rendering them more susceptible to misinformation and falsehoods online. Yet, little is known about children's experience with misinformation as well as what their parents think of the misinformation's effect on child development. To answer these questions, we combined a qualitative survey of parents (n=87) with semi-structured interviews of both parents and children (n=12). We found that children usually encounter deep fakes, memes with political context, or celebrity/influencer rumors on social media. Children revealed they \"ask Siri\" whether a social media video or post is true or not before they search on Google or ask their parents about it. Parents expressed discontent that their children are impressionable to misinformation, stating that the burden falls on them to help their children develop critical thinking skills for navigating falsehoods on social media. Here, the majority of parents felt that schools should also teach these skills as well as media literacy to their children. Misinformation, according to both parents and children affects the family relationships especially with grandparents with different political views than theirs. ",
    "url": "https://arxiv.org/abs/2312.09359",
    "authors": [
      "Filipo Sharevski",
      "Jennifer Vander Loop"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2312.09377",
    "title": "Measurement-based/Model-less Estimation of Voltage Sensitivity  Coefficients by Feedforward and LSTM Neural Networks in Power Distribution  Grids",
    "abstract": "The increasing adoption of measurement units in electrical power distribution grids has enabled the deployment of data-driven and measurement-based control schemes. Such schemes rely on measurement-based estimated models, where the models are first estimated using raw measurements and then used in the control problem. This work focuses on measurement-based estimation of the voltage sensitivity coefficients which can be used for voltage control. In the existing literature, these coefficients are estimated using regression-based methods, which do not perform well in the case of high measurement noise. This work proposes tackling this problem by using neural network (NN)-based estimation of the voltage sensitivity coefficients which is robust against measurement noise. In particular, we propose using Feedforward and Long-Short Term Memory (LSTM) neural networks. The trained NNs take measurements of nodal voltage magnitudes and active and reactive powers and output the vector of voltage magnitude sensitivity coefficients. The performance of the proposed scheme is compared against the regression-based method for a CIGRE benchmark network. ",
    "url": "https://arxiv.org/abs/2312.09377",
    "authors": [
      "Robin Henry",
      "Rahul Gupta"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2312.09387",
    "title": "High-Resolution Maps of Left Atrial Displacements and Strains Estimated  with 3D CINE MRI and Unsupervised Neural Networks",
    "abstract": "The functional analysis of the left atrium (LA) is important for evaluating cardiac health and understanding diseases like atrial fibrillation. Cine MRI is ideally placed for the detailed 3D characterisation of LA motion and deformation, but it is lacking appropriate acquisition and analysis tools. In this paper, we present Analysis for Left Atrial Displacements and Deformations using unsupervIsed neural Networks, \\textit{Aladdin}, to automatically and reliably characterise regional LA deformations from high-resolution 3D Cine MRI. The tool includes: an online few-shot segmentation network (Aladdin-S), an online unsupervised image registration network (Aladdin-R), and a strain calculations pipeline tailored to the LA. We create maps of LA Displacement Vector Field (DVF) magnitude and LA principal strain values from images of 10 healthy volunteers and 8 patients with cardiovascular disease (CVD). We additionally create an atlas of these biomarkers using the data from the healthy volunteers. Aladdin is able to accurately track the LA wall across the cardiac cycle and characterize its motion and deformation. The overall DVF magnitude and principal strain values are significantly higher in the healthy group vs CVD patients: $2.85 \\pm 1.59~mm$ and $0.09 \\pm 0.05$ vs $1.96 \\pm 0.74~mm$ and $0.03 \\pm 0.04$, respectively. The time course of these metrics is also different in the two groups, with a more marked active contraction phase observed in the healthy cohort. Finally, utilizing the LA atlas allows us to identify regional deviations from the population distribution that may indicate focal tissue abnormalities. The proposed tool for the quantification of novel regional LA deformation biomarkers should have important clinical applications. The source code, anonymized images, generated maps and atlas are publicly available: https://github.com/cgalaz01/aladdin_cmr_la. ",
    "url": "https://arxiv.org/abs/2312.09387",
    "authors": [
      "Christoforos Galazis",
      "Samuel Shepperd",
      "Emma Brouwer",
      "Sandro Queirós",
      "Ebraham Alskaf",
      "Mustafa Anjari",
      "Amedeo Chiribiri",
      "Jack Lee",
      "Anil A. Bharath",
      "Marta Varela"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09398",
    "title": "Relightable Neural Assets",
    "abstract": "High-fidelity 3D assets with materials composed of fibers (including hair), complex layered material shaders, or fine scattering geometry are ubiquitous in high-end realistic rendering applications. Rendering such models is computationally expensive due to heavy shaders and long scattering paths. Moreover, implementing the shading and scattering models is non-trivial and has to be done not only in the 3D content authoring software (which is necessarily complex), but also in all downstream rendering solutions. For example, web and mobile viewers for complex 3D assets are desirable, but frequently cannot support the full shading complexity allowed by the authoring application. Our goal is to design a neural representation for 3D assets with complex shading that supports full relightability and full integration into existing renderers. We provide an end-to-end shading solution at the first intersection of a ray with the underlying geometry. All shading and scattering is precomputed and included in the neural asset; no multiple scattering paths need to be traced, and no complex shading models need to be implemented to render our assets, beyond a single neural architecture. We combine an MLP decoder with a feature grid. Shading consists of querying a feature vector, followed by an MLP evaluation producing the final reflectance value. Our method provides high-fidelity shading, close to the ground-truth Monte Carlo estimate even at close-up views. We believe our neural assets could be used in practical renderers, providing significant speed-ups and simplifying renderer implementations. ",
    "url": "https://arxiv.org/abs/2312.09398",
    "authors": [
      "Krishna Mullia",
      "Fujun Luan",
      "Xin Sun",
      "Miloš Hašan"
    ],
    "subjectives": [
      "Graphics (cs.GR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09401",
    "title": "Inter-Layer Scheduling Space Exploration for Multi-model Inference on  Heterogeneous Chiplets",
    "abstract": "To address increasing compute demand from recent multi-model workloads with heavy models like large language models, we propose to deploy heterogeneous chiplet-based multi-chip module (MCM)-based accelerators. We develop an advanced scheduling framework for heterogeneous MCM accelerators that comprehensively consider complex heterogeneity and inter-chiplet pipelining. Our experiments using our framework on GPT-2 and ResNet-50 models on a 4-chiplet system have shown upto 2.2x and 1.9x increase in throughput and energy efficiency, compared to a monolithic accelerator with an optimized output-stationary dataflow. ",
    "url": "https://arxiv.org/abs/2312.09401",
    "authors": [
      "Mohanad Odema",
      "Hyoukjun Kwon",
      "Mohammad Abdullah Al Faruque"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)",
      "Artificial Intelligence (cs.AI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2312.09410",
    "title": "Prediction of rare events in the operation of household equipment using  co-evolving time series",
    "abstract": "In this study, we propose an approach for predicting rare events by exploiting time series in coevolution. Our approach involves a weighted autologistic regression model, where we leverage the temporal behavior of the data to enhance predictive capabilities. By addressing the issue of imbalanced datasets, we establish constraints leading to weight estimation and to improved performance. Evaluation on synthetic and real-world datasets confirms that our approach outperform state-of-the-art of predicting home equipment failure methods. ",
    "url": "https://arxiv.org/abs/2312.09410",
    "authors": [
      "Hadia Mecheri",
      "Islam Benamirouche",
      "Feriel Fass",
      "Djemel Ziou",
      "Nassima Kadri"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09411",
    "title": "OTOv3: Automatic Architecture-Agnostic Neural Network Training and  Compression from Structured Pruning to Erasing Operators",
    "abstract": "Compressing a predefined deep neural network (DNN) into a compact sub-network with competitive performance is crucial in the efficient machine learning realm. This topic spans various techniques, from structured pruning to neural architecture search, encompassing both pruning and erasing operators perspectives. Despite advancements, existing methods suffers from complex, multi-stage processes that demand substantial engineering and domain knowledge, limiting their broader applications. We introduce the third-generation Only-Train-Once (OTOv3), which first automatically trains and compresses a general DNN through pruning and erasing operations, creating a compact and competitive sub-network without the need of fine-tuning. OTOv3 simplifies and automates the training and compression process, minimizes the engineering efforts required from users. It offers key technological advancements: (i) automatic search space construction for general DNNs based on dependency graph analysis; (ii) Dual Half-Space Projected Gradient (DHSPG) and its enhanced version with hierarchical search (H2SPG) to reliably solve (hierarchical) structured sparsity problems and ensure sub-network validity; and (iii) automated sub-network construction using solutions from DHSPG/H2SPG and dependency graphs. Our empirical results demonstrate the efficacy of OTOv3 across various benchmarks in structured pruning and neural architecture search. OTOv3 produces sub-networks that match or exceed the state-of-the-arts. The source code will be available at https://github.com/tianyic/only_train_once. ",
    "url": "https://arxiv.org/abs/2312.09411",
    "authors": [
      "Tianyi Chen",
      "Tianyu Ding",
      "Zhihui Zhu",
      "Zeyu Chen",
      "HsiangTao Wu",
      "Ilya Zharkov",
      "Luming Liang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09424",
    "title": "Open Domain Knowledge Extraction for Knowledge Graphs",
    "abstract": "The quality of a knowledge graph directly impacts the quality of downstream applications (e.g. the number of answerable questions using the graph). One ongoing challenge when building a knowledge graph is to ensure completeness and freshness of the graph's entities and facts. In this paper, we introduce ODKE, a scalable and extensible framework that sources high-quality entities and facts from open web at scale. ODKE utilizes a wide range of extraction models and supports both streaming and batch processing at different latency. We reflect on the challenges and design decisions made and share lessons learned when building and deploying ODKE to grow an industry-scale open domain knowledge graph. ",
    "url": "https://arxiv.org/abs/2312.09424",
    "authors": [
      "Kun Qian",
      "Anton Belyi",
      "Fei Wu",
      "Samira Khorshidi",
      "Azadeh Nikfarjam",
      "Rahul Khot",
      "Yisi Sang",
      "Katherine Luna",
      "Xianqi Chu",
      "Eric Choi",
      "Yash Govind",
      "Chloe Seivwright",
      "Yiwen Sun",
      "Ahmed Fakhry",
      "Theo Rekatsinas",
      "Ihab Ilyas",
      "Xiaoguang Qi",
      "Yunyao Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09451",
    "title": "MANTIS at #SMM4H 2023: Leveraging Hybrid and Ensemble Models for  Detection of Social Anxiety Disorder on Reddit",
    "abstract": "This paper presents our system employed for the Social Media Mining for Health 2023 Shared Task 4: Binary classification of English Reddit posts self-reporting a social anxiety disorder diagnosis. We systematically investigate and contrast the efficacy of hybrid and ensemble models that harness specialized medical domain-adapted transformers in conjunction with BiLSTM neural networks. The evaluation results outline that our best performing model obtained 89.31% F1 on the validation set and 83.76% F1 on the test set. ",
    "url": "https://arxiv.org/abs/2312.09451",
    "authors": [
      "Sourabh Zanwar",
      "Daniel Wiechmann",
      "Yu Qiao",
      "Elma Kerz"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2312.09466",
    "title": "Enhancing Trajectory Prediction through Self-Supervised Waypoint Noise  Prediction",
    "abstract": "Trajectory prediction is an important task that involves modeling the indeterminate nature of traffic actors to forecast future trajectories given the observed trajectory sequences. However, current methods confine themselves to presumed data manifolds, assuming that trajectories strictly adhere to these manifolds, resulting in overly simplified predictions. To this end, we propose a novel approach called SSWNP (Self-Supervised Waypoint Noise Prediction). In our approach, we first create clean and noise-augmented views of past observed trajectories across the spatial domain of waypoints. We then compel the trajectory prediction model to maintain spatial consistency between predictions from these two views, in addition to the trajectory prediction task. Introducing the noise-augmented view mitigates the model's reliance on a narrow interpretation of the data manifold, enabling it to learn more plausible and diverse representations. We also predict the noise present in the two views of past observed trajectories as an auxiliary self-supervised task, enhancing the model's understanding of the underlying representation and future predictions. Empirical evidence demonstrates that the incorporation of SSWNP into the model learning process significantly improves performance, even in noisy environments, when compared to baseline methods. Our approach can complement existing trajectory prediction methods. To showcase the effectiveness of our approach, we conducted extensive experiments on three datasets: NBA Sports VU, ETH-UCY, and TrajNet++, with experimental results highlighting the substantial improvement achieved in trajectory prediction tasks. ",
    "url": "https://arxiv.org/abs/2312.09466",
    "authors": [
      "Pranav Singh Chib",
      "Pravendra Singh"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.09478",
    "title": "Entropy Causal Graphs for Multivariate Time Series Anomaly Detection",
    "abstract": "Many multivariate time series anomaly detection frameworks have been proposed and widely applied. However, most of these frameworks do not consider intrinsic relationships between variables in multivariate time series data, thus ignoring the causal relationship among variables and degrading anomaly detection performance. This work proposes a novel framework called CGAD, an entropy Causal Graph for multivariate time series Anomaly Detection. CGAD utilizes transfer entropy to construct graph structures that unveil the underlying causal relationships among time series data. Weighted graph convolutional networks combined with causal convolutions are employed to model both the causal graph structures and the temporal patterns within multivariate time series data. Furthermore, CGAD applies anomaly scoring, leveraging median absolute deviation-based normalization to improve the robustness of the anomaly identification process. Extensive experiments demonstrate that CGAD outperforms state-of-the-art methods on real-world datasets with a 15% average improvement based on three different multivariate time series anomaly detection metrics. ",
    "url": "https://arxiv.org/abs/2312.09478",
    "authors": [
      "Falih Gozi Febrinanto",
      "Kristen Moore",
      "Chandra Thapa",
      "Mujie Liu",
      "Vidya Saikrishna",
      "Jiangang Ma",
      "Feng Xia"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09481",
    "title": "Continual Adversarial Defense",
    "abstract": "In response to the rapidly evolving nature of adversarial attacks on a monthly basis, numerous defenses have been proposed to generalize against as many known attacks as possible. However, designing a defense method that can generalize to all types of attacks, including unseen ones, is not realistic because the environment in which defense systems operate is dynamic and comprises various unique attacks used by many attackers. The defense system needs to upgrade itself by utilizing few-shot defense feedback and efficient memory. Therefore, we propose the first continual adversarial defense (CAD) framework that adapts to any attacks in a dynamic scenario, where various attacks emerge stage by stage. In practice, CAD is modeled under four principles: (1) continual adaptation to new attacks without catastrophic forgetting, (2) few-shot adaptation, (3) memory-efficient adaptation, and (4) high accuracy on both clean and adversarial images. We leverage cutting-edge continual learning, few-shot learning, and ensemble learning techniques to qualify the principles. Experiments conducted on CIFAR-10 and ImageNet-100 validate the effectiveness of our approach against multiple stages of 10 modern adversarial attacks and significant improvements over 10 baseline methods. In particular, CAD is capable of quickly adapting with minimal feedback and a low cost of defense failure, while maintaining good performance against old attacks. Our research sheds light on a brand-new paradigm for continual defense adaptation against dynamic and evolving attacks. ",
    "url": "https://arxiv.org/abs/2312.09481",
    "authors": [
      "Qian Wang",
      "Yaoyao Liu",
      "Hefei Ling",
      "Yingwei Li",
      "Qihao Liu",
      "Ping Li",
      "Jiazhong Chen",
      "Alan Yuille",
      "Ning Yu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.09494",
    "title": "No-Skim: Towards Efficiency Robustness Evaluation on Skimming-based  Language Models",
    "abstract": "To reduce the computation cost and the energy consumption in large language models (LLM), skimming-based acceleration dynamically drops unimportant tokens of the input sequence progressively along layers of the LLM while preserving the tokens of semantic importance. However, our work for the first time reveals the acceleration may be vulnerable to Denial-of-Service (DoS) attacks. In this paper, we propose No-Skim, a general framework to help the owners of skimming-based LLM to understand and measure the robustness of their acceleration scheme. Specifically, our framework searches minimal and unnoticeable perturbations at character-level and token-level to generate adversarial inputs that sufficiently increase the remaining token ratio, thus increasing the computation cost and energy consumption. We systematically evaluate the vulnerability of the skimming acceleration in various LLM architectures including BERT and RoBERTa on the GLUE benchmark. In the worst case, the perturbation found by No-Skim substantially increases the running cost of LLM by over 145% on average. Moreover, No-Skim extends the evaluation framework to various scenarios, making the evaluation conductible with different level of knowledge. ",
    "url": "https://arxiv.org/abs/2312.09494",
    "authors": [
      "Shengyao Zhang",
      "Mi Zhang",
      "Xudong Pan",
      "Min Yang"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2312.09498",
    "title": "Neural Gaussian Similarity Modeling for Differential Graph Structure  Learning",
    "abstract": "Graph Structure Learning (GSL) has demonstrated considerable potential in the analysis of graph-unknown non-Euclidean data across a wide range of domains. However, constructing an end-to-end graph structure learning model poses a challenge due to the impediment of gradient flow caused by the nearest neighbor sampling strategy. In this paper, we construct a differential graph structure learning model by replacing the non-differentiable nearest neighbor sampling with a differentiable sampling using the reparameterization trick. Under this framework, we argue that the act of sampling \\mbox{nearest} neighbors may not invariably be essential, particularly in instances where node features exhibit a significant degree of similarity. To alleviate this issue, the bell-shaped Gaussian Similarity (GauSim) modeling is proposed to sample non-nearest neighbors. To adaptively model the similarity, we further propose Neural Gaussian Similarity (NeuralGauSim) with learnable parameters featuring flexible sampling behaviors. In addition, we develop a scalable method by transferring the large-scale graph to the transition graph to significantly reduce the complexity. Experimental results demonstrate the effectiveness of the proposed methods. ",
    "url": "https://arxiv.org/abs/2312.09498",
    "authors": [
      "Xiaolong Fan",
      "Maoguo Gong",
      "Yue Wu",
      "Zedong Tang",
      "Jieyi Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09501",
    "title": "EDA: Evolving and Distinct Anchors for Multimodal Motion Prediction",
    "abstract": "Motion prediction is a crucial task in autonomous driving, and one of its major challenges lands in the multimodality of future behaviors. Many successful works have utilized mixture models which require identification of positive mixture components, and correspondingly fall into two main lines: prediction-based and anchor-based matching. The prediction clustering phenomenon in prediction-based matching makes it difficult to pick representative trajectories for downstream tasks, while the anchor-based matching suffers from a limited regression capability. In this paper, we introduce a novel paradigm, named Evolving and Distinct Anchors (EDA), to define the positive and negative components for multimodal motion prediction based on mixture models. We enable anchors to evolve and redistribute themselves under specific scenes for an enlarged regression capacity. Furthermore, we select distinct anchors before matching them with the ground truth, which results in impressive scoring performance. Our approach enhances all metrics compared to the baseline MTR, particularly with a notable relative reduction of 13.5% in Miss Rate, resulting in state-of-the-art performance on the Waymo Open Motion Dataset. Code is available at https://github.com/Longzhong-Lin/EDA. ",
    "url": "https://arxiv.org/abs/2312.09501",
    "authors": [
      "Longzhong Lin",
      "Xuewu Lin",
      "Tianwei Lin",
      "Lichao Huang",
      "Rong Xiong",
      "Yue Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09508",
    "title": "IndicIRSuite: Multilingual Dataset and Neural Information Models for  Indian Languages",
    "abstract": "In this paper, we introduce Neural Information Retrieval resources for 11 widely spoken Indian Languages (Assamese, Bengali, Gujarati, Hindi, Kannada, Malayalam, Marathi, Oriya, Punjabi, Tamil, and Telugu) from two major Indian language families (Indo-Aryan and Dravidian). These resources include (a) INDIC-MARCO, a multilingual version of the MSMARCO dataset in 11 Indian Languages created using Machine Translation, and (b) Indic-ColBERT, a collection of 11 distinct Monolingual Neural Information Retrieval models, each trained on one of the 11 languages in the INDIC-MARCO dataset. To the best of our knowledge, IndicIRSuite is the first attempt at building large-scale Neural Information Retrieval resources for a large number of Indian languages, and we hope that it will help accelerate research in Neural IR for Indian Languages. Experiments demonstrate that Indic-ColBERT achieves 47.47% improvement in the MRR@10 score averaged over the INDIC-MARCO baselines for all 11 Indian languages except Oriya, 12.26% improvement in the NDCG@10 score averaged over the MIRACL Bengali and Hindi Language baselines, and 20% improvement in the MRR@100 Score over the Mr.Tydi Bengali Language baseline. IndicIRSuite is available at https://github.com/saifulhaq95/IndicIRSuite ",
    "url": "https://arxiv.org/abs/2312.09508",
    "authors": [
      "Saiful Haq",
      "Ashutosh Sharma",
      "Pushpak Bhattacharyya"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2312.09511",
    "title": "MONET: Modality-Embracing Graph Convolutional Network and Target-Aware  Attention for Multimedia Recommendation",
    "abstract": "In this paper, we focus on multimedia recommender systems using graph convolutional networks (GCNs) where the multimodal features as well as user-item interactions are employed together. Our study aims to exploit multimodal features more effectively in order to accurately capture users' preferences for items. To this end, we point out following two limitations of existing GCN-based multimedia recommender systems: (L1) although multimodal features of interacted items by a user can reveal her preferences on items, existing methods utilize GCN designed to focus only on capturing collaborative signals, resulting in insufficient reflection of the multimodal features in the final user/item embeddings; (L2) although a user decides whether to prefer the target item by considering its multimodal features, existing methods represent her as only a single embedding regardless of the target item's multimodal features and then utilize her embedding to predict her preference for the target item. To address the above issues, we propose a novel multimedia recommender system, named MONET, composed of following two core ideas: modality-embracing GCN (MeGCN) and target-aware attention. Through extensive experiments using four real-world datasets, we demonstrate i) the significant superiority of MONET over seven state-of-the-art competitors (up to 30.32% higher accuracy in terms of recall@20, compared to the best competitor) and ii) the effectiveness of the two core ideas in MONET. All MONET codes are available at https://github.com/Kimyungi/MONET. ",
    "url": "https://arxiv.org/abs/2312.09511",
    "authors": [
      "Yungi Kim",
      "Taeri Kim",
      "Won-Yong Shin",
      "Sang-Wook Kim"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09520",
    "title": "SlowTrack: Increasing the Latency of Camera-based Perception in  Autonomous Driving Using Adversarial Examples",
    "abstract": "In Autonomous Driving (AD), real-time perception is a critical component responsible for detecting surrounding objects to ensure safe driving. While researchers have extensively explored the integrity of AD perception due to its safety and security implications, the aspect of availability (real-time performance) or latency has received limited attention. Existing works on latency-based attack have focused mainly on object detection, i.e., a component in camera-based AD perception, overlooking the entire camera-based AD perception, which hinders them to achieve effective system-level effects, such as vehicle crashes. In this paper, we propose SlowTrack, a novel framework for generating adversarial attacks to increase the execution time of camera-based AD perception. We propose a novel two-stage attack strategy along with the three new loss function designs. Our evaluation is conducted on four popular camera-based AD perception pipelines, and the results demonstrate that SlowTrack significantly outperforms existing latency-based attacks while maintaining comparable imperceptibility levels. Furthermore, we perform the evaluation on Baidu Apollo, an industry-grade full-stack AD system, and LGSVL, a production-grade AD simulator, with two scenarios to compare the system-level effects of SlowTrack and existing attacks. Our evaluation results show that the system-level effects can be significantly improved, i.e., the vehicle crash rate of SlowTrack is around 95% on average while existing works only have around 30%. ",
    "url": "https://arxiv.org/abs/2312.09520",
    "authors": [
      "Chen Ma",
      "Ningfei Wang",
      "Qi Alfred Chen",
      "Chao Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.09525",
    "title": "Hierarchical Graph Pattern Understanding for Zero-Shot VOS",
    "abstract": "The optical flow guidance strategy is ideal for obtaining motion information of objects in the video. It is widely utilized in video segmentation tasks. However, existing optical flow-based methods have a significant dependency on optical flow, which results in poor performance when the optical flow estimation fails for a particular scene. The temporal consistency provided by the optical flow could be effectively supplemented by modeling in a structural form. This paper proposes a new hierarchical graph neural network (GNN) architecture, dubbed hierarchical graph pattern understanding (HGPU), for zero-shot video object segmentation (ZS-VOS). Inspired by the strong ability of GNNs in capturing structural relations, HGPU innovatively leverages motion cues (\\ie, optical flow) to enhance the high-order representations from the neighbors of target frames. Specifically, a hierarchical graph pattern encoder with message aggregation is introduced to acquire different levels of motion and appearance features in a sequential manner. Furthermore, a decoder is designed for hierarchically parsing and understanding the transformed multi-modal contexts to achieve more accurate and robust results. HGPU achieves state-of-the-art performance on four publicly available benchmarks (DAVIS-16, YouTube-Objects, Long-Videos and DAVIS-17). Code and pre-trained model can be found at \\url{https://github.com/NUST-Machine-Intelligence-Laboratory/HGPU}. ",
    "url": "https://arxiv.org/abs/2312.09525",
    "authors": [
      "Gensheng Pei",
      "Fumin Shen",
      "Yazhou Yao",
      "Tao Chen",
      "Xian-Sheng Hua",
      "Heng-Tao Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09533",
    "title": "Adversarial Robustness on Image Classification with $k$-means",
    "abstract": "In this paper we explore the challenges and strategies for enhancing the robustness of $k$-means clustering algorithms against adversarial manipulations. We evaluate the vulnerability of clustering algorithms to adversarial attacks, emphasising the associated security risks. Our study investigates the impact of incremental attack strength on training, introduces the concept of transferability between supervised and unsupervised models, and highlights the sensitivity of unsupervised models to sample distributions. We additionally introduce and evaluate an adversarial training method that improves testing performance in adversarial scenarios, and we highlight the importance of various parameters in the proposed training method, such as continuous learning, centroid initialisation, and adversarial step-count. ",
    "url": "https://arxiv.org/abs/2312.09533",
    "authors": [
      "Rollin Omari",
      "Junae Kim",
      "Paul Montague"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2312.09536",
    "title": "Riveter: Measuring Power and Social Dynamics Between Entities",
    "abstract": "Riveter provides a complete easy-to-use pipeline for analyzing verb connotations associated with entities in text corpora. We prepopulate the package with connotation frames of sentiment, power, and agency, which have demonstrated usefulness for capturing social phenomena, such as gender bias, in a broad range of corpora. For decades, lexical frameworks have been foundational tools in computational social science, digital humanities, and natural language processing, facilitating multifaceted analysis of text corpora. But working with verb-centric lexica specifically requires natural language processing skills, reducing their accessibility to other researchers. By organizing the language processing pipeline, providing complete lexicon scores and visualizations for all entities in a corpus, and providing functionality for users to target specific research questions, Riveter greatly improves the accessibility of verb lexica and can facilitate a broad range of future research. ",
    "url": "https://arxiv.org/abs/2312.09536",
    "authors": [
      "Maria Antoniak",
      "Anjalie Field",
      "Jimin Mun",
      "Melanie Walsh",
      "Lauren F. Klein",
      "Maarten Sap"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2312.09539",
    "title": "Situation-Dependent Causal Influence-Based Cooperative Multi-agent  Reinforcement Learning",
    "abstract": "Learning to collaborate has witnessed significant progress in multi-agent reinforcement learning (MARL). However, promoting coordination among agents and enhancing exploration capabilities remain challenges. In multi-agent environments, interactions between agents are limited in specific situations. Effective collaboration between agents thus requires a nuanced understanding of when and how agents' actions influence others. To this end, in this paper, we propose a novel MARL algorithm named Situation-Dependent Causal Influence-Based Cooperative Multi-agent Reinforcement Learning (SCIC), which incorporates a novel Intrinsic reward mechanism based on a new cooperation criterion measured by situation-dependent causal influence among agents. Our approach aims to detect inter-agent causal influences in specific situations based on the criterion using causal intervention and conditional mutual information. This effectively assists agents in exploring states that can positively impact other agents, thus promoting cooperation between agents. The resulting update links coordinated exploration and intrinsic reward distribution, which enhance overall collaboration and performance. Experimental results on various MARL benchmarks demonstrate the superiority of our method compared to state-of-the-art approaches. ",
    "url": "https://arxiv.org/abs/2312.09539",
    "authors": [
      "Xiao Du",
      "Yutong Ye",
      "Pengyu Zhang",
      "Yaning Yang",
      "Mingsong Chen",
      "Ting Wang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09541",
    "title": "Picking the Underused Heads: A Network Pruning Perspective of Attention  Head Selection for Fusing Dialogue Coreference Information",
    "abstract": "The Transformer-based models with the multi-head self-attention mechanism are widely used in natural language processing, and provide state-of-the-art results. While the pre-trained language backbones are shown to implicitly capture certain linguistic knowledge, explicitly incorporating structure-aware features can bring about further improvement on the downstream tasks. However, such enhancement often requires additional neural components and increases training parameter size. In this work, we investigate the attention head selection and manipulation strategy for feature injection from a network pruning perspective, and conduct a case study on dialogue summarization. We first rank attention heads in a Transformer-based summarizer with layer-wise importance. We then select the underused heads through extensive analysis, and inject structure-aware features by manipulating the selected heads. Experimental results show that the importance-based head selection is effective for feature injection, and dialogue summarization can be improved by incorporating coreference information via head manipulation. ",
    "url": "https://arxiv.org/abs/2312.09541",
    "authors": [
      "Zhengyuan Liu",
      "Nancy F. Chen"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2312.09547",
    "title": "Decaffe: DHT Tree-Based Online Federated Fake News Detection",
    "abstract": "The proliferation of mobile social networks (MSNs) has transformed information dissemination, leading to increased reliance on these platforms for news consumption. However, this shift has been accompanied by the widespread propagation of fake news, posing significant challenges in terms of public panic, political influence, and the obscuring of truth. Traditional data processing pipelines for fake news detection in MSNs suffer from lengthy response times and poor scalability, failing to address the unique characteristics of news in MSNs, such as prompt propagation, large-scale quantity, and rapid evolution. This paper introduces a novel system named Decaffe - a DHT Tree-Based Online Federated Fake News Detection system. Decaffe leverages distributed hash table (DHT)-based aggregation trees for scalability and real-time detection, and it employs two model fine-tuning methods for adapting to mobile network dynamics. The system's structure includes a root, branches, and leaves for effective dissemination of a pre-trained model and ensemble-based aggregation of predictive results. Decaffe uniquely combines centralized server-based and decentralized serverless model fine-tuning approaches with personalized model fine-tuning, addressing the challenges of real-time detection, scalability, and adaptability in the dynamic environment of MSNs. ",
    "url": "https://arxiv.org/abs/2312.09547",
    "authors": [
      "Cheng-Wei Ching",
      "Liting Hu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2312.09554",
    "title": "Embodied Adversarial Attack: A Dynamic Robust Physical Attack in  Autonomous Driving",
    "abstract": "As physical adversarial attacks become extensively applied in unearthing the potential risk of security-critical scenarios, especially in autonomous driving, their vulnerability to environmental changes has also been brought to light. The non-robust nature of physical adversarial attack methods brings less-than-stable performance consequently. To enhance the robustness of physical adversarial attacks in the real world, instead of statically optimizing a robust adversarial example via an off-line training manner like the existing methods, this paper proposes a brand new robust adversarial attack framework: Embodied Adversarial Attack (EAA) from the perspective of dynamic adaptation, which aims to employ the paradigm of embodied intelligence: Perception-Decision-Control to dynamically adjust the optimal attack strategy according to the current situations in real time. For the perception module, given the challenge of needing simulation for the victim's viewpoint, EAA innovatively devises a Perspective Transformation Network to estimate the target's transformation from the attacker's perspective. For the decision and control module, EAA adopts the laser-a highly manipulable medium to implement physical attacks, and further trains an attack agent with reinforcement learning to make it capable of instantaneously determining the best attack strategy based on the perceived information. Finally, we apply our framework to the autonomous driving scenario. A variety of experiments verify the high effectiveness of our method under complex scenes. ",
    "url": "https://arxiv.org/abs/2312.09554",
    "authors": [
      "Yitong Sun",
      "Yao Huang",
      "Xingxing Wei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09558",
    "title": "Towards Transferable Targeted 3D Adversarial Attack in the Physical  World",
    "abstract": "Compared with transferable untargeted attacks, transferable targeted adversarial attacks could specify the misclassification categories of adversarial samples, posing a greater threat to security-critical tasks. In the meanwhile, 3D adversarial samples, due to their potential of multi-view robustness, can more comprehensively identify weaknesses in existing deep learning systems, possessing great application value. However, the field of transferable targeted 3D adversarial attacks remains vacant. The goal of this work is to develop a more effective technique that could generate transferable targeted 3D adversarial examples, filling the gap in this field. To achieve this goal, we design a novel framework named TT3D that could rapidly reconstruct from few multi-view images into Transferable Targeted 3D textured meshes. While existing mesh-based texture optimization methods compute gradients in the high-dimensional mesh space and easily fall into local optima, leading to unsatisfactory transferability and distinct distortions, TT3D innovatively performs dual optimization towards both feature grid and Multi-layer Perceptron (MLP) parameters in the grid-based NeRF space, which significantly enhances black-box transferability while enjoying naturalness. Experimental results show that TT3D not only exhibits superior cross-model transferability but also maintains considerable adaptability across different renders and vision tasks. More importantly, we produce 3D adversarial examples with 3D printing techniques in the real world and verify their robust performance under various scenarios. ",
    "url": "https://arxiv.org/abs/2312.09558",
    "authors": [
      "Yao Huang",
      "Yinpeng Dong",
      "Shouwei Ruan",
      "Xiao Yang",
      "Hang Su",
      "Xingxing Wei"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09564",
    "title": "Exploiting Library Vulnerability via Migration Based Automating Test  Generation",
    "abstract": "In software development, developers extensively utilize third-party libraries to avoid implementing existing functionalities. When a new third-party library vulnerability is disclosed, project maintainers need to determine whether their projects are affected by the vulnerability, which requires developers to invest substantial effort in assessment. However, existing tools face a series of issues: static analysis tools produce false alarms, dynamic analysis tools require existing tests and test generation tools have low success rates when facing complex vulnerabilities. Vulnerability exploits, as code snippets provided for reproducing vulnerabilities after disclosure, contain a wealth of vulnerability-related information. This study proposes a new method based on vulnerability exploits, called VESTA (Vulnerability Exploit-based Software Testing Auto-Generator), which provides vulnerability exploit tests as the basis for developers to decide whether to update dependencies. VESTA extends the search-based test generation methods by adding a migration step, ensuring the similarity between the generated test and the vulnerability exploit, which increases the likelihood of detecting potential library vulnerabilities in a project. We perform experiments on 30 vulnerabilities disclosed in the past five years, involving 60 vulnerability-project pairs, and compare the experimental results with the baseline method, TRANSFER. The success rate of VESTA is 71.7\\% which is a 53.4\\% improvement over TRANSFER in the effectiveness of verifying exploitable vulnerabilities. ",
    "url": "https://arxiv.org/abs/2312.09564",
    "authors": [
      "Zirui Chen",
      "Xing Hu",
      "Xin Xia",
      "Yi Gao",
      "Tongtong Xu",
      "David Lo",
      "Xiaohu Yang"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2312.09577",
    "title": "GraphAr: An Efficient Storage Scheme for Graph Data in Data Lakes",
    "abstract": "Data lakes, increasingly adopted for their ability to store and analyze diverse types of data, commonly use columnar storage formats like Parquet and ORC for handling relational tables. However, these traditional setups fall short when it comes to efficiently managing graph data, particularly those conforming to the Labeled Property Graph (LPG) model. To address this gap, this paper introduces GraphAr, a specialized storage scheme designed to enhance existing data lakes for efficient graph data management. Leveraging the strengths of Parquet, GraphAr captures LPG semantics precisely and facilitates graph-specific operations such as neighbor retrieval and label filtering. Through innovative data organization, encoding, and decoding techniques, GraphAr dramatically improves performance. Our evaluations reveal that GraphAr outperforms conventional Parquet and Acero-based methods, achieving an average speedup of $3283\\times$ for neighbor retrieval, $6.0\\times$ for label filtering, and $29.5\\times$ for end-to-end workloads. These findings highlight GraphAr's potential to extend the utility of data lakes by enabling efficient graph data management. ",
    "url": "https://arxiv.org/abs/2312.09577",
    "authors": [
      "Xue Li",
      "Weibin Zeng",
      "Zhibin Wang",
      "Diwen Zhu",
      "Jingbo Xu",
      "Wenyuan Yu",
      "Jingren Zhou"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2312.09591",
    "title": "Incorporating Judgment Prediction into Legal Case Retrieval via  Law-aware Generative Retrieval",
    "abstract": "Legal case retrieval and judgment prediction are crucial components in intelligent legal systems. In practice, determining whether two cases share the same charges through legal judgment prediction is essential for establishing their relevance in case retrieval. However, current studies on legal case retrieval merely focus on the semantic similarity between paired cases, ignoring their charge-level consistency. This separation leads to a lack of context and potential inaccuracies in the case retrieval that can undermine trust in the system's decision-making process. Given the guidance role of laws to both tasks and inspired by the success of generative retrieval, in this work, we propose to incorporate judgment prediction into legal case retrieval, achieving a novel law-aware Generative legal case retrieval method called Gear. Specifically, Gear first extracts rationales (key circumstances and key elements) for legal cases according to the definition of charges in laws, ensuring a shared and informative representation for both tasks. Then in accordance with the inherent hierarchy of laws, we construct a law structure constraint tree and assign law-aware semantic identifier(s) to each case based on this tree. These designs enable a unified traversal from the root, through intermediate charge nodes, to case-specific leaf nodes, which respectively correspond to two tasks. Additionally, in the training, we also introduce a revision loss that jointly minimizes the discrepancy between the identifiers of predicted and labeled charges as well as retrieved cases, improving the accuracy and consistency for both tasks. Extensive experiments on two datasets demonstrate that Gear consistently outperforms state-of-the-art methods in legal case retrieval while maintaining competitive judgment prediction performance. ",
    "url": "https://arxiv.org/abs/2312.09591",
    "authors": [
      "Weicong Qin",
      "Zelin Cao",
      "Weijie Yu",
      "Zihua Si",
      "Sirui Chen",
      "Jun Xu"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2312.09601",
    "title": "Binary Code Summarization: Benchmarking ChatGPT/GPT-4 and Other Large  Language Models",
    "abstract": "Binary code summarization, while invaluable for understanding code semantics, is challenging due to its labor-intensive nature. This study delves into the potential of large language models (LLMs) for binary code comprehension. To this end, we present BinSum, a comprehensive benchmark and dataset of over 557K binary functions and introduce a novel method for prompt synthesis and optimization. To more accurately gauge LLM performance, we also propose a new semantic similarity metric that surpasses traditional exact-match approaches. Our extensive evaluation of prominent LLMs, including ChatGPT, GPT-4, Llama 2, and Code Llama, reveals 10 pivotal insights. This evaluation generates 4 billion inference tokens, incurred a total expense of 11,418 US dollars and 873 NVIDIA A100 GPU hours. Our findings highlight both the transformative potential of LLMs in this field and the challenges yet to be overcome. ",
    "url": "https://arxiv.org/abs/2312.09601",
    "authors": [
      "Xin Jin",
      "Jonathan Larson",
      "Weiwei Yang",
      "Zhiqiang Lin"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2312.09606",
    "title": "Reliable Prediction Intervals with Regression Neural Networks",
    "abstract": "This paper proposes an extension to conventional regression Neural Networks (NNs) for replacing the point predictions they produce with prediction intervals that satisfy a required level of confidence. Our approach follows a novel machine learning framework, called Conformal Prediction (CP), for assigning reliable confidence measures to predictions without assuming anything more than that the data are independent and identically distributed (i.i.d.). We evaluate the proposed method on four benchmark datasets and on the problem of predicting Total Electron Content (TEC), which is an important parameter in trans-ionospheric links; for the latter we use a dataset of more than 60000 TEC measurements collected over a period of 11 years. Our experimental results show that the prediction intervals produced by our method are both well-calibrated and tight enough to be useful in practice. ",
    "url": "https://arxiv.org/abs/2312.09606",
    "authors": [
      "Harris Papadopoulos",
      "Haris Haralambous"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2312.09613",
    "title": "Rethinking Causal Relationships Learning in Graph Neural Networks",
    "abstract": "Graph Neural Networks (GNNs) demonstrate their significance by effectively modeling complex interrelationships within graph-structured data. To enhance the credibility and robustness of GNNs, it becomes exceptionally crucial to bolster their ability to capture causal relationships. However, despite recent advancements that have indeed strengthened GNNs from a causal learning perspective, conducting an in-depth analysis specifically targeting the causal modeling prowess of GNNs remains an unresolved issue. In order to comprehensively analyze various GNN models from a causal learning perspective, we constructed an artificially synthesized dataset with known and controllable causal relationships between data and labels. The rationality of the generated data is further ensured through theoretical foundations. Drawing insights from analyses conducted using our dataset, we introduce a lightweight and highly adaptable GNN module designed to strengthen GNNs' causal learning capabilities across a diverse range of tasks. Through a series of experiments conducted on both synthetic datasets and other real-world datasets, we empirically validate the effectiveness of the proposed module. ",
    "url": "https://arxiv.org/abs/2312.09613",
    "authors": [
      "Hang Gao",
      "Chengyu Yao",
      "Jiangmeng Li",
      "Lingyu Si",
      "Yifan Jin",
      "Fengge Wu",
      "Changwen Zheng",
      "Huaping Liu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2312.09636",
    "title": "A Malware Classification Survey on Adversarial Attacks and Defences",
    "abstract": "As the number and complexity of malware attacks continue to increase, there is an urgent need for effective malware detection systems. While deep learning models are effective at detecting malware, they are vulnerable to adversarial attacks. Attacks like this can create malicious files that are resistant to detection, creating a significant cybersecurity risk. Recent research has seen the development of several adversarial attack and response approaches aiming at strengthening deep learning models' resilience to such attacks. This survey study offers an in-depth look at current research in adversarial attack and defensive strategies for malware classification in cybersecurity. The methods are classified into four categories: generative models, feature-based approaches, ensemble methods, and hybrid tactics. The article outlines cutting-edge procedures within each area, assessing their benefits and drawbacks. Each topic presents cutting-edge approaches and explores their advantages and disadvantages. In addition, the study discusses the datasets and assessment criteria that are often utilized on this subject. Finally, it identifies open research difficulties and suggests future study options. This document is a significant resource for malware categorization and cyber security researchers and practitioners. ",
    "url": "https://arxiv.org/abs/2312.09636",
    "authors": [
      "Mahesh Datta Sai Ponnuru",
      "Likhitha Amasala",
      "Tanu Sree Bhimavarapu",
      "Guna Chaitanya Garikipati"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.09651",
    "title": "What to Remember: Self-Adaptive Continual Learning for Audio Deepfake  Detection",
    "abstract": "The rapid evolution of speech synthesis and voice conversion has raised substantial concerns due to the potential misuse of such technology, prompting a pressing need for effective audio deepfake detection mechanisms. Existing detection models have shown remarkable success in discriminating known deepfake audio, but struggle when encountering new attack types. To address this challenge, one of the emergent effective approaches is continual learning. In this paper, we propose a continual learning approach called Radian Weight Modification (RWM) for audio deepfake detection. The fundamental concept underlying RWM involves categorizing all classes into two groups: those with compact feature distributions across tasks, such as genuine audio, and those with more spread-out distributions, like various types of fake audio. These distinctions are quantified by means of the in-class cosine distance, which subsequently serves as the basis for RWM to introduce a trainable gradient modification direction for distinct data types. Experimental evaluations against mainstream continual learning methods reveal the superiority of RWM in terms of knowledge acquisition and mitigating forgetting in audio deepfake detection. Furthermore, RWM's applicability extends beyond audio deepfake detection, demonstrating its potential significance in diverse machine learning domains such as image recognition. ",
    "url": "https://arxiv.org/abs/2312.09651",
    "authors": [
      "Xiaohui Zhang",
      "Jiangyan Yi",
      "Chenglong Wang",
      "Chuyuan Zhang",
      "Siding Zeng",
      "Jianhua Tao"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2312.09665",
    "title": "FlowMur: A Stealthy and Practical Audio Backdoor Attack with Limited  Knowledge",
    "abstract": "Speech recognition systems driven by DNNs have revolutionized human-computer interaction through voice interfaces, which significantly facilitate our daily lives. However, the growing popularity of these systems also raises special concerns on their security, particularly regarding backdoor attacks. A backdoor attack inserts one or more hidden backdoors into a DNN model during its training process, such that it does not affect the model's performance on benign inputs, but forces the model to produce an adversary-desired output if a specific trigger is present in the model input. Despite the initial success of current audio backdoor attacks, they suffer from the following limitations: (i) Most of them require sufficient knowledge, which limits their widespread adoption. (ii) They are not stealthy enough, thus easy to be detected by humans. (iii) Most of them cannot attack live speech, reducing their practicality. To address these problems, in this paper, we propose FlowMur, a stealthy and practical audio backdoor attack that can be launched with limited knowledge. FlowMur constructs an auxiliary dataset and a surrogate model to augment adversary knowledge. To achieve dynamicity, it formulates trigger generation as an optimization problem and optimizes the trigger over different attachment positions. To enhance stealthiness, we propose an adaptive data poisoning method according to Signal-to-Noise Ratio (SNR). Furthermore, ambient noise is incorporated into the process of trigger generation and data poisoning to make FlowMur robust to ambient noise and improve its practicality. Extensive experiments conducted on two datasets demonstrate that FlowMur achieves high attack performance in both digital and physical settings while remaining resilient to state-of-the-art defenses. In particular, a human study confirms that triggers generated by FlowMur are not easily detected by participants. ",
    "url": "https://arxiv.org/abs/2312.09665",
    "authors": [
      "Jiahe Lan",
      "Jie Wang",
      "Baochen Yan",
      "Zheng Yan",
      "Elisa Bertino"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09673",
    "title": "Style Generation in Robot Calligraphy with Deep Generative Adversarial  Networks",
    "abstract": "Robot calligraphy is an emerging exploration of artificial intelligence in the fields of art and education. Traditional calligraphy generation researches mainly focus on methods such as tool-based image processing, generative models, and style transfer. Unlike the English alphabet, the number of Chinese characters is tens of thousands, which leads to difficulties in the generation of a style consistent Chinese calligraphic font with over 6000 characters. Due to the lack of high-quality data sets, formal definitions of calligraphy knowledge, and scientific art evaluation methods, The results generated are frequently of low quality and falls short of professional-level requirements. To address the above problem, this paper proposes an automatic calligraphy generation model based on deep generative adversarial networks (deepGAN) that can generate style calligraphy fonts with professional standards. The key highlights of the proposed method include: (1) The datasets use a high-precision calligraphy synthesis method to ensure its high quality and sufficient quantity; (2) Professional calligraphers are invited to conduct a series of Turing tests to evaluate the gap between model generation results and human artistic level; (3) Experimental results indicate that the proposed model is the state-of-the-art among current calligraphy generation methods. The Turing tests and similarity evaluations validate the effectiveness of the proposed method. ",
    "url": "https://arxiv.org/abs/2312.09673",
    "authors": [
      "Xiaoming Wang",
      "Zhiguo Gong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.09676",
    "title": "nuScenes Knowledge Graph -- A comprehensive semantic representation of  traffic scenes for trajectory prediction",
    "abstract": "Trajectory prediction in traffic scenes involves accurately forecasting the behaviour of surrounding vehicles. To achieve this objective it is crucial to consider contextual information, including the driving path of vehicles, road topology, lane dividers, and traffic rules. Although studies demonstrated the potential of leveraging heterogeneous context for improving trajectory prediction, state-of-the-art deep learning approaches still rely on a limited subset of this information. This is mainly due to the limited availability of comprehensive representations. This paper presents an approach that utilizes knowledge graphs to model the diverse entities and their semantic connections within traffic scenes. Further, we present nuScenes Knowledge Graph (nSKG), a knowledge graph for the nuScenes dataset, that models explicitly all scene participants and road elements, as well as their semantic and spatial relationships. To facilitate the usage of the nSKG via graph neural networks for trajectory prediction, we provide the data in a format, ready-to-use by the PyG library. All artefacts can be found here: https://github.com/boschresearch/nuScenes_Knowledge_Graph ",
    "url": "https://arxiv.org/abs/2312.09676",
    "authors": [
      "Leon Mlodzian",
      "Zhigang Sun",
      "Hendrik Berkemeyer",
      "Sebastian Monka",
      "Zixu Wang",
      "Stefan Dietze",
      "Lavdim Halilaj",
      "Juergen Luettin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2312.09680",
    "title": "A Review of Validation and Verification of Neural Network-based Policies  for Sequential Decision Making",
    "abstract": "In sequential decision making, neural networks (NNs) are nowadays commonly used to represent and learn the agent's policy. This area of application has implied new software quality assessment challenges that traditional validation and verification practises are not able to handle. Subsequently, novel approaches have emerged to adapt those techniques to NN-based policies for sequential decision making. This survey paper aims at summarising these novel contributions and proposing future research directions. We conducted a literature review of recent research papers (from 2018 to beginning of 2023), whose topics cover aspects of the test or verification of NN-based policies. The selection has been enriched by a snowballing process from the previously selected papers, in order to relax the scope of the study and provide the reader with insight into similar verification challenges and their recent solutions. 18 papers have been finally selected. Our results show evidence of increasing interest for this subject. They highlight the diversity of both the exact problems considered and the techniques used to tackle them. ",
    "url": "https://arxiv.org/abs/2312.09680",
    "authors": [
      "Q. Mazouni",
      "H. Spieker",
      "A. Gotlieb",
      "M. Acher"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2312.09681",
    "title": "Urban Region Embedding via Multi-View Contrastive Prediction",
    "abstract": "Recently, learning urban region representations utilizing multi-modal data (information views) has become increasingly popular, for deep understanding of the distributions of various socioeconomic features in cities. However, previous methods usually blend multi-view information in a posteriors stage, falling short in learning coherent and consistent representations across different views. In this paper, we form a new pipeline to learn consistent representations across varying views, and propose the multi-view Contrastive Prediction model for urban Region embedding (ReCP), which leverages the multiple information views from point-of-interest (POI) and human mobility data. Specifically, ReCP comprises two major modules, namely an intra-view learning module utilizing contrastive learning and feature reconstruction to capture the unique information from each single view, and inter-view learning module that perceives the consistency between the two views using a contrastive prediction learning scheme. We conduct thorough experiments on two downstream tasks to assess the proposed model, i.e., land use clustering and region popularity prediction. The experimental results demonstrate that our model outperforms state-of-the-art baseline methods significantly in urban region representation learning. ",
    "url": "https://arxiv.org/abs/2312.09681",
    "authors": [
      "Zechen Li",
      "Weiming Huang",
      "Kai Zhao",
      "Min Yang",
      "Yongshun Gong",
      "Meng Chen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2312.09691",
    "title": "Quilt: Robust Data Segment Selection against Concept Drifts",
    "abstract": "Continuous machine learning pipelines are common in industrial settings where models are periodically trained on data streams. Unfortunately, concept drifts may occur in data streams where the joint distribution of the data X and label y, P(X, y), changes over time and possibly degrade model accuracy. Existing concept drift adaptation approaches mostly focus on updating the model to the new data possibly using ensemble techniques of previous models and tend to discard the drifted historical data. However, we contend that explicitly utilizing the drifted data together leads to much better model accuracy and propose Quilt, a data-centric framework for identifying and selecting data segments that maximize model accuracy. To address the potential downside of efficiency, Quilt extends existing data subset selection techniques, which can be used to reduce the training data without compromising model accuracy. These techniques cannot be used as is because they only assume virtual drifts where the posterior probabilities P(y|X) are assumed not to change. In contrast, a key challenge in our setup is to also discard undesirable data segments with concept drifts. Quilt thus discards drifted data segments and selects data segment subsets holistically for accurate and efficient model training. The two operations use gradient-based scores, which have little computation overhead. In our experiments, we show that Quilt outperforms state-of-the-art drift adaptation and data selection baselines on synthetic and real datasets. ",
    "url": "https://arxiv.org/abs/2312.09691",
    "authors": [
      "Minsu Kim",
      "Seong-Hyeon Hwang",
      "Steven Euijong Whang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09695",
    "title": "Robustness Verification of Deep Reinforcement Learning Based Control  Systems using Reward Martingales",
    "abstract": "Deep Reinforcement Learning (DRL) has gained prominence as an effective approach for control systems. However, its practical deployment is impeded by state perturbations that can severely impact system performance. Addressing this critical challenge requires robustness verification about system performance, which involves tackling two quantitative questions: (i) how to establish guaranteed bounds for expected cumulative rewards, and (ii) how to determine tail bounds for cumulative rewards. In this work, we present the first approach for robustness verification of DRL-based control systems by introducing reward martingales, which offer a rigorous mathematical foundation to characterize the impact of state perturbations on system performance in terms of cumulative rewards. Our verified results provide provably quantitative certificates for the two questions. We then show that reward martingales can be implemented and trained via neural networks, against different types of control policies. Experimental results demonstrate that our certified bounds tightly enclose simulation outcomes on various DRL-based control systems, indicating the effectiveness and generality of the proposed approach. ",
    "url": "https://arxiv.org/abs/2312.09695",
    "authors": [
      "Dapeng Zhi",
      "Peixin Wang",
      "Cheng Chen",
      "Min Zhang"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09708",
    "title": "GraphRARE: Reinforcement Learning Enhanced Graph Neural Network with  Relative Entropy",
    "abstract": "Graph neural networks (GNNs) have shown advantages in graph-based analysis tasks. However, most existing methods have the homogeneity assumption and show poor performance on heterophilic graphs, where the linked nodes have dissimilar features and different class labels, and the semantically related nodes might be multi-hop away. To address this limitation, this paper presents GraphRARE, a general framework built upon node relative entropy and deep reinforcement learning, to strengthen the expressive capability of GNNs. An innovative node relative entropy, which considers node features and structural similarity, is used to measure mutual information between node pairs. In addition, to avoid the sub-optimal solutions caused by mixing useful information and noises of remote nodes, a deep reinforcement learning-based algorithm is developed to optimize the graph topology. This algorithm selects informative nodes and discards noisy nodes based on the defined node relative entropy. Extensive experiments are conducted on seven real-world datasets. The experimental results demonstrate the superiority of GraphRARE in node classification and its capability to optimize the original graph topology. ",
    "url": "https://arxiv.org/abs/2312.09708",
    "authors": [
      "Tianhao Peng",
      "Wenjun Wu",
      "Haitao Yuan",
      "Zhifeng Bao",
      "Zhao Pengrui",
      "Xin Yu",
      "Xuetao Lin",
      "Yu Liang",
      "Yanjun Pu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09709",
    "title": "ParsNets: A Parsimonious Orthogonal and Low-Rank Linear Networks for  Zero-Shot Learning",
    "abstract": "This paper provides a novel parsimonious yet efficient design for zero-shot learning (ZSL), dubbed ParsNets, where we are interested in learning a composition of on-device friendly linear networks, each with orthogonality and low-rankness properties, to achieve equivalent or even better performance against existing deep models. Concretely, we first refactor the core module of ZSL, i.e., visual-semantics mapping function, into several base linear networks that correspond to diverse components of the semantic space, where the complex nonlinearity can be collapsed into simple local linearities. Then, to facilitate the generalization of local linearities, we construct a maximal margin geometry on the learned features by enforcing low-rank constraints on intra-class samples and high-rank constraints on inter-class samples, resulting in orthogonal subspaces for different classes and each subspace lies on a compact manifold. To enhance the model's adaptability and counterbalance over/under-fittings in ZSL, a set of sample-wise indicators is employed to select a sparse subset from these base linear networks to form a composite semantic predictor for each sample. Notably, maximal margin geometry can guarantee the diversity of features, and meanwhile, local linearities guarantee efficiency. Thus, our ParsNets can generalize better to unseen classes and can be deployed flexibly on resource-constrained devices. Theoretical explanations and extensive experiments are conducted to verify the effectiveness of the proposed method. ",
    "url": "https://arxiv.org/abs/2312.09709",
    "authors": [
      "Jingcai Guo",
      "Qihua Zhou",
      "Ruibing Li",
      "Xiaocheng Lu",
      "Ziming Liu",
      "Junyang Chen",
      "Xin Xie",
      "Jie Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09715",
    "title": "CETN: Contrast-enhanced Through Network for CTR Prediction",
    "abstract": "Click-through rate (CTR) Prediction is a crucial task in personalized information retrievals, such as industrial recommender systems, online advertising, and web search. Most existing CTR Prediction models utilize explicit feature interactions to overcome the performance bottleneck of implicit feature interactions. Hence, deep CTR models based on parallel structures (e.g., DCN, FinalMLP, xDeepFM) have been proposed to obtain joint information from different semantic spaces. However, these parallel subcomponents lack effective supervisory signals, making it challenging to efficiently capture valuable multi-views feature interaction information in different semantic spaces. To address this issue, we propose a simple yet effective novel CTR model: Contrast-enhanced Through Network for CTR (CETN), so as to ensure the diversity and homogeneity of feature interaction information. Specifically, CETN employs product-based feature interactions and the augmentation (perturbation) concept from contrastive learning to segment different semantic spaces, each with distinct activation functions. This improves diversity in the feature interaction information captured by the model. Additionally, we introduce self-supervised signals and through connection within each semantic space to ensure the homogeneity of the captured feature interaction information. The experiments and research conducted on four real datasets demonstrate that our model consistently outperforms twenty baseline models in terms of AUC and Logloss. ",
    "url": "https://arxiv.org/abs/2312.09715",
    "authors": [
      "Honghao Li",
      "Lei Sang",
      "Yi Zhang",
      "Xuyun Zhang",
      "Yiwen Zhang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2312.09741",
    "title": "PELP: Pioneer Event Log Prediction Using Sequence-to-Sequence Neural  Networks",
    "abstract": "Process mining, a data-driven approach for analyzing, visualizing, and improving business processes using event logs, has emerged as a powerful technique in the field of business process management. Process forecasting is a sub-field of process mining that studies how to predict future processes and process models. In this paper, we introduce and motivate the problem of event log prediction and present our approach to solving the event log prediction problem, in particular, using the sequence-to-sequence deep learning approach. We evaluate and analyze the prediction outcomes on a variety of synthetic logs and seven real-life logs and show that our approach can generate perfect predictions on synthetic logs and that deep learning techniques have the potential to be applied in real-world event log prediction tasks. We further provide practical recommendations for event log predictions grounded in the outcomes of the conducted experiments. ",
    "url": "https://arxiv.org/abs/2312.09741",
    "authors": [
      "Wenjun Zhou",
      "Artem Polyvyanyy",
      "James Bailey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2312.09744",
    "title": "Bridging the Semantic-Numerical Gap: A Numerical Reasoning Method of  Cross-modal Knowledge Graph for Material Property Prediction",
    "abstract": "Using machine learning (ML) techniques to predict material properties is a crucial research topic. These properties depend on numerical data and semantic factors. Due to the limitations of small-sample datasets, existing methods typically adopt ML algorithms to regress numerical properties or transfer other pre-trained knowledge graphs (KGs) to the material. However, these methods cannot simultaneously handle semantic and numerical information. In this paper, we propose a numerical reasoning method for material KGs (NR-KG), which constructs a cross-modal KG using semantic nodes and numerical proxy nodes. It captures both types of information by projecting KG into a canonical KG and utilizes a graph neural network to predict material properties. In this process, a novel projection prediction loss is proposed to extract semantic features from numerical information. NR-KG facilitates end-to-end processing of cross-modal data, mining relationships and cross-modal information in small-sample datasets, and fully utilizes valuable experimental data to enhance material prediction. We further propose two new High-Entropy Alloys (HEA) property datasets with semantic descriptions. NR-KG outperforms state-of-the-art (SOTA) methods, achieving relative improvements of 25.9% and 16.1% on two material datasets. Besides, NR-KG surpasses SOTA methods on two public physical chemistry molecular datasets, showing improvements of 22.2% and 54.3%, highlighting its potential application and generalizability. We hope the proposed datasets, algorithms, and pre-trained models can facilitate the communities of KG and AI for materials. ",
    "url": "https://arxiv.org/abs/2312.09744",
    "authors": [
      "Guangxuan Song",
      "Dongmei Fu",
      "Zhongwei Qiu",
      "Zijiang Yang",
      "Jiaxin Dai",
      "Lingwei Ma",
      "Dawei Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Materials Science (cond-mat.mtrl-sci)"
    ]
  },
  {
    "id": "arXiv:2312.09748",
    "title": "Verification-Friendly Deep Neural Networks",
    "abstract": "Machine learning techniques often lack formal correctness guarantees. This is evidenced by the widespread adversarial examples that plague most deep-learning applications. This resulted in several research efforts that aim at verifying deep neural networks, with a particular focus on safety-critical applications. However, formal verification techniques still face major scalability and precision challenges when dealing with the complexity of such networks. The over-approximation introduced during the formal verification process to tackle the scalability challenge often results in inconclusive analysis. To address this challenge, we propose a novel framework to generate Verification-friendly Neural Networks (VNNs). We present a post-training optimization framework to achieve a balance between preserving prediction performance and robustness in the resulting networks. Our proposed framework proves to result in networks that are comparable to the original ones in terms of prediction performance, while amenable to verification. This essentially enables us to establish robustness for more VNNs than their deep neural network counterparts, in a more time-efficient manner. ",
    "url": "https://arxiv.org/abs/2312.09748",
    "authors": [
      "Anahita Baninajjar",
      "Ahmed Rezine",
      "Amir Aminifar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2312.09752",
    "title": "An algebraic multiscale method for spatial network models",
    "abstract": "In this work, we present a multiscale approach for the reliable coarse-scale approximation of spatial network models represented by a linear system of equations with respect to the nodes of a graph. The method is based on the ideas of the Localized Orthogonal Decomposition (LOD) strategy and is constructed in a fully algebraic way. This allows to apply the method to geometrically challenging objects such as corrugated cardboard. In particular, the method can also be applied to finite difference or finite element discretizations of elliptic partial differential equations, yielding an approximation with similar properties as the LOD in the continuous setting. We present a rigorous error analysis of the proposed method under suitable assumptions on the network. Moreover, numerical examples are presented that underline our theoretical results. ",
    "url": "https://arxiv.org/abs/2312.09752",
    "authors": [
      "Moritz Hauck",
      "Roland Maier",
      "Axel Målqvist"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2312.09758",
    "title": "Diagnosing and Rectifying Fake OOD Invariance: A Restructured Causal  Approach",
    "abstract": "Invariant representation learning (IRL) encourages the prediction from invariant causal features to labels de-confounded from the environments, advancing the technical roadmap of out-of-distribution (OOD) generalization. Despite spotlights around, recent theoretical results verified that some causal features recovered by IRLs merely pretend domain-invariantly in the training environments but fail in unseen domains. The \\emph{fake invariance} severely endangers OOD generalization since the trustful objective can not be diagnosed and existing causal surgeries are invalid to rectify. In this paper, we review a IRL family (InvRat) under the Partially and Fully Informative Invariant Feature Structural Causal Models (PIIF SCM /FIIF SCM) respectively, to certify their weaknesses in representing fake invariant features, then, unify their causal diagrams to propose ReStructured SCM (RS-SCM). RS-SCM can ideally rebuild the spurious and the fake invariant features simultaneously. Given this, we further develop an approach based on conditional mutual information with respect to RS-SCM, then rigorously rectify the spurious and fake invariant effects. It can be easily implemented by a small feature selection subnet introduced in the IRL family, which is alternatively optimized to achieve our goal. Experiments verified the superiority of our approach to fight against the fake invariant issue across a variety of OOD generalization benchmarks. ",
    "url": "https://arxiv.org/abs/2312.09758",
    "authors": [
      "Ziliang Chen",
      "Yongsen Zheng",
      "Zhao-Rong Lai",
      "Quanlong Guan",
      "Liang Lin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2312.09780",
    "title": "RANRAC: Robust Neural Scene Representations via Random Ray Consensus",
    "abstract": "We introduce RANRAC, a robust reconstruction algorithm for 3D objects handling occluded and distracted images, which is a particularly challenging scenario that prior robust reconstruction methods cannot deal with. Our solution supports single-shot reconstruction by involving light-field networks, and is also applicable to photo-realistic, robust, multi-view reconstruction from real-world images based on neural radiance fields. While the algorithm imposes certain limitations on the scene representation and, thereby, the supported scene types, it reliably detects and excludes inconsistent perspectives, resulting in clean images without floating artifacts. Our solution is based on a fuzzy adaption of the random sample consensus paradigm, enabling its application to large scale models. We interpret the minimal number of samples to determine the model parameters as a tunable hyperparameter. This is applicable, as a cleaner set of samples improves reconstruction quality. Further, this procedure also handles outliers. Especially for conditioned models, it can result in the same local minimum in the latent space as would be obtained with a completely clean set. We report significant improvements for novel-view synthesis in occluded scenarios, of up to 8dB PSNR compared to the baseline. ",
    "url": "https://arxiv.org/abs/2312.09780",
    "authors": [
      "Benno Buschmann",
      "Andreea Dogaru",
      "Elmar Eisemann",
      "Michael Weinmann",
      "Bernhard Egger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09783",
    "title": "Keep the Faith: Faithful Explanations in Convolutional Neural Networks  for Case-Based Reasoning",
    "abstract": "Explaining predictions of black-box neural networks is crucial when applied to decision-critical tasks. Thus, attribution maps are commonly used to identify important image regions, despite prior work showing that humans prefer explanations based on similar examples. To this end, ProtoPNet learns a set of class-representative feature vectors (prototypes) for case-based reasoning. During inference, similarities of latent features to prototypes are linearly classified to form predictions and attribution maps are provided to explain the similarity. In this work, we evaluate whether architectures for case-based reasoning fulfill established axioms required for faithful explanations using the example of ProtoPNet. We show that such architectures allow the extraction of faithful explanations. However, we prove that the attribution maps used to explain the similarities violate the axioms. We propose a new procedure to extract explanations for trained ProtoPNets, named ProtoPFaith. Conceptually, these explanations are Shapley values, calculated on the similarity scores of each prototype. They allow to faithfully answer which prototypes are present in an unseen image and quantify each pixel's contribution to that presence, thereby complying with all axioms. The theoretical violations of ProtoPNet manifest in our experiments on three datasets (CUB-200-2011, Stanford Dogs, RSNA) and five architectures (ConvNet, ResNet, ResNet50, WideResNet50, ResNeXt50). Our experiments show a qualitative difference between the explanations given by ProtoPNet and ProtoPFaith. Additionally, we quantify the explanations with the Area Over the Perturbation Curve, on which ProtoPFaith outperforms ProtoPNet on all experiments by a factor $>10^3$. ",
    "url": "https://arxiv.org/abs/2312.09783",
    "authors": [
      "Tom Nuno Wolf",
      "Fabian Bongratz",
      "Anne-Marie Rickmann",
      "Sebastian Pölsterl",
      "Christian Wachinger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09787",
    "title": "Physics-informed Neural Network Estimation of Material Properties in  Soft Tissue Nonlinear Biomechanical Models",
    "abstract": "The development of biophysical models for clinical applications is rapidly advancing in the research community, thanks to their predictive nature and their ability to assist the interpretation of clinical data. However, high-resolution and accurate multi-physics computational models are computationally expensive and their personalisation involves fine calibration of a large number of parameters, which may be space-dependent, challenging their clinical translation. In this work, we propose a new approach which relies on the combination of physics-informed neural networks (PINNs) with three-dimensional soft tissue nonlinear biomechanical models, capable of reconstructing displacement fields and estimating heterogeneous patient-specific biophysical properties. The proposed learning algorithm encodes information from a limited amount of displacement and, in some cases, strain data, that can be routinely acquired in the clinical setting, and combines it with the physics of the problem, represented by a mathematical model based on partial differential equations, to regularise the problem and improve its convergence properties. Several benchmarks are presented to show the accuracy and robustness of the proposed method and its great potential to enable the robust and effective identification of patient-specific, heterogeneous physical properties, s.a. tissue stiffness properties. In particular, we demonstrate the capability of the PINN to detect the presence, location and severity of scar tissue, which is beneficial to develop personalised simulation models for disease diagnosis, especially for cardiac applications. ",
    "url": "https://arxiv.org/abs/2312.09787",
    "authors": [
      "Federica Caforio",
      "Francesco Regazzoni",
      "Stefano Pagani",
      "Elias Karabelas",
      "Christoph Augustin",
      "Gundolf Haase",
      "Gernot Plank",
      "Alfio Quarteroni"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Biological Physics (physics.bio-ph)",
      "Medical Physics (physics.med-ph)"
    ]
  },
  {
    "id": "arXiv:2312.09790",
    "title": "End-to-End Training of Neural Networks for Automotive Radar Interference  Mitigation",
    "abstract": "In this paper we propose a new method for training neural networks (NNs) for frequency modulated continuous wave (FMCW) radar mutual interference mitigation. Instead of training NNs to regress from interfered to clean radar signals as in previous work, we train NNs directly on object detection maps. We do so by performing a continuous relaxation of the cell-averaging constant false alarm rate (CA-CFAR) peak detector, which is a well-established algorithm for object detection using radar. With this new training objective we are able to increase object detection performance by a large margin. Furthermore, we introduce separable convolution kernels to strongly reduce the number of parameters and computational complexity of convolutional NN architectures for radar applications. We validate our contributions with experiments on real-world measurement data and compare them against signal processing interference mitigation methods. ",
    "url": "https://arxiv.org/abs/2312.09790",
    "authors": [
      "Christian Oswald",
      "Mate Toth",
      "Paul Meissner",
      "Franz Pernkopf"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2312.09791",
    "title": "Network Members Can Hide from Group Centrality Measures",
    "abstract": "Group centrality measures are a generalization of standard centrality, designed to quantify the importance of not just a single node (as is the case with standard measures) but rather that of a group of nodes. Some nodes may have an incentive to evade such measures, i.e., to hide their actual importance, in order to conceal their true role in the network. A number of studies have been proposed in the literature to understand how nodes can rewire the network in order to evade standard centrality, but no study has focused on group centrality to date. We close this gap by analyzing four group centrality measures: degree, closeness, betweenness, and GED-walk. We show that an optimal way to rewire the network can be computed efficiently given the former measure, but the problem is NP-complete given closeness and betweenness. Moreover, we empirically evaluate a number of hiding strategies, and show that an optimal way to hide from degree group centrality is also effective in practice against the other measures. Altogether, our results suggest that it is possible to hide from group centrality measures based solely on the local information available to the group members about the network topology. ",
    "url": "https://arxiv.org/abs/2312.09791",
    "authors": [
      "Marcin Waniek",
      "Talal Rahwan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2312.09797",
    "title": "Part Representation Learning with Teacher-Student Decoder for Occluded  Person Re-identification",
    "abstract": "Occluded person re-identification (ReID) is a very challenging task due to the occlusion disturbance and incomplete target information. Leveraging external cues such as human pose or parsing to locate and align part features has been proven to be very effective in occluded person ReID. Meanwhile, recent Transformer structures have a strong ability of long-range modeling. Considering the above facts, we propose a Teacher-Student Decoder (TSD) framework for occluded person ReID, which utilizes the Transformer decoder with the help of human parsing. More specifically, our proposed TSD consists of a Parsing-aware Teacher Decoder (PTD) and a Standard Student Decoder (SSD). PTD employs human parsing cues to restrict Transformer's attention and imparts this information to SSD through feature distillation. Thereby, SSD can learn from PTD to aggregate information of body parts automatically. Moreover, a mask generator is designed to provide discriminative regions for better ReID. In addition, existing occluded person ReID benchmarks utilize occluded samples as queries, which will amplify the role of alleviating occlusion interference and underestimate the impact of the feature absence issue. Contrastively, we propose a new benchmark with non-occluded queries, serving as a complement to the existing benchmark. Extensive experiments demonstrate that our proposed method is superior and the new benchmark is essential. The source codes are available at https://github.com/hh23333/TSD. ",
    "url": "https://arxiv.org/abs/2312.09797",
    "authors": [
      "Shang Gao",
      "Chenyang Yu",
      "Pingping Zhang",
      "Huchuan Lu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2312.09802",
    "title": "Concept Prerequisite Relation Prediction by Using  Permutation-Equivariant Directed Graph Neural Networks",
    "abstract": "This paper studies the problem of CPRP, concept prerequisite relation prediction, which is a fundamental task in using AI for education. CPRP is usually formulated into a link-prediction task on a relationship graph of concepts and solved by training the graph neural network (GNN) model. However, current directed GNNs fail to manage graph isomorphism which refers to the invariance of non-isomorphic graphs, reducing the expressivity of resulting representations. We present a permutation-equivariant directed GNN model by introducing the Weisfeiler-Lehman test into directed GNN learning. Our method is then used for CPRP and evaluated on three public datasets. The experimental results show that our model delivers better prediction performance than the state-of-the-art methods. ",
    "url": "https://arxiv.org/abs/2312.09802",
    "authors": [
      "Xiran Qu",
      "Xuequn Shang",
      "Yupei Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09816",
    "title": "Directed Acyclic Graph Based Blockchain Systems",
    "abstract": "Blockchain technology has been revolutionizing many fields since last decade. Its true potential is not practically utilized yet. In a very short period of time, it has evolved twice - Smart contracts and Directed Acyclic Graph (DAG). DAG based blockchains currently referred to as Blockchain 3.0 solves many issues in the current conventional blockchain technologies including transaction fees, transaction approval times and scalability. In this paper, we present a comparative analysis of blockchain implementations based on DAG including IOTA, NxT, Byteball, Nano, DAGCoin, Fantom, XDAG and Caixapay. We discuss limitations of both conventional and DAG based blockchains and suggest when to prefer DAG based blockchains. ",
    "url": "https://arxiv.org/abs/2312.09816",
    "authors": [
      "Anand Devarajan",
      "Erkan Karabulut"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.09821",
    "title": "Fragility, Robustness and Antifragility in Deep Learning",
    "abstract": "We propose a systematic analysis of deep neural networks (DNNs) based on a signal processing technique for network parameter removal, in the form of synaptic filters that identifies the fragility, robustness and antifragility characteristics of DNN parameters. Our proposed analysis investigates if the DNN performance is impacted negatively, invariantly, or positively on both clean and adversarially perturbed test datasets when the DNN undergoes synaptic filtering. We define three \\textit{filtering scores} for quantifying the fragility, robustness and antifragility characteristics of DNN parameters based on the performances for (i) clean dataset, (ii) adversarial dataset, and (iii) the difference in performances of clean and adversarial datasets. We validate the proposed systematic analysis on ResNet-18, ResNet-50, SqueezeNet-v1.1 and ShuffleNet V2 x1.0 network architectures for MNIST, CIFAR10 and Tiny ImageNet datasets. The filtering scores, for a given network architecture, identify network parameters that are invariant in characteristics across different datasets over learning epochs. Vice-versa, for a given dataset, the filtering scores identify the parameters that are invariant in characteristics across different network architectures. We show that our synaptic filtering method improves the test accuracy of ResNet and ShuffleNet models on adversarial datasets when only the robust and antifragile parameters are selectively retrained at any given epoch, thus demonstrating applications of the proposed strategy in improving model robustness. ",
    "url": "https://arxiv.org/abs/2312.09821",
    "authors": [
      "Chandresh Pravin",
      "Ivan Martino",
      "Giuseppe Nicosia",
      "Varun Ojha"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09844",
    "title": "Small Dataset, Big Gains: Enhancing Reinforcement Learning by Offline  Pre-Training with Model Based Augmentation",
    "abstract": "Offline reinforcement learning leverages pre-collected datasets of transitions to train policies. It can serve as effective initialization for online algorithms, enhancing sample efficiency and speeding up convergence. However, when such datasets are limited in size and quality, offline pre-training can produce sub-optimal policies and lead to degraded online reinforcement learning performance. In this paper we propose a model-based data augmentation strategy to maximize the benefits of offline reinforcement learning pre-training and reduce the scale of data needed to be effective. Our approach leverages a world model of the environment trained on the offline dataset to augment states during offline pre-training. We evaluate our approach on a variety of MuJoCo robotic tasks and our results show it can jump-start online fine-tuning and substantially reduce - in some cases by an order of magnitude - the required number of environment interactions. ",
    "url": "https://arxiv.org/abs/2312.09844",
    "authors": [
      "Girolamo Macaluso",
      "Alessandro Sestini",
      "Andrew D. Bagdanov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09866",
    "title": "PLGSLAM: Progressive Neural Scene Represenation with Local to Global  Bundle Adjustment",
    "abstract": "Neural implicit scene representations have recently shown encouraging results in dense visual SLAM. However, existing methods produce low-quality scene reconstruction and low-accuracy localization performance when scaling up to large indoor scenes and long sequences. These limitations are mainly due to their single, global radiance field with finite capacity, which does not adapt to large scenarios. Their end-to-end pose networks are also not robust enough with the growth of cumulative errors in large scenes. To this end, we present PLGSLAM, a neural visual SLAM system which performs high-fidelity surface reconstruction and robust camera tracking in real time. To handle large-scale indoor scenes, PLGSLAM proposes a progressive scene representation method which dynamically allocates new local scene representation trained with frames within a local sliding window. This allows us to scale up to larger indoor scenes and improves robustness (even under pose drifts). In local scene representation, PLGSLAM utilizes tri-planes for local high-frequency features. We also incorporate multi-layer perceptron (MLP) networks for the low-frequency feature, smoothness, and scene completion in unobserved areas. Moreover, we propose local-to-global bundle adjustment method with a global keyframe database to address the increased pose drifts on long sequences. Experimental results demonstrate that PLGSLAM achieves state-of-the-art scene reconstruction results and tracking performance across various datasets and scenarios (both in small and large-scale indoor environments). The code will be open-sourced upon paper acceptance. ",
    "url": "https://arxiv.org/abs/2312.09866",
    "authors": [
      "Tianchen Deng",
      "Guole Shen",
      "Tong Qin",
      "Jianyu Wang",
      "Wentao Zhao",
      "Jingchuan Wang",
      "Danwei Wang",
      "Weidong Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09881",
    "title": "Dynamic Heterogeneous Federated Learning with Multi-Level Prototypes",
    "abstract": "Federated learning shows promise as a privacy-preserving collaborative learning technique. Existing heterogeneous federated learning mainly focuses on skewing the label distribution across clients. However, most approaches suffer from catastrophic forgetting and concept drift, mainly when the global distribution of all classes is extremely unbalanced and the data distribution of the client dynamically evolves over time. In this paper, we study the new task, i.e., Dynamic Heterogeneous Federated Learning (DHFL), which addresses the practical scenario where heterogeneous data distributions exist among different clients and dynamic tasks within the client. Accordingly, we propose a novel federated learning framework named Federated Multi-Level Prototypes (FedMLP) and design federated multi-level regularizations. To mitigate concept drift, we construct prototypes and semantic prototypes to provide fruitful generalization knowledge and ensure the continuity of prototype spaces. To maintain the model stability and consistency of convergence, three regularizations are introduced as training losses, i.e., prototype-based regularization, semantic prototype-based regularization, and federated inter-task regularization. Extensive experiments show that the proposed method achieves state-of-the-art performance in various settings. ",
    "url": "https://arxiv.org/abs/2312.09881",
    "authors": [
      "Shunxin Guo",
      "Hongsong Wang",
      "Xin Geng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09895",
    "title": "Generative Context-aware Fine-tuning of Self-supervised Speech Models",
    "abstract": "When performing tasks like automatic speech recognition or spoken language understanding for a given utterance, access to preceding text or audio provides contextual information can improve performance. Considering the recent advances in generative large language models (LLM), we hypothesize that an LLM could generate useful context information using the preceding text. With appropriate prompts, LLM could generate a prediction of the next sentence or abstractive text like titles or topics. In this paper, we study the use of LLM-generated context information and propose an approach to distill the generated information during fine-tuning of self-supervised speech models, which we refer to as generative context-aware fine-tuning. This approach allows the fine-tuned model to make improved predictions without access to the true surrounding segments or to the LLM at inference time, while requiring only a very small additional context module. We evaluate the proposed approach using the SLUE and Libri-light benchmarks for several downstream tasks: automatic speech recognition, named entity recognition, and sentiment analysis. The results show that generative context-aware fine-tuning outperforms a context injection fine-tuning approach that accesses the ground-truth previous text, and is competitive with a generative context injection fine-tuning approach that requires the LLM at inference time. ",
    "url": "https://arxiv.org/abs/2312.09895",
    "authors": [
      "Suwon Shon",
      "Kwangyoun Kim",
      "Prashant Sridhar",
      "Yi-Te Hsu",
      "Shinji Watanabe",
      "Karen Livescu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2312.09901",
    "title": "Temporally and Distributionally Robust Optimization for Cold-start  Recommendation",
    "abstract": "Collaborative Filtering (CF) recommender models highly depend on user-item interactions to learn CF representations, thus falling short of recommending cold-start items. To address this issue, prior studies mainly introduce item features (e.g., thumbnails) for cold-start item recommendation. They learn a feature extractor on warm-start items to align feature representations with interactions, and then leverage the feature extractor to extract the feature representations of cold-start items for interaction prediction. Unfortunately, the features of cold-start items, especially the popular ones, tend to diverge from those of warm-start ones due to temporal feature shifts, preventing the feature extractor from accurately learning feature representations of cold-start items. To alleviate the impact of temporal feature shifts, we consider using Distributionally Robust Optimization (DRO) to enhance the generation ability of the feature extractor. Nonetheless, existing DRO methods face an inconsistency issue: the worse-case warm-start items emphasized during DRO training might not align well with the cold-start item distribution. To capture the temporal feature shifts and combat this inconsistency issue, we propose a novel temporal DRO with new optimization objectives, namely, 1) to integrate a worst-case factor to improve the worst-case performance, and 2) to devise a shifting factor to capture the shifting trend of item features and enhance the optimization of the potentially popular groups in cold-start items. Substantial experiments on three real-world datasets validate the superiority of our temporal DRO in enhancing the generalization ability of cold-start recommender models. ",
    "url": "https://arxiv.org/abs/2312.09901",
    "authors": [
      "Xinyu Lin",
      "Wenjie Wang",
      "Jujia Zhao",
      "Yongqi Li",
      "Fuli Feng",
      "Tat-Seng Chua"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2312.09912",
    "title": "Reliable Probabilistic Classification with Neural Networks",
    "abstract": "Venn Prediction (VP) is a new machine learning framework for producing well-calibrated probabilistic predictions. In particular it provides well-calibrated lower and upper bounds for the conditional probability of an example belonging to each possible class of the problem at hand. This paper proposes five VP methods based on Neural Networks (NNs), which is one of the most widely used machine learning techniques. The proposed methods are evaluated experimentally on four benchmark datasets and the obtained results demonstrate the empirical well-calibratedness of their outputs and their superiority over the outputs of the traditional NN classifier. ",
    "url": "https://arxiv.org/abs/2312.09912",
    "authors": [
      "Harris Papadopoulos"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.09913",
    "title": "LAENeRF: Local Appearance Editing for Neural Radiance Fields",
    "abstract": "Due to the omnipresence of Neural Radiance Fields (NeRFs), the interest towards editable implicit 3D representations has surged over the last years. However, editing implicit or hybrid representations as used for NeRFs is difficult due to the entanglement of appearance and geometry encoded in the model parameters. Despite these challenges, recent research has shown first promising steps towards photorealistic and non-photorealistic appearance edits. The main open issues of related work include limited interactivity, a lack of support for local edits and large memory requirements, rendering them less useful in practice. We address these limitations with LAENeRF, a unified framework for photorealistic and non-photorealistic appearance editing of NeRFs. To tackle local editing, we leverage a voxel grid as starting point for region selection. We learn a mapping from expected ray terminations to final output color, which can optionally be supervised by a style loss, resulting in a framework which can perform photorealistic and non-photorealistic appearance editing of selected regions. Relying on a single point per ray for our mapping, we limit memory requirements and enable fast optimization. To guarantee interactivity, we compose the output color using a set of learned, modifiable base colors, composed with additive layer mixing. Compared to concurrent work, LAENeRF enables recoloring and stylization while keeping processing time low. Furthermore, we demonstrate that our approach surpasses baseline methods both quantitatively and qualitatively. ",
    "url": "https://arxiv.org/abs/2312.09913",
    "authors": [
      "Lukas Radl",
      "Michael Steiner",
      "Andreas Kurz",
      "Markus Steinberger"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09925",
    "title": "CNC-Net: Self-Supervised Learning for CNC Machining Operations",
    "abstract": "CNC manufacturing is a process that employs computer numerical control (CNC) machines to govern the movements of various industrial tools and machinery, encompassing equipment ranging from grinders and lathes to mills and CNC routers. However, the reliance on manual CNC programming has become a bottleneck, and the requirement for expert knowledge can result in significant costs. Therefore, we introduce a pioneering approach named CNC-Net, representing the use of deep neural networks (DNNs) to simulate CNC machines and grasp intricate operations when supplied with raw materials. CNC-Net constitutes a self-supervised framework that exclusively takes an input 3D model and subsequently generates the essential operation parameters required by the CNC machine to construct the object. Our method has the potential to transformative automation in manufacturing by offering a cost-effective alternative to the high costs of manual CNC programming while maintaining exceptional precision in 3D object production. Our experiments underscore the effectiveness of our CNC-Net in constructing the desired 3D objects through the utilization of CNC operations. Notably, it excels in preserving finer local details, exhibiting a marked enhancement in precision compared to the state-of-the-art 3D CAD reconstruction approaches. ",
    "url": "https://arxiv.org/abs/2312.09925",
    "authors": [
      "Mohsen Yavartanoo",
      "Sangmin Hong",
      "Reyhaneh Neshatavar",
      "Kyoung Mu Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09940",
    "title": "Sketch and shift: a robust decoder for compressive clustering",
    "abstract": "Compressive learning is an emerging approach to drastically reduce the memory footprint of large-scale learning, by first summarizing a large dataset into a low-dimensional sketch vector, and then decoding from this sketch the latent information needed for learning. In light of recent progress on information preservation guarantees for sketches based on random features, a major objective is to design easy-to-tune algorithms (called decoders) to robustly and efficiently extract this information. To address the underlying non-convex optimization problems, various heuristics have been proposed. In the case of compressive clustering, the standard heuristic is CL-OMPR, a variant of sliding Frank-Wolfe. Yet, CL-OMPR is hard to tune, and the examination of its robustness was overlooked. In this work, we undertake a scrutinized examination of CL-OMPR to circumvent its limitations. In particular, we show how this algorithm can fail to recover the clusters even in advantageous scenarios. To gain insight, we show how the deficiencies of this algorithm can be attributed to optimization difficulties related to the structure of a correlation function appearing at core steps of the algorithm. To address these limitations, we propose an alternative decoder offering substantial improvements over CL-OMPR. Its design is notably inspired from the mean shift algorithm, a classic approach to detect the local maxima of kernel density estimators. The proposed algorithm can extract clustering information from a sketch of the MNIST dataset that is 10 times smaller than previously. ",
    "url": "https://arxiv.org/abs/2312.09940",
    "authors": [
      "Ayoub Belhadji",
      "Rémi Gribonval"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2312.09950",
    "title": "Peer Learning: Learning Complex Policies in Groups from Scratch via  Action Recommendations",
    "abstract": "Peer learning is a novel high-level reinforcement learning framework for agents learning in groups. While standard reinforcement learning trains an individual agent in trial-and-error fashion, all on its own, peer learning addresses a related setting in which a group of agents, i.e., peers, learns to master a task simultaneously together from scratch. Peers are allowed to communicate only about their own states and actions recommended by others: \"What would you do in my situation?\". Our motivation is to study the learning behavior of these agents. We formalize the teacher selection process in the action advice setting as a multi-armed bandit problem and therefore highlight the need for exploration. Eventually, we analyze the learning behavior of the peers and observe their ability to rank the agents' performance within the study group and understand which agents give reliable advice. Further, we compare peer learning with single agent learning and a state-of-the-art action advice baseline. We show that peer learning is able to outperform single-agent learning and the baseline in several challenging discrete and continuous OpenAI Gym domains. Doing so, we also show that within such a framework complex policies from action recommendations beyond discrete action spaces can evolve. ",
    "url": "https://arxiv.org/abs/2312.09950",
    "authors": [
      "Cedric Derstroff",
      "Mattia Cerrato",
      "Jannis Brugger",
      "Jan Peters",
      "Stefan Kramer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Multiagent Systems (cs.MA)"
    ]
  },
  {
    "id": "arXiv:2312.09956",
    "title": "An artificial neural network approach to finding the key length of the  Vigenère cipher",
    "abstract": "In this article, we create an artificial neural network (ANN) that combines both classical and modern techniques for determining the key length of a Vigen\\`{e}re cipher. We provide experimental evidence supporting the accuracy of our model for a wide range of parameters. We also discuss the creation and features of this ANN along with a comparative analysis between our ANN, the index of coincidence, and the twist-based algorithms. ",
    "url": "https://arxiv.org/abs/2312.09956",
    "authors": [
      "Christian Millichap",
      "Yeeka Yau"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2312.09961",
    "title": "Risk-Aware Continuous Control with Neural Contextual Bandits",
    "abstract": "Recent advances in learning techniques have garnered attention for their applicability to a diverse range of real-world sequential decision-making problems. Yet, many practical applications have critical constraints for operation in real environments. Most learning solutions often neglect the risk of failing to meet these constraints, hindering their implementation in real-world contexts. In this paper, we propose a risk-aware decision-making framework for contextual bandit problems, accommodating constraints and continuous action spaces. Our approach employs an actor multi-critic architecture, with each critic characterizing the distribution of performance and constraint metrics. Our framework is designed to cater to various risk levels, effectively balancing constraint satisfaction against performance. To demonstrate the effectiveness of our approach, we first compare it against state-of-the-art baseline methods in a synthetic environment, highlighting the impact of intrinsic environmental noise across different risk configurations. Finally, we evaluate our framework in a real-world use case involving a 5G mobile network where only our approach consistently satisfies the system constraint (a signal processing reliability target) with a small performance toll (8.5% increase in power consumption). ",
    "url": "https://arxiv.org/abs/2312.09961",
    "authors": [
      "Jose A. Ayala-Romero",
      "Andres Garcia-Saavedra",
      "Xavier Costa-Perez"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2312.09995",
    "title": "SAT-Based Algorithms for Regular Graph Pattern Matching",
    "abstract": "Graph matching is a fundamental problem in pattern recognition, with many applications such as software analysis and computational biology. One well-known type of graph matching problem is graph isomorphism, which consists of deciding if two graphs are identical. Despite its usefulness, the properties that one may check using graph isomorphism are rather limited, since it only allows strict equality checks between two graphs. For example, it does not allow one to check complex structural properties such as if the target graph is an arbitrary length sequence followed by an arbitrary size loop. We propose a generalization of graph isomorphism that allows one to check such properties through a declarative specification. This specification is given in the form of a Regular Graph Pattern (ReGaP), a special type of graph, inspired by regular expressions, that may contain wildcard nodes that represent arbitrary structures such as variable-sized sequences or subgraphs. We propose a SAT-based algorithm for checking if a target graph matches a given ReGaP. We also propose a preprocessing technique for improving the performance of the algorithm and evaluate it through an extensive experimental evaluation on benchmarks from the CodeSearchNet dataset. ",
    "url": "https://arxiv.org/abs/2312.09995",
    "authors": [
      "Miguel Terra-Neves",
      "José Amaral",
      "Alexandre Lemos",
      "Rui Quintino",
      "Pedro Resende",
      "Antonio Alegria"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.10024",
    "title": "Accelerating Neural Network Training: A Brief Review",
    "abstract": "The process of training a deep neural network is characterized by significant time requirements and associated costs. Although researchers have made considerable progress in this area, further work is still required due to resource constraints. This study examines innovative approaches to expedite the training process of deep neural networks (DNN), with specific emphasis on three state-of-the-art models such as ResNet50, Vision Transformer (ViT), and EfficientNet. The research utilizes sophisticated methodologies, including Gradient Accumulation (GA), Automatic Mixed Precision (AMP), and Pin Memory (PM), in order to optimize performance and accelerate the training procedure. The study examines the effects of these methodologies on the DNN models discussed earlier, assessing their efficacy with regard to training rate and computational efficacy. The study showcases the efficacy of including GA as a strategic approach, resulting in a noteworthy decrease in the duration required for training. This enables the models to converge at a faster pace. The utilization of AMP enhances the speed of computations by taking advantage of the advantages offered by lower precision arithmetic while maintaining the correctness of the model. Furthermore, this study investigates the application of Pin Memory as a strategy to enhance the efficiency of data transmission between the central processing unit and the graphics processing unit, thereby offering a promising opportunity for enhancing overall performance. The experimental findings demonstrate that the combination of these sophisticated methodologies significantly accelerates the training of DNNs, offering vital insights for experts seeking to improve the effectiveness of deep learning processes. ",
    "url": "https://arxiv.org/abs/2312.10024",
    "authors": [
      "Sahil Nokhwal",
      "Priyanka Chilakalapudi",
      "Preeti Donekal",
      "Manoj Chandrasekharan",
      "Suman Nokhwal",
      "Ram Swaroop",
      "Raj Bala",
      "Saurabh Pahune",
      "Ankit Chaudhary"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.10027",
    "title": "Energy Sustainability in Dense Radio Access Networks via High Altitude  Platform Stations",
    "abstract": "The growing demand for radio access networks (RANs) driven by advanced wireless technology and the everincreasing mobile traffic, faces significant energy consumption challenges that threaten sustainability. To address this, an architecture referring to the vertical heterogeneous network (vHetNet) has recently been proposed. Our study seeks to enhance network operations in terms of energy efficiency and sustainability by examining a vHetNet configuration, comprising a high altitude platform station (HAPS) acting as a super macro base station (SMBS), along with a macro base station (MBS) and a set of small base stations (SBSs) in a densely populated area. ",
    "url": "https://arxiv.org/abs/2312.10027",
    "authors": [
      "Maryam Salamatmoghadasi",
      "Amir Mehrabian",
      "Halim Yanikomeroglu"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2312.09310",
    "title": "Neural Time-Reversed Generalized Riccati Equation",
    "abstract": "Optimal control deals with optimization problems in which variables steer a dynamical system, and its outcome contributes to the objective function. Two classical approaches to solving these problems are Dynamic Programming and the Pontryagin Maximum Principle. In both approaches, Hamiltonian equations offer an interpretation of optimality through auxiliary variables known as costates. However, Hamiltonian equations are rarely used due to their reliance on forward-backward algorithms across the entire temporal domain. This paper introduces a novel neural-based approach to optimal control, with the aim of working forward-in-time. Neural networks are employed not only for implementing state dynamics but also for estimating costate variables. The parameters of the latter network are determined at each time step using a newly introduced local policy referred to as the time-reversed generalized Riccati equation. This policy is inspired by a result discussed in the Linear Quadratic (LQ) problem, which we conjecture stabilizes state dynamics. We support this conjecture by discussing experimental results from a range of optimal control case studies. ",
    "url": "https://arxiv.org/abs/2312.09310",
    "authors": [
      "Alessandro Betti",
      "Michele Casoni",
      "Marco Gori",
      "Simone Marullo",
      "Stefano Melacci",
      "Matteo Tiezzi"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.09418",
    "title": "Predicting Multi-Joint Kinematics of the Upper Limb from EMG Signals  Across Varied Loads with a Physics-Informed Neural Network",
    "abstract": "In this research, we present an innovative method known as a physics-informed neural network (PINN) model to predict multi-joint kinematics using electromyography (EMG) signals recorded from the muscles surrounding these joints across various loads. The primary aim is to simultaneously predict both the shoulder and elbow joint angles while executing elbow flexion-extension (FE) movements, especially under varying load conditions. The PINN model is constructed by combining a feed-forward Artificial Neural Network (ANN) with a joint torque computation model. During the training process, the model utilizes a custom loss function derived from an inverse dynamics joint torque musculoskeletal model, along with a mean square angle loss. The training dataset for the PINN model comprises EMG and time data collected from four different subjects. To assess the model's performance, we conducted a comparison between the predicted joint angles and experimental data using a testing data set. The results demonstrated strong correlations of 58% to 83% in joint angle prediction. The findings highlight the potential of incorporating physical principles into the model, not only increasing its versatility but also enhancing its accuracy. The findings could have significant implications for the precise estimation of multi-joint kinematics in dynamic scenarios, particularly concerning the advancement of human-machine interfaces (HMIs) for exoskeletons and prosthetic control systems. ",
    "url": "https://arxiv.org/abs/2312.09418",
    "authors": [
      "Rajnish Kumar",
      "Suriya Prakash Muthukrishnan",
      "Lalan Kumar",
      "Sitikantha Roy"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.09420",
    "title": "Fairness-Driven Optimization of RIS-Augmented 5G Networks for Seamless  3D UAV Connectivity Using DRL Algorithms",
    "abstract": "In this paper, we study the problem of joint active and passive beamforming for reconfigurable intelligent surface (RIS)-assisted massive multiple-input multiple-output systems towards the extension of the wireless cellular coverage in 3D, where multiple RISs, each equipped with an array of passive elements, are deployed to assist a base station (BS) to simultaneously serve multiple unmanned aerial vehicles (UAVs) in the same time-frequency resource of 5G wireless communications. With a focus on ensuring fairness among UAVs, our objective is to maximize the minimum signal-to-interference-plus-noise ratio (SINR) at UAVs by jointly optimizing the transmit beamforming parameters at the BS and phase shift parameters at RISs. We propose two novel algorithms to address this problem. The first algorithm aims to mitigate interference by calculating the BS beamforming matrix through matrix inverse operations once the phase shift parameters are determined. The second one is based on the principle that one RIS element only serves one UAV and the phase shift parameter of this RIS element is optimally designed to compensate the phase offset caused by the propagation and fading. To obtain the optimal parameters, we utilize one state-of-the-art reinforcement learning algorithm, deep deterministic policy gradient, to solve these two optimization problems. Simulation results are provided to illustrate the effectiveness of our proposed solution and some insightful remarks are observed. ",
    "url": "https://arxiv.org/abs/2312.09420",
    "authors": [
      "Yu Tian",
      "Ahmed Alhammadi",
      "Jiguang He",
      "Aymen Fakhreddine",
      "Faouzi Bader"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2312.09428",
    "title": "Mode Selection in Cognitive Radar Networks",
    "abstract": "Cognitive Radar Networks, which were popularized by Simon Haykin in 2006, have been proposed to address limitations with legacy radar installations. These limitations include large physical size, power consumption, fixed operating parameters, and single point vulnerabilities. Cognitive radar solves part of this problem through adaptability, using biologically inspired techniques to observe the environment and adjust operation accordingly. Cognitive radar networks extend the capabilities of cognitive radar spatially, providing the opportunity to observe targets from multiple angles to mitigate stealth effects; distribute resources over space and in time; obtain better tracking performance; and gain more information from a scene. Often, problems of cognition in CRNs are viewed through the lens of iterative learning problems - one or multiple cognitive processes are implemented in the network, where each process first observes the environment, then selects operating parameters (from discrete or continuous options) using the history of observations and previous rewards, then repeats the cycle. Further, cognitive radar networks often are implemented with a flexible architecture and wide-bandwidth front-ends, enabling the addition of electronic support measures such as passive signal estimation. In this work we consider questions of the form \"How should a cognitive radar network choose when to observe targets?\" and \"How can a cognitive radar network reduce the amount of energy it uses?\" We implement tools from the multi-armed bandit and age of information literature to select modes for the network, choosing either an active radar mode or a passive signal estimation mode. We show that through the use of target classes, the network can determine how often each target should be observed to optimize tracking performance. ",
    "url": "https://arxiv.org/abs/2312.09428",
    "authors": [
      "William W. Howard",
      "Samuel R. Shebert",
      "Anthony F. Martone",
      "R. Michael Buehrer"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2312.09430",
    "title": "Deep Representation Learning for Open Vocabulary  Electroencephalography-to-Text Decoding",
    "abstract": "Previous research has demonstrated the potential of using pre-trained language models for decoding open vocabulary Electroencephalography (EEG) signals captured through a non-invasive Brain-Computer Interface (BCI). However, the impact of embedding EEG signals in the context of language models and the effect of subjectivity, remain unexplored, leading to uncertainty about the best approach to enhance decoding performance. Additionally, current evaluation metrics used to assess decoding effectiveness are predominantly syntactic and do not provide insights into the comprehensibility of the decoded output for human understanding. We present an end-to-end deep learning framework for non-invasive brain recordings that brings modern representational learning approaches to neuroscience. Our proposal introduces the following innovations: 1) an end-to-end deep learning architecture for open vocabulary EEG decoding, incorporating a subject-dependent representation learning module for raw EEG encoding, a BART language model, and a GPT-4 sentence refinement module; 2) a more comprehensive sentence-level evaluation metric based on the BERTScore; 3) an ablation study that analyses the contributions of each module within our proposal, providing valuable insights for future research. We evaluate our approach on two publicly available datasets, ZuCo v1.0 and v2.0, comprising EEG recordings of 30 subjects engaged in natural reading tasks. Our model achieves a BLEU-1 score of 42.75%, a ROUGE-1-F of 33.28%, and a BERTScore-F of 53.86%, outperforming the previous state-of-the-art methods by 3.38%, 8.43%, and 6.31%, respectively. ",
    "url": "https://arxiv.org/abs/2312.09430",
    "authors": [
      "Hamza Amrani",
      "Daniela Micucci",
      "Paolo Napoletano"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Computation and Language (cs.CL)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.09437",
    "title": "Riemannian Prediction of Anatomical Diagnoses in Congenital Heart  Disease based on 12-lead ECGs",
    "abstract": "Congenital heart disease (CHD) is a relatively rare disease that affects patients at birth and results in extremely heterogeneous anatomical and functional defects. 12-lead ECG signal is routinely collected in CHD patients because it provides significant biomarkers for disease prognosis. However, developing accurate machine learning models is challenging due to the lack of large available datasets. Here, we suggest exploiting the Riemannian geometry of the spatial covariance structure of the ECG signal to improve classification. Firstly, we use covariance augmentation to mix samples across the Riemannian geodesic between corresponding classes. Secondly, we suggest to project the covariance matrices to their respective class Riemannian mean to enhance the quality of feature extraction via tangent space projection. We perform several ablation experiments and demonstrate significant improvement compared to traditional machine learning models and deep learning on ECG time series data. ",
    "url": "https://arxiv.org/abs/2312.09437",
    "authors": [
      "Muhammet Alkan",
      "Gruschen Veldtman",
      "Fani Deligianni"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.09442",
    "title": "A Compact LSTM-SVM Fusion Model for Long-Duration Cardiovascular  Diseases Detection",
    "abstract": "Globally, cardiovascular diseases (CVDs) are the leading cause of mortality, accounting for an estimated 17.9 million deaths annually. One critical clinical objective is the early detection of CVDs using electrocardiogram (ECG) data, an area that has received significant attention from the research community. Recent advancements based on machine learning and deep learning have achieved great progress in this domain. However, existing methodologies exhibit inherent limitations, including inappropriate model evaluations and instances of data leakage. In this study, we present a streamlined workflow paradigm for preprocessing ECG signals into consistent 10-second durations, eliminating the need for manual feature extraction/beat detection. We also propose a hybrid model of Long Short-Term Memory (LSTM) with Support Vector Machine (SVM) for fraud detection. This architecture consists of two LSTM layers and an SVM classifier, which achieves a SOTA results with an Average precision score of 0.9402 on the MIT-BIH arrhythmia dataset and 0.9563 on the MIT-BIH atrial fibrillation dataset. Based on the results, we believe our method can significantly benefit the early detection and management of CVDs. ",
    "url": "https://arxiv.org/abs/2312.09442",
    "authors": [
      "Siyang Wu"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.09578",
    "title": "Self-Supervised Learning for Anomalous Sound Detection",
    "abstract": "State-of-the-art anomalous sound detection (ASD) systems are often trained by using an auxiliary classification task to learn an embedding space. Doing so enables the system to learn embeddings that are robust to noise and are ignoring non-target sound events but requires manually annotated meta information to be used as class labels. However, the less difficult the classification task becomes, the less informative are the embeddings and the worse is the resulting ASD performance. A solution to this problem is to utilize self-supervised learning (SSL). In this work, feature exchange (FeatEx), a simple yet effective SSL approach for ASD, is proposed. In addition, FeatEx is compared to and combined with existing SSL approaches. As the main result, a new state-of-the-art performance for the DCASE2023 ASD dataset is obtained that outperforms all other published results on this dataset by a large margin. ",
    "url": "https://arxiv.org/abs/2312.09578",
    "authors": [
      "Kevin Wilkinghoff"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2312.09645",
    "title": "Fine-Tuned Self-Supervised Speech Representations for Language  Diarization in Multilingual Code-Switched Speech",
    "abstract": "Annotating a multilingual code-switched corpus is a painstaking process requiring specialist linguistic expertise. This is partly due to the large number of language combinations that may appear within and across utterances, which might require several annotators with different linguistic expertise to consider an utterance sequentially. This is time-consuming and costly. It would be useful if the spoken languages in an utterance and the boundaries thereof were known before annotation commences, to allow segments to be assigned to the relevant language experts in parallel. To address this, we investigate the development of a continuous multilingual language diarizer using fine-tuned speech representations extracted from a large pre-trained self-supervised architecture (WavLM). We experiment with a code-switched corpus consisting of five South African languages (isiZulu, isiXhosa, Setswana, Sesotho and English) and show substantial diarization error rate improvements for language families, language groups, and individual languages over baseline systems. ",
    "url": "https://arxiv.org/abs/2312.09645",
    "authors": [
      "Geoffrey Frost",
      "Emily Morris",
      "Joshua Jansen van Vüren",
      "Thomas Niesler"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2312.09719",
    "title": "On the calibration of neural networks for histological slide-level  classification",
    "abstract": "Deep Neural Networks have shown promising classification performance when predicting certain biomarkers from Whole Slide Images in digital pathology. However, the calibration of the networks' output probabilities is often not evaluated. Communicating uncertainty by providing reliable confidence scores is of high relevance in the medical context. In this work, we compare three neural network architectures that combine feature representations on patch-level to a slide-level prediction with respect to their classification performance and evaluate their calibration. As slide-level classification task, we choose the prediction of Microsatellite Instability from Colorectal Cancer tissue sections. We observe that Transformers lead to good results in terms of classification performance and calibration. When evaluating the classification performance on a separate dataset, we observe that Transformers generalize best. The investigation of reliability diagrams provides additional insights to the Expected Calibration Error metric and we observe that especially Transformers push the output probabilities to extreme values, which results in overconfident predictions. ",
    "url": "https://arxiv.org/abs/2312.09719",
    "authors": [
      "Alexander Kurz",
      "Hendrik A. Mehrtens",
      "Tabea-Clara Bucher",
      "Titus J. Brinker"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09768",
    "title": "Decoding Envelope and Frequency-Following EEG Responses to Continuous  Speech Using Deep Neural Networks",
    "abstract": "The electroencephalogram (EEG) offers a non-invasive means by which a listener's auditory system may be monitored during continuous speech perception. Reliable auditory-EEG decoders could facilitate the objective diagnosis of hearing disorders, or find applications in cognitively-steered hearing aids. Previously, we developed decoders for the ICASSP Auditory EEG Signal Processing Grand Challenge (SPGC). These decoders aimed to solve the match-mismatch task: given a short temporal segment of EEG recordings, and two candidate speech segments, the task is to identify which of the two speech segments is temporally aligned, or matched, with the EEG segment. The decoders made use of cortical responses to the speech envelope, as well as speech-related frequency-following responses, to relate the EEG recordings to the speech stimuli. Here we comprehensively document the methods by which the decoders were developed. We extend our previous analysis by exploring the association between speaker characteristics (pitch and sex) and classification accuracy, and provide a full statistical analysis of the final performance of the decoders as evaluated on a heldout portion of the dataset. Finally, the generalisation capabilities of the decoders are characterised, by evaluating them using an entirely different dataset which contains EEG recorded under a variety of speech-listening conditions. The results show that the match-mismatch decoders achieve accurate and robust classification accuracies, and they can even serve as auditory attention decoders without additional training. ",
    "url": "https://arxiv.org/abs/2312.09768",
    "authors": [
      "Mike Thornton",
      "Danilo Mandic",
      "Tobias Reichenbach"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2312.09820",
    "title": "On the locality of local neural operator in learning fluid dynamics",
    "abstract": "This paper launches a thorough discussion on the locality of local neural operator (LNO), which is the core that enables LNO great flexibility on varied computational domains in solving transient partial differential equations (PDEs). We investigate the locality of LNO by looking into its receptive field and receptive range, carrying a main concern about how the locality acts in LNO training and applications. In a large group of LNO training experiments for learning fluid dynamics, it is found that an initial receptive range compatible with the learning task is crucial for LNO to perform well. On the one hand, an over-small receptive range is fatal and usually leads LNO to numerical oscillation; on the other hand, an over-large receptive range hinders LNO from achieving the best accuracy. We deem rules found in this paper general when applying LNO to learn and solve transient PDEs in diverse fields. Practical examples of applying the pre-trained LNOs in flow prediction are presented to confirm the findings further. Overall, with the architecture properly designed with a compatible receptive range, the pre-trained LNO shows commendable accuracy and efficiency in solving practical cases. ",
    "url": "https://arxiv.org/abs/2312.09820",
    "authors": [
      "Ximeng Ye",
      "Hongyu Li",
      "Jingjie Huang",
      "Guoliang Qin"
    ],
    "subjectives": [
      "Fluid Dynamics (physics.flu-dyn)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.09887",
    "title": "Probabilistic learning of the Purkinje network from the  electrocardiogram",
    "abstract": "The identification of the Purkinje conduction system in the heart is a challenging task, yet essential for a correct definition of cardiac digital twins for precision cardiology. Here, we propose a probabilistic approach for identifying the Purkinje network from non-invasive clinical data such as the standard electrocardiogram (ECG). We use cardiac imaging to build an anatomically accurate model of the ventricles; we algorithmically generate a rule-based Purkinje network tailored to the anatomy; we simulate physiological electrocardiograms with a fast model; we identify the geometrical and electrical parameters of the Purkinje-ECG model with Bayesian optimization and approximate Bayesian computation. The proposed approach is inherently probabilistic and generates a population of plausible Purkinje networks, all fitting the ECG within a given tolerance. In this way, we can estimate the uncertainty of the parameters, thus providing reliable predictions. We test our methodology in physiological and pathological scenarios, showing that we are able to accurately recover the ECG with our model. We propagate the uncertainty in the Purkinje network parameters in a simulation of conduction system pacing therapy. Our methodology is a step forward in creation of digital twins from non-invasive data in precision medicine. An open source implementation can be found at this http URL ",
    "url": "https://arxiv.org/abs/2312.09887",
    "authors": [
      "Felipe Álvarez-Barrientos",
      "Mariana Salinas-Camus",
      "Simone Pezzuto",
      "Francisco Sahli Costabal"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2312.09939",
    "title": "Quantum Generative Adversarial Networks: Bridging Classical and Quantum  Realms",
    "abstract": "In this pioneering research paper, we present a groundbreaking exploration into the synergistic fusion of classical and quantum computing paradigms within the realm of Generative Adversarial Networks (GANs). Our objective is to seamlessly integrate quantum computational elements into the conventional GAN architecture, thereby unlocking novel pathways for enhanced training processes. Drawing inspiration from the inherent capabilities of quantum bits (qubits), we delve into the incorporation of quantum data representation methodologies within the GAN framework. By capitalizing on the unique quantum features, we aim to accelerate the training process of GANs, offering a fresh perspective on the optimization of generative models. Our investigation deals with theoretical considerations and evaluates the potential quantum advantages that may manifest in terms of training efficiency and generative quality. We confront the challenges inherent in the quantum-classical amalgamation, addressing issues related to quantum hardware constraints, error correction mechanisms, and scalability considerations. This research is positioned at the forefront of quantum-enhanced machine learning, presenting a critical stride towards harnessing the computational power of quantum systems to expedite the training of Generative Adversarial Networks. Through our comprehensive examination of the interface between classical and quantum realms, we aim to uncover transformative insights that will propel the field forward, fostering innovation and advancing the frontier of quantum machine learning. ",
    "url": "https://arxiv.org/abs/2312.09939",
    "authors": [
      "Sahil Nokhwal",
      "Suman Nokhwal",
      "Ram Swaroop",
      "Raj Bala",
      "Ankit Chaudhary"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.09951",
    "title": "On the Alon-Tarsi Number of Some Line and Total graphs",
    "abstract": "This work discusses the Alon-Tarsi number of line graphs and total graphs. In addition, we also discuss the Alon-Tarsi number of Erdos-Faber-Lovasz (EFL) graphs. ",
    "url": "https://arxiv.org/abs/2312.09951",
    "authors": [
      "S. Prajnanaswaroopa"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2312.09952",
    "title": "Multi-level graph learning for audio event classification and  human-perceived annoyance rating prediction",
    "abstract": "WHO's report on environmental noise estimates that 22 M people suffer from chronic annoyance related to noise caused by audio events (AEs) from various sources. Annoyance may lead to health issues and adverse effects on metabolic and cognitive systems. In cities, monitoring noise levels does not provide insights into noticeable AEs, let alone their relations to annoyance. To create annoyance-related monitoring, this paper proposes a graph-based model to identify AEs in a soundscape, and explore relations between diverse AEs and human-perceived annoyance rating (AR). Specifically, this paper proposes a lightweight multi-level graph learning (MLGL) based on local and global semantic graphs to simultaneously perform audio event classification (AEC) and human annoyance rating prediction (ARP). Experiments show that: 1) MLGL with 4.1 M parameters improves AEC and ARP results by using semantic node information in local and global context aware graphs; 2) MLGL captures relations between coarse and fine-grained AEs and AR well; 3) Statistical analysis of MLGL results shows that some AEs from different sources significantly correlate with AR, which is consistent with previous research on human perception of these sound sources. ",
    "url": "https://arxiv.org/abs/2312.09952",
    "authors": [
      "Yuanbo Hou",
      "Qiaoqiao Ren",
      "Siyang Song",
      "Yuxin Song",
      "Wenwu Wang",
      "Dick Botteldooren"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2312.09953",
    "title": "Deep Reinforcement Learning for Joint Cruise Control and Intelligent  Data Acquisition in UAVs-Assisted Sensor Networks",
    "abstract": "Unmanned aerial vehicle (UAV)-assisted sensor networks (UASNets), which play a crucial role in creating new opportunities, are experiencing significant growth in civil applications worldwide. UASNets improve disaster management through timely surveillance and advance precision agriculture with detailed crop monitoring, thereby significantly transforming the commercial economy. UASNets revolutionize the commercial sector by offering greater efficiency, safety, and cost-effectiveness, highlighting their transformative impact. A fundamental aspect of these new capabilities and changes is the collection of data from rugged and remote areas. Due to their excellent mobility and maneuverability, UAVs are employed to collect data from ground sensors in harsh environments, such as natural disaster monitoring, border surveillance, and emergency response monitoring. One major challenge in these scenarios is that the movements of UAVs affect channel conditions and result in packet loss. Fast movements of UAVs lead to poor channel conditions and rapid signal degradation, resulting in packet loss. On the other hand, slow mobility of a UAV can cause buffer overflows of the ground sensors, as newly arrived data is not promptly collected by the UAV. Our proposal to address this challenge is to minimize packet loss by jointly optimizing the velocity controls and data collection schedules of multiple UAVs.Furthermore, in UASNets, swift movements of UAVs result in poor channel conditions and fast signal attenuation, leading to an extended age of information (AoI). In contrast, slow movements of UAVs prolong flight time, thereby extending the AoI of ground sensors.To address this challenge, we propose a new mean-field flight resource allocation optimization to minimize the AoI of sensory data. ",
    "url": "https://arxiv.org/abs/2312.09953",
    "authors": [
      "Yousef Emami"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2312.09988",
    "title": "Towards Architecture-Insensitive Untrained Network Priors for  Accelerated MRI Reconstruction",
    "abstract": "Untrained neural networks pioneered by Deep Image Prior (DIP) have recently enabled MRI reconstruction without requiring fully-sampled measurements for training. Their success is widely attributed to the implicit regularization induced by suitable network architectures. However, the lack of understanding of such architectural priors results in superfluous design choices and sub-optimal outcomes. This work aims to simplify the architectural design decisions for DIP-MRI to facilitate its practical deployment. We observe that certain architectural components are more prone to causing overfitting regardless of the number of parameters, incurring severe reconstruction artifacts by hindering accurate extrapolation on the un-acquired measurements. We interpret this phenomenon from a frequency perspective and find that the architectural characteristics favoring low frequencies, i.e., deep and narrow with unlearnt upsampling, can lead to enhanced generalization and hence better reconstruction. Building on this insight, we propose two architecture-agnostic remedies: one to constrain the frequency range of the white-noise input and the other to penalize the Lipschitz constants of the network. We demonstrate that even with just one extra line of code on the input, the performance gap between the ill-designed models and the high-performing ones can be closed. These results signify that for the first time, architectural biases on untrained MRI reconstruction can be mitigated without architectural modifications. ",
    "url": "https://arxiv.org/abs/2312.09988",
    "authors": [
      "Yilin Liu",
      "Yunkui Pang",
      "Jiang Li",
      "Yong Chen",
      "Pew-Thian Yap"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:1803.03114",
    "title": "Concise Fuzzy Planar Embedding of Graphs: a Dimensionality Reduction  Approach",
    "abstract": " Title: Concise Fuzzy Planar Embedding of Graphs: a Dimensionality Reduction  Approach ",
    "url": "https://arxiv.org/abs/1803.03114",
    "authors": [
      "Faisal N. Abu-Khzam",
      "Rana H. Mouawi",
      "Amer Hajj Ahmad",
      "Sergio Thoumi"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.01528",
    "title": "Effective and Imperceptible Adversarial Textual Attack via  Multi-objectivization",
    "abstract": " Title: Effective and Imperceptible Adversarial Textual Attack via  Multi-objectivization ",
    "url": "https://arxiv.org/abs/2111.01528",
    "authors": [
      "Shengcai Liu",
      "Ning Lu",
      "Wenjing Hong",
      "Chao Qian",
      "Ke Tang"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2111.03169",
    "title": "Hard Negative Sampling via Regularized Optimal Transport for Contrastive  Representation Learning",
    "abstract": " Comments: Minor changes - fixing typos, minor rephrasing in abstract and introduction ",
    "url": "https://arxiv.org/abs/2111.03169",
    "authors": [
      "Ruijie Jiang",
      "Prakash Ishwar",
      "Shuchin Aeron"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2202.09253",
    "title": "Sketching Distances in Monotone Graph Classes",
    "abstract": " Comments: 39 pages, 1 figure. v2: revised version ",
    "url": "https://arxiv.org/abs/2202.09253",
    "authors": [
      "Louis Esperet",
      "Nathaniel Harms",
      "Andrey Kupavskii"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2204.04968",
    "title": "Bimodal Camera Pose Prediction for Endoscopy",
    "abstract": " Comments: This article has been accepted for publication in IEEE Transactions on Medical Robotics and Bionics. This is the author's version which has not been fully edited and content may change prior to final publication. Citation information: DOI 10.1109/TMRB.2023.3320267 ",
    "url": "https://arxiv.org/abs/2204.04968",
    "authors": [
      "Anita Rau",
      "Binod Bhattarai",
      "Lourdes Agapito",
      "Danail Stoyanov"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2205.15364",
    "title": "Associative Learning Mechanism for Drug-Target Interaction Prediction",
    "abstract": " Comments: The extended and final version of this paper has been published with open access modality in the CAAI Transactions on Intelligence Technology and can be found at link LINK HERE. Please refer to the TRIT published version in your scientific papers ",
    "url": "https://arxiv.org/abs/2205.15364",
    "authors": [
      "Zhiqin Zhu",
      "Zheng Yao",
      "Guanqiu Qi",
      "Neal Mazur",
      "Baisen Cong"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2206.14284",
    "title": "Optimal Estimation of Generic Dynamics by Path-Dependent Neural Jump  ODEs",
    "abstract": " Title: Optimal Estimation of Generic Dynamics by Path-Dependent Neural Jump  ODEs ",
    "url": "https://arxiv.org/abs/2206.14284",
    "authors": [
      "Florian Krach",
      "Marc Nübel",
      "Josef Teichmann"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2208.01720",
    "title": "Simple, strict, proper, happy: A study of reachability in temporal  graphs",
    "abstract": " Comments: 20 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2208.01720",
    "authors": [
      "Arnaud Casteigts",
      "Timothée Corsini",
      "Writika Sarkar"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2208.09602",
    "title": "Exploring Adversarial Robustness of Vision Transformers in the Spectral  Perspective",
    "abstract": " Comments: Accepted in IEEE/CVF Winter Conference on Applications of Computer Vision (WACV) 2024 ",
    "url": "https://arxiv.org/abs/2208.09602",
    "authors": [
      "Gihyun Kim",
      "Juyeop Kim",
      "Jong-Seok Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2208.12397",
    "title": "Causal Inference in Recommender Systems: A Survey and Future Directions",
    "abstract": " Comments: Accepted by ACM Transactions on Information Systems (TOIS) ",
    "url": "https://arxiv.org/abs/2208.12397",
    "authors": [
      "Chen Gao",
      "Yu Zheng",
      "Wenjie Wang",
      "Fuli Feng",
      "Xiangnan He",
      "Yong Li"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2212.12329",
    "title": "Approaching Globally Optimal Energy Efficiency in Interference Networks  via Machine Learning",
    "abstract": " Title: Approaching Globally Optimal Energy Efficiency in Interference Networks  via Machine Learning ",
    "url": "https://arxiv.org/abs/2212.12329",
    "authors": [
      "Bile Peng",
      "Karl-Ludwig Besser",
      "Ramprasad Raghunath",
      "Eduard A. Jorswieck"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.06132",
    "title": "Deep Diversity-Enhanced Feature Representation of Hyperspectral Images",
    "abstract": " Comments: 15 pages, 12 figures. arXiv admin note: substantial text overlap with arXiv:2207.04266 ",
    "url": "https://arxiv.org/abs/2301.06132",
    "authors": [
      "Jinhui Hou",
      "Zhiyu Zhu",
      "Junhui Hou",
      "Hui Liu",
      "Huanqiang Zeng",
      "Deyu Meng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2303.07812",
    "title": "Termination of Graph Transformation Systems Using Weighted Subgraph  Counting",
    "abstract": " Comments: 36 pages. Preprint submitted to LMCS. Extends the conference version published at the 16th International Conference on Graph Transformation (ICGT 2023) ",
    "url": "https://arxiv.org/abs/2303.07812",
    "authors": [
      "Roy Overbeek",
      "Jörg Endrullis"
    ],
    "subjectives": [
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2304.07213",
    "title": "Very high resolution canopy height maps from RGB imagery using  self-supervised vision transformer and convolutional decoder trained on  Aerial Lidar",
    "abstract": " Title: Very high resolution canopy height maps from RGB imagery using  self-supervised vision transformer and convolutional decoder trained on  Aerial Lidar ",
    "url": "https://arxiv.org/abs/2304.07213",
    "authors": [
      "Jamie Tolan",
      "Hung-I Yang",
      "Ben Nosarzewski",
      "Guillaume Couairon",
      "Huy Vo",
      "John Brandt",
      "Justine Spore",
      "Sayantan Majumdar",
      "Daniel Haziza",
      "Janaki Vamaraju",
      "Theo Moutakanni",
      "Piotr Bojanowski",
      "Tracy Johns",
      "Brian White",
      "Tobias Tiecke",
      "Camille Couprie"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2305.05421",
    "title": "DC3DCD: unsupervised learning for multiclass 3D point cloud change  detection",
    "abstract": " Comments: This work has been accepted to Elsevier for publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2305.05421",
    "authors": [
      "Iris de Gélis",
      "Sébastien Lefèvre",
      "Thomas Corpetti"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2305.12066",
    "title": "Dynamic Gradient Balancing for Enhanced Adversarial Attacks on  Multi-Task Models",
    "abstract": " Comments: 19 pages, 6 figures; AAAI24 ",
    "url": "https://arxiv.org/abs/2305.12066",
    "authors": [
      "Lijun Zhang",
      "Xiao Liu",
      "Kaleel Mahmood",
      "Caiwen Ding",
      "Hui Guan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2306.04308",
    "title": "Personality testing of GPT-3: Limited temporal reliability, but  highlighted social desirability of GPT-3's personality instruments results",
    "abstract": " Comments: 21 pages, 1 table ",
    "url": "https://arxiv.org/abs/2306.04308",
    "authors": [
      "Bojana Bodroza",
      "Bojana M. Dinic",
      "Ljubisa Bojic"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2306.05486",
    "title": "Multilevel domain decomposition-based architectures for physics-informed  neural networks",
    "abstract": " Comments: 38 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2306.05486",
    "authors": [
      "Victorita Dolean",
      "Alexander Heinlein",
      "Siddhartha Mishra",
      "Ben Moseley"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2306.07939",
    "title": "Media Bias and Polarization through the Lens of a Markov Switching  Latent Space Network Model",
    "abstract": " Title: Media Bias and Polarization through the Lens of a Markov Switching  Latent Space Network Model ",
    "url": "https://arxiv.org/abs/2306.07939",
    "authors": [
      "Roberto Casarin",
      "Antonio Peruzzi",
      "Mark F.J. Steel"
    ],
    "subjectives": [
      "Applications (stat.AP)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2306.15247",
    "title": "Towards Efficient Optimal Large-Scale Network Slicing: A Decomposition  Approach",
    "abstract": " Comments: 13 pages, 11 figures, submitted for possible publication; for the conference version, see arXiv:2306.15247v1 ",
    "url": "https://arxiv.org/abs/2306.15247",
    "authors": [
      "Wei-Kun Chen",
      "Zheyu Wu",
      "Rui-Jin Zhang",
      "Ya-Feng Liu",
      "Yu-Hong Dai",
      "Zhi-Quan Luo"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2307.12596",
    "title": "Refining ChatGPT-Generated Code: Characterizing and Mitigating Code  Quality Issues",
    "abstract": " Title: Refining ChatGPT-Generated Code: Characterizing and Mitigating Code  Quality Issues ",
    "url": "https://arxiv.org/abs/2307.12596",
    "authors": [
      "Yue Liu",
      "Thanh Le-Cong",
      "Ratnadira Widyasari",
      "Chakkrit Tantithamthavorn",
      "Li Li",
      "Xuan-Bach D. Le",
      "David Lo"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2308.04237",
    "title": "Federated Inference with Reliable Uncertainty Quantification over  Wireless Channels via Conformal Prediction",
    "abstract": " Comments: 16 pages, 7 figures ",
    "url": "https://arxiv.org/abs/2308.04237",
    "authors": [
      "Meiyi Zhu",
      "Matteo Zecchin",
      "Sangwoo Park",
      "Caili Guo",
      "Chunyan Feng",
      "Osvaldo Simeone"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.09751",
    "title": "Data Compression and Inference in Cosmology with Self-Supervised Machine  Learning",
    "abstract": " Comments: 17 + 6 pages, 12 + 6 figures; replaced to match version accepted by MNRAS ",
    "url": "https://arxiv.org/abs/2308.09751",
    "authors": [
      "Aizhan Akhmetzhanova",
      "Siddharth Mishra-Sharma",
      "Cora Dvorkin"
    ],
    "subjectives": [
      "Cosmology and Nongalactic Astrophysics (astro-ph.CO)",
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2308.11681",
    "title": "VadCLIP: Adapting Vision-Language Models for Weakly Supervised Video  Anomaly Detection",
    "abstract": " Comments: Accept to AAAI2024 ",
    "url": "https://arxiv.org/abs/2308.11681",
    "authors": [
      "Peng Wu",
      "Xuerong Zhou",
      "Guansong Pang",
      "Lingru Zhou",
      "Qingsen Yan",
      "Peng Wang",
      "Yanning Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2308.15494",
    "title": "Parallel Unconstrained Local Search for Partitioning Irregular Graphs",
    "abstract": " Comments: ALENEX 2024 ",
    "url": "https://arxiv.org/abs/2308.15494",
    "authors": [
      "Nikolai Maas",
      "Lars Gottesbüren",
      "Daniel Seemaier"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2308.16599",
    "title": "Using machine learning to understand causal relationships between urban  form and travel CO2 emissions across continents",
    "abstract": " Comments: 32 pages, 24 figures, 6 tables ",
    "url": "https://arxiv.org/abs/2308.16599",
    "authors": [
      "Felix Wagner",
      "Florian Nachtigall",
      "Lukas Franken",
      "Nikola Milojevic-Dupont",
      "Rafael H.M. Pereira",
      "Nicolas Koch",
      "Jakob Runge",
      "Marta Gonzalez",
      "Felix Creutzig"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2309.07597",
    "title": "C-Pack: Packaged Resources To Advance General Chinese Embedding",
    "abstract": " Title: C-Pack: Packaged Resources To Advance General Chinese Embedding ",
    "url": "https://arxiv.org/abs/2309.07597",
    "authors": [
      "Shitao Xiao",
      "Zheng Liu",
      "Peitian Zhang",
      "Niklas Muennighoff"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2309.13237",
    "title": "Spatial-Temporal Knowledge-Embedded Transformer for Video Scene Graph  Generation",
    "abstract": " Comments: Accepted at IEEE T-IP, 2024 ",
    "url": "https://arxiv.org/abs/2309.13237",
    "authors": [
      "Tao Pu",
      "Tianshui Chen",
      "Hefeng Wu",
      "Yongyi Lu",
      "Liang Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2310.04687",
    "title": "Understanding and Improving Adversarial Attacks on Latent Diffusion  Model",
    "abstract": " Title: Understanding and Improving Adversarial Attacks on Latent Diffusion  Model ",
    "url": "https://arxiv.org/abs/2310.04687",
    "authors": [
      "Boyang Zheng",
      "Chumeng Liang",
      "Xiaoyu Wu",
      "Yan Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.06622",
    "title": "Robustness May be More Brittle than We Think under Different Degrees of  Distribution Shifts",
    "abstract": " Title: Robustness May be More Brittle than We Think under Different Degrees of  Distribution Shifts ",
    "url": "https://arxiv.org/abs/2310.06622",
    "authors": [
      "Kaican Li",
      "Yifan Zhang",
      "Lanqing Hong",
      "Zhenguo Li",
      "Nevin L. Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2310.07958",
    "title": "Towards Causal Deep Learning for Vulnerability Detection",
    "abstract": " Comments: Accepted at ICSE 2024 (not camera-ready version) ",
    "url": "https://arxiv.org/abs/2310.07958",
    "authors": [
      "Md Mahbubur Rahman",
      "Ira Ceka",
      "Chengzhi Mao",
      "Saikat Chakraborty",
      "Baishakhi Ray",
      "Wei Le"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2310.08868",
    "title": "SeCoNet: A Heterosexual Contact Network Growth Model for Human  Papillomavirus Disease Simulation",
    "abstract": " Title: SeCoNet: A Heterosexual Contact Network Growth Model for Human  Papillomavirus Disease Simulation ",
    "url": "https://arxiv.org/abs/2310.08868",
    "authors": [
      "Weiyi Wang",
      "Mahendra Piraveenan"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2310.08903",
    "title": "SeqXGPT: Sentence-Level AI-Generated Text Detection",
    "abstract": " Comments: Accepted by EMNLP2023 ",
    "url": "https://arxiv.org/abs/2310.08903",
    "authors": [
      "Pengyu Wang",
      "Linyang Li",
      "Ke Ren",
      "Botian Jiang",
      "Dong Zhang",
      "Xipeng Qiu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2310.15539",
    "title": "SteloCoder: a Decoder-Only LLM for Multi-Language to Python Code  Translation",
    "abstract": " Title: SteloCoder: a Decoder-Only LLM for Multi-Language to Python Code  Translation ",
    "url": "https://arxiv.org/abs/2310.15539",
    "authors": [
      "Jialing Pan",
      "Adrien Sadé",
      "Jin Kim",
      "Eric Soriano",
      "Guillem Sole",
      "Sylvain Flamant"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2310.15950",
    "title": "Representation Learning with Large Language Models for Recommendation",
    "abstract": " Title: Representation Learning with Large Language Models for Recommendation ",
    "url": "https://arxiv.org/abs/2310.15950",
    "authors": [
      "Xubin Ren",
      "Wei Wei",
      "Lianghao Xia",
      "Lixin Su",
      "Suqi Cheng",
      "Junfeng Wang",
      "Dawei Yin",
      "Chao Huang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2311.02909",
    "title": "Distributed Matrix-Based Sampling for Graph Neural Network Training",
    "abstract": " Title: Distributed Matrix-Based Sampling for Graph Neural Network Training ",
    "url": "https://arxiv.org/abs/2311.02909",
    "authors": [
      "Alok Tripathy",
      "Katherine Yelick",
      "Aydin Buluc"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2311.05836",
    "title": "UMedNeRF: Uncertainty-aware Single View Volumetric Rendering for Medical  Neural Radiance Fields",
    "abstract": " Title: UMedNeRF: Uncertainty-aware Single View Volumetric Rendering for Medical  Neural Radiance Fields ",
    "url": "https://arxiv.org/abs/2311.05836",
    "authors": [
      "Jing Hu",
      "Qinrui Fan",
      "Shu Hu",
      "Siwei Lyu",
      "Xi Wu",
      "Xin Wang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2311.10542",
    "title": "A Tale of Unrealized Hope: Hardware Performance Counter Against Cache  Attacks",
    "abstract": " Comments: Authorship dispute ",
    "url": "https://arxiv.org/abs/2311.10542",
    "authors": [
      "William Kosasih"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2311.12550",
    "title": "Explainable Time Series Anomaly Detection using Masked Latent Generative  Modeling",
    "abstract": " Title: Explainable Time Series Anomaly Detection using Masked Latent Generative  Modeling ",
    "url": "https://arxiv.org/abs/2311.12550",
    "authors": [
      "Daesoo Lee",
      "Sara Malacarne",
      "Erlend Aune"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2311.16533",
    "title": "Motor State Prediction and Friction Compensation based on Data-driven  Techniques",
    "abstract": " Title: Motor State Prediction and Friction Compensation based on Data-driven  Techniques ",
    "url": "https://arxiv.org/abs/2311.16533",
    "authors": [
      "Nimantha Dasanayake",
      "Shehara Perera"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2311.16835",
    "title": "Unified-modal Salient Object Detection via Adaptive Prompt Learning",
    "abstract": " Comments: 15 pages, 10 figures ",
    "url": "https://arxiv.org/abs/2311.16835",
    "authors": [
      "Kunpeng Wang",
      "Chenglong Li",
      "Zhengzheng Tu",
      "Bin Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.01403",
    "title": "OplixNet: Towards Area-Efficient Optical Split-Complex Networks with  Real-to-Complex Data Assignment and Knowledge Distillation",
    "abstract": " Comments: Accepted by Design Automation and Test in Europe (DATE) 2024 ",
    "url": "https://arxiv.org/abs/2312.01403",
    "authors": [
      "Ruidi Qiu",
      "Amro Eldebiky",
      "Grace Li Zhang",
      "Xunzhao Yin",
      "Cheng Zhuo",
      "Ulf Schlichtmann",
      "Bing Li"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2312.01878",
    "title": "HGPROMPT: Bridging Homogeneous and Heterogeneous Graphs for Few-shot  Prompt Learning",
    "abstract": " Comments: Accepted by AAAI2024 ",
    "url": "https://arxiv.org/abs/2312.01878",
    "authors": [
      "Xingtong Yu",
      "Yuan Fang",
      "Zemin Liu",
      "Xinming Zhang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.06371",
    "title": "BAT: Behavior-Aware Human-Like Trajectory Prediction for Autonomous  Driving",
    "abstract": " Title: BAT: Behavior-Aware Human-Like Trajectory Prediction for Autonomous  Driving ",
    "url": "https://arxiv.org/abs/2312.06371",
    "authors": [
      "Haicheng Liao",
      "Zhenning Li",
      "Huanming Shen",
      "Wenxuan Zeng",
      "Dongping Liao",
      "Guofa Li",
      "Shengbo Eben Li",
      "Chengzhong Xu"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.06403",
    "title": "Debiased Machine Learning and Network Cohesion for Doubly-Robust  Differential Reward Models in Contextual Bandits",
    "abstract": " Title: Debiased Machine Learning and Network Cohesion for Doubly-Robust  Differential Reward Models in Contextual Bandits ",
    "url": "https://arxiv.org/abs/2312.06403",
    "authors": [
      "Easton K. Huch",
      "Jieru Shi",
      "Madeline R. Abbott",
      "Jessica R. Golbus",
      "Alexander Moreno",
      "Walter H. Dempsey"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2312.08140",
    "title": "GVE-LPA: Fast Label Propagation Algorithm (LPA) for Community Detection  in Shared Memory Setting",
    "abstract": " Comments: 7 pages, 7 figures, 1 table. arXiv admin note: text overlap with arXiv:2312.04876 ",
    "url": "https://arxiv.org/abs/2312.08140",
    "authors": [
      "Subhajit Sahu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Performance (cs.PF)"
    ]
  },
  {
    "id": "arXiv:2312.08374",
    "title": "Unsupervised Social Event Detection via Hybrid Graph Contrastive  Learning and Reinforced Incremental Clustering",
    "abstract": " Comments: Accepted by Knowledge-Based Systems ",
    "url": "https://arxiv.org/abs/2312.08374",
    "authors": [
      "Yuanyuan Guo",
      "Zehua Zang",
      "Hang Gao",
      "Xiao Xu",
      "Rui Wang",
      "Lixiang Liu",
      "Jiangmeng Li"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2312.08672",
    "title": "CAT: A Causally Graph Attention Network for Trimming Heterophilic Graph",
    "abstract": " Comments: 24 pages, 17 figures, 4 tables ",
    "url": "https://arxiv.org/abs/2312.08672",
    "authors": [
      "Silu He",
      "Qinyao Luo",
      "Xinsha Fu",
      "Ling Zhao",
      "Ronghua Du",
      "Haifeng Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2312.08948",
    "title": "LSTM Network Analysis of Vehicle-Type Fatalities on Great Britain's  Roads",
    "abstract": " Title: LSTM Network Analysis of Vehicle-Type Fatalities on Great Britain's  Roads ",
    "url": "https://arxiv.org/abs/2312.08948",
    "authors": [
      "Abiodun Finbarrs Oketunji",
      "James Hanify",
      "Salter Heffron-Smith"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2312.09076",
    "title": "ProSGNeRF: Progressive Dynamic Neural Scene Graph with Frequency  Modulated Auto-Encoder in Urban Scenes",
    "abstract": " Title: ProSGNeRF: Progressive Dynamic Neural Scene Graph with Frequency  Modulated Auto-Encoder in Urban Scenes ",
    "url": "https://arxiv.org/abs/2312.09076",
    "authors": [
      "Tianchen Deng",
      "Siyang Liu",
      "Xuan Wang",
      "Yejia Liu",
      "Danwei Wang",
      "Weidong Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2312.09095",
    "title": "ColNeRF: Collaboration for Generalizable Sparse Input Neural Radiance  Field",
    "abstract": " Title: ColNeRF: Collaboration for Generalizable Sparse Input Neural Radiance  Field ",
    "url": "https://arxiv.org/abs/2312.09095",
    "authors": [
      "Zhangkai Ni",
      "Peiqi Yang",
      "Wenhan Yang",
      "Hanli Wang",
      "Lin Ma",
      "Sam Kwong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]