[
  {
    "id": "arXiv:2304.05395",
    "title": "SE-ORNet: Self-Ensembling Orientation-aware Network for Unsupervised  Point Cloud Shape Correspondence",
    "abstract": "Unsupervised point cloud shape correspondence aims to obtain dense point-to-point correspondences between point clouds without manually annotated pairs. However, humans and some animals have bilateral symmetry and various orientations, which lead to severe mispredictions of symmetrical parts. Besides, point cloud noise disrupts consistent representations for point cloud and thus degrades the shape correspondence accuracy. To address the above issues, we propose a Self-Ensembling ORientation-aware Network termed SE-ORNet. The key of our approach is to exploit an orientation estimation module with a domain adaptive discriminator to align the orientations of point cloud pairs, which significantly alleviates the mispredictions of symmetrical parts. Additionally, we design a selfensembling framework for unsupervised point cloud shape correspondence. In this framework, the disturbances of point cloud noise are overcome by perturbing the inputs of the student and teacher networks with different data augmentations and constraining the consistency of predictions. Extensive experiments on both human and animal datasets show that our SE-ORNet can surpass state-of-the-art unsupervised point cloud shape correspondence methods. ",
    "url": "https://arxiv.org/abs/2304.05395",
    "authors": [
      "Jiacheng Deng",
      "Chuxin Wang",
      "Jiahao Lu",
      "Jianfeng He",
      "Tianzhu Zhang",
      "Jiyang Yu",
      "Zhe Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05402",
    "title": "Boosting Cross-task Transferability of Adversarial Patches with Visual  Relations",
    "abstract": "The transferability of adversarial examples is a crucial aspect of evaluating the robustness of deep learning systems, particularly in black-box scenarios. Although several methods have been proposed to enhance cross-model transferability, little attention has been paid to the transferability of adversarial examples across different tasks. This issue has become increasingly relevant with the emergence of foundational multi-task AI systems such as Visual ChatGPT, rendering the utility of adversarial samples generated by a single task relatively limited. Furthermore, these systems often entail inferential functions beyond mere recognition-like tasks. To address this gap, we propose a novel Visual Relation-based cross-task Adversarial Patch generation method called VRAP, which aims to evaluate the robustness of various visual tasks, especially those involving visual reasoning, such as Visual Question Answering and Image Captioning. VRAP employs scene graphs to combine object recognition-based deception with predicate-based relations elimination, thereby disrupting the visual reasoning information shared among inferential tasks. Our extensive experiments demonstrate that VRAP significantly surpasses previous methods in terms of black-box transferability across diverse visual reasoning tasks. ",
    "url": "https://arxiv.org/abs/2304.05402",
    "authors": [
      "Tony Ma",
      "Songze Li",
      "Yisong Xiao",
      "Shunchang Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2304.05405",
    "title": "Efficient Automation of Neural Network Design: A Survey on  Differentiable Neural Architecture Search",
    "abstract": "In the past few years, Differentiable Neural Architecture Search (DNAS) rapidly imposed itself as the trending approach to automate the discovery of deep neural network architectures. This rise is mainly due to the popularity of DARTS, one of the first major DNAS methods. In contrast with previous works based on Reinforcement Learning or Evolutionary Algorithms, DNAS is faster by several orders of magnitude and uses fewer computational resources. In this comprehensive survey, we focus specifically on DNAS and review recent approaches in this field. Furthermore, we propose a novel challenge-based taxonomy to classify DNAS methods. We also discuss the contributions brought to DNAS in the past few years and its impact on the global NAS field. Finally, we conclude by giving some insights into future research directions for the DNAS field. ",
    "url": "https://arxiv.org/abs/2304.05405",
    "authors": [
      "Alexandre Heuillet",
      "Ahmad Nasser",
      "Hichem Arioui",
      "Hedi Tabia"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05430",
    "title": "Transfer Learning Across Heterogeneous Features For Efficient Tensor  Program Generation",
    "abstract": "Tuning tensor program generation involves searching for various possible program transformation combinations for a given program on target hardware to optimize the tensor program execution. It is already a complex process because of the massive search space and exponential combinations of transformations make auto-tuning tensor program generation more challenging, especially when we have a heterogeneous target. In this research, we attempt to address these problems by learning the joint neural network and hardware features and transferring them to the new target hardware. We extensively study the existing state-of-the-art dataset, TenSet, perform comparative analysis on the test split strategies and propose methodologies to prune the dataset. We adopt an attention-inspired approach for tuning the tensor programs enabling them to embed neural network and hardware-specific features. Our approach could prune the dataset up to 45\\% of the baseline without compromising the Pairwise Comparison Accuracy (PCA). Further, the proposed methodology can achieve on-par or improved mean inference time with 25%-40% of the baseline tuning time across different networks and target hardware. ",
    "url": "https://arxiv.org/abs/2304.05430",
    "authors": [
      "Gaurav Verma",
      "Siddhisanket Raskar",
      "Zhen Xie",
      "Abid M Malik",
      "Murali Emani",
      "Barbara Chapman"
    ],
    "subjectives": [
      "Programming Languages (cs.PL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05440",
    "title": "PixelRNN: In-pixel Recurrent Neural Networks for End-to-end-optimized  Perception with Neural Sensors",
    "abstract": "Conventional image sensors digitize high-resolution images at fast frame rates, producing a large amount of data that needs to be transmitted off the sensor for further processing. This is challenging for perception systems operating on edge devices, because communication is power inefficient and induces latency. Fueled by innovations in stacked image sensor fabrication, emerging sensor-processors offer programmability and minimal processing capabilities directly on the sensor. We exploit these capabilities by developing an efficient recurrent neural network architecture, PixelRNN, that encodes spatio-temporal features on the sensor using purely binary operations. PixelRNN reduces the amount of data to be transmitted off the sensor by a factor of 64x compared to conventional systems while offering competitive accuracy for hand gesture recognition and lip reading tasks. We experimentally validate PixelRNN using a prototype implementation on the SCAMP-5 sensor-processor platform. ",
    "url": "https://arxiv.org/abs/2304.05440",
    "authors": [
      "Haley M. So",
      "Laurie Bose",
      "Piotr Dudek",
      "Gordon Wetzstein"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05459",
    "title": "Probabilistic Reasoning at Scale: Trigger Graphs to the Rescue",
    "abstract": "The role of uncertainty in data management has become more prominent than ever before, especially because of the growing importance of machine learning-driven applications that produce large uncertain databases. A well-known approach to querying such databases is to blend rule-based reasoning with uncertainty. However, techniques proposed so far struggle with large databases. In this paper, we address this problem by presenting a new technique for probabilistic reasoning that exploits Trigger Graphs (TGs) -- a notion recently introduced for the non-probabilistic setting. The intuition is that TGs can effectively store a probabilistic model by avoiding an explicit materialization of the lineage and by grouping together similar derivations of the same fact. Firstly, we show how TGs can be adapted to support the possible world semantics. Then, we describe techniques for efficiently computing a probabilistic model, and formally establish the correctness of our approach. We also present an extensive empirical evaluation using a prototype called LTGs. Our comparison against other leading engines shows that LTGs is not only faster, even against approximate reasoning techniques, but can also reason over probabilistic databases that existing engines cannot scale to. ",
    "url": "https://arxiv.org/abs/2304.05459",
    "authors": [
      "Efthymia Tsamoura",
      "Jaehun Lee",
      "Jacopo Urbani"
    ],
    "subjectives": [
      "Databases (cs.DB)"
    ]
  },
  {
    "id": "arXiv:2304.05467",
    "title": "Structured IQC Synthesis of Robust $\\mathcal{H}_2$ Controllers in the  Frequency Domain",
    "abstract": "The problem of robust controller synthesis for plants affected by structured uncertainty, captured by integral quadratic constraints, is discussed. The solution is optimized towards a worst-case white noise rejection specification, which is a generalization of the standard $\\mathcal{H}_2$-norm to the robust setting including possibly non-LTI uncertainty. Arbitrary structural constraints can be imposed on the control solution, making this method suitable for distributed systems. The nonsmooth optimization algorithm used to solve the robust synthesis problem operates directly in the frequency domain, eliminating scalability issues for complex systems and providing local optimality certificates. The method is evaluated using two literature examples and a real-world system using a novel implementation of a robust $\\mathcal{H}_2$-performance bound. ",
    "url": "https://arxiv.org/abs/2304.05467",
    "authors": [
      "Maximilian Schütte",
      "Annika Eichler",
      "Herbert Werner"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.05469",
    "title": "CamDiff: Camouflage Image Augmentation via Diffusion Model",
    "abstract": "The burgeoning field of camouflaged object detection (COD) seeks to identify objects that blend into their surroundings. Despite the impressive performance of recent models, we have identified a limitation in their robustness, where existing methods may misclassify salient objects as camouflaged ones, despite these two characteristics being contradictory. This limitation may stem from lacking multi-pattern training images, leading to less saliency robustness. To address this issue, we introduce CamDiff, a novel approach inspired by AI-Generated Content (AIGC) that overcomes the scarcity of multi-pattern training images. Specifically, we leverage the latent diffusion model to synthesize salient objects in camouflaged scenes, while using the zero-shot image classification ability of the Contrastive Language-Image Pre-training (CLIP) model to prevent synthesis failures and ensure the synthesized object aligns with the input prompt. Consequently, the synthesized image retains its original camouflage label while incorporating salient objects, yielding camouflage samples with richer characteristics. The results of user studies show that the salient objects in the scenes synthesized by our framework attract the user's attention more; thus, such samples pose a greater challenge to the existing COD models. Our approach enables flexible editing and efficient large-scale dataset generation at a low cost. It significantly enhances COD baselines' training and testing phases, emphasizing robustness across diverse domains. Our newly-generated datasets and source code are available at https://github.com/drlxj/CamDiff. ",
    "url": "https://arxiv.org/abs/2304.05469",
    "authors": [
      "Xue-Jing Luo",
      "Shuo Wang",
      "Zongwei Wu",
      "Christos Sakaridis",
      "Yun Cheng",
      "Deng-Ping Fan",
      "Luc Van Gool"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05470",
    "title": "World City Networks and Multinational Firms: An Analysis of Economic  Ties Over a Decade",
    "abstract": "One perspective to view the economic development of cities is through the presence of multinational firms; how subsidiaries of various organizations are set up throughout the globe and how cities are connected to each other through these networks of multinational firms. Analysis of these networks can reveal interesting economical and spatial trends, as well as help us understand the importance of cities in national and regional economic development. This paper aims to study networks of cities formed due to the linkages of multinational firms over a decade (from 2010 to 2019). More specifically we are interested in analyzing the growth and stability of various cities in terms of the connections they form with other cities over time. Our results can be summarized into two key findings: First, we ascertain the central position of several cities due to their economically stable connections; Second, we successfully identify cities that have evolved over the past decade as the presence of multinational firms has increased in these cities. ",
    "url": "https://arxiv.org/abs/2304.05470",
    "authors": [
      "Mohammed Adil Saleem",
      "Faraz Zaidi",
      "Celine Rozenblat"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.05472",
    "title": "Light Sampling Field and BRDF Representation for Physically-based Neural  Rendering",
    "abstract": "Physically-based rendering (PBR) is key for immersive rendering effects used widely in the industry to showcase detailed realistic scenes from computer graphics assets. A well-known caveat is that producing the same is computationally heavy and relies on complex capture devices. Inspired by the success in quality and efficiency of recent volumetric neural rendering, we want to develop a physically-based neural shader to eliminate device dependency and significantly boost performance. However, no existing lighting and material models in the current neural rendering approaches can accurately represent the comprehensive lighting models and BRDFs properties required by the PBR process. Thus, this paper proposes a novel lighting representation that models direct and indirect light locally through a light sampling strategy in a learned light sampling field. We also propose BRDF models to separately represent surface/subsurface scattering details to enable complex objects such as translucent material (i.e., skin, jade). We then implement our proposed representations with an end-to-end physically-based neural face skin shader, which takes a standard face asset (i.e., geometry, albedo map, and normal map) and an HDRI for illumination as inputs and generates a photo-realistic rendering as output. Extensive experiments showcase the quality and efficiency of our PBR face skin shader, indicating the effectiveness of our proposed lighting and material representations. ",
    "url": "https://arxiv.org/abs/2304.05472",
    "authors": [
      "Jing Yang",
      "Hanyuan Xiao",
      "Wenbin Teng",
      "Yunxuan Cai",
      "Yajie Zhao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2304.05474",
    "title": "Audience Expansion for Multi-show Release Based on an Edge-prompted  Heterogeneous Graph Network",
    "abstract": "In the user targeting and expanding of new shows on a video platform, the key point is how their embeddings are generated. It's supposed to be personalized from the perspective of both users and shows. Furthermore, the pursue of both instant (click) and long-time (view time) rewards, and the cold-start problem for new shows bring additional challenges. Such a problem is suitable for processing by heterogeneous graph models, because of the natural graph structure of data. But real-world networks usually have billions of nodes and various types of edges. Few existing methods focus on handling large-scale data and exploiting different types of edges, especially the latter. In this paper, we propose a two-stage audience expansion scheme based on an edge-prompted heterogeneous graph network which can take different double-sided interactions and features into account. In the offline stage, to construct the graph, user IDs and specific side information combinations of the shows are chosen to be the nodes, and click/co-click relations and view time are used to build the edges. Embeddings and clustered user groups are then calculated. When new shows arrive, their embeddings and subsequent matching users can be produced within a consistent space. In the online stage, posterior data including click/view users are employed as seeds to look for similar users. The results on the public datasets and our billion-scale data demonstrate the accuracy and efficiency of our approach. ",
    "url": "https://arxiv.org/abs/2304.05474",
    "authors": [
      "Kai Song",
      "Shaofeng Wang",
      "Ziwei Xie",
      "Shanyu Wang",
      "Jiahong Li",
      "Yongqiang Yang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2304.05475",
    "title": "Failure Probability Estimation and Detection of Failure Surfaces via  Adaptive Sequential Decomposition of the Design Domain",
    "abstract": "We propose an algorithm for an optimal adaptive selection of points from the design domain of input random variables that are needed for an accurate estimation of failure probability and the determination of the boundary between safe and failure domains. The method is particularly useful when each evaluation of the performance function g(x) is very expensive and the function can be characterized as either highly nonlinear, noisy, or even discrete-state (e.g., binary). In such cases, only a limited number of calls is feasible, and gradients of g(x) cannot be used. The input design domain is progressively segmented by expanding and adaptively refining mesh-like lock-free geometrical structure. The proposed triangulation-based approach effectively combines the features of simulation and approximation methods. The algorithm performs two independent tasks: (i) the estimation of probabilities through an ingenious combination of deterministic cubature rules and the application of the divergence theorem and (ii) the sequential extension of the experimental design with new points. The sequential selection of points from the design domain for future evaluation of g(x) is carried out through a new learning function, which maximizes instantaneous information gain in terms of the probability classification that corresponds to the local region. The extension may be halted at any time, e.g., when sufficiently accurate estimations are obtained. Due to the use of the exact geometric representation in the input domain, the algorithm is most effective for problems of a low dimension, not exceeding eight. The method can handle random vectors with correlated non-Gaussian marginals. The estimation accuracy can be improved by employing a smooth surrogate model. Finally, we define new factors of global sensitivity to failure based on the entire failure surface weighted by the density of the input random vector. ",
    "url": "https://arxiv.org/abs/2304.05475",
    "authors": [
      "Aleksei Gerasimov",
      "Miroslav Vořechovský"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Probability (math.PR)"
    ]
  },
  {
    "id": "arXiv:2304.05492",
    "title": "Towards More Robust and Accurate Sequential Recommendation with  Cascade-guided Adversarial Training",
    "abstract": "Sequential recommendation models, models that learn from chronological user-item interactions, outperform traditional recommendation models in many settings. Despite the success of sequential recommendation models, their robustness has recently come into question. Two properties unique to the nature of sequential recommendation models may impair their robustness - the cascade effects induced during training and the model's tendency to rely too heavily on temporal information. To address these vulnerabilities, we propose Cascade-guided Adversarial training, a new adversarial training procedure that is specifically designed for sequential recommendation models. Our approach harnesses the intrinsic cascade effects present in sequential modeling to produce strategic adversarial perturbations to item embeddings during training. Experiments on training state-of-the-art sequential models on four public datasets from different domains show that our training approach produces superior model ranking accuracy and superior model robustness to real item replacement perturbations when compared to both standard model training and generic adversarial training. ",
    "url": "https://arxiv.org/abs/2304.05492",
    "authors": [
      "Juntao Tan",
      "Shelby Heinecke",
      "Zhiwei Liu",
      "Yongjun Chen",
      "Yongfeng Zhang",
      "Huan Wang"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05493",
    "title": "KGS: Causal Discovery Using Knowledge-guided Greedy Equivalence Search",
    "abstract": "Learning causal relationships solely from observational data provides insufficient information about the underlying causal mechanism and the search space of possible causal graphs. As a result, often the search space can grow exponentially for approaches such as Greedy Equivalence Search (GES) that uses a score-based approach to search the space of equivalence classes of graphs. Prior causal information such as the presence or absence of a causal edge can be leveraged to guide the discovery process towards a more restricted and accurate search space. In this study, we present KGS, a knowledge-guided greedy score-based causal discovery approach that uses observational data and structural priors (causal edges) as constraints to learn the causal graph. KGS is a novel application of knowledge constraints that can leverage any of the following prior edge information between any two variables: the presence of a directed edge, the absence of an edge, and the presence of an undirected edge. We extensively evaluate KGS across multiple settings in both synthetic and benchmark real-world datasets. Our experimental results demonstrate that structural priors of any type and amount are helpful and guide the search process towards an improved performance and early convergence. ",
    "url": "https://arxiv.org/abs/2304.05493",
    "authors": [
      "Uzma Hasan",
      "Md Osman Gani"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.05514",
    "title": "State estimation of a carbon capture process through POD model reduction  and neural network approximation",
    "abstract": "This paper presents an efficient approach for state estimation of post-combustion CO2 capture plants (PCCPs) by using reduced-order neural network models. The method involves extracting lower-dimensional feature vectors from high-dimensional operational data of the PCCP and constructing a reduced-order process model using proper orthogonal decomposition (POD). Multi-layer perceptron (MLP) neural networks capture the dominant dynamics of the process and train the network parameters with low-dimensional data obtained from open-loop simulations. The proposed POD-MLP model can be used as the basis for estimating the states of PCCPs at a significantly decreased computational cost. For state estimation, a reduced-order extended Kalman filtering (EKF) scheme based on the POD-MLP model is developed. Our simulations demonstrate that the proposed POD-MLP modeling approach reduces computational complexity compared to the POD-only model for nonlinear systems. Additionally, the POD-MLP-EKF algorithm can accurately reconstruct the full state information of PCCPs while significantly improving computational efficiency compared to the EKF based on the original PCCP model. ",
    "url": "https://arxiv.org/abs/2304.05514",
    "authors": [
      "Siyu Liu",
      "Xunyuan Yin",
      "Jinfeng Liu"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Dynamical Systems (math.DS)"
    ]
  },
  {
    "id": "arXiv:2304.05516",
    "title": "Echo of Neighbors: Privacy Amplification for Personalized Private  Federated Learning with Shuffle Model",
    "abstract": "Federated Learning, as a popular paradigm for collaborative training, is vulnerable against privacy attacks. Different privacy levels regarding users' attitudes need to be satisfied locally, while a strict privacy guarantee for the global model is also required centrally. Personalized Local Differential Privacy (PLDP) is suitable for preserving users' varying local privacy, yet only provides a central privacy guarantee equivalent to the worst-case local privacy level. Thus, achieving strong central privacy as well as personalized local privacy with a utility-promising model is a challenging problem. In this work, a general framework (APES) is built up to strengthen model privacy under personalized local privacy by leveraging the privacy amplification effect of the shuffle model. To tighten the privacy bound, we quantify the heterogeneous contributions to the central privacy user by user. The contributions are characterized by the ability of generating \"echos\" from the perturbation of each user, which is carefully measured by proposed methods Neighbor Divergence and Clip-Laplace Mechanism. Furthermore, we propose a refined framework (S-APES) with the post-sparsification technique to reduce privacy loss in high-dimension scenarios. To the best of our knowledge, the impact of shuffling on personalized local privacy is considered for the first time. We provide a strong privacy amplification effect, and the bound is tighter than the baseline result based on existing methods for uniform local privacy. Experiments demonstrate that our frameworks ensure comparable or higher accuracy for the global model. ",
    "url": "https://arxiv.org/abs/2304.05516",
    "authors": [
      "Yixuan Liu",
      "Suyun Zhao",
      "Li Xiong",
      "Yuhan Liu",
      "Hong Chen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05524",
    "title": "Understanding Causality with Large Language Models: Feasibility and  Opportunities",
    "abstract": "We assess the ability of large language models (LLMs) to answer causal questions by analyzing their strengths and weaknesses against three types of causal question. We believe that current LLMs can answer causal questions with existing causal knowledge as combined domain experts. However, they are not yet able to provide satisfactory answers for discovering new knowledge or for high-stakes decision-making tasks with high precision. We discuss possible future directions and opportunities, such as enabling explicit and implicit causal modules as well as deep causal-aware LLMs. These will not only enable LLMs to answer many different types of causal questions for greater impact but also enable LLMs to be more trustworthy and efficient in general. ",
    "url": "https://arxiv.org/abs/2304.05524",
    "authors": [
      "Cheng Zhang",
      "Stefan Bauer",
      "Paul Bennett",
      "Jiangfeng Gao",
      "Wenbo Gong",
      "Agrin Hilmkil",
      "Joel Jennings",
      "Chao Ma",
      "Tom Minka",
      "Nick Pawlowski",
      "James Vaughan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.05542",
    "title": "CLCLSA: Cross-omics Linked embedding with Contrastive Learning and Self  Attention for multi-omics integration with incomplete multi-omics data",
    "abstract": "Integration of heterogeneous and high-dimensional multi-omics data is becoming increasingly important in understanding genetic data. Each omics technique only provides a limited view of the underlying biological process and integrating heterogeneous omics layers simultaneously would lead to a more comprehensive and detailed understanding of diseases and phenotypes. However, one obstacle faced when performing multi-omics data integration is the existence of unpaired multi-omics data due to instrument sensitivity and cost. Studies may fail if certain aspects of the subjects are missing or incomplete. In this paper, we propose a deep learning method for multi-omics integration with incomplete data by Cross-omics Linked unified embedding with Contrastive Learning and Self Attention (CLCLSA). Utilizing complete multi-omics data as supervision, the model employs cross-omics autoencoders to learn the feature representation across different types of biological data. The multi-omics contrastive learning, which is used to maximize the mutual information between different types of omics, is employed before latent feature concatenation. In addition, the feature-level self-attention and omics-level self-attention are employed to dynamically identify the most informative features for multi-omics data integration. Extensive experiments were conducted on four public multi-omics datasets. The experimental results indicated that the proposed CLCLSA outperformed the state-of-the-art approaches for multi-omics data classification using incomplete multi-omics data. ",
    "url": "https://arxiv.org/abs/2304.05542",
    "authors": [
      "Chen Zhao",
      "Anqi Liu",
      "Xiao Zhang",
      "Xuewei Cao",
      "Zhengming Ding",
      "Qiuying Sha",
      "Hui Shen",
      "Hong-Wen Deng",
      "Weihua Zhou"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Genomics (q-bio.GN)"
    ]
  },
  {
    "id": "arXiv:2304.05552",
    "title": "DynamicDet: A Unified Dynamic Architecture for Object Detection",
    "abstract": "Dynamic neural network is an emerging research topic in deep learning. With adaptive inference, dynamic models can achieve remarkable accuracy and computational efficiency. However, it is challenging to design a powerful dynamic detector, because of no suitable dynamic architecture and exiting criterion for object detection. To tackle these difficulties, we propose a dynamic framework for object detection, named DynamicDet. Firstly, we carefully design a dynamic architecture based on the nature of the object detection task. Then, we propose an adaptive router to analyze the multi-scale information and to decide the inference route automatically. We also present a novel optimization strategy with an exiting criterion based on the detection losses for our dynamic detectors. Last, we present a variable-speed inference strategy, which helps to realize a wide range of accuracy-speed trade-offs with only one dynamic detector. Extensive experiments conducted on the COCO benchmark demonstrate that the proposed DynamicDet achieves new state-of-the-art accuracy-speed trade-offs. For instance, with comparable accuracy, the inference speed of our dynamic detector Dy-YOLOv7-W6 surpasses YOLOv7-E6 by 12%, YOLOv7-D6 by 17%, and YOLOv7-E6E by 39%. The code is available at https://github.com/VDIGPKU/DynamicDet. ",
    "url": "https://arxiv.org/abs/2304.05552",
    "authors": [
      "Zhihao Lin",
      "Yongtao Wang",
      "Jinhe Zhang",
      "Xiaojie Chu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.05554",
    "title": "Learning Transferable Pedestrian Representation from Multimodal  Information Supervision",
    "abstract": "Recent researches on unsupervised person re-identification~(reID) have demonstrated that pre-training on unlabeled person images achieves superior performance on downstream reID tasks than pre-training on ImageNet. However, those pre-trained methods are specifically designed for reID and suffer flexible adaption to other pedestrian analysis tasks. In this paper, we propose VAL-PAT, a novel framework that learns transferable representations to enhance various pedestrian analysis tasks with multimodal information. To train our framework, we introduce three learning objectives, \\emph{i.e.,} self-supervised contrastive learning, image-text contrastive learning and multi-attribute classification. The self-supervised contrastive learning facilitates the learning of the intrinsic pedestrian properties, while the image-text contrastive learning guides the model to focus on the appearance information of pedestrians.Meanwhile, multi-attribute classification encourages the model to recognize attributes to excavate fine-grained pedestrian information. We first perform pre-training on LUPerson-TA dataset, where each image contains text and attribute annotations, and then transfer the learned representations to various downstream tasks, including person reID, person attribute recognition and text-based person search. Extensive experiments demonstrate that our framework facilitates the learning of general pedestrian representations and thus leads to promising results on various pedestrian analysis tasks. ",
    "url": "https://arxiv.org/abs/2304.05554",
    "authors": [
      "Liping Bao",
      "Longhui Wei",
      "Xiaoyu Qiu",
      "Wengang Zhou",
      "Houqiang Li",
      "Qi Tian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.05556",
    "title": "An End-to-End Network for Upright Adjustment of Panoramic Images",
    "abstract": "Nowadays, panoramic images can be easily obtained by panoramic cameras. However, when the panoramic camera orientation is tilted, a non-upright panoramic image will be captured. Existing upright adjustment models focus on how to estimate more accurate camera orientation, and attribute image reconstruction to offline or post-processing tasks. To this end, we propose an online end-to-end network for upright adjustment. Our network is designed to reconstruct the image while finding the angle. Our network consists of three modules: orientation estimation, LUT online generation, and upright reconstruction. Direction estimation estimates the tilt angle of the panoramic image. Then, a converter block with upsampling function is designed to generate angle to LUT. This module can output corresponding online LUT for different input angles. Finally, a lightweight generative adversarial network (GAN) aims to generate upright images from shallow features. The experimental results show that in terms of angles, we have improved the accuracy of small angle errors. In terms of image reconstruction, In image reconstruction, we have achieved the first real-time online upright reconstruction of panoramic images using deep learning networks. ",
    "url": "https://arxiv.org/abs/2304.05556",
    "authors": [
      "Heyu Chen",
      "Jianfeng Li",
      "Shigang Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05561",
    "title": "On the Adversarial Inversion of Deep Biometric Representations",
    "abstract": "Biometric authentication service providers often claim that it is not possible to reverse-engineer a user's raw biometric sample, such as a fingerprint or a face image, from its mathematical (feature-space) representation. In this paper, we investigate this claim on the specific example of deep neural network (DNN) embeddings. Inversion of DNN embeddings has been investigated for explaining deep image representations or synthesizing normalized images. Existing studies leverage full access to all layers of the original model, as well as all possible information on the original dataset. For the biometric authentication use case, we need to investigate this under adversarial settings where an attacker has access to a feature-space representation but no direct access to the exact original dataset nor the original learned model. Instead, we assume varying degree of attacker's background knowledge about the distribution of the dataset as well as the original learned model (architecture and training process). In these cases, we show that the attacker can exploit off-the-shelf DNN models and public datasets, to mimic the behaviour of the original learned model to varying degrees of success, based only on the obtained representation and attacker's prior knowledge. We propose a two-pronged attack that first infers the original DNN by exploiting the model footprint on the embedding, and then reconstructs the raw data by using the inferred model. We show the practicality of the attack on popular DNNs trained for two prominent biometric modalities, face and fingerprint recognition. The attack can effectively infer the original recognition model (mean accuracy 83\\% for faces, 86\\% for fingerprints), and can craft effective biometric reconstructions that are successfully authenticated with 1-vs-1 authentication accuracy of up to 92\\% for some models. ",
    "url": "https://arxiv.org/abs/2304.05561",
    "authors": [
      "Gioacchino Tangari",
      "Shreesh Keskar",
      "Hassan Jameel Asghar",
      "Dali Kaafar"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05564",
    "title": "Neural Invertible Variable-degree Optical Aberrations Correction",
    "abstract": "Optical aberrations of optical systems cause significant degradation of imaging quality. Aberration correction by sophisticated lens designs and special glass materials generally incurs high cost of manufacturing and the increase in the weight of optical systems, thus recent work has shifted to aberration correction with deep learning-based post-processing. Though real-world optical aberrations vary in degree, existing methods cannot eliminate variable-degree aberrations well, especially for the severe degrees of degradation. Also, previous methods use a single feed-forward neural network and suffer from information loss in the output. To address the issues, we propose a novel aberration correction method with an invertible architecture by leveraging its information-lossless property. Within the architecture, we develop conditional invertible blocks to allow the processing of aberrations with variable degrees. Our method is evaluated on both a synthetic dataset from physics-based imaging simulation and a real captured dataset. Quantitative and qualitative experimental results demonstrate that our method outperforms compared methods in correcting variable-degree optical aberrations. ",
    "url": "https://arxiv.org/abs/2304.05564",
    "authors": [
      "Shuang Cui",
      "Bingnan Wang",
      "Quan Zheng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.05587",
    "title": "Distributed Compressed Sparse Row Format for Spiking Neural Network  Simulation, Serialization, and Interoperability",
    "abstract": "With the increasing development of neuromorphic platforms and their related software tools as well as the increasing scale of spiking neural network (SNN) models, there is a pressure for interoperable and scalable representations of network state. In response to this, we discuss a parallel extension of a widely used format for efficiently representing sparse matrices, the compressed sparse row (CSR), in the context of supporting the simulation and serialization of large-scale SNNs. Sparse matrices for graph adjacency structure provide a natural fit for describing the connectivity of an SNN, and prior work in the area of parallel graph partitioning has developed the distributed CSR (dCSR) format for storing and ingesting large graphs. We contend that organizing additional network information, such as neuron and synapse state, in alignment with its adjacency as dCSR provides a straightforward partition-based distribution of network state. For large-scale simulations, this means each parallel process is only responsible for its own partition of state, which becomes especially useful when the size of an SNN exceeds the memory resources of a single compute node. For potentially long-running simulations, this also enables network serialization to and from disk (e.g. for checkpoint/restart fault-tolerant computing) to be performed largely independently between parallel processes. We also provide a potential implementation, and put it forward for adoption within the neural computing community. ",
    "url": "https://arxiv.org/abs/2304.05587",
    "authors": [
      "Felix Wang"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2304.05599",
    "title": "Bit-Interleaved Multiple Access: Improved Fairness, Reliability, and  Latency for Massive IoT Networks",
    "abstract": "In this paper, we propose bit-interleaved multiple access (BIMA) to enable Internet-of-Things (IoT) networks where a massive connection is required with limited resource blocks. First, by providing a true power allocation (PA) constraint for conventional NOMA with practical constraints, we demonstrate that it cannot support massive connections. To this end, we propose BIMA where there are no strict PA constraints, unlike conventional NOMA, thus allowing a high number of devices. We provide a comprehensive analytical framework for BIMA for all key performance indicators (KPIs) (i.e., ergodic capacity [EC], outage probability [OP], and bit error rate [BER]). We evaluate Jain's fairness index and proportional fairness index in terms of all KPIs. Based on the extensive computer simulations, we reveal that BIMA outperforms conventional NOMA significantly, with a performance gain of up to 20-30dB. This performance gain becomes greater when more devices are supported. BIMA provides a full diversity order and enables the implementation of an arbitrary number of devices and modulation orders, which is crucial for IoT networks in dense areas. BIMA guarantees a fairness system where none of the devices gets a severe performance and the sum-rate is shared in a fair manner among devices by guarantying QoS satisfaction. Finally, we provide an intense complexity and latency analysis and demonstrate that BIMA provides lower latency compared to conventional NOMA since it allows parallel computing at the receivers and no iterative operations are required. We show that BIMA reduces latency by up to 350\\% for specific devices and 170\\% on average. ",
    "url": "https://arxiv.org/abs/2304.05599",
    "authors": [
      "Ferdi Kara",
      "Hakan Kaya",
      "Halim Yanikomeroglu",
      "Chan-Tong Lam",
      "Ben K. Ng"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.05600",
    "title": "Looking Similar, Sounding Different: Leveraging Counterfactual  Cross-Modal Pairs for Audiovisual Representation Learning",
    "abstract": "Audiovisual representation learning typically relies on the correspondence between sight and sound. However, there are often multiple audio tracks that can correspond with a visual scene. Consider, for example, different conversations on the same crowded street. The effect of such counterfactual pairs on audiovisual representation learning has not been previously explored. To investigate this, we use dubbed versions of movies to augment cross-modal contrastive learning. Our approach learns to represent alternate audio tracks, differing only in speech content, similarly to the same video. Our results show that dub-augmented training improves performance on a range of auditory and audiovisual tasks, without significantly affecting linguistic task performance overall. We additionally compare this approach to a strong baseline where we remove speech before pretraining, and find that dub-augmented training is more effective, including for paralinguistic and audiovisual tasks where speech removal leads to worse performance. These findings highlight the importance of considering speech variation when learning scene-level audiovisual correspondences and suggest that dubbed audio can be a useful augmentation technique for training audiovisual models toward more robust performance. ",
    "url": "https://arxiv.org/abs/2304.05600",
    "authors": [
      "Nikhil Singh",
      "Chih-Wei Wu",
      "Iroro Orife",
      "Mahdi Kalayeh"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2304.05610",
    "title": "Vehicle Trajectory Prediction based Predictive Collision Risk Assessment  for Autonomous Driving in Highway Scenarios",
    "abstract": "For driving safely and efficiently in highway scenarios, autonomous vehicles (AVs) must be able to predict future behaviors of surrounding object vehicles (OVs), and assess collision risk accurately for reasonable decision-making. Aiming at autonomous driving in highway scenarios, a predictive collision risk assessment method based on trajectory prediction of OVs is proposed in this paper. Firstly, the vehicle trajectory prediction is formulated as a sequence generation task with long short-term memory (LSTM) encoder-decoder framework. Convolutional social pooling (CSP) and graph attention network (GAN) are adopted for extracting local spatial vehicle interactions and distant spatial vehicle interactions, respectively. Then, two basic risk metrics, time-to-collision (TTC) and minimal distance margin (MDM), are calculated between the predicted trajectory of OV and the candidate trajectory of AV. Consequently, a time-continuous risk function is constructed with temporal and spatial risk metrics. Finally, the vehicle trajectory prediction model CSP-GAN-LSTM is evaluated on two public highway datasets. The quantitative results indicate that the proposed CSP-GAN-LSTM model outperforms the existing state-of-the-art (SOTA) methods in terms of position prediction accuracy. Besides, simulation results in typical highway scenarios further validate the feasibility and effectiveness of the proposed predictive collision risk assessment method. ",
    "url": "https://arxiv.org/abs/2304.05610",
    "authors": [
      "Dejian Meng",
      "Wei Xiao",
      "Lijun Zhang",
      "Zhuang Zhang",
      "Zihao Liu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.05627",
    "title": "Constructing Deep Spiking Neural Networks from Artificial Neural  Networks with Knowledge Distillation",
    "abstract": "Spiking neural networks (SNNs) are well known as the brain-inspired models with high computing efficiency, due to a key component that they utilize spikes as information units, close to the biological neural systems. Although spiking based models are energy efficient by taking advantage of discrete spike signals, their performance is limited by current network structures and their training methods. As discrete signals, typical SNNs cannot apply the gradient descent rules directly into parameters adjustment as artificial neural networks (ANNs). Aiming at this limitation, here we propose a novel method of constructing deep SNN models with knowledge distillation (KD) that uses ANN as teacher model and SNN as student model. Through ANN-SNN joint training algorithm, the student SNN model can learn rich feature information from the teacher ANN model through the KD method, yet it avoids training SNN from scratch when communicating with non-differentiable spikes. Our method can not only build a more efficient deep spiking structure feasibly and reasonably, but use few time steps to train whole model compared to direct training or ANN to SNN methods. More importantly, it has a superb ability of noise immunity for various types of artificial noises and natural signals. The proposed novel method provides efficient ways to improve the performance of SNN through constructing deeper structures in a high-throughput fashion, with potential usage for light and efficient brain-inspired computing of practical scenarios. ",
    "url": "https://arxiv.org/abs/2304.05627",
    "authors": [
      "Qi Xu",
      "Yaxin Li",
      "Jiangrong Shen",
      "Jian K Liu",
      "Huajin Tang",
      "Gang Pan"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.05637",
    "title": "DOSM: Demand-Prediction based Online Service Management for Vehicular  Edge Computing Networks",
    "abstract": "In this work, we investigate an online service management problem in vehicular edge computing networks. To satisfy the varying service demands of mobile vehicles, a service management framework is required to make decisions on the service lifecycle to maintain good network performance. We describe the service lifecycle consists of creating an instance of a given service (\\textit{scale-out}), moving an instance to a different edge node (\\textit{migration}), and/or termination of an underutilized instance (\\textit{scale-in}). In this paper, we propose an efficient online algorithm to perform service management in each time slot, where performance quality in the current time slot, the service demand in future time slots, and the minimal observed delay by vehicles and the minimal migration delay are considered while making the decisions on service lifecycle. Here, the future service demand is computed from a gated recurrent unit (GRU)-based prediction model, and the network performance quality is estimated using a deep reinforcement learning (DRL) model which has the ability to interact with the vehicular environment in real-time. The choice of optimal edge location to deploy a service instance at different times is based on our proposed optimization formulations. Simulation experiments using real-world vehicle trajectories are carried out to evaluate the performance of our proposed demand-prediction based online service management (DOSM) framework against different state-of-the-art solutions using several performance metrics. ",
    "url": "https://arxiv.org/abs/2304.05637",
    "authors": [
      "Anum Talpur",
      "Mohan Gurusamy"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.05638",
    "title": "Self Optimisation and Automatic Code Generation by Evolutionary  Algorithms in PLC based Controlling Processes",
    "abstract": "The digital transformation of automation places new demands on data acquisition and processing in industrial processes. Logical relationships between acquired data and cyclic process sequences must be correctly interpreted and evaluated. To solve this problem, a novel approach based on evolutionary algorithms is proposed to self optimise the system logic of complex processes. Based on the genetic results, a programme code for the system implementation is derived by decoding the solution. This is achieved by a flexible system structure with an upstream, intermediate and downstream unit. In the intermediate unit, a directed learning process interacts with a system replica and an evaluation function in a closed loop. The code generation strategy is represented by redundancy and priority, sequencing and performance derivation. The presented approach is evaluated on an industrial liquid station process subject to a multi-objective optimisation problem. ",
    "url": "https://arxiv.org/abs/2304.05638",
    "authors": [
      "Marlon Löppenberg",
      "Andreas Schwung"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05644",
    "title": "Generative Adversarial Networks-Driven Cyber Threat Intelligence  Detection Framework for Securing Internet of Things",
    "abstract": "While the benefits of 6G-enabled Internet of Things (IoT) are numerous, providing high-speed, low-latency communication that brings new opportunities for innovation and forms the foundation for continued growth in the IoT industry, it is also important to consider the security challenges and risks associated with the technology. In this paper, we propose a two-stage intrusion detection framework for securing IoTs, which is based on two detectors. In the first stage, we propose an adversarial training approach using generative adversarial networks (GAN) to help the first detector train on robust features by supplying it with adversarial examples as validation sets. Consequently, the classifier would perform very well against adversarial attacks. Then, we propose a deep learning (DL) model for the second detector to identify intrusions. We evaluated the proposed approach's efficiency in terms of detection accuracy and robustness against adversarial attacks. Experiment results with a new cyber security dataset demonstrate the effectiveness of the proposed methodology in detecting both intrusions and persistent adversarial examples with a weighted avg of 96%, 95%, 95%, and 95% for precision, recall, f1-score, and accuracy, respectively. ",
    "url": "https://arxiv.org/abs/2304.05644",
    "authors": [
      "Mohamed Amine Ferrag",
      "Djallel Hamouda",
      "Merouane Debbah",
      "Leandros Maglaras",
      "Abderrahmane Lakas"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.05646",
    "title": "Modality-Invariant Representation for Infrared and Visible Image  Registration",
    "abstract": "Since the differences in viewing range, resolution and relative position, the multi-modality sensing module composed of infrared and visible cameras needs to be registered so as to have more accurate scene perception. In practice, manual calibration-based registration is the most widely used process, and it is regularly calibrated to maintain accuracy, which is time-consuming and labor-intensive. To cope with these problems, we propose a scene-adaptive infrared and visible image registration. Specifically, in regard of the discrepancy between multi-modality images, an invertible translation process is developed to establish a modality-invariant domain, which comprehensively embraces the feature intensity and distribution of both infrared and visible modalities. We employ homography to simulate the deformation between different planes and develop a hierarchical framework to rectify the deformation inferred from the proposed latent representation in a coarse-to-fine manner. For that, the advanced perception ability coupled with the residual estimation conducive to the regression of sparse offsets, and the alternate correlation search facilitates a more accurate correspondence matching. Moreover, we propose the first ground truth available misaligned infrared and visible image dataset, involving three synthetic sets and one real-world set. Extensive experiments validate the effectiveness of the proposed method against the state-of-the-arts, advancing the subsequent applications. ",
    "url": "https://arxiv.org/abs/2304.05646",
    "authors": [
      "Zhiying Jiang",
      "Zengxi Zhang",
      "Jinyuan Liu",
      "Xin Fan",
      "Risheng Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05661",
    "title": "SuperpixelGraph: Semi-automatic generation of building footprint through  semantic-sensitive superpixel and neural graph networks",
    "abstract": "Most urban applications necessitate building footprints in the form of concise vector graphics with sharp boundaries rather than pixel-wise raster images. This need contrasts with the majority of existing methods, which typically generate over-smoothed footprint polygons. Editing these automatically produced polygons can be inefficient, if not more time-consuming than manual digitization. This paper introduces a semi-automatic approach for building footprint extraction through semantically-sensitive superpixels and neural graph networks. Drawing inspiration from object-based classification techniques, we first learn to generate superpixels that are not only boundary-preserving but also semantically-sensitive. The superpixels respond exclusively to building boundaries rather than other natural objects, while simultaneously producing semantic segmentation of the buildings. These intermediate superpixel representations can be naturally considered as nodes within a graph. Consequently, graph neural networks are employed to model the global interactions among all superpixels and enhance the representativeness of node features for building segmentation. Classical approaches are utilized to extract and regularize boundaries for the vectorized building footprints. Utilizing minimal clicks and straightforward strokes, we efficiently accomplish accurate segmentation outcomes, eliminating the necessity for editing polygon vertices. Our proposed approach demonstrates superior precision and efficacy, as validated by experimental assessments on various public benchmark datasets. We observe a 10\\% enhancement in the metric for superpixel clustering and an 8\\% increment in vector graphics evaluation, when compared with established techniques. Additionally, we have devised an optimized and sophisticated pipeline for interactive editing, poised to further augment the overall quality of the results. ",
    "url": "https://arxiv.org/abs/2304.05661",
    "authors": [
      "Haojia Yu",
      "Han Hu",
      "Bo Xu",
      "Qisen Shang",
      "Zhendong Wang",
      "Qing Zhu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05667",
    "title": "Rail Detection: An Efficient Row-based Network and A New Benchmark",
    "abstract": "Rail detection, essential for railroad anomaly detection, aims to identify the railroad region in video frames. Although various studies on rail detection exist, neither an open benchmark nor a high-speed network is available in the community, making algorithm comparison and development difficult. Inspired by the growth of lane detection, we propose a rail database and a row-based rail detection method. In detail, we make several contributions: (i) We present a real-world railway dataset, Rail-DB, with 7432 pairs of images and annotations. The images are collected from different situations in lighting, road structures, and views. The rails are labeled with polylines, and the images are categorized into nine scenes. The Rail-DB is expected to facilitate the improvement of rail detection algorithms. (ii) We present an efficient row-based rail detection method, Rail-Net, containing a lightweight convolutional backbone and an anchor classifier. Specifically, we formulate the process of rail detection as a row-based selecting problem. This strategy reduces the computational cost compared to alternative segmentation methods. (iii) We evaluate the Rail-Net on Rail-DB with extensive experiments, including cross-scene settings and network backbones ranging from ResNet to Vision Transformers. Our method achieves promising performance in terms of both speed and accuracy. Notably, a lightweight version could achieve 92.77% accuracy and 312 frames per second. The Rail-Net outperforms the traditional method by 50.65% and the segmentation one by 5.86%. The database and code are available at: https://github.com/Sampson-Lee/Rail-Detection. ",
    "url": "https://arxiv.org/abs/2304.05667",
    "authors": [
      "Xinpeng Li",
      "Xiaojiang Peng"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05678",
    "title": "Real-time Trajectory-based Social Group Detection",
    "abstract": "Social group detection is a crucial aspect of various robotic applications, including robot navigation and human-robot interactions. To date, a range of model-based techniques have been employed to address this challenge, such as the F-formation and trajectory similarity frameworks. However, these approaches often fail to provide reliable results in crowded and dynamic scenarios. Recent advancements in this area have mainly focused on learning-based methods, such as deep neural networks that use visual content or human pose. Although visual content-based methods have demonstrated promising performance on large-scale datasets, their computational complexity poses a significant barrier to their practical use in real-time applications. To address these issues, we propose a simple and efficient framework for social group detection. Our approach explores the impact of motion trajectory on social grouping and utilizes a novel, reliable, and fast data-driven method. We formulate the individuals in a scene as a graph, where the nodes are represented by LSTM-encoded trajectories and the edges are defined by the distances between each pair of tracks. Our framework employs a modified graph transformer module and graph clustering losses to detect social groups. Our experiments on the popular JRDBAct dataset reveal noticeable improvements in performance, with relative improvements ranging from 2% to 11%. Furthermore, our framework is significantly faster, with up to 12x faster inference times compared to state-of-the-art methods under the same computation resources. These results demonstrate that our proposed method is suitable for real-time robotic applications. ",
    "url": "https://arxiv.org/abs/2304.05678",
    "authors": [
      "Simindokht Jahangard",
      "Munawar Hayat",
      "Hamid Rezatofighi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05684",
    "title": "InterGen: Diffusion-based Multi-human Motion Generation under Complex  Interactions",
    "abstract": "We have recently seen tremendous progress in diffusion advances for generating realistic human motions. Yet, they largely disregard the rich multi-human interactions. In this paper, we present InterGen, an effective diffusion-based approach that incorporates human-to-human interactions into the motion diffusion process, which enables layman users to customize high-quality two-person interaction motions, with only text guidance. We first contribute a multimodal dataset, named InterHuman. It consists of about 107M frames for diverse two-person interactions, with accurate skeletal motions and 16,756 natural language descriptions. For the algorithm side, we carefully tailor the motion diffusion model to our two-person interaction setting. To handle the symmetry of human identities during interactions, we propose two cooperative transformer-based denoisers that explicitly share weights, with a mutual attention mechanism to further connect the two denoising processes. Then, we propose a novel representation for motion input in our interaction diffusion model, which explicitly formulates the global relations between the two performers in the world frame. We further introduce two novel regularization terms to encode spatial relations, equipped with a corresponding damping scheme during the training of our interaction diffusion model. Extensive experiments validate the effectiveness and generalizability of InterGen. Notably, it can generate more diverse and compelling two-person motions than previous methods and enables various downstream applications for human interactions. ",
    "url": "https://arxiv.org/abs/2304.05684",
    "authors": [
      "Han Liang",
      "Wenqian Zhang",
      "Wenxuan Li",
      "Jingyi Yu",
      "Lan Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05710",
    "title": "Optimal Detector Placement in Networked Control Systems under  Cyber-attacks with Applications to Power Networks",
    "abstract": "This paper proposes a game-theoretic method to address the problem of optimal detector placement in a networked control system under cyber-attacks. The networked control system is composed of interconnected agents where each agent is regulated by its local controller over unprotected communication, which leaves the system vulnerable to malicious cyber-attacks. To guarantee a given local performance, the defender optimally selects a single agent on which to place a detector at its local controller with the purpose of detecting cyber-attacks. On the other hand, an adversary optimally chooses a single agent on which to conduct a cyber-attack on its input with the aim of maximally worsening the local performance while remaining stealthy to the defender. First, we present a necessary and sufficient condition to ensure that the maximal attack impact on the local performance is bounded, which restricts the possible actions of the defender to a subset of available agents. Then, by considering the maximal attack impact on the local performance as a game payoff, we cast the problem of finding optimal actions of the defender and the adversary as a zero-sum game. Finally, with the possible action sets of the defender and the adversary, an algorithm is devoted to determining the Nash equilibria of the zero-sum game that yield the optimal detector placement. The proposed method is illustrated on an IEEE benchmark for power systems. ",
    "url": "https://arxiv.org/abs/2304.05710",
    "authors": [
      "Anh Tung Nguyen",
      "Sribalaji C. Anand",
      "André M. H. Teixeira",
      "Alexander Medvedev"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.05719",
    "title": "5Greplay: a 5G Network Traffic Fuzzer -- Application to Attack Injection",
    "abstract": "The fifth generation of mobile broadband is more than just an evolution to provide more mobile bandwidth, massive machine-type communications, and ultra-reliable and low-latency communications. It relies on a complex, dynamic and heterogeneous environment that implies addressing numerous testing and security challenges. In this paper we present 5Greplay, an open-source 5G network traffic fuzzer that enables the evaluation of 5G components by replaying and modifying 5G network traffic by creating and injecting network scenarios into a target that can be a 5G core service (e.g., AMF, SMF) or a RAN network (e.g., gNodeB). The tool provides the ability to alter network packets online or offline in both control and data planes in a very flexible manner. The experimental evaluation conducted against open-source based 5G platforms, showed that the target services accept traffic being altered by the tool, and that it can reach up to 9.56 Gbps using only 1 processor core to replay 5G traffic. ",
    "url": "https://arxiv.org/abs/2304.05719",
    "authors": [
      "Zujany Salazar",
      "Huu Nghia Nguyen",
      "Wissam Mallouli",
      "Ana R Cavalli",
      "Edgardo Montes de Oca"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.05727",
    "title": "Preemptively Pruning Clever-Hans Strategies in Deep Neural Networks",
    "abstract": "Explainable AI has become a popular tool for validating machine learning models. Mismatches between the explained model's decision strategy and the user's domain knowledge (e.g. Clever Hans effects) have also been recognized as a starting point for improving faulty models. However, it is less clear what to do when the user and the explanation agree. In this paper, we demonstrate that acceptance of explanations by the user is not a guarantee for a ML model to function well, in particular, some Clever Hans effects may remain undetected. Such hidden flaws of the model can nevertheless be mitigated, and we demonstrate this by contributing a new method, Explanation-Guided Exposure Minimization (EGEM), that premptively prunes variations in the ML model that have not been the subject of positive explanation feedback. Experiments on natural image data demonstrate that our approach leads to models that strongly reduce their reliance on hidden Clever Hans strategies, and consequently achieve higher accuracy on new data. ",
    "url": "https://arxiv.org/abs/2304.05727",
    "authors": [
      "Lorenz Linhardt",
      "Klaus-Robert Müller",
      "Grégoire Montavon"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05729",
    "title": "Dynamic Graph Representation Learning with Neural Networks: A Survey",
    "abstract": "In recent years, Dynamic Graph (DG) representations have been increasingly used for modeling dynamic systems due to their ability to integrate both topological and temporal information in a compact representation. Dynamic graphs allow to efficiently handle applications such as social network prediction, recommender systems, traffic forecasting or electroencephalography analysis, that can not be adressed using standard numeric representations. As a direct consequence of the emergence of dynamic graph representations, dynamic graph learning has emerged as a new machine learning problem, combining challenges from both sequential/temporal data processing and static graph learning. In this research area, Dynamic Graph Neural Network (DGNN) has became the state of the art approach and plethora of models have been proposed in the very recent years. This paper aims at providing a review of problems and models related to dynamic graph learning. The various dynamic graph supervised learning settings are analysed and discussed. We identify the similarities and differences between existing models with respect to the way time information is modeled. Finally, general guidelines for a DGNN designer when faced with a dynamic graph learning problem are provided. ",
    "url": "https://arxiv.org/abs/2304.05729",
    "authors": [
      "Leshanshui Yang",
      "Sébastien Adam",
      "Clément Chatelain"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05735",
    "title": "RO-MAP: Real-Time Multi-Object Mapping with Neural Radiance Fields",
    "abstract": "Accurate perception of objects in the environment is important for improving the scene understanding capability of SLAM systems. In robotic and augmented reality applications, object maps with semantic and metric information show attractive advantages. In this paper, we present RO-MAP, a novel multi-object mapping pipeline that does not rely on 3D priors. Given only monocular input, we use neural radiance fields to represent objects and couple them with a lightweight object SLAM based on multi-view geometry, to simultaneously localize objects and implicitly learn their dense geometry. We create separate implicit models for each detected object and train them dynamically and in parallel as new observations are added. Experiments on synthetic and real-world datasets demonstrate that our method can generate semantic object map with shape reconstruction, and be competitive with offline methods while achieving real-time performance (25Hz). The code and dataset will be available at: https://github.com/XiaoHan-Git/RO-MAP ",
    "url": "https://arxiv.org/abs/2304.05735",
    "authors": [
      "Xiao Han",
      "Houxuan Liu",
      "Yunchao Ding",
      "Lu Yang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.05749",
    "title": "Boosting long-term forecasting performance for continuous-time dynamic  graph networks via data augmentation",
    "abstract": "This study focuses on long-term forecasting (LTF) on continuous-time dynamic graph networks (CTDGNs), which is important for real-world modeling. Existing CTDGNs are effective for modeling temporal graph data due to their ability to capture complex temporal dependencies but perform poorly on LTF due to the substantial requirement for historical data, which is not practical in most cases. To relieve this problem, a most intuitive way is data augmentation. In this study, we propose \\textbf{\\underline{U}ncertainty \\underline{M}asked \\underline{M}ix\\underline{U}p (UmmU)}: a plug-and-play module that conducts uncertainty estimation to introduce uncertainty into the embedding of intermediate layer of CTDGNs, and perform masked mixup to further enhance the uncertainty of the embedding to make it generalize to more situations. UmmU can be easily inserted into arbitrary CTDGNs without increasing the number of parameters. We conduct comprehensive experiments on three real-world dynamic graph datasets, the results demonstrate that UmmU can effectively improve the long-term forecasting performance for CTDGNs. ",
    "url": "https://arxiv.org/abs/2304.05749",
    "authors": [
      "Yuxing Tian",
      "Mingjie Zhu",
      "Jiachi Luo",
      "Song Li"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.05752",
    "title": "Function Space and Critical Points of Linear Convolutional Networks",
    "abstract": "We study the geometry of linear networks with one-dimensional convolutional layers. The function spaces of these networks can be identified with semi-algebraic families of polynomials admitting sparse factorizations. We analyze the impact of the network's architecture on the function space's dimension, boundary, and singular points. We also describe the critical points of the network's parameterization map. Furthermore, we study the optimization problem of training a network with the squared error loss. We prove that for architectures where all strides are larger than one and generic data, the non-zero critical points of that optimization problem are smooth interior points of the function space. This property is known to be false for dense linear networks and linear convolutional networks with stride one. ",
    "url": "https://arxiv.org/abs/2304.05752",
    "authors": [
      "Kathlén Kohn",
      "Guido Montúfar",
      "Vahid Shahverdi",
      "Matthew Trager"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Algebraic Geometry (math.AG)"
    ]
  },
  {
    "id": "arXiv:2304.05754",
    "title": "Self-Supervised Learning with Cluster-Aware-DINO for High-Performance  Robust Speaker Verification",
    "abstract": "Automatic speaker verification task has made great achievements using deep learning approaches with the large-scale manually annotated dataset. However, it's very difficult and expensive to collect a large amount of well-labeled data for system building. In this paper, we propose a novel and advanced self-supervised learning framework which can construct a high performance speaker verification system without using any labeled data. To avoid the impact of false negative pairs, we adopt the self-distillation with no labels (DINO) framework as the initial model, which can be trained without exploiting negative pairs. Then, we introduce a cluster-aware training strategy for DINO to improve the diversity of data. In the iteration learning stage, due to a mass of unreliable labels from clustering, the quality of pseudo labels is important for the system training. This motivates us to propose dynamic loss-gate and label correction (DLG-LC) methods to alleviate the performance degradation caused by unreliable labels. More specifically, we model the loss distribution with GMM and obtain the loss-gate threshold dynamically to distinguish the reliable and unreliable labels. Besides, we adopt the model predictions to correct the unreliable label, for better utilizing the unreliable data rather than dropping them directly. Moreover, we extend the DLG-LC to multi-modality to further improve the performance. The experiments are performed on the commonly used Voxceleb dataset. Compared to the best-known self-supervised speaker verification system, our proposed method obtain 22.17%, 27.94% and 25.56% relative EER improvement on Vox-O, Vox-E and Vox-H test sets, even with fewer iterations, smaller models, and simpler clustering methods. More importantly, the newly proposed system even achieves comparable results with the fully supervised system, but without using any human labeled data. ",
    "url": "https://arxiv.org/abs/2304.05754",
    "authors": [
      "Bing Han",
      "Zhengyang Chen",
      "Yanmin Qian"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2304.05755",
    "title": "ALADIN-NST: Self-supervised disentangled representation learning of  artistic style through Neural Style Transfer",
    "abstract": "Representation learning aims to discover individual salient features of a domain in a compact and descriptive form that strongly identifies the unique characteristics of a given sample respective to its domain. Existing works in visual style representation literature have tried to disentangle style from content during training explicitly. A complete separation between these has yet to be fully achieved. Our paper aims to learn a representation of visual artistic style more strongly disentangled from the semantic content depicted in an image. We use Neural Style Transfer (NST) to measure and drive the learning signal and achieve state-of-the-art representation learning on explicitly disentangled metrics. We show that strongly addressing the disentanglement of style and content leads to large gains in style-specific metrics, encoding far less semantic information and achieving state-of-the-art accuracy in downstream multimodal applications. ",
    "url": "https://arxiv.org/abs/2304.05755",
    "authors": [
      "Dan Ruta",
      "Gemma Canet Tarres",
      "Alex Black",
      "Andrew Gilbert",
      "John Collomosse"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05774",
    "title": "Using Multiple RDF Knowledge Graphs for Enriching ChatGPT Responses",
    "abstract": "There is a recent trend for using the novel Artificial Intelligence ChatGPT chatbox, which provides detailed responses and articulate answers across many domains of knowledge. However, in many cases it returns plausible-sounding but incorrect or inaccurate responses, whereas it does not provide evidence. Therefore, any user has to further search for checking the accuracy of the answer or/and for finding more information about the entities of the response. At the same time there is a high proliferation of RDF Knowledge Graphs (KGs) over any real domain, that offer high quality structured data. For enabling the combination of ChatGPT and RDF KGs, we present a research prototype, called GPToLODS, which is able to enrich any ChatGPT response with more information from hundreds of RDF KGs. In particular, it identifies and annotates each entity of the response with statistics and hyperlinks to LODsyndesis KG (which contains integrated data from 400 RDF KGs and over 412 million entities). In this way, it is feasible to enrich the content of entities and to perform fact checking and validation for the facts of the response at real time. ",
    "url": "https://arxiv.org/abs/2304.05774",
    "authors": [
      "Michalis Mountantonakis",
      "Yannis Tzitzikas"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.05776",
    "title": "A Security Evaluation Framework for Software-Defined Network  Architectures in Data Center Environments",
    "abstract": "The importance of cloud computing has grown over the last years, which resulted in a significant increase of Data Center (DC) network requirements. Virtualisation is one of the key drivers of that transformation and enables a massive deployment of computing resources, which exhausts server capacity limits. Furthermore, the increased network endpoints need to be handled dynamically and centrally to facilitate cloud computing functionalities. Traditional DCs barely satisfy those demands because of their inherent limitations based on the network topology. Software-Defined Networks (SDN) promise to meet the increasing network requirements for cloud applications by decoupling control functionalities from data forwarding. Although SDN solutions add more flexibility to DC networks, they also pose new vulnerabilities with a high impact due to the centralised architecture. In this paper we propose an evaluation framework for assessing the security level of SDN architectures in four different stages. Furthermore, we show in an experimental study, how the framework can be used for mapping SDN threats with associated vulnerabilities and necessary mitigations in conjunction with risk and impact classification. The proposed framework helps administrators to evaluate the network security level, to apply countermeasures for identified SDN threats, and to meet the networks security requirements. ",
    "url": "https://arxiv.org/abs/2304.05776",
    "authors": [
      "Igor Ivkić",
      "Dominik Thiede",
      "Nicholas Race",
      "Matthew Broadbent",
      "Antonios Gouglidis"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.05790",
    "title": "Deep neural network approximation of composite functions without the  curse of dimensionality",
    "abstract": "In this article we identify a general class of high-dimensional continuous functions that can be approximated by deep neural networks (DNNs) with the rectified linear unit (ReLU) activation without the curse of dimensionality. In other words, the number of DNN parameters grows at most polynomially in the input dimension and the approximation error. The functions in our class can be expressed as a potentially unbounded number of compositions of special functions which include products, maxima, and certain parallelized Lipschitz continuous functions. ",
    "url": "https://arxiv.org/abs/2304.05790",
    "authors": [
      "Adrian Riekert"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05801",
    "title": "EgoDist: Comparing networks via distributions of egonet features",
    "abstract": "Identifying networks with similar characteristics in a given ensemble, or detecting pattern discontinuities in a temporal sequence of networks, are two examples of tasks that require an effective metric capable of quantifying network (dis)similarity. Here we propose a method based on a global portrait of graph properties built by processing local nodes features. More precisely, a set of dissimilarity measures is defined by elaborating the distributions, over the network, of a few egonet features, namely the degree, the clustering coefficient, and the egonet persistence. The method, which does not require the alignment of the two networks being compared, exploits the statistics of the three features to define one- or multi-dimensional distribution functions, which are then compared to define a distance between the networks. The effectiveness of the method is evaluated using a standard classification test, i.e., recognizing the graphs originating from the same synthetic model. Overall, the proposed distances have performances comparable to the best state-of-the-art techniques (graphlet-based methods) with similar computational requirements. Given its simplicity and flexibility, the method is proposed as a viable approach for network comparison tasks. ",
    "url": "https://arxiv.org/abs/2304.05801",
    "authors": [
      "Carlo Piccardi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Data Analysis, Statistics and Probability (physics.data-an)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2304.05811",
    "title": "A Survey on Distributed Evolutionary Computation",
    "abstract": "The rapid development of parallel and distributed computing paradigms has brought about great revolution in computing. Thanks to the intrinsic parallelism of evolutionary computation (EC), it is natural to implement EC on parallel and distributed computing systems. On the one hand, the computing power provided by parallel computing systems can significantly improve the efficiency and scalability of EC. On the other hand, data are collected and processed in a distributed manner, which brings a novel development direction and new challenges to EC. In this paper, we intend to give a systematic review on distributed EC (DEC). First, a new taxonomy for DEC is proposed from top design mechanism to bottom implementation mechanism. Based on this taxonomy, existing studies on DEC are reviewed in terms of purpose, parallel structure of the algorithm, parallel model for implementation, and the implementation environment. Second, we clarify two major purposes of DEC, i.e., improving efficiency through parallel processing for centralized optimization and cooperating distributed individuals/sub-populations with partial information to perform distributed optimization. Third, noting that the latter purpose of DEC is an emerging and attractive trend for EC with the booming of spatially distributed paradigms, this paper gives a systematic definition of the distributed optimization and classifies it into dimension distributed-, data distributed-, and objective distributed-optimization problems. Formal formulations for these problems are provided and various DEC studies on these problems are reviewed. We also discuss challenges and potential research directions, aiming to enlighten the design of DEC and pave the way for future developments. ",
    "url": "https://arxiv.org/abs/2304.05811",
    "authors": [
      "Wei-Neng Chen",
      "Feng-Feng Wei",
      "Tian-Fang Zhao",
      "Kay Chen Tan",
      "Jun Zhang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2304.05812",
    "title": "Cost-damage analysis of attack trees",
    "abstract": "Attack trees (ATs) are a widely deployed modelling technique to categorize potential attacks on a system. An attacker of such a system aims at doing as much damage as possible, but might be limited by a cost budget. The maximum possible damage for a given cost budget is an important security metric of a system. In this paper, we find the maximum damage given a cost budget by modelling this problem with ATs, both in deterministic and probabilistic settings. We show that the general problem is NP-complete, and provide heuristics to solve it. For general ATs these are based on integer linear programming. However when the AT is tree-structured, then one can instead use a faster bottom-up approach. We also extend these methods to other problems related to the cost-damage tradeoff, such as the cost-damage Pareto front. ",
    "url": "https://arxiv.org/abs/2304.05812",
    "authors": [
      "Milan Lopuhaä-Zwakenberg",
      "Mariëlle Stoelinga"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Optimization and Control (math.OC)"
    ]
  },
  {
    "id": "arXiv:2304.05817",
    "title": "CEC: Crowdsourcing-based Evolutionary Computation for Distributed  Optimization",
    "abstract": "Crowdsourcing is an emerging computing paradigm that takes advantage of the intelligence of a crowd to solve complex problems effectively. Besides collecting and processing data, it is also a great demand for the crowd to conduct optimization. Inspired by this, this paper intends to introduce crowdsourcing into evolutionary computation (EC) to propose a crowdsourcing-based evolutionary computation (CEC) paradigm for distributed optimization. EC is helpful for optimization tasks of crowdsourcing and in turn, crowdsourcing can break the spatial limitation of EC for large-scale distributed optimization. Therefore, this paper firstly introduces the paradigm of crowdsourcing-based distributed optimization. Then, CEC is elaborated. CEC performs optimization based on a server and a group of workers, in which the server dispatches a large task to workers. Workers search for promising solutions through EC optimizers and cooperate with connected neighbors. To eliminate uncertainties brought by the heterogeneity of worker behaviors and devices, the server adopts the competitive ranking and uncertainty detection strategy to guide the cooperation of workers. To illustrate the satisfactory performance of CEC, a crowdsourcing-based swarm optimizer is implemented as an example for extensive experiments. Comparison results on benchmark functions and a distributed clustering optimization problem demonstrate the potential applications of CEC. ",
    "url": "https://arxiv.org/abs/2304.05817",
    "authors": [
      "Feng-Feng Wei",
      "Wei-Neng Chen",
      "Xiao-Qi Guo",
      "Bowen Zhao",
      "Sang-Woon Jeon",
      "Jun Zhang"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2304.05828",
    "title": "Measuring a Soft Resistive Strain Sensor Array by Solving the Resistor  Network Inverse Problem",
    "abstract": "Soft robotics is applicable to a variety of domains due to the adaptability offered by the soft and compliant materials. To develop future intelligent soft robots, soft sensors that can capture deformation with nearly infinite degree-of-freedom are necessary. Soft sensor networks can address this problem, however, measuring all sensor values throughout the body requires excessive wiring and complex fabrication that may hinder robot performance. We circumvent these challenges by developing a non-invasive measurement technique, which is based on an algorithm that solves the inverse problem of resistor network, and implement this algorithm on a soft resistive, strain sensor network. Our algorithm works by iteratively computing the resistor values based on the applied boundary voltage and current responses, and we analyze the reconstruction error of the algorithm as a function of network size and measurement error. We further develop electronics setup to implement our algorithm on a stretchable resistive strain sensor network made of soft conductive silicone, and show the response of the measured network to different deformation modes. Our work opens a new path to address the challenge of measuring many sensor values in soft sensors, and could be applied to soft robotic sensor systems. ",
    "url": "https://arxiv.org/abs/2304.05828",
    "authors": [
      "Yuchen Zhao",
      "Choo Kean Khaw",
      "Yifan Wang"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.05831",
    "title": "When Should You Wait Before Updating? Toward a Robustness Refinement",
    "abstract": "Consider a dynamic network and a given distributed problem. At any point in time, there might exist several solutions that are equally good with respect to the problem specification, but that are different from an algorithmic perspective, because some could be easier to update than others when the network changes. In other words, one would prefer to have a solution that is more robust to topological changes in the network; and in this direction the best scenario would be that the solution remains correct despite the dynamic of the network. In~\\cite{CasteigtsDPR20}, the authors introduced a very strong robustness criterion: they required that for any removal of edges that maintain the network connected, the solution remains valid. They focus on the maximal independent set problem, and their approach consists in characterizing the graphs in which there exists a robust solution (the existential problem), or even stronger, where any solution is robust (the universal problem). As the robustness criteria is very demanding, few graphs have a robust solution, and even fewer are such that all of their solutions are robust. In this paper, we ask the following question: \\textit{Can we have robustness for a larger class of networks, if we bound the number $k$ of edge removals allowed}? (See the full paper for the full abstract.) ",
    "url": "https://arxiv.org/abs/2304.05831",
    "authors": [
      "Swan Dubois",
      "Laurent Feuilloley",
      "Franck Petit",
      "Mikaël Rabie"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2304.05841",
    "title": "Exploring Diffusion Models for Unsupervised Video Anomaly Detection",
    "abstract": "This paper investigates the performance of diffusion models for video anomaly detection (VAD) within the most challenging but also the most operational scenario in which the data annotations are not used. As being sparse, diverse, contextual, and often ambiguous, detecting abnormal events precisely is a very ambitious task. To this end, we rely only on the information-rich spatio-temporal data, and the reconstruction power of the diffusion models such that a high reconstruction error is utilized to decide the abnormality. Experiments performed on two large-scale video anomaly detection datasets demonstrate the consistent improvement of the proposed method over the state-of-the-art generative models while in some cases our method achieves better scores than the more complex models. This is the first study using a diffusion model and examining its parameters' influence to present guidance for VAD in surveillance scenarios. ",
    "url": "https://arxiv.org/abs/2304.05841",
    "authors": [
      "Anil Osman Tur",
      "Nicola Dall'Asen",
      "Cigdem Beyan",
      "Elisa Ricci"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05856",
    "title": "RESET: Revisiting Trajectory Sets for Conditional Behavior Prediction",
    "abstract": "It is desirable to predict the behavior of traffic participants conditioned on different planned trajectories of the autonomous vehicle. This allows the downstream planner to estimate the impact of its decisions. Recent approaches for conditional behavior prediction rely on a regression decoder, meaning that coordinates or polynomial coefficients are regressed. In this work we revisit set-based trajectory prediction, where the probability of each trajectory in a predefined trajectory set is determined by a classification model, and first-time employ it to the task of conditional behavior prediction. We propose RESET, which combines a new metric-driven algorithm for trajectory set generation with a graph-based encoder. For unconditional prediction, RESET achieves comparable performance to a regression-based approach. Due to the nature of set-based approaches, it has the advantageous property of being able to predict a flexible number of trajectories without influencing runtime or complexity. For conditional prediction, RESET achieves reasonable results with late fusion of the planned trajectory, which was not observed for regression-based approaches before. This means that RESET is computationally lightweight to combine with a planner that proposes multiple future plans of the autonomous vehicle, as large parts of the forward pass can be reused. ",
    "url": "https://arxiv.org/abs/2304.05856",
    "authors": [
      "Julian Schmidt",
      "Pascal Huissel",
      "Julian Wiederer",
      "Julian Jordan",
      "Vasileios Belagiannis",
      "Klaus Dietmayer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.05859",
    "title": "A Hall-type theorem with algorithmic consequences in planar graphs",
    "abstract": "Given a graph $G=(V,E)$, for a vertex set $S\\subseteq V$, let $N(S)$ denote the set of vertices in $V$ that have a neighbor in $S$. In this paper, we prove the following Hall-type statement. Let $k \\ge 2$ be an integer. Let $X$ be a vertex set in the undirected graph $G$ such that for each subset $S$ of $X$ it holds $|N(S)|\\ge \\frac1k {|S|}$. Then $G$ has a matching of size at least $\\frac{|X|}{k+1}$. Using this statement, we derive tight bounds for the estimators of the matching size in planar graphs. These estimators are used in designing sublinear space algorithms for approximating the maching size in the data stream model of computation. In particular, we show the number of locally superior vertices, introduced in \\cite{Jowhari23}, is a $3$ factor approximation of the matching size in planar graphs. The previous analysis proved a $3.5$ approximation factor. In another consequence, we show a simple setting of an estimator by Esfandiari \\etal \\cite{EHLMO15} achieves $3$ factor approximation of the matching size in planar graphs. Namely, let $s$ be the number of edges with both endpoints having degree at most $2$ and let $h$ be the number of vertices with degree at least $3$. We show when the graph is planar, the size of matching is at least $\\frac{s+h}3$. This result generalizes a known fact that every planar graph on $n$ vertices with minimum degree $3$ has a matching of size at least $\\frac{n}3$. ",
    "url": "https://arxiv.org/abs/2304.05859",
    "authors": [
      "Hossein Jowhari"
    ],
    "subjectives": [
      "Discrete Mathematics (cs.DM)",
      "Data Structures and Algorithms (cs.DS)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2304.05860",
    "title": "Learning Homographic Disambiguation Representation for Neural Machine  Translation",
    "abstract": "Homographs, words with the same spelling but different meanings, remain challenging in Neural Machine Translation (NMT). While recent works leverage various word embedding approaches to differentiate word sense in NMT, they do not focus on the pivotal components in resolving ambiguities of homographs in NMT: the hidden states of an encoder. In this paper, we propose a novel approach to tackle homographic issues of NMT in the latent space. We first train an encoder (aka \"HDR-encoder\") to learn universal sentence representations in a natural language inference (NLI) task. We further fine-tune the encoder using homograph-based synset sentences from WordNet, enabling it to learn word-level homographic disambiguation representations (HDR). The pre-trained HDR-encoder is subsequently integrated with a transformer-based NMT in various schemes to improve translation accuracy. Experiments on four translation directions demonstrate the effectiveness of the proposed method in enhancing the performance of NMT systems in the BLEU scores (up to +2.3 compared to a solid baseline). The effects can be verified by other metrics (F1, precision, and recall) of translation accuracy in an additional disambiguation task. Visualization methods like heatmaps, T-SNE and translation examples are also utilized to demonstrate the effects of the proposed method. ",
    "url": "https://arxiv.org/abs/2304.05860",
    "authors": [
      "Weixuan Wang",
      "Wei Peng",
      "Qun Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.05869",
    "title": "LMR: Lane Distance-Based Metric for Trajectory Prediction",
    "abstract": "The development of approaches for trajectory prediction requires metrics to validate and compare their performance. Currently established metrics are based on Euclidean distance, which means that errors are weighted equally in all directions. Euclidean metrics are insufficient for structured environments like roads, since they do not properly capture the agent's intent relative to the underlying lane. In order to provide a reasonable assessment of trajectory prediction approaches with regard to the downstream planning task, we propose a new metric that is lane distance-based: Lane Miss Rate (LMR). For the calculation of LMR, the ground-truth and predicted endpoints are assigned to lane segments, more precisely their centerlines. Measured by the distance along the lane segments, predictions that are within a certain threshold distance to the ground-truth count as hits, otherwise they count as misses. LMR is then defined as the ratio of sequences that yield a miss. Our results on three state-of-the-art trajectory prediction models show that LMR preserves the order of Euclidean distance-based metrics. In contrast to the Euclidean Miss Rate, qualitative results show that LMR yields misses for sequences where predictions are located on wrong lanes. Hits on the other hand result for sequences where predictions are located on the correct lane. This means that LMR implicitly weights Euclidean error relative to the lane and goes into the direction of capturing intents of traffic agents. The source code of LMR for Argoverse 1 is publicly available. ",
    "url": "https://arxiv.org/abs/2304.05869",
    "authors": [
      "Julian Schmidt",
      "Thomas Monninger",
      "Julian Jordan",
      "Klaus Dietmayer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.05884",
    "title": "Unicom: Universal and Compact Representation Learning for Image  Retrieval",
    "abstract": "Modern image retrieval methods typically rely on fine-tuning pre-trained encoders to extract image-level descriptors. However, the most widely used models are pre-trained on ImageNet-1K with limited classes. The pre-trained feature representation is therefore not universal enough to generalize well to the diverse open-world classes. In this paper, we first cluster the large-scale LAION400M into one million pseudo classes based on the joint textual and visual features extracted by the CLIP model. Due to the confusion of label granularity, the automatically clustered dataset inevitably contains heavy inter-class conflict. To alleviate such conflict, we randomly select partial inter-class prototypes to construct the margin-based softmax loss. To further enhance the low-dimensional feature representation, we randomly select partial feature dimensions when calculating the similarities between embeddings and class-wise prototypes. The dual random partial selections are with respect to the class dimension and the feature dimension of the prototype matrix, making the classification conflict-robust and the feature embedding compact. Our method significantly outperforms state-of-the-art unsupervised and supervised image retrieval approaches on multiple benchmarks. The code and pre-trained models are released to facilitate future research https://github.com/deepglint/unicom. ",
    "url": "https://arxiv.org/abs/2304.05884",
    "authors": [
      "Xiang An",
      "Jiankang Deng",
      "Kaicheng Yang",
      "Jaiwei Li",
      "Ziyong Feng",
      "Jia Guo",
      "Jing Yang",
      "Tongliang Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05889",
    "title": "Representation Learning with Multi-Step Inverse Kinematics: An Efficient  and Optimal Approach to Rich-Observation RL",
    "abstract": "We study the design of sample-efficient algorithms for reinforcement learning in the presence of rich, high-dimensional observations, formalized via the Block MDP problem. Existing algorithms suffer from either 1) computational intractability, 2) strong statistical assumptions that are not necessarily satisfied in practice, or 3) suboptimal sample complexity. We address these issues by providing the first computationally efficient algorithm that attains rate-optimal sample complexity with respect to the desired accuracy level, with minimal statistical assumptions. Our algorithm, MusIK, combines systematic exploration with representation learning based on multi-step inverse kinematics, a learning objective in which the aim is to predict the learner's own action from the current observation and observations in the (potentially distant) future. MusIK is simple and flexible, and can efficiently take advantage of general-purpose function approximation. Our analysis leverages several new techniques tailored to non-optimistic exploration algorithms, which we anticipate will find broader use. ",
    "url": "https://arxiv.org/abs/2304.05889",
    "authors": [
      "Zakaria Mhammedi",
      "Dylan J. Foster",
      "Alexander Rakhlin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.05894",
    "title": "Dynamic Mixed Membership Stochastic Block Model for Weighted Labeled  Networks",
    "abstract": "Most real-world networks evolve over time. Existing literature proposes models for dynamic networks that are either unlabeled or assumed to have a single membership structure. On the other hand, a new family of Mixed Membership Stochastic Block Models (MMSBM) allows to model static labeled networks under the assumption of mixed-membership clustering. In this work, we propose to extend this later class of models to infer dynamic labeled networks under a mixed membership assumption. Our approach takes the form of a temporal prior on the model's parameters. It relies on the single assumption that dynamics are not abrupt. We show that our method significantly differs from existing approaches, and allows to model more complex systems --dynamic labeled networks. We demonstrate the robustness of our method with several experiments on both synthetic and real-world datasets. A key interest of our approach is that it needs very few training data to yield good results. The performance gain under challenging conditions broadens the variety of possible applications of automated learning tools --as in social sciences, which comprise many fields where small datasets are a major obstacle to the introduction of machine learning methods. ",
    "url": "https://arxiv.org/abs/2304.05894",
    "authors": [
      "Gaël Poux-Médard",
      "Julien Velcin",
      "Sabine Loudcher"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.05895",
    "title": "Towards Understanding How Data Augmentation Works with Imbalanced Data",
    "abstract": "Data augmentation forms the cornerstone of many modern machine learning training pipelines; yet, the mechanisms by which it works are not clearly understood. Much of the research on data augmentation (DA) has focused on improving existing techniques, examining its regularization effects in the context of neural network over-fitting, or investigating its impact on features. Here, we undertake a holistic examination of the effect of DA on three different classifiers, convolutional neural networks, support vector machines, and logistic regression models, which are commonly used in supervised classification of imbalanced data. We support our examination with testing on three image and five tabular datasets. Our research indicates that DA, when applied to imbalanced data, produces substantial changes in model weights, support vectors and feature selection; even though it may only yield relatively modest changes to global metrics, such as balanced accuracy or F1 measure. We hypothesize that DA works by facilitating variances in data, so that machine learning models can associate changes in the data with labels. By diversifying the range of feature amplitudes that a model must recognize to predict a label, DA improves a model's capacity to generalize when learning with imbalanced data. ",
    "url": "https://arxiv.org/abs/2304.05895",
    "authors": [
      "Damien A. Dablain",
      "Nitesh V. Chawla"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05899",
    "title": "Cancer-Net BCa-S: Breast Cancer Grade Prediction using Volumetric Deep  Radiomic Features from Synthetic Correlated Diffusion Imaging",
    "abstract": "The prevalence of breast cancer continues to grow, affecting about 300,000 females in the United States in 2023. However, there are different levels of severity of breast cancer requiring different treatment strategies, and hence, grading breast cancer has become a vital component of breast cancer diagnosis and treatment planning. Specifically, the gold-standard Scarff-Bloom-Richardson (SBR) grade has been shown to consistently indicate a patient's response to chemotherapy. Unfortunately, the current method to determine the SBR grade requires removal of some cancer cells from the patient which can lead to stress and discomfort along with costly expenses. In this paper, we study the efficacy of deep learning for breast cancer grading based on synthetic correlated diffusion (CDI$^s$) imaging, a new magnetic resonance imaging (MRI) modality and found that it achieves better performance on SBR grade prediction compared to those learnt using gold-standard imaging modalities. Hence, we introduce Cancer-Net BCa-S, a volumetric deep radiomics approach for predicting SBR grade based on volumetric CDI$^s$ data. Given the promising results, this proposed method to identify the severity of the cancer would allow for better treatment decisions without the need for a biopsy. Cancer-Net BCa-S has been made publicly available as part of a global open-source initiative for advancing machine learning for cancer care. ",
    "url": "https://arxiv.org/abs/2304.05899",
    "authors": [
      "Chi-en Amy Tai",
      "Hayden Gunraj",
      "Alexander Wong"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05917",
    "title": "A Phoneme-Informed Neural Network Model for Note-Level Singing  Transcription",
    "abstract": "Note-level automatic music transcription is one of the most representative music information retrieval (MIR) tasks and has been studied for various instruments to understand music. However, due to the lack of high-quality labeled data, transcription of many instruments is still a challenging task. In particular, in the case of singing, it is difficult to find accurate notes due to its expressiveness in pitch, timbre, and dynamics. In this paper, we propose a method of finding note onsets of singing voice more accurately by leveraging the linguistic characteristics of singing, which are not seen in other instruments. The proposed model uses mel-scaled spectrogram and phonetic posteriorgram (PPG), a frame-wise likelihood of phoneme, as an input of the onset detection network while PPG is generated by the pre-trained network with singing and speech data. To verify how linguistic features affect onset detection, we compare the evaluation results through the dataset with different languages and divide onset types for detailed analysis. Our approach substantially improves the performance of singing transcription and therefore emphasizes the importance of linguistic features in singing analysis. ",
    "url": "https://arxiv.org/abs/2304.05917",
    "authors": [
      "Sangeon Yong",
      "Li Su",
      "Juhan Nam"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2304.05919",
    "title": "Hard Patches Mining for Masked Image Modeling",
    "abstract": "Masked image modeling (MIM) has attracted much research attention due to its promising potential for learning scalable visual representations. In typical approaches, models usually focus on predicting specific contents of masked patches, and their performances are highly related to pre-defined mask strategies. Intuitively, this procedure can be considered as training a student (the model) on solving given problems (predict masked patches). However, we argue that the model should not only focus on solving given problems, but also stand in the shoes of a teacher to produce a more challenging problem by itself. To this end, we propose Hard Patches Mining (HPM), a brand-new framework for MIM pre-training. We observe that the reconstruction loss can naturally be the metric of the difficulty of the pre-training task. Therefore, we introduce an auxiliary loss predictor, predicting patch-wise losses first and deciding where to mask next. It adopts a relative relationship learning strategy to prevent overfitting to exact reconstruction loss values. Experiments under various settings demonstrate the effectiveness of HPM in constructing masked images. Furthermore, we empirically find that solely introducing the loss prediction objective leads to powerful representations, verifying the efficacy of the ability to be aware of where is hard to reconstruct. ",
    "url": "https://arxiv.org/abs/2304.05919",
    "authors": [
      "Haochen Wang",
      "Kaiyou Song",
      "Junsong Fan",
      "Yuxi Wang",
      "Jin Xie",
      "Zhaoxiang Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05963",
    "title": "An information-theoretic evolutionary algorithm",
    "abstract": "We propose a novel evolutionary algorithm on bit vectors which derives from the principles of information theory. The information-theoretic evolutionary algorithm (it-EA) iteratively updates a search distribution with two parameters, the center, that is the bit vector at which standard bit mutation is applied, and the mutation rate. The mutation rate is updated by means of information-geometric optimization and the center is updated by means of a maximum likelihood principle. Standard elitist and non elitist updates of the center are also considered. Experiments illustrate the dynamics of the mutation rate and the influence of hyperparameters. In an empirical runtime analysis, on OneMax and LeadingOnes, the elitist and non elitist it-EAs obtain promising results. ",
    "url": "https://arxiv.org/abs/2304.05963",
    "authors": [
      "Arnaud Berny"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2304.05979",
    "title": "NaviSTAR: Socially Aware Robot Navigation with Hybrid Spatio-Temporal  Graph Transformer and Preference Learning",
    "abstract": "Developing robotic technologies for use in human society requires ensuring the safety of robots' navigation behaviors while adhering to pedestrians' expectations and social norms. However, maintaining real-time communication between robots and pedestrians to avoid collisions can be challenging. To address these challenges, we propose a novel socially-aware navigation benchmark called NaviSTAR, which utilizes a hybrid Spatio-Temporal grAph tRansformer (STAR) to understand interactions in human-rich environments fusing potential crowd multi-modal information. We leverage off-policy reinforcement learning algorithm with preference learning to train a policy and a reward function network with supervisor guidance. Additionally, we design a social score function to evaluate the overall performance of social navigation. To compare, we train and test our algorithm and other state-of-the-art methods in both simulator and real-world scenarios independently. Our results show that NaviSTAR outperforms previous methods with outstanding performance\\footnote{The source code and experiment videos of this work are available at: https://sites.google.com/view/san-navistar ",
    "url": "https://arxiv.org/abs/2304.05979",
    "authors": [
      "Weizheng Wang",
      "Ruiqi Wang",
      "Le Mao",
      "Byung-Cheol Min"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.05980",
    "title": "Neural Attention Forests: Transformer-Based Forest Improvement",
    "abstract": "A new approach called NAF (the Neural Attention Forest) for solving regression and classification tasks under tabular training data is proposed. The main idea behind the proposed NAF model is to introduce the attention mechanism into the random forest by assigning attention weights calculated by neural networks of a specific form to data in leaves of decision trees and to the random forest itself in the framework of the Nadaraya-Watson kernel regression. In contrast to the available models like the attention-based random forest, the attention weights and the Nadaraya-Watson regression are represented in the form of neural networks whose weights can be regarded as trainable parameters. The first part of neural networks with shared weights is trained for all trees and computes attention weights of data in leaves. The second part aggregates outputs of the tree networks and aims to minimize the difference between the random forest prediction and the truth target value from a training set. The neural network is trained in an end-to-end manner. The combination of the random forest and neural networks implementing the attention mechanism forms a transformer for enhancing the forest predictions. Numerical experiments with real datasets illustrate the proposed method. The code implementing the approach is publicly available. ",
    "url": "https://arxiv.org/abs/2304.05980",
    "authors": [
      "Andrei V. Konstantinov",
      "Lev V. Utkin",
      "Alexey A. Lukashin",
      "Vladimir A. Muliukha"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.05984",
    "title": "A Deep Cybersickness Predictor through Kinematic Data with Encoded  Physiological Representation",
    "abstract": "Users would experience individually different sickness symptoms during or after navigating through an immersive virtual environment, generally known as cybersickness. Previous studies have predicted the severity of cybersickness based on physiological and/or kinematic data. However, compared with kinematic data, physiological data rely heavily on biosensors during the collection, which is inconvenient and limited to a few affordable VR devices. In this work, we proposed a deep neural network to predict cybersickness through kinematic data. We introduced the encoded physiological representation to characterize the individual susceptibility; therefore, the predictor could predict cybersickness only based on a user's kinematic data without counting on biosensors. Fifty-three participants were recruited to attend the user study to collect multimodal data, including kinematic data (navigation speed, head tracking), physiological signals (e.g., electrodermal activity, heart rate), and Simulator Sickness Questionnaire (SSQ). The predictor achieved an accuracy of 98.3\\% for cybersickness prediction by involving the pre-computed physiological representation to characterize individual differences, providing much convenience for the current cybersickness measurement. ",
    "url": "https://arxiv.org/abs/2304.05984",
    "authors": [
      "Ruichen Li",
      "Yuyang Wang",
      "Handi Yin",
      "Jean-Rémy Chardonnet",
      "Pan Hui"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2304.05989",
    "title": "Object-agnostic Affordance Categorization via Unsupervised Learning of  Graph Embeddings",
    "abstract": "Acquiring knowledge about object interactions and affordances can facilitate scene understanding and human-robot collaboration tasks. As humans tend to use objects in many different ways depending on the scene and the objects' availability, learning object affordances in everyday-life scenarios is a challenging task, particularly in the presence of an open set of interactions and objects. We address the problem of affordance categorization for class-agnostic objects with an open set of interactions; we achieve this by learning similarities between object interactions in an unsupervised way and thus inducing clusters of object affordances. A novel depth-informed qualitative spatial representation is proposed for the construction of Activity Graphs (AGs), which abstract from the continuous representation of spatio-temporal interactions in RGB-D videos. These AGs are clustered to obtain groups of objects with similar affordances. Our experiments in a real-world scenario demonstrate that our method learns to create object affordance clusters with a high V-measure even in cluttered scenes. The proposed approach handles object occlusions by capturing effectively possible interactions and without imposing any object or scene constraints. ",
    "url": "https://arxiv.org/abs/2304.05989",
    "authors": [
      "Alexia Toumpa",
      "Anthony G. Cohn"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05991",
    "title": "Maximum-likelihood Estimators in Physics-Informed Neural Networks for  High-dimensional Inverse Problems",
    "abstract": "Physics-informed neural networks (PINNs) have proven a suitable mathematical scaffold for solving inverse ordinary (ODE) and partial differential equations (PDE). Typical inverse PINNs are formulated as soft-constrained multi-objective optimization problems with several hyperparameters. In this work, we demonstrate that inverse PINNs can be framed in terms of maximum-likelihood estimators (MLE) to allow explicit error propagation from interpolation to the physical model space through Taylor expansion, without the need of hyperparameter tuning. We explore its application to high-dimensional coupled ODEs constrained by differential algebraic equations that are common in transient chemical and biological kinetics. Furthermore, we show that singular-value decomposition (SVD) of the ODE coupling matrices (reaction stoichiometry matrix) provides reduced uncorrelated subspaces in which PINNs solutions can be represented and over which residuals can be projected. Finally, SVD bases serve as preconditioners for the inversion of covariance matrices in this hyperparameter-free robust application of MLE to ``kinetics-informed neural networks''. ",
    "url": "https://arxiv.org/abs/2304.05991",
    "authors": [
      "Gabriel S. Gusmão",
      "Andrew J. Medford"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Dynamical Systems (math.DS)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2304.06002",
    "title": "Fast vehicle detection algorithm based on lightweight YOLO7-tiny",
    "abstract": "The swift and precise detection of vehicles holds significant research significance in intelligent transportation systems (ITS). However, current vehicle detection algorithms encounter challenges such as high computational complexity, low detection rate, and limited feasibility on mobile devices. To address these issues, this paper proposes a lightweight vehicle detection algorithm for YOLOv7-tiny called Ghost-YOLOv7. The model first scales the width multiple to 0.5 and replaces the standard convolution of the backbone network with Ghost convolution to achieve a lighter network and improve the detection speed; secondly, a Ghost bi-directional feature pyramid network (Ghost-BiFPN) neck network is designed to enhance feature extraction capability of the algorithm and enrich semantic information; thirdly, a Ghost Decouoled Head (GDH) is employed for accurate prediction of vehicle location and class, enhancing model accuracy; finally, a coordinate attention mechanism is introduced in the output layer to suppress environmental interference, and the WIoU loss function is employed to enhance the detection accuracy further. Experimental results on the PASCAL VOC dataset demonstrate that Ghost-YOLOv7 outperforms the original YOLOv7-tiny model, achieving a 29.8% reduction in computation, 37.3% reduction in the number of parameters, 35.1% reduction in model weights, and 1.1% higher mean average precision (mAP), while achieving a detection speed of 428 FPS. These results validate the effectiveness of the proposed method. ",
    "url": "https://arxiv.org/abs/2304.06002",
    "authors": [
      "Bo Li",
      "YiHua Chen",
      "Hao Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06007",
    "title": "GPr-Net: Geometric Prototypical Network for Point Cloud Few-Shot  Learning",
    "abstract": "In the realm of 3D-computer vision applications, point cloud few-shot learning plays a critical role. However, it poses an arduous challenge due to the sparsity, irregularity, and unordered nature of the data. Current methods rely on complex local geometric extraction techniques such as convolution, graph, and attention mechanisms, along with extensive data-driven pre-training tasks. These approaches contradict the fundamental goal of few-shot learning, which is to facilitate efficient learning. To address this issue, we propose GPr-Net (Geometric Prototypical Network), a lightweight and computationally efficient geometric prototypical network that captures the intrinsic topology of point clouds and achieves superior performance. Our proposed method, IGI++ (Intrinsic Geometry Interpreter++) employs vector-based hand-crafted intrinsic geometry interpreters and Laplace vectors to extract and evaluate point cloud morphology, resulting in improved representations for FSL (Few-Shot Learning). Additionally, Laplace vectors enable the extraction of valuable features from point clouds with fewer points. To tackle the distribution drift challenge in few-shot metric learning, we leverage hyperbolic space and demonstrate that our approach handles intra and inter-class variance better than existing point cloud few-shot learning methods. Experimental results on the ModelNet40 dataset show that GPr-Net outperforms state-of-the-art methods in few-shot learning on point clouds, achieving utmost computational efficiency that is $170\\times$ better than all existing works. The code is publicly available at https://github.com/TejasAnvekar/GPr-Net. ",
    "url": "https://arxiv.org/abs/2304.06007",
    "authors": [
      "Tejas Anvekar",
      "Dena Bazazian"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06015",
    "title": "An Improved Heart Disease Prediction Using Stacked Ensemble Method",
    "abstract": "Heart disorder has just overtaken cancer as the world's biggest cause of mortality. Several cardiac failures, heart disease mortality, and diagnostic costs can all be reduced with early identification and treatment. Medical data is collected in large quantities by the healthcare industry, but it is not well mined. The discovery of previously unknown patterns and connections in this information can help with an improved decision when it comes to forecasting heart disorder risk. In the proposed study, we constructed an ML-based diagnostic system for heart illness forecasting, using a heart disorder dataset. We used data preprocessing techniques like outlier detection and removal, checking and removing missing entries, feature normalization, cross-validation, nine classification algorithms like RF, MLP, KNN, ETC, XGB, SVC, ADB, DT, and GBM, and eight classifier measuring performance metrics like ramification accuracy, precision, F1 score, specificity, ROC, sensitivity, log-loss, and Matthews' correlation coefficient, as well as eight classification performance evaluations. Our method can easily differentiate between people who have cardiac disease and those are normal. Receiver optimistic curves and also the region under the curves were determined by every classifier. Most of the classifiers, pretreatment strategies, validation methods, and performance assessment metrics for classification models have been discussed in this study. The performance of the proposed scheme has been confirmed, utilizing all of its capabilities. In this work, the impact of clinical decision support systems was evaluated using a stacked ensemble approach that included these nine algorithms ",
    "url": "https://arxiv.org/abs/2304.06015",
    "authors": [
      "Md. Maidul Islam",
      "Tanzina Nasrin Tania",
      "Sharmin Akter",
      "Kazi Hassan Shakib"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06017",
    "title": "Exploiting Logic Locking for a Neural Trojan Attack on Machine Learning  Accelerators",
    "abstract": "Logic locking has been proposed to safeguard intellectual property (IP) during chip fabrication. Logic locking techniques protect hardware IP by making a subset of combinational modules in a design dependent on a secret key that is withheld from untrusted parties. If an incorrect secret key is used, a set of deterministic errors is produced in locked modules, restricting unauthorized use. A common target for logic locking is neural accelerators, especially as machine-learning-as-a-service becomes more prevalent. In this work, we explore how logic locking can be used to compromise the security of a neural accelerator it protects. Specifically, we show how the deterministic errors caused by incorrect keys can be harnessed to produce neural-trojan-style backdoors. To do so, we first outline a motivational attack scenario where a carefully chosen incorrect key, which we call a trojan key, produces misclassifications for an attacker-specified input class in a locked accelerator. We then develop a theoretically-robust attack methodology to automatically identify trojan keys. To evaluate this attack, we launch it on several locked accelerators. In our largest benchmark accelerator, our attack identified a trojan key that caused a 74\\% decrease in classification accuracy for attacker-specified trigger inputs, while degrading accuracy by only 1.7\\% for other inputs on average. ",
    "url": "https://arxiv.org/abs/2304.06017",
    "authors": [
      "Hongye Xu",
      "Dongfang Liu",
      "Cory Merkel",
      "Michael Zuzack"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Artificial Intelligence (cs.AI)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2304.05635",
    "title": "Unifying and Personalizing Weakly-supervised Federated Medical Image  Segmentation via Adaptive Representation and Aggregation",
    "abstract": "Federated learning (FL) enables multiple sites to collaboratively train powerful deep models without compromising data privacy and security. The statistical heterogeneity (e.g., non-IID data and domain shifts) is a primary obstacle in FL, impairing the generalization performance of the global model. Weakly supervised segmentation, which uses sparsely-grained (i.e., point-, bounding box-, scribble-, block-wise) supervision, is increasingly being paid attention to due to its great potential of reducing annotation costs. However, there may exist label heterogeneity, i.e., different annotation forms across sites. In this paper, we propose a novel personalized FL framework for medical image segmentation, named FedICRA, which uniformly leverages heterogeneous weak supervision via adaptIve Contrastive Representation and Aggregation. Concretely, to facilitate personalized modeling and to avoid confusion, a channel selection based site contrastive representation module is employed to adaptively cluster intra-site embeddings and separate inter-site ones. To effectively integrate the common knowledge from the global model with the unique knowledge from each local model, an adaptive aggregation module is applied for updating and initializing local models at the element level. Additionally, a weakly supervised objective function that leverages a multiscale tree energy loss and a gated CRF loss is employed to generate more precise pseudo-labels and further boost the segmentation performance. Through extensive experiments on two distinct medical image segmentation tasks of different modalities, the proposed FedICRA demonstrates overwhelming performance over other state-of-the-art personalized FL methods. Its performance even approaches that of fully supervised training on centralized data. Our code and data are available at https://github.com/llmir/FedICRA. ",
    "url": "https://arxiv.org/abs/2304.05635",
    "authors": [
      "Li Lin",
      "Jiewei Wu",
      "Yixiang Liu",
      "Kenneth K. Y. Wong",
      "Xiaoying Tang"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.05676",
    "title": "Mathematical derivation of wave propagation properties in hierarchical  neural networks with predictive coding feedback dynamics",
    "abstract": "Sensory perception (e.g. vision) relies on a hierarchy of cortical areas, in which neural activity propagates in both directions, to convey information not only about sensory inputs but also about cognitive states, expectations and predictions. At the macroscopic scale, neurophysiological experiments have described the corresponding neural signals as both forward and backward-travelling waves, sometimes with characteristic oscillatory signatures. It remains unclear, however, how such activity patterns relate to specific functional properties of the perceptual apparatus. Here, we present a mathematical framework, inspired by neural network models of predictive coding, to systematically investigate neural dynamics in a hierarchical perceptual system. We show that stability of the system can be systematically derived from the values of hyper-parameters controlling the different signals (related to bottom-up inputs, top-down prediction and error correction). Similarly, it is possible to determine in which direction, and at what speed neural activity propagates in the system. Different neural assemblies (reflecting distinct eigenvectors of the connectivity matrices) can simultaneously and independently display different properties in terms of stability, propagation speed or direction. We also derive continuous-limit versions of the system, both in time and in neural space. Finally, we analyze the possible influence of transmission delays between layers, and reveal the emergence of oscillations at biologically plausible frequencies. ",
    "url": "https://arxiv.org/abs/2304.05676",
    "authors": [
      "Grégory Faye",
      "Guilhem Fouilhé",
      "Rufin VanRullen"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2304.05805",
    "title": "GDP nowcasting with artificial neural networks: How much does long-term  memory matter?",
    "abstract": "In our study, we apply different statistical models to nowcast quarterly GDP growth for the US economy. Using the monthly FRED-MD database, we compare the nowcasting performance of the dynamic factor model (DFM) and four artificial neural networks (ANNs): the multilayer perceptron (MLP), the one-dimensional convolutional neural network (1D CNN), the long short-term memory network (LSTM), and the gated recurrent unit (GRU). The empirical analysis presents the results from two distinctively different evaluation periods. The first (2010:Q1 -- 2019:Q4) is characterized by balanced economic growth, while the second (2010:Q1 -- 2022:Q3) also includes periods of the COVID-19 recession. According to our results, longer input sequences result in more accurate nowcasts in periods of balanced economic growth. However, this effect ceases above a relatively low threshold value of around six quarters (eighteen months). During periods of economic turbulence (e.g., during the COVID-19 recession), longer training sequences do not help the models' predictive performance; instead, they seem to weaken their generalization capability. Our results show that 1D CNN, with the same parameters, generates accurate nowcasts in both of our evaluation periods. Consequently, first in the literature, we propose the use of this specific neural network architecture for economic nowcasting. ",
    "url": "https://arxiv.org/abs/2304.05805",
    "authors": [
      "Kristóf Németh",
      "Dániel Hadházi"
    ],
    "subjectives": [
      "Econometrics (econ.EM)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05823",
    "title": "DiscoGen: Learning to Discover Gene Regulatory Networks",
    "abstract": "Accurately inferring Gene Regulatory Networks (GRNs) is a critical and challenging task in biology. GRNs model the activatory and inhibitory interactions between genes and are inherently causal in nature. To accurately identify GRNs, perturbational data is required. However, most GRN discovery methods only operate on observational data. Recent advances in neural network-based causal discovery methods have significantly improved causal discovery, including handling interventional data, improvements in performance and scalability. However, applying state-of-the-art (SOTA) causal discovery methods in biology poses challenges, such as noisy data and a large number of samples. Thus, adapting the causal discovery methods is necessary to handle these challenges. In this paper, we introduce DiscoGen, a neural network-based GRN discovery method that can denoise gene expression measurements and handle interventional data. We demonstrate that our model outperforms SOTA neural network-based causal discovery methods. ",
    "url": "https://arxiv.org/abs/2304.05823",
    "authors": [
      "Nan Rosemary Ke",
      "Sara-Jane Dunn",
      "Jorg Bornschein",
      "Silvia Chiappa",
      "Melanie Rey",
      "Jean-Baptiste Lespiau",
      "Albin Cassirer",
      "Jane Wang",
      "Theophane Weber",
      "David Barrett",
      "Matthew Botvinick",
      "Anirudh Goyal",
      "Mike Mozer",
      "Danilo Rezende"
    ],
    "subjectives": [
      "Molecular Networks (q-bio.MN)",
      "Machine Learning (cs.LG)",
      "Genomics (q-bio.GN)"
    ]
  },
  {
    "id": "arXiv:2304.05874",
    "title": "Adaptive Gated Graph Convolutional Network for Explainable Diagnosis of  Alzheimer's Disease using EEG Data",
    "abstract": "Graph neural network (GNN) models are increasingly being used for the classification of electroencephalography (EEG) data. However, GNN-based diagnosis of neurological disorders, such as Alzheimer's disease (AD), remains a relatively unexplored area of research. Previous studies have relied on functional connectivity methods to infer brain graph structures and used simple GNN architectures for the diagnosis of AD. In this work, we propose a novel adaptive gated graph convolutional network (AGGCN) that can provide explainable predictions. AGGCN adaptively learns graph structures by combining convolution-based node feature enhancement with a well-known correlation-based measure of functional connectivity. Furthermore, the gated graph convolution can dynamically weigh the contribution of various spatial scales. The proposed model achieves high accuracy in both eyes-closed and eyes-open conditions, indicating the stability of learned representations. Finally, we demonstrate that the proposed AGGCN model generates consistent explanations of its predictions that might be relevant for further study of AD-related alterations of brain networks. ",
    "url": "https://arxiv.org/abs/2304.05874",
    "authors": [
      "Dominik Klepl",
      "Fei He",
      "Min Wu",
      "Daniel J. Blackburn",
      "Ptolemaios G. Sarrigiannis"
    ],
    "subjectives": [
      "Neurons and Cognition (q-bio.NC)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Signal Processing (eess.SP)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2304.05922",
    "title": "Filler Word Detection with Hard Category Mining and Inter-Category Focal  Loss",
    "abstract": "Filler words like ``um\" or ``uh\" are common in spontaneous speech. It is desirable to automatically detect and remove them in recordings, as they affect the fluency, confidence, and professionalism of speech. Previous studies and our preliminary experiments reveal that the biggest challenge in filler word detection is that fillers can be easily confused with other hard categories like ``a\" or ``I\". In this paper, we propose a novel filler word detection method that effectively addresses this challenge by adding auxiliary categories dynamically and applying an additional inter-category focal loss. The auxiliary categories force the model to explicitly model the confusing words by mining hard categories. In addition, inter-category focal loss adaptively adjusts the penalty weight between ``filler\" and ``non-filler\" categories to deal with other confusing words left in the ``non-filler\" category. Our system achieves the best results, with a huge improvement compared to other methods on the PodcastFillers dataset. ",
    "url": "https://arxiv.org/abs/2304.05922",
    "authors": [
      "Zhiyuan Zhao",
      "Lijun Wu",
      "Chuanxin Tang",
      "Dacheng Yin",
      "Yucheng Zhao",
      "Chong Luo"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2304.05949",
    "title": "CMOS + stochastic nanomagnets: heterogeneous computers for probabilistic  inference and learning",
    "abstract": "With the slowing down of Moore's law, augmenting complementary-metal-oxide semiconductor (CMOS) transistors with emerging nanotechnologies (X) is becoming increasingly important. In this paper, we demonstrate how stochastic magnetic tunnel junction (sMTJ)-based probabilistic bits, or p-bits, can be combined with versatile Field Programmable Gate Arrays (FPGA) to design an energy-efficient, heterogeneous CMOS + X (X = sMTJ) prototype. Our heterogeneous computer successfully performs probabilistic inference and asynchronous Boltzmann learning despite device-to-device variations in sMTJs. A comprehensive comparison using a CMOS predictive process design kit (PDK) reveals that digital CMOS-based p-bits emulating high-quality randomness use over 10,000 transistors with the energy per generated random number being roughly two orders of magnitude greater than the sMTJ-based p-bits that dissipate only 2 fJ. Scaled and integrated versions of our approach can significantly advance probabilistic computing and its applications in various domains, including probabilistic machine learning, optimization, and quantum simulation. ",
    "url": "https://arxiv.org/abs/2304.05949",
    "authors": [
      "Keito Kobayashi",
      "Nihal Singh",
      "Qixuan Cao",
      "Kemal Selcuk",
      "Tianrui Hu",
      "Shaila Niazi",
      "Navid Anjum Aadit",
      "Shun Kanai",
      "Hideo Ohno",
      "Shunsuke Fukami",
      "Kerem Y. Camsari"
    ],
    "subjectives": [
      "Mesoscale and Nanoscale Physics (cond-mat.mes-hall)",
      "Artificial Intelligence (cs.AI)",
      "Emerging Technologies (cs.ET)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05976",
    "title": "Bayesian Causal Inference in Doubly Gaussian DAG-probit Models",
    "abstract": "We consider modeling a binary response variable together with a set of covariates for two groups under observational data. The grouping variable can be the confounding variable (the common cause of treatment and outcome), gender, case/control, ethnicity, etc. Given the covariates and a binary latent variable, the goal is to construct two directed acyclic graphs (DAGs), while sharing some common parameters. The set of nodes, which represent the variables, are the same for both groups but the directed edges between nodes, which represent the causal relationships between the variables, can be potentially different. For each group, we also estimate the effect size for each node. We assume that each group follows a Gaussian distribution under its DAG. Given the parent nodes, the joint distribution of DAG is conditionally independent due to the Markov property of DAGs. We introduce the concept of Gaussian DAG-probit model under two groups and hence doubly Gaussian DAG-probit model. To estimate the skeleton of the DAGs and the model parameters, we took samples from the posterior distribution of doubly Gaussian DAG-probit model via MCMC method. We validated the proposed method using a comprehensive simulation experiment and applied it on two real datasets. Furthermore, we validated the results of the real data analysis using well-known experimental studies to show the value of the proposed grouping variable in the causality domain. ",
    "url": "https://arxiv.org/abs/2304.05976",
    "authors": [
      "Rasool Tahmasbi",
      "Keyvan Tahmasbi"
    ],
    "subjectives": [
      "Methodology (stat.ME)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:1911.09660",
    "title": "Estimating uncertainty of earthquake rupture using Bayesian neural  network",
    "abstract": " Title: Estimating uncertainty of earthquake rupture using Bayesian neural  network ",
    "url": "https://arxiv.org/abs/1911.09660",
    "authors": [
      "Sabber Ahamed",
      "Md Mesbah Uddin"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Geophysics (physics.geo-ph)"
    ]
  },
  {
    "id": "arXiv:2104.09439",
    "title": "Vec2GC -- A Graph Based Clustering Method for Text Representations",
    "abstract": " Comments: 5 pages, 1 figure ",
    "url": "https://arxiv.org/abs/2104.09439",
    "authors": [
      "Rajesh N Rao",
      "Manojit Chakraborty"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2107.03433",
    "title": "In-Network Learning: Distributed Training and Inference in Networks",
    "abstract": " Comments: Extended version of Globecom'2021 paper; 11 double-column pages; 11 figures; 1 Table. arXiv admin note: substantial text overlap with arXiv:2104.14929 ",
    "url": "https://arxiv.org/abs/2107.03433",
    "authors": [
      "Matei Moldoveanu",
      "Abdellatif Zaidi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Theory (cs.IT)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.03618",
    "title": "Topological synthesis of fluidic pressure-actuated robust compliant  mechanisms",
    "abstract": " Comments: 24 Figures ",
    "url": "https://arxiv.org/abs/2107.03618",
    "authors": [
      "Prabhat Kumar",
      "Matthijs Langelaar"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2109.08103",
    "title": "Aesthetics and neural network image representations",
    "abstract": " Comments: 11 pages, 6 figures; v2: expanded discussion, appendix with 2 figures added ",
    "url": "https://arxiv.org/abs/2109.08103",
    "authors": [
      "Romuald A. Janik"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2110.03845",
    "title": "A New Data Integration Framework for Covid-19 Social Media Information",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2104.01869 ",
    "url": "https://arxiv.org/abs/2110.03845",
    "authors": [
      "Lauren Ansell",
      "Luciana Dalla Valle"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2110.05740",
    "title": "Temporal Abstraction in Reinforcement Learning with the Successor  Representation",
    "abstract": " Comments: This is the final, published JMLR version ",
    "url": "https://arxiv.org/abs/2110.05740",
    "authors": [
      "Marlos C. Machado",
      "Andre Barreto",
      "Doina Precup",
      "Michael Bowling"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2111.02018",
    "title": "Multi-Glimpse Network: A Robust and Efficient Classification  Architecture based on Recurrent Downsampled Attention",
    "abstract": " Comments: Accepted at BMVC 2021 ",
    "url": "https://arxiv.org/abs/2111.02018",
    "authors": [
      "Sia Huat Tan",
      "Runpei Dong",
      "Kaisheng Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.09943",
    "title": "Data Augmentation through Expert-guided Symmetry Detection to Improve  Performance in Offline Reinforcement Learning",
    "abstract": " Comments: Accepted at ICAART 2023 ",
    "url": "https://arxiv.org/abs/2112.09943",
    "authors": [
      "Giorgio Angelotti",
      "Nicolas Drougard",
      "Caroline P. C. Chanel"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2112.11602",
    "title": "Causal Inference Despite Limited Global Confounding via Mixture Models",
    "abstract": " Comments: Paper to appear in CLEAR 2023 ",
    "url": "https://arxiv.org/abs/2112.11602",
    "authors": [
      "Spencer L. Gordon",
      "Bijan Mazaheri",
      "Yuval Rabani",
      "Leonard J. Schulman"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Data Structures and Algorithms (cs.DS)",
      "Signal Processing (eess.SP)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2201.04211",
    "title": "Reducing Noise Level in Differential Privacy through Matrix Masking",
    "abstract": " Comments: 31 pages ",
    "url": "https://arxiv.org/abs/2201.04211",
    "authors": [
      "A. Adam Ding",
      "Samuel S. Wu",
      "Guanhong Miao",
      "Shigang Chen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2202.03881",
    "title": "Robust Hybrid Learning With Expert Augmentation",
    "abstract": " Title: Robust Hybrid Learning With Expert Augmentation ",
    "url": "https://arxiv.org/abs/2202.03881",
    "authors": [
      "Antoine Wehenkel",
      "Jens Behrmann",
      "Hsiang Hsu",
      "Guillermo Sapiro",
      "Gilles Louppe",
      "Jörn-Henrik Jacobsen"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2203.09829",
    "title": "Representative Subset Selection for Efficient Fine-Tuning in  Self-Supervised Speech Recognition",
    "abstract": " Comments: 16 pages, 8 figures ",
    "url": "https://arxiv.org/abs/2203.09829",
    "authors": [
      "Abdul Hameed Azeemi",
      "Ihsan Ayyub Qazi",
      "Agha Ali Raza"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2203.14205",
    "title": "Recent Few-Shot Object Detection Algorithms: A Survey with Performance  Comparison",
    "abstract": " Comments: 35 pages, 14 figures ",
    "url": "https://arxiv.org/abs/2203.14205",
    "authors": [
      "Tianying Liu",
      "Lu Zhang",
      "Yang Wang",
      "Jihong Guan",
      "Yanwei Fu",
      "Jiajia Zhao",
      "Shuigeng Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.16711",
    "title": "Analytic theory for the dynamics of wide quantum neural networks",
    "abstract": " Comments: 37 pages, many figures. v2, v3: adding learning supervised perspectives and new results, close to published version ",
    "url": "https://arxiv.org/abs/2203.16711",
    "authors": [
      "Junyu Liu",
      "Khadijeh Najafi",
      "Kunal Sharma",
      "Francesco Tacchino",
      "Liang Jiang",
      "Antonio Mezzacapo"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2205.03778",
    "title": "FuDFEND: Fuzzy-domain for Multi-domain Fake News Detection",
    "abstract": " Title: FuDFEND: Fuzzy-domain for Multi-domain Fake News Detection ",
    "url": "https://arxiv.org/abs/2205.03778",
    "authors": [
      "Chaoqi Liang",
      "Yu Zhang",
      "Xinyuan Li",
      "Jinyu Zhang",
      "Yongqi Yu"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2205.10684",
    "title": "Interpreting Neural Min-Sum Decoders",
    "abstract": " Comments: 7 pages, 8 figures, Accepted to IEEE International Conference on Communications (ICC) 2023 ",
    "url": "https://arxiv.org/abs/2205.10684",
    "authors": [
      "Sravan Kumar Ankireddy",
      "Hyeji Kim"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2206.04568",
    "title": "Byzantine-Resilient Decentralized Stochastic Optimization with Robust  Aggregation Rules",
    "abstract": " Title: Byzantine-Resilient Decentralized Stochastic Optimization with Robust  Aggregation Rules ",
    "url": "https://arxiv.org/abs/2206.04568",
    "authors": [
      "Zhaoxian Wu",
      "Tianyi Chen",
      "Qing Ling"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2206.09098",
    "title": "Existence and Minimax Theorems for Adversarial Surrogate Risks in Binary  Classification",
    "abstract": " Comments: 37 pages. version 2: corrects several errors and employs a significantly different proof technique. version 3: modifies the arXiv author list but has no other changes ",
    "url": "https://arxiv.org/abs/2206.09098",
    "authors": [
      "Natalie S. Frank",
      "Jonathan Niles-Weed"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2207.12571",
    "title": "Innovations in Neural Data-to-text Generation: A Survey",
    "abstract": " Title: Innovations in Neural Data-to-text Generation: A Survey ",
    "url": "https://arxiv.org/abs/2207.12571",
    "authors": [
      "Mandar Sharma",
      "Ajay Gogineni",
      "Naren Ramakrishnan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2208.05140",
    "title": "Self-supervised Multi-modal Training from Uncurated Image and Reports  Enables Zero-shot Oversight Artificial Intelligence in Radiology",
    "abstract": " Title: Self-supervised Multi-modal Training from Uncurated Image and Reports  Enables Zero-shot Oversight Artificial Intelligence in Radiology ",
    "url": "https://arxiv.org/abs/2208.05140",
    "authors": [
      "Sangjoon Park",
      "Eun Sun Lee",
      "Kyung Sook Shin",
      "Jeong Eun Lee",
      "Jong Chul Ye"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2208.11543",
    "title": "Evaluating the Planning and Operational Resilience of Electrical  Distribution Systems with Distributed Energy Resources using Complex Network  Theory",
    "abstract": " Title: Evaluating the Planning and Operational Resilience of Electrical  Distribution Systems with Distributed Energy Resources using Complex Network  Theory ",
    "url": "https://arxiv.org/abs/2208.11543",
    "authors": [
      "Divyanshi Dwivedi",
      "Pradeep Kumar Yemula",
      "Mayukha Pal"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)",
      "Applications (stat.AP)",
      "Other Statistics (stat.OT)"
    ]
  },
  {
    "id": "arXiv:2209.00957",
    "title": "Cohomology of the discrete de Rham complex on domains of general  topology",
    "abstract": " Title: Cohomology of the discrete de Rham complex on domains of general  topology ",
    "url": "https://arxiv.org/abs/2209.00957",
    "authors": [
      "Daniele A. Di Pietro",
      "Jérôme Droniou",
      "Silvano Pitassi"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2209.09803",
    "title": "Spillover of Antisocial Behavior from Fringe Platforms: The Unintended  Consequences of Community Banning",
    "abstract": " Comments: accepted at the 16th International Conference on Web and Social Media (ICWSM), please cite accordingly ",
    "url": "https://arxiv.org/abs/2209.09803",
    "authors": [
      "Giuseppe Russo",
      "Luca Verginer",
      "Manoel Horta Ribeiro",
      "Giona Casiraghi"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computation and Language (cs.CL)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2209.10913",
    "title": "How Good Is Neural Combinatorial Optimization? A Systematic Evaluation  on the Traveling Salesman Problem",
    "abstract": " Comments: Accepted by IEEE CIM ",
    "url": "https://arxiv.org/abs/2209.10913",
    "authors": [
      "Shengcai Liu",
      "Yu Zhang",
      "Ke Tang",
      "Xin Yao"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2209.14072",
    "title": "City-scale Incremental Neural Mapping with Three-layer Sampling and  Panoptic Representation",
    "abstract": " Comments: 8 pages, 9 figures ",
    "url": "https://arxiv.org/abs/2209.14072",
    "authors": [
      "Yongliang Shi",
      "Runyi Yang",
      "Pengfei Li",
      "Zirui Wu",
      "Hao Zhao",
      "Guyue Zhou"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2210.02406",
    "title": "Decomposed Prompting: A Modular Approach for Solving Complex Tasks",
    "abstract": " Comments: ICLR'23 Camera Ready ",
    "url": "https://arxiv.org/abs/2210.02406",
    "authors": [
      "Tushar Khot",
      "Harsh Trivedi",
      "Matthew Finlayson",
      "Yao Fu",
      "Kyle Richardson",
      "Peter Clark",
      "Ashish Sabharwal"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2210.10462",
    "title": "Self-supervised Heterogeneous Graph Pre-training Based on Structural  Clustering",
    "abstract": " Comments: Accepted by NeurIPS 2022 ",
    "url": "https://arxiv.org/abs/2210.10462",
    "authors": [
      "Yaming Yang",
      "Ziyu Guan",
      "Zhe Wang",
      "Wei Zhao",
      "Cai Xu",
      "Weigang Lu",
      "Jianbin Huang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2210.16193",
    "title": "M3FGM:a node masking and multi-granularity message passing-based  federated graph model for spatial-temporal data prediction",
    "abstract": " Comments: 16 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2210.16193",
    "authors": [
      "Yuxing Tian",
      "Zheng Liu",
      "Yanwen Qu",
      "Song Li",
      "Jiachi Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2211.15088",
    "title": "Class Adaptive Network Calibration",
    "abstract": " Comments: CVPR 2023. Code: this https URL ",
    "url": "https://arxiv.org/abs/2211.15088",
    "authors": [
      "Bingyuan Liu",
      "Jérôme Rony",
      "Adrian Galdran",
      "Jose Dolz",
      "Ismail Ben Ayed"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.00994",
    "title": "Knowledge Graph Quality Evaluation under Incomplete Information",
    "abstract": " Title: Knowledge Graph Quality Evaluation under Incomplete Information ",
    "url": "https://arxiv.org/abs/2212.00994",
    "authors": [
      "Xiaodong Li",
      "Chenxin Zou",
      "Yi Cai",
      "Yuelong Zhu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.01923",
    "title": "Query-Driven Knowledge Base Completion using Multimodal Path Fusion over  Multimodal Knowledge Graph",
    "abstract": " Title: Query-Driven Knowledge Base Completion using Multimodal Path Fusion over  Multimodal Knowledge Graph ",
    "url": "https://arxiv.org/abs/2212.01923",
    "authors": [
      "Yang Peng"
    ],
    "subjectives": [
      "Databases (cs.DB)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.05309",
    "title": "Soft detection physical layer insecurity",
    "abstract": " Title: Soft detection physical layer insecurity ",
    "url": "https://arxiv.org/abs/2212.05309",
    "authors": [
      "Ken R. Duffy",
      "Muriel Medard"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2212.05699",
    "title": "Multimodal Matching-aware Co-attention Networks with Mutual Knowledge  Distillation for Fake News Detection",
    "abstract": " Title: Multimodal Matching-aware Co-attention Networks with Mutual Knowledge  Distillation for Fake News Detection ",
    "url": "https://arxiv.org/abs/2212.05699",
    "authors": [
      "Linmei Hu",
      "Ziwang Zhao",
      "Weijian Qi",
      "Xuemeng Song",
      "Liqiang Nie"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Multimedia (cs.MM)"
    ]
  },
  {
    "id": "arXiv:2301.03410",
    "title": "In Defense of Structural Symbolic Representation for Video  Event-Relation Prediction",
    "abstract": " Comments: CVPRW 23, Learning with Limited Labelled Data ",
    "url": "https://arxiv.org/abs/2301.03410",
    "authors": [
      "Andrew Lu",
      "Xudong Lin",
      "Yulei Niu",
      "Shih-Fu Chang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.06284",
    "title": "PIGEON: Optimizing CUDA Code Generator for End-to-End Training and  Inference of Relational Graph Neural Networks",
    "abstract": " Comments: This article has been restored after the submitter obtained the authority to grant the license ",
    "url": "https://arxiv.org/abs/2301.06284",
    "authors": [
      "Kun Wu",
      "Mert Hidayetoğlu",
      "Xiang Song",
      "Sitao Huang",
      "Da Zheng",
      "Israt Nisa",
      "Wen-mei Hwu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2301.07805",
    "title": "Multi-target multi-camera vehicle tracking using transformer-based  camera link model and spatial-temporal information",
    "abstract": " Title: Multi-target multi-camera vehicle tracking using transformer-based  camera link model and spatial-temporal information ",
    "url": "https://arxiv.org/abs/2301.07805",
    "authors": [
      "Hsiang-Wei Huang",
      "Cheng-Yen Yang",
      "Jenq-Neng Hwang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2302.05757",
    "title": "Multispectral Contrastive Learning with Viewmaker Networks",
    "abstract": " Comments: Appearing in CVPR-PBVS 2023 ",
    "url": "https://arxiv.org/abs/2302.05757",
    "authors": [
      "Jasmine Bayrooti",
      "Noah Goodman",
      "Alex Tamkin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2302.07731",
    "title": "Combat AI With AI: Counteract Machine-Generated Fake Restaurant Reviews  on Social Media",
    "abstract": " Comments: Preprint version of the Paper submitted to KDD2023. 13 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2302.07731",
    "authors": [
      "Alessandro Gambetti",
      "Qiwei Han"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.11044",
    "title": "The Target-Charging Technique for Privacy Accounting across Interactive  Computations",
    "abstract": " Title: The Target-Charging Technique for Privacy Accounting across Interactive  Computations ",
    "url": "https://arxiv.org/abs/2302.11044",
    "authors": [
      "Edith Cohen",
      "Xin Lyu"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2303.04150",
    "title": "Evolutionary Reinforcement Learning: A Survey",
    "abstract": " Title: Evolutionary Reinforcement Learning: A Survey ",
    "url": "https://arxiv.org/abs/2303.04150",
    "authors": [
      "Hui Bai",
      "Ran Cheng",
      "Yaochu Jin"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.07771",
    "title": "Imbalanced Domain Generalization for Robust Single Cell Classification  in Hematological Cytomorphology",
    "abstract": " Comments: Published as a ICLR 2023 workshop paper: What do we need for successful domain generalization? ",
    "url": "https://arxiv.org/abs/2303.07771",
    "authors": [
      "Rao Muhammad Umer",
      "Armin Gruber",
      "Sayedali Shetab Boushehri",
      "Christian Metak",
      "Carsten Marr"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.08416",
    "title": "Lung Nodule Segmentation and Low-Confidence Region Prediction with  Uncertainty-Aware Attention Mechanism",
    "abstract": " Comments: 10 pages, 10 figures. We have reported a preliminary version of this work in MICCAI 2022 ",
    "url": "https://arxiv.org/abs/2303.08416",
    "authors": [
      "Han Yang",
      "Qiuli Wang",
      "Yue Zhang",
      "Zhulin An",
      "Chen Liu",
      "Xiaohong Zhang",
      "S. Kevin Zhou"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.11754",
    "title": "Projections of Model Spaces for Latent Graph Inference",
    "abstract": " Comments: Accepted at the ICLR 2023 Workshop on Physics for Machine Learning ",
    "url": "https://arxiv.org/abs/2303.11754",
    "authors": [
      "Haitz Sáez de Ocáriz Borde",
      "Álvaro Arroyo",
      "Ingmar Posner"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.14564",
    "title": "Compositional Neural Certificates for Networked Dynamical Systems",
    "abstract": " Comments: 25 pages, 8 figures; Accepted by 5th Annual Learning for Dynamics & Control Conference (L4DC) 2023 ",
    "url": "https://arxiv.org/abs/2303.14564",
    "authors": [
      "Songyuan Zhang",
      "Yumeng Xiu",
      "Guannan Qu",
      "Chuchu Fan"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2303.14897",
    "title": "Seer: Language Instructed Video Prediction with Latent Diffusion Models",
    "abstract": " Comments: 17 pages, 15 figures ",
    "url": "https://arxiv.org/abs/2303.14897",
    "authors": [
      "Xianfan Gu",
      "Chuan Wen",
      "Jiaming Song",
      "Yang Gao"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2303.17249",
    "title": "Model-agnostic explainable artificial intelligence for object detection  in image data",
    "abstract": " Title: Model-agnostic explainable artificial intelligence for object detection  in image data ",
    "url": "https://arxiv.org/abs/2303.17249",
    "authors": [
      "Milad Moradi",
      "Ke Yan",
      "David Colwell",
      "Matthias Samwald",
      "Rhona Asgari"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.01890",
    "title": "Sociocultural knowledge is needed for selection of shots in hate speech  detection tasks",
    "abstract": " Title: Sociocultural knowledge is needed for selection of shots in hate speech  detection tasks ",
    "url": "https://arxiv.org/abs/2304.01890",
    "authors": [
      "Antonis Maronikolakis",
      "Abdullatif Köksal",
      "Hinrich Schütze"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.02834",
    "title": "Probing the Purview of Neural Networks via Gradient Analysis",
    "abstract": " Comments: Published in IEEE Access. 17 pages, 6 figures ",
    "url": "https://arxiv.org/abs/2304.02834",
    "authors": [
      "Jinsol Lee",
      "Charlie Lehman",
      "Mohit Prabhushankar",
      "Ghassan AlRegib"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.03198",
    "title": "RFAConv: Innovating Spatital Attention and Standard Convolutional  Operation",
    "abstract": " Comments: 14 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2304.03198",
    "authors": [
      "Xin Zhang",
      "Chen Liu",
      "Degang Yang",
      "Tingting Song",
      "Yichen Ye",
      "Ke Li",
      "Yingze Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.04175",
    "title": "Token Boosting for Robust Self-Supervised Visual Transformer  Pre-training",
    "abstract": " Comments: Accepted to CVPR 2023 ",
    "url": "https://arxiv.org/abs/2304.04175",
    "authors": [
      "Tianjiao Li",
      "Lin Geng Foo",
      "Ping Hu",
      "Xindi Shang",
      "Hossein Rahmani",
      "Zehuan Yuan",
      "Jun Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.04468",
    "title": "Toward Cohort Intelligence: A Universal Cohort Representation Learning  Framework for Electronic Health Record Analysis",
    "abstract": " Comments: 10 pages ",
    "url": "https://arxiv.org/abs/2304.04468",
    "authors": [
      "Changshuo Liu",
      "Wenqiao Zhang",
      "Beng Chin Ooi",
      "James Wei Luen Yip",
      "Lingze Zeng",
      "Kaiping Zheng"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.04546",
    "title": "Kinship Representation Learning with Face Componential Relation",
    "abstract": " Title: Kinship Representation Learning with Face Componential Relation ",
    "url": "https://arxiv.org/abs/2304.04546",
    "authors": [
      "Weng-Tai Su",
      "Min-Hung Chen",
      "Chien-Yi Wang",
      "Shang-Hong Lai",
      "Trista Pei-Chun Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.04964",
    "title": "A priori compression of convolutional neural networks for wave  simulators",
    "abstract": " Title: A priori compression of convolutional neural networks for wave  simulators ",
    "url": "https://arxiv.org/abs/2304.04964",
    "authors": [
      "Hamza Boukraichi",
      "Nissrine Akkari",
      "Fabien Casenave",
      "David Ryckelynck"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2304.05294",
    "title": "Selecting Robust Features for Machine Learning Applications using  Multidata Causal Discovery",
    "abstract": " Comments: 11 pages, 4 figures, 1 table, Supporting Information, Accepted for an oral presentation at the Climate Informatics 2023 ",
    "url": "https://arxiv.org/abs/2304.05294",
    "authors": [
      "Saranya Ganesh S.",
      "Tom Beucler",
      "Frederick Iat-Hin Tam",
      "Milton S. Gomez",
      "Jakob Runge",
      "Andreas Gerhardus"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Atmospheric and Oceanic Physics (physics.ao-ph)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2304.05370",
    "title": "Overload: Latency Attacks on Object Detection for Edge Devices",
    "abstract": " Title: Overload: Latency Attacks on Object Detection for Edge Devices ",
    "url": "https://arxiv.org/abs/2304.05370",
    "authors": [
      "Erh-Chung Chen",
      "Pin-Yu Chen",
      "I-Hsin Chung",
      "Che-rung Lee"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]