[
  {
    "id": "arXiv:2204.03676",
    "title": "cyberaCTIve: a STIX-based Tool for Cyber Threat Intelligence in Complex  Models",
    "abstract": "Cyber threat intelligence (CTI) is practical real-world information that is collected with the purpose of assessing threats in cyber-physical systems (CPS). A practical notation for sharing CTI is STIX. STIX offers facilities to create, visualise and share models; however, even a moderately simple project can be represented in STIX as a quite complex graph, suggesting to spread CTI across multiple simpler sub-projects. Our tool aims to enhance the STIX-based modelling task in contexts when such simplifications are infeasible. Examples can be the microgrid and, more in general, the smart grid. ",
    "url": "https://arxiv.org/abs/2204.03676",
    "authors": [
      "Ricardo M. Czekster",
      "Roberto Metere",
      "Charles Morisset"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.03694",
    "title": "Adaptive-Gravity: A Defense Against Adversarial Samples",
    "abstract": "This paper presents a novel model training solution, denoted as Adaptive-Gravity, for enhancing the robustness of deep neural network classifiers against adversarial examples. We conceptualize the model parameters/features associated with each class as a mass characterized by its centroid location and the spread (standard deviation of the distance) of features around the centroid. We use the centroid associated with each cluster to derive an anti-gravity force that pushes the centroids of different classes away from one another during network training. Then we customized an objective function that aims to concentrate each class's features toward their corresponding new centroid, which has been obtained by anti-gravity force. This methodology results in a larger separation between different masses and reduces the spread of features around each centroid. As a result, the samples are pushed away from the space that adversarial examples could be mapped to, effectively increasing the degree of perturbation needed for making an adversarial example. We have implemented this training solution as an iterative method consisting of four steps at each iteration: 1) centroid extraction, 2) anti-gravity force calculation, 3) centroid relocation, and 4) gravity training. Gravity's efficiency is evaluated by measuring the corresponding fooling rates against various attack models, including FGSM, MIM, BIM, and PGD using LeNet and ResNet110 networks, benchmarked against MNIST and CIFAR10 classification problems. Test results show that Gravity not only functions as a powerful instrument to robustify a model against state-of-the-art adversarial attacks but also effectively improves the model training accuracy. ",
    "url": "https://arxiv.org/abs/2204.03694",
    "authors": [
      "Ali Mirzaeian",
      "Zhi Tian",
      "Sai Manoj P D",
      "Banafsheh S. Latibari",
      "Ioannis Savidis",
      "Houman Homayoun",
      "Avesta Sasan"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03696",
    "title": "Flat Folding an Unassigned Single-Vertex Complex (Combinatorially  Embedded Planar Graph with Specified Edge Lengths) without Flat Angles",
    "abstract": "A foundational result in origami mathematics is Kawasaki and Justin's simple, efficient characterization of flat foldability for unassigned single-vertex crease patterns (where each crease can fold mountain or valley) on flat material. This result was later generalized to cones of material, where the angles glued at the single vertex may not sum to $360^\\circ$. Here we generalize these results to when the material forms a complex (instead of a manifold), and thus the angles are glued at the single vertex in the structure of an arbitrary planar graph (instead of a cycle). Like the earlier characterizations, we require all creases to fold mountain or valley, not remain unfolded flat; otherwise, the problem is known to be NP-complete (weakly for flat material and strongly for complexes). Equivalently, we efficiently characterize which combinatorially embedded planar graphs with prescribed edge lengths can fold flat, when all angles must be mountain or valley (not unfolded flat). Our algorithm runs in $O(n \\log^3 n)$ time, improving on the previous best algorithm of $O(n^2 \\log n)$. ",
    "url": "https://arxiv.org/abs/2204.03696",
    "authors": [
      "Lily Chung",
      "Erik D. Demaine",
      "Dylan Hendrickson",
      "Victor Luo"
    ],
    "subjectives": [
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2204.03714",
    "title": "Using Multiple Self-Supervised Tasks Improves Model Robustness",
    "abstract": "Deep networks achieve state-of-the-art performance on computer vision tasks, yet they fail under adversarial attacks that are imperceptible to humans. In this paper, we propose a novel defense that can dynamically adapt the input using the intrinsic structure from multiple self-supervised tasks. By simultaneously using many self-supervised tasks, our defense avoids over-fitting the adapted image to one specific self-supervised task and restores more intrinsic structure in the image compared to a single self-supervised task approach. Our approach further improves robustness and clean accuracy significantly compared to the state-of-the-art single task self-supervised defense. Our work is the first to connect multiple self-supervised tasks to robustness, and suggests that we can achieve better robustness with more intrinsic signal from visual data. ",
    "url": "https://arxiv.org/abs/2204.03714",
    "authors": [
      "Matthew Lawhon",
      "Chengzhi Mao",
      "Junfeng Yang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03722",
    "title": "Automated Design of Salient Object Detection Algorithms with Brain  Programming",
    "abstract": "Despite recent improvements in computer vision, artificial visual systems' design is still daunting since an explanation of visual computing algorithms remains elusive. Salient object detection is one problem that is still open due to the difficulty of understanding the brain's inner workings. Progress on this research area follows the traditional path of hand-made designs using neuroscience knowledge. In recent years two different approaches based on genetic programming appear to enhance their technique. One follows the idea of combining previous hand-made methods through genetic programming and fuzzy logic. The other approach consists of improving the inner computational structures of basic hand-made models through artificial evolution. This research work proposes expanding the artificial dorsal stream using a recent proposal to solve salient object detection problems. This approach uses the benefits of the two main aspects of this research area: fixation prediction and detection of salient objects. We decided to apply the fusion of visual saliency and image segmentation algorithms as a template. The proposed methodology discovers several critical structures in the template through artificial evolution. We present results on a benchmark designed by experts with outstanding results in comparison with the state-of-the-art. ",
    "url": "https://arxiv.org/abs/2204.03722",
    "authors": [
      "Gustavo Olague",
      "Jose Armando Menendez-Clavijo",
      "Matthieu Olague",
      "Arturo Ocampo",
      "Gerardo Ibarra-Vazquez",
      "Rocio Ochoa",
      "Roberto Pineda"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.03725",
    "title": "T4PdM: a Deep Neural Network based on the Transformer Architecture for  Fault Diagnosis of Rotating Machinery",
    "abstract": "Deep learning and big data algorithms have become widely used in industrial applications to optimize several tasks in many complex systems. Particularly, deep learning model for diagnosing and prognosing machinery health has leveraged predictive maintenance (PdM) to be more accurate and reliable in decision making, in this way avoiding unnecessary interventions, machinery accidents, and environment catastrophes. Recently, Transformer Neural Networks have gained notoriety and have been increasingly the favorite choice for Natural Language Processing (NLP) tasks. Thus, given their recent major achievements in NLP, this paper proposes the development of an automatic fault classifier model for predictive maintenance based on a modified version of the Transformer architecture, namely T4PdM, to identify multiple types of faults in rotating machinery. Experimental results are developed and presented for the MaFaulDa and CWRU databases. T4PdM was able to achieve an overall accuracy of 99.98% and 98% for both datasets, respectively. In addition, the performance of the proposed model is compared to other previously published works. It has demonstrated the superiority of the model in detecting and classifying faults in rotating industrial machinery. Therefore, the proposed Transformer-based model can improve the performance of machinery fault analysis and diagnostic processes and leverage companies to a new era of the Industry 4.0. In addition, this methodology can be adapted to any other task of time series classification. ",
    "url": "https://arxiv.org/abs/2204.03725",
    "authors": [
      "Erick Giovani Sperandio Nascimento",
      "Julian Santana Liang",
      "Ilan Sousa Figueiredo",
      "Lilian Lefol Nani Guarieiro"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03726",
    "title": "Decentralized Event-Triggered Federated Learning with Heterogeneous  Communication Thresholds",
    "abstract": "A recent emphasis of distributed learning research has been on federated learning (FL), in which model training is conducted by the data-collecting devices. Existing research on FL has mostly focused on a star topology learning architecture with synchronized (time-triggered) model training rounds, where the local models of the devices are periodically aggregated by a centralized coordinating node. However, in many settings, such a coordinating node may not exist, motivating efforts to fully decentralize FL. In this work, we propose a novel methodology for distributed model aggregations via asynchronous, event-triggered consensus iterations over the network graph topology. We consider heterogeneous communication event thresholds at each device that weigh the change in local model parameters against the available local resources in deciding the benefit of aggregations at each iteration. Through theoretical analysis, we demonstrate that our methodology achieves asymptotic convergence to the globally optimal learning model under standard assumptions in distributed learning and graph consensus literature, and without restrictive connectivity requirements on the underlying topology. Subsequent numerical results demonstrate that our methodology obtains substantial improvements in communication requirements compared with FL baselines. ",
    "url": "https://arxiv.org/abs/2204.03726",
    "authors": [
      "Shahryar Zehtabi",
      "Seyyedali Hosseinalipour",
      "Christopher G. Brinton"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03740",
    "title": "Successes and critical failures of neural networks in capturing  human-like speech recognition",
    "abstract": "Natural and artificial audition can in principle evolve different solutions to a given problem. The constraints of the task, however, can nudge the cognitive science and engineering of audition to qualitatively converge, suggesting that a closer mutual examination would improve artificial hearing systems and process models of the mind and brain. Speech recognition - an area ripe for such exploration - is inherently robust in humans to a number transformations at various spectrotemporal granularities. To what extent are these robustness profiles accounted for by high-performing neural network systems? We bring together experiments in speech recognition under a single synthesis framework to evaluate state-of-the-art neural networks as stimulus-computable, optimized observers. In a series of experiments, we (1) clarify how influential speech manipulations in the literature relate to each other and to natural speech, (2) show the granularities at which machines exhibit out-of-distribution robustness, reproducing classical perceptual phenomena in humans, (3) identify the specific conditions where model predictions of human performance differ, and (4) demonstrate a crucial failure of all artificial systems to perceptually recover where humans do, suggesting a key specification for theory and model building. These findings encourage a tighter synergy between the cognitive science and engineering of audition. ",
    "url": "https://arxiv.org/abs/2204.03740",
    "authors": [
      "Federico Adolfi",
      "Jeffrey S. Bowers",
      "David Poeppel"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Artificial Intelligence (cs.AI)",
      "Audio and Speech Processing (eess.AS)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2204.03743",
    "title": "Automatic inference of fault tree models via multi-objective  evolutionary algorithms",
    "abstract": "Fault tree analysis is a well-known technique in reliability engineering and risk assessment, which supports decision-making processes and the management of complex systems. Traditionally, fault tree (FT) models are built manually together with domain experts, considered a time-consuming process prone to human errors. With Industry 4.0, there is an increasing availability of inspection and monitoring data, making techniques that enable knowledge extraction from large data sets relevant. Thus, our goal with this work is to propose a data-driven approach to infer efficient FT structures that achieve a complete representation of the failure mechanisms contained in the failure data set without human intervention. Our algorithm, the FT-MOEA, based on multi-objective evolutionary algorithms, enables the simultaneous optimization of different relevant metrics such as the FT size, the error computed based on the failure data set and the Minimal Cut Sets. Our results show that, for six case studies from the literature, our approach successfully achieved automatic, efficient, and consistent inference of the associated FT models. We also present the results of a parametric analysis that tests our algorithm for different relevant conditions that influence its performance, as well as an overview of the data-driven methods used to automatically infer FT models. ",
    "url": "https://arxiv.org/abs/2204.03743",
    "authors": [
      "Lisandro A. Jimenez-Roa",
      "Tom Heskes",
      "Tiedo Tinga",
      "Marielle Stoelinga"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.03748",
    "title": "Energy self-sufficient systems for monitoring sewer networks",
    "abstract": "Underground infrastructure networks form the backbone of vital supply and disposal systems. However, they are under-monitored in comparison to their value. This is due, in large part, to the lack of energy supply for monitoring and data transmission. In this paper, we investigate a novel, energy harvesting system used to power underground sewer infrastructure monitoring networks. The system collects the required energy from ambient sources, such as temperature differences or residual light in sewer networks. A prototype was developed that could use either a thermoelectric generator (TEG) or a solar cell to capture the energy needed to acquire and transmit ultrasonic water level data via LoRaWAN. Real-world field trials were satisfactory and showed the potential power output, as well as, possibilities to improve the system. Using an extrapolation model, we proved that the developed solution could work reliably throughout the year. ",
    "url": "https://arxiv.org/abs/2204.03748",
    "authors": [
      "Simon Mathis",
      "Juan-Mario Gruber",
      "Christian Ebi",
      "Simon Bloem",
      "Jörg Rieckermann",
      "Frank Blumensaat"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.03758",
    "title": "Compositional Generalization and Decomposition in Neural Program  Synthesis",
    "abstract": "When writing programs, people have the ability to tackle a new complex task by decomposing it into smaller and more familiar subtasks. While it is difficult to measure whether neural program synthesis methods have similar capabilities, what we can measure is whether they compositionally generalize, that is, whether a model that has been trained on the simpler subtasks is subsequently able to solve more complex tasks. In this paper, we focus on measuring the ability of learned program synthesizers to compositionally generalize. We first characterize several different axes along which program synthesis methods would be desired to generalize, e.g., length generalization, or the ability to combine known subroutines in new ways that do not occur in the training data. Based on this characterization, we introduce a benchmark suite of tasks to assess these abilities based on two popular existing datasets, SCAN and RobustFill. Finally, we make first attempts to improve the compositional generalization ability of Transformer models along these axes through novel attention mechanisms that draw inspiration from a human-like decomposition strategy. Empirically, we find our modified Transformer models generally perform better than natural baselines, but the tasks remain challenging. ",
    "url": "https://arxiv.org/abs/2204.03758",
    "authors": [
      "Kensen Shi",
      "Joey Hong",
      "Manzil Zaheer",
      "Pengcheng Yin",
      "Charles Sutton"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Programming Languages (cs.PL)"
    ]
  },
  {
    "id": "arXiv:2204.03768",
    "title": "Global ECG Classification by Self-Operational Neural Networks with  Feature Injection",
    "abstract": "Objective: Global (inter-patient) ECG classification for arrhythmia detection over Electrocardiogram (ECG) signal is a challenging task for both humans and machines. The main reason is the significant variations of both normal and arrhythmic ECG patterns among patients. Automating this process with utmost accuracy is, therefore, highly desirable due to the advent of wearable ECG sensors. However, even with numerous deep learning approaches proposed recently, there is still a notable gap in the performance of global and patient-specific ECG classification performances. This study proposes a novel approach to narrow this gap and propose a real-time solution with shallow and compact 1D Self-Organized Operational Neural Networks (Self-ONNs). Methods: In this study, we propose a novel approach for inter-patient ECG classification using a compact 1D Self-ONN by exploiting morphological and timing information in heart cycles. We used 1D Self-ONN layers to automatically learn morphological representations from ECG data, enabling us to capture the shape of the ECG waveform around the R peaks. We further inject temporal features based on RR interval for timing characterization. The classification layers can thus benefit from both temporal and learned features for the final arrhythmia classification. Results: Using the MIT-BIH arrhythmia benchmark database, the proposed method achieves the highest classification performance ever achieved, i.e., 99.21% precision, 99.10% recall, and 99.15% F1-score for normal (N) segments; 82.19% precision, 82.50% recall, and 82.34% F1-score for the supra-ventricular ectopic beat (SVEBs); and finally, 94.41% precision, 96.10% recall, and 95.2% F1-score for the ventricular-ectopic beats (VEBs). ",
    "url": "https://arxiv.org/abs/2204.03768",
    "authors": [
      "Muhammad Uzair Zahid",
      "Serkan Kiranyaz",
      "Moncef Gabbouj"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03779",
    "title": "Autoencoder-based Unsupervised Intrusion Detection using Multi-Scale  Convolutional Recurrent Networks",
    "abstract": "The massive growth of network traffic data leads to a large volume of datasets. Labeling these datasets for identifying intrusion attacks is very laborious and error-prone. Furthermore, network traffic data have complex time-varying non-linear relationships. The existing state-of-the-art intrusion detection solutions use a combination of various supervised approaches along with fused features subsets based on correlations in traffic data. These solutions often require high computational cost, manual support in fine-tuning intrusion detection models, and labeling of data that limit real-time processing of network traffic. Unsupervised solutions do reduce computational complexities and manual support for labeling data but current unsupervised solutions do not consider spatio-temporal correlations in traffic data. To address this, we propose a unified Autoencoder based on combining multi-scale convolutional neural network and long short-term memory (MSCNN-LSTM-AE) for anomaly detection in network traffic. The model first employs Multiscale Convolutional Neural Network Autoencoder (MSCNN-AE) to analyze the spatial features of the dataset, and then latent space features learned from MSCNN-AE employs Long Short-Term Memory (LSTM) based Autoencoder Network to process the temporal features. Our model further employs two Isolation Forest algorithms as error correction mechanisms to detect false positives and false negatives to improve detection accuracy. %Additionally, covariance matrices forms a Riemannian manifold that is naturally embedded with distance metrices that facilitates descriminative patterns for detecting malicious network traffic. We evaluated our model NSL-KDD, UNSW-NB15, and CICDDoS2019 dataset and showed our proposed method significantly outperforms the conventional unsupervised methods and other existing studies on the dataset. ",
    "url": "https://arxiv.org/abs/2204.03779",
    "authors": [
      "Amardeep Singh",
      "Julian Jang-Jaccard"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.03795",
    "title": "Semantic Representation and Dependency Learning for Multi-Label Image  Recognition",
    "abstract": "Recently many multi-label image recognition (MLR) works have made significant progress by introducing pre-trained object detection models to generate lots of proposals or utilizing statistical label co-occurrence enhance the correlation among different categories. However, these works have some limitations: (1) the effectiveness of the network significantly depends on pre-trained object detection models that bring expensive and unaffordable computation; (2) the network performance degrades when there exist occasional co-occurrence objects in images, especially for the rare categories. To address these problems, we propose a novel and effective semantic representation and dependency learning (SRDL) framework to learn category-specific semantic representation for each category and capture semantic dependency among all categories. Specifically, we design a category-specific attentional regions (CAR) module to generate channel/spatial-wise attention matrices to guide model to focus on semantic-aware regions. We also design an object erasing (OE) module to implicitly learn semantic dependency among categories by erasing semantic-aware regions to regularize the network training. Extensive experiments and comparisons on two popular MLR benchmark datasets (i.e., MS-COCO and Pascal VOC 2007) demonstrate the effectiveness of the proposed framework over current state-of-the-art algorithms. ",
    "url": "https://arxiv.org/abs/2204.03795",
    "authors": [
      "Tao Pu",
      "Lixian Yuan",
      "Hefeng Wu",
      "Tianshui Chen",
      "Ling Tian",
      "Liang Lin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03802",
    "title": "Stochastic Geometry-Based Low Latency Routing in Massive LEO Satellite  Networks",
    "abstract": "In this paper, the routing in massive low earth orbit (LEO) satellite networks is studied. When the satellite-to-satellite communication distance is limited, we choose different relay satellites to minimize the latency in a constellation at a constant altitude. Firstly, the global optimum solution is obtained in the ideal scenario when there are available satellites at all the ideal locations. Next, we propose a nearest neighbor search algorithm for realistic (non-ideal) scenarios with a limited number of satellites. The proposed algorithm can approach the global optimum solution under an ideal scenario through a finite number of iterations and a tiny range of searches. Compared with other routing strategies, the proposed algorithm shows significant advantages in terms of latency. Furthermore, we provide two approximation techniques that can give tight lower and upper bounds for the latency of the proposed algorithm, respectively. Finally, the relationships between latency and constellation height, satellites' number, and communication distance are investigated. ",
    "url": "https://arxiv.org/abs/2204.03802",
    "authors": [
      "Ruibo Wang",
      "Mustafa A. Kishk",
      "Mohamed-Slim Alouini"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2204.03827",
    "title": "IA-GCN: Interactive Graph Convolutional Network for Recommendation",
    "abstract": "Recently, Graph Convolutional Network (GCN) has become a novel state-of-art for Collaborative Filtering (CF) based Recommender Systems (RS). It is a common practice to learn informative user and item representations by performing embedding propagation on a user-item bipartite graph, and then provide the users with personalized item suggestions based on the representations. Despite effectiveness, existing algorithms neglect precious interactive features between user-item pairs in the embedding process. When predicting a user's preference for different items, they still aggregate the user tree in the same way, without emphasizing target-related information in the user neighborhood. Such a uniform aggregation scheme easily leads to suboptimal user and item representations, limiting the model expressiveness to some extent. In this work, we address this problem by building bilateral interactive guidance between each user-item pair and proposing a new model named IA-GCN (short for InterActive GCN). Specifically, when learning the user representation from its neighborhood, we assign higher attention weights to those neighbors similar to the target item. Correspondingly, when learning the item representation, we pay more attention to those neighbors resembling the target user. This leads to interactive and interpretable features, effectively distilling target-specific information through each graph convolutional operation. Our model is built on top of LightGCN, a state-of-the-art GCN model for CF, and can be combined with various GCN-based CF architectures in an end-to-end fashion. Extensive experiments on three benchmark datasets demonstrate the effectiveness and robustness of IA-GCN. ",
    "url": "https://arxiv.org/abs/2204.03827",
    "authors": [
      "Yinan Zhang",
      "Pei Wang",
      "Xiwei Zhao",
      "Hao Qi",
      "Jie He",
      "Junsheng Jin",
      "Changping Peng",
      "Zhangang Lin",
      "Jingping Shao"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.03830",
    "title": "PharmMT: A Neural Machine Translation Approach to Simplify Prescription  Directions",
    "abstract": "The language used by physicians and health professionals in prescription directions includes medical jargon and implicit directives and causes much confusion among patients. Human intervention to simplify the language at the pharmacies may introduce additional errors that can lead to potentially severe health outcomes. We propose a novel machine translation-based approach, PharmMT, to automatically and reliably simplify prescription directions into patient-friendly language, thereby significantly reducing pharmacist workload. We evaluate the proposed approach over a dataset consisting of over 530K prescriptions obtained from a large mail-order pharmacy. The end-to-end system achieves a BLEU score of 60.27 against the reference directions generated by pharmacists, a 39.6% relative improvement over the rule-based normalization. Pharmacists judged 94.3% of the simplified directions as usable as-is or with minimal changes. This work demonstrates the feasibility of a machine translation-based tool for simplifying prescription directions in real-life. ",
    "url": "https://arxiv.org/abs/2204.03830",
    "authors": [
      "Jiazhao Li",
      "Corey Lester",
      "Xinyan Zhao",
      "Yuting Ding",
      "Yun Jiang",
      "V.G.Vinod Vydiswaran"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.03835",
    "title": "LoCI: An Analysis of the Impact of Optical Loss and Crosstalk Noise in  Integrated Silicon-Photonic Neural Networks",
    "abstract": "Compared to electronic accelerators, integrated silicon-photonic neural networks (SP-NNs) promise higher speed and energy efficiency for emerging artificial-intelligence applications. However, a hitherto overlooked problem in SP-NNs is that the underlying silicon photonic devices suffer from intrinsic optical loss and crosstalk noise, the impact of which accumulates as the network scales up. Leveraging precise device-level models, this paper presents the first comprehensive and systematic optical loss and crosstalk modeling framework for SP-NNs. For an SP-NN case study with two hidden layers and 1380 tunable parameters, we show a catastrophic 84% drop in inferencing accuracy due to optical loss and crosstalk noise. ",
    "url": "https://arxiv.org/abs/2204.03835",
    "authors": [
      "Amin Shafiee",
      "Sanmitra Banerjee",
      "Krishnendu Chakrabarty",
      "Sudeep Pasricha",
      "Mahdi Nikdast"
    ],
    "subjectives": [
      "Emerging Technologies (cs.ET)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.03838",
    "title": "Reusing the Task-specific Classifier as a Discriminator:  Discriminator-free Adversarial Domain Adaptation",
    "abstract": "Adversarial learning has achieved remarkable performances for unsupervised domain adaptation (UDA). Existing adversarial UDA methods typically adopt an additional discriminator to play the min-max game with a feature extractor. However, most of these methods failed to effectively leverage the predicted discriminative information, and thus cause mode collapse for generator. In this work, we address this problem from a different perspective and design a simple yet effective adversarial paradigm in the form of a discriminator-free adversarial learning network (DALN), wherein the category classifier is reused as a discriminator, which achieves explicit domain alignment and category distinguishment through a unified objective, enabling the DALN to leverage the predicted discriminative information for sufficient feature alignment. Basically, we introduce a Nuclear-norm Wasserstein discrepancy (NWD) that has definite guidance meaning for performing discrimination. Such NWD can be coupled with the classifier to serve as a discriminator satisfying the K-Lipschitz constraint without the requirements of additional weight clipping or gradient penalty strategy. Without bells and whistles, DALN compares favorably against the existing state-of-the-art (SOTA) methods on a variety of public datasets. Moreover, as a plug-and-play technique, NWD can be directly used as a generic regularizer to benefit existing UDA algorithms. Code is available at https://github.com/xiaoachen98/DALN. ",
    "url": "https://arxiv.org/abs/2204.03838",
    "authors": [
      "Lin Chen",
      "Huaian Chen",
      "Zhixiang Wei",
      "Xin Jin",
      "Xiao Tan",
      "Yi Jin",
      "Enhong Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03839",
    "title": "Infusing Knowledge from Wikipedia to Enhance Stance Detection",
    "abstract": "Stance detection infers a text author's attitude towards a target. This is challenging when the model lacks background knowledge about the target. Here, we show how background knowledge from Wikipedia can help enhance the performance on stance detection. We introduce Wikipedia Stance Detection BERT (WS-BERT) that infuses the knowledge into stance encoding. Extensive results on three benchmark datasets covering social media discussions and online debates indicate that our model significantly outperforms the state-of-the-art methods on target-specific stance detection, cross-target stance detection, and zero/few-shot stance detection. ",
    "url": "https://arxiv.org/abs/2204.03839",
    "authors": [
      "Zihao He",
      "Negar Mokhberian",
      "Kristina Lerman"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.03843",
    "title": "Communication-Efficient Cluster Federated Learning in Large-scale  Peer-to-Peer Networks",
    "abstract": "A traditional federated learning (FL) allows clients to collaboratively train a global model under the coordination of a central server, which sparks great interests in exploiting the private data distributed on clients. However, once the central server suffers from a single point of failure, it will lead to system crash. In addition, FL usually involves a large number of clients, which requires expensive communication costs. These challenges inspire a communication-efficient design of decentralized FL. In this paper, we propose an efficient and privacy-preserving global model training protocol in the context of FL in large-scale peer-to-peer networks, CFL. The proposed CFL protocol aggregates local contributions hierarchically by a cluster-based aggregation mode, as well as a leverged authenticated encryption scheme to ensure the security communication, whose key is distributed by a modified secure communication key establishment protocol. Theoretical analyses show that CFL guarantees the privacy of local model update parameters, as well as integrity and authenticity under the widespread internal semi-honest and external malicious threat models. In particular, the proposed key revocation based on public voting can effectively defense against external adversaries hijacking honest participants to ensure the confidentiality of the communication keys. Moreover, the modified secure communication key establishment protocol indeed achieves high network connectivity probability to ensure transmission security of the system. ",
    "url": "https://arxiv.org/abs/2204.03843",
    "authors": [
      "Yilin Zhou",
      "Qian Chen",
      "Zilong Wang",
      "Dan Xiao",
      "Jiawei Chen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.03850",
    "title": "Resource Consumption for Supporting Federated Learning in Wireless  Networks",
    "abstract": "Federated learning (FL) has recently become one of the hottest focuses in wireless edge networks with the ever-increasing computing capability of user equipment (UE). In FL, UEs train local machine learning models and transmit them to an aggregator, where a global model is formed and then sent back to UEs. In wireless networks, local training and model transmission can be unsuccessful due to constrained computing resources, wireless channel impairments, bandwidth limitations, etc., which degrades FL performance in model accuracy and/or training time. Moreover, we need to quantify the benefits and cost of deploying edge intelligence, as model training and transmission consume certain amount of resources. Therefore, it is imperative to deeply understand the relationship between FL performance and multiple-dimensional resources. In this paper, we construct an analytical model to investigate the relationship between the FL model accuracy and consumed resources in FL empowered wireless edge networks. Based on the analytical model, we explicitly quantify the model accuracy, available computing resources and communication resources. Numerical results validate the effectiveness of our theoretical modeling and analysis, and demonstrate the trade-off between the communication and computing resources for achieving a certain model accuracy. ",
    "url": "https://arxiv.org/abs/2204.03850",
    "authors": [
      "Yi-Jing Liu",
      "Shuang Qin",
      "Yao Sun",
      "Gang Feng"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2204.03858",
    "title": "eGEN: An Energy-saving Modeling Language and Code Generator for  Location-sensing of Mobile Apps",
    "abstract": "The demand for reducing the energy consumption of location-based applications has increased in recent years. The abnormal battery-draining behavior of GPS makes it difficult for the developers to decide on battery optimization during the development phase directly. It will reduce the burden on developers if battery-saving strategies are considered early, and relevant battery-aware code is generated from the design phase artifacts. Therefore, we aim to develop tool support, eGEN, to specify and create native location-based mobile apps. eGEN consists of Domain-specific Modeling Language (DSML) and a code generator for location-sensing. It is developed using Xtext and Xtend as an Eclipse plug-in, and currently, it supports native Android apps. eGEN is evaluated through controlled experiments by instrumenting the generated code in five location-based open-source Android applications. The experimental results show 4.35 minutes of average GPS reduction per hour and 188 mA of average reduction in battery consumption while showing only 97 meters degrade in location accuracy over 3 kilometers of a cycling path. Hence, we believe that code generated by eGEN would help developers to balance between energy and accuracy requirements of location-based applications. The source code, documentation, tool demo video, and tool installation video are available at https://github.com/Kowndinya2000/egen. ",
    "url": "https://arxiv.org/abs/2204.03858",
    "authors": [
      "Kowndinya Boyalakuntla",
      "Marimuthu C",
      "Sridhar Chimalakonda",
      "Chandrasekaran K"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)"
    ]
  },
  {
    "id": "arXiv:2204.03864",
    "title": "Multi-scale temporal network for continuous sign language recognition",
    "abstract": "Continuous Sign Language Recognition (CSLR) is a challenging research task due to the lack of accurate annotation on the temporal sequence of sign language data. The recent popular usage is a hybrid model based on \"CNN + RNN\" for CSLR. However, when extracting temporal features in these works, most of the methods using a fixed temporal receptive field and cannot extract the temporal features well for each sign language word. In order to obtain more accurate temporal features, this paper proposes a multi-scale temporal network (MSTNet). The network mainly consists of three parts. The Resnet and two fully connected (FC) layers constitute the frame-wise feature extraction part. The time-wise feature extraction part performs temporal feature learning by first extracting temporal receptive field features of different scales using the proposed multi-scale temporal block (MST-block) to improve the temporal modeling capability, and then further encoding the temporal features of different scales by the transformers module to obtain more accurate temporal features. Finally, the proposed multi-level Connectionist Temporal Classification (CTC) loss part is used for training to obtain recognition results. The multi-level CTC loss enables better learning and updating of the shallow network parameters in CNN, and the method has no parameter increase and can be flexibly embedded in other models. Experimental results on two publicly available datasets demonstrate that our method can effectively extract sign language features in an end-to-end manner without any prior knowledge, improving the accuracy of CSLR and reaching the state-of-the-art. ",
    "url": "https://arxiv.org/abs/2204.03864",
    "authors": [
      "Qidan Zhu",
      "Jing Li",
      "Fei Yuan",
      "Quan Gan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03865",
    "title": "Spatiotemporal Augmentation on Selective Frequencies for Video  Representation Learning",
    "abstract": "Recent self-supervised video representation learning methods focus on maximizing the similarity between multiple augmented views from the same video and largely rely on the quality of generated views. In this paper, we propose frequency augmentation (FreqAug), a spatio-temporal data augmentation method in the frequency domain for video representation learning. FreqAug stochastically removes undesirable information from the video by filtering out specific frequency components so that learned representation captures essential features of the video for various downstream tasks. Specifically, FreqAug pushes the model to focus more on dynamic features rather than static features in the video via dropping spatial or temporal low-frequency components. In other words, learning invariance between remaining frequency components results in high-frequency enhanced representation with less static bias. To verify the generality of the proposed method, we experiment with FreqAug on multiple self-supervised learning frameworks along with standard augmentations. Transferring the improved representation to five video action recognition and two temporal action localization downstream tasks shows consistent improvements over baselines. ",
    "url": "https://arxiv.org/abs/2204.03865",
    "authors": [
      "Jinhyung Kim",
      "Taeoh Kim",
      "Minho Shim",
      "Dongyoon Han",
      "Dongyoon Wee",
      "Junmo Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03873",
    "title": "Spatial Transformer Network on Skeleton-based Gait Recognition",
    "abstract": "Skeleton-based gait recognition models usually suffer from the robustness problem, as the Rank-1 accuracy varies from 90\\% in normal walking cases to 70\\% in walking with coats cases. In this work, we propose a state-of-the-art robust skeleton-based gait recognition model called Gait-TR, which is based on the combination of spatial transformer frameworks and temporal convolutional networks. Gait-TR achieves substantial improvements over other skeleton-based gait models with higher accuracy and better robustness on the well-known gait dataset CASIA-B. Particularly in walking with coats cases, Gait-TR get a 90\\% Rank-1 gait recognition accuracy rate, which is higher than the best result of silhouette-based models, which usually have higher accuracy than the silhouette-based gait recognition models. Moreover, our experiment on CASIA-B shows that the spatial transformer can extract gait features from the human skeleton better than the widely used graph convolutional network. ",
    "url": "https://arxiv.org/abs/2204.03873",
    "authors": [
      "Cun Zhang",
      "Xing-Peng Chen",
      "Guo-Qiang Han",
      "Xiang-Jie Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03888",
    "title": "Transducer-based language embedding for spoken language identification",
    "abstract": "The acoustic and linguistic features are important cues for the spoken language identification (LID) task. Recent advanced LID systems mainly use acoustic features that lack the usage of explicit linguistic feature encoding. In this paper, we propose a novel transducer-based language embedding approach for LID tasks by integrating an RNN transducer model into a language embedding framework. Benefiting from the advantages of the RNN transducer's linguistic representation capability, the proposed method can exploit both phonetically-aware acoustic features and explicit linguistic features for LID tasks. Experiments were carried out on the large-scale multilingual LibriSpeech and VoxLingua107 datasets. Experimental results showed the proposed method significantly improves the performance on LID tasks with 12% to 59% and 16% to 24% relative improvement on in-domain and cross-domain datasets, respectively. ",
    "url": "https://arxiv.org/abs/2204.03888",
    "authors": [
      "Peng Shen",
      "Xugang Lu",
      "Hisashi Kawai"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.03897",
    "title": "Sim-to-Real Learning of Robust Compliant Bipedal Locomotion on Torque  Sensor-Less Gear-Driven Humanoid",
    "abstract": "In deep reinforcement learning, sim-to-real is the mainstream method as it needs a large number of trials, however, it is challenging to transfer trained policy due to reality gap. In particular, it is known that the characteristics of actuators in leg robots have a considerable influence on the reality gap, and this is also noticeable in high reduction ratio gears. Therefore, we propose a new simulation model of high reduction ratio gears to reduce the reality gap. The instability of the bipedal locomotion causes the sim-to-real transfer to fail catastrophically, making system identification of the physical parameters of the simulation difficult. Thus, we also propose a system identification method that utilizes the failure experience. The realistic simulations obtained by these improvements allow the robot to perform compliant bipedal locomotion by reinforcement learning. The effectiveness of the method is verified using a actual biped robot, ROBOTIS-OP3, and the sim-to-real transferred policy archived to stabilize the robot under severe disturbances and walk on uneven terrain without force and torque sensors. ",
    "url": "https://arxiv.org/abs/2204.03897",
    "authors": [
      "Shimpei Masuda",
      "Kuniyuki Takahashi"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.03913",
    "title": "Stability of Non-linear Neural Feedback Loops using Sum of Squares",
    "abstract": "Neural network controllers have the potential to improve the performance of feedback systems compared to traditional controllers, due to their ability to act as general function approximators. However, quantifying their safety and robustness properties has proven challenging due to the non-linearities of the activation functions inside the neural network. A key robustness indicator is certifying the stability properties of the feedback system and providing a region of attraction, which has been addressed in previous literature. However, these works only address linear systems or require one to abstract the plant non-linearities and bound them using slope and sector constraints. In this paper we use a Sum of Squares programming framework to compute the stability of non-linear systems with neural network controllers directly. Within this framework, we can propose higher order candidate Lyapunov functions with richer structures that are able to better capture the dynamics of the non-linear system and the nonlinearities in the neural network. We are also able to analyse these systems in continuous time, whereas other methods rely on discretising the system. These higher order Lyapunov functions are used in conjunction with higher order multipliers on the inequality and equality constraints that bound the neural network input-output properties. The volume of the region of attraction computed is increased compared to other methods, allowing for better safety guarantees on the stability of the system. We are also able to easily analyse non-linear polynomial systems, which is not possible to do with other methods. We are also able to conduct robustness analysis on the parameter uncertainty. We show the benefits of our method using numerical examples. ",
    "url": "https://arxiv.org/abs/2204.03913",
    "authors": [
      "Matthew Newton",
      "Antonis Papachristodoulou"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.03916",
    "title": "SuperNet in Neural Architecture Search: A Taxonomic Survey",
    "abstract": "Deep Neural Networks (DNN) have made significant progress in a wide range of visual recognition tasks such as image classification, object detection, and semantic segmentation. The evolution of convolutional architectures has led to better performance by incurring expensive computational costs. In addition, network design has become a difficult task, which is labor-intensive and requires a high level of domain knowledge. To mitigate such issues, there have been studies for a variety of neural architecture search methods that automatically search for optimal architectures, achieving models with impressive performance that outperform human-designed counterparts. This survey aims to provide an overview of existing works in this field of research and specifically focus on the supernet optimization that builds a neural network that assembles all the architectures as its sub models by using weight sharing. We aim to accomplish that by categorizing supernet optimization by proposing them as solutions to the common challenges found in the literature: data-side optimization, poor rank correlation alleviation, and transferable NAS for a number of deployment scenarios. ",
    "url": "https://arxiv.org/abs/2204.03916",
    "authors": [
      "Stephen Cha",
      "Taehyeon Kim",
      "Hayeon Lee",
      "Se-Young Yun"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03919",
    "title": "Network Shuffling: Privacy Amplification via Random Walks",
    "abstract": "Recently, it is shown that shuffling can amplify the central differential privacy guarantees of data randomized with local differential privacy. Within this setup, a centralized, trusted shuffler is responsible for shuffling by keeping the identities of data anonymous, which subsequently leads to stronger privacy guarantees for systems. However, introducing a centralized entity to the originally local privacy model loses some appeals of not having any centralized entity as in local differential privacy. Moreover, implementing a shuffler in a reliable way is not trivial due to known security issues and/or requirements of advanced hardware or secure computation technology. Motivated by these practical considerations, we rethink the shuffle model to relax the assumption of requiring a centralized, trusted shuffler. We introduce network shuffling, a decentralized mechanism where users exchange data in a random-walk fashion on a network/graph, as an alternative of achieving privacy amplification via anonymity. We analyze the threat model under such a setting, and propose distributed protocols of network shuffling that is straightforward to implement in practice. Furthermore, we show that the privacy amplification rate is similar to other privacy amplification techniques such as uniform shuffling. To our best knowledge, among the recently studied intermediate trust models that leverage privacy amplification techniques, our work is the first that is not relying on any centralized entity to achieve privacy amplification. ",
    "url": "https://arxiv.org/abs/2204.03919",
    "authors": [
      "Seng Pei Liew",
      "Tsubasa Takahashi",
      "Shun Takagi",
      "Fumiyuki Kato",
      "Yang Cao",
      "Masatoshi Yoshikawa"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Databases (cs.DB)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03925",
    "title": "Biometric identification by means of hand geometry and a neural net  classifier",
    "abstract": "This Paper describes a hand geometry biometric identification system. We have acquired a database of 22 people using a conventional document scanner. The experimental section consists of a study about the discrimination capability of different extracted features, and the identification rate using different classifiers based on neural networks. ",
    "url": "https://arxiv.org/abs/2204.03925",
    "authors": [
      "Marcos Faundez-Zanuy",
      "Guillermo Mar Navarro Mérida"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03931",
    "title": "HINNPerf: Hierarchical Interaction Neural Network for Performance  Prediction of Configurable Systems",
    "abstract": "Modern software systems are usually highly configurable, providing users with customized functionality through various configuration options. Understanding how system performance varies with different option combinations is important to determine optimal configurations that meet specific requirements. Due to the complex interactions among multiple options and the high cost of performance measurement under a huge configuration space, it is challenging to study how different configurations influence the system performance. To address these challenges, we propose HINNPerf, a novel hierarchical interaction neural network for performance prediction of configurable systems. HINNPerf employs the embedding method and hierarchic network blocks to model the complicated interplay between configuration options, which improves the prediction accuracy of the method. Besides, we devise a hierarchical regularization strategy to enhance the model robustness. Empirical results on 10 real-world configurable systems show that our method statistically significantly outperforms state-of-the-art approaches by achieving average 22.67% improvement in prediction accuracy. In addition, combined with the Integrated Gradients method, the designed hierarchical architecture provides some insights about the interaction complexity and the significance of configuration options, which might help users and developers better understand how the configurable system works and efficiently identify significant options affecting the performance. ",
    "url": "https://arxiv.org/abs/2204.03931",
    "authors": [
      "Jiezhu Cheng",
      "Cuiyun Gao",
      "Zibin Zheng"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.03934",
    "title": "Does Robustness on ImageNet Transfer to Downstream Tasks?",
    "abstract": "As clean ImageNet accuracy nears its ceiling, the research community is increasingly more concerned about robust accuracy under distributional shifts. While a variety of methods have been proposed to robustify neural networks, these techniques often target models trained on ImageNet classification. At the same time, it is a common practice to use ImageNet pretrained backbones for downstream tasks such as object detection, semantic segmentation, and image classification from different domains. This raises a question: Can these robust image classifiers transfer robustness to downstream tasks? For object detection and semantic segmentation, we find that a vanilla Swin Transformer, a variant of Vision Transformer tailored for dense prediction tasks, transfers robustness better than Convolutional Neural Networks that are trained to be robust to the corrupted version of ImageNet. For CIFAR10 classification, we find that models that are robustified for ImageNet do not retain robustness when fully fine-tuned. These findings suggest that current robustification techniques tend to emphasize ImageNet evaluations. Moreover, network architecture is a strong source of robustness when we consider transfer learning. ",
    "url": "https://arxiv.org/abs/2204.03934",
    "authors": [
      "Yutaro Yamada",
      "Mayu Otani"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03935",
    "title": "Study of a committee of neural networks for biometric hand-geometry  recognition",
    "abstract": "This Paper studies different committees of neural networks for biometric pattern recognition. We use the neural nets as classifiers for identification and verification purposes. We show that a committee of nets can improve the recognition rates when compared with a multi-start initialization algo-rithm that just picks up the neural net which offers the best performance. On the other hand, we found that there is no strong correlation between identifi-cation and verification applications using the same classifier. ",
    "url": "https://arxiv.org/abs/2204.03935",
    "authors": [
      "Marcos Faundez-Zanuy"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03951",
    "title": "RuBioRoBERTa: a pre-trained biomedical language model for Russian  language biomedical text mining",
    "abstract": "This paper presents several BERT-based models for Russian language biomedical text mining (RuBioBERT, RuBioRoBERTa). The models are pre-trained on a corpus of freely available texts in the Russian biomedical domain. With this pre-training, our models demonstrate state-of-the-art results on RuMedBench - Russian medical language understanding benchmark that covers a diverse set of tasks, including text classification, question answering, natural language inference, and named entity recognition. ",
    "url": "https://arxiv.org/abs/2204.03951",
    "authors": [
      "Alexander Yalunin",
      "Alexander Nesterov",
      "Dmitriy Umerenkov"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.03954",
    "title": "Bag-of-Words vs. Sequence vs. Graph vs. Hierarchy for Single- and  Multi-Label Text Classification",
    "abstract": "Graph neural networks have triggered a resurgence of graph-based text classification methods, defining today's state of the art. We show that a simple multi-layer perceptron (MLP) using a Bag of Words (BoW) outperforms the recent graph-based models TextGCN and HeteGCN in an inductive text classification setting and is comparable with HyperGAT in single-label classification. We also run our own experiments on multi-label classification, where the simple MLP outperforms the recent sequential-based gMLP and aMLP models. Moreover, we fine-tune a sequence-based BERT and a lightweight DistilBERT model, which both outperform all models on both single-label and multi-label settings in most datasets. These results question the importance of synthetic graphs used in modern text classifiers. In terms of parameters, DistilBERT is still twice as large as our BoW-based wide MLP, while graph-based models like TextGCN require setting up an $\\mathcal{O}(N^2)$ graph, where $N$ is the vocabulary plus corpus size. ",
    "url": "https://arxiv.org/abs/2204.03954",
    "authors": [
      "Andor Diera",
      "Bao Xin Lin",
      "Bhakti Khera",
      "Tim Meuser",
      "Tushar Singhal",
      "Lukas Galke",
      "Ansgar Scherp"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.03969",
    "title": "Disability prediction in multiple sclerosis using performance outcome  measures and demographic data",
    "abstract": "Literature on machine learning for multiple sclerosis has primarily focused on the use of neuroimaging data such as magnetic resonance imaging and clinical laboratory tests for disease identification. However, studies have shown that these modalities are not consistent with disease activity such as symptoms or disease progression. Furthermore, the cost of collecting data from these modalities is high, leading to scarce evaluations. In this work, we used multi-dimensional, affordable, physical and smartphone-based performance outcome measures (POM) in conjunction with demographic data to predict multiple sclerosis disease progression. We performed a rigorous benchmarking exercise on two datasets and present results across 13 clinically actionable prediction endpoints and 6 machine learning models. To the best of our knowledge, our results are the first to show that it is possible to predict disease progression using POMs and demographic data in the context of both clinical trials and smartphone-base studies by using two datasets. Moreover, we investigate our models to understand the impact of different POMs and demographics on model performance through feature ablation studies. We also show that model performance is similar across different demographic subgroups (based on age and sex). To enable this work, we developed an end-to-end reusable pre-processing and machine learning framework which allows quicker experimentation over disparate MS datasets. ",
    "url": "https://arxiv.org/abs/2204.03969",
    "authors": [
      "Subhrajit Roy",
      "Diana Mincu",
      "Lev Proleev",
      "Negar Rostamzadeh",
      "Chintan Ghate",
      "Natalie Harris",
      "Christina Chen",
      "Jessica Schrouff",
      "Nenad Tomasev",
      "Fletcher Lee Hartsell",
      "Katherine Heller"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03998",
    "title": "SnapMode: An Intelligent and Distributed Large-Scale Fashion Image  Retrieval Platform Based On Big Data and Deep Generative Adversarial Network  Technologies",
    "abstract": "Fashion is now among the largest industries worldwide, for it represents human history and helps tell the worlds story. As a result of the Fourth Industrial Revolution, the Internet has become an increasingly important source of fashion information. However, with a growing number of web pages and social data, it is nearly impossible for humans to manually catch up with the ongoing evolution and the continuously variable content in this domain. The proper management and exploitation of big data can pave the way for the substantial growth of the global economy as well as citizen satisfaction. Therefore, computer scientists have found it challenging to handle e-commerce fashion websites by using big data and machine learning technologies. This paper first proposes a scalable focused Web Crawler engine based on the distributed computing platforms to extract and process fashion data on e-commerce websites. The role of the proposed platform is then described in developing a disentangled feature extraction method by employing deep convolutional generative adversarial networks (DCGANs) for content-based image indexing and retrieval. Finally, the state-of-the-art solutions are compared, and the results of the proposed approach are analyzed on a standard dataset. For the real-life implementation of the proposed solution, a Web-based application is developed on Apache Storm, Kafka, Solr, and Milvus platforms to create a fashion search engine called SnapMode. ",
    "url": "https://arxiv.org/abs/2204.03998",
    "authors": [
      "Narges Norouzi",
      "Reza Azmi",
      "Sara Saberi Tehrani Moghadam",
      "Maral Zarvani"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)",
      "Artificial Intelligence (cs.AI)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.04008",
    "title": "Taxonomy of Attacks on Open-Source Software Supply Chains",
    "abstract": "The widespread dependency on open-source software makes it a fruitful target for malicious actors, as demonstrated by recurring attacks. The complexity of today's open-source supply chains results in a significant attack surface, giving attackers numerous opportunities to reach the goal of injecting malicious code into open-source artifacts that is then downloaded and executed by victims. This work proposes a general taxonomy for attacks on open-source supply chains, independent of specific programming languages or ecosystems, and covering all supply chain stages from code contributions to package distribution. Taking the form of an attack tree, it covers 107 unique vectors, linked to 94 real-world incidents, and mapped to 33 mitigating safeguards. User surveys conducted with 17 domain experts and 134 software developers positively validated the correctness, comprehensiveness and comprehensibility of the taxonomy, as well as its suitability for various use-cases. Survey participants also assessed the utility and costs of the identified safeguards, and whether they are used. ",
    "url": "https://arxiv.org/abs/2204.04008",
    "authors": [
      "Piergiorgio Ladisa",
      "Henrik Plate",
      "Matias Martinez",
      "Olivier Barais"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2204.04009",
    "title": "On Projectivity in Markov Logic Networks",
    "abstract": "Markov Logic Networks (MLNs) define a probability distribution on relational structures over varying domain sizes. Many works have noticed that MLNs, like many other relational models, do not admit consistent marginal inference over varying domain sizes. Furthermore, MLNs learnt on a certain domain do not generalize to new domains of varied sizes. In recent works, connections have emerged between domain size dependence, lifted inference and learning from sub-sampled domains. The central idea to these works is the notion of projectivity. The probability distributions ascribed by projective models render the marginal probabilities of sub-structures independent of the domain cardinality. Hence, projective models admit efficient marginal inference, removing any dependence on the domain size. Furthermore, projective models potentially allow efficient and consistent parameter learning from sub-sampled domains. In this paper, we characterize the necessary and sufficient conditions for a two-variable MLN to be projective. We then isolate a special model in this class of MLNs, namely Relational Block Model (RBM). We show that, in terms of data likelihood maximization, RBM is the best possible projective MLN in the two-variable fragment. Finally, we show that RBMs also admit consistent parameter learning over sub-sampled domains. ",
    "url": "https://arxiv.org/abs/2204.04009",
    "authors": [
      "Sagar Malhotra",
      "Luciano Serafini"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.04013",
    "title": "Mel-spectrogram features for acoustic vehicle detection and speed  estimation",
    "abstract": "The paper addresses acoustic vehicle detection and speed estimation from single sensor measurements. We predict the vehicle's pass-by instant by minimizing clipped vehicle-to-microphone distance, which is predicted from the mel-spectrogram of input audio, in a supervised learning approach. In addition, mel-spectrogram-based features are used directly for vehicle speed estimation, without introducing any intermediate features. The results show that the proposed features can be used for accurate vehicle detection and speed estimation, with an average error of 7.87 km/h. If we formulate speed estimation as a classification problem, with a 10 km/h discretization interval, the proposed method attains the average accuracy of 48.7% for correct class prediction and 91.0% when an offset of one class is allowed. The proposed method is evaluated on a dataset of 304 urban-environment on-field recordings of ten different vehicles. ",
    "url": "https://arxiv.org/abs/2204.04013",
    "authors": [
      "Nikola Bulatovic",
      "Slobodan Djukanovic"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.04020",
    "title": "Engagement Detection with Multi-Task Training in E-Learning Environments",
    "abstract": "Recognition of user interaction, in particular engagement detection, became highly crucial for online working and learning environments, especially during the COVID-19 outbreak. Such recognition and detection systems significantly improve the user experience and efficiency by providing valuable feedback. In this paper, we propose a novel Engagement Detection with Multi-Task Training (ED-MTT) system which minimizes mean squared error and triplet loss together to determine the engagement level of students in an e-learning environment. The performance of this system is evaluated and compared against the state-of-the-art on a publicly available dataset as well as videos collected from real-life scenarios. The results show that ED-MTT achieves 6% lower MSE than the best state-of-the-art performance with highly acceptable training time and lightweight feature extraction. ",
    "url": "https://arxiv.org/abs/2204.04020",
    "authors": [
      "Onur Copur",
      "Mert Nakıp",
      "Simone Scardapane",
      "Jürgen Slowack"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.04023",
    "title": "A New Diffusive Representation for Fractional Derivatives and its  Application",
    "abstract": "Diffusive representations of fractional derivatives have proven to be useful tools in the construction of fast and memory efficient numerical methods for solving fractional differential equations. A common challenge in many of the known variants of this approach is that they require the numerical approximation of some integrals over an unbounded integral whose integrand decays rather slowly which implies that their numerical handling is difficult and costly. We present a novel variant of such a diffusive representation. This form also requires the numerical approximation of an integral over an unbounded domain, but the integrand decays much faster. This allows to use well established quadrature rules with much better convergence properties. ",
    "url": "https://arxiv.org/abs/2204.04023",
    "authors": [
      "Kai Diethelm"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2204.04040",
    "title": "Ontology Matching Through Absolute Orientation of Embedding Spaces",
    "abstract": "Ontology matching is a core task when creating interoperable and linked open datasets. In this paper, we explore a novel structure-based mapping approach which is based on knowledge graph embeddings: The ontologies to be matched are embedded, and an approach known as absolute orientation is used to align the two embedding spaces. Next to the approach, the paper presents a first, preliminary evaluation using synthetic and real-world datasets. We find in experiments with synthetic data, that the approach works very well on similarly structured graphs; it handles alignment noise better than size and structural differences in the ontologies. ",
    "url": "https://arxiv.org/abs/2204.04040",
    "authors": [
      "Jan Portisch",
      "Guilherme Costa",
      "Karolin Stefani",
      "Katharina Kreplin",
      "Michael Hladik",
      "Heiko Paulheim"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Databases (cs.DB)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.04042",
    "title": "Checking HateCheck: a cross-functional analysis of behaviour-aware  learning for hate speech detection",
    "abstract": "Behavioural testing -- verifying system capabilities by validating human-designed input-output pairs -- is an alternative evaluation method of natural language processing systems proposed to address the shortcomings of the standard approach: computing metrics on held-out data. While behavioural tests capture human prior knowledge and insights, there has been little exploration on how to leverage them for model training and development. With this in mind, we explore behaviour-aware learning by examining several fine-tuning schemes using HateCheck, a suite of functional tests for hate speech detection systems. To address potential pitfalls of training on data originally intended for evaluation, we train and evaluate models on different configurations of HateCheck by holding out categories of test cases, which enables us to estimate performance on potentially overlooked system properties. The fine-tuning procedure led to improvements in the classification accuracy of held-out functionalities and identity groups, suggesting that models can potentially generalise to overlooked functionalities. However, performance on held-out functionality classes and i.i.d. hate speech detection data decreased, which indicates that generalisation occurs mostly across functionalities from the same class and that the procedure led to overfitting to the HateCheck data distribution. ",
    "url": "https://arxiv.org/abs/2204.04042",
    "authors": [
      "Pedro Henrique Luz de Araujo",
      "Benjamin Roth"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.04043",
    "title": "C-NMT: A Collaborative Inference Framework for Neural Machine  Translation",
    "abstract": "Collaborative Inference (CI) optimizes the latency and energy consumption of deep learning inference through the inter-operation of edge and cloud devices. Albeit beneficial for other tasks, CI has never been applied to the sequence- to-sequence mapping problem at the heart of Neural Machine Translation (NMT). In this work, we address the specific issues of collaborative NMT, such as estimating the latency required to generate the (unknown) output sequence, and show how existing CI methods can be adapted to these applications. Our experiments show that CI can reduce the latency of NMT by up to 44% compared to a non-collaborative approach. ",
    "url": "https://arxiv.org/abs/2204.04043",
    "authors": [
      "Yukai Chen",
      "Roberta Chiaro",
      "Enrico Macii",
      "Massimo Poncino",
      "Daniele Jahier Pagliari"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.04046",
    "title": "KCD: Knowledge Walks and Textual Cues Enhanced Political Perspective  Detection in News Media",
    "abstract": "Political perspective detection has become an increasingly important task that can help combat echo chambers and political polarization. Previous approaches generally focus on leveraging textual content to identify stances, while they fail to reason with background knowledge or leverage the rich semantic and syntactic textual labels in news articles. In light of these limitations, we propose KCD, a political perspective detection approach to enable multi-hop knowledge reasoning and incorporate textual cues as paragraph-level labels. Specifically, we firstly generate random walks on external knowledge graphs and infuse them with news text representations. We then construct a heterogeneous information network to jointly model news content as well as semantic, syntactic and entity cues in news articles. Finally, we adopt relational graph neural networks for graph-level representation learning and conduct political perspective detection. Extensive experiments demonstrate that our approach outperforms state-of-the-art methods on two benchmark datasets. We further examine the effect of knowledge walks and textual cues and how they contribute to our approach's data efficiency. ",
    "url": "https://arxiv.org/abs/2204.04046",
    "authors": [
      "Wenqian Zhang",
      "Shangbin Feng",
      "Zilong Chen",
      "Zhenyu Lei",
      "Jundong Li",
      "Minnan Luo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.04061",
    "title": "\"Am I Private and If So, how Many?\" -- Using Risk Communication Formats  for Making Differential Privacy Understandable",
    "abstract": "Mobility data is essential for cities and communities to identify areas for necessary improvement. Data collected by mobility providers already contains all the information necessary, but privacy of the individuals needs to be preserved. Differential privacy (DP) defines a mathematical property which guarantees that certain limits of privacy are preserved while sharing such data, but its functionality and privacy protection are difficult to explain to laypeople. In this paper, we adapt risk communication formats in conjunction with a model for the privacy risks of DP. The result are privacy notifications which explain the risk to an individual's privacy when using DP, rather than DP's functionality. We evaluate these novel privacy communication formats in a crowdsourced study. We find that they perform similarly to the best performing DP communications used currently in terms of objective understanding, but did not make our participants as confident in their understanding. We also discovered an influence, similar to the Dunning-Kruger effect, of the statistical numeracy on the effectiveness of some of our privacy communication formats and the DP communication format used currently. These results generate hypotheses in multiple directions, for example, toward the use of risk visualization to improve the understandability of our formats or toward adaptive user interfaces which tailor the risk communication to the characteristics of the reader. ",
    "url": "https://arxiv.org/abs/2204.04061",
    "authors": [
      "Daniel Franzen",
      "Saskia Nuñez von Voigt",
      "Peter Sörries",
      "Florian Tschorsch",
      "Claudia Müller-Birn"
    ],
    "subjectives": [
      "Human-Computer Interaction (cs.HC)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2204.04063",
    "title": "Transfer Attacks Revisited: A Large-Scale Empirical Study in Real  Computer Vision Settings",
    "abstract": "One intriguing property of adversarial attacks is their \"transferability\" -- an adversarial example crafted with respect to one deep neural network (DNN) model is often found effective against other DNNs as well. Intensive research has been conducted on this phenomenon under simplistic controlled conditions. Yet, thus far, there is still a lack of comprehensive understanding about transferability-based attacks (\"transfer attacks\") in real-world environments. To bridge this critical gap, we conduct the first large-scale systematic empirical study of transfer attacks against major cloud-based MLaaS platforms, taking the components of a real transfer attack into account. The study leads to a number of interesting findings which are inconsistent to the existing ones, including: (1) Simple surrogates do not necessarily improve real transfer attacks. (2) No dominant surrogate architecture is found in real transfer attacks. (3) It is the gap between posterior (output of the softmax layer) rather than the gap between logit (so-called $\\kappa$ value) that increases transferability. Moreover, by comparing with prior works, we demonstrate that transfer attacks possess many previously unknown properties in real-world environments, such as (1) Model similarity is not a well-defined concept. (2) $L_2$ norm of perturbation can generate high transferability without usage of gradient and is a more powerful source than $L_\\infty$ norm. We believe this work sheds light on the vulnerabilities of popular MLaaS platforms and points to a few promising research directions. ",
    "url": "https://arxiv.org/abs/2204.04063",
    "authors": [
      "Yuhao Mao",
      "Chong Fu",
      "Saizhuo Wang",
      "Shouling Ji",
      "Xuhong Zhang",
      "Zhenguang Liu",
      "Jun Zhou",
      "Alex X. Liu",
      "Raheem Beyah",
      "Ting Wang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.04066",
    "title": "\"Gettr-ing\" Deep Insights from the Social Network Gettr",
    "abstract": "As yet another alternative social network, Gettr positions itself as the \"marketplace of ideas\" where users should expect the truth to emerge without any administrative censorship. We looked deep inside the platform by analyzing it's structure, a sample of 6.8 million posts, and the responses from a sample of 124 Gettr users we interviewed to see if this actually is the case. Administratively, Gettr makes a deliberate attempt to stifle any external evaluation of the platform as collecting data is marred with unpredictable and abrupt changes in their API. Content-wise, Gettr notably hosts pro-Trump content mixed with conspiracy theories and attacks on the perceived \"left.\" It's social network structure is asymmetric and centered around prominent right-thought leaders, which is characteristic for all alt-platforms. While right-leaning users joined Gettr as a result of a perceived freedom of speech infringement by the mainstream platforms, left-leaning users followed them in numbers as to \"keep up with the misinformation.\" We contextualize these findings by looking into the Gettr's user interface design to provide a comprehensive insight into the incentive structure for joining and competing for the truth on Gettr. ",
    "url": "https://arxiv.org/abs/2204.04066",
    "authors": [
      "Filipo Sharevski",
      "Peter Jachim",
      "Emma Pieroni",
      "Amy Devine"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Computers and Society (cs.CY)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2204.04083",
    "title": "POSTER: A Pyramid Cross-Fusion Transformer Network for Facial Expression  Recognition",
    "abstract": "Facial Expression Recognition (FER) has received increasing interest in the computer vision community. As a challenging task, there are three key issues especially prevalent in FER: inter-class similarity, intra-class discrepancy, and scale sensitivity. Existing methods typically address some of these issues, but do not tackle them all in a unified framework. Therefore, in this paper, we propose a two-stream Pyramid crOss-fuSion TransformER network (POSTER) that aims to holistically solve these issues. Specifically, we design a transformer-based cross-fusion paradigm that enables effective collaboration of facial landmark and direct image features to maximize proper attention to salient facial regions. Furthermore, POSTER employs a pyramid structure to promote scale invariance. Extensive experimental results demonstrate that our POSTER outperforms SOTA methods on RAF-DB with 92.05%, FERPlus with 91.62%, AffectNet (7 cls) with 67.31%, and AffectNet (8 cls) with 63.34%, respectively. ",
    "url": "https://arxiv.org/abs/2204.04083",
    "authors": [
      "Ce Zheng",
      "Matias Mendieta",
      "Chen Chen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.04090",
    "title": "Generative Adversarial Method Based On Neural Tangent Kernels",
    "abstract": "The recent development of Generative adversarial networks (GANs) has driven many computer vision applications. Despite the great synthesis quality, training GANs often confronts several issues, including non-convergence, mode collapse, and gradient vanishing. There exist several workarounds, for example, regularizing Lipschitz continuity and adopting Wasserstein distance. Although these methods can partially solve the problems, we argue that the problems are result from modeling the discriminator with deep neural networks. In this paper, we base on newly derived deep neural network theories called Neural Tangent Kernel (NTK) and propose a new generative algorithm called generative adversarial NTK (GA-NTK). The GA-NTK models the discriminator as a Gaussian Process (GP). With the help of the NTK theories, the training dynamics of GA-NTK can be described with a closed-form formula. To synthesize data with the closed-form formula, the objectives can be simplified into a single-level adversarial optimization problem. We conduct extensive experiments on real-world datasets, and the results show that GA-NTK can generate images comparable to those by GANs but is much easier to train under various conditions. We also study the current limitations of GA-NTK and propose some workarounds to make GA-NTK more practical. ",
    "url": "https://arxiv.org/abs/2204.04090",
    "authors": [
      "Yu-Rong Zhang",
      "Sheng Yen Chou",
      "Shan-Hung Wu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.04148",
    "title": "Process Mining on Uncertain Event Data",
    "abstract": "With the widespread adoption of process mining in organizations, the field of process science is seeing an increase in the demand for ad-hoc analysis techniques of non-standard event data. An example of such data are uncertain event data: events characterized by a described and quantified attribute imprecision. This paper outlines a research project aimed at developing process mining techniques able to extract insights from uncertain data. We set the basis for this research topic, recapitulate the available literature, and define a future outlook. ",
    "url": "https://arxiv.org/abs/2204.04148",
    "authors": [
      "Marco Pegoraro"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2204.04149",
    "title": "A Credible and Robust approach to Ego-Motion Estimation using an  Automotive Radar",
    "abstract": "Consistent motion estimation is fundamental for all mobile autonomous systems. While this sounds like an easy task, often, it is not the case because of changing environmental conditions affecting odometry obtained from vision, Lidar, or the wheels themselves. Unsusceptible to challenging lighting and weather conditions, radar sensors are an obvious alternative. Usually, automotive radars return a sparse point cloud, representing the surroundings. Utilizing this information to motion estimation is challenging due to unstable and phantom measurements, which result in a high rate of outliers. We introduce a credible and robust probabilistic approach to estimate the ego-motion based on these challenging radar measurements; intended to be used within a loosely-coupled sensor fusion framework. Compared to existing solutions, evaluated on the popular nuScenes dataset and others, we show that our proposed algorithm is more credible while not depending on explicit correspondence calculation. ",
    "url": "https://arxiv.org/abs/2204.04149",
    "authors": [
      "Karim Haggag",
      "Sven Lange",
      "Tim Pfeifer",
      "Peter Protzel"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2204.04151",
    "title": "A Video Anomaly Detection Framework based on Appearance-Motion Semantics  Representation Consistency",
    "abstract": "Video anomaly detection refers to the identification of events that deviate from the expected behavior. Due to the lack of anomalous samples in training, video anomaly detection becomes a very challenging task. Existing methods almost follow a reconstruction or future frame prediction mode. However, these methods ignore the consistency between appearance and motion information of samples, which limits their anomaly detection performance. Anomalies only occur in the moving foreground of surveillance videos, so the semantics expressed by video frame sequences and optical flow without background information in anomaly detection should be highly consistent and significant for anomaly detection. Based on this idea, we propose Appearance-Motion Semantics Representation Consistency (AMSRC), a framework that uses normal data's appearance and motion semantic representation consistency to handle anomaly detection. Firstly, we design a two-stream encoder to encode the appearance and motion information representations of normal samples and introduce constraints to further enhance the consistency of the feature semantics between appearance and motion information of normal samples so that abnormal samples with low consistency appearance and motion feature representation can be identified. Moreover, the lower consistency of appearance and motion features of anomalous samples can be used to generate predicted frames with larger reconstruction error, which makes anomalies easier to spot. Experimental results demonstrate the effectiveness of the proposed method. ",
    "url": "https://arxiv.org/abs/2204.04151",
    "authors": [
      "Xiangyu Huang",
      "Caidan Zhao",
      "Yilin Wang",
      "Zhiqiang Wu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.04154",
    "title": "EPASAD: Ellipsoid decision boundary based Process-Aware Stealthy Attack  Detector",
    "abstract": "Due to the importance of Critical Infrastructure (CI) in a nation's economy, they have been lucrative targets for cyber attackers. These critical infrastructures are usually Cyber-Physical Systems (CPS) such as power grids, water, and sewage treatment facilities, oil and gas pipelines, etc. In recent times, these systems have suffered from cyber attacks numerous times. Researchers have been developing cyber security solutions for CIs to avoid lasting damages. According to standard frameworks, cyber security based on identification, protection, detection, response, and recovery are at the core of these research. Detection of an ongoing attack that escapes standard protection such as firewall, anti-virus, and host/network intrusion detection has gained importance as such attacks eventually affect the physical dynamics of the system. Therefore, anomaly detection in physical dynamics proves an effective means to implement defense-in-depth. PASAD is one example of anomaly detection in the sensor/actuator data, representing such systems' physical dynamics. We present EPASAD, which improves the detection technique used in PASAD to detect these micro-stealthy attacks, as our experiments show that PASAD's spherical boundary-based detection fails to detect. Our method EPASAD overcomes this by using Ellipsoid boundaries, thereby tightening the boundaries in various dimensions, whereas a spherical boundary treats all dimensions equally. We validate EPASAD using the dataset produced by the TE-process simulator and the C-town datasets. The results show that EPASAD improves PASAD's average recall by 5.8% and 9.5% for the two datasets, respectively. ",
    "url": "https://arxiv.org/abs/2204.04154",
    "authors": [
      "Vikas Maurya",
      "Rachit Agarwal",
      "Saurabh Kumar",
      "Sandeep Kumar Shukla"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.04163",
    "title": "Contextual Representation Learning beyond Masked Language Modeling",
    "abstract": "How do masked language models (MLMs) such as BERT learn contextual representations? In this work, we analyze the learning dynamics of MLMs. We find that MLMs adopt sampled embeddings as anchors to estimate and inject contextual semantics to representations, which limits the efficiency and effectiveness of MLMs. To address these issues, we propose TACO, a simple yet effective representation learning approach to directly model global semantics. TACO extracts and aligns contextual semantics hidden in contextualized representations to encourage models to attend global semantics when generating contextualized representations. Experiments on the GLUE benchmark show that TACO achieves up to 5x speedup and up to 1.2 points average improvement over existing MLMs. The code is available at https://github.com/FUZHIYI/TACO. ",
    "url": "https://arxiv.org/abs/2204.04163",
    "authors": [
      "Zhiyi Fu",
      "Wangchunshu Zhou",
      "Jingjing Xu",
      "Hao Zhou",
      "Lei Li"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.04166",
    "title": "Self-supervised Speaker Diarization",
    "abstract": "Over the last few years, deep learning has grown in popularity for speaker verification, identification, and diarization. Inarguably, a significant part of this success is due to the demonstrated effectiveness of their speaker representations. These, however, are heavily dependent on large amounts of annotated data and can be sensitive to new domains. This study proposes an entirely unsupervised deep-learning model for speaker diarization. Specifically, the study focuses on generating high-quality neural speaker representations without any annotated data, as well as on estimating secondary hyperparameters of the model without annotations. The speaker embeddings are represented by an encoder trained in a self-supervised fashion using pairs of adjacent segments assumed to be of the same speaker. The trained encoder model is then used to self-generate pseudo-labels to subsequently train a similarity score between different segments of the same call using probabilistic linear discriminant analysis (PLDA) and further to learn a clustering stopping threshold. We compared our model to state-of-the-art unsupervised as well as supervised baselines on the CallHome benchmarks. According to empirical results, our approach outperforms unsupervised methods when only two speakers are present in the call, and is only slightly worse than recent supervised models. ",
    "url": "https://arxiv.org/abs/2204.04166",
    "authors": [
      "Yehoshua Dissen",
      "Felix Kreuk",
      "Joseph Keshet"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Machine Learning (cs.LG)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2204.04176",
    "title": "Path Defense in Dynamic Defender-Attacker Blotto Games (dDAB) with  Limited Information",
    "abstract": "We consider a path guarding problem in dynamic Defender-Attacker Blotto games (dDAB), where a team of robots must defend a path in a graph against adversarial agents. Multi-robot systems are particularly well suited to this application, as recent work has shown the effectiveness of these systems in related areas such as perimeter defense and surveillance. When designing a defender policy that guarantees the defense of a path, information about the adversary and the environment can be helpful and may reduce the number of resources required by the defender to achieve a sufficient level of security. In this work, we characterize the necessary and sufficient number of assets needed to guarantee the defense of a shortest path between two nodes in dDAB games when the defender can only detect assets within $k$-hops of a shortest path. By characterizing the relationship between sensing horizon and required resources, we show that increasing the sensing capability of the defender greatly reduces the number of defender assets needed to defend the path. ",
    "url": "https://arxiv.org/abs/2204.04176",
    "authors": [
      "Austin K. Chen",
      "Bryce L. Ferguson",
      "Daigo Shishika",
      "Michael Dorothy",
      "Jason R. Marden",
      "George J. Pappas",
      "Vijay Kumar"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2204.04208",
    "title": "Metasurface-enhanced Light Detection and Ranging Technology",
    "abstract": "Deploying advanced imaging solutions to robotic and autonomous systems by mimicking human vision requires simultaneous acquisition of multiple fields of views, named the peripheral and fovea regions. Low-resolution peripheral field provides coarse scene exploration to direct the eye to focus to a highly resolved fovea region for sharp imaging. Among 3D computer vision techniques, Light Detection and Ranging (LiDAR) is currently considered at the industrial level for robotic vision. LiDAR is an imaging technique that monitors pulses of light at optical frequencies to sense the space and to recover three-dimensional ranging information. Notwithstanding the efforts on LiDAR integration and optimization, commercially available devices have slow frame rate and low image resolution, notably limited by the performance of mechanical or slow solid-state deflection systems. Metasurfaces (MS) are versatile optical components that can distribute the optical power in desired regions of space. Here, we report on an advanced LiDAR technology that uses ultrafast low FoV deflectors cascaded with large area metasurfaces to achieve large FoV and simultaneous peripheral and central imaging zones. This technology achieves MHz frame rate for 2D imaging, and up to KHz for 3D imaging, with extremely large FoV (up to 150{\\deg}deg. on both vertical and horizontal scanning axes). The use of this disruptive LiDAR technology with advanced learning algorithms offers perspectives to improve further the perception capabilities and decision-making process of autonomous vehicles and robotic systems. ",
    "url": "https://arxiv.org/abs/2204.04208",
    "authors": [
      "Renato Juliano Martins",
      "Emil Marinov",
      "M. Aziz Ben Youssef",
      "Christina Kyrou",
      "Mathilde Joubert",
      "Constance Colmagro",
      "Valentin Gâté",
      "Colette Turbil",
      "Pierre-Marie Coulon",
      "Daniel Turover",
      "Samira Khadir",
      "Massimo Giudici",
      "Charalambos Klitis",
      "Marc Sorel",
      "Patrice Genevet"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Instrumentation and Detectors (physics.ins-det)",
      "Optics (physics.optics)"
    ]
  },
  {
    "id": "arXiv:2204.03652",
    "title": "PlutoNet: An Efficient Polyp Segmentation Network",
    "abstract": "Polyps in the colon can turn into cancerous cells if not removed with early intervention. Deep learning models are used to minimize the number of polyps that goes unnoticed by the experts, and to accurately segment the detected polyps during these interventions. Although these models perform well on these tasks, they require too many parameters, which can pose a problem with real-time applications. To address this problem, we propose a novel segmentation model called PlutoNet which requires only 2,626,337 parameters while outperforming state-of-the-art models on multiple medical image segmentation tasks. We use EfficientNetB0 architecture as a backbone and propose the novel modified partial decoder, which is a combination of partial decoder and full scale connections, which further reduces the number of parameters required, as well as captures semantic details. We use asymmetric convolutions to handle varying polyp sizes. Finally, we weight each feature map to improve segmentation by using a squeeze and excitation block. In addition to polyp segmentation in colonoscopy, we tested our model on segmentation of nuclei and surgical instruments to demonstrate its generalizability to different medical image segmentation tasks. Our model outperformed the state-of-the-art models with a Dice score of %92.3 in CVC-ClinicDB dataset and %89.3 in EndoScene dataset, a Dice score of %91.93 on the 2018 Data Science Bowl Challenge dataset, and a Dice score of %94.8 on Kvasir-Instrument dataset. Our experiments and ablation studies show that our model is superior in terms of accuracy, and it is able generalize well to multiple medical segmentation tasks. ",
    "url": "https://arxiv.org/abs/2204.03652",
    "authors": [
      "Tugberk Erol",
      "Duygu Sarikaya"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03703",
    "title": "Physics-assisted Generative Adversarial Network for X-Ray Tomography",
    "abstract": "X-ray tomography is capable of imaging the interior of objects in three dimensions non-invasively, with applications in biomedical imaging, materials science, electronic inspection, and other fields. The reconstruction process can be an ill-conditioned inverse problem, requiring regularization to obtain satisfactory reconstructions. Recently, deep learning has been adopted for tomographic reconstruction. Unlike iterative algorithms which require a distribution that is known a priori, deep reconstruction networks can learn a prior distribution through sampling the training distributions. In this work, we develop a Physics-assisted Generative Adversarial Network (PGAN), a two-step algorithm for tomographic reconstruction. In contrast to previous efforts, our PGAN utilizes maximum-likelihood estimates derived from the measurements to regularize the reconstruction with both known physics and the learned prior. Synthetic objects with spatial correlations are integrated circuits (IC) from a proposed model CircuitFaker. Compared with maximum-likelihood estimation, PGAN can reduce the photon requirement with limited projection angles to achieve a given error rate. We further attribute the improvement to the learned prior by reconstructing objects created without spatial correlations. The advantages of using a prior from deep learning in X-ray tomography may further enable low-photon nanoscale imaging. ",
    "url": "https://arxiv.org/abs/2204.03703",
    "authors": [
      "Zhen Guo",
      "Jung Ki Song",
      "George Barbastathis",
      "Michael E. Glinsky",
      "Courtenay T. Vaughan",
      "Kurt W. Larson",
      "Bradley K. Alpert",
      "Zachary H. Levine"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.03737",
    "title": "Mixing Signals: Data Augmentation Approach for Deep Learning Based  Modulation Recognition",
    "abstract": "With the rapid development of deep learning, automatic modulation recognition (AMR), as an important task in cognitive radio, has gradually transformed from traditional feature extraction and classification to automatic classification by deep learning technology. However, deep learning models are data-driven methods, which often require a large amount of data as the training support. Data augmentation, as the strategy of expanding dataset, can improve the generalization of the deep learning models and thus improve the accuracy of the models to a certain extent. In this paper, for AMR of radio signals, we propose a data augmentation strategy based on mixing signals and consider four specific methods (Random Mixing, Maximum-Similarity-Mixing, $\\theta-$Similarity Mixing and n-times Random Mixing) to achieve data augmentation. Experiments show that our proposed method can improve the classification accuracy of deep learning based AMR models in the full public dataset RML2016.10a. In particular, for the case of a single signal-to-noise ratio signal set, the classification accuracy can be significantly improved, which verifies the effectiveness of the methods. ",
    "url": "https://arxiv.org/abs/2204.03737",
    "authors": [
      "Xinjie Xu",
      "Zhuangzhi Chen",
      "Dongwei Xu",
      "Huaji Zhou",
      "Shanqing Yu",
      "Shilian Zheng",
      "Qi Xuan",
      "Xiaoniu Yang"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03793",
    "title": "Personal VAD 2.0: Optimizing Personal Voice Activity Detection for  On-Device Speech Recognition",
    "abstract": "Personalization of on-device speech recognition (ASR) has seen explosive growth in recent years, largely due to the increasing popularity of personal assistant features on mobile devices and smart home speakers. In this work, we present Personal VAD 2.0, a personalized voice activity detector that detects the voice activity of a target speaker, as part of a streaming on-device ASR system. Although previous proof-of-concept studies have validated the effectiveness of Personal VAD, there are still several critical challenges to address before this model can be used in production: first, the quality must be satisfactory in both enrollment and enrollment-less scenarios; second, it should operate in a streaming fashion; and finally, the model size should be small enough to fit a limited latency and CPU/Memory budget. To meet the multi-faceted requirements, we propose a series of novel designs: 1) advanced speaker embedding modulation methods; 2) a new training paradigm to generalize to enrollment-less conditions; 3) architecture and runtime optimizations for latency and resource restrictions. Extensive experiments on a realistic speech recognition system demonstrated the state-of-the-art performance of our proposed method. ",
    "url": "https://arxiv.org/abs/2204.03793",
    "authors": [
      "Shaojin Ding",
      "Rajeev Rikhye",
      "Qiao Liang",
      "Yanzhang He",
      "Quan Wang",
      "Arun Narayanan",
      "Tom O'Malley",
      "Ian McGraw"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.03848",
    "title": "AdvEst: Adversarial Perturbation Estimation to Classify and Detect  Adversarial Attacks against Speaker Identification",
    "abstract": "Adversarial attacks pose a severe security threat to the state-of-the-art speaker identification systems, thereby making it vital to propose countermeasures against them. Building on our previous work that used representation learning to classify and detect adversarial attacks, we propose an improvement to it using AdvEst, a method to estimate adversarial perturbation. First, we prove our claim that training the representation learning network using adversarial perturbations as opposed to adversarial examples (consisting of the combination of clean signal and adversarial perturbation) is beneficial because it eliminates nuisance information. At inference time, we use a time-domain denoiser to estimate the adversarial perturbations from adversarial examples. Using our improved representation learning approach to obtain attack embeddings (signatures), we evaluate their performance for three applications: known attack classification, attack verification, and unknown attack detection. We show that common attacks in the literature (Fast Gradient Sign Method (FGSM), Projected Gradient Descent (PGD), Carlini-Wagner (CW) with different Lp threat models) can be classified with an accuracy of ~96%. We also detect unknown attacks with an equal error rate (EER) of ~9%, which is absolute improvement of ~12% from our previous work. ",
    "url": "https://arxiv.org/abs/2204.03848",
    "authors": [
      "Sonal Joshi",
      "Saurabh Kataria",
      "Jesus Villalba",
      "Najim Dehak"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Cryptography and Security (cs.CR)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.03849",
    "title": "Prediction of COVID-19 using chest X-ray images",
    "abstract": "COVID-19, also known as Novel Coronavirus Disease, is a highly contagious disease that first surfaced in China in late 2019. SARS-CoV-2 is a coronavirus that belongs to the vast family of coronaviruses that causes this disease. The sickness originally appeared in Wuhan, China in December 2019 and quickly spread to over 213 nations, becoming a global pandemic. Fever, dry cough, and tiredness are the most typical COVID-19 symptoms. Aches, pains, and difficulty breathing are some of the other symptoms that patients may face. The majority of these symptoms are indicators of respiratory infections and lung abnormalities, which radiologists can identify. Chest x-rays of COVID-19 patients seem similar, with patchy and hazy lungs rather than clear and healthy lungs. On x-rays, however, pneumonia and other chronic lung disorders can resemble COVID-19. Trained radiologists must be able to distinguish between COVID-19 and an illness that is less contagious. Our AI algorithm seeks to give doctors a quantitative estimate of the risk of deterioration. So that patients at high risk of deterioration can be triaged and treated efficiently. The method could be particularly useful in pandemic hotspots when screening upon admission is important for allocating limited resources like hospital beds. ",
    "url": "https://arxiv.org/abs/2204.03849",
    "authors": [
      "Narayana Darapaneni",
      "Suma Maram",
      "Harpreet Singh",
      "Syed Subhani",
      "Mandeep Kour",
      "Sathish Nagam",
      "Anwesh Reddy Paduri"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03851",
    "title": "Defense against Adversarial Attacks on Hybrid Speech Recognition using  Joint Adversarial Fine-tuning with Denoiser",
    "abstract": "Adversarial attacks are a threat to automatic speech recognition (ASR) systems, and it becomes imperative to propose defenses to protect them. In this paper, we perform experiments to show that K2 conformer hybrid ASR is strongly affected by white-box adversarial attacks. We propose three defenses--denoiser pre-processor, adversarially fine-tuning ASR model, and adversarially fine-tuning joint model of ASR and denoiser. Our evaluation shows denoiser pre-processor (trained on offline adversarial examples) fails to defend against adaptive white-box attacks. However, adversarially fine-tuning the denoiser using a tandem model of denoiser and ASR offers more robustness. We evaluate two variants of this defense--one updating parameters of both models and the second keeping ASR frozen. The joint model offers a mean absolute decrease of 19.3\\% ground truth (GT) WER with reference to baseline against fast gradient sign method (FGSM) attacks with different $L_\\infty$ norms. The joint model with frozen ASR parameters gives the best defense against projected gradient descent (PGD) with 7 iterations, yielding a mean absolute increase of 22.3\\% GT WER with reference to baseline; and against PGD with 500 iterations, yielding a mean absolute decrease of 45.08\\% GT WER and an increase of 68.05\\% adversarial target WER. ",
    "url": "https://arxiv.org/abs/2204.03851",
    "authors": [
      "Sonal Joshi",
      "Saurabh Kataria",
      "Yiwen Shao",
      "Piotr Zelasko",
      "Jesus Villalba",
      "Sanjeev Khudanpur",
      "Najim Dehak"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Cryptography and Security (cs.CR)",
      "Sound (cs.SD)"
    ]
  },
  {
    "id": "arXiv:2204.03863",
    "title": "Automatic Pronunciation Assessment using Self-Supervised Speech  Representation Learning",
    "abstract": "Self-supervised learning (SSL) approaches such as wav2vec 2.0 and HuBERT models have shown promising results in various downstream tasks in the speech community. In particular, speech representations learned by SSL models have been shown to be effective for encoding various speech-related characteristics. In this context, we propose a novel automatic pronunciation assessment method based on SSL models. First, the proposed method fine-tunes the pre-trained SSL models with connectionist temporal classification to adapt the English pronunciation of English-as-a-second-language (ESL) learners in a data environment. Then, the layer-wise contextual representations are extracted from all across the transformer layers of the SSL models. Finally, the automatic pronunciation score is estimated using bidirectional long short-term memory with the layer-wise contextual representations and the corresponding text. We show that the proposed SSL model-based methods outperform the baselines, in terms of the Pearson correlation coefficient, on datasets of Korean ESL learner children and Speechocean762. Furthermore, we analyze how different representations of transformer layers in the SSL model affect the performance of the pronunciation assessment task. ",
    "url": "https://arxiv.org/abs/2204.03863",
    "authors": [
      "Eesung Kim",
      "Jae-Jin Jeon",
      "Hyeji Seo",
      "Hoon Kim"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2204.04016",
    "title": "Disentangled Latent Speech Representation for Automatic Pathological  Intelligibility Assessment",
    "abstract": "Speech intelligibility assessment plays an important role in the therapy of patients suffering from pathological speech disorders. Automatic and objective measures are desirable to assist therapists in their traditionally subjective and labor-intensive assessments. In this work, we investigate a novel approach for obtaining such a measure using the divergence in disentangled latent speech representations of a parallel utterance pair, obtained from a healthy reference and a pathological speaker. Experiments on an English database of Cerebral Palsy patients, using all available utterances per speaker, show high and significant correlation values (R = -0.9) with subjective intelligibility measures, while having only minimal deviation (+-0.01) across four different reference speaker pairs. We also demonstrate the robustness of the proposed method (R = -0.89 deviating +-0.02 over 1000 iterations) by considering a significantly smaller amount of utterances per speaker. Our results are among the first to show that disentangled speech representations can be used for automatic pathological speech intelligibility assessment, resulting in a reference speaker pair invariant method, applicable in scenarios with only few utterances available. ",
    "url": "https://arxiv.org/abs/2204.04016",
    "authors": [
      "Tobias Weise",
      "Philipp Klumpp",
      "Andreas Maier",
      "Elmar Noeth",
      "Bjoern Heismann",
      "Maria Schuster",
      "Seung Hee Yang"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Quantitative Methods (q-bio.QM)"
    ]
  },
  {
    "id": "arXiv:2204.04109",
    "title": "Fast metric embedding into the Hamming cube",
    "abstract": "We consider the problem of embedding a subset of $\\mathbb{R}^n$ into a low-dimensional Hamming cube in an almost isometric way. We construct a simple and computationally efficient map that achieves this task with high probability: we first apply a specific structured random matrix, which we call the double circulant matrix; using that matrix requires little storage and matrix-vector multiplication can be performed in near-linear time. We then binarize each vector by comparing each of its entries to a random threshold, selected uniformly at random from a well-chosen interval. We estimate the number of bits required for this encoding scheme in terms of two natural geometric complexity parameters of the set -- its Euclidean covering numbers and its localized Gaussian complexity. The estimate we derive turns out to be the best that one can hope for -- up to logarithmic terms. The key to the proof is a phenomenon of independent interest: we show that the double circulant matrix mimics the behavior of a Gaussian matrix in two important ways. First, it yields an almost isometric embedding of any subset of $\\ell_2^n$ into $\\ell_1^m$ and, second, it maps an arbitrary set in $\\mathbb{R}^n$ into a set of well-spread vectors. ",
    "url": "https://arxiv.org/abs/2204.04109",
    "authors": [
      "Sjoerd Dirksen",
      "Shahar Mendelson",
      "Alexander Stollenwerk"
    ],
    "subjectives": [
      "Probability (math.PR)",
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2204.04117",
    "title": "Finding shortest and nearly shortest path nodes in large substantially  incomplete networks",
    "abstract": "Dynamic processes on networks, be it information transfer in the Internet, contagious spreading in a social network, or neural signaling, take place along shortest or nearly shortest paths. Unfortunately, our maps of most large networks are substantially incomplete due to either the highly dynamic nature of networks, or high cost of network measurements, or both, rendering traditional path finding methods inefficient. We find that shortest paths in large real networks, such as the network of protein-protein interactions (PPI) and the Internet at the autonomous system (AS) level, are not random but are organized according to latent-geometric rules. If nodes of these networks are mapped to points in latent hyperbolic spaces, shortest paths in them align along geodesic curves connecting endpoint nodes. We find that this alignment is sufficiently strong to allow for the identification of shortest path nodes even in the case of substantially incomplete networks. We demonstrate the utility of latent-geometric path-finding in problems of cellular pathway reconstruction and communication security. ",
    "url": "https://arxiv.org/abs/2204.04117",
    "authors": [
      "Maksim Kitsak",
      "Alexander Ganin",
      "Ahmed Elmokashfi",
      "Hongzhu Cui",
      "Daniel A. Eisenberg",
      "David L. Alderson",
      "Dmitry Korkin",
      "Igor Linkov"
    ],
    "subjectives": [
      "Physics and Society (physics.soc-ph)",
      "Networking and Internet Architecture (cs.NI)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.04170",
    "title": "Automatic Data Augmentation Selection and Parametrization in Contrastive  Self-Supervised Speech Representation Learning",
    "abstract": "Contrastive learning enables learning useful audio and speech representations without ground-truth labels by maximizing the similarity between latent representations of similar signal segments. In this framework various data augmentation techniques are usually exploited to help enforce desired invariances within the learned representations, improving performance on various audio tasks thanks to more robust embeddings. Now, selecting the most relevant augmentations has proven crucial for better downstream performances. Thus, this work introduces a conditional independance-based method which allows for automatically selecting a suitable distribution on the choice of augmentations and their parametrization from a set of predefined ones, for contrastive self-supervised pre-training. This is performed with respect to a downstream task of interest, hence saving a costly hyper-parameter search. Experiments performed on two different downstream tasks validate the proposed approach showing better results than experimenting without augmentation or with baseline augmentations. We furthermore conduct a qualitative analysis of the automatically selected augmentations and their variation according to the considered final downstream dataset. ",
    "url": "https://arxiv.org/abs/2204.04170",
    "authors": [
      "Salah Zaiem",
      "Titouan Parcollet",
      "Slim Essid"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:1910.00089",
    "title": "Mining Uncertain Event Data in Process Mining",
    "abstract": " Comments: 18 pages, 7 figures, 3 tables, 13 references ",
    "url": "https://arxiv.org/abs/1910.00089",
    "authors": [
      "Marco Pegoraro",
      "Wil M.P. van der Aalst"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2007.02445",
    "title": "Overlapping Spaces for Compact Graph Representations",
    "abstract": " Title: Overlapping Spaces for Compact Graph Representations ",
    "url": "https://arxiv.org/abs/2007.02445",
    "authors": [
      "Kirill Shevkunov",
      "Liudmila Prokhorenkova"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Information Retrieval (cs.IR)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2009.07968",
    "title": "A Few-Shot Semantic Parser for Wizard-of-Oz Dialogues with the Precise  ThingTalk Representation",
    "abstract": " Comments: Published in Findings of ACL 2022, 9 pages ",
    "url": "https://arxiv.org/abs/2009.07968",
    "authors": [
      "Giovanni Campagna",
      "Sina J. Semnani",
      "Ryan Kearns",
      "Lucas Jun Koba Sato",
      "Silei Xu",
      "Monica S. Lam"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2011.05097",
    "title": "Two-stage Training of Graph Neural Networks for Graph Classification",
    "abstract": " Title: Two-stage Training of Graph Neural Networks for Graph Classification ",
    "url": "https://arxiv.org/abs/2011.05097",
    "authors": [
      "Manh Tuan Do",
      "Noseong Park",
      "Kijung Shin"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2011.09907",
    "title": "Neural graph embeddings via matrix factorization for link prediction:  smoothing or truncating negatives?",
    "abstract": " Title: Neural graph embeddings via matrix factorization for link prediction:  smoothing or truncating negatives? ",
    "url": "https://arxiv.org/abs/2011.09907",
    "authors": [
      "Asan Agibetov"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2101.12694",
    "title": "Gaining Scale Invariance in UAV Bird's Eye View Object Detection by  Adaptive Resizing",
    "abstract": " Comments: accepted for publication in ICPR 2022 ",
    "url": "https://arxiv.org/abs/2101.12694",
    "authors": [
      "Martin Messmer",
      "Benjamin Kiefer",
      "Andreas Zell"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2102.11864",
    "title": "A Refined Complexity Analysis of Fair Districting over Graphs",
    "abstract": " Title: A Refined Complexity Analysis of Fair Districting over Graphs ",
    "url": "https://arxiv.org/abs/2102.11864",
    "authors": [
      "Niclas Boehmer",
      "Tomohiro Koana",
      "Rolf Niedermeier"
    ],
    "subjectives": [
      "Computer Science and Game Theory (cs.GT)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2103.05564",
    "title": "PROVED: A Tool for Graph Representation and Analysis of Uncertain Event  Data",
    "abstract": " Comments: 11 pages, 6 figures, 1 table, 16 references ",
    "url": "https://arxiv.org/abs/2103.05564",
    "authors": [
      "Marco Pegoraro",
      "Merih Seran Uysal",
      "Wil M.P. van der Aalst"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2103.06271",
    "title": "Learning-Based Vulnerability Analysis of Cyber-Physical Systems",
    "abstract": " Title: Learning-Based Vulnerability Analysis of Cyber-Physical Systems ",
    "url": "https://arxiv.org/abs/2103.06271",
    "authors": [
      "Amir Khazraei",
      "Spencer Hallyburton",
      "Qitong Gao",
      "Yu Wang",
      "Miroslav Pajic"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2105.00287",
    "title": "The complexity of approximating the complex-valued Ising model on  bounded degree graphs",
    "abstract": " Comments: 49 pages, 9 figures On last update: we fixed some typos and updated the references ",
    "url": "https://arxiv.org/abs/2105.00287",
    "authors": [
      "Andreas Galanis",
      "Leslie Ann Goldberg",
      "Andrés Herrera-Poyatos"
    ],
    "subjectives": [
      "Computational Complexity (cs.CC)",
      "Combinatorics (math.CO)"
    ]
  },
  {
    "id": "arXiv:2105.01017",
    "title": "Learning Graph Embeddings for Open World Compositional Zero-Shot  Learning",
    "abstract": " Comments: Accepted by T-PAMI in March, 2022. arXiv admin note: text overlap with arXiv:2101.12609 ",
    "url": "https://arxiv.org/abs/2105.01017",
    "authors": [
      "Massimiliano Mancini",
      "Muhammad Ferjad Naeem",
      "Yongqin Xian",
      "Zeynep Akata"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2105.13856",
    "title": "Lightweight Cross-Lingual Sentence Representation Learning",
    "abstract": " Comments: ACL 2021 main conference; modified Eq. (2) ",
    "url": "https://arxiv.org/abs/2105.13856",
    "authors": [
      "Zhuoyuan Mao",
      "Prakhar Gupta",
      "Chenhui Chu",
      "Martin Jaggi",
      "Sadao Kurohashi"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2106.00216",
    "title": "A Voxel Graph CNN for Object Classification with Event Cameras",
    "abstract": " Comments: 10 pages, 5 Figures ",
    "url": "https://arxiv.org/abs/2106.00216",
    "authors": [
      "Yongjian Deng",
      "Hao Chen",
      "Hai Liu",
      "Youfu Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2107.00594",
    "title": "Pretext Tasks selection for multitask self-supervised speech  representation learning",
    "abstract": " Title: Pretext Tasks selection for multitask self-supervised speech  representation learning ",
    "url": "https://arxiv.org/abs/2107.00594",
    "authors": [
      "Salah Zaiem",
      "Titouan Parcollet",
      "Slim Essid",
      "Abdel Heba"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Machine Learning (cs.LG)",
      "Sound (cs.SD)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2107.11302",
    "title": "Provident Vehicle Detection at Night for Advanced Driver Assistance  Systems",
    "abstract": " Title: Provident Vehicle Detection at Night for Advanced Driver Assistance  Systems ",
    "url": "https://arxiv.org/abs/2107.11302",
    "authors": [
      "Lukas Ewecker",
      "Ebubekir Asan",
      "Lars Ohnemus",
      "Sascha Saralajew"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2107.11732",
    "title": "Federated Causal Inference in Heterogeneous Observational Data",
    "abstract": " Title: Federated Causal Inference in Heterogeneous Observational Data ",
    "url": "https://arxiv.org/abs/2107.11732",
    "authors": [
      "Ruoxuan Xiong",
      "Allison Koenecke",
      "Michael Powell",
      "Zhu Shen",
      "Joshua T. Vogelstein",
      "Susan Athey"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Econometrics (econ.EM)",
      "Quantitative Methods (q-bio.QM)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2107.12720",
    "title": "Efficient Parallel Graph Trimming by Arc-Consistency",
    "abstract": " Comments: 42 pages, 9 figures, The Journal of Supercomputing ",
    "url": "https://arxiv.org/abs/2107.12720",
    "authors": [
      "Bin Guo",
      "Emil Sekerinski"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)"
    ]
  },
  {
    "id": "arXiv:2108.06822",
    "title": "CONet: Channel Optimization for Convolutional Neural Networks",
    "abstract": " Title: CONet: Channel Optimization for Convolutional Neural Networks ",
    "url": "https://arxiv.org/abs/2108.06822",
    "authors": [
      "Mahdi S. Hosseini",
      "Jia Shu Zhang",
      "Zhe Liu",
      "Andre Fu",
      "Jingxuan Su",
      "Mathieu Tuli",
      "Sepehr Hosseini",
      "Arsh Kadakia",
      "Haoran Wang",
      "Konstantinos N. Plataniotis"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2108.12176",
    "title": "Rethinking the Misalignment Problem in Dense Object Detection",
    "abstract": " Title: Rethinking the Misalignment Problem in Dense Object Detection ",
    "url": "https://arxiv.org/abs/2108.12176",
    "authors": [
      "Yang Yang",
      "Min Li",
      "Bo Meng",
      "Junxing Ren",
      "Degang Sun",
      "Zihao Huang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2109.08479",
    "title": "CardiSort: a convolutional neural network for cross vendor automated  sorting of cardiac MR images",
    "abstract": " Comments: Published in European Radiology 2022 ",
    "url": "https://arxiv.org/abs/2109.08479",
    "authors": [
      "Ruth P Lim",
      "Stefan Kachel",
      "Adriana DM Villa",
      "Leighton Kearney",
      "Nuno Bettencourt",
      "Alistair A Young",
      "Amedeo Chiribiri",
      "Cian M Scannell"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.11439",
    "title": "Image prediction of disease progression by style-based manifold  extrapolation",
    "abstract": " Title: Image prediction of disease progression by style-based manifold  extrapolation ",
    "url": "https://arxiv.org/abs/2111.11439",
    "authors": [
      "Tianyu Han",
      "Jakob Nikolas Kather",
      "Federico Pedersoli",
      "Markus Zimmermann",
      "Sebastian Keil",
      "Maximilian Schulze-Hagen",
      "Marc Terwoelbeck",
      "Peter Isfort",
      "Christoph Haarburger",
      "Fabian Kiessling",
      "Volkmar Schulz",
      "Christiane Kuhl",
      "Sven Nebelung",
      "Daniel Truhn"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2111.14507",
    "title": "SPIN: Simplifying Polar Invariance for Neural networks Application to  vision-based irradiance forecasting",
    "abstract": " Comments: CVPR 2022 - OmniCV workshop (oral) ",
    "url": "https://arxiv.org/abs/2111.14507",
    "authors": [
      "Quentin Paletta",
      "Anthony Hu",
      "Guillaume Arbod",
      "Philippe Blanc",
      "Joan Lasenby"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2111.15606",
    "title": "Robust Partial-to-Partial Point Cloud Registration in a Full Range",
    "abstract": " Comments: 15 pages, 9 figures. Github Website: this https URL ",
    "url": "https://arxiv.org/abs/2111.15606",
    "authors": [
      "Liang Pan",
      "Zhongang Cai",
      "Ziwei Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.01316",
    "title": "Putting 3D Spatially Sparse Networks on a Diet",
    "abstract": " Title: Putting 3D Spatially Sparse Networks on a Diet ",
    "url": "https://arxiv.org/abs/2112.01316",
    "authors": [
      "Junha Lee",
      "Christopher Choy",
      "Jaesik Park"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2112.04298",
    "title": "GCA-Net : Utilizing Gated Context Attention for Improving Image Forgery  Localization and Detection",
    "abstract": " Comments: Accepted for publication at the CVPR 2022 Media Forensics Workshop ",
    "url": "https://arxiv.org/abs/2112.04298",
    "authors": [
      "Sowmen Das",
      "Md. Saiful Islam",
      "Md. Ruhul Amin"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2112.05307",
    "title": "Are We There Yet? Timing and Floating-Point Attacks on Differential  Privacy Systems",
    "abstract": " Comments: In Proceedings of the 43rd IEEE Symposium on Security and Privacy (IEEE S&P 2022) ",
    "url": "https://arxiv.org/abs/2112.05307",
    "authors": [
      "Jiankai Jin",
      "Eleanor McMurtry",
      "Benjamin I. P. Rubinstein",
      "Olga Ohrimenko"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2112.08679",
    "title": "Are Graph Augmentations Necessary? Simple Graph Contrastive Learning for  Recommendation",
    "abstract": " Comments: 10 pages. To Appear in SIGIR'22 ",
    "url": "https://arxiv.org/abs/2112.08679",
    "authors": [
      "Junliang Yu",
      "Hongzhi Yin",
      "Xin Xia",
      "Tong Chen",
      "Lizhen Cui",
      "Quoc Viet Hung Nguyen"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2201.00632",
    "title": "Neural network training under semidefinite constraints",
    "abstract": " Title: Neural network training under semidefinite constraints ",
    "url": "https://arxiv.org/abs/2201.00632",
    "authors": [
      "Patricia Pauli",
      "Niklas Funcke",
      "Dennis Gramlich",
      "Mohamed Amine Msalmi",
      "Frank Allgöwer"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)",
      "Optimization and Control (math.OC)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2201.02571",
    "title": "Neural Network Optimization for Reinforcement Learning Tasks Using  Sparse Computations",
    "abstract": " Title: Neural Network Optimization for Reinforcement Learning Tasks Using  Sparse Computations ",
    "url": "https://arxiv.org/abs/2201.02571",
    "authors": [
      "Dmitry Ivanov",
      "Mikhail Kiselev",
      "Denis Larionov"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2201.03269",
    "title": "Neural Networks to solve Partial Differential Equations: a Comparison  with Finite Elements",
    "abstract": " Title: Neural Networks to solve Partial Differential Equations: a Comparison  with Finite Elements ",
    "url": "https://arxiv.org/abs/2201.03269",
    "authors": [
      "Andrea Sacchetti",
      "Benjamin Bachmann",
      "Kaspar Löffel",
      "Urs-Martin Künzi",
      "Beatrice Paoli"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)"
    ]
  },
  {
    "id": "arXiv:2201.03677",
    "title": "Homepage2Vec: Language-Agnostic Website Embedding and Classification",
    "abstract": " Comments: Published in Proc. of ICWSM 2022 ",
    "url": "https://arxiv.org/abs/2201.03677",
    "authors": [
      "Sylvain Lugeon",
      "Tiziano Piccardi",
      "Robert West"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2202.01020",
    "title": "MedNeRF: Medical Neural Radiance Fields for Reconstructing 3D-aware  CT-Projections from a Single X-ray",
    "abstract": " Comments: 6 pages, 4 figures, accepted at IEEE EMBC 2022 ",
    "url": "https://arxiv.org/abs/2202.01020",
    "authors": [
      "Abril Corona-Figueroa",
      "Jonathan Frawley",
      "Sam Bond-Taylor",
      "Sarath Bethapudi",
      "Hubert P. H. Shum",
      "Chris G. Willcocks"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2202.03573",
    "title": "A Viral Marketing-Based Model For Opinion Dynamics in Online Social  Networks",
    "abstract": " Comments: To appear at WebConf'22. Correct the errors of scales in Figure 2 ",
    "url": "https://arxiv.org/abs/2202.03573",
    "authors": [
      "Sijing Tu",
      "Stefan Neumann"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2202.04821",
    "title": "Measuring disentangled generative spatio-temporal representation",
    "abstract": " Comments: Accepted at SDM2022 ",
    "url": "https://arxiv.org/abs/2202.04821",
    "authors": [
      "Sichen Zhao",
      "Wei Shao",
      "Jeffrey Chan",
      "Flora D. Salim"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2202.10408",
    "title": "Embarrassingly Simple Performance Prediction for Abductive Natural  Language Inference",
    "abstract": " Comments: accepted at NAACL 2022 ",
    "url": "https://arxiv.org/abs/2202.10408",
    "authors": [
      "Emīls Kadiķis",
      "Vaibhav Srivastav",
      "Roman Klinger"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2203.01754",
    "title": "PINA: Learning a Personalized Implicit Neural Avatar from a Single RGB-D  Video Sequence",
    "abstract": " Comments: CVPR'2022; Video: this https URL | Project page: this https URL | Supplementary Material: this https URL ",
    "url": "https://arxiv.org/abs/2203.01754",
    "authors": [
      "Zijian Dong",
      "Chen Guo",
      "Jie Song",
      "Xu Chen",
      "Andreas Geiger",
      "Otmar Hilliges"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.02662",
    "title": "A Survey on Metaverse: Fundamentals, Security, and Privacy",
    "abstract": " Comments: 31 pages, 15 figures, 6 tables. Submitted to IEEE Communications Surveys & Tutorials ",
    "url": "https://arxiv.org/abs/2203.02662",
    "authors": [
      "Yuntao Wang",
      "Zhou Su",
      "Ning Zhang",
      "Dongxiao Liu",
      "Rui Xing",
      "Tom H. Luan",
      "Xuemin Shen"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2203.12455",
    "title": "Assessing Network Representations for Identifying Interdisciplinarity",
    "abstract": " Title: Assessing Network Representations for Identifying Interdisciplinarity ",
    "url": "https://arxiv.org/abs/2203.12455",
    "authors": [
      "Eoghan Cunningham",
      "Derek Greene"
    ],
    "subjectives": [
      "Digital Libraries (cs.DL)",
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2203.12505",
    "title": "A Spatial-Temporal Attention Multi-Graph Convolution Network for  Ride-Hailing Demand Prediction Based on Periodicity with Offset",
    "abstract": " Comments: We have found another earlier related work that uses a similar structure. And therfore, we hope to withdraw this version and willl include more related work in a future version ",
    "url": "https://arxiv.org/abs/2203.12505",
    "authors": [
      "Dong Xing",
      "Chenguang Zhao",
      "Gang Wang"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2203.12899",
    "title": "Facial Expression Classification using Fusion of Deep Neural Network in  Video for the 3rd ABAW3 Competition",
    "abstract": " Title: Facial Expression Classification using Fusion of Deep Neural Network in  Video for the 3rd ABAW3 Competition ",
    "url": "https://arxiv.org/abs/2203.12899",
    "authors": [
      "Kim Ngan Phan",
      "Hong-Hai Nguyen",
      "Van-Thong Huynh",
      "Soo-Hyung Kim"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2203.13277",
    "title": "A Manifold View of Adversarial Risk",
    "abstract": " Title: A Manifold View of Adversarial Risk ",
    "url": "https://arxiv.org/abs/2203.13277",
    "authors": [
      "Wenjia Zhang",
      "Yikai Zhang",
      "Xiaoling Hu",
      "Mayank Goswami",
      "Chao Chen",
      "Dimitris Metaxas"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.00465",
    "title": "Deep Neural Convolutive Matrix Factorization for Articulatory  Representation Decomposition",
    "abstract": " Comments: Submitted to 2022 Interspeech ",
    "url": "https://arxiv.org/abs/2204.00465",
    "authors": [
      "Jiachen Lian",
      "Alan W Black",
      "Louis Goldstein",
      "Gopala Krishna Anumanchipalli"
    ],
    "subjectives": [
      "Audio and Speech Processing (eess.AS)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2204.01349",
    "title": "MGRR-Net: Multi-level Graph Relational Reasoning Network for Facial  Action Units Detection",
    "abstract": " Comments: 10 pages, 4 figures, 8 tables; submitted to IEEE TMM for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2204.01349",
    "authors": [
      "Xuri Ge",
      "Joemon M. Jose",
      "Songpei Xu",
      "Xiao Liu",
      "Hu Han"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.01568",
    "title": "DAD: Data-free Adversarial Defense at Test Time",
    "abstract": " Comments: WACV 2022. Project page: this https URL ",
    "url": "https://arxiv.org/abs/2204.01568",
    "authors": [
      "Gaurav Kumar Nayak",
      "Ruchit Rawal",
      "Anirban Chakraborty"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Cryptography and Security (cs.CR)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.02525",
    "title": "Mars: Near-Optimal Throughput with Shallow Buffers in Reconfigurable  Datacenter Networks",
    "abstract": " Title: Mars: Near-Optimal Throughput with Shallow Buffers in Reconfigurable  Datacenter Networks ",
    "url": "https://arxiv.org/abs/2204.02525",
    "authors": [
      "Vamsi Addanki",
      "Chen Avin",
      "Stefan Schmid"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2204.02597",
    "title": "Fine-Grained Predicates Learning for Scene Graph Generation",
    "abstract": " Title: Fine-Grained Predicates Learning for Scene Graph Generation ",
    "url": "https://arxiv.org/abs/2204.02597",
    "authors": [
      "Xinyu Lyu",
      "Lianli Gao",
      "Yuyu Guo",
      "Zhou Zhao",
      "Hao Huang",
      "Heng Tao Shen",
      "Jingkuan Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03098",
    "title": "Closed Ranks: The Discursive Value of Military Support for Indian  Politicians on Social Media",
    "abstract": " Title: Closed Ranks: The Discursive Value of Military Support for Indian  Politicians on Social Media ",
    "url": "https://arxiv.org/abs/2204.03098",
    "authors": [
      "Agrima Seth",
      "Soham De",
      "Arshia Arya",
      "Steven Wilkinson",
      "Sushant Singh",
      "Joyojeet Pal"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2204.03197",
    "title": "MDA GAN: Adversarial-Learning-based 3-D Seismic Data Interpolation and  Reconstruction for Complex Missing",
    "abstract": " Comments: This work has been submitted to journal for possible publication. Copyright may be transferred without notice, after which this version may no longer be accessible ",
    "url": "https://arxiv.org/abs/2204.03197",
    "authors": [
      "Yimin Dou",
      "Kewen Li",
      "Hongjie Duan",
      "Timing Li",
      "Lin Dong",
      "Zongchao Huang"
    ],
    "subjectives": [
      "Geophysics (physics.geo-ph)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2204.03262",
    "title": "Korean Online Hate Speech Dataset for Multilabel Classification: How Can  Social Science Improve Dataset on Hate Speech?",
    "abstract": " Comments: 12 pages, 3 tables ",
    "url": "https://arxiv.org/abs/2204.03262",
    "authors": [
      "TaeYoung Kang",
      "Eunrang Kwon",
      "Junbum Lee",
      "Youngeun Nam",
      "Junmo Song",
      "JeongKyu Suh"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2204.03293",
    "title": "Enhancing Semantic Code Search with Multimodal Contrastive Learning and  Soft Data Augmentation",
    "abstract": " Title: Enhancing Semantic Code Search with Multimodal Contrastive Learning and  Soft Data Augmentation ",
    "url": "https://arxiv.org/abs/2204.03293",
    "authors": [
      "Ensheng Shi",
      "Wenchao Gub",
      "Yanlin Wang",
      "Lun Du",
      "Hongyu Zhang",
      "Shi Han",
      "Dongmei Zhang",
      "Hongbin Sun"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03397",
    "title": "Defending Active Directory by Combining Neural Network based Dynamic  Program and Evolutionary Diversity Optimisation",
    "abstract": " Title: Defending Active Directory by Combining Neural Network based Dynamic  Program and Evolutionary Diversity Optimisation ",
    "url": "https://arxiv.org/abs/2204.03397",
    "authors": [
      "Diksha Goel",
      "Max Ward",
      "Aneta Neumann",
      "Frank Neumann",
      "Hung Nguyen",
      "Mingyu Guo"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2204.03497",
    "title": "Generalised Latent Assimilation in Heterogeneous Reduced Spaces with  Machine Learning Surrogate Models",
    "abstract": " Title: Generalised Latent Assimilation in Heterogeneous Reduced Spaces with  Machine Learning Surrogate Models ",
    "url": "https://arxiv.org/abs/2204.03497",
    "authors": [
      "Sibo Cheng",
      "Jianhua Chen",
      "Charitos Anastasiou",
      "Panagiota Angeli",
      "Omar K. Matar",
      "Yi-Ke Guo",
      "Christopher C. Pain",
      "Rossella Arcucci"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Chaotic Dynamics (nlin.CD)",
      "Computational Physics (physics.comp-ph)"
    ]
  },
  {
    "id": "arXiv:2204.03529",
    "title": "FedADMM: A Robust Federated Deep Learning Framework with Adaptivity to  System Heterogeneity",
    "abstract": " Title: FedADMM: A Robust Federated Deep Learning Framework with Adaptivity to  System Heterogeneity ",
    "url": "https://arxiv.org/abs/2204.03529",
    "authors": [
      "Yonghai Gong",
      "Yichuan Li",
      "Nikolaos M. Freris"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2204.03556",
    "title": "Goodbye Tracking? Impact of iOS App Tracking Transparency and Privacy  Labels",
    "abstract": " Comments: Pre-print of paper that has been accepted for publication by the ACM Conference on Fairness, Accountability, and Transparency (FAccT) 2022 ",
    "url": "https://arxiv.org/abs/2204.03556",
    "authors": [
      "Konrad Kollnig",
      "Anastasia Shuba",
      "Max Van Kleek",
      "Reuben Binns",
      "Nigel Shadbolt"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Computers and Society (cs.CY)"
    ]
  }
]