[
  {
    "id": "arXiv:2304.06034",
    "title": "Social Biases through the Text-to-Image Generation Lens",
    "abstract": "Text-to-Image (T2I) generation is enabling new applications that support creators, designers, and general end users of productivity software by generating illustrative content with high photorealism starting from a given descriptive text as a prompt. Such models are however trained on massive amounts of web data, which surfaces the peril of potential harmful biases that may leak in the generation process itself. In this paper, we take a multi-dimensional approach to studying and quantifying common social biases as reflected in the generated images, by focusing on how occupations, personality traits, and everyday situations are depicted across representations of (perceived) gender, age, race, and geographical location. Through an extensive set of both automated and human evaluation experiments we present findings for two popular T2I models: DALLE-v2 and Stable Diffusion. Our results reveal that there exist severe occupational biases of neutral prompts majorly excluding groups of people from results for both models. Such biases can get mitigated by increasing the amount of specification in the prompt itself, although the prompting mitigation will not address discrepancies in image quality or other usages of the model or its representations in other scenarios. Further, we observe personality traits being associated with only a limited set of people at the intersection of race, gender, and age. Finally, an analysis of geographical location representations on everyday situations (e.g., park, food, weddings) shows that for most situations, images generated through default location-neutral prompts are closer and more similar to images generated for locations of United States and Germany. ",
    "url": "https://arxiv.org/abs/2304.06034",
    "authors": [
      "Ranjita Naik",
      "Besmira Nushi"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06039",
    "title": "A new perspective on the prediction of the innovation performance: A  data driven methodology to identify innovation indicators through a  comparative study of Boston's neighborhoods",
    "abstract": "In an era of knowledge-based economy, commercialized research and globalized competition for talent, the creation of innovation ecosystems and innovation networks is at the forefront of efforts of cities. In this context, public authorities, private organizations, and academics respond to the question of the most promising indicators that can predict innovation with various innovation scoreboards. The current paper aims at increasing the understanding of the existing indicators and complementing the various innovation assessment toolkits, using large datasets from non-traditional sources. The success of both top down implemented innovation districts and community-level innovation ecosystems is complex and has not been well examined. Yet, limited data shed light on the association between indicators and innovation performance at the neighborhood level. For this purpose, the city of Boston has been selected as a case study to reveal the importance of its neighborhood's different characteristics in achieving high innovation performance. The study uses a large geographically distributed dataset across Boston's 35 zip code areas, which contains various business, entrepreneurial-specific, socio-economic data and other types of data that can reveal contextual urban dimensions. Furthermore, in order to express the innovation performance of the zip code areas, new metrics are proposed connected to innovation locations. The outcomes of this analysis aim to introduce a 'Neighborhood Innovation Index' that will generate new planning models for higher innovation performance, which can be easily applied in other cases. By publishing this large-scale dataset of urban informatics, the goal is to contribute to the innovation discourse and enable a new theoretical framework that identifies the linkages among cities' socio-economic characteristics and innovation performance. ",
    "url": "https://arxiv.org/abs/2304.06039",
    "authors": [
      "Eleni Oikonomaki",
      "Dimitris Belivanis"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2304.06044",
    "title": "Learning solution of nonlinear constitutive material models using  physics-informed neural networks: COMM-PINN",
    "abstract": "We applied physics-informed neural networks to solve the constitutive relations for nonlinear, path-dependent material behavior. As a result, the trained network not only satisfies all thermodynamic constraints but also instantly provides information about the current material state (i.e., free energy, stress, and the evolution of internal variables) under any given loading scenario without requiring initial data. One advantage of this work is that it bypasses the repetitive Newton iterations needed to solve nonlinear equations in complex material models. Additionally, strategies are provided to reduce the required order of derivation for obtaining the tangent operator. The trained model can be directly used in any finite element package (or other numerical methods) as a user-defined material model. However, challenges remain in the proper definition of collocation points and in integrating several non-equality constraints that become active or non-active simultaneously. We tested this methodology on rate-independent processes such as the classical von Mises plasticity model with a nonlinear hardening law, as well as local damage models for interface cracking behavior with a nonlinear softening law. Finally, we discuss the potential and remaining challenges for future developments of this new approach. ",
    "url": "https://arxiv.org/abs/2304.06044",
    "authors": [
      "Shahed Rezaei",
      "Ahmad Moeineddin",
      "Ali Harandi"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06048",
    "title": "RELS-DQN: A Robust and Efficient Local Search Framework for  Combinatorial Optimization",
    "abstract": "Combinatorial optimization (CO) aims to efficiently find the best solution to NP-hard problems ranging from statistical physics to social media marketing. A wide range of CO applications can benefit from local search methods because they allow reversible action over greedy policies. Deep Q-learning (DQN) using message-passing neural networks (MPNN) has shown promise in replicating the local search behavior and obtaining comparable results to the local search algorithms. However, the over-smoothing and the information loss during the iterations of message passing limit its robustness across applications, and the large message vectors result in memory inefficiency. Our paper introduces RELS-DQN, a lightweight DQN framework that exhibits the local search behavior while providing practical scalability. Using the RELS-DQN model trained on one application, it can generalize to various applications by providing solution values higher than or equal to both the local search algorithms and the existing DQN models while remaining efficient in runtime and memory. ",
    "url": "https://arxiv.org/abs/2304.06048",
    "authors": [
      "Yuanhang Shao",
      "Tonmoy Dey",
      "Nikola Vuckovic",
      "Luke Van Popering",
      "Alan Kuhnle"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.06049",
    "title": "Exact and Cost-Effective Automated Transformation of Neural Network  Controllers to Decision Tree Controllers",
    "abstract": "Over the past decade, neural network (NN)-based controllers have demonstrated remarkable efficacy in a variety of decision-making tasks. However, their black-box nature and the risk of unexpected behaviors and surprising results pose a challenge to their deployment in real-world systems with strong guarantees of correctness and safety. We address these limitations by investigating the transformation of NN-based controllers into equivalent soft decision tree (SDT)-based controllers and its impact on verifiability. Differently from previous approaches, we focus on discrete-output NN controllers including rectified linear unit (ReLU) activation functions as well as argmax operations. We then devise an exact but cost-effective transformation algorithm, in that it can automatically prune redundant branches. We evaluate our approach using two benchmarks from the OpenAI Gym environment. Our results indicate that the SDT transformation can benefit formal verification, showing runtime improvements of up to 21x and 2x for MountainCar-v0 and CartPole-v0, respectively. ",
    "url": "https://arxiv.org/abs/2304.06049",
    "authors": [
      "Kevin Chang",
      "Nathan Dahlin",
      "Rahul Jain",
      "Pierluigi Nuzzo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.06052",
    "title": "Confident Object Detection via Conformal Prediction and Conformal Risk  Control: an Application to Railway Signaling",
    "abstract": "Deploying deep learning models in real-world certified systems requires the ability to provide confidence estimates that accurately reflect their uncertainty. In this paper, we demonstrate the use of the conformal prediction framework to construct reliable and trustworthy predictors for detecting railway signals. Our approach is based on a novel dataset that includes images taken from the perspective of a train operator and state-of-the-art object detectors. We test several conformal approaches and introduce a new method based on conformal risk control. Our findings demonstrate the potential of the conformal prediction framework to evaluate model performance and provide practical guidance for achieving formally guaranteed uncertainty bounds. ",
    "url": "https://arxiv.org/abs/2304.06052",
    "authors": [
      "Léo Andéol",
      "Thomas Fel",
      "Florence De Grancey",
      "Luca Mossina"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06054",
    "title": "Landslide Susceptibility Prediction Modeling Based on Self-Screening  Deep Learning Model",
    "abstract": "Landslide susceptibility prediction has always been an important and challenging content. However, there are some uncertain problems to be solved in susceptibility modeling, such as the error of landslide samples and the complex nonlinear relationship between environmental factors. A self-screening graph convolutional network and long short-term memory network (SGCN-LSTM) is proposed int this paper to overcome the above problems in landslide susceptibility prediction. The SGCN-LSTM model has the advantages of wide width and good learning ability. The landslide samples with large errors outside the set threshold interval are eliminated by self-screening network, and the nonlinear relationship between environmental factors can be extracted from both spatial nodes and time series, so as to better simulate the nonlinear relationship between environmental factors. The SGCN-LSTM model was applied to landslide susceptibility prediction in Anyuan County, Jiangxi Province, China, and compared with Cascade-parallel Long Short-Term Memory and Conditional Random Fields (CPLSTM-CRF), Random Forest (RF), Support Vector Machine (SVM), Stochastic Gradient Descent (SGD) and Logistic Regression (LR) models.The landslide prediction experiment in Anyuan County showed that the total accuracy and AUC of SGCN-LSTM model were the highest among the six models, and the total accuracy reached 92.38 %, which was 5.88%, 12.44%, 19.65%, 19.92% and 20.34% higher than those of CPLSTM-CRF, RF, SVM, SGD and LR models, respectively. The AUC value reached 0.9782, which was 0.0305,0.0532,0.1875,0.1909 and 0.1829 higher than the other five models, respectively. In conclusion, compared with some existing traditional machine learning, the SGCN-LSTM model proposed in this paper has higher landslide prediction accuracy and better robustness, and has a good application prospect in the LSP field. ",
    "url": "https://arxiv.org/abs/2304.06054",
    "authors": [
      "Li Zhu",
      "Lekai Liu",
      "Changshi Yu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Geophysics (physics.geo-ph)"
    ]
  },
  {
    "id": "arXiv:2304.06056",
    "title": "Exploiting Intrinsic Stochasticity of Real-Time Simulation to Facilitate  Robust Reinforcement Learning for Robot Manipulation",
    "abstract": "Simulation is essential to reinforcement learning (RL) before implementation in the real world, especially for safety-critical applications like robot manipulation. Conventionally, RL agents are sensitive to the discrepancies between the simulation and the real world, known as the sim-to-real gap. The application of domain randomization, a technique used to fill this gap, is limited to the imposition of heuristic-randomized models. We investigate the properties of intrinsic stochasticity of real-time simulation (RT-IS) of off-the-shelf simulation software and its potential to improve the robustness of RL methods and the performance of domain randomization. Firstly, we conduct analytical studies to measure the correlation of RT-IS with the occupation of the computer hardware and validate its comparability with the natural stochasticity of a physical robot. Then, we apply the RT-IS feature in the training of an RL agent. The simulation and physical experiment results verify the feasibility and applicability of RT-IS to robust RL agent design for robot manipulation tasks. The RT-IS-powered robust RL agent outperforms conventional RL agents on robots with modeling uncertainties. It requires fewer heuristic randomization and achieves better generalizability than the conventional domain-randomization-powered agents. Our findings provide a new perspective on the sim-to-real problem in practical applications like robot manipulation tasks. ",
    "url": "https://arxiv.org/abs/2304.06056",
    "authors": [
      "Ram Dershan",
      "Amir M. Soufi Enayati",
      "Zengjie Zhang",
      "Dean Richert",
      "Homayoun Najjaran"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.06094",
    "title": "Energy-guided Entropic Neural Optimal Transport",
    "abstract": "Energy-Based Models (EBMs) are known in the Machine Learning community for the decades. Since the seminal works devoted to EBMs dating back to the noughties there have been appearing a lot of efficient methods which solve the generative modelling problem by means of energy potentials (unnormalized likelihood functions). In contrast, the realm of Optimal Transport (OT) and, in particular, neural OT solvers is much less explored and limited by few recent works (excluding WGAN based approaches which utilize OT as a loss function and do not model OT maps themselves). In our work, we bridge the gap between EBMs and Entropy-regularized OT. We present the novel methodology which allows utilizing the recent developments and technical improvements of the former in order to enrich the latter. We validate the applicability of our method on toy 2D scenarios as well as standard unpaired image-to-image translation problems. For the sake of simplicity, we choose simple short- and long- run EBMs as a backbone of our Energy-guided Entropic OT method, leaving the application of more sophisticated EBMs for future research. ",
    "url": "https://arxiv.org/abs/2304.06094",
    "authors": [
      "Petr Mokrov",
      "Alexander Korotin",
      "Evgeny Burnaev"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.06103",
    "title": "$E(3) \\times SO(3)$-Equivariant Networks for Spherical Deconvolution in  Diffusion MRI",
    "abstract": "We present Roto-Translation Equivariant Spherical Deconvolution (RT-ESD), an $E(3)\\times SO(3)$ equivariant framework for sparse deconvolution of volumes where each voxel contains a spherical signal. Such 6D data naturally arises in diffusion MRI (dMRI), a medical imaging modality widely used to measure microstructure and structural connectivity. As each dMRI voxel is typically a mixture of various overlapping structures, there is a need for blind deconvolution to recover crossing anatomical structures such as white matter tracts. Existing dMRI work takes either an iterative or deep learning approach to sparse spherical deconvolution, yet it typically does not account for relationships between neighboring measurements. This work constructs equivariant deep learning layers which respect to symmetries of spatial rotations, reflections, and translations, alongside the symmetries of voxelwise spherical rotations. As a result, RT-ESD improves on previous work across several tasks including fiber recovery on the DiSCo dataset, deconvolution-derived partial volume estimation on real-world \\textit{in vivo} human brain dMRI, and improved downstream reconstruction of fiber tractograms on the Tractometer dataset. Our implementation is available at https://github.com/AxelElaldi/e3so3_conv ",
    "url": "https://arxiv.org/abs/2304.06103",
    "authors": [
      "Axel Elaldi",
      "Guido Gerig",
      "Neel Dey"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06106",
    "title": "Generation of artificial facial drug abuse images using Deep  De-identified anonymous Dataset augmentation through Genetics Algorithm  (3DG-GA)",
    "abstract": "In biomedical research and artificial intelligence, access to large, well-balanced, and representative datasets is crucial for developing trustworthy applications that can be used in real-world scenarios. However, obtaining such datasets can be challenging, as they are often restricted to hospitals and specialized facilities. To address this issue, the study proposes to generate highly realistic synthetic faces exhibiting drug abuse traits through augmentation. The proposed method, called \"3DG-GA\", Deep De-identified anonymous Dataset Generation, uses Genetics Algorithm as a strategy for synthetic faces generation. The algorithm includes GAN artificial face generation, forgery detection, and face recognition. Initially, a dataset of 120 images of actual facial drug abuse is used. By preserving, the drug traits, the 3DG-GA provides a dataset containing 3000 synthetic facial drug abuse images. The dataset will be open to the scientific community, which can reproduce our results and benefit from the generated datasets while avoiding legal or ethical restrictions. ",
    "url": "https://arxiv.org/abs/2304.06106",
    "authors": [
      "Hazem Zein",
      "Lou Laurent",
      "Régis Fournier",
      "Amine Nait-Ali"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.06116",
    "title": "AutoShot: A Short Video Dataset and State-of-the-Art Shot Boundary  Detection",
    "abstract": "The short-form videos have explosive popularity and have dominated the new social media trends. Prevailing short-video platforms,~\\textit{e.g.}, Kuaishou (Kwai), TikTok, Instagram Reels, and YouTube Shorts, have changed the way we consume and create content. For video content creation and understanding, the shot boundary detection (SBD) is one of the most essential components in various scenarios. In this work, we release a new public Short video sHot bOundary deTection dataset, named SHOT, consisting of 853 complete short videos and 11,606 shot annotations, with 2,716 high quality shot boundary annotations in 200 test videos. Leveraging this new data wealth, we propose to optimize the model design for video SBD, by conducting neural architecture search in a search space encapsulating various advanced 3D ConvNets and Transformers. Our proposed approach, named AutoShot, achieves higher F1 scores than previous state-of-the-art approaches, e.g., outperforming TransNetV2 by 4.2%, when being derived and evaluated on our newly constructed SHOT dataset. Moreover, to validate the generalizability of the AutoShot architecture, we directly evaluate it on another three public datasets: ClipShots, BBC and RAI, and the F1 scores of AutoShot outperform previous state-of-the-art approaches by 1.1%, 0.9% and 1.2%, respectively. The SHOT dataset and code can be found in https://github.com/wentaozhu/AutoShot.git . ",
    "url": "https://arxiv.org/abs/2304.06116",
    "authors": [
      "Wentao Zhu",
      "Yufang Huang",
      "Xiufeng Xie",
      "Wenxian Liu",
      "Jincan Deng",
      "Debing Zhang",
      "Zhangyang Wang",
      "Ji Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Multimedia (cs.MM)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2304.06120",
    "title": "Sensing the Pulse of the Pandemic: Geovisualizing the Demographic  Disparities of Public Sentiment toward COVID-19 through Social Media",
    "abstract": "Social media offers a unique lens to observe users emotions and subjective feelings toward critical events or topics and has been widely used to investigate public sentiment during crises, e.g., the COVID-19 pandemic. However, social media use varies across demographic groups, with younger people being more inclined to use social media than the older population. This digital divide could lead to biases in data representativeness and analysis results, causing a persistent challenge in research based on social media data. This study aims to tackle this challenge through a case study of estimating the public sentiment about the COVID-19 using social media data. We analyzed the pandemic-related Twitter data in the United States from January 2020 to December 2021. The objectives are: (1) to elucidate the uneven social media usage among various demographic groups and the disparities of their emotions toward COVID-19, (2) to construct an unbiased measurement for public sentiment based on social media data, the Sentiment Adjusted by Demographics (SAD) index, through the post-stratification method, and (3) to evaluate the spatially and temporally evolved public sentiment toward COVID-19 using the SAD index. The results show significant discrepancies among demographic groups in their COVID-19-related emotions. Female and under or equal to 18 years old Twitter users expressed long-term negative sentiment toward COVID-19. The proposed SAD index in this study corrected the underestimation of negative sentiment in 31 states, especially in Vermont. According to the SAD index, Twitter users in Wyoming (Vermont) posted the largest (smallest) percentage of negative tweets toward the pandemic. ",
    "url": "https://arxiv.org/abs/2304.06120",
    "authors": [
      "Binbin Lin",
      "Lei Zou",
      "Heng Cai",
      "Mingzheng Yang",
      "Bing Zhou"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Social and Information Networks (cs.SI)",
      "Physics and Society (physics.soc-ph)"
    ]
  },
  {
    "id": "arXiv:2304.06121",
    "title": "FollowMe: Vehicle Behaviour Prediction in Autonomous Vehicle Settings",
    "abstract": "An ego vehicle following a virtual lead vehicle planned route is an essential component when autonomous and non-autonomous vehicles interact. Yet, there is a question about the driver's ability to follow the planned lead vehicle route. Thus, predicting the trajectory of the ego vehicle route given a lead vehicle route is of interest. We introduce a new dataset, the FollowMe dataset, which offers a motion and behavior prediction problem by answering the latter question of the driver's ability to follow a lead vehicle. We also introduce a deep spatio-temporal graph model FollowMe-STGCNN as a baseline for the dataset. In our experiments and analysis, we show the design benefits of FollowMe-STGCNN in capturing the interactions that lie within the dataset. We contrast the performance of FollowMe-STGCNN with prior motion prediction models showing the need to have a different design mechanism to address the lead vehicle following settings. ",
    "url": "https://arxiv.org/abs/2304.06121",
    "authors": [
      "Abduallah Mohamed",
      "Jundi Liu",
      "Linda Ng Boyle",
      "Christian Claudel"
    ],
    "subjectives": [
      "Robotics (cs.RO)",
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06125",
    "title": "Assessment Framework for Deepfake Detection in Real-world Situations",
    "abstract": "Detecting digital face manipulation in images and video has attracted extensive attention due to the potential risk to public trust. To counteract the malicious usage of such techniques, deep learning-based deepfake detection methods have been employed and have exhibited remarkable performance. However, the performance of such detectors is often assessed on related benchmarks that hardly reflect real-world situations. For example, the impact of various image and video processing operations and typical workflow distortions on detection accuracy has not been systematically measured. In this paper, a more reliable assessment framework is proposed to evaluate the performance of learning-based deepfake detectors in more realistic settings. To the best of our acknowledgment, it is the first systematic assessment approach for deepfake detectors that not only reports the general performance under real-world conditions but also quantitatively measures their robustness toward different processing operations. To demonstrate the effectiveness and usage of the framework, extensive experiments and detailed analysis of three popular deepfake detection methods are further presented in this paper. In addition, a stochastic degradation-based data augmentation method driven by realistic processing operations is designed, which significantly improves the robustness of deepfake detectors. ",
    "url": "https://arxiv.org/abs/2304.06125",
    "authors": [
      "Yuhang Lu",
      "Touradj Ebrahimi"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.06128",
    "title": "Physical Layer Security for STAR-RIS-NOMA in Large-Scale Networks",
    "abstract": "In this paper, an analytical framework for secure simultaneous transmitting and reflecting reconfigurable intelligent surface (STAR-RIS) assisted non-orthogonal multiple access (NOMA) transmissions in large-scale networks is proposed, where users and eavesdroppers are randomly distributed. Both the time-switching protocol (TS) and energy splitting (ES) protocol are considered for the STAR-RIS. To characterize system performance, the channel statistics are first provided, and the Gamma approximation is adopted for general cascaded $\\kappa$-$\\mu$ fading. Afterward, the closed-form expressions for both the secrecy outage probability and secrecy ergodic rate are derived. To obtain further insights, the asymptotic performance for the secrecy diversity order and the secrecy slope are deduced. The theoretical results show that 1) the secrecy diversity orders of the strong user and the weak user depend on the path loss exponent and the distribution of the received signal-to-noise ratio, respectively; 2) the secrecy slope of the ES protocol achieves the value of one, higher than the slope of the TS protocol which is the mode operation parameter of TS. The numerical results demonstrate that: 1) there is an optimal STAR-RIS mode operation parameter to maximize the system performance; 2) the STAR-RIS-NOMA significantly outperforms the STAR-RIS-orthogonal multiple access. ",
    "url": "https://arxiv.org/abs/2304.06128",
    "authors": [
      "Ziyi Xie",
      "Yuanwei Liu",
      "Wenqiang Yi",
      "Xuanli Wu",
      "Arumugam Nallanathan"
    ],
    "subjectives": [
      "Information Theory (cs.IT)"
    ]
  },
  {
    "id": "arXiv:2304.06148",
    "title": "Detection of Fake Generated Scientific Abstracts",
    "abstract": "The widespread adoption of Large Language Models and publicly available ChatGPT has marked a significant turning point in the integration of Artificial Intelligence into people's everyday lives. The academic community has taken notice of these technological advancements and has expressed concerns regarding the difficulty of discriminating between what is real and what is artificially generated. Thus, researchers have been working on developing effective systems to identify machine-generated text. In this study, we utilize the GPT-3 model to generate scientific paper abstracts through Artificial Intelligence and explore various text representation methods when combined with Machine Learning models with the aim of identifying machine-written text. We analyze the models' performance and address several research questions that rise during the analysis of the results. By conducting this research, we shed light on the capabilities and limitations of Artificial Intelligence generated text. ",
    "url": "https://arxiv.org/abs/2304.06148",
    "authors": [
      "Panagiotis C. Theocharopoulos",
      "Panagiotis Anagnostou",
      "Anastasia Tsoukala",
      "Spiros V. Georgakopoulos",
      "Sotiris K. Tasoulis",
      "Vassilis P. Plagianakos"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.06150",
    "title": "A Quasi-Conforming Embedded Reproducing Kernel Particle Method for  Heterogeneous Materials",
    "abstract": "We present a quasi-conforming embedded reproducing kernel particle method (QCE-RKPM) for modeling heterogeneous materials that makes use of techniques not available to mesh-based methods such as the finite element method (FEM) and avoids many of the drawbacks in current embedded and immersed formulations which are based on meshed methods. The different material domains are discretized independently thus avoiding time-consuming, conformal meshing. In this approach, the superposition of foreground (inclusion) and background (matrix) domain integration smoothing cells are corrected by a quasi-conforming quadtree subdivision on the background integration smoothing cells. Due to the non-conforming nature of the background integration smoothing cells near the material interfaces, a variationally consistent (VC) correction for domain integration is introduced to restore integration constraints and thus optimal convergence rates at a minor computational cost. Additional interface integration smoothing cells with area (volume) correction, while non-conforming, can be easily introduced to further enhance the accuracy and stability of the Galerkin solution using VC integration on non-conforming cells. To properly approximate the weak discontinuity across the material interface by a penalty-free Nitsche's method with enhanced coercivity, the interface nodes on the surface of the foreground discretization are also shared with the background discretization. As such, there are no tunable parameters, such as those involved in the penalty type method, to enforce interface compatibility in this approach. The advantage of this meshfree formulation is that it avoids many of the instabilities in mesh-based immersed and embedded methods. The effectiveness of QCE-RKPM is illustrated with several examples. ",
    "url": "https://arxiv.org/abs/2304.06150",
    "authors": [
      "Ryan T. Schlinkman",
      "Jonghyuk Baek",
      "Frank N. Beckwith",
      "Stacy M. Nelson",
      "J. S. Chen"
    ],
    "subjectives": [
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2304.06160",
    "title": "Learning Robust and Correct Controllers from Signal Temporal Logic  Specifications Using BarrierNet",
    "abstract": "In this paper, we consider the problem of learning a neural network controller for a system required to satisfy a Signal Temporal Logic (STL) specification. We exploit STL quantitative semantics to define a notion of robust satisfaction. Guaranteeing the correctness of a neural network controller, i.e., ensuring the satisfaction of the specification by the controlled system, is a difficult problem that received a lot of attention recently. We provide a general procedure to construct a set of trainable High Order Control Barrier Functions (HOCBFs) enforcing the satisfaction of formulas in a fragment of STL. We use the BarrierNet, implemented by a differentiable Quadratic Program (dQP) with HOCBF constraints, as the last layer of the neural network controller, to guarantee the satisfaction of the STL formulas. We train the HOCBFs together with other neural network parameters to further improve the robustness of the controller. Simulation results demonstrate that our approach ensures satisfaction and outperforms existing algorithms. ",
    "url": "https://arxiv.org/abs/2304.06160",
    "authors": [
      "Wenliang Liu",
      "Wei Xiao",
      "Calin Belta"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06168",
    "title": "NP-Free: A Real-Time Normalization-free and Parameter-tuning-free  Representation Approach for Open-ended Time Series",
    "abstract": "As more connected devices are implemented in a cyber-physical world and data is expected to be collected and processed in real time, the ability to handle time series data has become increasingly significant. To help analyze time series in data mining applications, many time series representation approaches have been proposed to convert a raw time series into another series for representing the original time series. However, existing approaches are not designed for open-ended time series (which is a sequence of data points being continuously collected at a fixed interval without any length limit) because these approaches need to know the total length of the target time series in advance and pre-process the entire time series using normalization methods. Furthermore, many representation approaches require users to configure and tune some parameters beforehand in order to achieve satisfactory representation results. In this paper, we propose NP-Free, a real-time Normalization-free and Parameter-tuning-free representation approach for open-ended time series. Without needing to use any normalization method or tune any parameter, NP-Free can generate a representation for a raw time series on the fly by converting each data point of the time series into a root-mean-square error (RMSE) value based on Long Short-Term Memory (LSTM) and a Look-Back and Predict-Forward strategy. To demonstrate the capability of NP-Free in representing time series, we conducted several experiments based on real-world open-source time series datasets. We also evaluated the time consumption of NP-Free in generating representations. ",
    "url": "https://arxiv.org/abs/2304.06168",
    "authors": [
      "Ming-Chang Lee",
      "Jia-Chun Lin",
      "Volker Stolz"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06175",
    "title": "Robust and Context-Aware Real-Time Collaborative Robot Handling via  Dynamic Gesture Commands",
    "abstract": "This paper studies real-time collaborative robot (cobot) handling, where the cobot maneuvers an object under human dynamic gesture commands. Enabling dynamic gesture commands is useful when the human needs to avoid direct contact with the robot or the object handled by the robot. However, the key challenge lies in the heterogeneity in human behaviors and the stochasticity in the perception of dynamic gestures, which requires the robot handling policy to be adaptable and robust. To address these challenges, we introduce Conditional Collaborative Handling Process (CCHP) to encode a contextaware cobot handling policy and a procedure to learn such policy from human-human collaboration. We thoroughly evaluate the adaptability and robustness of CCHP and apply our approach to a real-time cobot assembly task with Kinova Gen3 robot arm. Results show that our method leads to significantly less human effort and smoother human-robot collaboration than state-of-the-art rule-based approach even with first-time users. ",
    "url": "https://arxiv.org/abs/2304.06175",
    "authors": [
      "Rui Chen",
      "Alvin Shek",
      "Changliu Liu"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.06205",
    "title": "Difficult Lessons on Social Prediction from Wisconsin Public Schools",
    "abstract": "Early warning systems (EWS) are prediction algorithms that have recently taken a central role in efforts to improve graduation rates in public schools across the US. These systems assist in targeting interventions at individual students by predicting which students are at risk of dropping out. Despite significant investments and adoption, there remain significant gaps in our understanding of the efficacy of EWS. In this work, we draw on nearly a decade's worth of data from a system used throughout Wisconsin to provide the first large-scale evaluation of the long-term impact of EWS on graduation outcomes. We present evidence that risk assessments made by the prediction system are highly accurate, including for students from marginalized backgrounds. Despite the system's accuracy and widespread use, we find no evidence that it has led to improved graduation rates. We surface a robust statistical pattern that can explain why these seemingly contradictory insights hold. Namely, environmental features, measured at the level of schools, contain significant signal about dropout risk. Within each school, however, academic outcomes are essentially independent of individual student performance. This empirical observation indicates that assigning all students within the same school the same probability of graduation is a nearly optimal prediction. Our work provides an empirical backbone for the robust, qualitative understanding among education researchers and policy-makers that dropout is structurally determined. The primary barrier to improving outcomes lies not in identifying students at risk of dropping out within specific schools, but rather in overcoming structural differences across different school districts. Our findings indicate that we should carefully evaluate the decision to fund early warning systems without also devoting resources to interventions tackling structural barriers. ",
    "url": "https://arxiv.org/abs/2304.06205",
    "authors": [
      "Juan C. Perdomo",
      "Tolani Britton",
      "Moritz Hardt",
      "Rediet Abebe"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)",
      "Machine Learning (cs.LG)",
      "General Economics (econ.GN)",
      "Applications (stat.AP)"
    ]
  },
  {
    "id": "arXiv:2304.06224",
    "title": "Minimal-time Deadbeat Consensus and Individual Disagreement Degree  Prediction for High-order Linear Multi-agent Systems",
    "abstract": "In this paper, a Hankel matrix-based fully distributed algorithm is proposed to address a minimal-time deadbeat consensus prediction problem for discrete-time high-order multi-agent systems (MASs). Therein, each agent can predict the consensus value with the minimum number of observable historical outputs of its own. Accordingly, compared to most existing algorithms only yielding asymptotic convergence, the present method can attain deadbeat consensus instead. Moreover, based on the consensus value prediction, instant individual disagreement degree value of MASs can be calculated in advance as well. Sufficient conditions are derived to guarantee both the minimal-time deadbeat consensus and the instant individual disagreement degree prediction. Finally, both the effectiveness and superiority of the proposed deadbeat consensus algorithm are substantiated by numerical simulations. ",
    "url": "https://arxiv.org/abs/2304.06224",
    "authors": [
      "Fu-Long Hu",
      "Hai-Tao Zhang",
      "Bowen Xu",
      "Zhe Hu",
      "Wei Ren"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.06233",
    "title": "Situational-Aware Multi-Graph Convolutional Recurrent Network (SA-MGCRN)  for Travel Demand Forecasting During Wildfires",
    "abstract": "Real-time forecasting of travel demand during wildfire evacuations is crucial for emergency managers and transportation planners to make timely and better-informed decisions. However, few studies focus on accurate travel demand forecasting in large-scale emergency evacuations. Therefore, this study develops and tests a new methodological framework for modeling trip generation in wildfire evacuations by using (a) large-scale GPS data generated by mobile devices and (b) state-of-the-art AI technologies. The proposed methodology aims at forecasting evacuation trips and other types of trips. Based on the travel demand inferred from the GPS data, we develop a new deep learning model, i.e., Situational-Aware Multi-Graph Convolutional Recurrent Network (SA-MGCRN), along with a model updating scheme to achieve real-time forecasting of travel demand during wildfire evacuations. The proposed methodological framework is tested in this study for a real-world case study: the 2019 Kincade Fire in Sonoma County, CA. The results show that SA-MGCRN significantly outperforms all the selected state-of-the-art benchmarks in terms of prediction performance. Our finding suggests that the most important model components of SA-MGCRN are evacuation order/warning information, proximity to fire, and population change, which are consistent with behavioral theories and empirical findings. ",
    "url": "https://arxiv.org/abs/2304.06233",
    "authors": [
      "Xiaojian Zhang",
      "Xilei Zhao",
      "Yiming Xu",
      "Ruggiero Lovreglio",
      "Daniel Nilsson"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06234",
    "title": "Physics-informed radial basis network (PIRBN): A local approximation  neural network for solving nonlinear PDEs",
    "abstract": "Our recent intensive study has found that physics-informed neural networks (PINN) tend to be local approximators after training. This observation leads to this novel physics-informed radial basis network (PIRBN), which can maintain the local property throughout the entire training process. Compared to deep neural networks, a PIRBN comprises of only one hidden layer and a radial basis \"activation\" function. Under appropriate conditions, we demonstrated that the training of PIRBNs using gradient descendent methods can converge to Gaussian processes. Besides, we studied the training dynamics of PIRBN via the neural tangent kernel (NTK) theory. In addition, comprehensive investigations regarding the initialisation strategies of PIRBN were conducted. Based on numerical examples, PIRBN has been demonstrated to be more effective and efficient than PINN in solving PDEs with high-frequency features and ill-posed computational domains. Moreover, the existing PINN numerical techniques, such as adaptive learning, decomposition and different types of loss functions, are applicable to PIRBN. The programs that can regenerate all numerical results can be found at https://github.com/JinshuaiBai/PIRBN. ",
    "url": "https://arxiv.org/abs/2304.06234",
    "authors": [
      "Jinshuai Bai",
      "Gui-Rong Liu",
      "Ashish Gupta",
      "Laith Alzubaidi",
      "Xi-Qiao Feng",
      "YuanTong Gu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06236",
    "title": "Cross-View Hierarchy Network for Stereo Image Super-Resolution",
    "abstract": "Stereo image super-resolution aims to improve the quality of high-resolution stereo image pairs by exploiting complementary information across views. To attain superior performance, many methods have prioritized designing complex modules to fuse similar information across views, yet overlooking the importance of intra-view information for high-resolution reconstruction. It also leads to problems of wrong texture in recovered images. To address this issue, we explore the interdependencies between various hierarchies from intra-view and propose a novel method, named Cross-View-Hierarchy Network for Stereo Image Super-Resolution (CVHSSR). Specifically, we design a cross-hierarchy information mining block (CHIMB) that leverages channel attention and large kernel convolution attention to extract both global and local features from the intra-view, enabling the efficient restoration of accurate texture details. Additionally, a cross-view interaction module (CVIM) is proposed to fuse similar features from different views by utilizing cross-view attention mechanisms, effectively adapting to the binocular scene. Extensive experiments demonstrate the effectiveness of our method. CVHSSR achieves the best stereo image super-resolution performance than other state-of-the-art methods while using fewer parameters. The source code and pre-trained models are available at https://github.com/AlexZou14/CVHSSR. ",
    "url": "https://arxiv.org/abs/2304.06236",
    "authors": [
      "Wenbin Zou",
      "Hongxia Gao",
      "Liang Chen",
      "Yunchen Zhang",
      "Mingchao Jiang",
      "Zhongxin Yu",
      "Ming Tan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06264",
    "title": "Loosely Coupled Odometry, UWB Ranging, and Cooperative Spatial Detection  for Relative Monte-Carlo Multi-Robot Localization",
    "abstract": "As mobile robots become more ubiquitous, their deployments grow across use cases where GNSS positioning is either unavailable or unreliable. This has led to increased interest in multi-modal relative localization methods. Complementing onboard odometry, ranging allows for relative state estimation, with ultra-wideband (UWB) ranging having gained widespread recognition due to its low cost and centimeter-level out-of-box accuracy. Infrastructure-free localization methods allow for more dynamic, ad-hoc, and flexible deployments, yet they have received less attention from the research community. In this work, we propose a cooperative relative multi-robot localization where we leverage inter-robot ranging and simultaneous spatial detections of objects in the environment. To achieve this, we equip robots with a single UWB transceiver and a stereo camera. We propose a novel Monte-Carlo approach to estimate relative states by either employing only UWB ranges or dynamically integrating simultaneous spatial detections from the stereo cameras. We also address the challenges for UWB ranging error mitigation, especially in non-line-of-sight, with a study on different LSTM networks to estimate the ranging error. The proposed approach has multiple benefits. First, we show that a single range is enough to estimate the accurate relative states of two robots when fusing odometry measurements. Second, our experiments also demonstrate that our approach surpasses traditional methods such as multilateration in terms of accuracy. Third, to increase accuracy even further, we allow for the integration of cooperative spatial detections. Finally, we show how ROS 2 and Zenoh can be integrated to build a scalable wireless communication solution for multi-robot systems. The experimental validation includes real-time deployment and autonomous navigation based on the relative positioning method. ",
    "url": "https://arxiv.org/abs/2304.06264",
    "authors": [
      "Xianjia Yu",
      "Paola Torrico Morrn",
      "Sahar Salimpour",
      "Jorge Pena Queralta",
      "Tomi Westerlund"
    ],
    "subjectives": [
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.06270",
    "title": "Gamifying Math Education using Object Detection",
    "abstract": "Manipulatives used in the right way help improve mathematical concepts leading to better learning outcomes. In this paper, we present a phygital (physical + digital) curriculum inspired teaching system for kids aged 5-8 to learn geometry using shape tile manipulatives. Combining smaller shapes to form larger ones is an important skill kids learn early on which requires shape tiles to be placed close to each other in the play area. This introduces a challenge of oriented object detection for densely packed objects with arbitrary orientations. Leveraging simulated data for neural network training and light-weight mobile architectures, we enable our system to understand user interactions and provide real-time audiovisual feedback. Experimental results show that our network runs real-time with high precision/recall on consumer devices, thereby providing a consistent and enjoyable learning experience. ",
    "url": "https://arxiv.org/abs/2304.06270",
    "authors": [
      "Yueqiu Sun",
      "Rohitkrishna Nambiar",
      "Vivek Vidyasagaran"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06280",
    "title": "BotMoE: Twitter Bot Detection with Community-Aware Mixtures of  Modal-Specific Experts",
    "abstract": "Twitter bot detection has become a crucial task in efforts to combat online misinformation, mitigate election interference, and curb malicious propaganda. However, advanced Twitter bots often attempt to mimic the characteristics of genuine users through feature manipulation and disguise themselves to fit in diverse user communities, posing challenges for existing Twitter bot detection models. To this end, we propose BotMoE, a Twitter bot detection framework that jointly utilizes multiple user information modalities (metadata, textual content, network structure) to improve the detection of deceptive bots. Furthermore, BotMoE incorporates a community-aware Mixture-of-Experts (MoE) layer to improve domain generalization and adapt to different Twitter communities. Specifically, BotMoE constructs modal-specific encoders for metadata features, textual content, and graphical structure, which jointly model Twitter users from three modal-specific perspectives. We then employ a community-aware MoE layer to automatically assign users to different communities and leverage the corresponding expert networks. Finally, user representations from metadata, text, and graph perspectives are fused with an expert fusion layer, combining all three modalities while measuring the consistency of user information. Extensive experiments demonstrate that BotMoE significantly advances the state-of-the-art on three Twitter bot detection benchmarks. Studies also confirm that BotMoE captures advanced and evasive bots, alleviates the reliance on training data, and better generalizes to new and previously unseen user communities. ",
    "url": "https://arxiv.org/abs/2304.06280",
    "authors": [
      "Yuhan Liu",
      "Zhaoxuan Tan",
      "Heng Wang",
      "Shangbin Feng",
      "Qinghua Zheng",
      "Minnan Luo"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)"
    ]
  },
  {
    "id": "arXiv:2304.06287",
    "title": "NeRFVS: Neural Radiance Fields for Free View Synthesis via Geometry  Scaffolds",
    "abstract": "We present NeRFVS, a novel neural radiance fields (NeRF) based method to enable free navigation in a room. NeRF achieves impressive performance in rendering images for novel views similar to the input views while suffering for novel views that are significantly different from the training views. To address this issue, we utilize the holistic priors, including pseudo depth maps and view coverage information, from neural reconstruction to guide the learning of implicit neural representations of 3D indoor scenes. Concretely, an off-the-shelf neural reconstruction method is leveraged to generate a geometry scaffold. Then, two loss functions based on the holistic priors are proposed to improve the learning of NeRF: 1) A robust depth loss that can tolerate the error of the pseudo depth map to guide the geometry learning of NeRF; 2) A variance loss to regularize the variance of implicit neural representations to reduce the geometry and color ambiguity in the learning procedure. These two loss functions are modulated during NeRF optimization according to the view coverage information to reduce the negative influence brought by the view coverage imbalance. Extensive results demonstrate that our NeRFVS outperforms state-of-the-art view synthesis methods quantitatively and qualitatively on indoor scenes, achieving high-fidelity free navigation results. ",
    "url": "https://arxiv.org/abs/2304.06287",
    "authors": [
      "Chen Yang",
      "Peihao Li",
      "Zanwei Zhou",
      "Shanxin Yuan",
      "Bingbing Liu",
      "Xiaokang Yang",
      "Weichao Qiu",
      "Wei Shen"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.06299",
    "title": "Algorithms and Hardware for Efficient Processing of Logic-based Neural  Networks",
    "abstract": "Recent efforts to improve the performance of neural network (NN) accelerators that meet today's application requirements have given rise to a new trend of logic-based NN inference relying on fixed-function combinational logic (FFCL). This paper presents an innovative optimization methodology for compiling and mapping NNs utilizing FFCL into a logic processor. The presented method maps FFCL blocks to a set of Boolean functions where Boolean operations in each function are mapped to high-performance, low-latency, parallelized processing elements. Graph partitioning and scheduling algorithms are presented to handle FFCL blocks that cannot straightforwardly fit the logic processor. Our experimental evaluations across several datasets and NNs demonstrate the superior performance of our framework in terms of the inference throughput compared to prior art NN accelerators. We achieve 25x higher throughput compared with the XNOR-based accelerator for VGG16 model that can be amplified 5x deploying the graph partitioning and merging algorithms. ",
    "url": "https://arxiv.org/abs/2304.06299",
    "authors": [
      "Jingkai Hong",
      "Arash Fayyazi",
      "Amirhossein Esmaili",
      "Mahdi Nazemi",
      "Massoud Pedram"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2304.06300",
    "title": "CoMP Transmission in Downlink NOMA-Based Cellular-Connected UAV Networks",
    "abstract": "In this paper, we study the integration between the coordinated multipoint (CoMP) transmission and the non-orthogonal multiple access (NOMA) in the downlink cellular-connected UAV networks with the coexistence of aerial users (AUs) and terrestrial users (TUs). Based on the comparison of the desired signal strength to the dominant interference strength, the AUs are classified into CoMP-AUs and Non-CoMP AUs, where the former receives transmissions from two cooperative BSs, and constructs two exclusive NOMA clusters with two TUs, respectively. A Non-CoMP AU constructs a NOMA cluster with a TU served by the same BS. By leveraging the tools from stochastic geometry, we propose a novel analytical framework to evaluate the performance of the CoMP-NOMA based cellular-connected UAV network in terms of coverage probability, and average ergodic rate. We reveal the superiority of the proposed CoMP-NOMA scheme by comparing with three benchmark schemes, and further quantify the impacts of key system parameters on the network performance. By harvesting the benefits of both CoMP and NOMA, we prove that the proposed framework can provide reliable connection for AUs by using CoMP and enhance the average ergodic rate through NOMA technique as well. ",
    "url": "https://arxiv.org/abs/2304.06300",
    "authors": [
      "Hongguang Sun",
      "Linyi Zhang",
      "Tony Q. S. Quek",
      "Xijun Wang",
      "Yan Zhang"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.06305",
    "title": "Boosting Convolutional Neural Networks with Middle Spectrum Grouped  Convolution",
    "abstract": "This paper proposes a novel module called middle spectrum grouped convolution (MSGC) for efficient deep convolutional neural networks (DCNNs) with the mechanism of grouped convolution. It explores the broad \"middle spectrum\" area between channel pruning and conventional grouped convolution. Compared with channel pruning, MSGC can retain most of the information from the input feature maps due to the group mechanism; compared with grouped convolution, MSGC benefits from the learnability, the core of channel pruning, for constructing its group topology, leading to better channel division. The middle spectrum area is unfolded along four dimensions: group-wise, layer-wise, sample-wise, and attention-wise, making it possible to reveal more powerful and interpretable structures. As a result, the proposed module acts as a booster that can reduce the computational cost of the host backbones for general image recognition with even improved predictive accuracy. For example, in the experiments on ImageNet dataset for image classification, MSGC can reduce the multiply-accumulates (MACs) of ResNet-18 and ResNet-50 by half but still increase the Top-1 accuracy by more than 1%. With 35% reduction of MACs, MSGC can also increase the Top-1 accuracy of the MobileNetV2 backbone. Results on MS COCO dataset for object detection show similar observations. Our code and trained models are available at https://github.com/hellozhuo/msgc. ",
    "url": "https://arxiv.org/abs/2304.06305",
    "authors": [
      "Zhuo Su",
      "Jiehua Zhang",
      "Tianpeng Liu",
      "Zhen Liu",
      "Shuanghui Zhang",
      "Matti Pietikäinen",
      "Li Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06307",
    "title": "Rule-based detection of access to education and training in Germany",
    "abstract": "As a result of transformation processes, the German labor market is highly dependent on vocational training, retraining and continuing education. To match training seekers and offers, we present a novel approach towards the automated detection of access to education and training in German training offers and advertisements. We will in particular focus on (a) general school and education degrees and schoolleaving certificates, (b) professional experience, (c) a previous apprenticeship and (d) a list of skills provided by the German Federal Employment Agency. This novel approach combines several methods: First, we provide a mapping of synonyms in education combining different qualifications and adding deprecated terms. Second, we provide a rule-based matching to identify the need for professional experience or apprenticeship. However, not all access requirements can be matched due to incompatible data schemata or non-standardizes requirements, e.g initial tests or interviews. While we can identify several shortcomings, the presented approach offers promising results for two data sets: training and re-training advertisements. ",
    "url": "https://arxiv.org/abs/2304.06307",
    "authors": [
      "Jens Dörpinghaus",
      "David Samray",
      "Robert Helmrich"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2304.06313",
    "title": "Majority is not Needed: A Counterstrategy to Selfish Mining",
    "abstract": "In the last few years several papers investigated selfish mine attacks, most of which assumed that every miner that is not part of the selfish mine pool will continue to mine honestly. However, in reality, remaining honest is not always incentivized, particularly when another pool is employing selfish mining or other deviant strategies. In this work we explore the scenario in which a large enough pool capitalises on another selfish pool to gain 100\\% of the profit and commit double spending attacks. We show that this counterstrategy can effectively counter any deviant strategy, and that even the possibility of it discourages other pools from implementing deviant strategies. ",
    "url": "https://arxiv.org/abs/2304.06313",
    "authors": [
      "Jonathan Gal",
      "Maytal B Szabo"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.06327",
    "title": "An Automotive Case Study on the Limits of Approximation for Object  Detection",
    "abstract": "The accuracy of camera-based object detection (CBOD) built upon deep learning is often evaluated against the real objects in frames only. However, such simplistic evaluation ignores the fact that many unimportant objects are small, distant, or background, and hence, their misdetections have less impact than those for closer, larger, and foreground objects in domains such as autonomous driving. Moreover, sporadic misdetections are irrelevant since confidence on detections is typically averaged across consecutive frames, and detection devices (e.g. cameras, LiDARs) are often redundant, thus providing fault tolerance. This paper exploits such intrinsic fault tolerance of the CBOD process, and assesses in an automotive case study to what extent CBOD can tolerate approximation coming from multiple sources such as lower precision arithmetic, approximate arithmetic units, and even random faults due to, for instance, low voltage operation. We show that the accuracy impact of those sources of approximation is within 1% of the baseline even when considering the three approximate domains simultaneously, and hence, multiple sources of approximation can be exploited to build highly efficient accelerators for CBOD in cars. ",
    "url": "https://arxiv.org/abs/2304.06327",
    "authors": [
      "Martí Caro",
      "Hamid Tabani",
      "Jaume Abella",
      "Francesc Moll",
      "Enric Morancho",
      "Ramon Canal",
      "Josep Altet",
      "Antonio Calomarde",
      "Francisco J. Cazorla",
      "Antonio Rubio",
      "Pau Fontova",
      "Jordi Fornt"
    ],
    "subjectives": [
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2304.06335",
    "title": "Deep Learning-based Fall Detection Algorithm Using Ensemble Model of  Coarse-fine CNN and GRU Networks",
    "abstract": "Falls are the public health issue for the elderly all over the world since the fall-induced injuries are associated with a large amount of healthcare cost. Falls can cause serious injuries, even leading to death if the elderly suffers a \"long-lie\". Hence, a reliable fall detection (FD) system is required to provide an emergency alarm for first aid. Due to the advances in wearable device technology and artificial intelligence, some fall detection systems have been developed using machine learning and deep learning methods to analyze the signal collected from accelerometer and gyroscopes. In order to achieve better fall detection performance, an ensemble model that combines a coarse-fine convolutional neural network and gated recurrent unit is proposed in this study. The parallel structure design used in this model restores the different grains of spatial characteristics and capture temporal dependencies for feature representation. This study applies the FallAllD public dataset to validate the reliability of the proposed model, which achieves a recall, precision, and F-score of 92.54%, 96.13%, and 94.26%, respectively. The results demonstrate the reliability of the proposed ensemble model in discriminating falls from daily living activities and its superior performance compared to the state-of-the-art convolutional neural network long short-term memory (CNN-LSTM) for FD. ",
    "url": "https://arxiv.org/abs/2304.06335",
    "authors": [
      "Chien-Pin Liu",
      "Ju-Hsuan Li",
      "En-Ping Chu",
      "Chia-Yeh Hsieh",
      "Kai-Chun Liu",
      "Chia-Tai Chan",
      "Yu Tsao"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.06336",
    "title": "Attributed Multi-order Graph Convolutional Network for Heterogeneous  Graphs",
    "abstract": "Heterogeneous graph neural networks aim to discover discriminative node embeddings and relations from multi-relational networks.One challenge of heterogeneous graph learning is the design of learnable meta-paths, which significantly influences the quality of learned embeddings.Thus, in this paper, we propose an Attributed Multi-Order Graph Convolutional Network (AMOGCN), which automatically studies meta-paths containing multi-hop neighbors from an adaptive aggregation of multi-order adjacency matrices. The proposed model first builds different orders of adjacency matrices from manually designed node connections. After that, an intact multi-order adjacency matrix is attached from the automatic fusion of various orders of adjacency matrices. This process is supervised by the node semantic information, which is extracted from the node homophily evaluated by attributes. Eventually, we utilize a one-layer simplifying graph convolutional network with the learned multi-order adjacency matrix, which is equivalent to the cross-hop node information propagation with multi-layer graph neural networks. Substantial experiments reveal that AMOGCN gains superior semi-supervised classification performance compared with state-of-the-art competitors. ",
    "url": "https://arxiv.org/abs/2304.06336",
    "authors": [
      "Zhaoliang Chen",
      "Zhihao Wu",
      "Luying Zhong",
      "Claudia Plant",
      "Shiping Wang",
      "Wenzhong Guo"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.06349",
    "title": "Neural State-Space Models: Empirical Evaluation of Uncertainty  Quantification",
    "abstract": "Effective quantification of uncertainty is an essential and still missing step towards a greater adoption of deep-learning approaches in different applications, including mission-critical ones. In particular, investigations on the predictive uncertainty of deep-learning models describing non-linear dynamical systems are very limited to date. This paper is aimed at filling this gap and presents preliminary results on uncertainty quantification for system identification with neural state-space models. We frame the learning problem in a Bayesian probabilistic setting and obtain posterior distributions for the neural network's weights and outputs through approximate inference techniques. Based on the posterior, we construct credible intervals on the outputs and define a surprise index which can effectively diagnose usage of the model in a potentially dangerous out-of-distribution regime, where predictions cannot be trusted. ",
    "url": "https://arxiv.org/abs/2304.06349",
    "authors": [
      "Marco Forgione",
      "Dario Piga"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.06354",
    "title": "ODAM: Gradient-based instance-specific visual explanations for object  detection",
    "abstract": "We propose the gradient-weighted Object Detector Activation Maps (ODAM), a visualized explanation technique for interpreting the predictions of object detectors. Utilizing the gradients of detector targets flowing into the intermediate feature maps, ODAM produces heat maps that show the influence of regions on the detector's decision for each predicted attribute. Compared to previous works classification activation maps (CAM), ODAM generates instance-specific explanations rather than class-specific ones. We show that ODAM is applicable to both one-stage detectors and two-stage detectors with different types of detector backbones and heads, and produces higher-quality visual explanations than the state-of-the-art both effectively and efficiently. We next propose a training scheme, Odam-Train, to improve the explanation ability on object discrimination of the detector through encouraging consistency between explanations for detections on the same object, and distinct explanations for detections on different objects. Based on the heat maps produced by ODAM with Odam-Train, we propose Odam-NMS, which considers the information of the model's explanation for each prediction to distinguish the duplicate detected objects. We present a detailed analysis of the visualized explanations of detectors and carry out extensive experiments to validate the effectiveness of the proposed ODAM. ",
    "url": "https://arxiv.org/abs/2304.06354",
    "authors": [
      "Chenyang Zhao",
      "Antoni B. Chan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06359",
    "title": "Context-aware Coherent Speaking Style Prediction with Hierarchical  Transformers for Audiobook Speech Synthesis",
    "abstract": "Recent advances in text-to-speech have significantly improved the expressiveness of synthesized speech. However, it is still challenging to generate speech with contextually appropriate and coherent speaking style for multi-sentence text in audiobooks. In this paper, we propose a context-aware coherent speaking style prediction method for audiobook speech synthesis. To predict the style embedding of the current utterance, a hierarchical transformer-based context-aware style predictor with a mixture attention mask is designed, considering both text-side context information and speech-side style information of previous speeches. Based on this, we can generate long-form speech with coherent style and prosody sentence by sentence. Objective and subjective evaluations on a Mandarin audiobook dataset demonstrate that our proposed model can generate speech with more expressive and coherent speaking style than baselines, for both single-sentence and multi-sentence test. ",
    "url": "https://arxiv.org/abs/2304.06359",
    "authors": [
      "Shun Lei",
      "Yixuan Zhou",
      "Liyang Chen",
      "Zhiyong Wu",
      "Shiyin Kang",
      "Helen Meng"
    ],
    "subjectives": [
      "Sound (cs.SD)",
      "Audio and Speech Processing (eess.AS)"
    ]
  },
  {
    "id": "arXiv:2304.06369",
    "title": "An attack resilient policy on the tip pool for DAG-based distributed  ledgers",
    "abstract": "This paper discusses congestion control and inconsistency problems in DAG-based distributed ledgers and proposes an additional filter to mitigate these issues. Unlike traditional blockchains, DAG-based DLTs use a directed acyclic graph structure to organize transactions, allowing higher scalability and efficiency. However, this also introduces challenges in controlling the rate at which blocks are added to the network and preventing the influence of spam attacks. To address these challenges, we propose a filter to limit the tip pool size and to avoid referencing old blocks. Furthermore, we present experimental results to demonstrate the effectiveness of this filter in reducing the negative impacts of various attacks. Our approach offers a lightweight and efficient solution for managing the flow of blocks in DAG-based DLTs, which can enhance the consistency and reliability of these systems. Index ",
    "url": "https://arxiv.org/abs/2304.06369",
    "authors": [
      "Lianna Zhao",
      "Andrew Culleny",
      "Sebastian Muellerz",
      "Olivia Saay",
      "Robert Shorten"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2304.06370",
    "title": "Robust Multiview Multimodal Driver Monitoring System Using Masked  Multi-Head Self-Attention",
    "abstract": "Driver Monitoring Systems (DMSs) are crucial for safe hand-over actions in Level-2+ self-driving vehicles. State-of-the-art DMSs leverage multiple sensors mounted at different locations to monitor the driver and the vehicle's interior scene and employ decision-level fusion to integrate these heterogenous data. However, this fusion method may not fully utilize the complementarity of different data sources and may overlook their relative importance. To address these limitations, we propose a novel multiview multimodal driver monitoring system based on feature-level fusion through multi-head self-attention (MHSA). We demonstrate its effectiveness by comparing it against four alternative fusion strategies (Sum, Conv, SE, and AFF). We also present a novel GPU-friendly supervised contrastive learning framework SuMoCo to learn better representations. Furthermore, We fine-grained the test split of the DAD dataset to enable the multi-class recognition of drivers' activities. Experiments on this enhanced database demonstrate that 1) the proposed MHSA-based fusion method (AUC-ROC: 97.0\\%) outperforms all baselines and previous approaches, and 2) training MHSA with patch masking can improve its robustness against modality/view collapses. The code and annotations are publicly available. ",
    "url": "https://arxiv.org/abs/2304.06370",
    "authors": [
      "Yiming Ma",
      "Victor Sanchez",
      "Soodeh Nikan",
      "Devesh Upadhyay",
      "Bhushan Atote",
      "Tanaya Guha"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06375",
    "title": "Towards hypergraph cognitive networks as feature-rich models of  knowledge",
    "abstract": "Semantic networks provide a useful tool to understand how related concepts are retrieved from memory. However, most current network approaches use pairwise links to represent memory recall patterns. Pairwise connections neglect higher-order associations, i.e. relationships between more than two concepts at a time. These higher-order interactions might covariate with (and thus contain information about) how similar concepts are along psycholinguistic dimensions like arousal, valence, familiarity, gender and others. We overcome these limits by introducing feature-rich cognitive hypergraphs as quantitative models of human memory where: (i) concepts recalled together can all engage in hyperlinks involving also more than two concepts at once (cognitive hypergraph aspect), and (ii) each concept is endowed with a vector of psycholinguistic features (feature-rich aspect). We build hypergraphs from word association data and use evaluation methods from machine learning features to predict concept concreteness. Since concepts with similar concreteness tend to cluster together in human memory, we expect to be able to leverage this structure. Using word association data from the Small World of Words dataset, we compared a pairwise network and a hypergraph with N=3586 concepts/nodes. Interpretable artificial intelligence models trained on (1) psycholinguistic features only, (2) pairwise-based feature aggregations, and on (3) hypergraph-based aggregations show significant differences between pairwise and hypergraph links. Specifically, our results show that higher-order and feature-rich hypergraph models contain richer information than pairwise networks leading to improved prediction of word concreteness. The relation with previous studies about conceptual clustering and compartmentalisation in associative knowledge and human memory are discussed. ",
    "url": "https://arxiv.org/abs/2304.06375",
    "authors": [
      "Salvatore Citraro",
      "Simon De Deyne",
      "Massimo Stella",
      "Giulio Rossetti"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.06377",
    "title": "Emergence of Symbols in Neural Networks for Semantic Understanding and  Communication",
    "abstract": "Being able to create meaningful symbols and proficiently use them for higher cognitive functions such as communication, reasoning, planning, etc., is essential and unique for human intelligence. Current deep neural networks are still far behind human's ability to create symbols for such higher cognitive functions. Here we propose a solution, named SEA-net, to endow neural networks with ability of symbol creation, semantic understanding and communication. SEA-net generates symbols that dynamically configure the network to perform specific tasks. These symbols capture compositional semantic information that enables the system to acquire new functions purely by symbolic manipulation or communication. In addition, we found that these self-generated symbols exhibit an intrinsic structure resembling that of natural language, suggesting a common framework underlying the generation and understanding of symbols in both human brains and artificial neural networks. We hope that it will be instrumental in producing more capable systems in the future that can synergize the strengths of connectionist and symbolic approaches for AI. ",
    "url": "https://arxiv.org/abs/2304.06377",
    "authors": [
      "Yang Chen",
      "Liangxuan Guo",
      "Shan Yu"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Computation and Language (cs.CL)",
      "Symbolic Computation (cs.SC)",
      "Neurons and Cognition (q-bio.NC)"
    ]
  },
  {
    "id": "arXiv:2304.06384",
    "title": "Multi-Subset Approach to Early Sepsis Prediction",
    "abstract": "Sepsis is a life-threatening organ malfunction caused by the host's inability to fight infection, which can lead to death without proper and immediate treatment. Therefore, early diagnosis and medical treatment of sepsis in critically ill populations at high risk for sepsis and sepsis-associated mortality are vital to providing the patient with rapid therapy. Studies show that advancing sepsis detection by 6 hours leads to earlier administration of antibiotics, which is associated with improved mortality. However, clinical scores like Sequential Organ Failure Assessment (SOFA) are not applicable for early prediction, while machine learning algorithms can help capture the progressing pattern for early prediction. Therefore, we aim to develop a machine learning algorithm that predicts sepsis onset 6 hours before it is suspected clinically. Although some machine learning algorithms have been applied to sepsis prediction, many of them did not consider the fact that six hours is not a small gap. To overcome this big gap challenge, we explore a multi-subset approach in which the likelihood of sepsis occurring earlier than 6 hours is output from a previous subset and feed to the target subset as additional features. Moreover, we use the hourly sampled data like vital signs in an observation window to derive a temporal change trend to further assist, which however is often ignored by previous studies. Our empirical study shows that both the multi-subset approach to alleviating the 6-hour gap and the added temporal trend features can help improve the performance of sepsis-related early prediction. ",
    "url": "https://arxiv.org/abs/2304.06384",
    "authors": [
      "Kevin Ewig",
      "Xiangwen Lin",
      "Tucker Stewart",
      "Katherine Stern",
      "Grant O'Keefe",
      "Ankur Teredesai",
      "Juhua Hu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06408",
    "title": "Intriguing properties of synthetic images: from generative adversarial  networks to diffusion models",
    "abstract": "Detecting fake images is becoming a major goal of computer vision. This need is becoming more and more pressing with the continuous improvement of synthesis methods based on Generative Adversarial Networks (GAN), and even more with the appearance of powerful methods based on Diffusion Models (DM). Towards this end, it is important to gain insight into which image features better discriminate fake images from real ones. In this paper we report on our systematic study of a large number of image generators of different families, aimed at discovering the most forensically relevant characteristics of real and generated images. Our experiments provide a number of interesting observations and shed light on some intriguing properties of synthetic images: (1) not only the GAN models but also the DM and VQ-GAN (Vector Quantized Generative Adversarial Networks) models give rise to visible artifacts in the Fourier domain and exhibit anomalous regular patterns in the autocorrelation; (2) when the dataset used to train the model lacks sufficient variety, its biases can be transferred to the generated images; (3) synthetic and real images exhibit significant differences in the mid-high frequency signal content, observable in their radial and angular spectral power distributions. ",
    "url": "https://arxiv.org/abs/2304.06408",
    "authors": [
      "Riccardo Corvi",
      "Davide Cozzolino",
      "Giovanni Poggi",
      "Koki Nagano",
      "Luisa Verdoliva"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06411",
    "title": "Meta-Auxiliary Learning for Adaptive Human Pose Prediction",
    "abstract": "Predicting high-fidelity future human poses, from a historically observed sequence, is decisive for intelligent robots to interact with humans. Deep end-to-end learning approaches, which typically train a generic pre-trained model on external datasets and then directly apply it to all test samples, emerge as the dominant solution to solve this issue. Despite encouraging progress, they remain non-optimal, as the unique properties (e.g., motion style, rhythm) of a specific sequence cannot be adapted. More generally, at test-time, once encountering unseen motion categories (out-of-distribution), the predicted poses tend to be unreliable. Motivated by this observation, we propose a novel test-time adaptation framework that leverages two self-supervised auxiliary tasks to help the primary forecasting network adapt to the test sequence. In the testing phase, our model can adjust the model parameters by several gradient updates to improve the generation quality. However, due to catastrophic forgetting, both auxiliary tasks typically tend to the low ability to automatically present the desired positive incentives for the final prediction performance. For this reason, we also propose a meta-auxiliary learning scheme for better adaptation. In terms of general setup, our approach obtains higher accuracy, and under two new experimental designs for out-of-distribution data (unseen subjects and categories), achieves significant improvements. ",
    "url": "https://arxiv.org/abs/2304.06411",
    "authors": [
      "Qiongjie Cui",
      "Huaijiang Sun",
      "Jianfeng Lu",
      "Bin Li",
      "Weiqing Li"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)"
    ]
  },
  {
    "id": "arXiv:2304.06427",
    "title": "In-Distribution and Out-of-Distribution Self-supervised ECG  Representation Learning for Arrhythmia Detection",
    "abstract": "This paper presents a systematic investigation into the effectiveness of Self-Supervised Learning (SSL) methods for Electrocardiogram (ECG) arrhythmia detection. We begin by conducting a novel distribution analysis on three popular ECG-based arrhythmia datasets: PTB-XL, Chapman, and Ribeiro. To the best of our knowledge, our study is the first to quantify these distributions in this area. We then perform a comprehensive set of experiments using different augmentations and parameters to evaluate the effectiveness of various SSL methods, namely SimCRL, BYOL, and SwAV, for ECG representation learning, where we observe the best performance achieved by SwAV. Furthermore, our analysis shows that SSL methods achieve highly competitive results to those achieved by supervised state-of-the-art methods. To further assess the performance of these methods on both In-Distribution (ID) and Out-of-Distribution (OOD) ECG data, we conduct cross-dataset training and testing experiments. Our comprehensive experiments show almost identical results when comparing ID and OOD schemes, indicating that SSL techniques can learn highly effective representations that generalize well across different OOD datasets. This finding can have major implications for ECG-based arrhythmia detection. Lastly, to further analyze our results, we perform detailed per-disease studies on the performance of the SSL methods on the three datasets. ",
    "url": "https://arxiv.org/abs/2304.06427",
    "authors": [
      "Sahar Soltanieh",
      "Javad Hashemi",
      "Ali Etemad"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.06430",
    "title": "Certified Zeroth-order Black-Box Defense with Robust UNet Denoiser",
    "abstract": "Certified defense methods against adversarial perturbations have been recently investigated in the black-box setting with a zeroth-order (ZO) perspective. However, these methods suffer from high model variance with low performance on high-dimensional datasets due to the ineffective design of the denoiser and are limited in their utilization of ZO techniques. To this end, we propose a certified ZO preprocessing technique for removing adversarial perturbations from the attacked image in the black-box setting using only model queries. We propose a robust UNet denoiser (RDUNet) that ensures the robustness of black-box models trained on high-dimensional datasets. We propose a novel black-box denoised smoothing (DS) defense mechanism, ZO-RUDS, by prepending our RDUNet to the black-box model, ensuring black-box defense. We further propose ZO-AE-RUDS in which RDUNet followed by autoencoder (AE) is prepended to the black-box model. We perform extensive experiments on four classification datasets, CIFAR-10, CIFAR-10, Tiny Imagenet, STL-10, and the MNIST dataset for image reconstruction tasks. Our proposed defense methods ZO-RUDS and ZO-AE-RUDS beat SOTA with a huge margin of $35\\%$ and $9\\%$, for low dimensional (CIFAR-10) and with a margin of $20.61\\%$ and $23.51\\%$ for high-dimensional (STL-10) datasets, respectively. ",
    "url": "https://arxiv.org/abs/2304.06430",
    "authors": [
      "Astha Verma",
      "Siddhesh Bangar",
      "A V Subramanyam",
      "Naman Lal",
      "Rajiv Ratn Shah",
      "Shin'ichi Satoh"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.06451",
    "title": "A robust design of time-varying internal model principle-based control  for ultra-precision tracking in a direct-drive servo stage",
    "abstract": "This paper proposes a robust design of the time-varying internal model principle-based control (TV-IMPC) for tracking sophisticated references generated by linear time-varying (LTV) autonomous systems. The existing TV-IMPC design usually requires a complete knowledge of the plant I/O (input/output) model, leading to the lack of structural robustness. To tackle this issue, we, in the paper, design a gray-box extended state observer (ESO) to estimate and compensate unknown model uncertainties and external disturbances. By means of the ESO feedback, the plant model is kept as nominal, and hence the structural robustness is achieved for the time-varying internal model. It is shown that the proposed design has bounded ESO estimation errors, which can be further adjusted by modifying the corresponding control gains. To stabilize the ESO-based TV-IMPC, a time-varying stabilizer is developed by employing Linear Matrix Inequalities (LMIs). Extensive simulation and experimental studies are conducted on a direct-drive servo stage to validate the proposed robust TV-IMPC with ultra-precision tracking performance ($\\sim 60$nm RMSE out of $\\pm80$mm stroke). ",
    "url": "https://arxiv.org/abs/2304.06451",
    "authors": [
      "Yue Cao",
      "Zhen Zhang"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.06454",
    "title": "CABM: Content-Aware Bit Mapping for Single Image Super-Resolution  Network with Large Input",
    "abstract": "With the development of high-definition display devices, the practical scenario of Super-Resolution (SR) usually needs to super-resolve large input like 2K to higher resolution (4K/8K). To reduce the computational and memory cost, current methods first split the large input into local patches and then merge the SR patches into the output. These methods adaptively allocate a subnet for each patch. Quantization is a very important technique for network acceleration and has been used to design the subnets. Current methods train an MLP bit selector to determine the propoer bit for each layer. However, they uniformly sample subnets for training, making simple subnets overfitted and complicated subnets underfitted. Therefore, the trained bit selector fails to determine the optimal bit. Apart from this, the introduced bit selector brings additional cost to each layer of the SR network. In this paper, we propose a novel method named Content-Aware Bit Mapping (CABM), which can remove the bit selector without any performance loss. CABM also learns a bit selector for each layer during training. After training, we analyze the relation between the edge information of an input patch and the bit of each layer. We observe that the edge information can be an effective metric for the selected bit. Therefore, we design a strategy to build an Edge-to-Bit lookup table that maps the edge score of a patch to the bit of each layer during inference. The bit configuration of SR network can be determined by the lookup tables of all layers. Our strategy can find better bit configuration, resulting in more efficient mixed precision networks. We conduct detailed experiments to demonstrate the generalization ability of our method. The code will be released. ",
    "url": "https://arxiv.org/abs/2304.06454",
    "authors": [
      "Senmao Tian",
      "Ming Lu",
      "Jiaming Liu",
      "Yandong Guo",
      "Yurong Chen",
      "Shunli Zhang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06461",
    "title": "Multi-Mode Online Knowledge Distillation for Self-Supervised Visual  Representation Learning",
    "abstract": "Self-supervised learning (SSL) has made remarkable progress in visual representation learning. Some studies combine SSL with knowledge distillation (SSL-KD) to boost the representation learning performance of small models. In this study, we propose a Multi-mode Online Knowledge Distillation method (MOKD) to boost self-supervised visual representation learning. Different from existing SSL-KD methods that transfer knowledge from a static pre-trained teacher to a student, in MOKD, two different models learn collaboratively in a self-supervised manner. Specifically, MOKD consists of two distillation modes: self-distillation and cross-distillation modes. Among them, self-distillation performs self-supervised learning for each model independently, while cross-distillation realizes knowledge interaction between different models. In cross-distillation, a cross-attention feature search strategy is proposed to enhance the semantic feature alignment between different models. As a result, the two models can absorb knowledge from each other to boost their representation learning performance. Extensive experimental results on different backbones and datasets demonstrate that two heterogeneous models can benefit from MOKD and outperform their independently trained baseline. In addition, MOKD also outperforms existing SSL-KD methods for both the student and teacher models. ",
    "url": "https://arxiv.org/abs/2304.06461",
    "authors": [
      "Kaiyou Song",
      "Jin Xie",
      "Shan Zhang",
      "Zimeng Luo"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06487",
    "title": "Recurrent Neural Networks as Electrical Networks, a formalization",
    "abstract": "Since the 1980s, and particularly with the Hopfield model, recurrent neural networks or RNN became a topic of great interest. The first works of neural networks consisted of simple systems of a few neurons that were commonly simulated through analogue electronic circuits. The passage from the equations to the circuits was carried out directly without justification and subsequent formalisation. The present work shows a way to formally obtain the equivalence between an analogue circuit and a neural network and formalizes the connection between both systems. We also show which are the properties that these electrical networks must satisfy. We can have confidence that the representation in terms of circuits is mathematically equivalent to the equations that represent the network. ",
    "url": "https://arxiv.org/abs/2304.06487",
    "authors": [
      "Mariano Caruso",
      "Cecilia Jarne"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2304.06502",
    "title": "Variations of Squeeze and Excitation networks",
    "abstract": "Convolutional neural networks learns spatial features and are heavily interlinked within kernels. The SE module have broken the traditional route of neural networks passing the entire result to next layer. Instead SE only passes important features to be learned with its squeeze and excitation (SE) module. We propose variations of the SE module which improvises the process of squeeze and excitation and enhances the performance. The proposed squeezing or exciting the layer makes it possible for having a smooth transition of layer weights. These proposed variations also retain the characteristics of SE module. The experimented results are carried out on residual networks and the results are tabulated. ",
    "url": "https://arxiv.org/abs/2304.06502",
    "authors": [
      "Mahendran"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2304.06504",
    "title": "Developing a Robust Computable Phenotype Definition Workflow to Describe  Health and Disease in Observational Health Research",
    "abstract": "Health informatics can inform decisions that practitioners, patients, policymakers, and researchers need to make about health and disease. Health informatics is built upon patient health data leading to the need to codify patient health information. Such standardization is required to compute population statistics (such as prevalence, incidence, etc.) that are common metrics used in fields such as epidemiology. Reliable decision-making about health and disease rests on our ability to organize, analyze, and assess data repositories that contain patient health data. While standards exist to structure and analyze patient data across patient data sources such as health information exchanges, clinical data repositories, and health data marketplaces, analogous best practices for rigorously defining patient populations in health informatics contexts do not exist. Codifying best practices for developing disease definitions could support the effective development of clinical guidelines, inform algorithms used in clinical decision support systems, and additional patient guidelines. In this paper, we present a workflow for the development of phenotype definitions. This workflow presents a series of recommendations for defining health and disease. Various examples within this paper are presented to demonstrate this workflow in health informatics contexts. ",
    "url": "https://arxiv.org/abs/2304.06504",
    "authors": [
      "Jacob S. Zelko",
      "Sarah Gasman",
      "Shenita R. Freeman",
      "Dong Yun Lee",
      "Jaan Altosaar",
      "Azza Shoaibi",
      "Gowtham Rao"
    ],
    "subjectives": [
      "Computers and Society (cs.CY)"
    ]
  },
  {
    "id": "arXiv:2304.06530",
    "title": "Robust Stability of Gaussian Process Based Moving Horizon Estimation",
    "abstract": "In this paper, we introduce a Gaussian process based moving horizon estimation (MHE) framework. The scheme is based on offline collected data and offline hyperparameter optimization. In particular, compared to standard MHE schemes, we replace the mathematical model of the system by the posterior mean of the Gaussian process. To account for the uncertainty of the learned model, we exploit the posterior variance of the learned Gaussian process in the weighting matrices of the cost function of the proposed MHE scheme. We prove practical robust exponential stability of the resulting estimator using a recently proposed Lyapunov-based proof technique. Finally, the performance of the Gaussian process based MHE scheme is illustrated via a nonlinear system. ",
    "url": "https://arxiv.org/abs/2304.06530",
    "authors": [
      "Tobias M. Wolff",
      "Victor G. Lopez",
      "Matthias A. Müller"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.06540",
    "title": "Temporal Knowledge Sharing enable Spiking Neural Network Learning from  Past and Future",
    "abstract": "Spiking neural networks have attracted extensive attention from researchers in many fields due to their brain-like information processing mechanism. The proposal of surrogate gradient enables the spiking neural networks to migrate to more complex tasks, and gradually close the gap with the conventional artificial neural networks. Current spiking neural networks utilize the output of all moments to produce the final prediction, which compromises their temporal characteristics and causes a reduction in performance and efficiency. We propose a temporal knowledge sharing approach (TKS) that enables the interaction of information between different moments, by selecting the output of specific moments to compose teacher signals to guide the training of the network along with the real labels. We have validated TKS on both static datasets CIFAR10, CIFAR100, ImageNet-1k and neuromorphic datasets DVS-CIFAR10, NCALTECH101. Our experimental results indicate that we have achieved the current optimal performance in comparison with other algorithms. Experiments on Fine-grained classification datasets further demonstrate our algorithm's superiority with CUB-200-2011, StanfordDogs, and StanfordCars. TKS algorithm helps the model to have stronger temporal generalization capability, allowing the network to guarantee performance with large time steps in the training phase and with small time steps in the testing phase. This greatly facilitates the deployment of SNNs on edge devices. ",
    "url": "https://arxiv.org/abs/2304.06540",
    "authors": [
      "Yiting Dong",
      "Dongcheng Zhao",
      "Yi Zeng"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06544",
    "title": "DNeRV: Modeling Inherent Dynamics via Difference Neural Representation  for Videos",
    "abstract": "Existing implicit neural representation (INR) methods do not fully exploit spatiotemporal redundancies in videos. Index-based INRs ignore the content-specific spatial features and hybrid INRs ignore the contextual dependency on adjacent frames, leading to poor modeling capability for scenes with large motion or dynamics. We analyze this limitation from the perspective of function fitting and reveal the importance of frame difference. To use explicit motion information, we propose Difference Neural Representation for Videos (DNeRV), which consists of two streams for content and frame difference. We also introduce a collaborative content unit for effective feature fusion. We test DNeRV for video compression, inpainting, and interpolation. DNeRV achieves competitive results against the state-of-the-art neural compression approaches and outperforms existing implicit methods on downstream inpainting and interpolation for $960 \\times 1920$ videos. ",
    "url": "https://arxiv.org/abs/2304.06544",
    "authors": [
      "Qi Zhao",
      "M. Salman Asif",
      "Zhan Ma"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06547",
    "title": "RadarGNN: Transformation Invariant Graph Neural Network for Radar-based  Perception",
    "abstract": "A reliable perception has to be robust against challenging environmental conditions. Therefore, recent efforts focused on the use of radar sensors in addition to camera and lidar sensors for perception applications. However, the sparsity of radar point clouds and the poor data availability remain challenging for current perception methods. To address these challenges, a novel graph neural network is proposed that does not just use the information of the points themselves but also the relationships between the points. The model is designed to consider both point features and point-pair features, embedded in the edges of the graph. Furthermore, a general approach for achieving transformation invariance is proposed which is robust against unseen scenarios and also counteracts the limited data availability. The transformation invariance is achieved by an invariant data representation rather than an invariant model architecture, making it applicable to other methods. The proposed RadarGNN model outperforms all previous methods on the RadarScenes dataset. In addition, the effects of different invariances on the object detection and semantic segmentation quality are investigated. The code is made available as open-source software under https://github.com/TUMFTM/RadarGNN. ",
    "url": "https://arxiv.org/abs/2304.06547",
    "authors": [
      "Felix Fent",
      "Philipp Bauerschmidt",
      "Markus Lienkamp"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06551",
    "title": "Decentralized federated learning methods for reducing communication cost  and energy consumption in UAV networks",
    "abstract": "Unmanned aerial vehicles (UAV) or drones play many roles in a modern smart city such as the delivery of goods, mapping real-time road traffic and monitoring pollution. The ability of drones to perform these functions often requires the support of machine learning technology. However, traditional machine learning models for drones encounter data privacy problems, communication costs and energy limitations. Federated Learning, an emerging distributed machine learning approach, is an excellent solution to address these issues. Federated learning (FL) allows drones to train local models without transmitting raw data. However, existing FL requires a central server to aggregate the trained model parameters of the UAV. A failure of the central server can significantly impact the overall training. In this paper, we propose two aggregation methods: Commutative FL and Alternate FL, based on the existing architecture of decentralised Federated Learning for UAV Networks (DFL-UN) by adding a unique aggregation method of decentralised FL. Those two methods can effectively control energy consumption and communication cost by controlling the number of local training epochs, local communication, and global communication. The simulation results of the proposed training methods are also presented to verify the feasibility and efficiency of the architecture compared with two benchmark methods (e.g. standard machine learning training and standard single aggregation server training). The simulation results show that the proposed methods outperform the benchmark methods in terms of operational stability, energy consumption and communication cost. ",
    "url": "https://arxiv.org/abs/2304.06551",
    "authors": [
      "Deng Pan",
      "Mohammad Ali Khoshkholghi",
      "Toktam Mahmoodi"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2304.06552",
    "title": "Beyond the Quadratic Time Barrier for Network Unreliability",
    "abstract": "Karger (STOC 1995) gave the first FPTAS for the network (un)reliability problem, setting in motion research over the next three decades that obtained increasingly faster running times, eventually leading to a $\\tilde{O}(n^2)$-time algorithm (Karger, STOC 2020). This represented a natural culmination of this line of work because the algorithmic techniques used can enumerate $\\Theta(n^2)$ (near)-minimum cuts. In this paper, we go beyond this quadratic barrier and obtain a faster algorithm for the network unreliability problem. Our algorithm runs in $m^{1+o(1)} + \\tilde{O}(n^{1.5})$ time. Our main contribution is a new estimator for network unreliability in very reliable graphs. These graphs are usually the bottleneck for network unreliability since the disconnection event is elusive. Our estimator is obtained by defining an appropriate importance sampling subroutine on a dual spanning tree packing of the graph. To complement this estimator for very reliable graphs, we use recursive contraction for moderately reliable graphs. We show that an interleaving of sparsification and contraction can be used to obtain a better parametrization of the recursive contraction algorithm that yields a faster running time matching the one obtained for the very reliable case. ",
    "url": "https://arxiv.org/abs/2304.06552",
    "authors": [
      "Ruoxu Cen",
      "William He",
      "Jason Li",
      "Debmalya Panigrahi"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2304.06560",
    "title": "Real-Time Wheel Detection and Rim Classification in Automotive  Production",
    "abstract": "This paper proposes a novel approach to real-time automatic rim detection, classification, and inspection by combining traditional computer vision and deep learning techniques. At the end of every automotive assembly line, a quality control process is carried out to identify any potential defects in the produced cars. Common yet hazardous defects are related, for example, to incorrectly mounted rims. Routine inspections are mostly conducted by human workers that are negatively affected by factors such as fatigue or distraction. We have designed a new prototype to validate whether all four wheels on a single car match in size and type. Additionally, we present three comprehensive open-source databases, CWD1500, WHEEL22, and RB600, for wheel, rim, and bolt detection, as well as rim classification, which are free-to-use for scientific purposes. ",
    "url": "https://arxiv.org/abs/2304.06560",
    "authors": [
      "Roman Stanek",
      "Tomas Kerepecky",
      "Adam Novozamsky",
      "Filip Sroubek",
      "Barbara Zitova",
      "Jan Flusser"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06566",
    "title": "NeRD: Neural field-based Demosaicking",
    "abstract": "We introduce NeRD, a new demosaicking method for generating full-color images from Bayer patterns. Our approach leverages advancements in neural fields to perform demosaicking by representing an image as a coordinate-based neural network with sine activation functions. The inputs to the network are spatial coordinates and a low-resolution Bayer pattern, while the outputs are the corresponding RGB values. An encoder network, which is a blend of ResNet and U-net, enhances the implicit neural representation of the image to improve its quality and ensure spatial consistency through prior learning. Our experimental results demonstrate that NeRD outperforms traditional and state-of-the-art CNN-based methods and significantly closes the gap to transformer-based methods. ",
    "url": "https://arxiv.org/abs/2304.06566",
    "authors": [
      "Tomas Kerepecky",
      "Filip Sroubek",
      "Adam Novozamsky",
      "Jan Flusser"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2304.06575",
    "title": "Adversarial Examples from Dimensional Invariance",
    "abstract": "Adversarial examples have been found for various deep as well as shallow learning models, and have at various times been suggested to be either fixable model-specific bugs, or else inherent dataset feature, or both. We present theoretical and empirical results to show that adversarial examples are approximate discontinuities resulting from models that specify approximately bijective maps $f: \\Bbb R^n \\to \\Bbb R^m; n \\neq m$ over their inputs, and this discontinuity follows from the topological invariance of dimension. ",
    "url": "https://arxiv.org/abs/2304.06575",
    "authors": [
      "Benjamin L. Badger"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Numerical Analysis (math.NA)"
    ]
  },
  {
    "id": "arXiv:2304.06631",
    "title": "Modeling Cell Size Distribution with Heterogeneous Flux Balance Analysis",
    "abstract": "For over two decades, Flux Balance Analysis (FBA) has been successfully used for predicting growth rates and intracellular reaction rates in microbiological metabolism. An aspect that is often omitted from this analysis, is segregation or heterogeneity between different cells. In this work, we propose an extended FBA method to model cell size distributions in balanced growth conditions. Hereto, a mathematical description of the concept of balanced growth in terms of cell mass distribution is presented. The cell mass distribution, quantified by the Number Density Function (NDF), is affected by cell growth and cell division. An optimization program is formulated in which the NDF, average cell culture growth rate and reaction rates per cell mass are treated as optimization variables. As qualitative proof of concept, the methodology is illustrated on a core carbon model of Escherichia coli under aerobic growth conditions. This illustrates feasibility and applications of this method, while indicating some shortcomings intrinsic to the simplified biomass structuring and the time invariant approach. ",
    "url": "https://arxiv.org/abs/2304.06631",
    "authors": [
      "Michiel Busschaert",
      "Florence H. Vermeire",
      "Steffen Waldherr"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2304.06645",
    "title": "Robustness Measures and Monitors for Time Window Temporal Logic",
    "abstract": "Temporal logics (TLs) have been widely used to formalize interpretable tasks for cyber-physical systems. Time Window Temporal Logic (TWTL) has been recently proposed as a specification language for dynamical systems. In particular, it can easily express robotic tasks, and it allows for efficient, automata-based verification and synthesis of control policies for such systems. In this paper, we define two quantitative semantics for this logic, and two corresponding monitoring algorithms, which allow for real-time quantification of satisfaction of formulas by trajectories of discrete-time systems. We demonstrate the new semantics and their runtime monitors on numerical examples. ",
    "url": "https://arxiv.org/abs/2304.06645",
    "authors": [
      "Ahmad Ahmad",
      "Cristian-Ioan Vasile",
      "Roberto Tron",
      "Calin Belta"
    ],
    "subjectives": [
      "Formal Languages and Automata Theory (cs.FL)",
      "Logic in Computer Science (cs.LO)"
    ]
  },
  {
    "id": "arXiv:2304.06653",
    "title": "G2T: A simple but versatile framework for topic modeling based on  pretrained language model and community detection",
    "abstract": "It has been reported that clustering-based topic models, which cluster high-quality sentence embeddings with an appropriate word selection method, can generate better topics than generative probabilistic topic models. However, these approaches suffer from the inability to select appropriate parameters and incomplete models that overlook the quantitative relation between words with topics and topics with text. To solve these issues, we propose graph to topic (G2T), a simple but effective framework for topic modelling. The framework is composed of four modules. First, document representation is acquired using pretrained language models. Second, a semantic graph is constructed according to the similarity between document representations. Third, communities in document semantic graphs are identified, and the relationship between topics and documents is quantified accordingly. Fourth, the word--topic distribution is computed based on a variant of TFIDF. Automatic evaluation suggests that G2T achieved state-of-the-art performance on both English and Chinese documents with different lengths. Human judgements demonstrate that G2T can produce topics with better interpretability and coverage than baselines. In addition, G2T can not only determine the topic number automatically but also give the probabilistic distribution of words in topics and topics in documents. Finally, G2T is publicly available, and the distillation experiments provide instruction on how it works. ",
    "url": "https://arxiv.org/abs/2304.06653",
    "authors": [
      "Leihang Zhang",
      "Jiapeng Liu",
      "Qiang Yan"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06656",
    "title": "Improved Approximations for Relative Survivable Network Design",
    "abstract": "One of the most important and well-studied settings for network design is edge-connectivity requirements. This encompasses uniform demands such as the Minimum $k$-Edge-Connected Spanning Subgraph problem as well as nonuniform demands such as the Survivable Network Design problem (SND). In a recent paper by [Dinitz, Koranteng, Kortsarz APPROX '22] , the authors observed that a weakness of these formulations is that it does not enable one to consider fault-tolerance in graphs that have just one small cut. To remedy this, they introduced new variants of these problems under the notion \"relative\" fault-tolerance. Informally, this requires not that two nodes are connected if there are a bounded number of faults (as in the classical setting), but that two nodes are connected if there are a bounded number of faults and the two nodes are connected in the underlying graph post-faults. The problem is already highly non-trivial even for the case of a single demand. Due to difficulties introduced by this new notion of fault-tolerance, the results in [Dinitz, Koranteng, Kortsarz APPROX '22] are quite limited. For the Relative Survivable Network Design problem (RSND), when the demands are not uniform they give a nontrivial result only when there is a single demand with a connectivity requirement of $3$: a non-optimal $27/4$-approximation. We strengthen this result in two significant ways: We give a $2$-approximation for RSND where all requirements are at most $3$, and a $2^{O(k^2)}$-approximation for RSND with a single demand of arbitrary value $k$. To achieve these results, we first use the \"cactus representation'' of minimum cuts to give a lossless reduction to normal SND. Second, we extend the techniques of [Dinitz, Koranteng, Kortsarz APPROX '22] to prove a generalized and more complex version of their structure theorem, which we then use to design a recursive approximation algorithm. ",
    "url": "https://arxiv.org/abs/2304.06656",
    "authors": [
      "Michael Dinitz",
      "Ama Koranteng",
      "Guy Kortsarz",
      "Zeev Nutov"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2304.06670",
    "title": "Do deep neural networks have an inbuilt Occam's razor?",
    "abstract": "The remarkable performance of overparameterized deep neural networks (DNNs) must arise from an interplay between network architecture, training algorithms, and structure in the data. To disentangle these three components, we apply a Bayesian picture, based on the functions expressed by a DNN, to supervised learning. The prior over functions is determined by the network, and is varied by exploiting a transition between ordered and chaotic regimes. For Boolean function classification, we approximate the likelihood using the error spectrum of functions on data. When combined with the prior, this accurately predicts the posterior, measured for DNNs trained with stochastic gradient descent. This analysis reveals that structured data, combined with an intrinsic Occam's razor-like inductive bias towards (Kolmogorov) simple functions that is strong enough to counteract the exponential growth of the number of functions with complexity, is a key to the success of DNNs. ",
    "url": "https://arxiv.org/abs/2304.06670",
    "authors": [
      "Chris Mingard",
      "Henry Rees",
      "Guillermo Valle-Pérez",
      "Ard A. Louis"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2304.06696",
    "title": "Improving novelty detection with generative adversarial networks on hand  gesture data",
    "abstract": "We propose a novel way of solving the issue of classification of out-of-vocabulary gestures using Artificial Neural Networks (ANNs) trained in the Generative Adversarial Network (GAN) framework. A generative model augments the data set in an online fashion with new samples and stochastic target vectors, while a discriminative model determines the class of the samples. The approach was evaluated on the UC2017 SG and UC2018 DualMyo data sets. The generative models performance was measured with a distance metric between generated and real samples. The discriminative models were evaluated by their accuracy on trained and novel classes. In terms of sample generation quality, the GAN is significantly better than a random distribution (noise) in mean distance, for all classes. In the classification tests, the baseline neural network was not capable of identifying untrained gestures. When the proposed methodology was implemented, we found that there is a trade-off between the detection of trained and untrained gestures, with some trained samples being mistaken as novelty. Nevertheless, a novelty detection accuracy of 95.4% or 90.2% (depending on the data set) was achieved with just 5% loss of accuracy on trained classes. ",
    "url": "https://arxiv.org/abs/2304.06696",
    "authors": [
      "Miguel Simão",
      "Pedro Neto",
      "Olivier Gibaru"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06703",
    "title": "Gated Multi-Resolution Transfer Network for Burst Restoration and  Enhancement",
    "abstract": "Burst image processing is becoming increasingly popular in recent years. However, it is a challenging task since individual burst images undergo multiple degradations and often have mutual misalignments resulting in ghosting and zipper artifacts. Existing burst restoration methods usually do not consider the mutual correlation and non-local contextual information among burst frames, which tends to limit these approaches in challenging cases. Another key challenge lies in the robust up-sampling of burst frames. The existing up-sampling methods cannot effectively utilize the advantages of single-stage and progressive up-sampling strategies with conventional and/or recent up-samplers at the same time. To address these challenges, we propose a novel Gated Multi-Resolution Transfer Network (GMTNet) to reconstruct a spatially precise high-quality image from a burst of low-quality raw images. GMTNet consists of three modules optimized for burst processing tasks: Multi-scale Burst Feature Alignment (MBFA) for feature denoising and alignment, Transposed-Attention Feature Merging (TAFM) for multi-frame feature aggregation, and Resolution Transfer Feature Up-sampler (RTFU) to up-scale merged features and construct a high-quality output image. Detailed experimental analysis on five datasets validates our approach and sets a state-of-the-art for burst super-resolution, burst denoising, and low-light burst enhancement. ",
    "url": "https://arxiv.org/abs/2304.06703",
    "authors": [
      "Nancy Mehta",
      "Akshay Dudhane",
      "Subrahmanyam Murala",
      "Syed Waqas Zamir",
      "Salman Khan",
      "Fahad Shahbaz Khan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06706",
    "title": "Zip-NeRF: Anti-Aliased Grid-Based Neural Radiance Fields",
    "abstract": "Neural Radiance Field training can be accelerated through the use of grid-based representations in NeRF's learned mapping from spatial coordinates to colors and volumetric density. However, these grid-based approaches lack an explicit understanding of scale and therefore often introduce aliasing, usually in the form of jaggies or missing scene content. Anti-aliasing has previously been addressed by mip-NeRF 360, which reasons about sub-volumes along a cone rather than points along a ray, but this approach is not natively compatible with current grid-based techniques. We show how ideas from rendering and signal processing can be used to construct a technique that combines mip-NeRF 360 and grid-based models such as Instant NGP to yield error rates that are 8% - 76% lower than either prior technique, and that trains 22x faster than mip-NeRF 360. ",
    "url": "https://arxiv.org/abs/2304.06706",
    "authors": [
      "Jonathan T. Barron",
      "Ben Mildenhall",
      "Dor Verbin",
      "Pratul P. Srinivasan",
      "Peter Hedman"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06710",
    "title": "Remote Sensing Change Detection With Transformers Trained from Scratch",
    "abstract": "Current transformer-based change detection (CD) approaches either employ a pre-trained model trained on large-scale image classification ImageNet dataset or rely on first pre-training on another CD dataset and then fine-tuning on the target benchmark. This current strategy is driven by the fact that transformers typically require a large amount of training data to learn inductive biases, which is insufficient in standard CD datasets due to their small size. We develop an end-to-end CD approach with transformers that is trained from scratch and yet achieves state-of-the-art performance on four public benchmarks. Instead of using conventional self-attention that struggles to capture inductive biases when trained from scratch, our architecture utilizes a shuffled sparse-attention operation that focuses on selected sparse informative regions to capture the inherent characteristics of the CD data. Moreover, we introduce a change-enhanced feature fusion (CEFF) module to fuse the features from input image pairs by performing a per-channel re-weighting. Our CEFF module aids in enhancing the relevant semantic changes while suppressing the noisy ones. Extensive experiments on four CD datasets reveal the merits of the proposed contributions, achieving gains as high as 14.27\\% in intersection-over-union (IoU) score, compared to the best-published results in the literature. Code is available at \\url{https://github.com/mustansarfiaz/ScratchFormer}. ",
    "url": "https://arxiv.org/abs/2304.06710",
    "authors": [
      "Mubashir Noman",
      "Mustansar Fiaz",
      "Hisham Cholakkal",
      "Sanath Narayan",
      "Rao Muhammad Anwer",
      "Salman Khan",
      "Fahad Shahbaz Khan"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.06715",
    "title": "Evaluating the Robustness of Interpretability Methods through  Explanation Invariance and Equivariance",
    "abstract": "Interpretability methods are valuable only if their explanations faithfully describe the explained model. In this work, we consider neural networks whose predictions are invariant under a specific symmetry group. This includes popular architectures, ranging from convolutional to graph neural networks. Any explanation that faithfully explains this type of model needs to be in agreement with this invariance property. We formalize this intuition through the notion of explanation invariance and equivariance by leveraging the formalism from geometric deep learning. Through this rigorous formalism, we derive (1) two metrics to measure the robustness of any interpretability method with respect to the model symmetry group; (2) theoretical robustness guarantees for some popular interpretability methods and (3) a systematic approach to increase the invariance of any interpretability method with respect to a symmetry group. By empirically measuring our metrics for explanations of models associated with various modalities and symmetry groups, we derive a set of 5 guidelines to allow users and developers of interpretability methods to produce robust explanations. ",
    "url": "https://arxiv.org/abs/2304.06715",
    "authors": [
      "Jonathan Crabbé",
      "Mihaela van der Schaar"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Computational Geometry (cs.CG)"
    ]
  },
  {
    "id": "arXiv:2304.06719",
    "title": "RoboBEV: Towards Robust Bird's Eye View Perception under Corruptions",
    "abstract": "The recent advances in camera-based bird's eye view (BEV) representation exhibit great potential for in-vehicle 3D perception. Despite the substantial progress achieved on standard benchmarks, the robustness of BEV algorithms has not been thoroughly examined, which is critical for safe operations. To bridge this gap, we introduce RoboBEV, a comprehensive benchmark suite that encompasses eight distinct corruptions, including Bright, Dark, Fog, Snow, Motion Blur, Color Quant, Camera Crash, and Frame Lost. Based on it, we undertake extensive evaluations across a wide range of BEV-based models to understand their resilience and reliability. Our findings indicate a strong correlation between absolute performance on in-distribution and out-of-distribution datasets. Nonetheless, there are considerable variations in relative performance across different approaches. Our experiments further demonstrate that pre-training and depth-free BEV transformation has the potential to enhance out-of-distribution robustness. Additionally, utilizing long and rich temporal information largely helps with robustness. Our findings provide valuable insights for designing future BEV models that can achieve both accuracy and robustness in real-world deployments. ",
    "url": "https://arxiv.org/abs/2304.06719",
    "authors": [
      "Shaoyuan Xie",
      "Lingdong Kong",
      "Wenwei Zhang",
      "Jiawei Ren",
      "Liang Pan",
      "Kai Chen",
      "Ziwei Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.06038",
    "title": "Knowledge-Distilled Graph Neural Networks for Personalized Epileptic  Seizure Detection",
    "abstract": "Wearable devices for seizure monitoring detection could significantly improve the quality of life of epileptic patients. However, existing solutions that mostly rely on full electrode set of electroencephalogram (EEG) measurements could be inconvenient for every day use. In this paper, we propose a novel knowledge distillation approach to transfer the knowledge from a sophisticated seizure detector (called the teacher) trained on data from the full set of electrodes to learn new detectors (called the student). They are both providing lightweight implementations and significantly reducing the number of electrodes needed for recording the EEG. We consider the case where the teacher and the student seizure detectors are graph neural networks (GNN), since these architectures actively use the connectivity information. We consider two cases (a) when a single student is learnt for all the patients using preselected channels; and (b) when personalized students are learnt for every individual patient, with personalized channel selection using a Gumbelsoftmax approach. Our experiments on the publicly available Temple University Hospital EEG Seizure Data Corpus (TUSZ) show that both knowledge-distillation and personalization play significant roles in improving performance of seizure detection, particularly for patients with scarce EEG data. We observe that using as few as two channels, we are able to obtain competitive seizure detection performance. This, in turn, shows the potential of our approach in more realistic scenario of wearable devices for personalized monitoring of seizures, even with few recordings. ",
    "url": "https://arxiv.org/abs/2304.06038",
    "authors": [
      "Qinyue Zheng",
      "Arun Venkitaraman",
      "Simona Petravic",
      "Pascal Frossard"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06169",
    "title": "Neural Network Algorithm for Intercepting Targets Moving Along Known  Trajectories by a Dubins' Car",
    "abstract": "The task of intercepting a target moving along a rectilinear or circular trajectory by a Dubins' car is formulated as a time-optimal control problem with an arbitrary direction of the car's velocity at the interception moment. To solve this problem and to synthesize interception trajectories, neural network methods of unsupervised learning based on the Deep Deterministic Policy Gradient algorithm are used. The analysis of the obtained control laws and interception trajectories in comparison with the analytical solutions of the interception problem is performed. The mathematical modeling for the parameters of the target movement that the neural network had not seen before during training is carried out. Model experiments are conducted to test the stability of the neural solution. The effectiveness of using neural network methods for the synthesis of interception trajectories for given classes of target movements is shown. ",
    "url": "https://arxiv.org/abs/2304.06169",
    "authors": [
      "Ivan Nasonov",
      "Andrey Galyaev",
      "Andrey Medvedev"
    ],
    "subjectives": [
      "Optimization and Control (math.OC)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.06227",
    "title": "Quasi Real-Time Autonomous Satellite Detection and Orbit Estimation",
    "abstract": "A method of near real-time detection and tracking of resident space objects (RSOs) using a convolutional neural network (CNN) and linear quadratic estimator (LQE) is proposed. Advances in machine learning architecture allow the use of low-power/cost embedded devices to perform complex classification tasks. In order to reduce the costs of tracking systems, a low-cost embedded device will be used to run a CNN detection model for RSOs in unresolved images captured by a gray-scale camera and small telescope. Detection results computed in near real-time are then passed to an LQE to compute tracking updates for the telescope mount, resulting in a fully autonomous method of optical RSO detection and tracking. Keywords: Space Domain Awareness, Neural Networks, Real-Time, Object Detection, Embedded Systems. ",
    "url": "https://arxiv.org/abs/2304.06227",
    "authors": [
      "Jarred Jordan",
      "Daniel Posada",
      "Matthew Gillette",
      "David Zuehlke",
      "Troy Henderson"
    ],
    "subjectives": [
      "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.06244",
    "title": "Asymmetrically-powered Neural Image Compression with Shallow Decoders",
    "abstract": "Neural image compression methods have seen increasingly strong performance in recent years. However, they suffer orders of magnitude higher computational complexity compared to traditional codecs, which stands in the way of real-world deployment. This paper takes a step forward in closing this gap in decoding complexity by adopting shallow or even linear decoding transforms. To compensate for the resulting drop in compression performance, we exploit the often asymmetrical computation budget between encoding and decoding, by adopting more powerful encoder networks and iterative encoding. We theoretically formalize the intuition behind, and our experimental results establish a new frontier in the trade-off between rate-distortion and decoding complexity for neural image compression. Specifically, we achieve rate-distortion performance competitive with the established mean-scale hyperprior architecture of Minnen et al. (2018), while reducing the overall decoding complexity by 80 %, or over 90 % for the synthesis transform alone. Our code can be found at https://github.com/mandt-lab/shallow-ntc. ",
    "url": "https://arxiv.org/abs/2304.06244",
    "authors": [
      "Yibo Yang",
      "Stephan Mandt"
    ],
    "subjectives": [
      "Image and Video Processing (eess.IV)",
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06253",
    "title": "Enhancing Model Learning and Interpretation Using Multiple Molecular  Graph Representations for Compound Property and Activity Prediction",
    "abstract": "Graph neural networks (GNNs) demonstrate great performance in compound property and activity prediction due to their capability to efficiently learn complex molecular graph structures. However, two main limitations persist including compound representation and model interpretability. While atom-level molecular graph representations are commonly used because of their ability to capture natural topology, they may not fully express important substructures or functional groups which significantly influence molecular properties. Consequently, recent research proposes alternative representations employing reduction techniques to integrate higher-level information and leverages both representations for model learning. However, there is still a lack of study about different molecular graph representations on model learning and interpretation. Interpretability is also crucial for drug discovery as it can offer chemical insights and inspiration for optimization. Numerous studies attempt to include model interpretation to explain the rationale behind predictions, but most of them focus solely on individual prediction with little analysis of the interpretation on different molecular graph representations. This research introduces multiple molecular graph representations that incorporate higher-level information and investigates their effects on model learning and interpretation from diverse perspectives. The results indicate that combining atom graph representation with reduced molecular graph representation can yield promising model performance. Furthermore, the interpretation results can provide significant features and potential substructures consistently aligning with background knowledge. These multiple molecular graph representations and interpretation analysis can bolster model comprehension and facilitate relevant applications in drug discovery. ",
    "url": "https://arxiv.org/abs/2304.06253",
    "authors": [
      "Apakorn Kengkanna",
      "Masahito Ohue"
    ],
    "subjectives": [
      "Biomolecules (q-bio.BM)",
      "Machine Learning (cs.LG)",
      "Molecular Networks (q-bio.MN)"
    ]
  },
  {
    "id": "arXiv:2304.06326",
    "title": "Understanding Overfitting in Adversarial Training in Kernel Regression",
    "abstract": "Adversarial training and data augmentation with noise are widely adopted techniques to enhance the performance of neural networks. This paper investigates adversarial training and data augmentation with noise in the context of regularized regression in a reproducing kernel Hilbert space (RKHS). We establish the limiting formula for these techniques as the attack and noise size, as well as the regularization parameter, tend to zero. Based on this limiting formula, we analyze specific scenarios and demonstrate that, without appropriate regularization, these two methods may have larger generalization error and Lipschitz constant than standard kernel regression. However, by selecting the appropriate regularization parameter, these two methods can outperform standard kernel regression and achieve smaller generalization error and Lipschitz constant. These findings support the empirical observations that adversarial training can lead to overfitting, and appropriate regularization methods, such as early stopping, can alleviate this issue. ",
    "url": "https://arxiv.org/abs/2304.06326",
    "authors": [
      "Teng Zhang",
      "Kang Li"
    ],
    "subjectives": [
      "Machine Learning (stat.ML)",
      "Machine Learning (cs.LG)",
      "Statistics Theory (math.ST)"
    ]
  },
  {
    "id": "arXiv:2304.06453",
    "title": "On a generalization of median graphs: $k$-median graphs",
    "abstract": "Median graphs are connected graphs in which for all three vertices there is a unique vertex that belongs to shortest paths between each pair of these three vertices. To be more formal, a graph $G$ is a median graph if, for all $\\mu, u,v\\in V(G)$, it holds that $|I(\\mu,u)\\cap I(\\mu,v)\\cap I(u,v)|=1$ where $I(x,y)$ denotes the set of all vertices that lie on shortest paths connecting $x$ and $y$. In this paper we are interested in a natural generalization of median graphs, called $k$-median graphs. A graph $G$ is a $k$-median graph, if there are $k$ vertices $\\mu_1,\\dots,\\mu_k\\in V(G)$ such that, for all $u,v\\in V(G)$, it holds that $|I(\\mu_i,u)\\cap I(\\mu_i,v)\\cap I(u,v)|=1$, $1\\leq i\\leq k$. By definition, every median graph with $n$ vertices is an $n$-median graph. We provide several characterizations of $k$-median graphs that, in turn, are used to provide many novel characterizations of median graphs. ",
    "url": "https://arxiv.org/abs/2304.06453",
    "authors": [
      "Marc Hellmuth",
      "Sandhya Thekkumpadan Puthiyaveedu"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2304.06474",
    "title": "Attention-based Learning for Sleep Apnea and Limb Movement Detection  using Wi-Fi CSI Signals",
    "abstract": "Wi-Fi channel state information (CSI) has become a promising solution for non-invasive breathing and body motion monitoring during sleep. Sleep disorders of apnea and periodic limb movement disorder (PLMD) are often unconscious and fatal. The existing researches detect abnormal sleep disorders in impractically controlled environments. Moreover, it leads to compelling challenges to classify complex macro- and micro-scales of sleep movements as well as entangled similar waveforms of cases of apnea and PLMD. In this paper, we propose the attention-based learning for sleep apnea and limb movement detection (ALESAL) system that can jointly detect sleep apnea and PLMD under different sleep postures across a variety of patients. ALESAL contains antenna-pair and time attention mechanisms for mitigating the impact of modest antenna pairs and emphasizing the duration of interest, respectively. Performance results show that our proposed ALESAL system can achieve a weighted F1-score of 84.33, outperforming the other existing non-attention based methods of support vector machine and deep multilayer perceptron. ",
    "url": "https://arxiv.org/abs/2304.06474",
    "authors": [
      "Chi-Che Chang",
      "An-Hung Hsiao",
      "Li-Hsiang Shen",
      "Kai-Ten Feng",
      "Chia-Yu Chen"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06485",
    "title": "CoRe-Sleep: A Multimodal Fusion Framework for Time Series Robust to  Imperfect Modalities",
    "abstract": "Sleep abnormalities can have severe health consequences. Automated sleep staging, i.e. labelling the sequence of sleep stages from the patient's physiological recordings, could simplify the diagnostic process. Previous work on automated sleep staging has achieved great results, mainly relying on the EEG signal. However, often multiple sources of information are available beyond EEG. This can be particularly beneficial when the EEG recordings are noisy or even missing completely. In this paper, we propose CoRe-Sleep, a Coordinated Representation multimodal fusion network that is particularly focused on improving the robustness of signal analysis on imperfect data. We demonstrate how appropriately handling multimodal information can be the key to achieving such robustness. CoRe-Sleep tolerates noisy or missing modalities segments, allowing training on incomplete data. Additionally, it shows state-of-the-art performance when testing on both multimodal and unimodal data using a single model on SHHS-1, the largest publicly available study that includes sleep stage labels. The results indicate that training the model on multimodal data does positively influence performance when tested on unimodal data. This work aims at bridging the gap between automated analysis tools and their clinical utility. ",
    "url": "https://arxiv.org/abs/2304.06485",
    "authors": [
      "Konstantinos Kontras",
      "Christos Chatzichristos",
      "Huy Phan",
      "Johan Suykens",
      "Maarten De Vos"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06493",
    "title": "Fault diagnosis for PV arrays considering dust impact based on  transformed graphical feature of characteristic curves and convolutional  neural network with CBAM modules",
    "abstract": "Various faults can occur during the operation of PV arrays, and both the dust-affected operating conditions and various diode configurations make the faults more complicated. However, current methods for fault diagnosis based on I-V characteristic curves only utilize partial feature information and often rely on calibrating the field characteristic curves to standard test conditions (STC). It is difficult to apply it in practice and to accurately identify multiple complex faults with similarities in different blocking diodes configurations of PV arrays under the influence of dust. Therefore, a novel fault diagnosis method for PV arrays considering dust impact is proposed. In the preprocessing stage, the Isc-Voc normalized Gramian angular difference field (GADF) method is presented, which normalizes and transforms the resampled PV array characteristic curves from the field including I-V and P-V to obtain the transformed graphical feature matrices. Then, in the fault diagnosis stage, the model of convolutional neural network (CNN) with convolutional block attention modules (CBAM) is designed to extract fault differentiation information from the transformed graphical matrices containing full feature information and to classify faults. And different graphical feature transformation methods are compared through simulation cases, and different CNN-based classification methods are also analyzed. The results indicate that the developed method for PV arrays with different blocking diodes configurations under various operating conditions has high fault diagnosis accuracy and reliability. ",
    "url": "https://arxiv.org/abs/2304.06493",
    "authors": [
      "Jiaqi Qu",
      "Lu Wei",
      "Qiang Sun",
      "Hamidreza Zareipour",
      "Zheng Qian"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.06495",
    "title": "An embedding for EEG signals learned using a triplet loss",
    "abstract": "Neurophysiological time series recordings like the electroencephalogram (EEG) or local field potentials are obtained from multiple sensors. They can be decoded by machine learning models in order to estimate the ongoing brain state of a patient or healthy user. In a brain-computer interface (BCI), this decoded brain state information can be used with minimal time delay to either control an application, e.g., for communication or for rehabilitation after stroke, or to passively monitor the ongoing brain state of the subject, e.g., in a demanding work environment. A specific challenge in such decoding tasks is posed by the small dataset sizes in BCI compared to other domains of machine learning like computer vision or natural language processing. A possibility to tackle classification or regression problems in BCI despite small training data sets is through transfer learning, which utilizes data from other sessions, subjects or even datasets to train a model. In this exploratory study, we propose novel domain-specific embeddings for neurophysiological data. Our approach is based on metric learning and builds upon the recently proposed ladder loss. Using embeddings allowed us to benefit, both from the good generalisation abilities and robustness of deep learning and from the fast training of classical machine learning models for subject-specific calibration. In offline analyses using EEG data of 14 subjects, we tested the embeddings' feasibility and compared their efficiency with state-of-the-art deep learning models and conventional machine learning pipelines. In summary, we propose the use of metric learning to obtain pre-trained embeddings of EEG-BCI data as a means to incorporate domain knowledge and to reach competitive performance on novel subjects with minimal calibration requirements. ",
    "url": "https://arxiv.org/abs/2304.06495",
    "authors": [
      "Pierre Guetschel",
      "Théodore Papadopoulo",
      "Michael Tangermann"
    ],
    "subjectives": [
      "Signal Processing (eess.SP)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2108.00596",
    "title": "GTNet:Guided Transformer Network for Detecting Human-Object Interactions",
    "abstract": " Comments: accepted for presentation in Pattern Recognition and Tracking XXXIV at SPIE commerce+ defence Program ",
    "url": "https://arxiv.org/abs/2108.00596",
    "authors": [
      "A S M Iftekhar",
      "Satish Kumar",
      "R. Austin McEver",
      "Suya You",
      "B. S. Manjunath"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2201.02775",
    "title": "ADI: Adversarial Dominating Inputs in Vertical Federated Learning  Systems",
    "abstract": " Title: ADI: Adversarial Dominating Inputs in Vertical Federated Learning  Systems ",
    "url": "https://arxiv.org/abs/2201.02775",
    "authors": [
      "Qi Pang",
      "Yuanyuan Yuan",
      "Shuai Wang",
      "Wenting Zheng"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2201.03142",
    "title": "Deletion to Scattered Graph Classes II -- Improved FPT Algorithms for  Deletion to Pairs of Graph Classes",
    "abstract": " Comments: 34 pages, 3 figures, accepted for publication in Journal of Computer and System Sciences ",
    "url": "https://arxiv.org/abs/2201.03142",
    "authors": [
      "Ashwin Jacob",
      "Diptapriyo Majumdar",
      "Venkatesh Raman"
    ],
    "subjectives": [
      "Data Structures and Algorithms (cs.DS)"
    ]
  },
  {
    "id": "arXiv:2201.10034",
    "title": "Self-Supervised Point Cloud Registration with Deep Versatile Descriptors",
    "abstract": " Title: Self-Supervised Point Cloud Registration with Deep Versatile Descriptors ",
    "url": "https://arxiv.org/abs/2201.10034",
    "authors": [
      "Dongrui Liu",
      "Chuanchuan Chen",
      "Changqing Xu",
      "Robert Qiu",
      "Lei Chu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2203.05298",
    "title": "Synchronizing Boolean networks asynchronously",
    "abstract": " Comments: 41 pages, v2: two figures added, accepted in JCSS ",
    "url": "https://arxiv.org/abs/2203.05298",
    "authors": [
      "Julio Aracena",
      "Adrien Richard",
      "Lilian Salinas"
    ],
    "subjectives": [
      "Combinatorics (math.CO)",
      "Discrete Mathematics (cs.DM)"
    ]
  },
  {
    "id": "arXiv:2208.04405",
    "title": "Recovering the Graph Underlying Networked Dynamical Systems under  Partial Observability: A Deep Learning Approach",
    "abstract": " Comments: Accepted at The 37th AAAI Conference on Artificial Intelligence (main track) ",
    "url": "https://arxiv.org/abs/2208.04405",
    "authors": [
      "Sérgio Machado",
      "Anirudh Sridhar",
      "Paulo Gil",
      "Jorge Henriques",
      "José M. F. Moura",
      "Augusto Santos"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Multiagent Systems (cs.MA)",
      "Methodology (stat.ME)"
    ]
  },
  {
    "id": "arXiv:2209.03716",
    "title": "Enhancing the Self-Universality for Transferable Targeted Attacks",
    "abstract": " Title: Enhancing the Self-Universality for Transferable Targeted Attacks ",
    "url": "https://arxiv.org/abs/2209.03716",
    "authors": [
      "Zhipeng Wei",
      "Jingjing Chen",
      "Zuxuan Wu",
      "Yu-Gang Jiang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2209.08446",
    "title": "Dual Contrastive Network for Sequential Recommendation with User and  Item-Centric Perspectives",
    "abstract": " Comments: 25 pages ",
    "url": "https://arxiv.org/abs/2209.08446",
    "authors": [
      "Guanyu Lin",
      "Chen Gao",
      "Yinfeng Li",
      "Yu Zheng",
      "Zhiheng Li",
      "Depeng Jin",
      "Dong Li",
      "Jianye Hao",
      "Yong Li"
    ],
    "subjectives": [
      "Information Retrieval (cs.IR)"
    ]
  },
  {
    "id": "arXiv:2209.15511",
    "title": "Sphere-Guided Training of Neural Implicit Surfaces",
    "abstract": " Comments: Accepted at CVPR 2023 ",
    "url": "https://arxiv.org/abs/2209.15511",
    "authors": [
      "Andreea Dogaru",
      "Andrei Timotei Ardelean",
      "Savva Ignatyev",
      "Egor Zakharov",
      "Evgeny Burnaev"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Graphics (cs.GR)"
    ]
  },
  {
    "id": "arXiv:2210.00993",
    "title": "Efficient Bayes Inference in Neural Networks through Adaptive Importance  Sampling",
    "abstract": " Title: Efficient Bayes Inference in Neural Networks through Adaptive Importance  Sampling ",
    "url": "https://arxiv.org/abs/2210.00993",
    "authors": [
      "Yunshi Huang",
      "Emilie Chouzenoux",
      "Victor Elvira",
      "Jean-Christophe Pesquet"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (stat.ML)"
    ]
  },
  {
    "id": "arXiv:2210.01732",
    "title": "Robust Multi-Agent Coordination from CaTL+ Specifications",
    "abstract": " Comments: Accepted to ACC 2023 ",
    "url": "https://arxiv.org/abs/2210.01732",
    "authors": [
      "Wenliang Liu",
      "Kevin Leahy",
      "Zachary Serlin",
      "Calin Belta"
    ],
    "subjectives": [
      "Systems and Control (eess.SY)"
    ]
  },
  {
    "id": "arXiv:2210.16598",
    "title": "Self-Supervised Predictive Coding with Multimodal Fusion for Patient  Deterioration Prediction in Fine-grained Time Resolution",
    "abstract": " Comments: Accepted as oral contribution at Trustworthy Machine Learning for Healthcare Workshop, ICLR 2023 ",
    "url": "https://arxiv.org/abs/2210.16598",
    "authors": [
      "Kwanhyung Lee",
      "John Won",
      "Heejung Hyun",
      "Sangchul Hahn",
      "Edward Choi",
      "Joohyung Lee"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.01668",
    "title": "Quantum Similarity Testing with Convolutional Neural Networks",
    "abstract": " Title: Quantum Similarity Testing with Convolutional Neural Networks ",
    "url": "https://arxiv.org/abs/2211.01668",
    "authors": [
      "Ya-Dong Wu",
      "Yan Zhu",
      "Ge Bai",
      "Yuexuan Wang",
      "Giulio Chiribella"
    ],
    "subjectives": [
      "Quantum Physics (quant-ph)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2211.11610",
    "title": "Tensor4D : Efficient Neural 4D Decomposition for High-fidelity Dynamic  Reconstruction and Rendering",
    "abstract": " Title: Tensor4D : Efficient Neural 4D Decomposition for High-fidelity Dynamic  Reconstruction and Rendering ",
    "url": "https://arxiv.org/abs/2211.11610",
    "authors": [
      "Ruizhi Shao",
      "Zerong Zheng",
      "Hanzhang Tu",
      "Boning Liu",
      "Hongwen Zhang",
      "Yebin Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2211.11761",
    "title": "From Node Interaction to Hop Interaction: New Effective and Scalable  Graph Learning Paradigm",
    "abstract": " Comments: accepted by CVPR 2023 ",
    "url": "https://arxiv.org/abs/2211.11761",
    "authors": [
      "Jie Chen",
      "Zilong Li",
      "Yin Zhu",
      "Junping Zhang",
      "Jian Pu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2212.03793",
    "title": "RADAR: A TTP-based Extensible, Explainable, and Effective System for  Network Traffic Analysis and Malware Detection",
    "abstract": " Title: RADAR: A TTP-based Extensible, Explainable, and Effective System for  Network Traffic Analysis and Malware Detection ",
    "url": "https://arxiv.org/abs/2212.03793",
    "authors": [
      "Yashovardhan Sharma",
      "Simon Birnbach",
      "Ivan Martinovic"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)"
    ]
  },
  {
    "id": "arXiv:2212.04362",
    "title": "CiaoSR: Continuous Implicit Attention-in-Attention Network for  Arbitrary-Scale Image Super-Resolution",
    "abstract": " Comments: CVPR 2023 ",
    "url": "https://arxiv.org/abs/2212.04362",
    "authors": [
      "Jiezhang Cao",
      "Qin Wang",
      "Yongqin Xian",
      "Yawei Li",
      "Bingbing Ni",
      "Zhiming Pi",
      "Kai Zhang",
      "Yulun Zhang",
      "Radu Timofte",
      "Luc Van Gool"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2212.05961",
    "title": "RPN: A Word Vector Level Data Augmentation Algorithm in Deep Learning  for Language Understanding",
    "abstract": " Comments: 8 pages, 3 figures ",
    "url": "https://arxiv.org/abs/2212.05961",
    "authors": [
      "Zhengqing Yuan",
      "Zhuanzhe Zhao",
      "Yongming Liu",
      "Xiaolong Zhang",
      "Xuecong Hou",
      "Yue Wang",
      "Huiwen Xue"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.06008",
    "title": "Who Evaluates the Evaluators? On Automatic Metrics for Assessing  AI-based Offensive Code Generators",
    "abstract": " Title: Who Evaluates the Evaluators? On Automatic Metrics for Assessing  AI-based Offensive Code Generators ",
    "url": "https://arxiv.org/abs/2212.06008",
    "authors": [
      "Pietro Liguori",
      "Cristina Improta",
      "Roberto Natella",
      "Bojan Cukic",
      "Domenico Cotroneo"
    ],
    "subjectives": [
      "Software Engineering (cs.SE)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2212.09967",
    "title": "Learning Subgrid-scale Models with Neural Ordinary Differential  Equations",
    "abstract": " Comments: 28 pages, 21 figures, 2 tables ",
    "url": "https://arxiv.org/abs/2212.09967",
    "authors": [
      "Shinhoo Kang",
      "Emil M. Constantinescu"
    ],
    "subjectives": [
      "Numerical Analysis (math.NA)",
      "Computational Engineering, Finance, and Science (cs.CE)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.04017",
    "title": "Reconstructing Individual Data Points in Federated Learning Hardened  with Differential Privacy and Secure Aggregation",
    "abstract": " Title: Reconstructing Individual Data Points in Federated Learning Hardened  with Differential Privacy and Secure Aggregation ",
    "url": "https://arxiv.org/abs/2301.04017",
    "authors": [
      "Franziska Boenisch",
      "Adam Dziedzic",
      "Roei Schuster",
      "Ali Shahin Shamsabadi",
      "Ilia Shumailov",
      "Nicolas Papernot"
    ],
    "subjectives": [
      "Cryptography and Security (cs.CR)",
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2301.07805",
    "title": "Multi-target multi-camera vehicle tracking using transformer-based  camera link model and spatial-temporal information",
    "abstract": " Title: Multi-target multi-camera vehicle tracking using transformer-based  camera link model and spatial-temporal information ",
    "url": "https://arxiv.org/abs/2301.07805",
    "authors": [
      "Hsiang-Wei Huang",
      "Cheng-Yen Yang",
      "Jenq-Neng Hwang"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2301.08243",
    "title": "Self-Supervised Learning from Images with a Joint-Embedding Predictive  Architecture",
    "abstract": " Comments: 2023 IEEE/CVF International Conference on Computer Vision ",
    "url": "https://arxiv.org/abs/2301.08243",
    "authors": [
      "Mahmoud Assran",
      "Quentin Duval",
      "Ishan Misra",
      "Piotr Bojanowski",
      "Pascal Vincent",
      "Michael Rabbat",
      "Yann LeCun",
      "Nicolas Ballas"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Image and Video Processing (eess.IV)"
    ]
  },
  {
    "id": "arXiv:2302.00942",
    "title": "Efficient Graph Field Integrators Meet Point Clouds",
    "abstract": " Title: Efficient Graph Field Integrators Meet Point Clouds ",
    "url": "https://arxiv.org/abs/2302.00942",
    "authors": [
      "Krzysztof Choromanski",
      "Arijit Sehanobish",
      "Han Lin",
      "Yunfan Zhao",
      "Eli Berger",
      "Tetiana Parshakova",
      "Alvin Pan",
      "David Watkins",
      "Tianyi Zhang",
      "Valerii Likhosherstov",
      "Somnath Basu Roy Chowdhury",
      "Avinava Dubey",
      "Deepali Jain",
      "Tamas Sarlos",
      "Snigdha Chaturvedi",
      "Adrian Weller"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2302.05823",
    "title": "Data efficiency and extrapolation trends in neural network interatomic  potentials",
    "abstract": " Title: Data efficiency and extrapolation trends in neural network interatomic  potentials ",
    "url": "https://arxiv.org/abs/2302.05823",
    "authors": [
      "Joshua A. Vita",
      "Daniel Schwalbe-Koda"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Chemical Physics (physics.chem-ph)"
    ]
  },
  {
    "id": "arXiv:2302.12115",
    "title": "Dynamic realization of miscellaneous profile services in elastic optical  networks using spectrum partitioning",
    "abstract": " Comments: 11 pages, 13 figures ",
    "url": "https://arxiv.org/abs/2302.12115",
    "authors": [
      "Behnam Gheysari",
      "Arash Rezaee",
      "Lotfollah Beygi"
    ],
    "subjectives": [
      "Networking and Internet Architecture (cs.NI)"
    ]
  },
  {
    "id": "arXiv:2302.13741",
    "title": "Hulk: Graph Neural Networks for Optimizing Regionally Distributed  Computing Systems",
    "abstract": " Comments: 16 pages,10 figures, Accepted by Intelligent Systems Conference(IntelliSys 2023) ",
    "url": "https://arxiv.org/abs/2302.13741",
    "authors": [
      "Zhengqing Yuan",
      "Huiwen Xue",
      "Chao Zhang",
      "Yongming Liu"
    ],
    "subjectives": [
      "Distributed, Parallel, and Cluster Computing (cs.DC)",
      "Computation and Language (cs.CL)"
    ]
  },
  {
    "id": "arXiv:2303.02155",
    "title": "ChatGPT and Other Large Language Models as Evolutionary Engines for  Online Interactive Collaborative Game Design",
    "abstract": " Comments: (Submitted) ",
    "url": "https://arxiv.org/abs/2303.02155",
    "authors": [
      "Pier Luca Lanzi",
      "Daniele Loiacono"
    ],
    "subjectives": [
      "Artificial Intelligence (cs.AI)",
      "Human-Computer Interaction (cs.HC)",
      "Machine Learning (cs.LG)",
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2303.10875",
    "title": "Hardware-Aware Graph Neural Network Automated Design for Edge Computing  Platforms",
    "abstract": " Comments: Accepted by DAC'23 ",
    "url": "https://arxiv.org/abs/2303.10875",
    "authors": [
      "Ao Zhou",
      "Jianlei Yang",
      "Yingjie Qi",
      "Yumeng Shi",
      "Tong Qiao",
      "Weisheng Zhao",
      "Chunming Hu"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2303.16100",
    "title": "Energy-efficient Task Adaptation for NLP Edge Inference Leveraging  Heterogeneous Memory Architectures",
    "abstract": " Comments: 10 pages, 6 figures, 3 tables ",
    "url": "https://arxiv.org/abs/2303.16100",
    "authors": [
      "Zirui Fu",
      "Aleksandre Avaliani",
      "Marco Donato"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)",
      "Hardware Architecture (cs.AR)"
    ]
  },
  {
    "id": "arXiv:2303.16195",
    "title": "When to be critical? Performance and evolvability in different regimes  of neural Ising agents",
    "abstract": " Comments: arXiv admin note: substantial text overlap with arXiv:2103.12184 ",
    "url": "https://arxiv.org/abs/2303.16195",
    "authors": [
      "Sina Khajehabdollahi",
      "Jan Prosi",
      "Georg Martius",
      "Anna Levina"
    ],
    "subjectives": [
      "Neural and Evolutionary Computing (cs.NE)"
    ]
  },
  {
    "id": "arXiv:2303.17597",
    "title": "Robo3D: Towards Robust and Reliable 3D Perception against Corruptions",
    "abstract": " Comments: Preprint; 33 pages, 26 figures, 26 tables; Code at this https URL ",
    "url": "https://arxiv.org/abs/2303.17597",
    "authors": [
      "Lingdong Kong",
      "Youquan Liu",
      "Xin Li",
      "Runnan Chen",
      "Wenwei Zhang",
      "Jiawei Ren",
      "Liang Pan",
      "Kai Chen",
      "Ziwei Liu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.01897",
    "title": "InfluencerRank: Discovering Effective Influencers via Graph  Convolutional Attentive Recurrent Neural Networks",
    "abstract": " Comments: ICWSM 2023 ",
    "url": "https://arxiv.org/abs/2304.01897",
    "authors": [
      "Seungbae Kim",
      "Jyun-Yu Jiang",
      "Jinyoung Han",
      "Wei Wang"
    ],
    "subjectives": [
      "Social and Information Networks (cs.SI)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.02398",
    "title": "Robust Secure Transmission for Active RIS Enabled Symbiotic Radio  Multicast Communications",
    "abstract": " Comments: 32 Pages, 12 figures, accepted to IEEE Transactions on Wireless Communications ",
    "url": "https://arxiv.org/abs/2304.02398",
    "authors": [
      "Bin Lyu",
      "Chao Zhou",
      "Shimin Gong",
      "Dinh Thai Hoang",
      "Ying-chang Liang"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.03198",
    "title": "RFAConv: Innovating Spatital Attention and Standard Convolutional  Operation",
    "abstract": " Comments: 14 pages, 5 figures ",
    "url": "https://arxiv.org/abs/2304.03198",
    "authors": [
      "Xin Zhang",
      "Chen Liu",
      "Degang Yang",
      "Tingting Song",
      "Yichen Ye",
      "Ke Li",
      "Yingze Song"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  },
  {
    "id": "arXiv:2304.04063",
    "title": "Counterfactual Explanations of Neural Network-Generated Response Curves",
    "abstract": " Comments: Accepted to appear in the International Joint Conference on Neural Networks 2023 ",
    "url": "https://arxiv.org/abs/2304.04063",
    "authors": [
      "Giorgio Morales",
      "John Sheppard"
    ],
    "subjectives": [
      "Machine Learning (cs.LG)"
    ]
  },
  {
    "id": "arXiv:2304.05119",
    "title": "Device Activity Detection in mMTC with Low-Resolution ADC: A New  Protocol",
    "abstract": " Comments: Submitted to IEEE for possible publication ",
    "url": "https://arxiv.org/abs/2304.05119",
    "authors": [
      "Zhaorui Wang",
      "Ya-Feng Liu",
      "Ziyue Wang",
      "Liang Liu",
      "Haoyuan Pan",
      "Shuguang Cui"
    ],
    "subjectives": [
      "Information Theory (cs.IT)",
      "Signal Processing (eess.SP)"
    ]
  },
  {
    "id": "arXiv:2304.05860",
    "title": "Learning Homographic Disambiguation Representation for Neural Machine  Translation",
    "abstract": " Title: Learning Homographic Disambiguation Representation for Neural Machine  Translation ",
    "url": "https://arxiv.org/abs/2304.05860",
    "authors": [
      "Weixuan Wang",
      "Wei Peng",
      "Qun Liu"
    ],
    "subjectives": [
      "Computation and Language (cs.CL)",
      "Artificial Intelligence (cs.AI)"
    ]
  },
  {
    "id": "arXiv:2304.05869",
    "title": "LMR: Lane Distance-Based Metric for Trajectory Prediction",
    "abstract": " Comments: Accepted to the 2023 IEEE Intelligent Vehicles Symposium (IV 2023) ",
    "url": "https://arxiv.org/abs/2304.05869",
    "authors": [
      "Julian Schmidt",
      "Thomas Monninger",
      "Julian Jordan",
      "Klaus Dietmayer"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)",
      "Artificial Intelligence (cs.AI)",
      "Machine Learning (cs.LG)",
      "Robotics (cs.RO)"
    ]
  },
  {
    "id": "arXiv:2304.06002",
    "title": "Fast vehicle detection algorithm based on lightweight YOLO7-tiny",
    "abstract": " Title: Fast vehicle detection algorithm based on lightweight YOLO7-tiny ",
    "url": "https://arxiv.org/abs/2304.06002",
    "authors": [
      "Bo Li",
      "YiHua Chen",
      "Hao Xu"
    ],
    "subjectives": [
      "Computer Vision and Pattern Recognition (cs.CV)"
    ]
  }
]